 /*       SIST ENDRET 08/05-98 12.38.24 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/03-98 12.56.35 AV   JDA7339                  */00000010
 /*       SIST ENDRET 05/12-97 12.44.37 AV   JDA7339                  */00000020
 /*       SIST ENDRET 27/11-97 11.50.27 AV   JDA7339                  */00000030
 /*       SIST ENDRET 24/10-97 11.58.06 AV   JDA7339                  */00000040
 /*       SIST ENDRET 03/10-97 09.28.22 AV   JDA7339                  */00000050
 /*       SIST ENDRET 02/10-97 08.48.32 AV   JDA7339                  */00000060
 /*       SIST ENDRET 19/08-97 14.36.20 AV   TSB7339                  */00000070
 /*       SIST ENDRET 15/08-97 09.07.14 AV   SPA7339                  */00000080
 /*       SIST ENDRET 14/08-97 07.31.04 AV   HLA7339                  */00000090
 /*       SIST ENDRET 13/08-97 15.08.23 AV   HLA7339                  */00000100
 /*       SIST ENDRET 04/08-97 14.10.25 AV   JDA7339                  */00000110
 /*       SIST ENDRET 16/05-97 10.51.16 AV   JDA7339                  */00000120
 /*       SIST ENDRET 25/02-97 11.46.04 AV   JDA7339                  */00000130
 /*       SIST ENDRET 02/10-96 10.43.16 AV   JDA0310                  */00000140
 /*       SIST ENDRET 11/07-96 13.24.35 AV   HLB0310                  */00000150
 /*       SIST ENDRET 23/04-96 14.37.19 AV   HLB0310                  */00000160
 /*       SIST ENDRET 22/03-96 11.08.43 AV   HLB0310                  */00000170
 /*       SIST ENDRET 20/03-96 16.28.24 AV   HLB0310                  */00000180
 /*       SIST ENDRET 05/02-96 12.54.20 AV   JDA0310                  */00000190
 /*       SIST ENDRET 27/11-95 14.52.41 AV   JDA0310                  */00000200
 /*       SIST ENDRET 12/10-95 14.05.41 AV   JDA0310                  */00000210
 /*       SIST ENDRET 17/11-94 12.06.49 AV   JDA0310                  */00000220
 /*       SIST ENDRET 20/10-94 16.44.59 AV   TSB0310                  */00000230
 /*       SIST ENDRET 19/08-94 09.42.34 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 14/07-94 13.21.55 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 18/06-84 09.15.22 AV   LUNDEBY                  */00000260
 /* ***************************************************************** */00000270
 %SKIP;                                                                 00000280
 /* ***************************************************************** */00000290
 /*IDENTIFIKASJON:                                                    */00000300
 /* **********************                                            */00000310
 /*  PROGRAM-IDENT : R0010410 - FORESPØRSEL - HOVEDPROG I CICS/PLI    */00000320
 /*  PROGRAM-SPRÅK : PLI                                              */00000330
 /*  PROGRAMMERER  : JAN KRISTENSEN                                   */00000340
 /*  PROGRAMMET BLE LAGET : AUGUST 1982                               */00000350
 /*  ENDRINGSDATO : 18.01.89                                          */00000360
 /*  ENDRINGEN GJELDER: YRKESSKADE / AFP                              */00000370
 /*  ENDRINGEN BLE UTFØRT AV :TRUDE                                   */00000380
 /*  ENDRINGSDATO : 20.02.91                                          */00000390
 /*  ENDRINGEN GJELDER: Få VEKK X_INNTEKT_OPPL. PÅ SKJERMBILDET (F-I) */00000400
 /*  ENDRINGEN BLE UTFØRT AV :O.G.                                    */00000410
 /*  ENDRINGSDATO : 12.01.94                                          */00000420
 /*  ENDRINGEN GJELDER: FÅ FREM TEKST FOR 'OMSORG  BARN/ANDRE'        */00000430
 /*  ENDRINGEN BLE UTFØRT AV :O.G.                                    */00000440
 /* ***************************************************************** */00000450
 /*HENSIKT:                                                           */00000460
 /* **********                                                        */00000470
 /*    SKRIVER UT SKJERMBILDER MED OPPLYSNINGER FRA RF-BASEN.         */00000480
 /*    PROGRAMMET AKTIVISERES NÅR OPERATØR HAR FYLT UT MENY-BILDET    */00000490
 /*    FOR FORESPØRSEL - MAP S001015, MAPSET S001013.                 */00000500
 /*    NY MAP MED DEN ØNSKEDE OPPLYSNINGSTYPE BLIR SKREVET            */00000510
 /*    UT - MAPSET S001043.                                           */00000520
 /*    OPERATØREN KAN NÅ VELGE MELLOM FORSKJELLIGE OPPLYSNINGS-       */00000530
 /*    TYPER, SISTE/NEST SISTE STATUS, OG SKIFTE OVER TIL EN          */00000540
 /*    ANNEN FAMILIEPERSON.                                           */00000550
 /*    OPPBYGGING AV TRANSAKSJONER, OG UTSKRIVINGEN AV DISSE SKJER    */00000560
 /*    I PROGRAM 0411 OG 0412.                                        */00000570
 /* ***************************************************************** */00000580
 /*PROGRAMTILKNYTTING:                                                */00000590
 /* ********************                                              */00000600
 /*    PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE = 'F410',    */00000610
 /*    DENNE TRANSKODE BLIR SATT I R0010301.                          */00000620
 /*    BRUK :       EXEC CICS RETURN                                  */00000630
 /*                 TRANSID('F410') COMMAREA(KOM_OMR);                */00000640
 /*                                                                   */00000650
 /*    EXEC LINK TIL: R0010301   VALG AV FUNKSJON                     */00000660
 /*                   R0010411   BYGG_TRANS_LISTE                     */00000670
 /*                   R0010412   TRANS_LISTE_TIL_SKJERM               */00000680
 /*                   R0013110   LES INNTEKTER/PENSJONSHIST/STATUS    */00000690
 /*                   R0015201   LES TRANSAKSJON                      */00000700
 /*                   R0019906   ER FNR ENDRET ?                      */00000710
 /*    FUNKSJONER SOM BRUKES :                                        */00000720
 /*                   R0019902   F_KJØNN                              */00000730
 /*                   R0019904   F_GYLDIG_FNR                         */00000740
 /*                   R0019910   F_NUMERISK                           */00000750
 /*                   R0019913   F_SNU_DATO                           */00000760
 /*                   R0014163   F_INNTEKT_POENG                      */00000770
 /* ***************************************************************** */00000780
 /*DATASETTOPPLYSNINGER:                                              */00000790
 /* ***********************                                           */00000800
 /*    LESER FNR-ENDRINGSREGISTERET                                   */00000810
 /*    LESER RF-BASEN                                                 */00000820
 /* ***************************************************************** */00000830
 /*FEILMELDINGER:                                                     */00000840
 /* *******************                                               */00000850
 /*    FEILMELDINGER LEGGES INN I FELTET 'MAP_MELDING'.               */00000860
 /*    I PROSEDYREN 'MAP_SEND' SKRIVES MELDINGEN UT PÅ MENYBILDET     */00000870
 /*    FOR FORESPØRSEL (MAP S001015) ELLER SVARBILDET (MAPSET S00104) */00000880
 /* ***************************************************************** */00000890
 /*ENDRET : 8.3.88 SL */                                                00000900
 /*     INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ */    00000910
 /*     OM FNR ER ENDRET (9906). */                                     00000920
 /* ***************************************************************** */00000930
 R001041: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000940
 %PAGE;                                                                 00000950
 %INCLUDE S00101;    /* MENY  MAP - SETTET        */                    00000960
 %PAGE;                                                                 00000970
 %INCLUDE S00104;    /* FORESPØRSEL MAP - SETTET  */                    00000980
 %PAGE;                                                                 00000990
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00001000
 %PAGE;                                                                 00001010
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00001020
 %PAGE;                                                                 00001030
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00001040
 %PAGE;                                                                 00001050
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00001060
 %PAGE;                                                                 00001070
 %INCLUDE P0019924;         /* G_V_TAB            */                    00001080
 %PAGE;                                                                 00001090
 %INCLUDE P0019925;         /* G_TAB              */                    00001100
 %PAGE;                                                                 00001110
   DCL                                                                  00001120
 1 B01 BASED(B01_PEKER),                                                00001130
 %INCLUDE P0019921;    /* B01-OMRÅDE (BASED)        */                  00001140
 %PAGE;                                                                 00001150
   DCL                                                                  00001160
 1 B02 BASED(B02_PEKER),                                                00001170
 %INCLUDE P0019921;    /* B02-OMRÅDE (BASED)        */                  00001180
 %PAGE;                                                                 00001190
 %INCLUDE P0012002;   /* PCB - PEKER - OMR    */                        00001200
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001210
 %INCLUDE P0012003;                         /* PCB                 */   00001220
                                                                        00001230
  DCL                                                                   00001240
     W01_PSB_NAVN                CHAR (8)       INIT('B001R001');       00001250
  DCL                                                                   00001260
     PLITDLI ENTRY;                                                     00001270
                                                                        00001280
    /* ************************************************************** */00001290
    /*                                                                */00001300
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00001310
    /*                                                                */00001320
    /* ************************************************************** */00001330
                                                                        00001340
    %INCLUDE DLIUIB;                                                    00001350
                                                                        00001360
                                                                        00001370
                                                                        00001380
       DCL 1 W01_PINT_AKT            UNALIGNED BASED(PINT_PTR),         00001390
    %INCLUDE P0019928;                              /* INNTEKTS-SEGM. */00001400
       DCL 1 W01_PINT_UT             UNALIGNED,                         00001410
    %INCLUDE P0019928;                              /* INNTEKTS-SEGM. */00001420
       DCL   W01_IO                  CHAR (280);                        00001430
                                                                        00001440
    /* ************************************************************** */00001450
    /*                                                                */00001460
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001470
    /*                                                                */00001480
    /* ************************************************************** */00001490
                                                                        00001500
 DCL 1  W01_DLI_PARAM,                                                  00001510
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001520
        2   W02_GN                  CHAR (4)   INIT ('GN  '),           00001530
        2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),                00001540
        2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                00001550
        2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                00001560
        2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5);                00001570
                                                                        00001580
                                                                        00001590
    /* ************************************************************** */00001600
    /*                                                                */00001610
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001620
    /*                                                                */00001630
    /* ************************************************************** */00001640
                                                                        00001650
 DCL    SSA_UQUAL              STATIC      CHAR (9) INIT ((9)' ');      00001660
                                                                        00001670
 DCL 1  SSA1_RF0PERSN          STATIC,                                  00001680
        2    HDEL                          CHAR (17)  INIT              00001690
             ('RF0PERSN(FNR     '),                                     00001700
        2    REL_OP                        CHAR (2)   INIT (' ='),      00001710
        2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),      00001720
        2    HP                            CHAR (1)   INIT (')' );      00001730
                                                                        00001740
                                                                        00001750
 DCL                                                                    00001760
    QUENAME CHAR(8),                                                    00001770
       TERMID CHAR(4) DEF QUENAME POS(1),                               00001780
       REST   CHAR(4) DEF QUENAME POS(5);                               00001790
                                                                        00001800
 DCL                                                                    00001810
    DATE                   BUILTIN,                                     00001820
    VERIFY                 BUILTIN,                                     00001830
    CSTG                   BUILTIN,                                     00001840
    UNSPEC                 BUILTIN,                                     00001850
    COMMAREA_PEKER         PTR,                                         00001860
    MAPSET_PTR             PTR,                                         00001870
    BMSMAPBR               PTR,                                         00001880
    PINT_PTR               PTR,                                         00001890
    OPPLYSNINGSTYPE        CHAR(1) INIT(' '),                           00001900
    TRANSKODE_VED_START    CHAR(4),                                     00001910
    BEHANDLE_NESTE_F       CHAR(4),                                     00001920
    BEHANDLE_NESTE_B       CHAR(4),                                     00001930
    BEHANDLE_NESTE_Y       CHAR(4),                                     00001940
    MAP_MELDING            CHAR(78) INIT((78)' '),                      00001950
    PIC_Z9_SLASH_Y9        PIC'Z9/Y9',                                  00001960
    PIC_3                  PIC'(3)9',                                   00001970
    X_CHAR                 PIC '99',                                    00001980
    PIC_ZZ9                PIC'ZZ9',                                    00001990
    PIC_9V99               PIC'9V.99',                                  00002000
    PIC_ZZ9V99             PIC'ZZ9V.99',                                00002010
    PIC_ZZZZ9              PIC'ZZZZ9',                                  00002020
    PIC_ZZZZZZZZ9          PIC'ZZZZZZZZ9',                              00002030
    PIC_4                  PIC'(4)9',                                   00002040
    PIC_6                  PIC'(6)9',                                   00002050
    PIC_7                  PIC'(7)9',                                   00002060
    PIC_11                 PIC'(11)9',                                  00002070
    FÅR DEF PIC_11 POS (5) PIC'99',                                     00002080
    FIXED_DEC3             FIXED DEC(3),                                00002090
    FIXED_DEC6             FIXED DEC(6) UNAL,                           00002100
    FIXED_DEC9             FIXED DEC(9),                                00002110
    FIXED_DEC5_4           FIXED DEC(5,4),                              00002120
    MAP_SET_NAME           CHAR(7),                                     00002130
    STATUS_SKIFTE          BIT(1) INIT ('0'B),                          00002140
    SISTE_SIDE             BIT(1) INIT ('0'B),                          00002150
    GJØR_GN                BIT(1) INIT ('1'B),                          00002160
    I                      PIC'Z9',                                     00002170
    INNTEKTSGR             PIC'(7)9'  INIT(0),                          00002180
    NESTE_ÅR               PIC'99',                                     00002190
    INNTEKT_START          PIC'99' INIT(63),                            00002200
    START                  PIC'Z9' INIT(1),                             00002210
    AP_START               PIC'Z9' INIT(1),                             00002220
    UP_START1              PIC'Z9' INIT(1),                             00002230
    YP_START1              PIC'Z9' INIT(1),                             00002240
    SIDE_TELL              PIC'999' INIT(1),                            00002250
    FIXED_BIN15            FIXED BIN(15),                               00002260
    LENGTH                 FIXED BIN(15),                               00002270
    INDEX_1                FIXED BIN(15),                               00002280
    INDEX_2                FIXED BIN(15),                               00002290
    LOW_CHAR_BASED         CHAR(300) BASED(BMSMAPBR),                   00002300
    ADDR                   BUILTIN;                                     00002310
                                                                        00002320
 DCL 1 FNR_REG,                                                         00002330
       2 FNR1              FIXED DEC (11)     INIT ( 0 ),               00002340
       2 FNR2              FIXED DEC (11)     INIT ( 0 ),               00002350
       2 BRUKERID          CHAR      ( 4)     INIT ('' );               00002360
                                                                        00002370
 DCL GRUNN_OMR1         CHAR      (1202);                               00002380
 DCL GRUNN_OMR2         CHAR      (1202);                               00002390
 DCL GRUNN_IDENT        CHAR      ( 8);                                 00002400
 DCL CICSINFO           CHAR      (16);                                 00002410
                                                                        00002420
 FORTSETT:                                                              00002430
                                                                        00002440
 TERMID   = EIBTRMID;                                                   00002450
 REST     = 'COMA';                                                     00002460
 PINT_PTR = ADDR(W01_IO);                                               00002470
                                                                        00002480
   IF EIBCALEN = 0 THEN                                                 00002490
      EXEC CICS READQ TS QUEUE(QUENAME) SET(COMMAREA_PEKER)             00002500
                                      LENGTH(LENGTH);                   00002510
                                                                        00002520
    EXEC CICS DELETEQ TS QUEUE(QUENAME) NOHANDLE;                       00002530
                                                                        00002540
 ALLOCATE GV_TAB_RE;                                                    00002550
 ALLOCATE G_TAB_RE                                                 ;    00002560
 ALLOCATE  B01;                                                         00002570
 ALLOCATE  B02;                                                         00002580
                                                                        00002590
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00002600
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00002610
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00002620
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00002630
 KOM_OMR.GV_PEKER                     = ADDR (GRUNN_OMR1             ) ;00002640
 KOM_OMR.G_PEKER                      = ADDR (GRUNN_OMR2             ); 00002650
                                                                        00002660
 TRANSKODE_VED_START = TRANSKODE;                                       00002670
 GV_TAB_RE   =  ''  ;                                                   00002680
 G_TAB_RE    =  ''  ;                                                   00002690
 B01         =  ''  ;                                                   00002700
 B02         =  ''  ;                                                   00002710
 W01_PSB_NAVN     = DIV_PARAM_OMR.PSB_NAVN;                             00002720
                                                                        00002730
 EXEC CICS LOAD PROGRAM('S001043') SET(MAPSET_PTR); /* FORESP-MAPSET */ 00002740
 ALLOCATE  LOW_CHAR_BASED;                                              00002750
                                                                        00002760
 EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW) SIGNAL(OVERFLOW);        00002770
                                                                        00002780
                                                                        00002790
                                                                        00002800
                                                                        00002810
 GRUNN_IDENT                     = 'P0019924';                          00002820
                                                                        00002830
 CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                         00002840
                                                                        00002850
 GRUNN_IDENT                     = 'P0019925';                          00002860
                                                                        00002870
 CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                         00002880
                                                                        00002890
 FNR_REG.BRUKERID = DIV_PARAM_OMR.CICS_IND;  /*OBS SL+HL*/              00002900
 CICSINFO = CICS_NAVN; /* ENDERET SP 05.02.92        */                 00002910
                                                                        00002920
                                                                        00002930
                                                                        00002940
 SELECT (TRANS_OPPL_OMR.TRANSKODE);                                     00002950
   WHEN('F410')                                                         00002960
     DO;                                                                00002970
       CALL KONTROLL_INPUT_HOVED_MAP;                                   00002980
       CALL SJEKK_MELDING;                                              00002990
                                                                        00003000
       /*****  HER GÅR EN UT DERSOM FEIL  *******/                      00003010
                                                                        00003020
    /* IF ^ (OPPLYSNINGSTYPE = 'T' !                                    00003030
             OPPLYSNINGSTYPE = 'A') THEN */                             00003040
          DO;                                                           00003050
             CALL ADDRESSER_B01;                                        00003060
             CALL OPPRETT_STATUS_UTEN_TRANS;                            00003070
             CALL SJEKK_MELDING;                                        00003080
          END;                                                          00003090
     END;                                                               00003100
   WHEN('F41T','F41S','F41P','F41B','F41Y','F41I','F41F')               00003110
     DO;                                                                00003120
       CALL ADDRESSER_B01;                                              00003130
       CALL KONTROLL_INPUT_TRAILER;                                     00003140
       CALL SJEKK_MELDING;                                              00003150
     END;                                                               00003160
   OTHERWISE                                                            00003170
     ;  /* ALLE TRE TRANSER  */                                         00003180
 END;   /*  SELECT (TRANSKODE)  */                                      00003190
                                                                        00003200
 CALL ADDRESSER_B01;                                                    00003210
                                                                        00003220
 CALL  FINN_SEARCH_FNR;                                                 00003230
                                                                        00003240
 IF B01.RF0PERSN.FNR(SØKER_IND) = 0 &  ^(OPPLYSNINGSTYPE = 'T' !        00003250
                                         OPPLYSNINGSTYPE = 'A' !        00003260
                                         OPPLYSNINGSTYPE = 'X') THEN    00003270
    CALL OPPRETT_STATUS_UTEN_TRANS;                                     00003280
                                                                        00003290
 ELSE IF OPPLYSNINGSTYPE = 'T' !                                        00003300
         OPPLYSNINGSTYPE = 'A' THEN                                     00003310
    CALL FORBEREDE_TRANS;                                               00003320
                                                                        00003330
 CALL SJEKK_MELDING;                                                    00003340
                                                                        00003350
                                                                        00003360
 CALL SELECT_OPPLYSNINGSTYPE;                                           00003370
                                                                        00003380
 CALL SJEKK_MELDING;                                                    00003390
                                                                        00003400
                                                                        00003410
 CALL MAP_SEND;                                                         00003420
                                                                        00003430
 RETURN:                                                                00003440
                                                                        00003450
 IF TRANS_OPPL_OMR.TRANSKODE ^= 'F410' THEN                             00003460
   DO;                                                                  00003470
     POS_I_B01 = SØKER_IND;                                             00003480
     IF B01.STATUS.VIRK_DATO_ÅM(SØKER_IND) = 0 THEN                     00003490
        B01 = '';                                                       00003500
   END;                                                                 00003510
                                                                        00003520
 /*FORELØPIG TILLEGG : */                                               00003530
                                                                        00003540
 /*HL*/ S001015I.OPPLYSNINGSTYPEI = OPPLYSNINGSTYPE;                    00003550
                                                                        00003560
 EXEC CICS RETURN TRANSID(TRANS_OPPL_OMR.TRANSKODE)                     00003570
                                              COMMAREA(KOM_OMR);        00003580
                                                                        00003590
                                                                        00003600
                                                                        00003610
 /**********   HER ER HOVEDSTYRING SLUTT   ***********/                 00003620
                                                                        00003630
                                                                        00003640
 SELECT_OPPLYSNINGSTYPE:                                                00003650
   PROC;                                                                00003660
     SELECT (OPPLYSNINGSTYPE);                                          00003670
       WHEN('S','P','B','Y','F')                                        00003680
         IF B01.STATUS.VIRK_DATO_ÅM(SØKER_IND) = 0 THEN                 00003690
           DO;                                                          00003700
             PIC_11 = B01.RF0PERSN.FNR(SØKER_IND);                      00003710
             IF ØNSKET_STATUS = 'S' THEN                                00003720
               DO;                                                      00003730
                 MAP_MELDING = 'DET FINNES IKKE SISTE STATUS FOR '      00003740
                             !!'FØDSELSNUMMER: ' !! PIC_11;             00003750
                 IF STATUS_SKIFTE THEN                                  00003760
                   ØNSKET_STATUS = 'N';                                 00003770
               END;                                                     00003780
             ELSE                                                       00003790
               DO;                                                      00003800
                 MAP_MELDING = 'DET FINNES IKKE NEST SISTE STATUS'      00003810
                             !!' FOR FØDSELSNUMMER: ' !! PIC_11;        00003820
                 IF STATUS_SKIFTE THEN                                  00003830
                   ØNSKET_STATUS = 'S';                                 00003840
               END;                                                     00003850
             RETURN;                                                    00003860
           END;                                                         00003870
                                                                        00003880
       OTHERWISE;                                                       00003890
                                                                        00003900
     END;   /**   SELECT (OPPLYSNINGSTYPE)  **/                         00003910
                                                                        00003920
                                                                        00003930
     SELECT (OPPLYSNINGSTYPE);                                          00003940
       WHEN('S')                                                        00003950
         DO;                                                            00003960
           TRANS_OPPL_OMR.TRANSKODE = 'F41S';                           00003970
           CALL BYGG_FAMILIE_HEADER;                                    00003980
           CALL BYGG_FAMILIE_FORH;                                      00003990
         END;                                                           00004000
       WHEN('F')                                                        00004010
         DO;                                                            00004020
           TRANS_OPPL_OMR.TRANSKODE = 'F41F';                           00004030
           CALL BYGG_STATUS;                                            00004040
         END;                                                           00004050
       WHEN('N')                                                        00004060
         DO;                                                            00004070
           TRANS_OPPL_OMR.TRANSKODE = 'F41N';                           00004080
         END;                                                           00004090
       WHEN('X')                                                        00004100
         DO;                                                            00004110
           TRANSKODE = 'F410';                                          00004120
         END;                                                           00004130
       WHEN('P')                                                        00004140
         DO;                                                            00004150
           TRANS_OPPL_OMR.TRANSKODE = 'F41P';                           00004160
           CALL BYGG_GENHEAD('PERSONLIG INFO');                         00004170
           CALL BYGG_PERSONLIG_INFO;                                    00004180
         END;                                                           00004190
       WHEN('I')                                                        00004200
         DO;                                                            00004210
           CALL BYGG_INNTEKTS_HEADER;                                   00004220
           CALL BYGG_INNTEKTS_FORH;                                     00004230
         END;                                                           00004240
       WHEN('B')                                                        00004250
         DO;                                                            00004260
           TRANS_OPPL_OMR.TRANSKODE = 'F41B';                           00004270
           CALL BYGG_GENHEAD('BEREGNINGSGRUNNLAG');                     00004280
           CALL BYGG_BEREGNINGSGRUNNLAG;                                00004290
         END;                                                           00004300
       WHEN('Y')                                                        00004310
         DO;                                                            00004320
           TRANS_OPPL_OMR.TRANSKODE = 'F41Y';                           00004330
           CALL BYGG_GENHEAD('YTELSER');                                00004340
           CALL BYGG_YTELSER;                                           00004350
         END;                                                           00004360
       WHEN('T','A')                                                    00004370
         DO;                                                            00004380
           CALL BYGG_TRANS;                                             00004390
         END;                                                           00004400
       OTHERWISE                                                        00004410
         ;                                                              00004420
     END;  /*  SELECT   */                                              00004430
 END SELECT_OPPLYSNINGSTYPE;                                            00004440
                                                                        00004450
                                                                        00004460
 FINN_SEARCH_FNR:                                                       00004470
   PROC;                                                                00004480
     DO INDEX_1 = 1 TO 14;                                              00004490
       IF SEARCH_FNR = KOM_OMR.FNR_TAB(INDEX_1) THEN                    00004500
         DO;                                                            00004510
           SØKER_IND = INDEX_1;                                         00004520
           RETURN;                                                      00004530
         END;                                                           00004540
     END;                                                               00004550
                                                                        00004560
     PIC_11 = SEARCH_FNR;                                               00004570
     IF F_KJØNN(PIC_11) = 'K' THEN                                      00004580
       SØKER_IND = 1;                                                   00004590
     ELSE                                                               00004600
       SØKER_IND = 2;                                                   00004610
                                                                        00004620
     B01 = '';                                                          00004630
                                                                        00004640
 END FINN_SEARCH_FNR;                                                   00004650
                                                                        00004660
                                                                        00004670
 LOW_VALUES_TIL_MAP:                                                    00004680
   PROC;                                                                00004690
      LOW_CHAR_BASED = (300)' ';   /* X'00'    */                       00004700
 END LOW_VALUES_TIL_MAP;                                                00004710
                                                                        00004720
                                                                        00004730
 ADDRESSER_B01:                                                         00004740
   PROC;                                                                00004750
      IF ØNSKET_STATUS = 'S' THEN                                       00004760
        KOM_OMR.PEKER_LISTE.B01_PEKER = ADDR(B01);                      00004770
      ELSE                                                              00004780
        KOM_OMR.PEKER_LISTE.B01_PEKER = ADDR(B02);                      00004790
 END ADDRESSER_B01;                                                     00004800
                                                                        00004810
                                                                        00004820
 EN_BLANK_LINJE:                                                        00004830
   PROC;                                                                00004840
     EXEC CICS SEND MAP('BLANKL') MAPSET('S001043') ACCUM PAGING        00004850
                                               MAPONLY;                 00004860
 END EN_BLANK_LINJE;                                                    00004870
                                                                        00004880
                                                                        00004890
 SEND_UTLINJE:                                                          00004900
   PROC;                                                                00004910
     EXEC CICS SEND MAP('UTLINJE') MAPSET('S001043') ACCUM PAGING;      00004920
 END SEND_UTLINJE;                                                      00004930
                                                                        00004940
                                                                        00004950
 BYGG_GENHEAD:                                                          00004960
   PROC(FORESPØRSELTYPE);                                               00004970
     DCL FORESPØRSELTYPE CHAR(18);                                      00004980
                                                                        00004990
     CALL LOW_VALUES_TIL_MAP;                                           00005000
     PIC_6 = DATE;                                                      00005010
     FIXED_DEC6 = PIC_6;                                                00005020
                                                                        00005030
     GENHEADO.FORESPØRSELO     = FORESPØRSELTYPE;                       00005040
     IF OPPLYSNINGSTYPE ^= 'I' THEN                                     00005050
        DO;                                                             00005060
           IF ØNSKET_STATUS = 'S' THEN                                  00005070
              GENHEADO.STATUS_INDO = 'SISTE STATUS';                    00005080
           ELSE                                                         00005090
              GENHEADO.STATUS_INDO = 'N-SISTE STATUS';                  00005100
        END;                                                            00005110
                                                                        00005120
     GENHEADO.DAGENS_DATO_DMÅO = SNU_DATO_TIL_DMÅ(FIXED_DEC6);          00005130
     GENHEADO.FNRO  = B01.RF0PERSN.FNR (SØKER_IND);                     00005140
                                                                        00005150
     IF B01.RF0PERSN.NAVN(SØKER_IND) = (25) ' ' THEN                    00005160
       GENHEADO.NAVNO = 'NAVN PÅ BARN ER IKKE REG';                     00005170
     ELSE                                                               00005180
       GENHEADO.NAVNO = B01.RF0PERSN.NAVN(SØKER_IND);                   00005190
     GENHEADO.TKNRO = B01.RF0PERSN.TKNR(SØKER_IND);                     00005200
     PIC_4          = B01.STATUS.  VIRK_DATO_ÅM(SØKER_IND);             00005210
                                                                        00005220
     IF PIC_4 > 0 THEN                                                  00005230
       DO;                                                              00005240
          PIC_Z9_SLASH_Y9 = F_SNU_DATO(PIC_4);                          00005250
          GENHEADO.TEXT_VIRK_DATOO = 'VIRKN.DATO 1/'!!                  00005260
                                      PIC_Z9_SLASH_Y9;                  00005270
       END;                                                             00005280
                                                                        00005290
     IF B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = 'X' THEN               00005300
       DO;                                                              00005310
         IF B01.STATUS.DØDSDATO_ÅMD(SØKER_IND) > 0 THEN                 00005320
             GENHEADO.HISTORIKKO = 'DØDSHISTORISK TILFELLE';            00005330
         ELSE                                                           00005340
             GENHEADO.HISTORIKKO = 'AVSLUTTET UFØRETILFELLE';           00005350
                                       /* TRUDE */                      00005360
       END;                                                             00005370
                                                                        00005380
     ELSE IF B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = 'O' THEN          00005390
                                                                        00005400
       GENHEADO.HISTORIKKO = 'OPPHØRT TILFELLE';                        00005410
                                                                        00005420
                                                                        00005430
           DCL K FIXED BIN(15) INIT (0),                                00005440
               M FIXED BIN(15) INIT (0);                                00005450
                                                                        00005460
           DO K = 5 TO 1 BY -1 UNTIL(B01.YRKEHIST.YUFT_ÅM               00005470
                                         (SØKER_IND,K) > 0);            00005480
              M = K;                                                    00005490
           END;                                                         00005500
                                                                        00005510
           IF (B01.KAP_11_7_UTLØST(SØKER_IND,M)       = 'J'  &          00005520
               B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = 'X') THEN       00005530
              GENHEADO.HISTORIKKO = 'PENSJONEN ER ENGANGSUTLØST';       00005540
                                       /* HIT TRUDE */                  00005550
                                                                        00005560
     EXEC CICS SEND MAP('GENHEAD') MAPSET('S001043') ACCUM PAGING ERASE;00005570
                                                                        00005580
 END BYGG_GENHEAD;                                                      00005590
                                                                        00005600
                                                                        00005610
 BYGG_FAMILIE_HEADER:                                                   00005620
   PROC;                                                                00005630
     CALL LOW_VALUES_TIL_MAP;                                           00005640
                                                                        00005650
     IF ØNSKET_STATUS = 'S' THEN                                        00005660
       S001042O.STATUS_INDO = 'SISTE STATUS';                           00005670
     ELSE                                                               00005680
       S001042O.STATUS_INDO = 'NEST SISTE STATUS';                      00005690
                                                                        00005700
     PIC_4 = B01.STATUS.VIRK_DATO_ÅM(SØKER_IND);                        00005710
     S001042O.VIRK_DATO_MÅO = F_SNU_DATO(PIC_4);                        00005720
     EXEC CICS SEND MAP('S001042') MAPSET('S001043') ACCUM PAGING ERASE;00005730
                                                                        00005740
 END BYGG_FAMILIE_HEADER;                                               00005750
                                                                        00005760
                                                                        00005770
 BYGG_INNTEKTS_HEADER:                                                  00005780
   PROC;                                                                00005790
     CALL BYGG_GENHEAD('INNTEKTER');                                    00005800
     EXEC CICS SEND MAP('INTHEAD') MAPSET('S001043') ACCUM PAGING       00005810
                                                     MAPONLY;           00005820
 END BYGG_INNTEKTS_HEADER;                                              00005830
                                                                        00005840
                                                                        00005850
 BYGG_FAMILIE_FORH:                                                     00005860
   PROC;                                                                00005870
                                                                        00005880
     DO I = START TO 14 WHILE(B01.RF0PERSN.FNR(I) > 0);                 00005890
        START = I;                                                      00005900
        CALL LOW_VALUES_TIL_MAP;                                        00005910
        SELECT (B01.STATUS.PENSJONSTYPE1(I));                           00005920
           WHEN('L','B','N')                                            00005930
              MORFARO.FNR_TEKSTO = 'BARN';                              00005940
           WHEN(' ',' ')                                                00005950
              MORFARO.FNR_TEKSTO = 'S.FEIL';                            00005960
           OTHERWISE                                                    00005970
              DO;                                                       00005980
                 PIC_11 = B01.RF0PERSN.FNR(I);                          00005990
                 IF F_KJØNN(PIC_11) = 'K' THEN                          00006000
                    MORFARO.FNR_TEKSTO = 'KVINNE';                      00006010
                 ELSE                                                   00006020
                    MORFARO.FNR_TEKSTO = 'MANN';                        00006030
                                                                        00006040
              END;                                                      00006050
        END;         /*   SELECT     */                                 00006060
                                                                        00006070
                                                                        00006080
        MORFARO.FNRO  = B01.RF0PERSN.FNR (I);                           00006090
        MORFARO.NAVNO = B01.RF0PERSN.NAVN(I);                           00006100
                                                                        00006110
        IF B01.STATUS.DØDSDATO_ÅMD(I) > 0 THEN                          00006120
           MORFARO.DØDSDATO_DMÅO =                                      00006130
              SNU_DATO_TIL_DMÅ(B01.STATUS.DØDSDATO_ÅMD(I));             00006140
        ELSE                                                            00006150
           DO;                                                          00006160
              MORFARO.DØDSDATO_DMÅA = 'Ø'; /** ASKIP OG DARK **/        00006170
              MORFARO.DØDSDATO_TA   = 'Ø'; /** ASKIP OG DARK **/        00006180
           END;                                                         00006190
                                                                        00006200
        MORFARO.SPERREO = B01.RF0PERSN.SPERRE(I);                       00006210
                                                                        00006220
        IF B01.STATUS.STATUS_KODE_HIST(I) = 'O' THEN                    00006230
           MORFARO.ST_KOD_HSTO  = 'OPPHØRT -';                          00006240
                                                                        00006250
        MORFARO.PENSJONSTYPEO =                                         00006260
               HENT_PENSJONSTYPE1 (B01.STATUS.PENSJONSTYPE1 (I) ,       00006270
                                   B01.STATUS.PENSJONSTYPE3 (I) )  !!   00006280
               HENT_PENSJONSTYPE2 (B01.STATUS.PENSJONSTYPE1 (I) ,       00006290
                                   B01.STATUS.PENSJONSTYPE2 (I) )    ;  00006300
                                                                        00006310
        EXEC CICS SEND MAP('MORFAR') MAPSET('S001043') ACCUM PAGING  ;  00006320
     END;                                                               00006330
                                                                        00006340
                                                                        00006350
     /* HIT KOMMER EN NÅ EN IKKE HAR FLERE  IGJEN  */                   00006360
                                                                        00006370
  /* EXEC CICS ISSUE SIGNAL;    */                                      00006380
     SISTE_SIDE = '1'B;                                                 00006390
     GOTO OVERFLOW;                                                     00006400
                                                                        00006410
                                                                        00006420
      HENT_PENSJONSTYPE1:                                               00006430
        PROC (PT1,PT3) RETURNS ( CHAR (40) UNAL VARYING);               00006440
          DCL                                                           00006450
              PT1      CHAR ( 1)  UNAL,                                 00006460
              PT3      CHAR ( 1)  UNAL,                                 00006470
              RETUR    CHAR (40)  UNAL VARYING;                         00006480
                                                                        00006490
          SELECT(PT1);                                                  00006500
            WHEN('A')                                                   00006510
              RETUR = 'ALDERSPENSJON';                                  00006520
            WHEN('B')                                                   00006530
              RETUR = 'FORELDRELØSE BARN';                              00006540
            WHEN('D')                                                   00006550
              RETUR = 'PERSONEN ER DØD';                                00006560
            WHEN('E')                                                   00006570
              RETUR = 'ETTERLATTEPENSJON';                              00006580
            WHEN('F')                                                   00006590
              RETUR = 'FORSØRGET EKTEFELLE';                            00006600
            WHEN('J')                                                   00006610
              RETUR = 'ETTERLATT FAMILIEPLEIER';                        00006620
            WHEN('K')                                                   00006630
              RETUR = 'AFP - AVTALEFESTET PENSJON';                     00006640
            WHEN('L')                                                   00006650
              RETUR = 'FORSØRGET BARN';                                 00006660
            WHEN('N')                                                   00006670
              RETUR = 'BARNE_P EN AV FORELDRENE DØD';                   00006680
            WHEN('U')                                                   00006690
              IF PT3   = 'A'                              THEN          00006700
                 RETUR = 'ATTFØRING';                                   00006710
              ELSE                                                      00006720
                 RETUR = 'UFØREPENSJON';                                00006730
            WHEN('Y')                                                   00006740
              IF PT3   = 'A'                              THEN          00006750
                 RETUR = 'YRKESSKADE - ATTFØRING';                      00006760
              ELSE                                                      00006770
                 RETUR = 'YRKESSKADE - UFØREPENSJON';                   00006780
            WHEN('G')                                                   00006790
              IF B01.SIVILSTAND (I) = 'P' THEN                          00006800
                 RETUR = 'PARTNER';                                     00006810
              ELSE                                                      00006820
              IF B01.SIVILSTAND (I) = 'W' !                             00006830
                 B01.SIVILSTAND (I) = 'V' THEN                          00006840
                 RETUR = 'SAMBOER';                                     00006850
              ELSE                                                      00006860
                 RETUR = 'GIFT';                                        00006870
            WHEN(' ')                                                   00006880
              RETUR = ' ';                                              00006890
            OTHERWISE                                                   00006900
              RETUR = 'FEIL PT1 KODE: ' !! PT1;                         00006910
          END;   /*  SELECT(PT1)   */                                   00006920
                                                                        00006930
        RETURN(RETUR);                                                  00006940
                                                                        00006950
      END HENT_PENSJONSTYPE1;                                           00006960
                                                                        00006970
      HENT_PENSJONSTYPE2:                                               00006980
        PROC(PT1,PT2) RETURNS(CHAR(40) UNAL VARYING);                   00006990
          DCL                                                           00007000
             PT1      CHAR(1)  UNAL,                                    00007010
             PT2      CHAR(1)  UNAL,                                    00007020
             RETUR    CHAR(40) UNAL VARYING;                            00007030
                                                                        00007040
          SELECT(PT2);                                                  00007050
 /*         WHEN('B')         ENDRET 15.3.88 SATISH                     00007060
              RETUR = ' - BARE BARNETILSYN'         */                  00007070
            WHEN('E')                                                   00007080
              RETUR = ' - ETTERLATTEPENSJON';                           00007090
            WHEN('F')                                                   00007100
              RETUR = ' - FORSØRGER EKTEFELLE';                         00007110
            WHEN('M')                                                   00007120
              RETUR = ' - INNTEKT > 4G';                                00007130
            WHEN('N')                                                   00007140
              RETUR = ' - NULLPENSJON';                                 00007150
            WHEN('O')                                                   00007160
              RETUR = ' - OVERGANGSSTØNAD';                             00007170
            WHEN('P')                                                   00007180
 /* ENDRET 15.3.88 SATISH       */                                      00007190
                                                                        00007200
              DO;                                                       00007210
                 IF PT1 = 'B'   !                                       00007220
                    PT1 = 'N'   THEN                                    00007230
                    RETUR = ' - YNGSTE BARN';                           00007240
                 ELSE                                                   00007250
                    RETUR = ' - PENSJON';                               00007260
              END;                                                      00007270
 /* HIT 15.3.88 SATISH          */                                      00007280
                                                                        00007290
            WHEN('R')                                                   00007300
              RETUR = ' - INNTEKTSAVHENGIG BARNETILLEGG ';              00007310
            WHEN('S')                                                   00007320
              RETUR = ' - SAMMENSTØTENDE PENSJON';                      00007330
            WHEN('U')                                                   00007340
              RETUR = ' - INNTEKT < 4G';                                00007350
            WHEN('V')                                                   00007360
              RETUR = ' - BARNETILLEGG - SÆRKULL';                      00007370
            WHEN('W')                                                   00007380
              RETUR = ' - BARNETILLEGG - FELLESBARN';                   00007390
            WHEN('Ø')                                                   00007400
              RETUR = ' - ØVRIGE BARN';                                 00007410
            WHEN(' ')                                                   00007420
              RETUR = ' ';                                              00007430
            OTHERWISE                                                   00007440
              RETUR = ' - FEIL PT2 KODE: ' !! PT2;                      00007450
          END;   /*  SELECT(PT2)   */                                   00007460
                                                                        00007470
        RETURN(RETUR);                                                  00007480
                                                                        00007490
      END HENT_PENSJONSTYPE2;                                           00007500
                                                                        00007510
 END BYGG_FAMILIE_FORH;                                                 00007520
                                                                        00007530
                                                                        00007540
 SNU_DATO_TIL_DMÅ:                                                      00007550
   PROC(DATO_ÅMD) RETURNS(PIC'(6)9' UNAL);                              00007560
     DCL                                                                00007570
       DATO_ÅMD    FIXED DEC(6)   UNAL                 ,                00007580
       RETUR       PIC'(6)9'      UNAL                 ,                00007590
       RETUR_DAG   PIC'99'        UNAL DEF RETUR POS(1),                00007600
       RETUR_MND   PIC'99'        UNAL DEF RETUR POS(3),                00007610
       RETUR_ÅR    PIC'99'        UNAL DEF RETUR POS(5),                00007620
       PIC6        PIC'(6)9'      UNAL                 ,                00007630
       PIC6_DAG    PIC'99'        UNAL DEF PIC6  POS(5),                00007640
       PIC6_MND    PIC'99'        UNAL DEF PIC6  POS(3),                00007650
       PIC6_ÅR     PIC'99'        UNAL DEF PIC6  POS(1);                00007660
                                                                        00007670
       PIC6 = DATO_ÅMD;                                                 00007680
       RETUR_DAG = PIC6_DAG;                                            00007690
       RETUR_MND = PIC6_MND;                                            00007700
       RETUR_ÅR  = PIC6_ÅR;                                             00007710
                                                                        00007720
       RETURN(RETUR);                                                   00007730
                                                                        00007740
 END SNU_DATO_TIL_DMÅ;                                                  00007750
                                                                        00007760
                                                                        00007770
 BYGG_INNTEKTS_FORH:                                                    00007780
   PROC;                                                                00007790
                                                                        00007800
   %INCLUDE P0019924;       /*   GV - OPPLYSNINGER      */              00007810
                                                                        00007820
     CALL LOW_VALUES_TIL_MAP;                                           00007830
       IF INNTEKT_START = 63 THEN                                       00007840
         DO;                                                            00007850
           IF B01.TILBERPO.AI63(SØKER_IND) > 0 THEN                     00007860
             CALL FØR_67((B01.TILBERPO.AI63(SØKER_IND)),63,'ANTATT');   00007870
           IF B01.TILBERPO.AI64(SØKER_IND) > 0 THEN                     00007880
             CALL FØR_67((B01.TILBERPO.AI64(SØKER_IND)),64,'ANTATT');   00007890
           IF B01.TILBERPO.AI65(SØKER_IND) > 0 THEN                     00007900
             CALL FØR_67((B01.TILBERPO.AI65(SØKER_IND)),65,'ANTATT');   00007910
           IF B01.TILBERPO.AI66(SØKER_IND) > 0 THEN                     00007920
             CALL FØR_67((B01.TILBERPO.AI66(SØKER_IND)),66,'ANTATT');   00007930
           IF B01.TILBERPO.PI66(SØKER_IND) > 0 THEN                     00007940
             CALL FØR_67((B01.TILBERPO.PI66(SØKER_IND)),66,             00007950
                                                       'ARBEIDS');      00007960
           INNTEKT_START = 67;                                          00007970
         END;                                                           00007980
                                                                        00007990
                                                                        00008000
         IF INNTEKT_START = 67 THEN                                     00008010
                                                                        00008020
           DO;                                                          00008030
                                                                        00008040
              CALL DATABASE('CLOSE');                                   00008050
              CALL DATABASE('OPEN');                                    00008060
                                                                        00008070
              SSA1_RF0PERSN.PKEY = B01.RF0PERSN.FNR(SØKER_IND);         00008080
              SSA_UQUAL     = 'PINNTEKT';                               00008090
              CALL PLITDLI                         (W02_PARM_CT_5,      00008100
                                                    W02_GU,             00008110
                                                    RF1,                00008120
                                                    W01_IO,             00008130
                                                    SSA1_RF0PERSN,      00008140
                                                    SSA_UQUAL);         00008150
                                                                        00008160
              IF  W01_PINT_UT.W02_PI_TYPE = 'X' THEN                    00008170
                  GOTO SLUTT_BYGG_I_F;                                  00008180
                                                                        00008190
              IF  UIBFCTR                    =     '00000000'B   THEN   00008200
                DO;                                                     00008210
                  SELECT ( RF1.STATUS_KODE );                           00008220
                    WHEN ( '  ' )                                       00008230
                      ;                                                 00008240
                    WHEN ( 'GE' )                                       00008250
                      DO;                                               00008260
                         SISTE_SIDE = '1'B;                             00008270
                         GOTO OVERFLOW;                                 00008280
                      END;                                              00008290
                    OTHERWISE                                           00008300
                      DO;                                               00008310
                /* ************************************************** */00008320
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00008330
                /* ************************************************** */00008340
                                                                        00008350
                   MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GU I BYG'00008360
                               !!'G_INNTEKTER, STATUS_KODE: '!!         00008370
                                           RF1.STATUS_KODE ;            00008380
                      END;                                              00008390
                  END;                                                  00008400
                END;                                                    00008410
              ELSE                                                      00008420
                DO;                                                     00008430
          /* ************************************************** */      00008440
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00008450
          /* ************************************************** */      00008460
                                                                        00008470
             MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GU I BYGG_'    00008480
                      !!'INNTEKTER,:' !! UNSPEC(UIBFCTR) !! ' '         00008490
                                            !! UNSPEC(UIBDLTR);         00008500
                END;                                                    00008510
                                                                        00008520
              CALL SJEKK_MELDING;                                       00008530
              W01_PINT_UT =               W01_PINT_AKT;                 00008540
              INNTEKT_START = 68;                                       00008550
           END;                                                         00008560
                                                                        00008570
        DO WHILE ('A' = 'A');                                           00008580
                                                                        00008590
           CALL LOW_VALUES_TIL_MAP;                                     00008600
           IF GJØR_GN                          THEN                     00008610
              CALL PLITDLI                      (W02_PARM_CT_3,         00008620
                                                 W02_GN,                00008630
                                                 RF1,                   00008640
                                                 W01_IO);               00008650
                                                                        00008660
           IF   UIBFCTR                    =     '00000000'B  THEN      00008670
             DO;                                                        00008680
               SELECT ( RF1.STATUS_KODE );                              00008690
                 WHEN ( '  ' )                                          00008700
                   DO;                                                  00008710
                      NESTE_ÅR  =  W01_PINT_AKT.W02_PI_ÅR;              00008720
 /* ENDRET 20.2.91 O.G.-------------------------------------------*/    00008730
                      IF W01_PINT_AKT.W02_PI_TYPE ^= 'X' THEN           00008740
 /* HIT    20.2.91 O.G.-------------------------------------------*/    00008750
                         CALL ACCUM_INNT;                               00008760
                   END;                                                 00008770
                 WHEN ( 'GK','GA','GB','GE' )                           00008780
                   DO;                                                  00008790
                      NESTE_ÅR  =  1;     /* BARE EN TEST  VERDI */     00008800
                      ALLOCATE W01_PINT_AKT;                            00008810
                      W01_PINT_AKT = '';                                00008820
                      CALL ACCUM_INNT;                                  00008830
                      TRANS_OPPL_OMR.TRANSKODE = 'F41I';                00008840
                      SISTE_SIDE = '1'B;                                00008850
                      GOTO OVERFLOW;                                    00008860
                   END;                                                 00008870
                OTHERWISE                                               00008880
                   DO;                                                  00008890
          /* ************************************************** */      00008900
          /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */      00008910
          /* ************************************************** */      00008920
                                                                        00008930
                   MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GN I BYG'00008940
                         !!'G_INNTEKTER, STATUS_KODE: '!!               00008950
                                     RF1.STATUS_KODE ;                  00008960
                   END;                                                 00008970
               END;                                                     00008980
             END;                                                       00008990
           ELSE                                                         00009000
             DO;                                                        00009010
          /* ************************************************** */      00009020
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00009030
          /* ************************************************** */      00009040
                                                                        00009050
                MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GN I BYGG_' 00009060
                        !!'INNTEKTER, KODE: ' !! UNSPEC(UIBFCTR) !! ' ' 00009070
                                            !! UNSPEC(UIBDLTR);         00009080
             END;                                                       00009090
                                                                        00009100
           CALL SJEKK_MELDING;                                          00009110
                                                                        00009120
        END;   /****    DO WHILE ('A' = 'A')    ******/                 00009130
                                                                        00009140
                                                                        00009150
     SISTE_SIDE = '1'B;                                                 00009160
     GOTO OVERFLOW;                                                     00009170
                                                                        00009180
   MAX_UFG:                                                             00009190
     PROC(INNT_ÅR,UFG_TIL_POENG,MAX_UFG);                               00009200
       DCL                                                              00009210
         INNT_ÅR       PIC'99'  UNAL,                                   00009220
         MAX_UFG       PIC'ZZZ' UNAL,                                   00009230
         UFG_TIL_POENG FIXED DEC(3),                                    00009240
         UFT_ÅM        PIC'(4)9',                                       00009250
         OPPH_ÅM       PIC'(4)9',                                       00009260
         UFT_Å         PIC'(2)9' DEF UFT_ÅM  POS(1),                    00009270
         UFT_M         PIC'(2)9' DEF UFT_ÅM  POS(3),                    00009280
         OPPH_Å        PIC'(2)9' DEF OPPH_ÅM POS(1),                    00009290
         OPPH_M        PIC'(2)9' DEF OPPH_ÅM POS(3);/*30.10.85 HL*/     00009300
                                                                        00009310
       MAX_UFG       = 0;                                               00009320
       UFG_TIL_POENG = 999;                                             00009330
                                                                        00009340
       DO INDEX_1 = 1 TO 7 WHILE(B01.UFØRHIST.UFT_ÅM    /*0697 HL*/     00009350
                                (SØKER_IND,INDEX_1) > 0);               00009360
         UFT_ÅM  = B01.UFØRHIST.UFT_ÅM        (SØKER_IND,INDEX_1);      00009370
         OPPH_ÅM = B01.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,INDEX_1);      00009380
                                                                        00009390
 /* ENDRING 30.10.85 HL - FEILRAPP 267                             */   00009400
                                                                        00009410
 /*         IF OPPH_M = 1          THEN     */                          00009420
 /*            OPPH_Å = OPPH_Å - 1;  */                                 00009430
                                                                        00009440
 /* HIT 30.10.85                                                   */   00009450
                                                                        00009460
 /* ENDRING 03.11.89 TRUDE . POENG BLIR FEIL DERSOM NYTT UFT=OPPH  */   00009470
                                                                        00009480
       IF INDEX_1                                 > 1       &           00009490
          B01.UFØRHIST.UFT_ÅM (SØKER_IND,INDEX_1) ^=                    00009500
          B01.UFØRHIST.OPPHØRSDATO_ÅM (SØKER_IND,(INDEX_1 - 1 ))        00009510
                                   THEN                                 00009520
            IF OPPH_M = 1          THEN                                 00009530
               OPPH_Å = OPPH_Å - 1;                                     00009540
 /* HIT 03.11.89   TRUDE                                           */   00009550
                                                                        00009560
 /* HL 0396 : */                                                        00009570
                                                                        00009580
         PIC_11 = B01.FNR(SØKER_IND);                                   00009590
         IF FÅR > 23  &                                                 00009600
 /*         OPPH_Å >= (FÅR + 67)      THEN                */            00009610
 /*         OPPH_Å = FÅR + 66;                            */            00009620
 /*ENDRET 110796 HL*/                                                   00009630
            OPPH_Å > (FÅR + 67)      THEN                               00009640
            OPPH_Å = FÅR + 67;                                          00009650
                                                                        00009660
         IF UFT_Å = INNT_ÅR ! INNT_ÅR = OPPH_Å THEN                     00009670
            UFG_TIL_POENG = 0;                                          00009680
                                                                        00009690
         IF (UFT_Å <= INNT_ÅR) & (OPPH_Å = 0 ! INNT_ÅR <= OPPH_Å) THEN  00009700
                                                                        00009710
           DO;                                                          00009720
             IF MAX_UFG  < B01.UFØRHIST.UFG(SØKER_IND,INDEX_1) THEN     00009730
               MAX_UFG  = B01.UFØRHIST.UFG(SØKER_IND,INDEX_1);          00009740
     /*0697 HL : */                                                     00009750
             DO INDEX_2 = 1 TO 7 WHILE(B01.UFØRHIST.UFØRGRAD.           00009760
                          UFG_DATO_ÅM(SØKER_IND,INDEX_1,INDEX_2) > 0);  00009770
               UFT_ÅM  = B01.UFØRHIST.UFØRGRAD.UFG_DATO_ÅM              00009780
                                     (SØKER_IND,INDEX_1,INDEX_2);       00009790
                                                                        00009800
               IF UFT_Å < INNT_ÅR              !                        00009810
                (UFT_M = 1 & UFT_Å = INNT_ÅR)  !                        00009820
                (UFT_Å = INNT_ÅR & B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE     00009830
                         (SØKER_IND,INDEX_1,INDEX_2) > MAX_UFG) THEN    00009840
                 MAX_UFG = B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE             00009850
                                   (SØKER_IND,INDEX_1,INDEX_2);         00009860
             END;                                                       00009870
           END;                                                         00009880
       END;                                                             00009890
                                                                        00009900
       IF  UFG_TIL_POENG = 999 THEN                                     00009910
           UFG_TIL_POENG = MAX_UFG;                                     00009920
                                                                        00009930
   END MAX_UFG;                                                         00009940
                                                                        00009950
   FØR_67:                                                              00009960
     PROC(INNTEKT,ÅR,TYPE);                                             00009970
                                                                        00009980
     DCL                                                                00009990
       INNTEKT FIXED DEC(7) UNAL,                                       00010000
       ÅR      PIC   '99'   UNAL,                                       00010010
       TYPE    CHAR  (10)   UNAL;                                       00010020
                                                                        00010030
       INNTEKTO.ÅRO             = ÅR;                                   00010040
       INNTEKTO.INNT_TYPEO      = TYPE;                                 00010050
       INNTEKTO.INNTO           = INNTEKT * 100;                        00010060
       INNTEKTO.SUM_INNTO       = INNTEKT * 100;                        00010070
       EXEC CICS SEND MAP('INNTEKT') MAPSET('S001043') ACCUM PAGING;    00010080
       CALL EN_BLANK_LINJE;                                             00010090
                                                                        00010100
   END FØR_67;                                                          00010110
                                                                        00010120
                                                                        00010130
   ACCUM_INNT:         PROC;                                            00010140
                                                                        00010150
       DCL DETTE_ÅR PIC '99',                                           00010160
           RAPPART  CHAR(1) INIT(' '),                                  00010170
           INNTART  CHAR(1) INIT(' ');                                  00010180
                                                                        00010190
       INNTEKTO.ÅRO = W01_PINT_UT.W02_PI_ÅR;                            00010200
                                                                        00010210
                                                                        00010220
       SELECT (W01_PINT_UT.W02_PI_TYPE);                                00010230
          WHEN('A')                                                     00010240
             INNTEKTO.INNT_TYPEO = 'FORELØPIG';                         00010250
          WHEN('B')                                                     00010260
             DO;                                                        00010270
                RAPPART = 'B';                                          00010280
                INNTART = '1';                                          00010290
             END;                                                       00010300
          WHEN('C')                                                     00010310
             DO;                                                        00010320
                RAPPART = 'B';                                          00010330
                INNTART = '2';                                          00010340
             END;                                                       00010350
          WHEN('D')                                                     00010360
             DO;                                                        00010370
                RAPPART = 'B';                                          00010380
                INNTART = '3';                                          00010390
             END;                                                       00010400
          WHEN('E')                                                     00010410
             DO;                                                        00010420
                RAPPART = 'C';                                          00010430
                INNTART = '1';                                          00010440
             END;                                                       00010450
          WHEN('F')                                                     00010460
             DO;                                                        00010470
                RAPPART = 'C';                                          00010480
                INNTART = '2';                                          00010490
             END;                                                       00010500
          WHEN('H')                                                     00010510
             DO;                                                        00010520
                RAPPART = 'D';                                          00010530
                INNTART = '1';                                          00010540
             END;                                                       00010550
          WHEN('I')                                                     00010560
             DO;                                                        00010570
                RAPPART = 'D';                                          00010580
                INNTART = '2';                                          00010590
             END;                                                       00010600
          WHEN('S')                                                     00010610
             DO;                                                        00010620
                RAPPART = 'S';                                          00010630
                INNTART = '1';                                          00010640
             END;                                                       00010650
          WHEN('T')                                                     00010660
             DO;                                                        00010670
                RAPPART = 'S';                                          00010680
                INNTART = '2';                                          00010690
             END;                                                       00010700
          WHEN('J')                                                     00010710
             DO;                                                        00010720
                RAPPART = 'O';                                          00010730
                INNTART = '4';                                          00010740
             END;                                                       00010750
          WHEN('K')                                                     00010760
             DO;                                                        00010770
                RAPPART = 'O';                                          00010780
                INNTART = '5';                                          00010790
             END;                                                       00010800
          WHEN('L')                                                     00010810
             DO;                                                        00010820
                RAPPART = 'O';                                          00010830
                INNTART = '6';                                          00010840
             END;                                                       00010850
          WHEN('V')                                                     00010860
             DO;                                                        00010870
                RAPPART = 'U';                                          00010880
                INNTART = '1';                                          00010890
             END;                                                       00010900
          WHEN('W')                                                     00010910
             DO;                                                        00010920
                RAPPART = 'U';                                          00010930
                INNTART = '2';                                          00010940
             END;                                                       00010950
          OTHERWISE                                                     00010960
             ;                                                          00010970
       END ;  /****SELECT (W01_PINT_UT.W02_PI_TYPE)  ***/               00010980
                                                                        00010990
       SELECT (RAPPART);                                                00011000
          WHEN('B')                                                     00011010
             INNTEKTO.INNT_TYPEO = 'INNENLANDS';                        00011020
          WHEN('C')                                                     00011030
             INNTEKTO.INNT_TYPEO = 'SJØ INNTKT';                        00011040
          WHEN('D')                                                     00011050
             INNTEKTO.INNT_TYPEO = 'DIV UTLAND';                        00011060
          WHEN('S')                                                     00011070
             INNTEKTO.INNT_TYPEO = 'SVALBARD  ';                        00011080
          WHEN('U')                                                     00011090
             INNTEKTO.INNT_TYPEO = 'DIPLOMAT  ';                        00011100
          WHEN('O')                                                     00011110
             INNTEKTO.INNT_TYPEO = 'OMSORG    ';                        00011120
          OTHERWISE                                                     00011130
              ;                                                         00011140
       END;      /*****  SELECT (RAPPART)    *****/                     00011150
                                                                        00011160
       SELECT (INNTART);                                                00011170
          WHEN('1')                                                     00011180
             INNTEKTO.ARTO = 'ARBEIDSTAKER ';                           00011190
          WHEN('2')                                                     00011200
             INNTEKTO.ARTO = 'SELVST NÆR_DR';                           00011210
          WHEN('3')                                                     00011220
             INNTEKTO.ARTO = 'BONDE/FI/SKOG';                           00011230
          WHEN('4')                                                     00011240
             INNTEKTO.ARTO = 'BARN         ';                           00011250
          WHEN('5')                                                     00011260
             INNTEKTO.ARTO = 'ANDRE        ';                           00011270
          WHEN('6')                                                     00011280
             INNTEKTO.ARTO = 'ANDRE        ';                           00011290
          OTHERWISE                                                     00011300
               ;                                                        00011310
       END;      /*****  SELECT (INNTART)    *****/                     00011320
                                                                        00011330
       SELECT (W01_PINT_UT.W02_PI_MERKE);                               00011340
          WHEN(0)                                                       00011350
             DO;                                                        00011360
                IF RAPPART = 'D' THEN                                   00011370
                   INNTEKTO.MERKEO = 'ANDRE 1Ø';                        00011380
             END;                                                       00011390
          WHEN(1)                                                       00011400
             DO;                                                        00011410
                IF RAPPART = 'D' THEN                                   00011420
                   INNTEKTO.MERKEO = 'SGRGJ 1Ø';                        00011430
                ELSE IF RAPPART = 'B' THEN                              00011440
                   INNTEKTO.MERKEO = 'NOGRGJ  ';                        00011450
             END;                                                       00011460
          WHEN(2)                                                       00011470
             DO;                                                        00011480
                IF RAPPART = 'D' THEN                                   00011490
                   INNTEKTO.MERKEO = 'RAPP FFU';                        00011500
             END;                                                       00011510
          WHEN(3)                                                       00011520
             DO;                                                        00011530
                IF RAPPART = 'D' THEN                                   00011540
                   INNTEKTO.MERKEO = 'KOMB 1Ø ';                        00011550
             END;                                                       00011560
          WHEN(4)                                                       00011570
             DO;                                                        00011580
                IF RAPPART = 'B' THEN                                   00011590
                   INNTEKTO.MERKEO = 'INNT OMB';                        00011600
             END;                                                       00011610
          WHEN(5)                                                       00011620
             DO;                                                        00011630
                IF RAPPART = 'B' THEN                                   00011640
                   INNTEKTO.MERKEO = 'INNT OMB';                        00011650
             END;                                                       00011660
          WHEN(8)                                                       00011670
             DO;   /* TRUDE 1094 SKJØNNSLIGNET INNTEKT */               00011680
               INNTEKTO.MERKEO = 'SKJØNN  ';                            00011690
             END;                                                       00011700
          WHEN(9)                                                       00011710
             INNTEKTO.MERKEO = 'OPPHØRT ';                              00011720
          OTHERWISE                                                     00011730
             INNTEKTO.MERKEO = 'FEIL: ' !! W01_PINT_UT.W02_PI_MERKE;    00011740
                                                                        00011750
       END ;     /****   SELECT (W01_PINT_UT.W02_PI_MERKE) ****/        00011760
                                                                        00011770
                                                                        00011780
       INNTEKTO.INNTO      =  W01_PINT_UT.W02_PI  * 100;                00011790
       INNTEKTO.RAPP_DATOO =  W01_PINT_UT.W02_PI_RAPPDATO;              00011800
       INNTEKTO.KOMMUNEO   =  W01_PINT_UT.W02_PI_KOMMNR;                00011810
                                                                        00011820
         /* SENDE UT DET SOM SKAL UT BARE EN GANG PR. ÅR  */            00011830
                                                                        00011840
       IF NESTE_ÅR ^= W01_PINT_UT.W02_PI_ÅR THEN                        00011850
          DO;                                                           00011860
             /* SETTE INN I HJELPEVARIABLE FOR Å HENTE POENG  */        00011870
             FIXED_DEC9 = B01.PINNTEKT.PI(SØKER_IND,INNTEKTO.ÅRO) * 100;00011880
             FIXED_BIN15 = INNTEKTO.ÅRO;                                00011890
             FIXED_DEC3 = 0;                                            00011900
             INNTEKTO.MAX_UFGO = 0;                                     00011910
             CALL MAX_UFG (INNTEKTO.ÅRO,FIXED_DEC3,INNTEKTO.MAX_UFGO);  00011920
                                                                        00011930
             FIXED_DEC5_4 = F_INNTEKT_POENG(FIXED_DEC9,FIXED_BIN15,     00011940
                            GV_TAB_ARRAY.G_V(INNTEKTO.ÅRO),FIXED_DEC3); 00011950
                                                                        00011960
             FIXED_DEC5_4 = FIXED_DEC5_4 + 0.005;     /* FORHØYNING */  00011970
             INNTEKTO.P_POENGO   = FIXED_DEC5_4;                        00011980
             INNTEKTO.SUM_INNTO  =                                      00011990
                   B01.PINNTEKT.PI(SØKER_IND,INNTEKTO.ÅRO) * 100;       00012000
                                                                        00012010
          END;                                                          00012020
                                                                        00012030
                                                                        00012040
       GJØR_GN          = '0'B;                                         00012050
       EXEC CICS SEND MAP('INNTEKT') MAPSET('S001043')ACCUM PAGING;     00012060
       GJØR_GN          = '1'B;                                         00012070
       DETTE_ÅR         =  W01_PINT_UT.W02_PI_ÅR;                       00012080
       W01_PINT_UT      =  W01_PINT_AKT;                                00012090
       IF (NESTE_ÅR     ^=  DETTE_ÅR ) & NESTE_ÅR ^= 1   THEN           00012100
          CALL EN_BLANK_LINJE;                                          00012110
                                                                        00012120
                                                                        00012130
   END ACCUM_INNT;                                                      00012140
                                                                        00012150
                                                                        00012160
                                                                        00012170
   %INCLUDE R0014163;         /*    F_INNTEKT_POENG        */           00012180
                                                                        00012190
 SLUTT_BYGG_I_F:                                                        00012200
 END BYGG_INNTEKTS_FORH;                                                00012210
                                                                        00012220
 BYGG_PERSONLIG_INFO:                                                   00012230
   PROC;                                                                00012240
                                                                        00012250
     CALL LOW_VALUES_TIL_MAP;                                           00012260
                                                                        00012270
     UTLINJEO.FØRSTEO = 'KODER FOR PENSJONSTYPE1, 2 OG 3' !! (20)'.';   00012280
     UTLINJEO.ANDREO  =                                                 00012290
              B01.STATUS.PENSJONSTYPE1(SØKER_IND) !! (4)' ' !!          00012300
              B01.STATUS.PENSJONSTYPE2(SØKER_IND) !! (4)' ' !!          00012310
              B01.STATUS.PENSJONSTYPE3(SØKER_IND);                      00012320
     CALL SEND_UTLINJE;                                                 00012330
                                                                        00012340
     IF B01.ALDERSP. ET(SØKER_IND) > 0 !                                00012350
        B01.YRKEPENS.ET(SØKER_IND) > 0 !                                00012360
        B01.UFØRPENS.ET(SØKER_IND) > 0 THEN                             00012370
       DO;                                                              00012380
         UTLINJEO.FØRSTEO = 'HAR TILLEGG FOR EKTEFELLE';                00012390
         CALL SEND_UTLINJE;                                             00012400
       END;                                                             00012410
                                                                        00012420
     IF B01.ALDERSP. BT(SØKER_IND) > 0 !                                00012430
        B01.YRKEPENS.BT(SØKER_IND) > 0 !                                00012440
        B01.UFØRPENS.BT(SØKER_IND) > 0 THEN                             00012450
       DO;                                                              00012460
         UTLINJEO.FØRSTEO = 'HAR TILLEGG FOR BARN' !! (40)'.';          00012470
         I = B01.STATUS.ANTALL_BARN(SØKER_IND);                         00012480
         UTLINJEO.ANDREO  = 'ANTALL: ' !! I;                            00012490
         CALL SEND_UTLINJE;                                             00012500
       END;                                                             00012510
                                                                        00012520
     CALL EN_BLANK_LINJE;                                               00012530
     UTLINJEO.FØRSTEO = 'SIVILSTAND' !! (40)'.';                        00012540
     UTLINJEO.ANDREO  = SELECT_SIVILSTAND(B01.STATUS.                   00012550
                                       SIVILSTAND(SØKER_IND));          00012560
     CALL SEND_UTLINJE;                                                 00012570
     UTLINJEO.FØRSTEO = 'SPRÅKFORM' !! (40)'.';                         00012580
     IF B01.RF0PERSN.SPRÅK(SØKER_IND) = 'B' THEN                        00012590
       UTLINJEO.ANDREO  = 'BOKMÅL';                                     00012600
     ELSE IF B01.RF0PERSN.SPRÅK(SØKER_IND) = 'N' THEN                   00012610
       UTLINJEO.ANDREO  = 'NYNORSK';                                    00012620
     ELSE                                                               00012630
       UTLINJEO.ANDREO  = 'FEIL KODE FOR SPRÅK: ' !!                    00012640
                   B01.RF0PERSN.SPRÅK(SØKER_IND);                       00012650
     CALL SEND_UTLINJE;                                                 00012660
                                                                        00012670
     CALL EN_BLANK_LINJE;                                               00012680
     IF B01.STATUS.FØRSTE_GANG_REG(SØKER_IND) = 'J' THEN                00012690
       DO;                                                              00012700
         UTLINJEO.FØRSTEO = 'DETTE ER FØRSTE GANG VEDKOM' !!            00012710
                            'MENDE ER REG' !! (10)'.';                  00012720
         PIC_4 = B01.STATUS.VIRK_DATO_ÅM(SØKER_IND);                    00012730
         PIC_Z9_SLASH_Y9 = F_SNU_DATO(PIC_4);                           00012740
         UTLINJEO.ANDREO  = 'DATO: 1/' !! PIC_Z9_SLASH_Y9;              00012750
         CALL SEND_UTLINJE;                                             00012760
       END;                                                             00012770
     PIC_3 = B01.SPESOPPL.STATSBORGER(SØKER_IND);                       00012780
     UTLINJEO.FØRSTEO = 'STATSBORGERKODE PR. VIRKNINGSDATO' !!          00012790
                                           (20)'.';                     00012800
     UTLINJEO.ANDREO  = PIC_3;                                          00012810
     CALL SEND_UTLINJE;                                                 00012820
     PIC_3 = B01.SPESOPPL.BOSATT(SØKER_IND);                            00012830
     UTLINJEO.FØRSTEO = 'BOSATTKODE PR. VIRKNINGSDATO' !!               00012840
                                           (20)'.';                     00012850
     UTLINJEO.ANDREO  = PIC_3;                                          00012860
     CALL SEND_UTLINJE;                                                 00012870
                                                                        00012880
     CALL EN_BLANK_LINJE;                                               00012890
     IF B01.UFØRPENS.UFG(SØKER_IND) > 0 THEN                            00012900
       DO;                                                              00012910
         PIC_ZZ9 = B01.UFØRPENS.UFG(SØKER_IND);                         00012920
         UTLINJEO.FØRSTEO = 'UFØREGRAD' !! (40)'.';                     00012930
         UTLINJEO.ANDREO  = PIC_ZZ9;                                    00012940
         CALL SEND_UTLINJE;                                             00012950
                                                                        00012960
         IF B01.YRKEPENS.YUG(SØKER_IND) > 0 THEN                        00012970
            DO;                                                         00012980
               PIC_ZZ9 = B01.YRKEPENS.YUG(SØKER_IND);                   00012990
               UTLINJEO.FØRSTEO = 'YRKEGRAD' !! (41)'.';                00013000
               UTLINJEO.ANDREO = PIC_ZZ9;                               00013010
               CALL SEND_UTLINJE;                                       00013020
            END;                                                        00013030
       END;                                                             00013040
                                                                        00013050
     SISTE_SIDE = '1'B;                                                 00013060
     GOTO OVERFLOW;                                                     00013070
                                                                        00013080
   SELECT_SIVILSTAND:                                                   00013090
        PROC(SIVILSTAND) RETURNS(CHAR(34) UNAL);                        00013100
          DCL                                                           00013110
             SIVILSTAND CHAR(1)  UNAL,                                  00013120
             RETUR      CHAR(34) UNAL;                                  00013130
                                                                        00013140
          SELECT(SIVILSTAND);                                           00013150
            WHEN('A')                                                   00013160
              RETUR = 'GIFT - LEVER ADSKILT';                           00013170
            WHEN('E')                                                   00013180
              RETUR = 'ETTERLATT';                                      00013190
            WHEN('G')                                                   00013200
              RETUR = 'GIFT';                                           00013210
            WHEN('P')                                                   00013220
              RETUR = 'PARTNER';                                        00013230
            WHEN('S')                                                   00013240
              RETUR = 'SKILT';                                          00013250
            WHEN('U')                                                   00013260
              RETUR = 'UGIFT';                                          00013270
            WHEN('W')                                                   00013280
              RETUR = 'SAMBOER';                                        00013290
            WHEN('V')                                                   00013300
              RETUR = 'SAMBOER';                                        00013310
            OTHERWISE                                                   00013320
              RETUR = 'FEIL SIVILSTANDKODE: ' !! SIVILSTAND;            00013330
          END;   /*  SELECT(SIVILSTAND)   */                            00013340
                                                                        00013350
        RETURN(RETUR);                                                  00013360
                                                                        00013370
   END SELECT_SIVILSTAND;                                               00013380
                                                                        00013390
 END BYGG_PERSONLIG_INFO;                                               00013400
                                                                        00013410
                                                                        00013420
 BYGG_BEREGNINGSGRUNNLAG:                                               00013430
   PROC;                                                                00013440
                                                                        00013450
     IF SIDE_TELL = 1 THEN                                              00013460
        BEHANDLE_NESTE_B = 'B010';                                      00013470
                                                                        00013480
     CALL LOW_VALUES_TIL_MAP;                                           00013490
                                                                        00013500
     SELECT (BEHANDLE_NESTE_B) ;                                        00013510
       WHEN ('B010')                                                    00013520
           GOTO L_B_010;                                                00013530
       WHEN ('B020')                                                    00013540
           GOTO L_B_020;                                                00013550
       WHEN ('B030')                                                    00013560
           GOTO L_B_030;                                                00013570
       WHEN ('B040')                                                    00013580
           GOTO L_B_040;                                                00013590
       WHEN ('B050')                                                    00013600
           GOTO L_B_050;                                                00013610
       WHEN ('B060')                                                    00013620
           GOTO L_B_060;                                                00013630
       WHEN ('B070')                                                    00013640
           GOTO L_B_070;                                                00013650
       WHEN ('B080')                                                    00013660
           GOTO L_B_080;                                                00013670
       WHEN ('B085')                                                    00013680
           GOTO L_B_085;                                                00013690
       WHEN ('B090')                                                    00013700
           GOTO L_B_090;                                                00013710
       WHEN ('B100')                                                    00013720
           GOTO L_B_100;                                                00013730
       WHEN ('B110')                                                    00013740
           GOTO L_B_110;                                                00013750
       WHEN ('B120')                                                    00013760
           GOTO L_B_120;                                                00013770
       WHEN ('B130')                                                    00013780
           GOTO L_B_130;                                                00013790
       WHEN ('B140')                                                    00013800
           GOTO L_B_140;                                                00013810
       WHEN ('B150')                                                    00013820
           GOTO L_B_150;                                                00013830
       WHEN ('B160')                                                    00013840
           GOTO L_B_160;                                                00013850
       WHEN ('B170')                                                    00013860
           GOTO L_B_170;                                                00013870
       WHEN ('B180')                                                    00013880
           GOTO L_B_180;                                                00013890
       WHEN ('B190')                                                    00013900
           GOTO L_B_190;                                                00013910
       WHEN ('B200')                                                    00013920
           GOTO L_B_200;                                                00013930
       WHEN ('B210')                                                    00013940
           GOTO L_B_210;                                                00013950
       WHEN ('B220')                                                    00013960
           GOTO L_B_220;                                                00013970
       WHEN ('B230')                                                    00013980
           GOTO L_B_230;                                                00013990
       WHEN ('B240')                                                    00014000
           GOTO L_B_240;                                                00014010
       WHEN ('B250')                                                    00014020
           GOTO L_B_250;                                                00014030
       WHEN ('B260')                                                    00014040
           GOTO L_B_260;                                                00014050
       WHEN ('B270')                                                    00014060
           GOTO L_B_270;                                                00014070
       OTHERWISE;                                                       00014080
     END;     /*  SELECT  */                                            00014090
                                                                        00014100
   L_B_010:                                                             00014110
         IF B01.SPESOPPL.FRAVIK_TRYGDET_3ÅR(SØKER_IND) = 'J' THEN       00014120
           DO;                                                          00014130
             UTLINJEO.FØRSTEO = 'FRAVIK TRYGDET' !! (40)'.';            00014140
             UTLINJEO.ANDREO  = 'DET ER GITT FRAVIK';                   00014150
             CALL SEND_UTLINJE;                                         00014160
           END;                                                         00014170
                                                                        00014180
         IF B01.SPESOPPL.FRAVIK_BOSATT(SØKER_IND) = 'J' THEN            00014190
           DO;                                                          00014200
             UTLINJEO.ANDREO  = 'DET ER GITT FRAVIK';                   00014210
             UTLINJEO.FØRSTEO = 'FRAVIK BOSATT' !! (40)'.';             00014220
             CALL SEND_UTLINJE;                                         00014230
           END;                                                         00014240
                                                                        00014250
                                                                        00014260
         /*****     OPPLYSNINGER OM TRYGDETID I STATUS - SEG.  *****/   00014270
         IF B01.STATUS.TT_FØR_1967(SØKER_IND) > 0 THEN                  00014280
           DO;                                                          00014290
             PIC_ZZ9 = B01.STATUS.TT_FØR_1967(SØKER_IND);               00014300
             UTLINJEO.FØRSTEO = 'TRYGDETID FØR 1967' !! (25)'.';        00014310
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                       00014320
             CALL SEND_UTLINJE;                                         00014330
           END;                                                         00014340
         IF B01.STATUS.TT_ETTER_1966(SØKER_IND) > 0 THEN                00014350
           DO;                                                          00014360
             PIC_ZZ9 = B01.STATUS.TT_ETTER_1966(SØKER_IND);             00014370
             UTLINJEO.FØRSTEO = 'FAKTISK TRYGDETID' !! (30)'.';         00014380
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MÅNEDER';                  00014390
             CALL SEND_UTLINJE;                                         00014400
           END;                                                         00014410
         IF B01.STATUS.TT_FRAMT(SØKER_IND) > 0 THEN                     00014420
           DO;                                                          00014430
             PIC_ZZ9 = B01.STATUS.TT_FRAMT(SØKER_IND);                  00014440
             UTLINJEO.FØRSTEO = 'FRAMTIDIG TRYGDETID FOR ' !!           00014450
                                'UFØR ELLER DØD' !! (10)'.';            00014460
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MÅNEDER';                  00014470
             CALL SEND_UTLINJE;                                         00014480
           END;                                                         00014490
         IF B01.STATUS.TT_67_TIL_70(SØKER_IND) > 0 THEN                 00014500
           DO;                                                          00014510
             PIC_ZZ9 = B01.STATUS.TT_67_TIL_70(SØKER_IND);              00014520
             UTLINJEO.FØRSTEO = 'TRYGDETID I ÅRENE ' !!                 00014530
                                '67,68 OG 69 FYLLES' !! (10)'.';        00014540
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                       00014550
             CALL SEND_UTLINJE;                                         00014560
           END;                                                         00014570
         IF B01.STATUS.TT_16_66(SØKER_IND) > 0 THEN                     00014580
           DO;                                                          00014590
             PIC_ZZ9 = B01.STATUS.TT_16_66(SØKER_IND);                  00014600
             UTLINJEO.FØRSTEO = 'TRYGDETID FRA 16  ' !!                 00014610
                                'TIL 66' !! (19)'.';                    00014620
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MÅNEDER';                  00014630
             CALL SEND_UTLINJE;                                         00014640
           END;                                                         00014650
                                                                        00014660
         IF B01.STATUS.TT_ANV(SØKER_IND) > 0 THEN                       00014670
           DO;                                                          00014680
             PIC_ZZ9 = B01.STATUS.TT_ANV(SØKER_IND);                    00014690
             UTLINJEO.FØRSTEO = 'ANVENDT TRYGDETID ' !!                 00014700
                                'VED BEREGNINGENE' !! (10)'.';          00014710
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                       00014720
             CALL SEND_UTLINJE;                                         00014730
           END;                                                         00014740
                                                                        00014750
         IF B01.STATUS.TT_GARANTI(SØKER_IND) > 0 THEN                   00014760
           DO;                                                          00014770
             PIC_ZZ9 = B01.STATUS.TT_GARANTI(SØKER_IND);                00014780
             UTLINJEO.FØRSTEO = 'GARANTI TRYGDETID' !! (30)'.';         00014790
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                       00014800
             CALL SEND_UTLINJE;                                         00014810
           END;                                                         00014820
                                                                        00014830
                                                                        00014840
         IF B01.STATUS.FRYSKODE (SØKER_IND) = '1'  THEN                 00014850
           DO;                                                          00014860
             PIC_Z9_SLASH_Y9 = F_SNU_DATO(                              00014870
                               (B01.STATUS.FRYSDATO_ÅM(SØKER_IND)));    00014880
             UTLINJEO.FØRSTEO = 'TIDSBEGRENSET 3 ÅR FRA' !! (24)'.';    00014890
             UTLINJEO.ANDREO  = PIC_Z9_SLASH_Y9;                        00014900
             CALL SEND_UTLINJE;                                         00014910
           END;                                                         00014920
         ELSE                                                           00014930
         IF B01.STATUS.FRYSKODE (SØKER_IND) = '2'  THEN                 00014940
           DO;                                                          00014950
             PIC_Z9_SLASH_Y9 = F_SNU_DATO(                              00014960
                               (B01.STATUS.FRYSDATO_ÅM(SØKER_IND)));    00014970
             UTLINJEO.FØRSTEO = 'UTEN TIDSBEGRENSING FRA' !! (24)'.';   00014980
             UTLINJEO.ANDREO  = PIC_Z9_SLASH_Y9;                        00014990
             CALL SEND_UTLINJE;                                         00015000
           END;                                                         00015010
                                                                        00015020
                                                                        00015030
         /*****     OPPLYSNINGER OM POENGTALL I ALDERSP - SEG.  *****/  00015040
         CALL EN_BLANK_LINJE;                                           00015050
         IF B01.ALDERSP.PÅ(SØKER_IND) > 0 THEN                          00015060
            DO;                                                         00015070
               PIC_ZZ9 = B01.ALDERSP.PÅ(SØKER_IND);                     00015080
                                                                        00015090
               IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN             00015100
                  DO;                                                   00015110
                     UTLINJEO.FØRSTEO  = 'ANTALL POENGÅR VED ' !!       00015120
                                         'AFP' !! (20)'.';              00015130
                     UTLINJEO.ANDREO   = PIC_ZZ9;                       00015140
                  END;                                                  00015150
               ELSE                                                     00015160
                  DO;                                                   00015170
                     UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!        00015180
                                        'ALDERSPENSJON' !! (15)'.';     00015190
                     UTLINJEO.ANDREO  = PIC_ZZ9;                        00015200
                  END;                                                  00015210
               CALL SEND_UTLINJE;                                       00015220
            END;                                                        00015230
         IF B01.ALDERSP.PÅ_ETTER91(SØKER_IND) > 0 THEN                  00015240
            DO;                                                         00015250
               PIC_ZZ9 = B01.ALDERSP.PÅ_ETTER91(SØKER_IND);             00015260
                                                                        00015270
               IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN             00015280
                  DO;                                                   00015290
                     UTLINJEO.FØRSTEO  =                                00015300
                    'ANTALL POENGÅR ETTER 1291 VED  AFP ' !!            00015310
                                          (07)'.';                      00015320
                     UTLINJEO.ANDREO   = PIC_ZZ9;                       00015330
                  END;                                                  00015340
               ELSE                                                     00015350
                  DO;                                                   00015360
                     UTLINJEO.FØRSTEO =                                 00015370
                    'ANTALL POENGÅR ETTER 1291 VED  ALDERSPEN' !!       00015380
                                         (02)'.';                       00015390
                     UTLINJEO.ANDREO  = PIC_ZZ9;                        00015400
                  END;                                                  00015410
               CALL SEND_UTLINJE;                                       00015420
            END;                                                        00015430
         IF B01.ALDERSP.OPT(SØKER_IND) > 0 THEN                         00015440
           DO;                                                          00015450
             PIC_9V99 = B01.ALDERSP.OPT(SØKER_IND);                     00015460
                                                                        00015470
             IF B01.PENSJONSTYPE1(SØKER_IND) = 'K'  THEN                00015480
               DO;                                                      00015490
                 UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL M/OVERKOMP VED ' !! 00015500
                                  'AFP' !! (10)'.';                     00015510
                 UTLINJEO.ANDREO  = PIC_9V99;                           00015520
               END;                                                     00015530
             ELSE                                                       00015540
               DO;                                                      00015550
                 UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL M/OVERKOMP VED ' !! 00015560
                                'ALDERSPENSJON' !! (5)'.';              00015570
                 UTLINJEO.ANDREO  = PIC_9V99;                           00015580
               END;                                                     00015590
             CALL SEND_UTLINJE;                                         00015600
           END;                                                         00015610
         IF B01.ALDERSP.SPT(SØKER_IND) > 0 THEN                         00015620
           DO;                                                          00015630
             PIC_9V99 = B01.ALDERSP.SPT(SØKER_IND)                      00015640
                      - B01.ALDERSP.OPT(SØKER_IND);                     00015650
             IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN                00015660
               DO;                                                      00015670
                 UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL U/OVERKOMP VED ' !! 00015680
                                    'AFP' !! (10)'.';                   00015690
                 UTLINJEO.ANDREO  = PIC_9V99;                           00015700
               END;                                                     00015710
             ELSE                                                       00015720
               DO;                                                      00015730
                 UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL U/OVERKOMP VED ' !! 00015740
                                    'ALDERSPENSJON' !! (5)'.';          00015750
                 UTLINJEO.ANDREO  = PIC_9V99;                           00015760
               END;                                                     00015770
             CALL SEND_UTLINJE;                                         00015780
           END;                                                         00015790
         IF B01.ALDERSP.VT_PÅ(SØKER_IND) > 0 THEN                       00015800
           DO;                                                          00015810
             PIC_ZZ9 = B01.ALDERSP.VT_PÅ(SØKER_IND);                    00015820
             UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                00015830
                                '67 ÅRS_DATO' !! (15)'.';               00015840
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00015850
             CALL SEND_UTLINJE;                                         00015860
           END;                                                         00015870
         IF B01.ALDERSP.VT_OPT(SØKER_IND) > 0 THEN                      00015880
           DO;                                                          00015890
             PIC_9V99 = B01.ALDERSP.VT_OPT(SØKER_IND);                  00015900
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL M/OVERKOMP VED ' !!     00015910
                                '67 ÅRS_DATO' !! (10)'.';               00015920
             UTLINJEO.ANDREO  = PIC_9V99;                               00015930
             CALL SEND_UTLINJE;                                         00015940
           END;                                                         00015950
         IF B01.ALDERSP.VT_SPT(SØKER_IND) > 0 THEN                      00015960
           DO;                                                          00015970
             PIC_9V99 = B01.ALDERSP.VT_SPT(SØKER_IND)                   00015980
                      - B01.ALDERSP.VT_OPT(SØKER_IND);                  00015990
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL U/OVERKOMP VED ' !!     00016000
                                '67 ÅRS-DATO' !! (5)'.';                00016010
             UTLINJEO.ANDREO  = PIC_9V99;                               00016020
             CALL SEND_UTLINJE;                                         00016030
           END;                                                         00016040
                                                                        00016050
         /*****     OPPLYSNINGER OM POENGTALL I UFØRPENS - SEG.  *****/ 00016060
                                                                        00016070
   L_B_020:                                                             00016080
         BEHANDLE_NESTE_B = 'B020';                                     00016090
         IF B01.INNTEKT_FØR_UP(SØKER_IND) > 0 THEN                      00016100
           DO;                                                          00016110
             PIC_ZZZZZZZZ9   = B01.INNTEKT_FØR_UP(SØKER_IND) * 100;     00016120
             UTLINJEO.FØRSTEO = 'INNTEKTSNIVÅ FØR' !!                   00016130
                                ' UFØRHET    '!! (19)'.';               00016140
             UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9;                          00016150
             CALL SEND_UTLINJE;                                         00016160
             CALL EN_BLANK_LINJE;                                       00016170
           END;                                                         00016180
         IF B01.UFØRPENS.PÅ(SØKER_IND) > 0 THEN                         00016190
           DO;                                                          00016200
             PIC_ZZ9 = B01.UFØRPENS.PÅ(SØKER_IND);                      00016210
             UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                00016220
                                'UFØRPENSJON' !! (15)'.';               00016230
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00016240
             CALL SEND_UTLINJE;                                         00016250
           END;                                                         00016260
         IF B01.UFØRPENS.PÅ_ETTER91(SØKER_IND) > 0 THEN                 00016270
           DO;                                                          00016280
             PIC_ZZ9 = B01.UFØRPENS.PÅ_ETTER91(SØKER_IND);              00016290
             UTLINJEO.FØRSTEO = 'ANTALL POENGÅR ETTER 1291 VED ' !!     00016300
                                'UFØRPENSJON' !! (5)'.';                00016310
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00016320
             CALL SEND_UTLINJE;                                         00016330
           END;                                                         00016340
   L_B_030:                                                             00016350
         BEHANDLE_NESTE_B = 'B030';                                     00016360
         IF B01.UFØRPENS.OPT(SØKER_IND) > 0 THEN                        00016370
           DO;                                                          00016380
             PIC_9V99 = B01.UFØRPENS.OPT(SØKER_IND);                    00016390
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL M/OVERKOMP VED ' !!     00016400
                                'UFØRPENSJON' !! (5)'.';                00016410
             UTLINJEO.ANDREO  = PIC_9V99;                               00016420
             CALL SEND_UTLINJE;                                         00016430
           END;                                                         00016440
   L_B_040:                                                             00016450
         BEHANDLE_NESTE_B = 'B040';                                     00016460
         IF B01.UFØRPENS.SPT(SØKER_IND) > 0 THEN                        00016470
           DO;                                                          00016480
             PIC_9V99 = B01.UFØRPENS.SPT(SØKER_IND)                     00016490
                      - B01.UFØRPENS.OPT(SØKER_IND);                    00016500
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL U/OVERKOMP VED ' !!     00016510
                                'UFØRPENSJON' !! (5)'.';                00016520
             UTLINJEO.ANDREO  = PIC_9V99;                               00016530
             CALL SEND_UTLINJE;                                         00016540
           END;                                                         00016550
                                                                        00016560
         /*****     OPPLYSNINGER OM POENGTALL I YRKEPENS - SEG.  *****/ 00016570
                                                                        00016580
   L_B_050:                                                             00016590
         BEHANDLE_NESTE_B = 'B050';                                     00016600
         IF B01.YRKEPENS.PÅ(SØKER_IND) > 0 THEN                         00016610
           DO;                                                          00016620
             PIC_ZZ9 = B01.YRKEPENS.PÅ(SØKER_IND);                      00016630
             UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                00016640
                                'YRKEPENSJON' !! (15)'.';               00016650
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00016660
             CALL SEND_UTLINJE;                                         00016670
           END;                                                         00016680
   L_B_060:                                                             00016690
         BEHANDLE_NESTE_B = 'B060';                                     00016700
         IF B01.YRKEPENS.SPT(SØKER_IND) > 0 THEN                        00016710
           DO;                                                          00016720
             PIC_9V99 = B01.YRKEPENS.SPT(SØKER_IND);                    00016730
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL VED ' !!                00016740
                                'YRKEPENSJON' !! (16)'.';               00016750
             UTLINJEO.ANDREO  = PIC_9V99;                               00016760
             CALL SEND_UTLINJE;                                         00016770
           END;                                                         00016780
   L_B_070:                                                             00016790
         BEHANDLE_NESTE_B = 'B070';                                     00016800
         IF B01.YRKEPENS.YPT(SØKER_IND) > 0 THEN                        00016810
           DO;                                                          00016820
             PIC_9V99 = B01.YRKEPENS.YPT(SØKER_IND);                    00016830
             UTLINJEO.FØRSTEO = 'YRKE-POENGTALL VED ' !!                00016840
                                'YRKEPENSJON' !! (16)'.';               00016850
             UTLINJEO.ANDREO  = PIC_9V99;                               00016860
             CALL SEND_UTLINJE;                                         00016870
           END;                                                         00016880
                                                                        00016890
         /*****     OPPLYSNINGER OM POENGTALL I ETTEPENS - SEG.  *****/ 00016900
                                                                        00016910
   L_B_080:                                                             00016920
         BEHANDLE_NESTE_B = 'B080';                                     00016930
         IF B01.ETTEPENS.PÅ_AVD(SØKER_IND) > 0 THEN                     00016940
           DO;                                                          00016950
             PIC_ZZ9 = B01.ETTEPENS.PÅ_AVD(SØKER_IND);                  00016960
             UTLINJEO.FØRSTEO = 'AVDØDES ANTALL POENGÅR' !! (25)'.';    00016970
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00016980
             CALL SEND_UTLINJE;                                         00016990
           END;                                                         00017000
   L_B_085:                                                             00017010
         BEHANDLE_NESTE_B = 'B085';                                     00017020
         IF B01.ETTEPENS.PÅ_ETTER91(SØKER_IND) > 0 THEN                 00017030
           DO;                                                          00017040
             PIC_ZZ9 = B01.ETTEPENS.PÅ_ETTER91(SØKER_IND) ;             00017050
             UTLINJEO.FØRSTEO = 'AVDØDES POENGÅR ETTER 1291       ' !!  00017060
                                                 (14)'.';               00017070
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00017080
             CALL SEND_UTLINJE;                                         00017090
           END;                                                         00017100
                                                                        00017110
   L_B_090:                                                             00017120
         BEHANDLE_NESTE_B = 'B090';                                     00017130
         IF B01.ETTEPENS.OPT_AVD(SØKER_IND) > 0 THEN                    00017140
           DO;                                                          00017150
             PIC_9V99 = B01.ETTEPENS.OPT_AVD(SØKER_IND);                00017160
             UTLINJEO.FØRSTEO = 'AVDØDES SLUTTPOENGTALL M/OVERKOMP' !!  00017170
                                                 (10)'.';               00017180
             UTLINJEO.ANDREO  = PIC_9V99;                               00017190
             CALL SEND_UTLINJE;                                         00017200
           END;                                                         00017210
   L_B_100:                                                             00017220
         BEHANDLE_NESTE_B = 'B100';                                     00017230
         IF B01.ETTEPENS.SPT_AVD(SØKER_IND) > 0 THEN                    00017240
           DO;                                                          00017250
             PIC_9V99 = B01.ETTEPENS.SPT_AVD(SØKER_IND)                 00017260
                      - B01.ETTEPENS.OPT_AVD(SØKER_IND);                00017270
             UTLINJEO.FØRSTEO = 'AVDØDES SLUTTPOENGTALL U/OVERKOMP' !!  00017280
                                                 (14)'.';               00017290
             UTLINJEO.ANDREO  = PIC_9V99;                               00017300
             CALL SEND_UTLINJE;                                         00017310
           END;                                                         00017320
                                                                        00017330
                                                                        00017340
         /*****     DIVERSE ANDRE OPPLYSNINGER    *********/            00017350
         BEHANDLE_NESTE_B = 'B110';                                     00017360
         CALL EN_BLANK_LINJE;                                           00017370
   L_B_110:                                                             00017380
         IF B01.ALDERSP.APD(SØKER_IND) > 0 THEN                         00017390
           DO;                                                          00017400
             PIC_ZZ9 = B01.ALDERSP.APD(SØKER_IND);                      00017410
             IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN                00017420
               DO;                                                      00017430
                  UTLINJEO.FØRSTEO = 'GRAD AV FULL AFP-' !!             00017440
                                     'PENSJON SOM TAS UT' !! (10)'.';   00017450
                  UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';             00017460
               END;                                                     00017470
             ELSE                                                       00017480
               DO;                                                      00017490
                  UTLINJEO.FØRSTEO = 'GRAD AV FULL ALDERS-' !!          00017500
                                     'PENSJON SOM TAS UT' !! (10)'.';   00017510
                  UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';             00017520
               END;                                                     00017530
             CALL SEND_UTLINJE;                                         00017540
           END;                                                         00017550
   L_B_120:                                                             00017560
         BEHANDLE_NESTE_B = 'B120';                                     00017570
         IF B01.ALDERSP.KONV_GRAD(SØKER_IND) > 0 THEN                   00017580
           DO;                                                          00017590
             PIC_ZZ9 = B01.ALDERSP.KONV_GRAD(SØKER_IND);                00017600
             UTLINJEO.FØRSTEO = 'KONVERTERINGSGRAD. APD ' !!            00017610
                                'VED OVERG. FRA UP/EP' !! (10)'.';      00017620
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                  00017630
             CALL SEND_UTLINJE;                                         00017640
           END;                                                         00017650
   L_B_130:                                                             00017660
         BEHANDLE_NESTE_B = 'B130';                                     00017670
         IF B01.ALDERSP.VENTEFAKTOR(SØKER_IND) > 0 THEN                 00017680
           DO;                                                          00017690
             PIC_ZZ9V99 = B01.ALDERSP.VENTEFAKTOR(SØKER_IND);           00017700
             UTLINJEO.FØRSTEO = 'VENTEFAKTOR SOM ANGIR ' !!             00017710
                                'TILLEGG I ALDERS-P' !! (10)'.';        00017720
             UTLINJEO.ANDREO  = PIC_ZZ9V99 !! ' PROSENT';               00017730
             CALL SEND_UTLINJE;                                         00017740
           END;                                                         00017750
                                                                        00017760
         IF B01.UFØRPENS.GARANTIGRAD(SØKER_IND) > 0 THEN                00017770
           DO;                                                          00017780
             PIC_ZZ9 = B01.UFØRPENS.GARANTIGRAD(SØKER_IND);             00017790
             UTLINJEO.FØRSTEO = 'GARANTI UFØRE GRAD  ' !! (24)'.';      00017800
                                                                        00017810
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                  00017820
             CALL SEND_UTLINJE;                                         00017830
           END;                                                         00017840
                                                                        00017850
                                                                        00017860
                                                                        00017870
         BEHANDLE_NESTE_B = 'B140';                                     00017880
         CALL EN_BLANK_LINJE;                                           00017890
                                                                        00017900
   L_B_140:                                                             00017910
                                                                        00017920
         IF B01.UFØRPENS.UFG(SØKER_IND) > 0 THEN                        00017930
           DO;                                                          00017940
             PIC_ZZ9 = B01.UFØRPENS.UFG(SØKER_IND);                     00017950
             UTLINJEO.FØRSTEO = 'GJELDENDE UFØREGRAD' !! (25)'.';       00017960
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                  00017970
             CALL SEND_UTLINJE;                                         00017980
           END;                                                         00017990
                                                                        00018000
   L_B_150:                                                             00018010
         BEHANDLE_NESTE_B = 'B150';                                     00018020
         IF B01.YRKEPENS.YUG(SØKER_IND) > 0 THEN                        00018030
           DO;                                                          00018040
             PIC_ZZ9 = B01.YRKEPENS.YUG(SØKER_IND);                     00018050
             UTLINJEO.FØRSTEO = 'GJELDENDE YRKEGRAD' !! (26)'.';        00018060
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                  00018070
             CALL SEND_UTLINJE;                                         00018080
           END;                                                         00018090
                                                                        00018100
   L_B_160:                                                             00018110
         BEHANDLE_NESTE_B = 'B160';                                     00018120
     /*0697 HL: */                                                      00018130
         DO INDEX_1 = UP_START1 TO 7 WHILE(B01.UFØRHIST.UFT_ÅM          00018140
                                         (SØKER_IND,INDEX_1) > 0);      00018150
            UP_START1 = INDEX_1;                                        00018160
                                                                        00018170
            CALL PERIODE ('UP-PERIODE',                                 00018180
            B01.UFØRHIST.UFT_ÅM (SØKER_IND,INDEX_1),                    00018190
            B01.UFØRHIST.UFG    (SØKER_IND,INDEX_1));                   00018200
                                                                        00018210
            PIC_ZZ9 = B01.UFØRHIST.UFKRITERIER(SØKER_IND,INDEX_1);      00018220
            PIC_9V99 = B01.UFØRHIST.BUP(SØKER_IND,INDEX_1);             00018230
            UTLINJEO.FØRSTEO =                                          00018240
            '    BEREGNET UFØREPOENG OG UFØREKRITERIER' !! (3)'.';      00018250
            UTLINJEO.ANDREO  = PIC_9V99 !! (7)' ' !! PIC_ZZ9;           00018260
            CALL SEND_UTLINJE;                                          00018270
                                                                        00018280
            PIC_9V99 = B01.UFØRHIST.BUP_GARANTI(SØKER_IND,INDEX_1);     00018290
            UTLINJEO.FØRSTEO =                                          00018300
            '    BUP_GARANTI OG BUP_GAR_KODE' !! (15)'.';               00018310
            UTLINJEO.ANDREO  = PIC_9V99 !! (9)' ' !!                    00018320
                 B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,INDEX_1);          00018330
            CALL SEND_UTLINJE;                                          00018340
                                                                        00018350
    /*0697 HL:*/                                                        00018360
            DO INDEX_2 = 1 TO 7 WHILE(B01.UFØRHIST.UFØRGRAD.            00018370
                            UFG_DATO_ÅM(SØKER_IND,INDEX_1,INDEX_2) > 0);00018380
               CALL PERIODE ('  UP-PERIODE',                            00018390
                            B01.UFØRHIST.UFØRGRAD.UFG_DATO_ÅM           00018400
                                       (SØKER_IND,INDEX_1,INDEX_2),     00018410
                            B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE            00018420
                                       (SØKER_IND,INDEX_1,INDEX_2));    00018430
            END;                      /***** INDEX_2 ****/              00018440
                                                                        00018450
            IF B01.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,INDEX_1) > 0 THEN  00018460
               DO;                                                      00018470
                  UTLINJEO.FØRSTEO = '  UP - SLUTT, DATO OG KODE' !!    00018480
                                                         (20)'.';       00018490
                  PIC_4 =B01.UFØRHIST.OPPHØRSDATO_ÅM(SØKER_IND,INDEX_1);00018500
                  PIC_Z9_SLASH_Y9 = F_SNU_DATO(PIC_4);                  00018510
                  UTLINJEO.ANDREO  = '1/'!!PIC_Z9_SLASH_Y9 !! (4)' ' !! 00018520
                           B01.UFØRHIST.OPPHØRSKODE(SØKER_IND,INDEX_1); 00018530
                  CALL SEND_UTLINJE;                                    00018540
               END;                                                     00018550
                                                                        00018560
         END;                     /***** INDEX_1 ****/                  00018570
                                                                        00018580
   L_B_170:                                                             00018590
         BEHANDLE_NESTE_B = 'B170';                                     00018600
         DO INDEX_1 = YP_START1 TO 5 WHILE(B01.YRKEHIST.YUFT_ÅM         00018610
                                         (SØKER_IND,INDEX_1) > 0);      00018620
            YP_START1 = INDEX_1;                                        00018630
                                                                        00018640
            CALL PERIODE ('YP-PERIODE',                                 00018650
            B01.YRKEHIST.YUFT_ÅM (SØKER_IND,INDEX_1),                   00018660
            B01.YRKEHIST.YUG    (SØKER_IND,INDEX_1));                   00018670
                                                                        00018680
            PIC_ZZZZZZZZ9 = B01.YRKEHIST.AÅI(SØKER_IND,INDEX_1);        00018690
            UTLINJEO.FØRSTEO =                                          00018700
            '    ANTATT ÅRLIG ARBEIDSINNT OG YRKESKODE' !! (5)'.';      00018710
            UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9 !! (6)' ' !!               00018720
                 B01.YRKEHIST.YRKE11(SØKER_IND,INDEX_1);                00018730
            CALL SEND_UTLINJE;                                          00018740
                                                                        00018750
            PIC_9V99 = B01.YRKEHIST.PAÅ(SØKER_IND,INDEX_1);             00018760
            UTLINJEO.FØRSTEO =  '    POENG BEREGNET ETTER ANT. ÅRL.' !! 00018770
                                ' INNT.' !! (3)'.';                     00018780
            UTLINJEO.ANDREO  = PIC_9V99;                                00018790
            CALL SEND_UTLINJE;                                          00018800
                                                                        00018810
            DO INDEX_2 = 1 TO 5 WHILE(B01.YRKEHIST.YRKEGRAD.            00018820
                            YUG_DATO_ÅM(SØKER_IND,INDEX_1,INDEX_2) > 0);00018830
               CALL PERIODE ('  YP-PERIODE',                            00018840
                            B01.YRKEHIST.YRKEGRAD.YUG_DATO_ÅM           00018850
                                       (SØKER_IND,INDEX_1,INDEX_2),     00018860
                            B01.YRKEHIST.YRKEGRAD.YUG_ØVRIGE            00018870
                                       (SØKER_IND,INDEX_1,INDEX_2));    00018880
            END;                      /***** INDEX_2 ****/              00018890
                                                                        00018900
            IF B01.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,INDEX_1) > 0 THEN    00018910
               DO;                                                      00018920
                  UTLINJEO.FØRSTEO = '  YP - SLUTT, DATO OG KODE' !!    00018930
                                                         (20)'.';       00018940
                  PIC_4 =B01.YRKEHIST.OPPH_DATO_ÅM(SØKER_IND,INDEX_1);  00018950
                  PIC_Z9_SLASH_Y9 = F_SNU_DATO(PIC_4);                  00018960
                  UTLINJEO.ANDREO  = '1/'!!PIC_Z9_SLASH_Y9 !! (4)' ' !! 00018970
                           B01.YRKEHIST.OPPH_KODE(SØKER_IND,INDEX_1);   00018980
                  CALL SEND_UTLINJE;                                    00018990
               END;                                                     00019000
                                                                        00019010
         END;                     /***** INDEX_1 ****/                  00019020
                                                                        00019030
   L_B_180:                                                             00019040
         BEHANDLE_NESTE_B = 'B180';                                     00019050
         IF B01.ALDERSP.UTTAKSDATO_ÅM(SØKER_IND) > 0 THEN               00019060
         IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN                   00019070
           CALL PERIODE ('AFP-PERIODE',                                 00019080
                          B01.ALDERSP.UTTAKSDATO_ÅM(SØKER_IND),         00019090
                          B01.ALDERSP.UTTAKS_APD   (SØKER_IND));        00019100
         ELSE                                                           00019110
           CALL PERIODE ('AP-PERIODE',                                  00019120
                          B01.ALDERSP.UTTAKSDATO_ÅM(SØKER_IND),         00019130
                          B01.ALDERSP.UTTAKS_APD   (SØKER_IND));        00019140
   L_B_190:                                                             00019150
         BEHANDLE_NESTE_B = 'B190';                                     00019160
                                                                        00019170
         DO I = AP_START TO 5 WHILE(B01.ALDERSP.VENTØVR.                00019180
                              UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,I) > 0);   00019190
           AP_START = I;                                                00019200
         IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN                   00019210
           CALL PERIODE ('AFP-PERIODE',                                 00019220
              B01.ALDERSP.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,I),    00019230
              B01.ALDERSP.VENTØVR.APD_ØVRIGE          (SØKER_IND,I));   00019240
         ELSE                                                           00019250
           CALL PERIODE ('AP-PERIODE',                                  00019260
              B01.ALDERSP.VENTØVR.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,I),    00019270
              B01.ALDERSP.VENTØVR.APD_ØVRIGE          (SØKER_IND,I));   00019280
         END;                                                           00019290
                                                                        00019300
         BEHANDLE_NESTE_B = 'B200';                                     00019310
         CALL EN_BLANK_LINJE;                                           00019320
   L_B_200:                                                             00019330
         IF B01.ALDERSP.FAI(SØKER_IND) > 0 THEN                         00019340
           DO;                                                          00019350
             PIC_ZZZZZZZZ9 = B01.ALDERSP.FAI(SØKER_IND) * 100;          00019360
             UTLINJEO.FØRSTEO = 'FREMTIDIG ARBEIDSINNTEKT' !! (20)'.';  00019370
             UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9;                          00019380
             CALL SEND_UTLINJE;                                         00019390
           END;                                                         00019400
                                                                        00019410
                                                                        00019420
         /*****     OPPLYSNINGER OM POENGTALL I ETTEBARN - SEG.  *****/ 00019430
                                                                        00019440
         BEHANDLE_NESTE_B = 'B210';                                     00019450
         CALL EN_BLANK_LINJE;                                           00019460
   L_B_210:                                                             00019470
         IF B01.ETTEBARN.PÅ_MOR(SØKER_IND) > 0 THEN                     00019480
           DO;                                                          00019490
             PIC_ZZ9 = B01.ETTEBARN.PÅ_MOR(SØKER_IND);                  00019500
             UTLINJEO.FØRSTEO = 'MORENS ANTALL POENGÅR' !! (25)'.';     00019510
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00019520
             CALL SEND_UTLINJE;                                         00019530
           END;                                                         00019540
                                                                        00019550
         BEHANDLE_NESTE_B = 'B220';                                     00019560
   L_B_220:                                                             00019570
         IF B01.ETTEBARN.OPT_MOR(SØKER_IND) > 0 THEN                    00019580
           DO;                                                          00019590
             PIC_9V99 = B01.ETTEBARN.OPT_MOR(SØKER_IND);                00019600
             UTLINJEO.FØRSTEO = 'MORENS SLUTTPOENGTALL M/OVERKOMP' !!   00019610
                                                 (12)'.';               00019620
             UTLINJEO.ANDREO  = PIC_9V99;                               00019630
             CALL SEND_UTLINJE;                                         00019640
           END;                                                         00019650
                                                                        00019660
         BEHANDLE_NESTE_B = 'B230';                                     00019670
   L_B_230:                                                             00019680
         IF B01.ETTEBARN.SPT_MOR(SØKER_IND) > 0 THEN                    00019690
           DO;                                                          00019700
             PIC_9V99 = B01.ETTEBARN.SPT_MOR(SØKER_IND)                 00019710
                      - B01.ETTEBARN.OPT_MOR(SØKER_IND);                00019720
             UTLINJEO.FØRSTEO = 'MORENS SLUTTPOENGTALL U/OVERKOMP' !!   00019730
                                                 (14)'.';               00019740
             UTLINJEO.ANDREO  = PIC_9V99;                               00019750
             CALL SEND_UTLINJE;                                         00019760
           END;                                                         00019770
                                                                        00019780
         BEHANDLE_NESTE_B = 'B240';                                     00019790
   L_B_240:                                                             00019800
         IF B01.ETTEBARN.PÅ_FAR(SØKER_IND) > 0 THEN                     00019810
           DO;                                                          00019820
             PIC_ZZ9 = B01.ETTEBARN.PÅ_FAR(SØKER_IND);                  00019830
             UTLINJEO.FØRSTEO = 'FARENS ANTALL POENGÅR' !! (25)'.';     00019840
             UTLINJEO.ANDREO  = PIC_ZZ9;                                00019850
             CALL SEND_UTLINJE;                                         00019860
           END;                                                         00019870
                                                                        00019880
         BEHANDLE_NESTE_B = 'B250';                                     00019890
   L_B_250:                                                             00019900
         IF B01.ETTEBARN.OPT_FAR(SØKER_IND) > 0 THEN                    00019910
           DO;                                                          00019920
             PIC_9V99 = B01.ETTEBARN.OPT_FAR(SØKER_IND);                00019930
             UTLINJEO.FØRSTEO = 'FARENS SLUTTPOENGTALL M/OVERKOMP' !!   00019940
                                                 (12)'.';               00019950
             UTLINJEO.ANDREO  = PIC_9V99;                               00019960
             CALL SEND_UTLINJE;                                         00019970
           END;                                                         00019980
                                                                        00019990
         BEHANDLE_NESTE_B = 'B260';                                     00020000
   L_B_260:                                                             00020010
         IF B01.ETTEBARN.SPT_FAR(SØKER_IND) > 0 THEN                    00020020
           DO;                                                          00020030
             PIC_9V99 = B01.ETTEBARN.SPT_FAR(SØKER_IND)                 00020040
                      - B01.ETTEBARN.OPT_FAR(SØKER_IND);                00020050
             UTLINJEO.FØRSTEO = 'FARENS SLUTTPOENGTALL U/OVERKOMP' !!   00020060
                                                 (14)'.';               00020070
             UTLINJEO.ANDREO  = PIC_9V99;                               00020080
             CALL SEND_UTLINJE;                                         00020090
           END;                                                         00020100
                                                                        00020110
         BEHANDLE_NESTE_B = 'B270';                                     00020120
   L_B_270:                                                             00020130
          IF B01.STATUS.GARANTI_TP(SØKER_IND) > 0 THEN                  00020140
            DO;                                                         00020150
              PIC_ZZZZ9 = B01.STATUS.GARANTI_TP(SØKER_IND);             00020160
              UTLINJEO.FØRSTEO = 'GARANTI-TP                     ' !!   00020170
                                                  (14)'.';              00020180
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00020190
              CALL SEND_UTLINJE;                                        00020200
            END;                                                        00020210
                                                                        00020220
                                                                        00020230
     SISTE_SIDE = '1'B;                                                 00020240
     GOTO OVERFLOW;                                                     00020250
                                                                        00020260
   PERIODE:                                                             00020270
     PROC(TYPE,DATO_ÅM,GRAD);                                           00020280
       DCL                                                              00020290
         TYPE     CHAR     (13) VARYING,                                00020300
         DATO_ÅM  FIXED DEC(4) UNAL,                                    00020310
         GRAD     FIXED DEC(3) UNAL;                                    00020320
                                                                        00020330
         PIC_4           = DATO_ÅM;                                     00020340
         PIC_Z9_SLASH_Y9 = F_SNU_DATO(PIC_4);                           00020350
         PIC_ZZ9         = GRAD;                                        00020360
         UTLINJEO.FØRSTEO = TYPE !! ' FRA DATO MED GRAD' !! (20)'.';    00020370
         UTLINJEO.ANDREO  = '1/'!!PIC_Z9_SLASH_Y9 !! (4)' ' !! PIC_ZZ9; 00020380
         CALL SEND_UTLINJE;                                             00020390
                                                                        00020400
   END PERIODE;                                                         00020410
 END BYGG_BEREGNINGSGRUNNLAG;                                           00020420
                                                                        00020430
                                                                        00020440
                                                                        00020450
                                                                        00020460
                                                                        00020470
 BYGG_YTELSER:                                                          00020480
   PROC;                                                                00020490
                                                                        00020500
     IF SIDE_TELL        =  1 THEN                                      00020510
        BEHANDLE_NESTE_Y = 'Y010';                                      00020520
                                                                        00020530
     CALL LOW_VALUES_TIL_MAP;                                           00020540
                                                                        00020550
     SELECT  (BEHANDLE_NESTE_Y);                                        00020560
        WHEN ('Y010')                                                   00020570
          GOTO Y010;                                                    00020580
                                                                        00020590
        WHEN ('Y210')                                                   00020600
          GOTO Y210;                                                    00020610
        OTHERWISE;                                                      00020620
     END;                                                               00020630
                                                                        00020640
          /******* OPPLYSNINGER FRA ALDERSP - SEGMENT ******/           00020650
     Y010:                                                              00020660
          IF B01.ALDERSP.GP(SØKER_IND) > 0 THEN                         00020670
            DO;                                                         00020680
              PIC_ZZZZ9 = B01.ALDERSP.GP(SØKER_IND);                    00020690
              IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN               00020700
               DO;                                                      00020710
                 UTLINJEO.FØRSTEO = 'AFP - GRUNNPENSJON BRUTTO'         00020720
                                                         !! (19)'.';    00020730
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00020740
               END;                                                     00020750
              ELSE                                                      00020760
               DO;                                                      00020770
                 UTLINJEO.FØRSTEO = 'AP - GRUNNPENSJON BRUTTO'          00020780
                                                         !! (20)'.';    00020790
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00020800
               END;                                                     00020810
              CALL SEND_UTLINJE;                                        00020820
            END;                                                        00020830
          IF B01.ALDERSP.TP(SØKER_IND) > 0 THEN                         00020840
            DO;                                                         00020850
              PIC_ZZZZ9 = B01.ALDERSP.TP(SØKER_IND);                    00020860
              IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN               00020870
                DO;                                                     00020880
                  UTLINJEO.FØRSTEO = 'AFP - TILLEGGSPENSJON BRUTTO'     00020890
                                                             !! (16)'.';00020900
                  UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';      00020910
                END;                                                    00020920
              ELSE                                                      00020930
                DO;                                                     00020940
                  UTLINJEO.FØRSTEO = 'AP - TILLEGGSPENSJON BRUTTO'      00020950
                                                             !! (17)'.';00020960
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00020970
                END;                                                    00020980
              CALL SEND_UTLINJE;                                        00020990
            END;                                                        00021000
    /*  BLANK    LINJE                                     */           00021010
              UTLINJEO.FØRSTEO = '                      ';              00021020
              UTLINJEO.ANDREO  = '                          ';          00021030
              CALL SEND_UTLINJE;                                        00021040
                                                                        00021050
          IF B01.ALDERSP.AP_GP_NETTO(SØKER_IND) > 0 THEN                00021060
            DO;                                                         00021070
              PIC_ZZZZ9 = B01.ALDERSP.AP_GP_NETTO(SØKER_IND);           00021080
              IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN               00021090
               DO;                                                      00021100
                 UTLINJEO.FØRSTEO = 'AFP - GRUNNPENSJON NETTO'          00021110
                                                             !! (20)'.';00021120
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00021130
               END;                                                     00021140
              ELSE                                                      00021150
               DO;                                                      00021160
                 UTLINJEO.FØRSTEO = 'AP - GRUNNPENSJON NETTO'           00021170
                                                            !! (20)'.'; 00021180
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00021190
               END;                                                     00021200
              CALL SEND_UTLINJE;                                        00021210
            END;                                                        00021220
                                                                        00021230
          IF B01.ALDERSP.AP_TP_NETTO(SØKER_IND) > 0 THEN                00021240
            DO;                                                         00021250
              PIC_ZZZZ9 = B01.ALDERSP.AP_TP_NETTO(SØKER_IND);           00021260
              IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN               00021270
               DO;                                                      00021280
                 UTLINJEO.FØRSTEO = 'AFP - TILLEGGSPENSJON NETTO'       00021290
                                                             !! (17)'.';00021300
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00021310
               END;                                                     00021320
              ELSE                                                      00021330
               DO;                                                      00021340
                 UTLINJEO.FØRSTEO = 'AP - TILLEGGSPENSJON NETTO'        00021350
                                                            !! (17)'.'; 00021360
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00021370
               END;                                                     00021380
              CALL SEND_UTLINJE;                                        00021390
            END;                                                        00021400
                                                                        00021410
          IF B01.ALDERSP.ST(SØKER_IND) > 0 THEN                         00021420
            DO;                                                         00021430
              PIC_ZZZZ9 = B01.ALDERSP.ST(SØKER_IND);                    00021440
              IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN              00021450
                DO;                                                     00021460
                  UTLINJEO.FØRSTEO = 'AFP - SÆRTILLEGG' !! (30)'.';     00021470
                  UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';      00021480
                END;                                                    00021490
              ELSE                                                      00021500
                DO;                                                     00021510
                   UTLINJEO.FØRSTEO = 'AP - SÆRTILLEGG' !! (30)'.';     00021520
                   UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';     00021530
                END;                                                    00021540
              CALL SEND_UTLINJE;                                        00021550
            END;                                                        00021560
          IF B01.ALDERSP.BT(SØKER_IND) > 0 THEN                         00021570
            DO;                                                         00021580
              UTLINJEO.FØRSTEO = 'AP - BARNETILLEGG' !! (30)'.';        00021590
                                                                        00021600
              PIC_ZZZZ9 = B01.ALDERSP.BT(SØKER_IND);                    00021610
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00021620
              CALL SEND_UTLINJE;                                        00021630
            END;                                                        00021640
          IF B01.AFP_TILLEGG(SØKER_IND) > 0 THEN                        00021650
            DO;                                                         00021660
              UTLINJEO.FØRSTEO = 'AFP - TILLEGG    ' !! (30)'.';        00021670
                                                                        00021680
              PIC_ZZZZ9 = B01.AFP_TILLEGG(SØKER_IND);                   00021690
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00021700
              CALL SEND_UTLINJE;                                        00021710
            END;                                                        00021720
          IF B01.ALDERSP.KT(SØKER_IND) > 0 THEN                         00021730
            DO;                                                         00021740
              PIC_ZZZZ9 = B01.ALDERSP.KT(SØKER_IND);                    00021750
              IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN               00021760
                DO;                                                     00021770
             UTLINJEO.FØRSTEO = 'AFP - KOMPENSASJONSTILLEGG' !! (20)'.';00021780
             UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';           00021790
                END;                                                    00021800
              ELSE                                                      00021810
                DO;                                                     00021820
              UTLINJEO.FØRSTEO = 'AP - KOMPENSASJONSTILLEGG' !! (20)'.';00021830
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00021840
                END;                                                    00021850
              CALL SEND_UTLINJE;                                        00021860
            END;                                                        00021870
          IF B01.ALDERSP.ET(SØKER_IND) > 0   THEN                       00021880
            DO;                                                         00021890
              PIC_ZZZZ9 = B01.ALDERSP.ET(SØKER_IND);                    00021900
              IF B01.PENSJONSTYPE1(SØKER_IND)  =  'K'  THEN             00021910
                DO;                                                     00021920
                 UTLINJEO.FØRSTEO = 'AFP - EKTEFELLETILLEGG' !! (22)'.';00021930
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00021940
                END;                                                    00021950
              ELSE                                                      00021960
                DO;                                                     00021970
                 UTLINJEO.FØRSTEO = 'AP - EKTEFELLETILLEGG' !! (22)'.'; 00021980
                 UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';       00021990
                END;                                                    00022000
              CALL SEND_UTLINJE;                                        00022010
            END;                                                        00022020
          IF B01.ALDERSP.GP_P67(SØKER_IND) > 0 THEN                     00022030
            DO;                                                         00022040
              PIC_ZZZZ9 = B01.ALDERSP.GP_P67(SØKER_IND);                00022050
              UTLINJEO.FØRSTEO = 'AP - GRUNNPENSJON PR.67-ÅRS DATO' !!  00022060
                                                        (15)'.';        00022070
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022080
              CALL SEND_UTLINJE;                                        00022090
            END;                                                        00022100
          IF B01.ALDERSP.TP_P67(SØKER_IND) > 0 THEN                     00022110
            DO;                                                         00022120
              PIC_ZZZZ9 = B01.ALDERSP.TP_P67(SØKER_IND);                00022130
              UTLINJEO.FØRSTEO = 'AP - TILLEGGSPENSJON PR. 67-ÅRS DATO' 00022140
                                                     !! (15)'.';        00022150
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022160
              CALL SEND_UTLINJE;                                        00022170
            END;                                                        00022180
          IF B01.ALDERSP.VT_GP(SØKER_IND) > 0 THEN                      00022190
            DO;                                                         00022200
              PIC_ZZZZ9 = B01.ALDERSP.VT_GP(SØKER_IND);                 00022210
              UTLINJEO.FØRSTEO = 'AP - VENTETILLEGG TIL GRUNNPENSJON'   00022220
                                                     !! (15)'.';        00022230
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022240
              CALL SEND_UTLINJE;                                        00022250
            END;                                                        00022260
          IF B01.ALDERSP.VT_TP(SØKER_IND) > 0 THEN                      00022270
            DO;                                                         00022280
              PIC_ZZZZ9 = B01.ALDERSP.VT_TP(SØKER_IND);                 00022290
              UTLINJEO.FØRSTEO = 'AP - VENTETILLEGG TIL TILLEGGSPENSJON'00022300
                                                     !! (15)'.';        00022310
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022320
              CALL SEND_UTLINJE;                                        00022330
            END;                                                        00022340
                                                                        00022350
          /******* OPPLYSNINGER FRA UFØRPENS - SEGMENT ******/          00022360
          IF B01.UFØRPENS.GP(SØKER_IND) > 0 THEN                        00022370
            DO;                                                         00022380
              PIC_ZZZZ9 = B01.UFØRPENS.GP(SØKER_IND);                   00022390
              UTLINJEO.FØRSTEO = 'UP - GRUNNPENSJON' !! (26)'.';        00022400
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022410
              CALL SEND_UTLINJE;                                        00022420
            END;                                                        00022430
          IF B01.UFØRPENS.ST(SØKER_IND) > 0 THEN                        00022440
            DO;                                                         00022450
              PIC_ZZZZ9 = B01.UFØRPENS.ST(SØKER_IND);                   00022460
              UTLINJEO.FØRSTEO = 'UP - SÆRTILLEGG' !! (28)'.';          00022470
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022480
              CALL SEND_UTLINJE;                                        00022490
            END;                                                        00022500
          IF B01.UFØRPENS.ÅFT(SØKER_IND) > 0 THEN                       00022510
            DO;                                                         00022520
              PIC_ZZZZ9 = B01.UFØRPENS.ÅFT(SØKER_IND);                  00022530
              UTLINJEO.FØRSTEO = 'UP - TILLEGG ETTER PARAGRAF 8-5-1'    00022540
                                                         !! (15)'.';    00022550
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022560
              CALL SEND_UTLINJE;                                        00022570
            END;                                                        00022580
          IF B01.UFØRPENS.ET(SØKER_IND) > 0  THEN                       00022590
            DO;                                                         00022600
              PIC_ZZZZ9 = B01.UFØRPENS.ET(SØKER_IND);                   00022610
              UTLINJEO.FØRSTEO = 'UP - EKTEFELLETILLEGG' !! (25)'.';    00022620
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022630
              CALL SEND_UTLINJE;                                        00022640
            END;                                                        00022650
          IF B01.UFØRPENS.BT(SØKER_IND) > 0 THEN                        00022660
            DO;                                                         00022670
              PIC_ZZZZ9 = B01.UFØRPENS.BT(SØKER_IND);                   00022680
              UTLINJEO.FØRSTEO = 'UP - BARNETILLEGG' !! (27)'.';        00022690
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022700
              CALL SEND_UTLINJE;                                        00022710
            END;                                                        00022720
                                                                        00022730
          IF B01.UFØRPENS.KT(SØKER_IND) > 0 THEN                        00022740
            DO;                                                         00022750
              PIC_ZZZZ9 = B01.UFØRPENS.KT(SØKER_IND);                   00022760
              UTLINJEO.FØRSTEO = 'UP - KOMPENSASJONSTILLEGG' !! (20)'.';00022770
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022780
              CALL SEND_UTLINJE;                                        00022790
            END;                                                        00022800
                                                                        00022810
          IF B01.UFØRPENS.TP(SØKER_IND) > 0 THEN                        00022820
            DO;                                                         00022830
              PIC_ZZZZ9 = B01.UFØRPENS.TP(SØKER_IND);                   00022840
              UTLINJEO.FØRSTEO = 'UP - TILLEGGSPENSJON' !! (25)'.';     00022850
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022860
              CALL SEND_UTLINJE;                                        00022870
            END;                                                        00022880
                                                                        00022890
          /******* OPPLYSNINGER FRA YRKEPENS - SEGMENT ******/          00022900
          IF B01.YRKEPENS.GP(SØKER_IND) > 0 THEN                        00022910
            DO;                                                         00022920
              PIC_ZZZZ9 = B01.YRKEPENS.GP(SØKER_IND);                   00022930
              UTLINJEO.FØRSTEO = 'YP - GRUNNPENSJON' !! (26)'.';        00022940
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00022950
              CALL SEND_UTLINJE;                                        00022960
            END;                                                        00022970
                                                                        00022980
          IF B01.YRKEPENS.BT(SØKER_IND) > 0 THEN                        00022990
            DO;                                                         00023000
              PIC_ZZZZ9 = B01.YRKEPENS.BT(SØKER_IND);                   00023010
              UTLINJEO.FØRSTEO = 'YP - BARNETILLEGG' !! (27)'.';        00023020
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023030
              CALL SEND_UTLINJE;                                        00023040
            END;                                                        00023050
                                                                        00023060
          IF B01.YRKEPENS.TP(SØKER_IND) > 0 THEN                        00023070
            DO;                                                         00023080
              PIC_ZZZZ9 = B01.YRKEPENS.TP(SØKER_IND);                   00023090
              UTLINJEO.FØRSTEO = 'YP - TILLEGGSPENSJON' !! (25)'.';     00023100
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023110
              CALL SEND_UTLINJE;                                        00023120
            END;                                                        00023130
                                                                        00023140
          /******* OPPLYSNINGER FRA ETTEPENS - SEGMENT ******/          00023150
                                                                        00023160
          IF B01.ETTEPENS.GP_NETTO (SØKER_IND) > 0  &                   00023170
             B01.ETTEPENS.FORVENTET(SØKER_IND) > 0 THEN                 00023180
            DO;                                                         00023190
              PIC_ZZZZ9 = B01.ETTEPENS.GP_NETTO(SØKER_IND);             00023200
              UTLINJEO.FØRSTEO = 'EP - GRUNNPENSJON MED FRADRAG AV ' !! 00023210
                                 'FORV. INNT';                          00023220
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023230
              CALL SEND_UTLINJE;                                        00023240
            END;                                                        00023250
                                                                        00023260
          IF B01.ETTEPENS.ST(SØKER_IND) > 0 THEN                        00023270
            DO;                                                         00023280
              PIC_ZZZZ9 = B01.ETTEPENS.ST(SØKER_IND);                   00023290
              UTLINJEO.FØRSTEO = 'EP - SÆRTILLEGG' !! (26)'.';          00023300
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023310
              CALL SEND_UTLINJE;                                        00023320
            END;                                                        00023330
                                                                        00023340
                                                                        00023350
          IF B01.ETTEPENS.KT(SØKER_IND) > 0 THEN                        00023360
            DO;                                                         00023370
              PIC_ZZZZ9 = B01.ETTEPENS.KT(SØKER_IND);                   00023380
              UTLINJEO.FØRSTEO = 'EP - KOMPENSASJONSTILLEGG' !! (20)'.';00023390
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023400
              CALL SEND_UTLINJE;                                        00023410
            END;                                                        00023420
                                                                        00023430
                                                                        00023440
          IF B01.ETTEPENS.TP_NETTO(SØKER_IND) > 0 THEN                  00023450
            DO;                                                         00023460
              PIC_ZZZZ9 = B01.ETTEPENS.TP_NETTO(SØKER_IND);             00023470
              UTLINJEO.FØRSTEO = 'EP - TILL.PENSJON MED FRADRAG AV ' !! 00023480
                                 'FORV. INNT';                          00023490
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023500
              CALL SEND_UTLINJE;                                        00023510
            END;                                                        00023520
                                                                        00023530
          /******* OPPLYSNINGER FRA ETTEBARN - SEGMENT ******/          00023540
       Y160:                                                            00023550
          BEHANDLE_NESTE_Y = 'Y160';                                    00023560
          IF B01.ETTEBARN.GP(SØKER_IND) > 0 THEN                        00023570
            DO;                                                         00023580
              PIC_ZZZZ9 = B01.ETTEBARN.GP(SØKER_IND);                   00023590
              UTLINJEO.FØRSTEO = 'ETTERLATT BARN - GRUNNPENSJON' !!     00023600
                                                      (20)'.';          00023610
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023620
              CALL SEND_UTLINJE;                                        00023630
            END;                                                        00023640
                                                                        00023650
                                                                        00023660
          IF B01.ETTEBARN.TP(SØKER_IND) > 0 THEN                        00023670
            DO;                                                         00023680
              PIC_ZZZZ9 = B01.ETTEBARN.TP(SØKER_IND);                   00023690
              UTLINJEO.FØRSTEO = 'ETTERLATT BARN - TILLEGGSPENSJON' !!  00023700
                                                      (20)'.';          00023710
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023720
              CALL SEND_UTLINJE;                                        00023730
            END;                                                        00023740
                                                                        00023750
                                                                        00023760
          IF B01.ETTEBARN.ST(SØKER_IND) > 0 THEN                        00023770
            DO;                                                         00023780
              PIC_ZZZZ9 = B01.ETTEBARN.ST(SØKER_IND);                   00023790
              UTLINJEO.FØRSTEO = 'ETTERLATT BARN - SÆRTILLEGG' !!       00023800
                                                      (20)'.';          00023810
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023820
              CALL SEND_UTLINJE;                                        00023830
            END;                                                        00023840
                                                                        00023850
                                                                        00023860
          IF B01.ETTEBARN.KT(SØKER_IND) > 0 THEN                        00023870
            DO;                                                         00023880
              PIC_ZZZZ9 = B01.ETTEBARN.KT(SØKER_IND);                   00023890
              UTLINJEO.FØRSTEO = 'ETTERLATT BARN - KOMPENSASJONSTILLEGG'00023900
                                                  !!  (20)'.';          00023910
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00023920
              CALL SEND_UTLINJE;                                        00023930
            END;                                                        00023940
                                                                        00023950
          IF B01.FORSI.GARANTITILLEGG_EK(SØKER_IND) > 0 THEN            00023960
            DO;                                                         00023970
              PIC_ZZZZ9 = B01.FORSI.GARANTITILLEGG_EK(SØKER_IND);       00023980
              UTLINJEO.FØRSTEO = 'GARANTITILLEGG_EK ' !! (26)'.';       00023990
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024000
              CALL SEND_UTLINJE;                                        00024010
            END;                                                        00024020
                                                                        00024030
          IF B01.FORSI.GARANTITILLEGG_BARN(SØKER_IND) > 0 THEN          00024040
            DO;                                                         00024050
              PIC_ZZZZ9 = B01.FORSI.GARANTITILLEGG_BARN(SØKER_IND);     00024060
              UTLINJEO.FØRSTEO = 'GARANTITILLEGG_BARN ' !! (24)'.';     00024070
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024080
              CALL SEND_UTLINJE;                                        00024090
            END;                                                        00024100
                                                                        00024110
                                                                        00024120
          IF B01.FORSI.BT_SÆRBARN(SØKER_IND) > 0 THEN                   00024130
            DO;                                                         00024140
              PIC_ZZZZ9 = B01.FORSI.BT_SÆRBARN (SØKER_IND);             00024150
              UTLINJEO.FØRSTEO = 'BT_SÆRBARN ' !! (34)'.';              00024160
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024170
              CALL SEND_UTLINJE;                                        00024180
            END;                                                        00024190
                                                                        00024200
          IF B01.FORSI.GARANTITILLEGG_SÆRBARN(SØKER_IND) > 0 THEN       00024210
            DO;                                                         00024220
              PIC_ZZZZ9 = B01.FORSI.GARANTITILLEGG_SÆRBARN (SØKER_IND); 00024230
              UTLINJEO.FØRSTEO = 'GARANTITILEGG_SÆRBARN ' !! (22)'.';   00024240
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024250
              CALL SEND_UTLINJE;                                        00024260
            END;                                                        00024270
                                                                        00024280
          IF B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND) > 0 THEN            00024290
            DO;                                                         00024300
              PIC_ZZZZ9 = B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND);       00024310
              UTLINJEO.FØRSTEO = 'GARANTI TILLEGG LOV92' !! (22)'.';    00024320
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024330
              CALL SEND_UTLINJE;                                        00024340
            END;                                                        00024350
                                                                        00024360
          BEHANDLE_NESTE_Y = 'Y090';                                    00024370
          IF B01.ETTEPENS.GP_BRUTTO(SØKER_IND) > 0 &                    00024380
             B01.ETTEPENS.FORVENTET(SØKER_IND) = 0 THEN                 00024390
            DO;                                                         00024400
              PIC_ZZZZ9 = B01.ETTEPENS.GP_BRUTTO(SØKER_IND);            00024410
              UTLINJEO.FØRSTEO = 'EP - GRUNNPENSJON' !! (30)'.';        00024420
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024430
              CALL SEND_UTLINJE;                                        00024440
            END;                                                        00024450
                                                                        00024460
                                                                        00024470
                                                                        00024480
       Y070:                                                            00024490
          BEHANDLE_NESTE_Y = 'Y070';                                    00024500
                                                                        00024510
          IF B01.STATUS.SUM_YTELSE(SØKER_IND) > 0 THEN                  00024520
            DO;                                                         00024530
              PIC_ZZZZ9 = B01.STATUS.SUM_YTELSE(SØKER_IND);             00024540
              UTLINJEO.FØRSTEO = 'SUM YTELSER' !! (33)'.';              00024550
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024560
              CALL SEND_UTLINJE;                                        00024570
            END;                                                        00024580
                                                                        00024590
    /*  BLANK    LINJE                                     */           00024600
              UTLINJEO.FØRSTEO = '                      ';              00024610
              UTLINJEO.ANDREO  = '                          ';          00024620
              CALL SEND_UTLINJE;                                        00024630
                                                                        00024640
                                                                        00024650
       Y120:                                                            00024660
          IF B01.ETTEPENS.GP_BRUTTO(SØKER_IND) > 0 &                    00024670
             B01.ETTEPENS.FORVENTET(SØKER_IND) > 0 THEN                 00024680
            DO;                                                         00024690
              PIC_ZZZZ9 = B01.ETTEPENS.GP_BRUTTO(SØKER_IND);            00024700
              UTLINJEO.FØRSTEO = 'EP - BRUTTO GRUNNPENSJON' !! (20)'.'; 00024710
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024720
              CALL SEND_UTLINJE;                                        00024730
            END;                                                        00024740
                                                                        00024750
          BEHANDLE_NESTE_Y = 'Y120';                                    00024760
          IF B01.ETTEPENS.TP_BRUTTO(SØKER_IND) > 0 THEN                 00024770
            DO;                                                         00024780
              PIC_ZZZZ9 = B01.ETTEPENS.TP_BRUTTO(SØKER_IND);            00024790
              UTLINJEO.FØRSTEO = 'EP - BRUTTO TILLEGGPENSJON' !!(20)'.';00024800
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00024810
              CALL SEND_UTLINJE;                                        00024820
            END;                                                        00024830
       Y140:                                                            00024840
          BEHANDLE_NESTE_Y = 'Y140';                                    00024850
          IF B01.ETTEPENS.FORVENTET(SØKER_IND) > 0 THEN                 00024860
            DO;                                                         00024870
              PIC_ZZZZZZZZ9 = B01.ETTEPENS.FORVENTET(SØKER_IND) * 100;  00024880
              UTLINJEO.FØRSTEO = 'FORVENTET ERVERVSINNTEKT' !! (20)'.'; 00024890
              UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9 !! ' KR.';               00024900
              CALL SEND_UTLINJE;                                        00024910
            END;                                                        00024920
       Y150:                                                            00024930
          BEHANDLE_NESTE_Y = 'Y150';                                    00024940
          IF B01.ETTEPENS.TP_BRUTTO(SØKER_IND) > 0 THEN                 00024950
            DO;                                                         00024960
              IF  B01.STATUS.SIVILSTAND(SØKER_IND) = 'E' THEN           00024970
                  PIC_ZZ9 = '055';                                      00024980
              ELSE                                                      00024990
                  PIC_ZZ9 = B01.ETTEPENS.TP_PROSENT(SØKER_IND);         00025000
              UTLINJEO.FØRSTEO = 'EP - TILLEGGSPENSJONEN UTGJØR' !!     00025010
                                                            (20)'.';    00025020
              UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                 00025030
              CALL SEND_UTLINJE;                                        00025040
            END;                                                        00025050
       Y210:                                                            00025060
          BEHANDLE_NESTE_Y = 'Y210';                                    00025070
          IF B01.STATUS.GARANTI_TP(SØKER_IND) > 0 THEN                  00025080
            DO;                                                         00025090
              PIC_ZZZZ9 = B01.STATUS.GARANTI_TP(SØKER_IND);             00025100
              UTLINJEO.FØRSTEO = 'GARANTI-TP ' !! (33)'.';              00025110
              UTLINJEO.ANDREO  = PIC_ZZZZ9 !! ' KR. PR. MND.';          00025120
              CALL SEND_UTLINJE;                                        00025130
            END;                                                        00025140
                                                                        00025150
                                                                        00025160
                                                                        00025170
                                                                        00025180
     SISTE_SIDE = '1'B;                                                 00025190
     GOTO OVERFLOW;                                                     00025200
                                                                        00025210
 END BYGG_YTELSER;                                                      00025220
                                                                        00025230
 BYGG_STATUS:                                                           00025240
   PROC;                                                                00025250
                                                                        00025260
                                                                        00025270
     IF SIDE_TELL = 1 THEN                                              00025280
        BEHANDLE_NESTE_F = 'F010';                                      00025290
                                                                        00025300
     CALL LOW_VALUES_TIL_MAP;                                           00025310
                                                                        00025320
     SELECT (BEHANDLE_NESTE_F);                                         00025330
                                                                        00025340
     WHEN ('F010')                                                      00025350
       DO;                                                              00025360
        CALL BYGG_GENHEAD('INFO FRA ROT');                              00025370
        CALL LOW_VALUES_TIL_MAP;                                        00025380
        ROTMENYO.SPRÅKO       = B01.RF0PERSN.SPRÅK(SØKER_IND);          00025390
        ROTMENYO.ANT_INNTEKTO = B01.RF0PERSN.AI67(SØKER_IND) * 100;     00025400
        ROTMENYO.SPERREO      = B01.RF0PERSN.SPERRE(SØKER_IND);         00025410
        ROTMENYO.VP_ÅR1O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,1); 00025420
        ROTMENYO.VP_ÅR2O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,2); 00025430
        ROTMENYO.VP_ÅR3O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,3); 00025440
        ROTMENYO.VP_ÅR4O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,4); 00025450
        EXEC CICS SEND MAP('ROTMENY') MAPSET('S001043') ACCUM PAGING;   00025460
        BEHANDLE_NESTE_F = 'F020';                                      00025470
        GOTO DOWHILE;                                                   00025480
       END;                                                             00025490
                                                                        00025500
     WHEN ('F020')                                                      00025510
       DO;                                                              00025520
        CALL BYGG_GENHEAD('STATUS SEGMENT');                            00025530
        CALL LOW_VALUES_TIL_MAP;                                        00025540
        CALL FYLL_STATUS;                                               00025550
        EXEC CICS SEND MAP('STATUS') MAPSET('S001043') ACCUM PAGING;    00025560
        BEHANDLE_NESTE_F = 'F030';                                      00025570
        GOTO DOWHILE;                                                   00025580
       END;                                                             00025590
                                                                        00025600
     WHEN ('F030')                                                      00025610
       DO;                                                              00025620
        CALL BYGG_GENHEAD('TILKN SEGMENT');                             00025630
        DO I = 1 TO 5;                                                  00025640
          CALL EN_BLANK_LINJE;                                          00025650
        END;                                                            00025660
        DO I = 1 TO 13 WHILE(B01.TILKN.FNR_TILKN(SØKER_IND,I) > 0);     00025670
           CALL LOW_VALUES_TIL_MAP;                                     00025680
           TILKNO.FNR_TILKNO  = B01.TILKN.FNR_TILKN       (SØKER_IND,I);00025690
           TILKNO.TILKN_KODEO = B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I);00025700
           TILKNO.FT_FØR_91O  = B01.TILKN.FT_FØR_91       (SØKER_IND,I);00025710
           EXEC CICS SEND MAP('TILKN') MAPSET('S001043') ACCUM PAGING;  00025720
        END;                                                            00025730
        BEHANDLE_NESTE_F = 'F035';                                      00025740
        GOTO DOWHILE;                                                   00025750
       END;                                                             00025760
                                                                        00025770
     WHEN ('F035')                                                      00025780
       DO;                                                              00025790
        CALL BYGG_GENHEAD('FORSI   SEGMENT');                           00025800
        CALL LOW_VALUES_TIL_MAP;                                        00025810
        CALL FYLL_FORSI;                                                00025820
        EXEC CICS SEND MAP('FORSI') MAPSET('S001043') ACCUM PAGING;     00025830
        BEHANDLE_NESTE_F = 'F040';                                      00025840
        GOTO DOWHILE;                                                   00025850
       END;                                                             00025860
                                                                        00025870
     WHEN ('F040')                                                      00025880
       DO;                                                              00025890
        CALL BYGG_GENHEAD('ALDERSP SEGMENT');                           00025900
        CALL LOW_VALUES_TIL_MAP;                                        00025910
        CALL FYLL_ALDER;                                                00025920
        EXEC CICS SEND MAP('ALDERSP') MAPSET('S001043') ACCUM PAGING;   00025930
        BEHANDLE_NESTE_F = 'F050';                                      00025940
        GOTO DOWHILE;                                                   00025950
       END;                                                             00025960
                                                                        00025970
     WHEN ('F050')                                                      00025980
       DO;                                                              00025990
        CALL BYGG_GENHEAD('UFØRE SEGMENT');                             00026000
        CALL LOW_VALUES_TIL_MAP;                                        00026010
        CALL FYLL_UFØR;                                                 00026020
        EXEC CICS SEND MAP('UFØRP') MAPSET('S001043') ACCUM PAGING;     00026030
        BEHANDLE_NESTE_F = 'F060';                                      00026040
        GOTO DOWHILE;                                                   00026050
       END;                                                             00026060
                                                                        00026070
     WHEN ('F060')                                                      00026080
       DO;                                                              00026090
        CALL BYGG_GENHEAD('UFØREHIST SEGMENT');                         00026100
        CALL LOW_VALUES_TIL_MAP;                                        00026110
        DO I = 1 TO 2 WHILE(B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) > 0);      00026120
           CALL LOW_VALUES_TIL_MAP;                                     00026130
           CALL FYLL_UFØRHIST;                                          00026140
           EXEC CICS SEND MAP('UFØRH') MAPSET('S001043') ACCUM PAGING;  00026150
        END;                                                            00026160
                                                                        00026170
        IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,3) > 0 THEN                    00026180
           DO;                                                          00026190
             CALL EN_BLANK_LINJE;                                       00026200
             CALL LOW_VALUES_TIL_MAP;                                   00026210
             UTLINJEO.FØRSTEO = (43)' ' ;                               00026220
             UTLINJEO.ANDREO  = 'FLERE UFØRHIST-SEGMENTER !!       ';   00026230
             CALL SEND_UTLINJE;                                         00026240
             BEHANDLE_NESTE_F = 'F06B';                                 00026250
           END;                                                         00026260
        ELSE                                                            00026270
           BEHANDLE_NESTE_F = 'F070';                                   00026280
                                                                        00026290
        GOTO DOWHILE;                                                   00026300
       END;                                                             00026310
                                                                        00026320
     WHEN ('F06B')                                                      00026330
       DO;                                                              00026340
        CALL BYGG_GENHEAD('UFØREHIST SEGMENT');                         00026350
        CALL LOW_VALUES_TIL_MAP;                                        00026360
        DO I = 3 TO 4 WHILE(B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) > 0);      00026370
           CALL LOW_VALUES_TIL_MAP;                                     00026380
           CALL FYLL_UFØRHIST;                                          00026390
           EXEC CICS SEND MAP('UFØRH') MAPSET('S001043') ACCUM PAGING;  00026400
        END;                                                            00026410
                                                                        00026420
        IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,5) > 0 THEN                    00026430
           DO;                                                          00026440
             CALL EN_BLANK_LINJE;                                       00026450
             CALL LOW_VALUES_TIL_MAP;                                   00026460
             UTLINJEO.FØRSTEO = (43)' ' ;                               00026470
             UTLINJEO.ANDREO  = 'FLERE UFØRHIST-SEGMENTER !!       ';   00026480
             CALL SEND_UTLINJE;                                         00026490
             BEHANDLE_NESTE_F = 'F06C';                                 00026500
           END;                                                         00026510
        ELSE                                                            00026520
           BEHANDLE_NESTE_F = 'F070';                                   00026530
                                                                        00026540
        GOTO DOWHILE;                                                   00026550
       END;                                                             00026560
                                                                        00026570
                                                                        00026580
     WHEN ('F06C')                                                      00026590
       DO;                                                              00026600
        CALL BYGG_GENHEAD('UFØREHIST SEGMENT');                         00026610
        CALL LOW_VALUES_TIL_MAP;                                        00026620
        DO I = 5 TO 6 WHILE(B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) > 0);      00026630
           CALL LOW_VALUES_TIL_MAP;                                     00026640
           CALL FYLL_UFØRHIST;                                          00026650
           EXEC CICS SEND MAP('UFØRH') MAPSET('S001043') ACCUM PAGING;  00026660
        END;                                                            00026670
                                                                        00026680
        IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,7) > 0 THEN                    00026690
           DO;                                                          00026700
             CALL EN_BLANK_LINJE;                                       00026710
             CALL LOW_VALUES_TIL_MAP;                                   00026720
             UTLINJEO.FØRSTEO = (43)' ' ;                               00026730
             UTLINJEO.ANDREO  = 'FLERE UFØRHIST-SEGMENTER !!       ';   00026740
             CALL SEND_UTLINJE;                                         00026750
             BEHANDLE_NESTE_F = 'F06D';                                 00026760
           END;                                                         00026770
        ELSE                                                            00026780
           BEHANDLE_NESTE_F = 'F070';                                   00026790
                                                                        00026800
        GOTO DOWHILE;                                                   00026810
       END;                                                             00026820
                                                                        00026830
                                                                        00026840
     WHEN ('F06D')                                                      00026850
       DO;                                                              00026860
        CALL BYGG_GENHEAD('UFØREHIST SEGMENT');                         00026870
        CALL LOW_VALUES_TIL_MAP;                                        00026880
        DO I = 7 TO 7 WHILE(B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) > 0);      00026890
           CALL LOW_VALUES_TIL_MAP;                                     00026900
           CALL FYLL_UFØRHIST;                                          00026910
           EXEC CICS SEND MAP('UFØRH') MAPSET('S001043') ACCUM PAGING;  00026920
        END;                                                            00026930
        BEHANDLE_NESTE_F = 'F070';                                      00026940
        GOTO DOWHILE;                                                   00026950
       END;                                                             00026960
                                                                        00026970
       WHEN ('F070')                                                    00026980
         DO;                                                            00026990
          CALL BYGG_GENHEAD('YRKEPENS   SEGMENT');                      00027000
          CALL LOW_VALUES_TIL_MAP;                                      00027010
          CALL FYLL_YSKADE;                                             00027020
          EXEC CICS SEND MAP('YRKEP') MAPSET('S001043') ACCUM PAGING;   00027030
          BEHANDLE_NESTE_F = 'F080';                                    00027040
          GOTO DOWHILE;                                                 00027050
         END;                                                           00027060
                                                                        00027070
       WHEN ('F080')                                                    00027080
         DO;                                                            00027090
          CALL BYGG_GENHEAD('YRKEHIST SEGMENT');                        00027100
          CALL LOW_VALUES_TIL_MAP;                                      00027110
          DO I = 1 TO 3 WHILE(B01.YRKEHIST.YUFT_ÅM(SØKER_IND,I) > 0);   00027120
             CALL LOW_VALUES_TIL_MAP;                                   00027130
             CALL FYLL_YRKEHIST;                                        00027140
             EXEC CICS SEND MAP('YRKEH') MAPSET('S001043') ACCUM PAGING;00027150
          END;                                                          00027160
                                                                        00027170
          IF B01.YRKEHIST.YUFT_ÅM(SØKER_IND,4) > 0 THEN                 00027180
             DO;                                                        00027190
               CALL EN_BLANK_LINJE;                                     00027200
               CALL LOW_VALUES_TIL_MAP;                                 00027210
               UTLINJEO.FØRSTEO = (43)' ' ;                             00027220
               UTLINJEO.ANDREO = 'FLERE YRKEHIST-SEGMENTER !!       ';  00027230
               CALL SEND_UTLINJE;                                       00027240
               BEHANDLE_NESTE_F = 'F08B';                               00027250
             END;                                                       00027260
          ELSE                                                          00027270
             BEHANDLE_NESTE_F = 'F090';                                 00027280
                                                                        00027290
             GOTO DOWHILE;                                              00027300
         END;                                                           00027310
                                                                        00027320
       WHEN ('F08B')                                                    00027330
         DO;                                                            00027340
          CALL BYGG_GENHEAD('YRKEHIST SEGMENT');                        00027350
          CALL LOW_VALUES_TIL_MAP;                                      00027360
          DO I = 4 TO 5 WHILE(B01.YRKEHIST.YUFT_ÅM(SØKER_IND,I) > 0);   00027370
             CALL LOW_VALUES_TIL_MAP;                                   00027380
             CALL FYLL_YRKEHIST;                                        00027390
             EXEC CICS SEND MAP('YRKEH') MAPSET('S001043') ACCUM PAGING;00027400
          END;                                                          00027410
          BEHANDLE_NESTE_F = 'F090';                                    00027420
          GOTO DOWHILE;                                                 00027430
         END;                                                           00027440
                                                                        00027450
     WHEN ('F090')                                                      00027460
       DO;                                                              00027470
        CALL BYGG_GENHEAD('ETTEPENS SEGMENT');                          00027480
        CALL LOW_VALUES_TIL_MAP;                                        00027490
        CALL FYLL_ETTERLATT;                                            00027500
        EXEC CICS SEND MAP('ETTEPEN') MAPSET('S001043') ACCUM PAGING;   00027510
        BEHANDLE_NESTE_F = 'F100';                                      00027520
        GOTO DOWHILE;                                                   00027530
       END;                                                             00027540
                                                                        00027550
     WHEN ('F100')                                                      00027560
       DO;                                                              00027570
        CALL BYGG_GENHEAD('ETTEBARN SEGMENT');                          00027580
        CALL LOW_VALUES_TIL_MAP;                                        00027590
        CALL FYLL_ETTEBARN;                                             00027600
        EXEC CICS SEND MAP('ETTEBA') MAPSET('S001043') ACCUM PAGING;    00027610
        BEHANDLE_NESTE_F = 'F105';                                      00027620
        GOTO DOWHILE;                                                   00027630
       END;                                                             00027640
                                                                        00027650
                                                                        00027660
     WHEN ('F105')                                                      00027670
       DO;                                                              00027680
        CALL BYGG_GENHEAD('EØSINFO  SEGMENT');                          00027690
        CALL LOW_VALUES_TIL_MAP;                                        00027700
        CALL FYLL_EØSINFO ;                                             00027710
        EXEC CICS SEND MAP('EØSINFO') MAPSET('S001043') ACCUM PAGING;   00027720
        BEHANDLE_NESTE_F = 'F110';                                      00027730
        GOTO DOWHILE;                                                   00027740
       END;                                                             00027750
                                                                        00027760
     WHEN ('F110')                                                      00027770
       DO;                                                              00027780
        CALL BYGG_GENHEAD('SPESOPPL SEGMENT');                          00027790
        CALL LOW_VALUES_TIL_MAP;                                        00027800
        CALL FYLL_SPESOPPL;                                             00027810
        EXEC CICS SEND MAP('SPESOP') MAPSET('S001043') ACCUM PAGING;    00027820
                                                                        00027830
        SISTE_SIDE = '1'B;                                              00027840
        GOTO OVERFLOW;                                                  00027850
       END;                                                             00027860
                                                                        00027870
     END;     /*  SELECT  */                                            00027880
                                                                        00027890
                                                                        00027900
     DOWHILE:                                                           00027910
        DO WHILE ('A' = 'A');                                           00027920
          CALL EN_BLANK_LINJE;                                          00027930
        END;                                                            00027940
                                                                        00027950
                                                                        00027960
     FYLL_STATUS:                                                       00027970
        PROC;                                                           00027980
                                                                        00027990
        STATUSO.VIRK_DATO_ÅMO    = B01.STATUS.VIRK_DATO_ÅM  (SØKER_IND);00028000
        STATUSO.STATUS_KODEO     = B01.STATUS_KODE          (SØKER_IND);00028010
        STATUSO.STAT_KODE_HISTO  = B01.STATUS_KODE_HIST     (SØKER_IND);00028020
        STATUSO.PENSJONSTYPE1O   = B01.STATUS.PENSJONSTYPE1 (SØKER_IND);00028030
        STATUSO.PENSJONSTYPE2O   = B01.STATUS.PENSJONSTYPE2 (SØKER_IND);00028040
        STATUSO.PENSJONSTYPE3O   = B01.STATUS.PENSJONSTYPE3 (SØKER_IND);00028050
        STATUSO.SIVILSTANDO      = B01.STATUS.SIVILSTAND    (SØKER_IND);00028060
        STATUSO.TT_FØR_1967O     = B01.STATUS.TT_FØR_1967   (SØKER_IND);00028070
        STATUSO.TT_ETTER_1966O   = B01.STATUS.TT_ETTER_1966 (SØKER_IND);00028080
        STATUSO.TT_FRAMTO        = B01.STATUS.TT_FRAMT      (SØKER_IND);00028090
        STATUSO.TT_67_TIL_70O    = B01.STATUS.TT_67_TIL_70  (SØKER_IND);00028100
        STATUSO.TT_ANVO          = B01.STATUS.TT_ANV        (SØKER_IND);00028110
        STATUSO.FØRSTE_GANG_REGO= B01.STATUS.FØRSTE_GANG_REG(SØKER_IND);00028120
        STATUSO.SUM_YTELSERO     = B01.STATUS.SUM_YTELSE    (SØKER_IND);00028130
        STATUSO.ANTALL_BARNO     = B01.STATUS.ANTALL_BARN   (SØKER_IND);00028140
        STATUSO.DØDSDATO_ÅMDO    = B01.STATUS.DØDSDATO_ÅMD  (SØKER_IND);00028150
        STATUSO.VILKÅR_8_4_3AO   = B01.STATUS.VILKÅR_8_4_3A (SØKER_IND);00028160
        STATUSO.TT_GARANTIO      = B01.STATUS.TT_GARANTI    (SØKER_IND);00028170
        STATUSO.G_DATO_ÅMO       = B01.STATUS.G_DATO_ÅM     (SØKER_IND);00028180
        STATUSO.P_TILLEGG_ÅMO    = B01.POENGTILLEGG_DATO_ÅM (SØKER_IND);00028190
        STATUSO.P_TILLEGG_KODEO  = B01.POENGTILLEGG_KODE    (SØKER_IND);00028200
        STATUSO.TP_GAR_KODEO     = B01.STATUS.TP_GAR_KODE   (SØKER_IND);00028210
        STATUSO.GML_SAMMENS_REGO =                                      00028220
                         B01.STATUS.GAMMEL_SAMMENSTØTS_REGEL(SØKER_IND);00028230
                                                                        00028240
        IF B01.STATUS.DØD_AV_YRKESSKADE (SØKER_IND) = 'J' THEN          00028250
           STATUSO.YSKADE_DØDO   = 'JA';                                00028260
        IF B01.STATUS.DØD_AV_YRKESSKADE (SØKER_IND) = 'E' THEN          00028270
           STATUSO.YSKADE_ETTERLO = 'JA';                               00028280
        IF B01.STATUS.DØD_AV_YRKESSKADE (SØKER_IND) = 'Y' THEN          00028290
           STATUSO.YSKADE_ETTERLO = 'YA';        /*9.10.89 HL*/         00028300
          STATUSO.PENSJONSRO     = B01.PENSJONSRETT_FØR_91(SØKER_IND);  00028310
          PIC_ZZ9                = B01.STATUS.TT_16_66(SØKER_IND);      00028320
          STATUSO.TT_16_66O      = PIC_ZZ9;                             00028330
          PIC_ZZZZ9              = B01.STATUS.GARANTI_TP(SØKER_IND);    00028340
          STATUSO.GARANTI_TPO    = PIC_ZZZZ9;                           00028350
                                                                        00028360
       STATUSO.GARANTI_DATO_ÅMO = B01.STATUS.GARANTI_DATO_ÅM(SØKER_IND);00028370
        STATUSO.GT_LOV92O        = B01.STATUS.GT_LOV92  (SØKER_IND);    00028380
        STATUSO.GT_TIL_LOV92O  = B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND);00028390
        STATUSO.GAMMEL_FT_KODEO = B01.STATUS.GAMMEL_FT_KODE(SØKER_IND); 00028400
        STATUSO.YRKES_KODEO     = B01.STATUS.YRKES_KODE (SØKER_IND);    00028410
        STATUSO.FRYSDATO_ÅMO   =  B01.STATUS.FRYSDATO_ÅM(SØKER_IND);    00028420
      STATUSO.EK_INNT_OVER_2GO = B01.STATUS.EK_INNT_OVER_2G(SØKER_IND); 00028430
                                                                        00028440
        IF B01.STATUS.FRYSKODE   (SØKER_IND) = '1' THEN                 00028450
           STATUSO.FRYSKODEO = 'TIDSBEGRENSET 3 ÅR' ;                   00028460
        ELSE                                                            00028470
        IF B01.STATUS.FRYSKODE   (SØKER_IND) = '2' THEN                 00028480
           STATUSO.FRYSKODEO = 'UBEGRENSET        ' ;                   00028490
        ELSE                                                            00028500
           STATUSO.FRYSKODEO = '                  ' ;                   00028510
      STATUSO.PENSJON_FØR_9802O =                                       00028520
                   B01.STATUS.PENSJON_FØR_9802(SØKER_IND);              00028530
     END FYLL_STATUS;                                                   00028540
                                                                        00028550
                                                                        00028560
     FYLL_ALDER:                                                        00028570
        PROC;                                                           00028580
                                                                        00028590
        ALDERSPO.GPO            = B01.ALDERSP.GP           (SØKER_IND); 00028600
        ALDERSPO.STO            = B01.ALDERSP.ST           (SØKER_IND); 00028610
        /*TRUDE ENDRING FRA 1092 AFP_TILLEGG   */                       00028620
        IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K'  THEN                    00028630
           ALDERSPO.BTO         = B01.AFP_TILLEGG          (SØKER_IND); 00028640
        ELSE                                                            00028650
           ALDERSPO.BTO         = B01.ALDERSP.BT           (SØKER_IND); 00028660
             /*TRUDE TIL HIT  */                                        00028670
        ALDERSPO.KTO            = B01.ALDERSP.KT           (SØKER_IND); 00028680
        ALDERSPO.ETO            = B01.ALDERSP.ET           (SØKER_IND); 00028690
        ALDERSPO.TPO            = B01.ALDERSP.TP           (SØKER_IND); 00028700
        ALDERSPO.SPTO           = B01.ALDERSP.SPT          (SØKER_IND); 00028710
        ALDERSPO.OPTO           = B01.ALDERSP.OPT          (SØKER_IND); 00028720
        ALDERSPO.PÅO            = B01.ALDERSP.PÅ           (SØKER_IND); 00028730
        ALDERSPO.APDO           = B01.ALDERSP.APD          (SØKER_IND); 00028740
        ALDERSPO.FAIO           = B01.ALDERSP.FAI  (SØKER_IND) * 100;   00028750
        ALDERSPO.FAI_DATO_ÅMO   = B01.ALDERSP.FAI_DATO_ÅM  (SØKER_IND); 00028760
        ALDERSPO.P67_KODEO      = B01.ALDERSP.P67_KODE     (SØKER_IND); 00028770
        ALDERSPO.KONV_P_KODEO   = B01.ALDERSP.KONV_P_KODE  (SØKER_IND); 00028780
        ALDERSPO.KONV_GRADO     = B01.ALDERSP.KONV_GRAD    (SØKER_IND); 00028790
        ALDERSPO.UTTAK_ÅMO      = B01.ALDERSP.UTTAKSDATO_ÅM(SØKER_IND); 00028800
        ALDERSPO.UTTAK_APDO     = B01.ALDERSP.UTTAKS_APD   (SØKER_IND); 00028810
        ALDERSPO.TT_VENTO       = B01.ALDERSP.TT_VENT      (SØKER_IND); 00028820
        ALDERSPO.VENTEFAKTORO   = B01.ALDERSP.VENTEFAKTOR  (SØKER_IND); 00028830
        ALDERSPO.VT_SPTO        = B01.ALDERSP.VT_SPT       (SØKER_IND); 00028840
        ALDERSPO.VT_OPTO        = B01.ALDERSP.VT_OPT       (SØKER_IND); 00028850
        ALDERSPO.VT_PÅO         = B01.ALDERSP.VT_PÅ        (SØKER_IND); 00028860
        ALDERSPO.GP_P67O        = B01.ALDERSP.GP_P67       (SØKER_IND); 00028870
        ALDERSPO.TP_P67O        = B01.ALDERSP.TP_P67       (SØKER_IND); 00028880
        ALDERSPO.VT_GPO         = B01.ALDERSP.VT_GP        (SØKER_IND); 00028890
        ALDERSPO.VT_TPO         = B01.ALDERSP.VT_TP        (SØKER_IND); 00028900
        ALDERSPO.UTTAK_ÅM_ØVR1O = B01.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,1);00028910
        ALDERSPO.APD_ØVR1O      = B01.APD_ØVRIGE          (SØKER_IND,1);00028920
        ALDERSPO.UTTAK_ÅM_ØVR2O = B01.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,2);00028930
        ALDERSPO.APD_ØVR2O      = B01.APD_ØVRIGE          (SØKER_IND,2);00028940
        ALDERSPO.UTTAK_ÅM_ØVR3O = B01.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,3);00028950
        ALDERSPO.APD_ØVR3O      = B01.APD_ØVRIGE          (SØKER_IND,3);00028960
        ALDERSPO.UTTAK_ÅM_ØVR4O = B01.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,4);00028970
        ALDERSPO.APD_ØVR4O      = B01.APD_ØVRIGE          (SØKER_IND,4);00028980
        ALDERSPO.UTTAK_ÅM_ØVR5O = B01.UTTAKSDATO_ÅM_ØVRIGE(SØKER_IND,5);00028990
        ALDERSPO.APD_ØVR5O      = B01.APD_ØVRIGE          (SØKER_IND,5);00029000
                                                                        00029010
        ALDERSPO.SPT_1291O      = B01.ALDERSP.SPT_1291    (SØKER_IND);  00029020
        ALDERSPO.OPT_1291O      = B01.ALDERSP.OPT_1291    (SØKER_IND);  00029030
        ALDERSPO.PÅ_1291O       = B01.ALDERSP.PÅ_1291     (SØKER_IND);  00029040
        ALDERSPO.PÅ_ETTER91O    = B01.ALDERSP.PÅ_ETTER91  (SØKER_IND);  00029050
        ALDERSPO.AP_TP_NETTOO   = B01.ALDERSP.AP_TP_NETTO (SØKER_IND);  00029060
        ALDERSPO.AP_GP_NETTOO   = B01.ALDERSP.AP_GP_NETTO (SØKER_IND);  00029070
        ALDERSPO.AFP_BUPO       = B01.ALDERSP.AFP_BUP     (SØKER_IND);  00029080
                                                                        00029090
     END FYLL_ALDER;                                                    00029100
                                                                        00029110
                                                                        00029120
     FYLL_FORSI:                                                        00029130
        PROC;                                                           00029140
                                                                        00029150
    FORSIO.GT_EKO          = B01.FORSI.GARANTITILLEGG_EK   (SØKER_IND); 00029160
    FORSIO.GT_BARNO        = B01.FORSI.GARANTITILLEGG_BARN (SØKER_IND); 00029170
    FORSIO.FT_SKAL_BEREGNO = B01.FORSI.FT_SKAL_BEREGNES    (SØKER_IND); 00029180
    FORSIO.ARB_INNTEKTO    = B01.FORSI.ARBEIDSINNTEKT      (SØKER_IND); 00029190
    FORSIO.PEN_INNTEKTO    = B01.FORSI.PENSJONSINNTEKT     (SØKER_IND); 00029200
    FORSIO.ARB_INNTEKT_EKO = B01.FORSI.ARBEIDSINNTEKT_EK   (SØKER_IND); 00029210
    FORSIO.PEN_INNTEKT_EKO = B01.FORSI.PENSJONSINNTEKT_EK  (SØKER_IND); 00029220
    FORSIO.BT_SÆRBARNO     = B01.FORSI.BT_SÆRBARN (SØKER_IND);          00029230
    FORSIO.G_TIL_SÆRBARNO =                                             00029240
                           B01.FORSI.GARANTITILLEGG_SÆRBARN(SØKER_IND); 00029250
                                                                        00029260
     END FYLL_FORSI;                                                    00029270
                                                                        00029280
                                                                        00029290
     FYLL_UFØR:                                                         00029300
        PROC;                                                           00029310
                                                                        00029320
        UFØRPO.UFGO           = B01.UFØRPENS.UFG     (SØKER_IND);       00029330
        UFØRPO.VILKÅR_8_4_3AO = B01.UFØRPENS.VILKÅR_8_4_3A              00029340
                                                     (SØKER_IND);       00029350
        UFØRPO.VILKÅR_8_1BO   = B01.UFØRPENS.VILKÅR_8_1B                00029360
                                                     (SØKER_IND);       00029370
        UFØRPO.GPO            = B01.UFØRPENS.GP      (SØKER_IND);       00029380
        UFØRPO.STO            = B01.UFØRPENS.ST      (SØKER_IND);       00029390
        UFØRPO.ÅFTO           = B01.UFØRPENS.ÅFT     (SØKER_IND);       00029400
        UFØRPO.ETO            = B01.UFØRPENS.ET      (SØKER_IND);       00029410
        UFØRPO.BTO            = B01.UFØRPENS.BT      (SØKER_IND);       00029420
        UFØRPO.KTO            = B01.UFØRPENS.KT      (SØKER_IND);       00029430
        UFØRPO.TPO            = B01.UFØRPENS.TP      (SØKER_IND);       00029440
        UFØRPO.SPTO           = B01.UFØRPENS.SPT     (SØKER_IND);       00029450
        UFØRPO.OPTO           = B01.UFØRPENS.OPT     (SØKER_IND);       00029460
        UFØRPO.PÅO            = B01.UFØRPENS.PÅ      (SØKER_IND);       00029470
        UFØRPO.UTDANNINGO     = B01.UFØRPENS.UTDANNING(SØKER_IND);      00029480
        UFØRPO.YRKESM_ATTFO   = B01.UFØRPENS.YRKESM_ATTF(SØKER_IND);    00029490
        UFØRPO.STIO           = B01.UFØRPENS.STI     (SØKER_IND);       00029500
        UFØRPO.GARANTERT_TPO  = B01.UFØRPENS.GARANTERT_TP(SØKER_IND);   00029510
        UFØRPO.INNTEKT_FØR_UPO =                                        00029520
                          B01.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND) * 100; 00029530
                                                                        00029540
        UFØRPO.YNGSTE_BARN_FÅRO =                                       00029550
                          B01.UFØRPENS.YNGSTE_BARN_FÅR  (SØKER_IND);    00029560
                                                                        00029570
        UFØRPO.SPT_1291O      = B01.UFØRPENS.SPT_1291 (SØKER_IND);      00029580
        UFØRPO.OPT_1291O      = B01.UFØRPENS.OPT_1291 (SØKER_IND);      00029590
        UFØRPO.PÅ_1291O       = B01.UFØRPENS.PÅ_1291 (SØKER_IND);       00029600
        UFØRPO.PÅ_ETTER91O    = B01.UFØRPENS.PÅ_ETTER91 (SØKER_IND);    00029610
        UFØRPO.INNT_DATO_ÅMO  = B01.UFØRPENS.INNT_DATO_ÅM(SØKER_IND);   00029620
        UFØRPO.GARANTIGRADO   = B01.UFØRPENS.GARANTIGRAD (SØKER_IND);   00029630
                                                                        00029640
        IF B01.UFØRPENS.UFG (SØKER_IND) > 0 !                           00029650
           B01.YRKEPENS.YUG (SØKER_IND) > 0 THEN                        00029660
           DO;  /* UFØREGRAD > 0 */                                     00029670
              INNTEKTSGR  = B_LOVLIG_INNT                               00029680
                            ((B01.UFØRHIST.UFT_ÅM(SØKER_IND,1)),        00029690
                             (B01.UFØRPENS.UFG(SØKER_IND)),             00029700
                             (B01.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND)),  00029710
                             (B01.UFØRPENS.INNT_DATO_ÅM(SØKER_IND)),    00029720
                             (B01.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND)),   00029730
                             (B01.UFØRPENS.SKJERM_ATTF(SØKER_IND)),     00029740
                             (B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1)),  00029750
                             (B01.STATUS.YRKES_KODE(SØKER_IND)));       00029760
              UFØRPO.B_LOVLIG_INNTEKO = INNTEKTSGR;                     00029770
              IF B01.TIDSBEGR_ATTF(SØKER_IND) = 'J' THEN                00029780
                 UFØRPO.TEXT_INNTO = 'TIDSBEGR. ATTF.';                 00029790
              ELSE                                                      00029800
              IF B01.SKJERM_ATTF(SØKER_IND) = 'J' THEN                  00029810
                 UFØRPO.TEXT_INNTO = 'VARIG ATTF.    ';                 00029820
              ELSE                                                      00029830
                 UFØRPO.TEXT_INNTO = 'EKSKL. FRIINNT ';                 00029840
           END; /* UFØREGRAD > 0 */                                     00029850
        ELSE                                                            00029860
           UFØRPO.TEXT_INNTO = 'IKKE AKTUELT    ';                      00029870
                                                                        00029880
     END FYLL_UFØR;                                                     00029890
                                                                        00029900
                                                                        00029910
     FYLL_UFØRHIST:                                                     00029920
        PROC;                                                           00029930
                                                                        00029940
        DCL   TAB7   (7)   CHAR (3);                                    00029950
        DCL   HTAB         PIC 'Z99';                                   00029960
                                                                        00029970
        DO  K = 1 TO 7;                                                 00029980
            IF  B01.UFG_DATO_ÅM (SØKER_IND,I,K) > 0 &                   00029990
                B01.UFG_ØVRIGE  (SØKER_IND,I,K) = 0   THEN              00030000
                TAB7 (K)              = '  0';                          00030010
         ELSE                                                           00030020
            IF  B01.UFG_DATO_ÅM (SØKER_IND,I,K) > 0 &                   00030030
                B01.UFG_ØVRIGE  (SØKER_IND,I,K) > 0   THEN              00030040
                DO;                                                     00030050
                   HTAB           = B01.UFG_ØVRIGE (SØKER_IND,I,K);     00030060
                   TAB7 (K)       = HTAB;                               00030070
                END;                                                    00030080
                                                                        00030090
          ELSE                                                          00030100
            IF  B01.UFG_DATO_ÅM (SØKER_IND,I,K) = 0 THEN                00030110
                TAB7 (K)       = '   ';                                 00030120
        END;                                                            00030130
                                                                        00030140
                                                                        00030150
        UFØRHO.UFG_ØVRIGE1O   = TAB7 (1);                               00030160
        UFØRHO.UFG_ØVRIGE2O   = TAB7 (2);                               00030170
        UFØRHO.UFG_ØVRIGE3O   = TAB7 (3);                               00030180
        UFØRHO.UFG_ØVRIGE4O   = TAB7 (4);                               00030190
        UFØRHO.UFG_ØVRIGE5O   = TAB7 (5);                               00030200
        UFØRHO.UFG_ØVRIGE6O   = TAB7 (6);                               00030210
        UFØRHO.UFG_ØVRIGE7O   = TAB7 (7);                               00030220
                                                                        00030230
                                                                        00030240
        UFØRHO.UFT_ÅMO        = B01.UFØRHIST.UFT_ÅM  (SØKER_IND,I);     00030250
        UFØRHO.UFGO           = B01.UFØRHIST.UFG     (SØKER_IND,I);     00030260
        UFØRHO.UFKRITERIERO   = B01.UFØRHIST.UFKRITERIER(SØKER_IND,I);  00030270
        UFØRHO.BUPO           = B01.UFØRHIST.BUP     (SØKER_IND,I);     00030280
        UFØRHO.BUP_GARANTIO   = B01.UFØRHIST.BUP_GARANTI(SØKER_IND,I);  00030290
        UFØRHO.BUP_GAR_KODEO  = B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,I); 00030300
        UFØRHO.OPPHØRSDATO_ÅMO= B01.OPPHØRSDATO_ÅM   (SØKER_IND,I);     00030310
        UFØRHO.OPPHØRSKODEO   = B01.OPPHØRSKODE      (SØKER_IND,I);     00030320
        UFØRHO.UFG_DATO_ÅM1O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,1);   00030330
        UFØRHO.UFG_DATO_ÅM2O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,2);   00030340
        UFØRHO.UFG_DATO_ÅM3O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,3);   00030350
        UFØRHO.UFG_DATO_ÅM4O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,4);   00030360
        UFØRHO.UFG_DATO_ÅM5O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,5);   00030370
        UFØRHO.UFG_DATO_ÅM6O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,6);   00030380
        UFØRHO.UFG_DATO_ÅM7O  = B01.UFG_DATO_ÅM      (SØKER_IND,I,7);   00030390
    /*                                                                  00030400
        UFØRHO.UFG_ØVRIGE1O   = B01.UFG_ØVRIGE       (SØKER_IND,I,1);   00030410
        UFØRHO.UFG_ØVRIGE2O   = B01.UFG_ØVRIGE       (SØKER_IND,I,2);   00030420
        UFØRHO.UFG_ØVRIGE3O   = B01.UFG_ØVRIGE       (SØKER_IND,I,3);   00030430
        UFØRHO.UFG_ØVRIGE4O   = B01.UFG_ØVRIGE       (SØKER_IND,I,4);   00030440
        UFØRHO.UFG_ØVRIGE5O   = B01.UFG_ØVRIGE       (SØKER_IND,I,5);   00030450
        UFØRHO.UFG_ØVRIGE6O   = B01.UFG_ØVRIGE       (SØKER_IND,I,6);   00030460
        UFØRHO.UFG_ØVRIGE7O   = B01.UFG_ØVRIGE       (SØKER_IND,I,7);   00030470
     */                                                                 00030480
        UFØRHO.REDUST_BUP_ÅRO = B01.REDUSERT_ANT_BUP_ÅR(SØKER_IND,I);   00030490
     END FYLL_UFØRHIST;                                                 00030500
                                                                        00030510
                                                                        00030520
       FYLL_YSKADE:                                                     00030530
        PROC;                                                           00030540
                                                                        00030550
        YRKEPO.YUGO           = B01.YRKEPENS.YUG     (SØKER_IND);       00030560
        YRKEPO.GPO            = B01.YRKEPENS.GP      (SØKER_IND);       00030570
        YRKEPO.BTO            = B01.YRKEPENS.BT      (SØKER_IND);       00030580
        YRKEPO.TPO            = B01.YRKEPENS.TP      (SØKER_IND);       00030590
        YRKEPO.YPTO           = B01.YRKEPENS.YPT     (SØKER_IND);       00030600
        YRKEPO.SPTO           = B01.YRKEPENS.SPT     (SØKER_IND);       00030610
        YRKEPO.PÅO            = B01.YRKEPENS.PÅ      (SØKER_IND);       00030620
        YRKEPO.YPT_KODEO      = B01.YRKEPENS.YPT_KODE(SØKER_IND);       00030630
        YRKEPO.YSYKDOMO       = B01.YSYKDOM          (SØKER_IND);       00030640
                                                                        00030650
        YRKEPO.PÅ_ETTER91O    = B01.YRKEPENS.PÅ_ETTER91(SØKER_IND);     00030660
        YRKEPO.YRKE_POENG_1291O  =                                      00030670
                               B01.YRKEPENS.YRKE_POENG_1291(SØKER_IND); 00030680
                                                                        00030690
       END FYLL_YSKADE;                                                 00030700
                                                                        00030710
                                                                        00030720
       FYLL_YRKEHIST:                                                   00030730
        PROC;                                                           00030740
                                                                        00030750
        DCL W01_VILKÅR_1_2_2      CHAR (2);                             00030760
        DCL W01_VILKÅR_1_2_2A  DEF(W01_VILKÅR_1_2_2) POS(1)  CHAR (1);  00030770
        DCL W01_VILKÅR_1_2_2B  DEF(W01_VILKÅR_1_2_2) POS(2)  CHAR (1);  00030780
                                                                        00030790
        YRKEHO.YUFT_ÅMO       = B01.YRKEHIST.YUFT_ÅM (SØKER_IND,I);     00030800
        YRKEHO.YUGO           = B01.YRKEHIST.YUG     (SØKER_IND,I);     00030810
        YRKEHO.YST_ÅMO        = B01.YRKEHIST.YST_ÅM  (SØKER_IND,I);     00030820
        YRKEHO.AÅIO           = B01.YRKEHIST.AÅI(SØKER_IND,I);          00030830
        YRKEHO.PAÅO           = B01.YRKEHIST.PAÅ(SØKER_IND,I);          00030840
        YRKEHO.YRKE11O        = B01.YRKEHIST.YRKE11  (SØKER_IND,I);     00030850
        W01_VILKÅR_1_2_2      = B01.YRKEHIST.VILKÅR_1_2_2(SØKER_IND,I); 00030860
        YRKEHO.VILKÅR_1_2_2AO = W01_VILKÅR_1_2_2A;                      00030870
        YRKEHO.VILKÅR_1_2_2BO = W01_VILKÅR_1_2_2B;                      00030880
        YRKEHO.KAP_11_7_UTLØSTO =                                       00030890
                             B01.YRKEHIST.KAP_11_7_UTLØST(SØKER_IND,I); 00030900
        YRKEHO.OPPHØRSDATO_ÅMO= B01.OPPH_DATO_ÅM     (SØKER_IND,I);     00030910
        YRKEHO.OPPHØRSKODEO   = B01.OPPH_KODE        (SØKER_IND,I);     00030920
        YRKEHO.YUG_DATO_ÅM1O  = B01.YUG_DATO_ÅM      (SØKER_IND,I,1);   00030930
        YRKEHO.YUG_ØVRIGE1O   = B01.YUG_ØVRIGE       (SØKER_IND,I,1);   00030940
        YRKEHO.YUG_DATO_ÅM2O  = B01.YUG_DATO_ÅM      (SØKER_IND,I,2);   00030950
        YRKEHO.YUG_ØVRIGE2O   = B01.YUG_ØVRIGE       (SØKER_IND,I,2);   00030960
        YRKEHO.YUG_DATO_ÅM3O  = B01.YUG_DATO_ÅM      (SØKER_IND,I,3);   00030970
        YRKEHO.YUG_ØVRIGE3O   = B01.YUG_ØVRIGE       (SØKER_IND,I,3);   00030980
        YRKEHO.YUG_DATO_ÅM4O  = B01.YUG_DATO_ÅM      (SØKER_IND,I,4);   00030990
        YRKEHO.YUG_ØVRIGE4O   = B01.YUG_ØVRIGE       (SØKER_IND,I,4);   00031000
        YRKEHO.YUG_DATO_ÅM5O  = B01.YUG_DATO_ÅM      (SØKER_IND,I,5);   00031010
        YRKEHO.YUG_ØVRIGE5O   = B01.YUG_ØVRIGE       (SØKER_IND,I,5);   00031020
       END FYLL_YRKEHIST;                                               00031030
                                                                        00031040
                                                                        00031050
     FYLL_ETTERLATT:                                                    00031060
        PROC;                                                           00031070
                                                                        00031080
        ETTEPENO.OMSORG_AVD_BAO  = B01.OMSORG_AVD_BA      (SØKER_IND);  00031090
        ETTEPENO.VILKÅR_10_5O    = B01.VILKÅR_10_5        (SØKER_IND);  00031100
        ETTEPENO.HJEMMEL_10_8O   = B01.HJEMMEL_10_8       (SØKER_IND);  00031110
        ETTEPENO.GP_BRUTTOO      = B01.ETTEPENS.GP_BRUTTO (SØKER_IND);  00031120
        ETTEPENO.GP_NETTOO       = B01.ETTEPENS.GP_NETTO  (SØKER_IND);  00031130
        ETTEPENO.STO             = B01.ETTEPENS.ST        (SØKER_IND);  00031140
        ETTEPENO.KTO             = B01.ETTEPENS.KT        (SØKER_IND);  00031150
        ETTEPENO.TP_BRUTTOO      = B01.ETTEPENS.TP_BRUTTO (SØKER_IND);  00031160
        ETTEPENO.TP_NETTOO       = B01.ETTEPENS.TP_NETTO  (SØKER_IND);  00031170
        ETTEPENO.SPT_AVDO        = B01.ETTEPENS.SPT_AVD   (SØKER_IND);  00031180
        ETTEPENO.OPT_AVDO        = B01.ETTEPENS.OPT_AVD   (SØKER_IND);  00031190
        ETTEPENO.PÅ_AVDO         = B01.ETTEPENS.PÅ_AVD    (SØKER_IND);  00031200
        ETTEPENO.TP_PROSENTO     = B01.ETTEPENS.TP_PROSENT(SØKER_IND);  00031210
        ETTEPENO.FORVENTETO      = B01.ETTEPENS.FORVENTET (SØKER_IND)   00031220
                                                               *  100;  00031230
        ETTEPENO.FRAMLEGGDATO_ÅMO =                                     00031240
                              B01.ETTEPENS.FRAMLEGGSDATO_ÅM(SØKER_IND); 00031250
        ETTEPENO.FRAMLEGGSKODEO  =                                      00031260
                                 B01.ETTEPENS.FRAMLEGGSKODE(SØKER_IND); 00031270
        ETTEPENO.STIO            = B01.ETTEPENS.STI  (SØKER_IND);       00031280
                                                                        00031290
        ETTEPENO.SPT_1291O       = B01.ETTEPENS.SPT_1291 (SØKER_IND);   00031300
        ETTEPENO.OPT_1291O       = B01.ETTEPENS.OPT_1291 (SØKER_IND);   00031310
        ETTEPENO.PÅ_1291O        = B01.ETTEPENS.PÅ_1291 (SØKER_IND);    00031320
        ETTEPENO.PÅ_ETTER91O     = B01.ETTEPENS.PÅ_ETTER91(SØKER_IND);  00031330
                                                                        00031340
     END FYLL_ETTERLATT;                                                00031350
                                                                        00031360
                                                                        00031370
     FYLL_ETTEBARN:                                                     00031380
        PROC;                                                           00031390
                                                                        00031400
      ETTEBAO.PENSJON_ETTERO  = B01.PENSJON_ETTER      (SØKER_IND);     00031410
      ETTEBAO.GPO             = B01.ETTEBARN.GP        (SØKER_IND);     00031420
      ETTEBAO.TPO             = B01.ETTEBARN.TP        (SØKER_IND);     00031430
      ETTEBAO.STO             = B01.ETTEBARN.ST        (SØKER_IND);     00031440
      ETTEBAO.KTO             = B01.ETTEBARN.KT        (SØKER_IND);     00031450
      ETTEBAO.SPT_MORO        = B01.ETTEBARN.SPT_MOR   (SØKER_IND);     00031460
      ETTEBAO.OPT_MORO        = B01.ETTEBARN.OPT_MOR   (SØKER_IND);     00031470
      ETTEBAO.PÅ_MORO         = B01.ETTEBARN.PÅ_MOR    (SØKER_IND);     00031480
      ETTEBAO.SPT_FARO        = B01.ETTEBARN.SPT_FAR   (SØKER_IND);     00031490
      ETTEBAO.OPT_FARO        = B01.ETTEBARN.OPT_FAR   (SØKER_IND);     00031500
      ETTEBAO.PÅ_FARO         = B01.ETTEBARN.PÅ_FAR    (SØKER_IND);     00031510
                                                                        00031520
      ETTEBAO.SPT_1291_MORO  = B01.ETTEBARN.SPT_1291_MOR (SØKER_IND);   00031530
      ETTEBAO.OPT_1291_MORO  = B01.ETTEBARN.OPT_1291_MOR (SØKER_IND);   00031540
      ETTEBAO.PÅ_1291_MORO   = B01.ETTEBARN.PÅ_1291_MOR (SØKER_IND);    00031550
      ETTEBAO.PÅ_ETTER91_MORO  =                                        00031560
                            B01.ETTEBARN.PÅ_ETTER91_MOR (SØKER_IND);    00031570
                                                                        00031580
      ETTEBAO.SPT_1291_FARO  = B01.ETTEBARN.SPT_1291_FAR (SØKER_IND);   00031590
      ETTEBAO.OPT_1291_FARO  = B01.ETTEBARN.OPT_1291_FAR (SØKER_IND);   00031600
      ETTEBAO.PÅ_1291_FARO   = B01.ETTEBARN.PÅ_1291_FAR (SØKER_IND);    00031610
      ETTEBAO.PÅ_ETTER91_FARO  =                                        00031620
                            B01.ETTEBARN.PÅ_ETTER91_FAR (SØKER_IND);    00031630
                                                                        00031640
     END FYLL_ETTEBARN;                                                 00031650
                                                                        00031660
                                                                        00031670
     FYLL_EØSINFO:                                                      00031680
        PROC;                                                           00031690
                                                                        00031700
    EØSINFOO.BEREGN_FOLKETRYO  = B01.BEREGN_FOLKETRYGD(SØKER_IND);      00031710
    EØSINFOO.PRO_RATA_BEREGNO  = B01.PRO_RATA_BEREGNING (SØKER_IND);    00031720
                                                                        00031730
    EØSINFOO.TT_PRO_RATA_MNDO  = B01.TT_PRO_RATA_MND (SØKER_IND);       00031740
    EØSINFOO.TT_TEO_EØS_MNDO   = B01.TT_TEORETISK_EØS_MND (SØKER_IND);  00031750
                                                                        00031760
                                                                        00031770
                                                                        00031780
    EØSINFOO.GJSNITT_EØS_PO    = B01.SPT_EØS(SØKER_IND);                00031790
    EØSINFOO.GJ_EØS_P_LOV92O   = B01.OPT_EØS(SØKER_IND);                00031800
                                                                        00031810
    EØSINFOO.EØS_8_4_3AO       = B01.EØS_8_4_3A         (SØKER_IND);    00031820
    EØSINFOO.ANT_NORSK_ETT91O =                                         00031830
                          B01.ANTALL_NORSKE_PÅ_ETTER91(SØKER_IND);      00031840
                                                                        00031850
                                                                        00031860
    EØSINFOO.ALTERNATIV_GPO    = B01.ALTERNATIV_GP   (SØKER_IND);       00031870
    EØSINFOO.ALTERNATIV_TPO    = B01.ALTERNATIV_TP   (SØKER_IND);       00031880
    EØSINFOO.ALTERNATIV_BTO    = B01.ALTERNATIV_BT   (SØKER_IND);       00031890
    EØSINFOO.ALTERNATIV_ETO    = B01.ALTERNATIV_ET   (SØKER_IND);       00031900
    EØSINFOO.ALTERNATIV_STO    = B01.ALTERNATIV_ST   (SØKER_IND);       00031910
    EØSINFOO.ALTERNATIV_SUMO  = B01.ALTERNATIV_SUM_PENSJON (SØKER_IND); 00031920
                                                                        00031930
    PIC_3                      = B01.ANTALL_NORSKE_PÅ (SØKER_IND);      00031940
    EØSINFOO.ANTT_NORSKE_PÅRO  = PIC_3;                                 00031950
    PIC_7                      = B01.PENSJON_EØS      (SØKER_IND);      00031960
    EØSINFOO.PENSJON_EØSO      = PIC_7;                                 00031970
                                                                        00031980
    DO K = 1   TO 33 ;                                                  00031990
       EØSINFOO.INNTEKTSÅR_EØSO (K)  = 00 ;                             00032000
                                                                        00032010
    END;                                                                00032020
                                                                        00032030
    L = 1;                                                              00032040
    DO K = 67  TO 99 ;                                                  00032050
       IF B01.INNTEKTSÅR_EØS (SØKER_IND, K ) = '1'B THEN                00032060
          DO;                                                           00032070
              X_CHAR  =  K;                                             00032080
              EØSINFOO.INNTEKTSÅR_EØSO (L)  = X_CHAR ;                  00032090
              L = L + 1;                                                00032100
          END;                                                          00032110
                                                                        00032120
    END;                                                                00032130
                                                                        00032140
                                                                        00032150
    END  FYLL_EØSINFO;                                                  00032160
                                                                        00032170
                                                                        00032180
     FYLL_SPESOPPL:                                                     00032190
        PROC;                                                           00032200
                                                                        00032210
        SPESOPO.STATSBORGERO    = B01.STATSBORGER        (SØKER_IND);   00032220
        SPESOPO.FRAVIK_FLYKTNO  = B01.FRAVIK_FLYKTN      (SØKER_IND);   00032230
        SPESOPO.OVERKOMP_UTLO   = B01.OVERKOMP_UTL       (SØKER_IND);   00032240
        SPESOPO.BOSATTO         = B01.BOSATT             (SØKER_IND);   00032250
        SPESOPO.UNNTAK_12_2O    = B01.UNNTAK_12_2        (SØKER_IND);   00032260
        SPESOPO.FRAVIK_BOSATTO  = B01.FRAVIK_BOSATT      (SØKER_IND);   00032270
        SPESOPO.FRAVIK_TRYGDET3O= B01.FRAVIK_TRYGDET_3ÅR (SØKER_IND);   00032280
        SPESOPO.FRAVIK_19_3O    = B01.FRAVIK_19_3        (SØKER_IND);   00032290
        SPESOPO.FRAVIK_8_1O     = B01.FRAVIK_8_1         (SØKER_IND);   00032300
        SPESOPO.FRAVIK_10_1O    = B01.FRAVIK_10_1        (SØKER_IND);   00032310
        SPESOPO.KONVENSJONO     = B01.KONVENSJON         (SØKER_IND);   00032320
        SPESOPO.IKKE_GPO        = B01.IKKE_GP            (SØKER_IND);   00032330
        SPESOPO.TRYGDET_DØDO    = B01.TRYGDET_DØD        (SØKER_IND);   00032340
        SPESOPO.TRYGDET_3ÅR_DØDO= B01.TRYGDET_3ÅR_DØD    (SØKER_IND);   00032350
        SPESOPO.UFØR_UNDER_BOTO = B01.UFØR_UNDER_BOTID   (SØKER_IND);   00032360
        SPESOPO.TT_FRAMT_UFTO   = B01.TT_FRAMT_UFT       (SØKER_IND);   00032370
        SPESOPO.TT_FRAMT_8_1O   = B01.TT_FRAMT_VED_FRAVIK_8_1           00032380
                                                         (SØKER_IND);   00032390
        SPESOPO.TT_FRAMT_DØDO   = B01.TT_FRAMT_DØD       (SØKER_IND);   00032400
        SPESOPO.TT_FRAMT_10_1O  = B01.TT_FRAMT_VED_FRAVIK_10_1          00032410
                                                         (SØKER_IND);   00032420
        SPESOPO.TT_VENT_UTLO    = B01.TT_VENT_UTL        (SØKER_IND);   00032430
        SPESOPO.IKKE_TT_FRAMTO  = B01.IKKE_TT_FRAMT_DØD  (SØKER_IND);   00032440
        SPESOPO.PENSJONSTRYGDETO = B01.PENSJONSTRYGDET (SØKER_IND);     00032450
        SPESOPO.MINST20ÅR_BOTIDO = B01.MINST_20ÅR_BOTID  (SØKER_IND);   00032460
        SPESOPO.FRAVIK_B_KONO =                                         00032470
                            B01.FRAVIK_BOSATT_KONVENSJON (SØKER_IND);   00032480
                                                                        00032490
                                                                        00032500
        SPESOPO.TP_NORDISKO      = B01.TP_NORDISK         (SØKER_IND);  00032510
        SPESOPO.TP_NORDISK_LANDO = B01.TP_NORDISK_LAND    (SØKER_IND);  00032520
        SPESOPO.TT_KONVEN_ÅRO    = B01.TT_KONVENSJON_ÅR    (SØKER_IND); 00032530
    SPESOPO.UNNTAK_12_2O  = B01.UNNTAK_12_2   (SØKER_IND); /*9802*/     00032540
        SPESOPO.TT_PÅO           = B01.TT_PÅ               (SØKER_IND); 00032550
        SPESOPO.TT_FRAMTO        = B01.TT_FRAMTIDIG        (SØKER_IND); 00032560
        SPESOPO.TT_FAKTISKO      = B01.TT_FAKTISK          (SØKER_IND); 00032570
    /*  SPESOPO.FRAVIK_5_1O   = B01.FRAVIK_5_1   (SØKER_IND);/*9802*/   00032580
        SPESOPO.UNG_UFØRO        = B01.UNG_UFØR            (SØKER_IND); 00032590
                                                                        00032600
                                                                        00032610
     END FYLL_SPESOPPL;                                                 00032620
                                                                        00032630
 END BYGG_STATUS;                                                       00032640
                                                                        00032650
                                                                        00032660
                                                                        00032670
                                                                        00032680
                                                                        00032690
 KONTROLL_INPUT_HOVED_MAP:                                              00032700
   PROC;                                                                00032710
                                                                        00032720
     EXEC CICS RECEIVE MAP('S001015') MAPSET('S001013') INTO(S001015I); 00032730
                                                                        00032740
     OPPLYSNINGSTYPE = S001015I.OPPLYSNINGSTYPEI;                       00032750
                                                                        00032760
     IF S001015I.STATUS_KODEI = 'N' THEN                                00032770
       ØNSKET_STATUS     = 'N';                                         00032780
                                                                        00032790
     ELSE                                                               00032800
       ØNSKET_STATUS     = 'S';                                         00032810
                                                                        00032820
     IF S001015I.RETUR_FUNKSJONL > 0 THEN                               00032830
        FUNKSJONSKODE = S001015I.RETUR_FUNKSJONI;                       00032840
                                                                        00032850
     IF FUNKSJONSKODE ^= 'F' THEN                                       00032860
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00032870
                                                                        00032880
     S001015I.FNRL  = -1; /* CURSOR POS */                              00032890
                                                                        00032900
                                                                        00032910
     IF ^F_NUMERISK(S001015I.FNRI) THEN                                 00032920
       DO;                                                              00032930
         MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';     00032940
         RETURN;                                                        00032950
       END;                                                             00032960
                                                                        00032970
     ELSE IF ^F_GYLDIG_FNR(S001015O.FNRO) THEN  /* FNRO ER PIC'(11)9' */00032980
       DO;                                                              00032990
         MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                         00033000
         RETURN;                                                        00033010
       END;                                                             00033020
                                                                        00033030
     ELSE                                                               00033040
       DO;                                                              00033050
         FNR_REG.FNR1       = S001015O.FNRO                  ;          00033060
                                                                        00033070
 /* FJERNET 22.12.88 HL  : */                                           00033080
 /*      FNR_REG.BRUKERID   = STYRINGS_OMR.BRUKERID          */         00033090
                                                                        00033100
         EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);          00033110
                                                                        00033120
         IF FNR_REG.FNR2 > 0 THEN                                       00033130
           DO;                                                          00033140
             MAP_MELDING = S001015I.FNRI !!                             00033150
                           ' ER ET FØDSELSNUMMER SOM ER ENDRET' !!      00033160
                           ' TRYKK ENTER!';                             00033170
             S001015O.FNRO = FNR_REG.FNR2;                              00033180
             RETURN;                                                    00033190
           END;                                                         00033200
         ELSE                                                           00033210
           DO;                                                          00033220
             SEARCH_FNR = S001015O.FNRO;                                00033230
             PIC_11 = SEARCH_FNR;                                       00033240
             IF F_KJØNN(PIC_11) = 'K' THEN                              00033250
               SØKER_IND = 1;                                           00033260
             ELSE                                                       00033270
               SØKER_IND = 2;                                           00033280
           END;                                                         00033290
       END;                                                             00033300
                                                                        00033310
                                                                        00033320
     IF VERIFY(OPPLYSNINGSTYPE,'ATSPIBYF') > 0 THEN                     00033330
       DO;                                                              00033340
         MAP_MELDING = 'UGYLDIG OPPLYSNINGSTYPE';                       00033350
         S001015I.OPPLYSNINGSTYPEL = -1; /* CURSOR POS */               00033360
         S001015I.FNRL             =  0; /* CURSOR POS NULLES */        00033370
       END;                                                             00033380
                                                                        00033390
        DO K = 1 TO 14;                                                 00033400
           KOM_OMR.FNR_TAB(K) = 0;                                      00033410
        END;                                                            00033420
                                                                        00033430
                                                                        00033440
 END KONTROLL_INPUT_HOVED_MAP;                                          00033450
                                                                        00033460
                                                                        00033470
 KONTROLL_INPUT_TRAILER:                                                00033480
   PROC;                                                                00033490
                                                                        00033500
     EXEC CICS RECEIVE MAP('S001044') MAPSET('S001043') INTO(S001044I); 00033510
     OPPLYSNINGSTYPE = S001044I.OPPLYSNINGSTYPEI;                       00033520
                                                                        00033530
     IF ^(OPPLYSNINGSTYPE = 'A' ! OPPLYSNINGSTYPE = 'T') THEN           00033540
        DO;                                                             00033550
           IF S001044I.STATUS_KODEI = 'N' THEN                          00033560
              DO;                                                       00033570
                 IF ØNSKET_STATUS = 'S' THEN                            00033580
                    STATUS_SKIFTE = '1'B;                               00033590
                 ØNSKET_STATUS   = 'N';                                 00033600
              END;                                                      00033610
           ELSE                                                         00033620
              DO;                                                       00033630
                 IF ØNSKET_STATUS = 'N' THEN                            00033640
                    STATUS_SKIFTE = '1'B;                               00033650
                 ØNSKET_STATUS   = 'S';                                 00033660
              END;                                                      00033670
        END;                                                            00033680
                                                                        00033690
     IF TRANSKODE = 'F41S' THEN                                         00033700
        CALL SJEKK_OM_FNR_MERKET;                                       00033710
                                                                        00033720
     CALL LOW_VALUES_TIL_MAP;                                           00033730
                                                                        00033740
     IF VERIFY(OPPLYSNINGSTYPE,'XSPIBYTAF') > 0 THEN                    00033750
       MAP_MELDING = 'UGYLDIG OPPLYSNINGSTYPE';                         00033760
                                                                        00033770
 END KONTROLL_INPUT_TRAILER;                                            00033780
                                                                        00033790
                                                                        00033800
 SJEKK_OM_FNR_MERKET:                                                   00033810
   PROC;                                                                00033820
     DCL       NEDRE_EIBCPOSN          FIXED BIN(15) INIT(160),         00033830
               OEVRE_EIBCPOSN          FIXED BIN(15) INIT(171),         00033840
               START                   FIXED BIN(15),                   00033850
               STOPP                   FIXED BIN(15),                   00033860
               FNR_VED_START           FIXED DEC(11);                   00033870
                                                                        00033880
     FNR_VED_START = SEARCH_FNR;                                        00033890
                                                                        00033900
     IF S001044I.SIDEI = 1 THEN                                         00033910
        DO;                                                             00033920
           START = 1;                                                   00033930
           STOPP = 7;                                                   00033940
        END;                                                            00033950
     ELSE           /* SIDE NR. 2  */                                   00033960
        DO;                                                             00033970
           START = 8;                                                   00033980
           STOPP = 14;                                                  00033990
        END;                                                            00034000
                                                                        00034010
     DO I = START TO STOPP UNTIL(EIBCPOSN < OEVRE_EIBCPOSN - 240);      00034020
        IF EIBCPOSN > NEDRE_EIBCPOSN &                                  00034030
           EIBCPOSN < OEVRE_EIBCPOSN &                                  00034040
           KOM_OMR.FNR_TAB(I) > 0 THEN                                  00034050
                                                                        00034060
                                                                        00034070
           /*B01.RF0PERSN.FNR(I) > 0 THEN*/                             00034080
                                                                        00034090
           DO;                                                          00034100
                                                                        00034110
           /* SEARCH_FNR = B01.RF0PERSN.FNR(I);*/                       00034120
                                                                        00034130
           /* IF B01.RF0PERSN.FNR(I) > 0 THEN                           00034140
                 SEARCH_FNR = B01.RF0PERSN.FNR(I);                      00034150
              ELSE */                                                   00034160
                 SEARCH_FNR = KOM_OMR.FNR_TAB(I);                       00034170
              SØKER_IND = I;                                            00034180
           END;                                                         00034190
                                                                        00034200
        NEDRE_EIBCPOSN = NEDRE_EIBCPOSN + 240;                          00034210
        OEVRE_EIBCPOSN = OEVRE_EIBCPOSN + 240;                          00034220
     END;                                                               00034230
                                                                        00034240
                                                                        00034250
    IF FNR_VED_START ^= SEARCH_FNR    &                                 00034260
       B01.STATUS.PENSJONSTYPE1(1) = 'D' THEN                           00034270
                                                                        00034280
       DO POS_I_B01 = 1 TO 14;                                          00034290
          CALL BLANK_B01;                                               00034300
       END;                                                             00034310
                                                                        00034320
 END SJEKK_OM_FNR_MERKET;                                               00034330
                                                                        00034340
                                                                        00034350
 MAP_SEND:                                                              00034360
   PROC;                                                                00034370
     SELECT (TRANSKODE);                                                00034380
       WHEN('F410')                                                     00034390
         DO;                                                            00034400
           S001015O.CICS_INFOO = CICSINFO ;                             00034410
           IF OPPLYSNINGSTYPE = 'X' THEN                                00034420
             EXEC CICS SEND MAP('S001015') MAPSET('S001013') ERASE;     00034430
           ELSE                                                         00034440
             DO;                                                        00034450
               S001015O.MELDINGO = MAP_MELDING;                         00034460
               EXEC CICS SEND MAP('S001015') MAPSET('S001013') CURSOR   00034470
                                                                ERASE;  00034480
               MAP_MELDING = (78)' ';                                   00034490
             END;                                                       00034500
         END;                                                           00034510
       OTHERWISE                                                        00034520
         DO;                                                            00034530
           S001044O.MELDINGO        = MAP_MELDING;                      00034540
           S001044O.BLADN_TEKSTA    = 'Ø';  /* ASKIP, DARK */           00034550
           S001044O.BLADN_KOMMANDOA = 'Ø';  /* ASKIP,DARK  */           00034560
           EXEC CICS SEND MAP('S001044') MAPSET('S001043');             00034570
           MAP_MELDING = (78)' ';                                       00034580
         END;                                                           00034590
     END;  /*  SELECT   */                                              00034600
 END MAP_SEND;                                                          00034610
                                                                        00034620
                                                                        00034630
 MAP_SEND_TRAILER:                                                      00034640
   PROC;                                                                00034650
     EXEC CICS SEND MAP('S001044') MAPSET('S001043') CURSOR;            00034660
     MAP_MELDING = (78)' ';                                             00034670
 END MAP_SEND_TRAILER;                                                  00034680
                                                                        00034690
                                                                        00034700
 SJEKK_MELDING:                                                         00034710
   PROC;                                                                00034720
     IF MAP_MELDING ^= (78) ' ' THEN                                    00034730
       DO;                                                              00034740
         CALL MAP_SEND;                                                 00034750
         GOTO RETURN;                                                   00034760
       END;                                                             00034770
 END SJEKK_MELDING;                                                     00034780
                                                                        00034790
                                                                        00034800
 DATABASE:                                                              00034810
   PROC(STYRING);                                                       00034820
                                                                        00034830
   DCL                                                                  00034840
     STYRING                               CHAR(5),                     00034850
     NULL                                  BUILTIN,                     00034860
     UNSPEC                                BUILTIN;                     00034870
                                                                        00034880
                                                                        00034890
     DCL                                                                00034900
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00034910
     DCL                                                                00034920
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00034930
  %PAGE;                                                                00034940
                                                                        00034950
     W01_PSB_NAVN     = DIV_PARAM_OMR.PSB_NAVN;                         00034960
     IF STYRING = 'OPEN' THEN                                           00034970
        DO;                                                             00034980
           CALL   PLITDLI                        (W02_PARM_CT_3,        00034990
                                                  W01_PCB_FUNCTION,     00035000
                                                  W01_PSB_NAVN,         00035010
                                                  UIBPTR);              00035020
                                                                        00035030
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00035040
             DO;                                                        00035050
               ALLOCATE PCB_UIB_PEKER_OMR;                              00035060
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;          00035070
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;            00035080
             END;                                                       00035090
           ELSE                                                         00035100
             DO;                                                        00035110
               MAP_MELDING =                                            00035120
               'NOE ER GALT MED DATABASEN, KODE: ' !!                   00035130
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);               00035140
             END;                                                       00035150
        END;                                                            00035160
     ELSE                                                               00035170
        DO;                                                             00035180
           CALL   PLITDLI                        (W02_PARM_CT_1,        00035190
                                                  W01_TERM_FUNCTION);   00035200
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00035210
        END;                                                            00035220
                                                                        00035230
 END DATABASE;                                                          00035240
                                                                        00035250
                                                                        00035260
 FORBEREDE_TRANS:                                                       00035270
   PROC;                                                                00035280
                                                                        00035290
     INDEX_1 = 1;                                                       00035300
     DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                    00035310
     PIC_11 = DIV_PARAM_OMR.SEARCH_FNR;                                 00035320
     CALL DATABASE('OPEN');                                             00035330
     CALL SJEKK_MELDING;                                                00035340
                                                                        00035350
     TRANS_OPPL_OMR.VIRKNINGSDATO  = 0;                                 00035360
     TRANS_OPPL_OMR.FØDSNUMMER     = 0;                                 00035370
     DIV_PARAM_OMR.TRANS_VIRKDATO_ÅM     = 0;                           00035380
     DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '1'B;                        00035390
                                                                        00035400
     /*******    LES TRANS        *********/                            00035410
     EXEC CICS LINK PROGRAM ('R0015201') COMMAREA(KOM_OMR);             00035420
                                                                        00035430
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                             00035440
        DO;                                                             00035450
           PIC_4 = DIV_PARAM_OMR.FEIL_MELD_NR;                          00035460
           MAP_MELDING = 'FEIL MED DATABASEN PÅ FØRSTE KALL ' !!        00035470
                          PIC_4 !! ' ' !! DIV_PARAM_OMR.FEIL_VED_LABEL  00035480
                                !! ' ' !! DIV_PARAM_OMR.PROGRAM_ID;     00035490
        END;                                                            00035500
                                                                        00035510
     ELSE IF TRANS_OPPL_OMR.FØDSNUMMER = 0 THEN                         00035520
        MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER: ' !! PIC_11 !!       00035530
                      ' ER IKKE I DATABASEN';                           00035540
                                                                        00035550
      ELSE IF TRANS_OPPL_OMR.VIRKNINGSDATO = 0 THEN                     00035560
         MAP_MELDING = 'DET FINNES INGEN TRANSAKSJONER TIL ' !!         00035570
                       'PERSONEN MED FNR: ' !! PIC_11;                  00035580
                                                                        00035590
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 !                                00035600
        TRANS_OPPL_OMR.FØDSNUMMER = 0  !                                00035610
        TRANS_OPPL_OMR.VIRKNINGSDATO = 0 THEN                           00035620
           CALL DATABASE('CLOSE');                                      00035630
                                                                        00035640
    TRANS_OPPL_OMR.TRANSKODE = TRANSKODE_VED_START;  /*BLIR BLANKET I */00035650
                                                     /* LES-TRANS     */00035660
                                                                        00035670
 END FORBEREDE_TRANS;                                                   00035680
                                                                        00035690
                                                                        00035700
                                                                        00035710
 BYGG_TRANS:                                                            00035720
   PROC;                                                                00035730
                                                                        00035740
                                                                        00035750
    %INCLUDE P0019913;          /* LOKAL - KOM - OMRÅDE   */            00035760
                                                                        00035770
    DCL                                                                 00035780
        NULL                     BUILTIN,                               00035790
        LOKAL_KOM_PTR            POINTER,                               00035800
        SEARCH_FNR_VED_START     FIXED DEC(11),                         00035810
        SLUTT                    BIT(1) INIT('0'B);                     00035820
                                                                        00035830
    ALLOCATE LOKAL_KOM_OMR;                                             00035840
                                                                        00035850
    HOVED_KOM_OMR_PTR  = NULL;                                          00035860
    FNR_ARRAY          = 0;                                             00035870
    FNR_ARRAY_IND      = 1;                                             00035880
    FNR_ARRAY_ANT      = 0;                                             00035890
    TRANS_ANT          = 1;                                             00035900
                                                                        00035910
    W01_NORSK_BOSATT   = '0'B;                                          00035920
    W01_YSKADE         = '0'B;                                          00035930
                                                                        00035940
    DO I = 1 TO 27;                                                     00035950
       TRANS_LISTE.TRANS_OPPL_PTR(I)  = NULL;                           00035960
       TRANS_LISTE.TRANS_PTR     (I)  = NULL;                           00035970
    END;                                                                00035980
                                                                        00035990
                                                                        00036000
                                                                        00036010
    DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '0'B;                         00036020
    HOVED_KOM_OMR_PTR    = COMMAREA_PEKER;                              00036030
    SEARCH_FNR_VED_START = SEARCH_FNR;                                  00036040
                                                                        00036050
    DO WHILE (^SLUTT);                                                  00036060
                                                                        00036070
       /**  BYGGE OPP TRANS_LISTE OG FNR_ARRAY                    **/   00036080
       IF ^DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS  THEN                    00036090
          EXEC CICS LINK PROGRAM('R0010411') COMMAREA (LOKAL_KOM_OMR);  00036100
                                                                        00036110
       KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);         00036120
                                                                        00036130
       /*******    LES TRANS        *********/                          00036140
       EXEC CICS LINK PROGRAM ('R0015201') COMMAREA(KOM_OMR);           00036150
                                                                        00036160
       IF TRANS_ANT = 27 THEN                     /* BEGRENSNING I    */00036170
          TRANS_OPPL_OMR.VIRKNINGSDATO = 0;       /* TRANS - ANTALLET */00036180
                                                                        00036190
       IF TRANS_OPPL_OMR.VIRKNINGSDATO > 0 THEN                         00036200
          DO;                                                           00036210
             TRANS_ANT = TRANS_ANT + 1;                                 00036220
             DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '0'B;                00036230
          END;                                                          00036240
       ELSE IF OPPLYSNINGSTYPE = 'A' &                                  00036250
               FNR_ARRAY_IND < 27    &                                  00036260
               FNR_ARRAY(FNR_ARRAY_IND + 1) > 0 THEN                    00036270
          DO;                                                           00036280
             FNR_ARRAY_IND = FNR_ARRAY_IND + 1;                         00036290
             SEARCH_FNR    = FNR_ARRAY(FNR_ARRAY_IND);                  00036300
             DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '1'B;                00036310
          END;                                                          00036320
       ELSE                                                             00036330
          DO;                                                           00036340
             CALL DATABASE('CLOSE');                                    00036350
             ANTALL_TRANS_I_TRANS_LISTE  = TRANS_ANT;                   00036360
             SLUTT      = '1'B;                                         00036370
          END;                                                          00036380
                                                                        00036390
    END;                                                                00036400
                                                                        00036410
    SEARCH_FNR = SEARCH_FNR_VED_START;                                  00036420
                                                                        00036430
    /** HOVED-KOM_OMR TIL TS,   KONTROLL TIL UTLISTINGSPROGRAMMET  **/  00036440
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                               00036450
                                                                        00036460
                                                                        00036470
    EXEC CICS WRITEQ TS QUEUE(QUENAME) FROM(KOM_OMR) MAIN;              00036480
    EXEC CICS XCTL PROGRAM('R0010412') COMMAREA (LOKAL_KOM_OMR);        00036490
                                                                        00036500
                                                                        00036510
 END BYGG_TRANS;                                                        00036520
                                                                        00036530
                                                                        00036540
                                                                        00036550
 OVERFLOW:                                                              00036560
   CALL LOW_VALUES_TIL_MAP;                                             00036570
   S001044O.SIDEO            = SIDE_TELL;                               00036580
   S001044O.BLADN_TEKSTO     = 'BLADNINGSKOMMANDO';                     00036590
   S001044O.CICS_INFOO       = DIV_PARAM_OMR.CICS_NAVN;                 00036600
   S001044O.OPPLYSNINGSTYPEO = OPPLYSNINGSTYPE;                         00036610
   IF ^ SISTE_SIDE THEN                                                 00036620
     S001044O.BLADN_KOMMANDOO = 'P/N';                                  00036630
   ELSE                                                                 00036640
     DO;                                                                00036650
       S001044O.BLADN_KOMMANDOO = 'P/1';                                00036660
       IF SIDE_TELL = 1 THEN                                            00036670
         DO;                                                            00036680
           S001044O.BLADN_TEKSTO    = (10)' ';                          00036690
           S001044O.BLADN_KOMMANDOO = '    ';                           00036700
           S001044O.BLADN_KOMMANDOA = '0';     /* ASKIP  */             00036710
         END;                                                           00036720
     END;                                                               00036730
                                                                        00036740
   EXEC CICS SEND MAP('S001044') MAPSET('S001043') ACCUM PAGING;        00036750
   IF SISTE_SIDE THEN                                                   00036760
     DO;                                                                00036770
       EXEC CICS WRITEQ TS QUEUE(QUENAME) FROM(KOM_OMR);                00036780
       EXEC CICS SEND PAGE TRANSID(TRANSKODE) RELEASE NOAUTOPAGE;       00036790
     END;                                                               00036800
                                                                        00036810
   /***** HIT KOMMER EN BARE DERSOM DET ER MER INFO IGJEN  *****/       00036820
                                                                        00036830
   SIDE_TELL = SIDE_TELL + 1;                                           00036840
                                                                        00036850
   SELECT (OPPLYSNINGSTYPE);                                            00036860
     WHEN('S')                                                          00036870
       DO;                                                              00036880
         CALL BYGG_FAMILIE_HEADER;                                      00036890
         CALL BYGG_FAMILIE_FORH;                                        00036900
       END;                                                             00036910
     WHEN('I')                                                          00036920
       DO;                                                              00036930
         CALL BYGG_INNTEKTS_HEADER;                                     00036940
         CALL BYGG_INNTEKTS_FORH;                                       00036950
       END;                                                             00036960
     WHEN('P')                                                          00036970
       DO;                                                              00036980
         CALL BYGG_GENHEAD('PERSONLIG INFO');                           00036990
         CALL BYGG_PERSONLIG_INFO;                                      00037000
       END;                                                             00037010
     WHEN('Y')                                                          00037020
       DO;                                                              00037030
         CALL BYGG_GENHEAD('YTELSER');                                  00037040
         CALL BYGG_YTELSER;                                             00037050
       END;                                                             00037060
     WHEN('B')                                                          00037070
       DO;                                                              00037080
         CALL BYGG_GENHEAD('BEREGNINGSGRUNNLAG');                       00037090
         CALL BYGG_BEREGNINGSGRUNNLAG;                                  00037100
       END;                                                             00037110
     WHEN('F')                                                          00037120
       DO;                                                              00037130
         CALL BYGG_STATUS;                                              00037140
       END;                                                             00037150
     OTHERWISE                                                          00037160
        ;                                                               00037170
   END;  /* SELECT   */                                                 00037180
                                                                        00037190
   /********      SLUTT PÅ OVERFLOW - RUTINE     ***********/           00037200
                                                                        00037210
                                                                        00037220
 OPPRETT_STATUS_UTEN_TRANS:                                             00037230
   PROC;                                                                00037240
                                                                        00037250
                                                                        00037260
 DCL                                                                    00037270
   (I,J,K) FIXED BIN(15);                                               00037280
 DCL                                                                    00037290
   FNR_FORESPØRSEL                       FIXED DEC(11),                 00037300
   BARNE_IND                             FIXED BIN(15),                 00037310
   BARNE_POS                             FIXED BIN(15),                 00037320
   TILKN_IND                             FIXED BIN(15),                 00037330
   LES_RESTEN_IND                        FIXED BIN(15),                 00037340
   (ADDR,CSTG,LOW)                       BUILTIN;                       00037350
                                                                        00037360
   CALL DATABASE('OPEN');                                               00037370
   CALL SJEKK_MELDING;                                                  00037380
                                                                        00037390
   FNR_FORESPØRSEL = SEARCH_FNR;                                        00037400
   FEIL_MELD_NR = 0;                                                    00037410
   PIC_11 = SEARCH_FNR;                                                 00037420
   SØKER_IND = 1;                                                       00037430
   POS_I_B01 = 1;                                                       00037440
                                                                        00037450
                                                                        00037460
   EXEC CICS LINK PROGRAM('R0013110') COMMAREA(KOM_OMR);                00037470
                                                                        00037480
  IF B01.RF0PERSN.FNR(SØKER_IND) > 0   THEN                             00037490
   DO;                                                                  00037500
     DO I = 1 TO 2;                                                     00037510
    /* SØKER ER I BASEN             */                                  00037520
                                                                        00037530
       IF B01.STATUS.PENSJONSTYPE1(2) = 'D' THEN                        00037540
          LEAVE;                                                        00037550
                                                                        00037560
       DO TILKN_IND = 1 TO 13 WHILE (B01.FNR_TILKN(I,TILKN_IND) > 0);   00037570
                                                                        00037580
          PIC_11     = B01.TILKN.FNR_TILKN(I,TILKN_IND);                00037590
          SEARCH_FNR = B01.TILKN.FNR_TILKN(I,TILKN_IND);                00037600
          IF FNR_FORESPØRSEL ^= SEARCH_FNR THEN                         00037610
             DO;                                                        00037620
                POS_I_B01 = POS_I_B01 + 1;                              00037630
                IF POS_I_B01 = 15 THEN                                  00037640
                   DO;                                                  00037650
                      MAP_MELDING = 'MULIGHETER FOR FLERE ENN 14 ' !!   00037660
                                    ' PERSONER, PLASSPROBLEMER ';       00037670
                      GOTO SLUTT;                                       00037680
                   END;                                                 00037690
                EXEC CICS LINK PROGRAM('R0013110') COMMAREA(KOM_OMR);   00037700
             END;                                                       00037710
                                                                        00037720
          IF DB_STATUS_KODE ^= '  ' THEN                                00037730
             DO;                                                        00037740
                MAP_MELDING = 'TILKNYTTET FØDSELSNUMMER: '!! PIC_11 !!  00037750
                               ' FINNES IKKE PÅ DATABASEN';             00037760
                GOTO SLUTT;                                             00037770
             END;                                                       00037780
                                                                        00037790
       END;                                                             00037800
       /* ENDERET  SP 20.08.91         */                               00037810
       IF B01.STATUS.VIRK_DATO_ÅM(SØKER_IND)     = 0 THEN               00037820
             LEAVE;                                                     00037830
       /* ***************************************** */                  00037840
                                                                        00037850
       DO K = 1 TO 14;                                                  00037860
          KOM_OMR.FNR_TAB(K) = B01.RF0PERSN.FNR(K);                     00037870
       END;                                                             00037880
                                                                        00037890
       IF B01.STATUS.PENSJONSTYPE1(1) = 'D' THEN                        00037900
          LEAVE;                                                        00037910
                                                                        00037920
                                                                        00037930
    END;       /*     DO          */                                    00037940
   END;       /*     I = 1 TO 2  */                                     00037950
                                                                        00037960
                                                                        00037970
  ELSE                                                                  00037980
                                                                        00037990
  IF FEIL_MELD_NR = 0 THEN                                              00038000
     /*  IKKE FUNNET, PERSONEN ER IKKE I DATABASEN    */                00038010
     MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER ' !! PIC_11 !!           00038020
                        ' ER IKKE I DATABASEN';                         00038030
                                                                        00038040
  ELSE                                                                  00038050
  IF FEIL_MELD_NR = 382  THEN                                           00038060
     /*  PERSONEN ER  I HISTORIK DATABASEN    */                        00038070
     MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER ' !! PIC_11 !!           00038080
                        ' ER I HISTORIC DATABASEN';                     00038090
                                                                        00038100
  ELSE                                                                  00038110
   /* FEIL DATABASE-STATUS-KODE     */                                  00038120
   /* SYSTEMFEIL, NOE GALT MED DATABASEN      */                        00038130
     MAP_MELDING = 'NOE GALT DBD MELDNR ' !! FEIL_MELD_NR               00038140
            !! 'KODE: ' !!                                              00038150
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR) !! ' '!!       00038160
                                           RF1.STATUS_KODE ;            00038170
                                                                        00038180
 SLUTT:                                                                 00038190
      /* RELEASE PSBEN      */                                          00038200
                                                                        00038210
      CALL DATABASE('CLOSE');                                           00038220
                                                                        00038230
   SEARCH_FNR = FNR_FORESPØRSEL;                                        00038240
                                                                        00038250
   /* HER ER DET SLUTT PÅ EKSEKVERING I OPPRETT-STATUS-UTEN-TRANS */    00038260
                                                                        00038270
                                                                        00038280
   FLYTT_TIL_BARNEDELEN:                                                00038290
     PROC;                                                              00038300
                                                                        00038310
       IF BARNE_POS ^= SØKER_IND THEN                                   00038320
          DO;                                                           00038330
             B01.PERSON(BARNE_POS) = B01.PERSON(SØKER_IND);             00038340
                                                                        00038350
             /* BLANKING AV ETT SEGMENT I B01     */                    00038360
             POS_I_B01  = SØKER_IND;                                    00038370
             CALL BLANK_B01;                                            00038380
          END;                                                          00038390
                                                                        00038400
   END FLYTT_TIL_BARNEDELEN;                                            00038410
                                                                        00038420
 END OPPRETT_STATUS_UTEN_TRANS;                                         00038430
                                                                        00038440
                                                                        00038450
 BLANK_B01:                                                             00038460
   PROC;                                                                00038470
     B01.PERSON(POS_I_B01) = '';                                        00038480
 END BLANK_B01;                                                         00038490
                                                                        00038500
                                                                        00038510
 %PAGE;                                                                 00038520
 %INCLUDE R0019902;         /* F_KJØNN           */                     00038530
 %PAGE;                                                                 00038540
 %INCLUDE R0019904;         /* F_GYLDIG_FNR      */                     00038550
 %PAGE;                                                                 00038560
 %INCLUDE R0019910;         /* F_NUMERISK        */                     00038570
 %PAGE;                                                                 00038580
 %INCLUDE R0019913;         /* F_SNU_DATO        */                     00038590
 %PAGE;                                                                 00038600
 %INCLUDE R0019956;         /* P9956_BER_G_CICS  */                     00038610
 %PAGE;                                                                 00038620
 %INCLUDE R0019960;         /* F_CICSINFO        */                     00038630
 %PAGE;                                                                 00038640
 %INCLUDE R0014427;         /* B_LOVLIG_INN      */                     00038650
                                                                        00038660
 END R001041;                                                           00038670
