 /*       SIST ENDRET 13/12-91 12.54.40 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 12/05-87 09.15.20 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 22/10-85 16.23.04 AV   FARVIK                   */00000020
 /*       SIST ENDRET 23/11-84 07.18.22 AV   FARVIK                   */00000030
 /*       SIST ENDRET 05/10-84 13.57.25 AV   FARVIK                   */00000040
 /*       SIST ENDRET 17/09-84 09.26.59 AV   FARVIK                   */00000050
 /*       SIST ENDRET 11/09-84 14.13.44 AV   FARVIK                   */00000060
 R00111:                                                                00000070
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000080
 %PAGE;                                                                 00000090
 %INCLUDE S00111;    /*  ETTERLATTE BARN-MAPSETTET                    */00000100
 %PAGE;                                                                 00000110
 %INCLUDE P0011101;  /*  TRANS_OMR FOR ETTERLATTE BARN                */00000120
 %PAGE;                                                                 00000130
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)                    */00000140
 %PAGE;                                                                 00000150
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)                           */00000160
 %PAGE;                                                                 00000170
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)                      */00000180
 %PAGE;                                                                 00000190
 %INCLUDE P0019912;  /*  DIV-PARAM-OMRÅDE (BASED)                     */00000200
 %PAGE;                                                                 00000210
 %INCLUDE DFHBMSCA;                                                     00000220
 %PAGE;                                                                 00000230
   DCL                                                                  00000240
      (BMSMAPBR,COMMAREA_PEKER)        PTR;                             00000250
   DCL                                                                  00000260
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000270
   DCL                                                                  00000280
      FEIL_FUNNET      BIT (1),                                         00000290
      ONKODE           PIC'9999',                                       00000300
      CURSOR_POS       FIXED BIN(15) INIT(-1),                          00000310
      ONK DEF ONKODE   CHAR(4),                                         00000320
      FEILKODE         CHAR(4),                                         00000330
      DSNAVN           CHAR(8),                                         00000340
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000350
 %SKIP(1);                                                              00000360
 %PAGE;                                                                 00000370
      ON ERROR SNAP BEGIN       ;                                       00000380
         ON ERROR SYSTEM        ;                                       00000390
         ONKODE=ONCODE          ;                                       00000400
         FEILKODE = ONK         ;                                       00000410
         DSNAVN   = EIBDS       ;                                       00000420
         GO TO FEILBEH          ;                                       00000430
      END;                                                              00000440
                                                                        00000450
 FEILKODE   = 'FEIL'    ;                                               00000460
 DSNAVN     = '        ';                                               00000470
                                                                        00000480
 EXEC CICS HANDLE CONDITION   ERROR(FEILBEH);                           00000490
                                                                        00000500
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000510
                                                                        00000520
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER     = ADDR(KOM_OMR.DIV_PARAM_OMR); 00000530
                                                                        00000540
 IF FRA_CICS THEN                                                       00000550
  DO;                                                                   00000560
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000570
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000580
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000590
  END;                                                                  00000600
                                                                        00000610
 IF HENT_FRAM_MAP  THEN                                                 00000620
    DO;                                                                 00000630
       EXEC CICS SEND MAP('S001111') MAPSET('S001113') MAPONLY          00000640
                                                         SET (BMSMAPBR);00000650
      ALLOCATE S001111O;                                                00000660
      S001111O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                    00000670
    END;                                                                00000680
                                                                        00000690
 RECEIVE_MAP:                                                           00000700
                                                                        00000710
                                                                        00000720
 IF ^HENT_FRAM_MAP THEN                                                 00000730
    DO;                                                                 00000740
       EXEC CICS RECEIVE MAP('S001111')                                 00000750
                                    MAPSET('S001113') SET(BMSMAPBR);    00000760
       CALL BLANK_BP_MELDNR;                                            00000770
       FEIL_MELD_NR = 0;                                                00000780
    END;                                                                00000790
 IF FUNKSJONSKODEL > 0 THEN                                             00000800
    DO;                                                                 00000810
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000820
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000830
    END;                                                                00000840
                                                                        00000850
 IF STYRE_KODEL > 0 THEN                                                00000860
    DO;                                                                 00000870
       STYREKODE = STYRE_KODEI;                                         00000880
       TRANSKODE = 'R041';                                              00000890
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00000900
    END;                                                                00000910
                                                                        00000920
                                                                        00000930
 IF STYREKODE ^= 'BP'  &  FRA_CICS THEN                                 00000940
    TRANSKODE  = 'R041';                                                00000950
 ELSE                                                                   00000960
    DO;                                                                 00000970
       TRANS_RETURKODE = TRANSKODE;                                     00000980
       SELECT (TRANSKODE);                                              00000990
         WHEN('R110')                                                   00001000
            DO;                                                         00001010
               CALL BLANK_BP_BARN;                                      00001020
               CALL BLANK_BP_AVD;                                       00001030
               CALL BLANK_BP_GEN;                                       00001040
               CALL BLANK_BP_MELDNR;                                    00001050
               CALL OVERFØR_BP_BARN;                                    00001060
               CALL OVERFØR_BP_GEN;                                     00001070
               CALL OVERFØR_BP_AVD;                                     00001080
               CALL KONTROLL_ETTERLATTE_BARN_EN(FEIL_FUNNET);           00001090
            END;                                                        00001100
         WHEN('R111')                                                   00001110
            DO;                                                         00001120
               CALL BLANK_BP_MELDNR;                                    00001130
               CALL OVERFØR_BP_BARN;                                    00001140
               CALL OVERFØR_BP_GEN;                                     00001150
               CALL OVERFØR_BP_AVD;                                     00001160
               CALL KONTROLL_ETTERLATTE_BARN_EN(FEIL_FUNNET);           00001170
            END;                                                        00001180
         OTHERWISE;                                                     00001190
 /*       INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001200
       END;    /*  SELECT  */                                           00001210
                                                                        00001220
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001230
                                    TRANS_RETURKODE ^= TRANSKODE THEN   00001240
    DO;                                                                 00001250
       IF TRANSKODE = 'R110' THEN                                       00001260
          TRANSKODE = 'R111';                                           00001270
          EXEC CICS SEND MAP('S001111') MAPSET('S001113') ERASEAUP      00001280
                                                       DATAONLY CURSOR; 00001290
       CALL BLANK_BP_MAP;                                               00001300
       CALL OVERFØR_BP_MAP;                                             00001310
                                                                        00001320
       IF HENT_FRAM_MAP THEN                                            00001330
          EXEC CICS SEND MAP('S001111') MAPSET('S001113') ERASE CURSOR; 00001340
       ELSE                                                             00001350
          EXEC CICS SEND MAP('S001111') MAPSET('S001113') ERASEAUP      00001360
                                                       DATAONLY CURSOR; 00001370
                                                                        00001380
       FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                00001390
                                                                        00001400
       HENT_FRAM_MAP = '0'B;                                            00001410
                                                                        00001420
       IF FRA_CICS THEN                                                 00001430
          EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);        00001440
       ELSE                                                             00001450
          GOTO RECEIVE_MAP;                                             00001460
    END;                                                                00001470
 ELSE                                                                   00001480
    DO;                                                                 00001490
       IF TRANSKODE       = 'R110' THEN                                 00001500
          TRANS_RETURKODE = 'R111';                                     00001510
       ELSE                                                             00001520
          TRANS_RETURKODE = TRANSKODE;                                  00001530
       IF FRA_CICS  THEN                                                00001540
          DO;                                                           00001550
             BLANKETTYPE  = STYREKODE;                                  00001560
             TRANSKODE    = 'R042';                                     00001570
          END;                                                          00001580
    END;                                                                00001590
 END;                                                                   00001600
                                                                        00001610
  CALL UTGANG;                                                          00001620
                                                                        00001630
  UTGANG: PROC;                                                         00001640
    IF FRA_CICS THEN                                                    00001650
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001660
    ELSE                                                                00001670
       EXEC CICS RETURN;                                                00001680
  END UTGANG;                                                           00001690
                                                                        00001700
  FEILBEH:                                                              00001710
                                                                        00001720
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001730
                                                                        00001740
     PROGRAM_ID = 'R0011101';                                           00001750
                                                                        00001760
     ALLOCATE S001111O;                                                 00001770
      S001111O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                    00001780
                                                                        00001790
     S001111O.MELDING2O =                                               00001800
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00001810
                                                                        00001820
     S001111O.MELDING3O =                                               00001830
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00001840
                                                                        00001850
     S001111O.MELDING4O =                                               00001860
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00001870
                                         !! '. DATASETT : ' !! DSNAVN;  00001880
                                                                        00001890
     S001111O.MELDING5O =                                               00001900
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00001910
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00001920
                                                                        00001930
     S001111O.MELDING6O =                                               00001940
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00001950
                                                                        00001960
                                                                        00001970
     EXEC CICS SEND MAP('S001111')                                      00001980
                                                 MAPSET('S001113');     00001990
                                                                        00002000
     EXEC CICS RECEIVE MAP('S001111')                                   00002010
                                    MAPSET('S001113') SET(BMSMAPBR);    00002020
                                                                        00002030
                                                                        00002040
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002050
                                                                        00002060
                                                                        00002070
     TERMINERINGS_IND = 'F';                                            00002080
                                                                        00002090
     TRANSKODE  = 'R041';                                               00002100
                                                                        00002110
     CALL UTGANG;                                                       00002120
                                                                        00002130
  ABEND:                                                                00002140
     EXEC CICS ABEND ABCODE(FEIL);                                      00002150
                                                                        00002160
  PF1:                                                                  00002170
                                                                        00002180
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002190
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002200
                                                                        00002210
     IF ^(BPB.TAB.FNR_BARNNR(1) = 1   !                                 00002220
          BPB.TAB.FNR_BARNNR(1) = 200 !                                 00002230
          BPB.VIRK_DATO_MÅNR = 9      !                                 00002240
          BPB.VIRK_DATO_MÅNR = 10     !                                 00002250
          BPB.VIRK_DATO_MÅNR = 77     !                                 00002260
          BPB.VIRK_DATO_MÅNR = 200) THEN                                00002270
        DO;                                                             00002280
                                                                        00002290
           IF FØDSNUMMER    = 0   THEN                                  00002300
                                                                        00002310
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002320
                                                                        00002330
              DO;                                                       00002340
                 FEIL_MELD_NR  = 0;                                     00002350
                 S001111O.MELDING6O =                                   00002360
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002370
                         '.TRANSAKSJONEN ER FORKASTET.';                00002380
                                                                        00002390
              END;                                                      00002400
           ELSE                                                         00002410
              DO;                                                       00002420
                                                                        00002430
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002440
                 IF FRA_CICS THEN                                       00002450
                    BLANKETTYPE = STYREKODE;                            00002460
                                                                        00002470
                                                                        00002480
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002490
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002500
                    FUNKSJONSKODE = 'B';                                00002510
                                                                        00002520
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002530
                                                                        00002540
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00002550
                                                                        00002560
                 S001111O.MELDING6O =                                   00002570
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00002580
              END;                                                      00002590
                                                                        00002600
           EXEC CICS SEND MAP('S001111') MAPSET('S001113')              00002610
                                                           DATAONLY;    00002620
     /* DUMMY SEND-KALL.                              */                00002630
                                                                        00002640
           EXEC CICS SEND MAP('S001111')                                00002650
                                                  MAPSET('S001113');    00002660
           EXEC CICS DELAY INTERVAL(005);                               00002670
                                                                        00002680
           TERMINERINGS_IND = 'F';                                      00002690
                                                                        00002700
           TRANSKODE  = 'R041';                                         00002710
                                                                        00002720
           CALL UTGANG;                                                 00002730
                                                                        00002740
        END;                                                            00002750
     ELSE                                                               00002760
        DO;                                                             00002770
           TERMINERINGS_IND = 'F';                                      00002780
                                                                        00002790
           TRANSKODE = 'R041';                                          00002800
                                                                        00002810
           S001111O.MELDING6O =                                         00002820
                                                                        00002830
 'NB* TRANSAKSJONEN ER FORKASTET.FNR ELLLER VDATO ER IKKE GODKJENT.*NB';00002840
                                                                        00002850
           EXEC CICS SEND MAP('S001111') MAPSET('S001113')              00002860
                                                           DATAONLY;    00002870
     /* DUMMY SEND-KALL.                            */                  00002880
                                                                        00002890
           EXEC CICS SEND MAP('S001111')                                00002900
                                    MAPSET('S001113');                  00002910
                                                                        00002920
           EXEC CICS DELAY INTERVAL(005);                               00002930
           CALL UTGANG;                                                 00002940
        END;                                                            00002950
                                                                        00002960
                                                                        00002970
  PF2:                                                                  00002980
     TERMINERINGS_IND   = 'F';                                          00002990
                                                                        00003000
     S001111O.MELDING6O =                                               00003010
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003020
                                                                        00003030
     EXEC CICS SEND MAP('S001111') MAPSET('S001113')                    00003040
                                                      DATAONLY ;        00003050
     /* DUMMY SEND-KALL.                                     */         00003060
                                                                        00003070
     EXEC CICS SEND MAP('S001111')                                      00003080
                                    MAPSET('S001113');                  00003090
     EXEC CICS DELAY INTERVAL(005);                                     00003100
                                                                        00003110
                                                                        00003120
     TRANSKODE = 'R041';                                                00003130
                                                                        00003140
     CALL UTGANG;                                                       00003150
                                                                        00003160
 %PAGE;                                                                 00003170
 %INCLUDE R0011102;  /* BLANK  ARBEIDSOMRÅDE                          */00003180
 %PAGE;                                                                 00003190
 %INCLUDE R0011103;  /* KONTROLL AV SØKERDELEN                        */00003200
 %PAGE;                                                                 00003210
 %INCLUDE R0011106;  /* ARBEIDSOMRÅDE -> MAP                          */00003220
 %PAGE;                                                                 00003230
 %INCLUDE R0011109;  /* MAP -> ARBEIDSOMRÅDE                          */00003240
 %PAGE;                                                                 00003250
 %INCLUDE R0019901;  /* TESTER OM DATO ER GYLDIG                      */00003260
 %PAGE;                                                                 00003270
 %INCLUDE R0019902;  /* FINNE KJØNN                                   */00003280
 %PAGE;                                                                 00003290
 %INCLUDE R0019904;  /* FØDSELSNUMMERKONTROLL                         */00003300
 %PAGE;                                                                 00003310
 %INCLUDE R0019905;  /* BEREGNER ALDER                                */00003320
 %PAGE;                                                                 00003330
 %INCLUDE R0019908;  /* DAGENS DATO PLUSS 1                           */00003340
 %PAGE;                                                                 00003350
 %INCLUDE R0019910;  /* NUMERISK KONTROLL                             */00003360
 %PAGE;                                                                 00003370
 %INCLUDE R0019911;  /*  DATO KONTROLL                                */00003380
 %PAGE;                                                                 00003390
 %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR      */00003400
 %PAGE;                                                                 00003410
 %INCLUDE R0019944;  /* SKRIV_FEIL                                    */00003420
                                                                        00003430
 END R00111;                                                            00003440
