 /*       SIST ENDRET 12/09-90 13.08.41 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 13/08-90 14.08.41 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 08/08-90 13.53.42 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 05/07-90 09.23.03 AV   DYBVIK                   */00000030
                                                                        00000040
 /* ***************************************************************** */00000050
 /*                                                                   */00000060
 /* IDENTIFIKASJON:                                                   */00000070
 /*     R0014480 - BEREGN_GP_UP_UTLAND, PROSEDYRE I PL1               */00000080
 /*     PROGRAMMERER: ERIK SAMUELSEN, JANUAR 1990.                    */00000090
 /* HENSIKT:                                                          */00000100
 /*     BEREGNE GRUNNPENSJON ETTER DE SPESIELLE REGLER SOM GJELDER    */00000110
 /*     FOR UTENLANDSBOENDE.                                          */00000120
 /* PROGRAMTILKNYTNING                                                */00000130
 /*     PROSEDYREN BLIR INKLUDERT I R0014401 - BEREGN_UFØREPENSJON.   */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
                                                                        00000170
                                                                        00000180
 BEREGN_GP_UP_UTLAND:                                                   00000190
  PROC;                                                                 00000200
                                                                        00000210
   DCL                                                                  00000220
      TT_EGEN_GML                 DEC FIXED(3)        INIT(0);          00000230
 /*YS*/   DCL  W_GP_FRADRAG       DEC FIXED( 9,3) INIT(0);              00000240
 /*YS*/   DCL  W_HUNDRE           DEC FIXED(5) INIT(100);               00000250
                                                                        00000260
   DCL  UNDER_3_ÅR_TT             DEC FIXED(5)        INIT(0);          00000270
                                                                        00000280
   DCL  W_GP1                     DEC FIXED(11,4) INIT(0);              00000290
   DCL  W_GP2                     DEC FIXED(11,4) INIT(0);              00000300
   DCL  W_GP3                     DEC FIXED(11,4) INIT(0);              00000310
   DCL  W_GP4                     DEC FIXED(11,4) INIT(0);              00000320
                                                                        00000330
 /* ************************************************************** */   00000340
 /* BEREGNINGSREGLENES PARAGRAF 4.1.2.1 - ENSLIG PENSJONIST BOSATT */   00000350
 /* I UTLANDET, OG VILKÅRET OM FORUTGÅENDE TRYGDETID  IKKE OPPFYLT */   00000360
 /* 19-3 KODER AVGJØR OM HVORDAN TRYGDETID SKAL BEREGNES, MEN      */   00000370
 /* DETTE SJEKKES KUN PÅ INPUTKONTROLLNIVÅ.                        */   00000380
 /* ************************************************************** */   00000390
                                                                        00000400
                                                                        00000410
 /* ************************************************************** */   00000420
 /* AVKRYSSET FOR 'IKKE GRUNNPENSJON'.                             */   00000430
 /* ----------------------------------                             */   00000440
 /* ************************************************************** */   00000450
                                                                        00000460
                                                                        00000470
     IF B02.IKKE_GP(BER_SØ_IND) = 'J' THEN                              00000480
                                                                        00000490
        DO;                                                             00000500
                                                                        00000510
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00000520
                   ((B02.TT_ETTER_1966(BER_SØ_IND) + 11 ) / 12);        00000530
                                                                        00000540
         IF TT_EGEN > 39 THEN                                           00000550
            TT_EGEN = 40;                                               00000560
                                                                        00000570
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00000580
                                                                        00000590
                                                                        00000600
         B02.UFØRPENS.GP(BER_SØ_IND) = 0;                               00000610
                                                                        00000620
                                                                        00000630
                                                                        00000640
       GO TO L999;                                                      00000650
                                                                        00000660
     END;                                                               00000670
                                                                        00000680
                                                                        00000690
 /* ************************************************************** */   00000700
 /* ALTERNATIV 1:                                                  */   00000710
 /* -------------                                                  */   00000720
 /* ************************************************************** */   00000730
                                                                        00000740
                                                                        00000750
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00000760
     DO;                                                                00000770
       IF (B02.FRAVIK_BOSATT(BER_SØ_IND) = 'J' &                        00000780
          B02.FRAVIK_TRYGDET_3ÅR(BER_SØ_IND) = 'J' &                    00000790
          B02.FRAVIK_8_1(BER_SØ_IND) ^= 'J' &                           00000800
          B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) < 1 &                 00000810
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) ^= 'J' &                     00000820
          B02.BOSATT(BER_SØ_IND) > 0 ) THEN                             00000830
       DO;                                                              00000840
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00000850
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00000860
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00000870
         IF TT_EGEN > 39 THEN                                           00000880
            TT_EGEN = 40;                                               00000890
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00000900
                                                                        00000910
                                                                        00000920
                                                                        00000930
    W_GP      = G * UFGRAD;                                             00000940
    W_GP      = W_GP / 100;                                             00000950
    W_GP      = W_GP * B02.TT_ANV(BER_SØ_IND);                          00000960
    W_GP      = W_GP / 40;                                              00000970
    W_GP      = W_GP / 12;                                              00000980
    W_GP      = W_GP + 0.5;                                             00000990
                                                                        00001000
                                                                        00001010
    B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                                 00001020
                                                                        00001030
                                                                        00001040
     GO TO L999;                                                        00001050
                                                                        00001060
     END;                                                               00001070
                                                                        00001080
                                                                        00001090
    END;                                                                00001100
                                                                        00001110
 /* ************************************************************** */   00001120
 /* ALTERNATIV 2:                                                  */   00001130
 /* -------------                                                  */   00001140
 /* ************************************************************** */   00001150
                                                                        00001160
                                                                        00001170
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00001180
     DO;                                                                00001190
       IF (B02.FRAVIK_8_1(BER_SØ_IND)= 'J' &                            00001200
          B02.BOSATT(BER_SØ_IND) > 0 ) &                                00001210
          B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) = 0 THEN              00001220
        DO;                                                             00001230
                                                                        00001240
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00001250
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00001260
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00001270
                                                                        00001280
         IF TT_EGEN > 39 THEN                                           00001290
            TT_EGEN = 40;                                               00001300
                                                                        00001310
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00001320
                                                                        00001330
         W_GP      = G * UFGRAD;                                        00001340
         W_GP      = W_GP / 100;                                        00001350
         W_GP      = W_GP * B02.TT_ANV(BER_SØ_IND);                     00001360
         W_GP      = W_GP / 40;                                         00001370
         W_GP      = W_GP / 12;                                         00001380
         W_GP      = W_GP + 0.5;                                        00001390
                                                                        00001400
                                                                        00001410
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00001420
                                                                        00001430
                                                                        00001440
        GO TO L999;                                                     00001450
                                                                        00001460
       END;                                                             00001470
                                                                        00001480
                                                                        00001490
   END;                                                                 00001500
                                                                        00001510
 /* ************************************************************** */   00001520
 /* ALTERNATIV 3:                                                  */   00001530
 /* --------------                                                 */   00001540
 /* ************************************************************** */   00001550
                                                                        00001560
                                                                        00001570
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00001580
     DO;                                                                00001590
                                                                        00001600
       IF B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) > 0 &                 00001610
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00001620
          B02.BOSATT(BER_SØ_IND) > 0  THEN                              00001630
        DO;                                                             00001640
                                                                        00001650
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00001660
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00001670
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) + 11) / 12); 00001680
                                                                        00001690
         IF TT_EGEN > 39 THEN                                           00001700
         TT_EGEN = 40;                                                  00001710
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00001720
                                                                        00001730
         W_GP      = G * UFGRAD;                                        00001740
         W_GP      = W_GP / 100;                                        00001750
         W_GP      = W_GP * B02.TT_ANV(BER_SØ_IND);                     00001760
         W_GP      = W_GP / 40;                                         00001770
         W_GP      = W_GP / 12;                                         00001780
         W_GP      = W_GP + 0.5;                                        00001790
                                                                        00001800
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00001810
                                                                        00001820
                                                                        00001830
        GO TO L999;                                                     00001840
                                                                        00001850
      END;                                                              00001860
                                                                        00001870
    END;                                                                00001880
                                                                        00001890
 /* ************************************************************** */   00001900
 /* BEREGNINGSREGLENES PARAGRAF 4.1.2.2 - ENSLIG PENSJONIST BOSATT */   00001910
 /* I UTLANDET, OG VILKÅRET OM FORUTGÅENDE TRYGDETID OPPFYLT.      */   00001920
 /* 19-3 KODER AVGJØR OM HVORDAN TRYGDETID SKAL BEREGNES, MEN      */   00001930
 /* DETTE SJEKKES KUN PÅ INPUTKONTROLLNIVÅ.                        */   00001940
 /* ************************************************************** */   00001950
                                                                        00001960
 /* ************************************************************** */   00001970
 /* ALTERNATIV 1:                                                  */   00001980
 /* --------------                                                 */   00001990
 /* ************************************************************** */   00002000
                                                                        00002010
                                                                        00002020
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00002030
     DO;                                                                00002040
                                                                        00002050
                                                                        00002060
      IF   (B02.BOSATT(BER_SØ_IND) > 0 &                                00002070
           B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J') &                    00002080
           (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                        00002090
           ((B02.TT_ETTER_1966(BER_SØ_IND) +                            00002100
           B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12)) >= 20 THEN         00002110
        DO;                                                             00002120
                                                                        00002130
                                                                        00002140
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00002150
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00002160
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00002170
                                                                        00002180
                                                                        00002190
         IF TT_EGEN > 39 THEN                                           00002200
            TT_EGEN = 40;                                               00002210
                                                                        00002220
                                                                        00002230
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00002240
                                                                        00002250
                                                                        00002260
         W_GP      = G * UFGRAD;                                        00002270
         W_GP      = W_GP / 100;                                        00002280
         W_GP      = W_GP * B02.TT_ANV(BER_SØ_IND);                     00002290
         W_GP      = W_GP / 40;                                         00002300
         W_GP      = W_GP / 12;                                         00002310
         W_GP      = W_GP + 0.5;                                        00002320
                                                                        00002330
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00002340
                                                                        00002350
                                                                        00002360
        GO TO L999;                                                     00002370
                                                                        00002380
     END;                                                               00002390
                                                                        00002400
   END;                                                                 00002410
                                                                        00002420
 /* ************************************************************** */   00002430
 /* ALTERNATIV 2:                                                  */   00002440
 /* --------------                                                 */   00002450
 /* ************************************************************** */   00002460
                                                                        00002470
                                                                        00002480
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00002490
     DO;                                                                00002500
                                                                        00002510
       IF (B02.BOSATT(BER_SØ_IND) > 0 &                                 00002520
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J') &                     00002530
          (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                         00002540
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00002550
          B02.TT_FRAMT_UFT(BER_SØ_IND) +11) / 12)) < 20 &               00002560
          (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                         00002570
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00002580
          B02.TT_FRAMT_UFT(BER_SØ_IND) +11) / 12)) > 10 THEN            00002590
        DO;                                                             00002600
                                                                        00002610
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00002620
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00002630
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00002640
                                                                        00002650
         IF TT_EGEN > 39 THEN                                           00002660
            TT_EGEN = 40;                                               00002670
                                                                        00002680
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00002690
                                                                        00002700
                                                                        00002710
         W_GP1     = G * UFGRAD;                                        00002720
         W_GP1     = W_GP1 / 100;                                       00002730
         W_GP1     = W_GP1 * B02.TT_ANV(BER_SØ_IND);                    00002740
         W_GP1     = W_GP1 / 40;                                        00002750
         W_GP1     = W_GP1 / 12;                                        00002760
         W_GP1     = W_GP1 + 0.5;                                       00002770
                                                                        00002780
                                                                        00002790
                                                                        00002800
                                                                        00002810
     END;                                                               00002820
                                                                        00002830
   END;                                                                 00002840
                                                                        00002850
 /* ************************************************************** */   00002860
 /* ALTERNATIV 3:                                                  */   00002870
 /* --------------                                                 */   00002880
 /* ************************************************************** */   00002890
                                                                        00002900
                                                                        00002910
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00002920
     DO;                                                                00002930
                                                                        00002940
       IF (B02.BOSATT(BER_SØ_IND) > 0 &                                 00002950
           B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J') &                    00002960
           (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                        00002970
           ((B02.TT_ETTER_1966(BER_SØ_IND) +                            00002980
           B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12)) <                  00002990
           B02.UFØRPENS.PÅ(BER_SØ_IND) &                                00003000
           B02.UFØRPENS.TP(BER_SØ_IND) > 0  THEN                        00003010
        DO;                                                             00003020
                                                                        00003030
        TT_EGEN = B02.UFØRPENS.PÅ(BER_SØ_IND);                          00003040
                                                                        00003050
        IF TT_EGEN > 39 THEN                                            00003060
           TT_EGEN = 40;                                                00003070
                                                                        00003080
        B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                               00003090
                                                                        00003100
         W_GP2     = G * UFGRAD;                                        00003110
         W_GP2     = W_GP2 / 100;                                       00003120
         W_GP2     = W_GP2 * B02.TT_ANV(BER_SØ_IND);                    00003130
         W_GP2     = W_GP2 / 40;                                        00003140
         W_GP2     = W_GP2 / 12;                                        00003150
         W_GP2     = W_GP2 + 0.5;                                       00003160
                                                                        00003170
                                                                        00003180
                                                                        00003190
     END;                                                               00003200
                                                                        00003210
  END;                                                                  00003220
                                                                        00003230
 /* ************************************************************** */   00003240
 /* HER TESTES DET PÅ HVILKET AV ALTERNATIV 1 OG 2 SOM GIR BEST    */   00003250
 /* GRUNNPENSJON.  W_GP1 OG W_GP2 ER DERFOR INNFØRT.               */   00003260
 /* ************************************************************** */   00003270
                                                                        00003280
  IF W_GP1 > 0 ! W_GP2 > 0 THEN                                         00003290
     DO;                                                                00003300
                                                                        00003310
       IF W_GP1 > W_GP2 THEN                                            00003320
          B02.UFØRPENS.GP(BER_SØ_IND) = W_GP1;                          00003330
       ELSE                                                             00003340
          B02.UFØRPENS.GP(BER_SØ_IND) = W_GP2;                          00003350
                                                                        00003360
                                                                        00003370
       GO TO L999;                                                      00003380
                                                                        00003390
     END;                                                               00003400
                                                                        00003410
                                                                        00003420
 /* ************************************************************** */   00003430
 /* ALTERNATIV 4 A:                                                */   00003440
 /* ---------------                                                */   00003450
 /* ************************************************************** */   00003460
                                                                        00003470
                                                                        00003480
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00003490
     DO;                                                                00003500
                                                                        00003510
       IF (B02.BOSATT(BER_SØ_IND) > 0)  &                               00003520
          (B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J') &                    00003530
          (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                         00003540
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00003550
          B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12)) < 10  THEN          00003560
        DO;                                                             00003570
                                                                        00003580
                                                                        00003590
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00003600
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00003610
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00003620
                                                                        00003630
                                                                        00003640
        IF TT_EGEN > 39 THEN                                            00003650
           TT_EGEN = 40;                                                00003660
                                                                        00003670
         IF TT_EGEN > B02.UFØRPENS.PÅ(BER_SØ_IND) THEN                  00003680
            B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                           00003690
                                                                        00003700
                                                                        00003710
         W_GP     = G * UFGRAD;                                         00003720
         W_GP     = W_GP / 100;                                         00003730
         W_GP     = W_GP * B02.TT_ANV(BER_SØ_IND);                      00003740
         W_GP     = W_GP / 40;                                          00003750
         W_GP     = W_GP / 12;                                          00003760
         W_GP     = W_GP + 0.5;                                         00003770
                                                                        00003780
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00003790
                                                                        00003800
                                                                        00003810
       GO TO L999;                                                      00003820
                                                                        00003830
     END;                                                               00003840
                                                                        00003850
   END;                                                                 00003860
                                                                        00003870
 /* ************************************************************** */   00003880
 /* ALTERNATIV 4 B:                                                */   00003890
 /* ---------------                                                */   00003900
 /* ************************************************************** */   00003910
                                                                        00003920
                                                                        00003930
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00003940
     DO;                                                                00003950
                                                                        00003960
                                                                        00003970
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00003980
          (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                         00003990
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00004000
          B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12)) < 10  &             00004010
          (B02.FRAVIK_19_3(BER_SØ_IND) ^= ' ') THEN                     00004020
       DO;                                                              00004030
                                                                        00004040
                                                                        00004050
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00004060
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00004070
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00004080
                                                                        00004090
                                                                        00004100
        IF TT_EGEN > 39 THEN                                            00004110
           TT_EGEN = 40;                                                00004120
                                                                        00004130
                                                                        00004140
                                                                        00004150
         IF TT_EGEN > B02.UFØRPENS.PÅ(BER_SØ_IND) THEN                  00004160
            B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                           00004170
                                                                        00004180
                                                                        00004190
         W_GP     = G * UFGRAD;                                         00004200
         W_GP     = W_GP / 100;                                         00004210
         W_GP     = W_GP * B02.TT_ANV(BER_SØ_IND);                      00004220
         W_GP     = W_GP / 40;                                          00004230
         W_GP     = W_GP / 12;                                          00004240
         W_GP     = W_GP + 0.5;                                         00004250
                                                                        00004260
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00004270
                                                                        00004280
                                                                        00004290
       GO TO L999;                                                      00004300
                                                                        00004310
     END;                                                               00004320
                                                                        00004330
   END;                                                                 00004340
                                                                        00004350
                                                                        00004360
 /* ************************************************************** */   00004370
 /* ALTERNATIV 5:                                                  */   00004380
 /* -------------                                                  */   00004390
 /* ************************************************************** */   00004400
                                                                        00004410
                                                                        00004420
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00004430
     DO;                                                                00004440
                                                                        00004450
       IF (B02.FRAVIK_8_1(BER_SØ_IND)= 'J' &                            00004460
         B02.BOSATT(BER_SØ_IND) > 0 ) THEN                              00004470
        DO;                                                             00004480
                                                                        00004490
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00004500
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00004510
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00004520
                                                                        00004530
         IF TT_EGEN > 39 THEN                                           00004540
            TT_EGEN = 40;                                               00004550
                                                                        00004560
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00004570
                                                                        00004580
                                                                        00004590
         W_GP     = G * UFGRAD;                                         00004600
         W_GP     = W_GP / 100;                                         00004610
         W_GP     = W_GP * B02.TT_ANV(BER_SØ_IND);                      00004620
         W_GP     = W_GP / 40;                                          00004630
         W_GP     = W_GP / 12;                                          00004640
         W_GP     = W_GP + 0.5;                                         00004650
                                                                        00004660
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00004670
                                                                        00004680
                                                                        00004690
       GO TO L999;                                                      00004700
                                                                        00004710
     END;                                                               00004720
                                                                        00004730
  END;                                                                  00004740
                                                                        00004750
                                                                        00004760
                                                                        00004770
 /* ************************************************************** */   00004780
 /* ALTERNATIV 6:                                                  */   00004790
 /* --------------                                                 */   00004800
 /* ************************************************************** */   00004810
                                                                        00004820
                                                                        00004830
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00004840
     DO;                                                                00004850
                                                                        00004860
       IF (B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) > 0 &                00004870
          B02.BOSATT(BER_SØ_IND) > 0) THEN                              00004880
        DO;                                                             00004890
                                                                        00004900
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00004910
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00004920
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) + 11) / 12); 00004930
                                                                        00004940
         IF TT_EGEN > 39 THEN                                           00004950
            TT_EGEN = 40;                                               00004960
                                                                        00004970
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00004980
                                                                        00004990
         W_GP     = G * UFGRAD;                                         00005000
         W_GP     = W_GP / 100;                                         00005010
         W_GP     = W_GP * B02.TT_ANV(BER_SØ_IND);                      00005020
         W_GP     = W_GP / 40;                                          00005030
         W_GP     = W_GP / 12;                                          00005040
         W_GP     = W_GP + 0.5;                                         00005050
                                                                        00005060
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00005070
                                                                        00005080
                                                                        00005090
       GO TO L999;                                                      00005100
                                                                        00005110
     END;                                                               00005120
                                                                        00005130
   END;                                                                 00005140
                                                                        00005150
 /* ************************************************************** */   00005160
 /* ALTERNATIV 7, MEST VANLIG TILFELLE (?):                        */   00005170
 /* ---------------------------------------                        */   00005180
 /* ************************************************************** */   00005190
                                                                        00005200
                                                                        00005210
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00005220
     DO;                                                                00005230
                                                                        00005240
       IF B02.BOSATT(BER_SØ_IND) > 0  &                                 00005250
          B02.FRAVIK_BOSATT(BER_SØ_IND) = 'J' THEN                      00005260
       DO;                                                              00005270
                                                                        00005280
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00005290
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00005300
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00005310
                                                                        00005320
         IF TT_EGEN > 39 THEN                                           00005330
            TT_EGEN = 40;                                               00005340
                                                                        00005350
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00005360
                                                                        00005370
                                                                        00005380
    W_GP      = G * UFGRAD;                                             00005390
    W_GP      = W_GP / 100;                                             00005400
    W_GP      = W_GP * B02.TT_ANV(BER_SØ_IND);                          00005410
    W_GP      = W_GP / 40;                                              00005420
    W_GP      = W_GP / 12;                                              00005430
    W_GP      = W_GP + 0.5;                                             00005440
                                                                        00005450
                                                                        00005460
    B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                                 00005470
                                                                        00005480
                                                                        00005490
     GO TO L999;                                                        00005500
                                                                        00005510
     END;                                                               00005520
                                                                        00005530
                                                                        00005540
    END;                                                                00005550
                                                                        00005560
 /* ************************************************************** */   00005570
 /* ALTERNATIV 8, GANSKE VANLIG TILFELLE:                          */   00005580
 /* -------------------------------------                          */   00005590
 /* ************************************************************** */   00005600
                                                                        00005610
                                                                        00005620
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) ^= 'S' THEN                  00005630
     DO;                                                                00005640
                                                                        00005650
       IF B02.BOSATT(BER_SØ_IND) > 0  THEN                              00005660
       DO;                                                              00005670
                                                                        00005680
         TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                 00005690
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00005700
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00005710
                                                                        00005720
         IF TT_EGEN > 39 THEN                                           00005730
            TT_EGEN = 40;                                               00005740
                                                                        00005750
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00005760
                                                                        00005770
                                                                        00005780
    W_GP      = G * UFGRAD;                                             00005790
    W_GP      = W_GP / 100;                                             00005800
    W_GP      = W_GP * B02.TT_ANV(BER_SØ_IND);                          00005810
    W_GP      = W_GP / 40;                                              00005820
    W_GP      = W_GP / 12;                                              00005830
    W_GP      = W_GP + 0.5;                                             00005840
                                                                        00005850
                                                                        00005860
    B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                                 00005870
                                                                        00005880
                                                                        00005890
     GO TO L999;                                                        00005900
                                                                        00005910
     END;                                                               00005920
                                                                        00005930
                                                                        00005940
    END;                                                                00005950
 /* ************************************************************** */   00005960
 /* HER SLUTTER GRUNNPENSJONSBEREGNINGEN FOR ENSLIG PENSJONIST.    */   00005970
 /* ERIK 30.1.1990.                                                */   00005980
 /* ************************************************************** */   00005990
                                                                        00006000
                                                                        00006010
 /* ************************************************************** */   00006020
 /* BEREGNINGSREGLENES PARAGRAF 4.1.3.1 - SAMMENSTØTENDE PENSJON.  */   00006030
 /* BOSATT I UTLANDET.  BEGGE EKTEFELLER BOSATT I UTLANDET NÅR     */   00006040
 /* UFØREPENSJON TILSTÅS.                                          */   00006050
 /* ************************************************************** */   00006060
                                                                        00006070
 /* ************************************************************** */   00006080
 /* ALTERNATIV 1 A:                                                */   00006090
 /* ---------------                                                */   00006100
 /* ************************************************************** */   00006110
                                                                        00006120
   DCL TRUDE_FNR  DEC FIXED (11);                                       00006130
   TRUDE_FNR = B02.FNR(BER_SØ_IND);                                     00006140
                                                                        00006150
                                                                        00006160
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00006170
     DO;                                                                00006180
                                                                        00006190
       IF (B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                     00006200
          B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                      00006210
          B02.BOSATT(BER_SØ_IND) > 0 &                                  00006220
          B02.BOSATT(BER_EK_IND) > 0)  THEN                             00006230
        DO;                                                             00006240
                                                                        00006250
                                                                        00006260
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00006270
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00006280
            /*     B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12); */         00006290
                                                                        00006300
                                                                        00006310
         IF TT_EGEN > 39 THEN                                           00006320
            TT_EGEN = 40;                                               00006330
                                                                        00006340
                                                                        00006350
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00006360
                                                                        00006370
                                                                        00006380
         TT_EK = ((B02.TT_ETTER_1966(BER_EK_IND) +                      00006390
                   B02.TT_FRAMT(BER_EK_IND) + 11) / 12);                00006400
           /*      B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12); */         00006410
                                                                        00006420
         IF TT_EK > 39 THEN                                             00006430
            TT_EK = 40;                                                 00006440
                                                                        00006450
                                                                        00006460
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00006470
                                                                        00006480
                                                                        00006490
         IF B02.TT_ANV(BER_SØ_IND) < B01.TT_ANV(BER_EK_IND) THEN        00006500
              B02.TT_ANV(BER_SØ_IND) = B01.TT_ANV(BER_EK_IND);          00006510
                                                                        00006520
                                                                        00006530
         IF  B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                 00006540
            DO;                                                         00006550
                                                                        00006560
                                                                        00006570
                                                                        00006580
              W_GP3 = 1 - (0.25 * FAKTOR / 100);                        00006590
              W_GP3 = W_GP3 * G;                                        00006600
              W_GP3 = W_GP3 * B02.TT_ANV(BER_SØ_IND);                   00006610
              W_GP3 = W_GP3 / 40;                                       00006620
              W_GP3 = W_GP3 / 12;                                       00006630
              W_GP3 = W_GP3 / 100;                                      00006640
              W_GP3 = W_GP3 * UFGRAD;                                   00006650
              W_GP3 = W_GP3 + 0.5;                                      00006660
                                                                        00006670
              B02.UFØRPENS.GP(BER_SØ_IND) = W_GP3;                      00006680
                                                                        00006690
                                                                        00006700
              GO TO L999;                                               00006710
                                                                        00006720
          END;                                                          00006730
                                                                        00006740
                                                                        00006750
    END;                                                                00006760
                                                                        00006770
  END;                                                                  00006780
                                                                        00006790
                                                                        00006800
 /* ************************************************************** */   00006810
 /* ALTERNATIV 2 A:                                                */   00006820
 /* ---------------                                                */   00006830
 /* ************************************************************** */   00006840
                                                                        00006850
                                                                        00006860
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00006870
     DO;                                                                00006880
                                                                        00006890
       IF (B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                     00006900
          B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                      00006910
          B02.BOSATT(BER_SØ_IND) > 0 &                                  00006920
          B02.BOSATT(BER_EK_IND) > 0 &                                  00006930
          B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) > 0) THEN             00006940
        DO;                                                             00006950
                                                                        00006960
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00006970
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00006980
                                                                        00006990
         IF TT_EGEN > 39 THEN                                           00007000
            TT_EGEN = 40;                                               00007010
                                                                        00007020
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00007030
                                                                        00007040
         TT_EK = ((B02.TT_ETTER_1966(BER_EK_IND) +                      00007050
                 B02.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00007060
                                                                        00007070
         IF TT_EK > 39 THEN                                             00007080
            TT_EK = 40;                                                 00007090
                                                                        00007100
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00007110
                                                                        00007120
                                                                        00007130
         IF B02.TT_ANV(BER_EK_IND) > B02.TT_ANV(BER_SØ_IND) THEN        00007140
            B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            00007150
                                                                        00007160
                                                                        00007170
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00007180
         W_GP = W_GP * G;                                               00007190
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00007200
         W_GP = W_GP / 40;                                              00007210
         W_GP = W_GP / 12;                                              00007220
         W_GP = W_GP / 100;                                             00007230
         W_GP = W_GP * UFGRAD;                                          00007240
         W_GP = W_GP + 0.5;                                             00007250
                                                                        00007260
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00007270
                                                                        00007280
                                                                        00007290
         GO TO L999;                                                    00007300
                                                                        00007310
    END;                                                                00007320
                                                                        00007330
                                                                        00007340
   END;                                                                 00007350
                                                                        00007360
 /* ************************************************************** */   00007370
 /* ALTERNATIV 3 A:                                                */   00007380
 /* ---------------                                                */   00007390
 /* ************************************************************** */   00007400
                                                                        00007410
                                                                        00007420
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00007430
     DO;                                                                00007440
                                                                        00007450
      IF (B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                      00007460
         B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                       00007470
         B02.BOSATT(BER_SØ_IND) > 0 &                                   00007480
         B02.BOSATT(BER_EK_IND) > 0 &                                   00007490
         B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) > 0) THEN              00007500
        DO;                                                             00007510
                                                                        00007520
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00007530
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) + 11) / 12); 00007540
                                                                        00007550
         IF TT_EGEN > 39 THEN                                           00007560
            TT_EGEN = 40;                                               00007570
                                                                        00007580
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00007590
                                                                        00007600
         TT_EK = ((B02.TT_ETTER_1966(BER_EK_IND) +                      00007610
                 B02.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00007620
                                                                        00007630
         IF TT_EK > 39 THEN                                             00007640
            TT_EK = 40;                                                 00007650
                                                                        00007660
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00007670
                                                                        00007680
         IF B02.TT_ANV(BER_EK_IND) > B02.TT_ANV(BER_SØ_IND) THEN        00007690
            B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            00007700
                                                                        00007710
                                                                        00007720
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00007730
         W_GP = W_GP * G;                                               00007740
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00007750
         W_GP = W_GP / 40;                                              00007760
         W_GP = W_GP / 12;                                              00007770
         W_GP = W_GP / 100;                                             00007780
         W_GP = W_GP * UFGRAD;                                          00007790
         W_GP = W_GP + 0.5;                                             00007800
                                                                        00007810
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00007820
                                                                        00007830
                                                                        00007840
         GO TO L999;                                                    00007850
                                                                        00007860
                                                                        00007870
    END;                                                                00007880
                                                                        00007890
  END;                                                                  00007900
                                                                        00007910
                                                                        00007920
 /* ************************************************************** */   00007930
 /* ALTERNATIV 1 B:                                                */   00007940
 /* ---------------                                                */   00007950
 /* HER MÅ DET OGSÅ TAS MED 19-3 KODER FOR TT FØR 1967. TRUDE 13.8 */   00007960
 /* ---------------                                                */   00007970
 /* ************************************************************** */   00007980
                                                                        00007990
                                                                        00008000
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00008010
     DO;                                                                00008020
                                                                        00008030
      IF (B02.BOSATT(BER_SØ_IND) > 0 &                                  00008040
          B02.BOSATT(BER_EK_IND) > 0 ) &                                00008050
         (B02.FRAVIK_19_3(BER_SØ_IND) = '2'  !               /*TRUDE*/  00008060
          B02.FRAVIK_19_3(BER_SØ_IND) = '3' ) THEN           /*TRUDE*/  00008070
       DO;                                                              00008080
                                                                        00008090
                                                                        00008100
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00008110
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00008120
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00008130
                                                                        00008140
         IF TT_EGEN > 39 THEN                                           00008150
            TT_EGEN = 40;                                               00008160
                                                                        00008170
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00008180
                                                                        00008190
                                                                        00008200
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00008210
         W_GP = W_GP * G;                                               00008220
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00008230
         W_GP = W_GP / 40;                                              00008240
         W_GP = W_GP / 12;                                              00008250
         W_GP = W_GP / 100;                                             00008260
         W_GP = W_GP * UFGRAD;                                          00008270
         W_GP = W_GP + 0.5;                                             00008280
                                                                        00008290
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00008300
                                                                        00008310
                                                                        00008320
         GO TO L999;                                                    00008330
                                                                        00008340
       END;                                                             00008350
  END;                                                                  00008360
                                                                        00008370
                                                                        00008380
 /* ************************************************************** */   00008390
 /* ALTERNATIV 2 B STREKPUNKT 1:                                   */   00008400
 /* ----------------------------                                   */   00008410
 /* OVERFØRING AV TT  ??? LIK TT ?? ENDR. TRUDE 13.08.90           */   00008420
 /* ----------------------------                                   */   00008430
 /* ************************************************************** */   00008440
                                                                        00008450
                                                                        00008460
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00008470
     DO;                                                                00008480
                                                                        00008490
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00008500
          B02.BOSATT(BER_EK_IND) > 0 &                                  00008510
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J'  THEN                        00008520
        DO;                                                             00008530
                                                                        00008540
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00008550
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00008560
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00008570
                                                                        00008580
         IF TT_EGEN > 39 THEN                                           00008590
            TT_EGEN = 40;                                               00008600
                                                                        00008610
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00008620
                                                                        00008630
         TT_EK = B01.TT_FØR_1967(BER_EK_IND) +                          00008640
                 ((B01.TT_ETTER_1966(BER_EK_IND) +                      00008650
                 B01.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00008660
                                                                        00008670
         IF TT_EK > 39 THEN                                             00008680
            TT_EK = 40;                                                 00008690
                                                                        00008700
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00008710
                                                                        00008720
                              /* TO NESTE LINJER TRUDE */               00008730
         IF B02.TT_ANV(BER_EK_IND) > B02.TT_ANV(BER_SØ_IND) THEN        00008740
            B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            00008750
                                                                        00008760
                                                                        00008770
                                                                        00008780
         IF /*B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) & TRUDE */00008790
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00008800
            DO;                                                         00008810
                                                                        00008820
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00008830
         W_GP = W_GP * G;                                               00008840
   /*    W_GP = W_GP * B02.TT_ANV(BER_EK_IND);     TRUDE*/              00008850
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00008860
         W_GP = W_GP / 40;                                              00008870
         W_GP = W_GP / 12;                                              00008880
         W_GP = W_GP / 100;                                             00008890
         W_GP = W_GP * UFGRAD;                                          00008900
         W_GP = W_GP + 0.5;                                             00008910
                                                                        00008920
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00008930
                                                                        00008940
         GO TO L999;   /*TRUDE*/                                        00008950
      END;                                                              00008960
                                                                        00008970
    END;                                                                00008980
                                                                        00008990
  END;                                                                  00009000
                                                                        00009010
 /* ************************************************************** */   00009020
 /* ALTERNATIV 2 B STREKPUNKT 2:                                   */   00009030
 /* ----------------------------                                   */   00009040
 /* KOMMENTERES UT. TRUDE 13.08.90                                 */   00009050
 /* ************************************************************** */   00009060
                                                                        00009070
   /* NB!!!!*********                                                   00009080
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00009090
     DO;                                                                00009100
                                                                        00009110
                                                                        00009120
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00009130
         B02.BOSATT(BER_EK_IND) > 0 &                                   00009140
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J'  THEN                         00009150
        DO;                                                             00009160
                                                                        00009170
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00009180
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00009190
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00009200
                                                                        00009210
         IF TT_EGEN > 39 THEN                                           00009220
            TT_EGEN = 40;                                               00009230
                                                                        00009240
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00009250
                                                                        00009260
         TT_EK = B01.TT_FØR_1967(BER_EK_IND) +                          00009270
                 ((B01.TT_ETTER_1966(BER_EK_IND) +                      00009280
                 B01.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00009290
                                                                        00009300
         IF TT_EK > 39 THEN                                             00009310
            TT_EK = 40;                                                 00009320
                                                                        00009330
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00009340
                                                                        00009350
                                                                        00009360
         IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) &           00009370
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00009380
            DO;                                                         00009390
                                                                        00009400
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00009410
         W_GP = W_GP * G;                                               00009420
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00009430
         W_GP = W_GP / 40;                                              00009440
         W_GP = W_GP / 12;                                              00009450
         W_GP = W_GP / 100;                                             00009460
         W_GP = W_GP * UFGRAD;                                          00009470
         W_GP = W_GP + 0.5;                                             00009480
                                                                        00009490
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00009500
                                                                        00009510
                                                                        00009520
         GO TO L999;                                                    00009530
                                                                        00009540
                                                                        00009550
           END;                                                         00009560
                                                                        00009570
       END;                                                             00009580
                                                                        00009590
    END;    *****NB!!!!!!  TRUDE   */                                   00009600
                                                                        00009610
                                                                        00009620
 /* ************************************************************** */   00009630
 /* ALTERNATIV 2 B STREKPUNKT 3:                                   */   00009640
 /* ----------------------------                                   */   00009650
 /* ************************************************************** */   00009660
                                                                        00009670
                                                                        00009680
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00009690
     DO;                                                                00009700
                                                                        00009710
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00009720
         B02.BOSATT(BER_EK_IND) > 0 &                                   00009730
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J'  THEN                         00009740
       DO;                                                              00009750
                                                                        00009760
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00009770
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00009780
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00009790
                                                                        00009800
         IF TT_EGEN > 39 THEN                                           00009810
            TT_EGEN = 40;                                               00009820
                                                                        00009830
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00009840
                                                                        00009850
                                                                        00009860
         TT_EK = B01.TT_FØR_1967(BER_EK_IND) +                          00009870
                 ((B01.TT_ETTER_1966(BER_EK_IND) +                      00009880
                 B01.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00009890
                                                                        00009900
         IF TT_EK > 39 THEN                                             00009910
            TT_EK = 40;                                                 00009920
                                                                        00009930
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00009940
                                                                        00009950
         IF (B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND)) &         00009960
            (B02.TT_ETTER_1966(BER_SØ_IND) >                            00009970
             B02.TT_ETTER_1966(BER_EK_IND)) &                           00009980
             B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                 00009990
            DO;                                                         00010000
                                                                        00010010
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00010020
         W_GP = W_GP * G;                                               00010030
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00010040
         W_GP = W_GP / 40;                                              00010050
         W_GP = W_GP / 12;                                              00010060
         W_GP = W_GP / 100;                                             00010070
         W_GP = W_GP * UFGRAD;                                          00010080
         W_GP = W_GP + 0.5;                                             00010090
                                                                        00010100
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00010110
                                                                        00010120
                                                                        00010130
         GO TO L999;                                                    00010140
                                                                        00010150
                                                                        00010160
            END;                                                        00010170
                                                                        00010180
        END;                                                            00010190
                                                                        00010200
    END;                                                                00010210
                                                                        00010220
                                                                        00010230
 /* ************************************************************** */   00010240
 /* ALTERNATIV 3 B PUNKT A:                                        */   00010250
 /* -----------------------                                        */   00010260
 /* ************************************************************** */   00010270
                                                                        00010280
                                                                        00010290
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00010300
     DO;                                                                00010310
                                                                        00010320
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00010330
         B02.BOSATT(BER_EK_IND) > 0 &                                   00010340
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J'  THEN                         00010350
       DO;                                                              00010360
                                                                        00010370
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00010380
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00010390
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) + 11) / 12); 00010400
                                                                        00010410
         IF TT_EGEN > 39 THEN                                           00010420
            TT_EGEN = 40;                                               00010430
                                                                        00010440
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00010450
                                                                        00010460
                                                                        00010470
         TT_EK = B01.TT_FØR_1967(BER_EK_IND) +                          00010480
                 ((B01.TT_ETTER_1966(BER_EK_IND) +                      00010490
                 B01.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00010500
                                                                        00010510
         IF TT_EK > 39 THEN                                             00010520
            TT_EK = 40;                                                 00010530
                                                                        00010540
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00010550
                                                                        00010560
         IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) &           00010570
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00010580
            DO;                                                         00010590
                                                                        00010600
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00010610
         W_GP = W_GP * G;                                               00010620
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00010630
         W_GP = W_GP / 40;                                              00010640
         W_GP = W_GP / 12;                                              00010650
         W_GP = W_GP / 100;                                             00010660
         W_GP = W_GP * UFGRAD;                                          00010670
         W_GP = W_GP + 0.5;                                             00010680
                                                                        00010690
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00010700
                                                                        00010710
                                                                        00010720
         GO TO L999;                                                    00010730
                                                                        00010740
            END;                                                        00010750
                                                                        00010760
    END;                                                                00010770
                                                                        00010780
                                                                        00010790
  END;                                                                  00010800
                                                                        00010810
                                                                        00010820
 /* ************************************************************** */   00010830
 /* ALTERNATIV 3 B PUNKT B:                                        */   00010840
 /* -----------------------                                        */   00010850
 /* ************************************************************** */   00010860
                                                                        00010870
                                                                        00010880
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00010890
     DO;                                                                00010900
                                                                        00010910
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00010920
         B02.BOSATT(BER_EK_IND) > 0 &                                   00010930
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J'  THEN                         00010940
       DO;                                                              00010950
                                                                        00010960
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00010970
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00010980
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) + 11) / 12); 00010990
                                                                        00011000
         IF TT_EGEN > 39 THEN                                           00011010
            TT_EGEN = 40;                                               00011020
                                                                        00011030
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00011040
                                                                        00011050
                                                                        00011060
         TT_EK = B01.TT_FØR_1967(BER_EK_IND) +                          00011070
                 ((B01.TT_ETTER_1966(BER_EK_IND) +                      00011080
                 B01.TT_FRAMT(BER_EK_IND) + 11) / 12);                  00011090
                                                                        00011100
         IF TT_EK > 39 THEN                                             00011110
            TT_EK = 40;                                                 00011120
                                                                        00011130
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00011140
                                                                        00011150
                                                                        00011160
         IF (B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND)) &         00011170
             B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                 00011180
            DO;                                                         00011190
                                                                        00011200
                                                                        00011210
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00011220
         W_GP = W_GP * G;                                               00011230
         W_GP = W_GP * B02.TT_ANV(BER_EK_IND);                          00011240
         W_GP = W_GP / 40;                                              00011250
         W_GP = W_GP / 12;                                              00011260
         W_GP = W_GP / 100;                                             00011270
         W_GP = W_GP * UFGRAD;                                          00011280
         W_GP = W_GP + 0.5;                                             00011290
                                                                        00011300
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00011310
                                                                        00011320
                                                                        00011330
         GO TO L999;                                                    00011340
                                                                        00011350
          END;                                                          00011360
                                                                        00011370
    END;                                                                00011380
                                                                        00011390
  END;                                                                  00011400
                                                                        00011410
                                                                        00011420
 /* ************************************************************** */   00011430
 /* BEREGNINGSREGLENES PARAGRAF 4.1.3.2 - SAMMENSTØTENDE PENSJON.  */   00011440
 /* BOSATT I UTLANDET.  BEGGE EKTEFELLER BOSATT I UTLANDET NÅR     */   00011450
 /* UFØREPENSJON TILSTÅS. FORUTGÅENDE TT OPPFYLT.                  */   00011460
 /* ************************************************************** */   00011470
                                                                        00011480
 /* ************************************************************** */   00011490
 /* ALTERNATIV 1:                                                  */   00011500
 /* -------------                                                  */   00011510
 /* ************************************************************** */   00011520
                                                                        00011530
                                                                        00011540
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00011550
     DO;                                                                00011560
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00011570
         B02.BOSATT(BER_EK_IND) > 0 &                                   00011580
         B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                       00011590
         B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                       00011600
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                             00011610
         B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                       00011620
         ((B02.TT_ETTER_1966(BER_SØ_IND) +                              00011630
         B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12) >= 20  THEN           00011640
                                                                        00011650
       DO;                                                              00011660
                                                                        00011670
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00011680
                   B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                00011690
                                                                        00011700
         IF TT_EGEN > 39 THEN                                           00011710
            TT_EGEN = 40;                                               00011720
                                                                        00011730
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00011740
                                                                        00011750
                                                                        00011760
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00011770
         W_GP = W_GP * G;                                               00011780
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00011790
         W_GP = W_GP / 40;                                              00011800
         W_GP = W_GP / 12;                                              00011810
         W_GP = W_GP / 100;                                             00011820
         W_GP = W_GP * UFGRAD;                                          00011830
         W_GP = W_GP + 0.5;                                             00011840
                                                                        00011850
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00011860
                                                                        00011870
                                                                        00011880
         GO TO L999;                                                    00011890
                                                                        00011900
                                                                        00011910
                                                                        00011920
                                                                        00011930
       END;                                                             00011940
                                                                        00011950
                                                                        00011960
    END;                                                                00011970
                                                                        00011980
                                                                        00011990
 /* ************************************************************** */   00012000
 /* ALTERNATIV 2:                                                  */   00012010
 /* -------------                                                  */   00012020
 /* ************************************************************** */   00012030
                                                                        00012040
                                                                        00012050
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00012060
     DO;                                                                00012070
                                                                        00012080
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00012090
         B02.BOSATT(BER_EK_IND) > 0 &                                   00012100
         B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                       00012110
         B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                       00012120
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                             00012130
         B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                       00012140
         ((B02.TT_ETTER_1966(BER_SØ_IND) +                              00012150
         B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12) < 20  &               00012160
         ((B02.TT_ETTER_1966(BER_SØ_IND) +                              00012170
         B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12) >= 10  THEN           00012180
                                                                        00012190
       DO;                                                              00012200
                                                                        00012210
                                                                        00012220
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00012230
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00012240
                                                                        00012250
         IF TT_EGEN > 39 THEN                                           00012260
            TT_EGEN = 40;                                               00012270
                                                                        00012280
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00012290
                                                                        00012300
                                                                        00012310
         TT_EK = ((B02.TT_ETTER_1966(BER_EK_IND) +                      00012320
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00012330
                                                                        00012340
         IF TT_EK > 39 THEN                                             00012350
            TT_EK = 40;                                                 00012360
                                                                        00012370
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00012380
                                                                        00012390
                                                                        00012400
                                                                        00012410
         IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) &           00012420
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00012430
            DO;                                                         00012440
                                                                        00012450
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00012460
         W_GP = W_GP * G;                                               00012470
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00012480
         W_GP = W_GP / 40;                                              00012490
         W_GP = W_GP / 12;                                              00012500
         W_GP = W_GP / 100;                                             00012510
         W_GP = W_GP * UFGRAD;                                          00012520
         W_GP = W_GP + 0.5;                                             00012530
                                                                        00012540
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00012550
                                                                        00012560
                                                                        00012570
         GO TO L999;                                                    00012580
                                                                        00012590
            END;                                                        00012600
                                                                        00012610
         IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) &           00012620
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00012630
            DO;                                                         00012640
                                                                        00012650
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00012660
         W_GP = W_GP * G;                                               00012670
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00012680
         W_GP = W_GP / 40;                                              00012690
         W_GP = W_GP / 12;                                              00012700
         W_GP = W_GP / 100;                                             00012710
         W_GP = W_GP * UFGRAD;                                          00012720
         W_GP = W_GP + 0.5;                                             00012730
                                                                        00012740
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00012750
                                                                        00012760
                                                                        00012770
         GO TO L999;                                                    00012780
                                                                        00012790
            END;                                                        00012800
                                                                        00012810
                                                                        00012820
       END;                                                             00012830
                                                                        00012840
    END;                                                                00012850
                                                                        00012860
                                                                        00012870
 /* ************************************************************** */   00012880
 /* ALTERNATIV 3:                                                  */   00012890
 /* -------------                                                  */   00012900
 /* ************************************************************** */   00012910
                                                                        00012920
                                                                        00012930
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00012940
     DO;                                                                00012950
                                                                        00012960
      IF B02.BOSATT(BER_SØ_IND) > 0 &                                   00012970
         B02.BOSATT(BER_EK_IND) > 0 &                                   00012980
         B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                       00012990
         B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                       00013000
         B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                             00013010
         B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                       00013020
         B02.UFØRPENS.TP(BER_SØ_IND) > 0 THEN                           00013030
                                                                        00013040
        DO;                                                             00013050
                                                                        00013060
                                                                        00013070
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00013080
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00013090
                                                                        00013100
         IF TT_EGEN > 39 THEN                                           00013110
            TT_EGEN = 40;                                               00013120
                                                                        00013130
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00013140
                                                                        00013150
         IF B02.UFØRPENS.PÅ(BER_SØ_IND) > B02.TT_ANV(BER_SØ_IND) THEN   00013160
            B02.TT_ANV(BER_SØ_IND) = B02.UFØRPENS.PÅ(BER_SØ_IND);       00013170
                                                                        00013180
                                                                        00013190
         TT_EK = ((B02.TT_ETTER_1966(BER_EK_IND) +                      00013200
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00013210
                                                                        00013220
         IF TT_EK > 39 THEN                                             00013230
            TT_EK = 40;                                                 00013240
                                                                        00013250
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00013260
                                                                        00013270
                                                                        00013280
         IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) &           00013290
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00013300
            DO;                                                         00013310
                                                                        00013320
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00013330
         W_GP = W_GP * G;                                               00013340
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00013350
         W_GP = W_GP / 40;                                              00013360
         W_GP = W_GP / 12;                                              00013370
         W_GP = W_GP / 100;                                             00013380
         W_GP = W_GP * UFGRAD;                                          00013390
         W_GP = W_GP + 0.5;                                             00013400
                                                                        00013410
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00013420
                                                                        00013430
                                                                        00013440
         GO TO L999;                                                    00013450
                                                                        00013460
           END;                                                         00013470
                                                                        00013480
         IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) &           00013490
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00013500
            DO;                                                         00013510
                                                                        00013520
                                                                        00013530
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00013540
         W_GP = W_GP * G;                                               00013550
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00013560
         W_GP = W_GP / 40;                                              00013570
         W_GP = W_GP / 12;                                              00013580
         W_GP = W_GP / 100;                                             00013590
         W_GP = W_GP * UFGRAD;                                          00013600
         W_GP = W_GP + 0.5;                                             00013610
                                                                        00013620
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00013630
                                                                        00013640
                                                                        00013650
         GO TO L999;                                                    00013660
                                                                        00013670
           END;                                                         00013680
                                                                        00013690
                                                                        00013700
                                                                        00013710
                                                                        00013720
       END;                                                             00013730
                                                                        00013740
                                                                        00013750
    END;                                                                00013760
                                                                        00013770
                                                                        00013780
 /* ************************************************************** */   00013790
 /* ALTERNATIV 4 A:                                                */   00013800
 /* ---------------                                                */   00013810
 /* ************************************************************** */   00013820
                                                                        00013830
                                                                        00013840
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00013850
     DO;                                                                00013860
                                                                        00013870
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00013880
          B02.BOSATT(BER_EK_IND) > 0 &                                  00013890
          B02.STATUS.TT_FØR_1967(BER_SØ_IND) > 0 &                      00013900
          B02.STATUS.TT_FØR_1967(BER_EK_IND) > 0 &                      00013910
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00013920
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                      00013930
          B02.UFØRPENS.TP(BER_SØ_IND) > 0 &                             00013940
          (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                         00013950
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00013960
          B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12)) < 10  &             00013970
          (B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                         00013980
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00013990
          B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12)) >                   00014000
          B02.UFØRPENS.PÅ(BER_SØ_IND) THEN                              00014010
                                                                        00014020
        DO;                                                             00014030
                                                                        00014040
                                                                        00014050
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00014060
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00014070
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00014080
                                                                        00014090
         IF TT_EGEN > 39 THEN                                           00014100
            TT_EGEN = 40;                                               00014110
                                                                        00014120
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00014130
                                                                        00014140
         IF B02.UFØRPENS.PÅ(BER_SØ_IND) > B02.TT_ANV(BER_SØ_IND) THEN   00014150
            B02.TT_ANV(BER_SØ_IND) = B02.UFØRPENS.PÅ(BER_SØ_IND);       00014160
                                                                        00014170
                                                                        00014180
                                                                        00014190
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00014200
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00014210
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00014220
                                                                        00014230
         IF TT_EK > 39 THEN                                             00014240
            TT_EK = 40;                                                 00014250
                                                                        00014260
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00014270
                                                                        00014280
                                                                        00014290
         IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) &           00014300
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00014310
            DO;                                                         00014320
                                                                        00014330
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00014340
         W_GP = W_GP * G;                                               00014350
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00014360
         W_GP = W_GP / 40;                                              00014370
         W_GP = W_GP / 12;                                              00014380
         W_GP = W_GP / 100;                                             00014390
         W_GP = W_GP * UFGRAD;                                          00014400
         W_GP = W_GP + 0.5;                                             00014410
                                                                        00014420
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00014430
                                                                        00014440
                                                                        00014450
         GO TO L999;                                                    00014460
                                                                        00014470
           END;                                                         00014480
                                                                        00014490
                                                                        00014500
         IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) &           00014510
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00014520
            DO;                                                         00014530
                                                                        00014540
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00014550
         W_GP = W_GP * G;                                               00014560
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00014570
         W_GP = W_GP / 40;                                              00014580
         W_GP = W_GP / 12;                                              00014590
         W_GP = W_GP / 100;                                             00014600
         W_GP = W_GP * UFGRAD;                                          00014610
         W_GP = W_GP + 0.5;                                             00014620
                                                                        00014630
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00014640
                                                                        00014650
                                                                        00014660
         GO TO L999;                                                    00014670
                                                                        00014680
           END;                                                         00014690
                                                                        00014700
       END;                                                             00014710
                                                                        00014720
    END;                                                                00014730
                                                                        00014740
                                                                        00014750
 /* ************************************************************** */   00014760
 /* ALTERNATIV 4 B:                                                */   00014770
 /* ---------------                                                */   00014780
 /* ************************************************************** */   00014790
                                                                        00014800
                                                                        00014810
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00014820
     DO;                                                                00014830
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00014840
          B02.BOSATT(BER_EK_IND) > 0 &                                  00014850
          B02.STATUS.TT_FØR_1967(BER_SØ_IND) > 0 &                      00014860
          B02.STATUS.TT_FØR_1967(BER_EK_IND) > 0 &                      00014870
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00014880
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = ' ' THEN                   00014890
                                                                        00014900
        DO;                                                             00014910
                                                                        00014920
                                                                        00014930
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00014940
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00014950
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00014960
                                                                        00014970
         IF TT_EGEN > 39 THEN                                           00014980
            TT_EGEN = 40;                                               00014990
                                                                        00015000
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00015010
                                                                        00015020
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00015030
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00015040
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00015050
                                                                        00015060
         IF TT_EK > 39 THEN                                             00015070
            TT_EK = 40;                                                 00015080
                                                                        00015090
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00015100
                                                                        00015110
         IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) &           00015120
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00015130
            DO;                                                         00015140
                                                                        00015150
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00015160
         W_GP = W_GP * G;                                               00015170
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00015180
         W_GP = W_GP / 40;                                              00015190
         W_GP = W_GP / 12;                                              00015200
         W_GP = W_GP / 100;                                             00015210
         W_GP = W_GP * UFGRAD;                                          00015220
         W_GP = W_GP + 0.5;                                             00015230
                                                                        00015240
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00015250
                                                                        00015260
                                                                        00015270
         GO TO L999;                                                    00015280
                                                                        00015290
           END;                                                         00015300
                                                                        00015310
         IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) &           00015320
            B02.PENSJONSTYPE1 (BER_EK_IND) ^= 'A' THEN                  00015330
            DO;                                                         00015340
                                                                        00015350
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00015360
         W_GP = W_GP * G;                                               00015370
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00015380
         W_GP = W_GP / 40;                                              00015390
         W_GP = W_GP / 12;                                              00015400
         W_GP = W_GP / 100;                                             00015410
         W_GP = W_GP * UFGRAD;                                          00015420
         W_GP = W_GP + 0.5;                                             00015430
                                                                        00015440
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00015450
                                                                        00015460
                                                                        00015470
         GO TO L999;                                                    00015480
                                                                        00015490
           END;                                                         00015500
                                                                        00015510
       END;                                                             00015520
                                                                        00015530
   END;                                                                 00015540
                                                                        00015550
                                                                        00015560
 /* ************************************************************** */   00015570
 /* ALTERNATIV 5:                                                  */   00015580
 /* -------------                                                  */   00015590
 /* ************************************************************** */   00015600
                                                                        00015610
                                                                        00015620
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00015630
     DO;                                                                00015640
                                                                        00015650
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00015660
          B02.BOSATT(BER_EK_IND) > 0 &                                  00015670
          B02.STATUS.TT_FØR_1967(BER_SØ_IND) > 0 &                      00015680
          B02.STATUS.TT_FØR_1967(BER_EK_IND) > 0 &                      00015690
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' THEN                         00015700
                                                                        00015710
        DO;                                                             00015720
                                                                        00015730
                                                                        00015740
         TT_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                        00015750
                   ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00015760
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00015770
                                                                        00015780
         IF TT_EGEN > 39 THEN                                           00015790
            TT_EGEN = 40;                                               00015800
                                                                        00015810
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00015820
                                                                        00015830
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00015840
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00015850
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00015860
                                                                        00015870
         IF TT_EK > 39 THEN                                             00015880
            TT_EK = 40;                                                 00015890
                                                                        00015900
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00015910
                                                                        00015920
         IF B02.TT_ANV(BER_SØ_IND) <                                    00015930
            B02.TT_ANV(BER_EK_IND) THEN                                 00015940
            B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            00015950
                                                                        00015960
                                                                        00015970
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00015980
         W_GP = W_GP * G;                                               00015990
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00016000
         W_GP = W_GP / 40;                                              00016010
         W_GP = W_GP / 12;                                              00016020
         W_GP = W_GP / 100;                                             00016030
         W_GP = W_GP * UFGRAD;                                          00016040
         W_GP = W_GP + 0.5;                                             00016050
                                                                        00016060
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00016070
                                                                        00016080
                                                                        00016090
         GO TO L999;                                                    00016100
                                                                        00016110
      END;                                                              00016120
                                                                        00016130
    END;                                                                00016140
                                                                        00016150
                                                                        00016160
 /* ************************************************************** */   00016170
 /* ALTERNATIV 6:                                                  */   00016180
 /* -------------                                                  */   00016190
 /* ************************************************************** */   00016200
                                                                        00016210
                                                                        00016220
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00016230
     DO;                                                                00016240
                                                                        00016250
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00016260
          B02.BOSATT(BER_EK_IND) > 0 &                                  00016270
          B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                      00016280
          B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 &                      00016290
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' THEN                         00016300
                                                                        00016310
        DO;                                                             00016320
                                                                        00016330
                                                                        00016340
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00016350
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) +            00016360
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00016370
                                                                        00016380
         IF TT_EGEN > 39 THEN                                           00016390
            TT_EGEN = 40;                                               00016400
                                                                        00016410
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00016420
                                                                        00016430
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00016440
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00016450
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00016460
                                                                        00016470
         IF TT_EK > 39 THEN                                             00016480
            TT_EK = 40;                                                 00016490
                                                                        00016500
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00016510
                                                                        00016520
         IF B02.TT_ANV(BER_SØ_IND) <                                    00016530
            B02.TT_ANV(BER_EK_IND) THEN                                 00016540
            B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            00016550
                                                                        00016560
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00016570
         W_GP = W_GP * G;                                               00016580
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00016590
         W_GP = W_GP / 40;                                              00016600
         W_GP = W_GP / 12;                                              00016610
         W_GP = W_GP / 100;                                             00016620
         W_GP = W_GP * UFGRAD;                                          00016630
         W_GP = W_GP + 0.5;                                             00016640
                                                                        00016650
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00016660
                                                                        00016670
                                                                        00016680
         GO TO L999;                                                    00016690
                                                                        00016700
       END;                                                             00016710
                                                                        00016720
    END;                                                                00016730
                                                                        00016740
                                                                        00016750
 /* ************************************************************** */   00016760
 /* ALTERNATIV 1 B:                                                */   00016770
 /* ---------------                                                */   00016780
 /* ************************************************************** */   00016790
                                                                        00016800
                                                                        00016810
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00016820
     DO;                                                                00016830
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00016840
          B02.BOSATT(BER_EK_IND) > 0 &                                  00016850
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                      00016860
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00016870
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00016880
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00016890
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) >= 20   THEN            00016900
                                                                        00016910
        DO;                                                             00016920
                                                                        00016930
                                                                        00016940
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00016950
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) +            00016960
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00016970
                                                                        00016980
         IF TT_EGEN > 39 THEN                                           00016990
            TT_EGEN = 40;                                               00017000
                                                                        00017010
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00017020
                                                                        00017030
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00017040
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00017050
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00017060
                                                                        00017070
         IF TT_EK > 39 THEN                                             00017080
            TT_EK = 40;                                                 00017090
                                                                        00017100
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00017110
                                                                        00017120
         IF B02.TT_ANV(BER_SØ_IND) <                                    00017130
            B02.TT_ANV(BER_EK_IND) THEN                                 00017140
            B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            00017150
                                                                        00017160
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00017170
         W_GP = W_GP * G;                                               00017180
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00017190
         W_GP = W_GP / 40;                                              00017200
         W_GP = W_GP / 12;                                              00017210
         W_GP = W_GP / 100;                                             00017220
         W_GP = W_GP * UFGRAD;                                          00017230
         W_GP = W_GP + 0.5;                                             00017240
                                                                        00017250
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00017260
                                                                        00017270
                                                                        00017280
         GO TO L999;                                                    00017290
                                                                        00017300
       END;                                                             00017310
                                                                        00017320
                                                                        00017330
    END;                                                                00017340
                                                                        00017350
                                                                        00017360
 /* ************************************************************** */   00017370
 /* ALTERNATIV 2 B:                                                */   00017380
 /* ---------------                                                */   00017390
 /* ************************************************************** */   00017400
                                                                        00017410
                                                                        00017420
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00017430
     DO;                                                                00017440
                                                                        00017450
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00017460
          B02.BOSATT(BER_EK_IND) > 0 &                                  00017470
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                      00017480
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00017490
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00017500
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00017510
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) >= 20   THEN            00017520
                                                                        00017530
        DO;                                                             00017540
                                                                        00017550
                                                                        00017560
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00017570
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) +            00017580
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00017590
                                                                        00017600
         IF TT_EGEN > 39 THEN                                           00017610
            TT_EGEN = 40;                                               00017620
                                                                        00017630
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00017640
                                                                        00017650
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00017660
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00017670
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00017680
                                                                        00017690
         IF TT_EK > 39 THEN                                             00017700
            TT_EK = 40;                                                 00017710
                                                                        00017720
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00017730
                                                                        00017740
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00017750
         W_GP = W_GP * G;                                               00017760
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00017770
         W_GP = W_GP / 40;                                              00017780
         W_GP = W_GP / 12;                                              00017790
         W_GP = W_GP / 100;                                             00017800
         W_GP = W_GP * UFGRAD;                                          00017810
         W_GP = W_GP + 0.5;                                             00017820
                                                                        00017830
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00017840
                                                                        00017850
                                                                        00017860
         GO TO L999;                                                    00017870
                                                                        00017880
       END;                                                             00017890
                                                                        00017900
    END;                                                                00017910
                                                                        00017920
                                                                        00017930
 /* ************************************************************** */   00017940
 /* ALTERNATIV 3 B:                                                */   00017950
 /* ---------------                                                */   00017960
 /* ************************************************************** */   00017970
                                                                        00017980
                                                                        00017990
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00018000
     DO;                                                                00018010
                                                                        00018020
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00018030
          B02.BOSATT(BER_EK_IND) > 0 &                                  00018040
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                      00018050
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00018060
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00018070
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00018080
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) =                       00018090
          B02.UFØRPENS.PÅ(BER_SØ_IND) THEN                              00018100
                                                                        00018110
        DO;                                                             00018120
                                                                        00018130
                                                                        00018140
         TT_EGEN = B02.UFØRPENS.PÅ(BER_SØ_IND);                         00018150
                                                                        00018160
         IF TT_EGEN > 39 THEN                                           00018170
            TT_EGEN = 40;                                               00018180
                                                                        00018190
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00018200
                                                                        00018210
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00018220
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00018230
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00018240
                                                                        00018250
         IF TT_EK > 39 THEN                                             00018260
            TT_EK = 40;                                                 00018270
                                                                        00018280
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00018290
                                                                        00018300
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00018310
         W_GP = W_GP * G;                                               00018320
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00018330
         W_GP = W_GP / 40;                                              00018340
         W_GP = W_GP / 12;                                              00018350
         W_GP = W_GP / 100;                                             00018360
         W_GP = W_GP * UFGRAD;                                          00018370
         W_GP = W_GP + 0.5;                                             00018380
                                                                        00018390
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00018400
                                                                        00018410
                                                                        00018420
         GO TO L999;                                                    00018430
                                                                        00018440
       END;                                                             00018450
                                                                        00018460
                                                                        00018470
    END;                                                                00018480
                                                                        00018490
                                                                        00018500
 /* ************************************************************** */   00018510
 /* ALTERNATIV 4 B PUNKT A:                                        */   00018520
 /* -----------------------                                        */   00018530
 /* ************************************************************** */   00018540
                                                                        00018550
                                                                        00018560
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00018570
     DO;                                                                00018580
                                                                        00018590
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00018600
          B02.BOSATT(BER_EK_IND) > 0 &                                  00018610
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) = 'J' &                      00018620
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00018630
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00018640
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00018650
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) < 10  &                 00018660
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00018670
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00018680
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) >                       00018690
          B02.UFØRPENS.PÅ(BER_SØ_IND) THEN                              00018700
                                                                        00018710
        DO;                                                             00018720
                                                                        00018730
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00018740
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) +            00018750
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00018760
                                                                        00018770
                                                                        00018780
         IF TT_EGEN > 39 THEN                                           00018790
            TT_EGEN = 40;                                               00018800
                                                                        00018810
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00018820
                                                                        00018830
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00018840
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00018850
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00018860
                                                                        00018870
         IF TT_EK > 39 THEN                                             00018880
            TT_EK = 40;                                                 00018890
                                                                        00018900
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00018910
                                                                        00018920
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00018930
         W_GP = W_GP * G;                                               00018940
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00018950
         W_GP = W_GP / 40;                                              00018960
         W_GP = W_GP / 12;                                              00018970
         W_GP = W_GP / 100;                                             00018980
         W_GP = W_GP * UFGRAD;                                          00018990
         W_GP = W_GP + 0.5;                                             00019000
                                                                        00019010
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00019020
                                                                        00019030
                                                                        00019040
         GO TO L999;                                                    00019050
                                                                        00019060
       END;                                                             00019070
                                                                        00019080
                                                                        00019090
    END;                                                                00019100
                                                                        00019110
                                                                        00019120
 /* ************************************************************** */   00019130
 /* ALTERNATIV 4 B PUNKT B:                                        */   00019140
 /* -----------------------                                        */   00019150
 /* ************************************************************** */   00019160
                                                                        00019170
                                                                        00019180
   IF B02.STATUS.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                   00019190
     DO;                                                                00019200
                                                                        00019210
       IF B02.BOSATT(BER_SØ_IND) > 0 &                                  00019220
          B02.BOSATT(BER_EK_IND) > 0 &                                  00019230
          B02.UFØR_UNDER_BOTID(BER_SØ_IND) ^= 'J' &                     00019240
          B02.FRAVIK_8_1(BER_SØ_IND) = 'J' &                            00019250
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00019260
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00019270
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) < 10  &                 00019280
          (B02.TT_FØR_1967(BER_SØ_IND) +                                00019290
          ((B02.TT_ETTER_1966(BER_SØ_IND) +                             00019300
          B02.TT_FRAMT(BER_SØ_IND) + 11) / 12)) >                       00019310
          B02.UFØRPENS.PÅ(BER_SØ_IND) THEN                              00019320
                                                                        00019330
       DO;                                                              00019340
                                                                        00019350
         TT_EGEN = ((B02.TT_ETTER_1966(BER_SØ_IND) +                    00019360
                   B02.TT_FRAMT_VED_FRAVIK_8_1(BER_SØ_IND) +            00019370
                   B02.TT_FRAMT_UFT(BER_SØ_IND) + 11) / 12);            00019380
                                                                        00019390
                                                                        00019400
         IF TT_EGEN > 39 THEN                                           00019410
            TT_EGEN = 40;                                               00019420
                                                                        00019430
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                              00019440
                                                                        00019450
         TT_EK = B02.TT_FØR_1967(BER_EK_IND) +                          00019460
                 ((B02.TT_ETTER_1966(BER_EK_IND) +                      00019470
                 B02.TT_FRAMT_UFT(BER_EK_IND) + 11) / 12);              00019480
                                                                        00019490
         IF TT_EK > 39 THEN                                             00019500
            TT_EK = 40;                                                 00019510
                                                                        00019520
         B02.TT_ANV(BER_EK_IND) = TT_EK;                                00019530
                                                                        00019540
         W_GP = 1 - (0.25 * FAKTOR / 100);                              00019550
         W_GP = W_GP * G;                                               00019560
         W_GP = W_GP * B02.TT_ANV(BER_SØ_IND);                          00019570
         W_GP = W_GP / 40;                                              00019580
         W_GP = W_GP / 12;                                              00019590
         W_GP = W_GP / 100;                                             00019600
         W_GP = W_GP * UFGRAD;                                          00019610
         W_GP = W_GP + 0.5;                                             00019620
                                                                        00019630
         B02.UFØRPENS.GP(BER_SØ_IND) = W_GP;                            00019640
                                                                        00019650
                                                                        00019660
         GO TO L999;                                                    00019670
                                                                        00019680
                                                                        00019690
      END;                                                              00019700
                                                                        00019710
    END;                                                                00019720
                                                                        00019730
 L999:                                                                  00019740
                                                                        00019750
 /* ************************************************************** */   00019760
 /* JEG TROR ALTERNATIVENE 5 OG 6 DEKKES OPP FORAN (?).            */   00019770
 /* HELE PROGRAMMET REORGANISERT 21.2.1990.                        */   00019780
 /*                                                                */   00019790
 /* ERIK, 22.2.1990.                                               */   00019800
 /* ----------------                                               */   00019810
 /* ************************************************************** */   00019820
                                                                        00019830
 END BEREGN_GP_UP_UTLAND;                                               00019840
