 /*       SIST ENDRET 22/09-98 09.22.56 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/09-98 09.20.23 AV   JDA7339                  */00000010
 /*       SIST ENDRET 21/08-98 08.23.39 AV   JDA7339                  */00000020
 /*       SIST ENDRET 20/08-98 15.05.10 AV   MHA7339                  */00000030
 /*       SIST ENDRET 29/08-97 12.27.51 AV   JDA7339                  */00000040
 /*       SIST ENDRET 28/08-97 10.09.15 AV   SPA7339                  */00000050
 /*       SIST ENDRET 15/05-97 08.24.02 AV   JDA7339                  */00000060
 /*       SIST ENDRET 10/10-91 13.56.55 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 06/03-91 11.49.25 AV   DYBVIK                   */00000080
 /* ***************************************************************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /*    R001N803 - UNDERPROGRAM I PLI                                  */00000110
 /*    PROGRAMMERER:                                                  */00000120
 /* ***************************************************************** */00000130
 /*HENSIKT:                                                           */00000140
 /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR EP_SØKER               */00000150
 /*    FRA ETTERLATTPENSJONSGRUNNBLANKETTEN.NY VERSJON                */00000160
 /*PROGRAMTILKNYTNING:                                                */00000170
 /*    INCLUDES I  R001N801 - ETTERLATTEPENSJON                       */00000180
 /*BRUK:                                                              */00000190
 /*    CALL KONTROLL_E3_SØKER(FEIL_I_EP_SØKER);                       /*00000200
 ***************************************************************** */   00000210
 %PAGE;                                /*   */                          00000220
 /* ***************************************************************** */00000230
 /*                                                                   */00000240
 /*   MODULEN KONTROLLERER EP_SØKER, OG RETURNERER                    */00000250
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 %SKIP(2);                                                              00000290
 KONTROLL_E3_SØKER:                                                     00000300
   PROC (FEIL_FUNNET);                                                  00000310
   DCL                                                                  00000320
      FEIL_FUNNET BIT (1);                                              00000330
 %SKIP;                                                                 00000340
   DCL                                                                  00000350
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000360
      KEY_PEKER                  POINTER,                               00000370
      TK_RECL                    CHAR (101);                            00000380
   DCL                                                                  00000390
      ALDER FIXED DEC (5),                                              00000400
      IÅR   FIXED BIN (15),                                             00000410
      TELL  FIXED BIN (15),                                             00000420
      DAGENS_DATO_ÅMD PIC '999999',                                     00000430
      DAGENS_DATO_ÅM DEF DAGENS_DATO_ÅMD PIC '9999',                    00000440
      DAGENS_DATO_Å  DEF DAGENS_DATO_ÅMD PIC '99';                      00000450
 %PAGE;                                /*   */                          00000460
 /*  HJELPE DCL FOR Å SNU DATO           */                             00000470
 %SKIP(1);                                                              00000480
   DCL                                                                  00000490
      HJ_VIRK_DATO_ÅM PIC '9999',                                       00000500
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00000510
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99',                  00000520
      HJ_FRAMLEGGSDATO_ÅM                    PIC '9999',                00000530
      FRAMLEGGSDATO_Å DEF HJ_FRAMLEGGSDATO_ÅM POS(1) PIC '99',          00000540
      FRAMLEGGSDATO_M DEF HJ_FRAMLEGGSDATO_ÅM POS(3) PIC '99',          00000550
      HJ_DØDSDATO_ÅMD                       PIC '999999',               00000560
      DØDSDATO_Å DEF HJ_DØDSDATO_ÅMD POS(1) PIC '99',                   00000570
      DØDSDATO_M DEF HJ_DØDSDATO_ÅMD POS(3) PIC '99',                   00000580
      DØDSDATO_D DEF HJ_DØDSDATO_ÅMD POS(5) PIC '99',                   00000590
      DØDSDATO_ÅM DEF HJ_DØDSDATO_ÅMD       PIC '9999';                 00000600
 %SKIP;                                                                 00000610
   DCL                                                                  00000620
      HJ_VIRK_DATO_MÅ PIC '9999',                                       00000630
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00000640
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99',               00000650
      HJ_FRAMLEGGSDATO_MÅ PIC '9999',                                   00000660
      HJ_FRAMLEGGSDATO_M DEF HJ_FRAMLEGGSDATO_MÅ POS(1) PIC '99',       00000670
      HJ_FRAMLEGGSDATO_Å DEF HJ_FRAMLEGGSDATO_MÅ POS(3) PIC '99',       00000680
      HJ_DØDSDATO_DMÅ PIC '999999',                                     00000690
      HJ_DØDSDATO_D DEF HJ_DØDSDATO_DMÅ POS(1) PIC '99',                00000700
      HJ_DØDSDATO_M DEF HJ_DØDSDATO_DMÅ POS(3) PIC '99',                00000710
      HJ_DØDSDATO_Å DEF HJ_DØDSDATO_DMÅ POS(5) PIC '99',                00000720
      SEKSTISEKS_ÅR                            PIC '99999',             00000730
      HJ_FNR                                   PIC '(11)9',             00000740
      HJ_FNR_MND    DEF HJ_FNR          POS(3) PIC '99',                00000750
      HJ_FNR_ÅR     DEF HJ_FNR          POS(5) PIC '99',                00000760
      HJ_FNR_PNR    DEF HJ_FNR          POS(7) PIC '999';               00000770
    DCL TT_FRA1937ÅM                             PIC '9999';            00000780
    DCL TT_FRA1937_ÅR   DEF TT_FRA1937ÅM  POS(1) PIC '99',              00000790
        TT_FRA1937_MND  DEF TT_FRA1937ÅM  POS(3) PIC '99';              00000800
    DCL                                                                 00000810
      1 FNR_REG,                                                        00000820
        2 FNR1 FIXED DEC(11),                                           00000830
        2 FNR2 FIXED DEC(11),                                           00000840
        2 BRUKERID CHAR (4);                                            00000850
                                                                        00000860
    DCL TEKST CHAR(4);                                                  00000870
 %PAGE;                                                                 00000880
                                                                        00000890
                                                                        00000900
 /*LOVENDRING MED VIRKNING FRA 1.1.91 SP : */                           00000910
      DIV_PARAM_OMR.REGN_1291 = ' ';                                    00000920
                                                                        00000930
      FNR_REG.BRUKERID = DIV_PARAM_OMR.CICS_IND;                        00000940
      FNR_REG.FNR2     = 0;                                             00000950
      FEIL_FUNNET      = '0'B;                                          00000960
      KEY_PEKER        = ADDR(E3S.TKNR);                                00000970
      ANT_FEIL_SKREVET = 0;                                             00000980
      DAGENS_DATO_ÅMD  = DATE ();                                       00000990
      IF ^F_NUMERISK(F_FELT_PIC_CHAR11(E3S.FNR)) THEN                   00001000
         DO;                                                            00001010
            FEIL_FUNNET = '1'B;                                         00001020
            E3S.FNRNR   = 200;                                          00001030
         END;                                                           00001040
      ELSE                                                              00001050
      IF ^F_GYLDIG_FNR(E3S.FNR) THEN                                    00001060
         DO;                                                            00001070
            FEIL_FUNNET = '1'B;                                         00001080
            E3S.FNRNR   = 1;                                            00001090
         END;                                                           00001100
      ELSE                                                              00001110
         DO;                                                            00001120
            FNR_REG.FNR1 = E3S.FNR;                                     00001130
            EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);       00001140
            IF FNR_REG.FNR2 > 0 THEN                                    00001150
               DO;                                                      00001160
                  E3S.FNRNR = 203;                                      00001170
                  E3S.FNR_GML = E3S.FNR;                                00001180
                  E3S.FNR = FNR_REG.FNR2;                               00001190
               END;                                                     00001200
         END;                                                           00001210
      IF E3S.NAVN = (25)' ' THEN                                        00001220
         DO;                                                            00001230
            FEIL_FUNNET = '1'B;                                         00001240
            E3S.NAVNNR = 2;                                             00001250
         END;                                                           00001260
      IF VERIFY(E3S.SPRÅK,'NB ') ^= 0 THEN                              00001270
         DO;                                                            00001280
            FEIL_FUNNET = '1'B;                                         00001290
            E3S.SPRÅKNR = 6;                                            00001300
         END;                                                           00001310
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E3S.TKNR)) THEN                  00001320
         DO;                                                            00001330
            FEIL_FUNNET = '1'B;                                         00001340
            E3S.TKNRNR = 200;                                           00001350
         END;                                                           00001360
      ELSE                                                              00001370
         DO;                                                            00001380
               EXEC CICS HANDLE CONDITION NOTFND(NOTFND);               00001390
               EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)       00001400
                                                  INTO(TK_RECL);        00001410
               GOTO TKNR_UT;                                            00001420
           NOTFND:                                                      00001430
               FEIL_FUNNET = '1'B;                                      00001440
               E3S.TKNRNR  = 3;                                         00001450
               LEAVE;                                                   00001460
           TKNR_UT:                                                     00001470
         END;                                                           00001480
 /*YS*/IF VERIFY(E3S.SIVILSTAND,'SEU') ^= 0 THEN                        00001490
         DO;                                                            00001500
            FEIL_FUNNET = '1'B;                                         00001510
            E3S.SIVILSTANDNR = 496;                                     00001520
         END;                                                           00001530
      IF VERIFY(E3S.NORSK_BOSATT,'JN') ^= 0 THEN                        00001540
         DO;                                                            00001550
            FEIL_FUNNET = '1'B;                                         00001560
            E3S.NORSK_BOSATTNR = 8;                                     00001570
         END;                                                           00001580
      IF ^ (E3S.VILKÅR_10_5 = 'J' ! E3S.VILKÅR_10_5 = 'N') THEN         00001590
         DO;                                                            00001600
            FEIL_FUNNET = '1'B;                                         00001610
            E3S.VILKÅR_10_5NR = 66;                                     00001620
         END;                                                           00001630
      IF ^ (E3S.OMSORG_AVD_BA = 'J' ! E3S.OMSORG_AVD_BA = 'N') THEN     00001640
         DO;                                                            00001650
            FEIL_FUNNET = '1'B;                                         00001660
            E3S.OMSORG_AVD_BANR = 65;                                   00001670
         END;                                                           00001680
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E3S.FORVENTET)) THEN             00001690
         DO;                                                            00001700
            FEIL_FUNNET = '1'B;                                         00001710
            E3S.FORVENTETNR = 200;                                      00001720
         END;                                                           00001730
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E3S.FAI)) THEN                   00001740
         DO;                                                            00001750
            FEIL_FUNNET = '1'B;                                         00001760
            E3S.FAINR = 200;                                            00001770
         END;                                                           00001780
 /*YS*/IF VERIFY(E3S.YSKADE_TILLEGG,'J ') > 0 THEN                      00001790
 /*YS*/  DO;                                                            00001800
 /*YS*/     FEIL_FUNNET = '1'B;                                         00001810
 /*YS*/     E3S.YSKADE_TILLEGGNR = 300;                                 00001820
 /*YS*/  END;                                                           00001830
      IF VERIFY(E3S.GP_OS_KODE,'OP') > 0 THEN                           00001840
         DO;                                                            00001850
            FEIL_FUNNET = '1'B;                                         00001860
            E3S.GP_OS_KODENR = 68;                                      00001870
         END;                                                           00001880
                                                                        00001890
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E3S.FRAMLEGGSDATO_MÅ)) THEN      00001900
         DO;                                                            00001910
            FEIL_FUNNET = '1'B;                                         00001920
            E3S.FRAMLEGGSDATO_MÅNR = 200;                               00001930
         END;                                                           00001940
      ELSE                                                              00001950
      IF F_FELT_PIC_CHAR4(E3S.FRAMLEGGSDATO_MÅ) ^= '0000' THEN          00001960
         IF ^ F_GYLDIG_DATO(E3S.FRAMLEGGSDATO_MÅ) THEN                  00001970
            DO;                                                         00001980
               FEIL_FUNNET = '1'B;                                      00001990
               E3S.FRAMLEGGSDATO_MÅNR = 71;                             00002000
            END;                                                        00002010
      IF VERIFY(E3S.FRAMLEGGSKODE,' OA') > 0 THEN                       00002020
         DO;                                                            00002030
            FEIL_FUNNET = '1'B;                                         00002040
            E3S.FRAMLEGGSKODENR = 73;                                   00002050
         END;                                                           00002060
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E3S.VIRK_DATO_MÅ)) THEN          00002070
         DO;                                                            00002080
            FEIL_FUNNET = '1'B;                                         00002090
            E3S.VIRK_DATO_MÅNR = 200;                                   00002100
         END;                                                           00002110
      ELSE                                                              00002120
         IF ^ F_GYLDIG_DATO(E3S.VIRK_DATO_MÅ) THEN                      00002130
            DO;                                                         00002140
               FEIL_FUNNET = '1'B;                                      00002150
               E3S.VIRK_DATO_MÅNR = 9;                                  00002160
            END;                                                        00002170
                                                                        00002180
 /* ***************************************************** */            00002190
 /* NY PARAGRAF 10-6 FRA 1.1.89.  YTELSEN SKAL ALLTID GIS */            00002200
 /* MED 55 PROSENT TILLEGGSPENSJON.  ERIK/HL 11.4.89      */            00002210
 /* ***************************************************** */            00002220
                                                                        00002230
       HJ_DØDSDATO_DMÅ = E3S.DØDSDATO_EK;                               00002240
                                                                        00002250
                                                                        00002260
      /* ENDRET 15/2-84 AV KARIN - UOPPGITT AVDØD EKTEFELLE */          00002270
      IF ^F_NUMERISK(F_FELT_PIC_CHAR11(E3S.FNR_EK)) THEN                00002280
         DO;                                                            00002290
            FEIL_FUNNET = '1'B;                                         00002300
            E3S.FNR_EKNR = 200;                                         00002310
         END;                                                           00002320
      ELSE                                                              00002330
         DO;                                                            00002340
            IF E3S.FNR_EK > 0  THEN                                     00002350
               DO;                                                      00002360
                 /*** AVDØDES FNR ER UTFYLT  ***/                       00002370
                 IF E3S.FNR_EK ^= 11111111111 THEN                      00002380
                    DO;                                                 00002390
                      /*** AVDØDES FNR ER ET VANLIG FNR ***/            00002400
                      IF ^F_GYLDIG_FNR(E3S.FNR_EK) THEN                 00002410
                         DO;                                            00002420
                            FEIL_FUNNET = '1'B;                         00002430
                            E3S.FNR_EKNR = 15;                          00002440
                         END;                                           00002450
                      ELSE                                              00002460
                         DO;                                            00002470
                            /*** AVD-FNR ER ET GYLDIG FNR ***/          00002480
                            FNR_REG.FNR1 = E3S.FNR_EK;                  00002490
                            EXEC CICS LINK PROGRAM('R0019906')          00002500
                            COMMAREA(FNR_REG);                          00002510
                            IF FNR_REG.FNR2 > 0 THEN                    00002520
                               DO;                                      00002530
                                  /* FNR ER ENDRET */                   00002540
                                  E3S.FNR_EKNR = 203;                   00002550
                                  E3S.FNR_GML_EK = E3S.FNR_EK;          00002560
                                  E3S.FNR_EK = FNR_REG.FNR2;            00002570
                               END;                                     00002580
                         END;   /* END GYLDIG FNR */                    00002590
                      IF ^ F_NUMERISK(F_FELT_PIC_CHAR6                  00002600
                           (E3S.DØDSDATO_EK)) THEN                      00002610
                         DO;                                            00002620
                            FEIL_FUNNET = '1'B;                         00002630
                            E3S.DØDSDATO_EKNR = 200;                    00002640
                         END;                                           00002650
                      ELSE                                              00002660
                         IF E3S.DØDSDATO_EK = 0 THEN                    00002670
                            DO;                                         00002680
                               FEIL_FUNNET = '1'B;                      00002690
                               E3S.DØDSDATO_EKNR = 115;                 00002700
                            END;                                        00002710
                         ELSE                                           00002720
                            IF ^ F_GYLDIG_DATO_DMÅ                      00002730
                                (E3S.DØDSDATO_EK) THEN                  00002740
                               DO;                                      00002750
                                  FEIL_FUNNET = '1'B;                   00002760
                                  E3S.DØDSDATO_EKNR = 75;               00002770
                               END;                                     00002780
                      IF VERIFY(E3S.NORSK_BOSATT_EK,' JN') > 0 THEN     00002790
                         DO;                                            00002800
                            FEIL_FUNNET = '1'B;                         00002810
                            E3S.NORSK_BOSATT_EKNR = 8;                  00002820
                         END;                                           00002830
                      IF ^ (E3S.VILKÅR_8_4_EK = 'J' !                   00002840
                            E3S.VILKÅR_8_4_EK = 'N' !                   00002850
                            E3S.VILKÅR_8_4_EK = ' ') THEN               00002860
                         DO;                                            00002870
                            FEIL_FUNNET = '1'B;                         00002880
                            E3S.VILKÅR_8_4_EKNR = 45;                   00002890
                         END;                                           00002900
                                                                        00002910
                   /* DERSOM VP_ÅR  ER UTFYLT BLIR DISSE NULLSTILLT */  00002920
                                                                        00002930
                      DO J = 1 TO 4 UNTIL                               00002940
                         (F_FELT_PIC_CHAR2(E3S.VP_ÅR_EK(J) = '00'));    00002950
                       IF F_FELT_PIC_CHAR2(E3S.VP_ÅR_EK(J)) = '00' THEN 00002960
                            DO TELL = J TO 4;                           00002970
                               E3S.VP_ÅR_EK(TELL) = 0;                  00002980
                            END;                                        00002990
                      END;                                              00003000
                                                                        00003010
                      DO IÅR = 1 TO 4 WHILE                             00003020
                         (F_FELT_PIC_CHAR2(E3S.VP_ÅR_EK(IÅR)) ^='00');  00003030
                         IF ^ F_NUMERISK(F_FELT_PIC_CHAR2               00003040
                              (E3S.VP_ÅR_EK(IÅR))) THEN                 00003050
                            DO;                                         00003060
                               FEIL_FUNNET = '1'B;                      00003070
                               E3S.VP_ÅR_EKNR(IÅR) = 200;               00003080
                            END;                                        00003090
                         ELSE                                           00003100
                            IF ^(E3S.VP_ÅR_EK(IÅR) > 66                 00003110
                            & E3S.VP_ÅR_EK(IÅR) <= DAGENS_DATO_Å) THEN  00003120
                               DO;                                      00003130
                                  FEIL_FUNNET = '1'B;                   00003140
                                  E3S.VP_ÅR_EKNR(IÅR) = 47;             00003150
                               END;                                     00003160
                      END;      /* DO IÅR = 1 TO 4 */                   00003170
                    END; /* END AVDØDES FNR ER ET VANLIG FNR */         00003180
                 ELSE                                                   00003190
                    DO;  /* AVDØDES FNR = 11111111111, DVS UKJENT   */  00003200
                         /* OG INGEN AV FELTENE TIL AVDØDE SKAL     */  00003210
                         /* VÆRE UTFYLT                             */  00003220
 /*******************************************************************/  00003230
 /* FOR Å AVVISE ALLE YRKESSKADE-DØDE MED FNR. 11111111111, HAR JEG */  00003240
 /* SATT INN TESTEN NEDENFOR.                        ERIK.          */  00003250
 /*******************************************************************/  00003260
                                                                        00003270
  /*YS*/  /*           IF E3S.YSKADE_TILLEGG = 'J'  THEN  */            00003280
  /*YS*/  /*              DO;                             */            00003290
  /*YS*/  /*                 FEIL_FUNNET = '1'B;          */            00003300
  /*YS*/  /*                 E3S.FNR_EKNR         = 321;  */            00003310
  /*YS*/  /*                 E3S.YSKADE_TILLEGGNR = 999;  */            00003320
  /*YS*/  /*              END;                            */            00003330
  /*YS*/  /*           ELSE                               */            00003340
                                                                        00003350
                                                                        00003360
                         IF E3S.NAVN_EK               ^= (25)' ' !      00003370
                            E3S.DØDSDATO_EK           ^= 0 !            00003380
                            E3S.NORSK_BOSATT_EK       ^= ' ' !          00003390
                            E3S.VILKÅR_8_4_EK         ^= ' ' !          00003400
                            E3S.PI_EK                 ^= 0 !            00003410
                            E3S.VP_ÅR_EK(1)           ^= 0 THEN         00003420
                            DO;                                         00003430
                               FEIL_FUNNET = '1'B;                      00003440
                               E3S.FNR_EKNR          = 999;             00003450
                               E3S.NAVN_EKNR         = 999;             00003460
                               E3S.DØDSDATO_EKNR     = 999;             00003470
                               E3S.NORSK_BOSATT_EKNR = 999;             00003480
                               E3S.VILKÅR_8_4_EKNR   = 999;             00003490
                               E3S.PI_EKNR           = 999;             00003500
                               E3S.VP_ÅR_EKNR(1)     = 999;             00003510
                            END;                                        00003520
                    END; /* AVDØDES FNR = 11111111111, DVS UKJENT   */  00003530
               END;      /* AVDØDES FNR ULIK 0, DVS UTFYLT          */  00003540
           ELSE                                                         00003550
               DO;                                                      00003560
                  /* AVDØDES FNR = 0, DVS IKKE UTFYLT */                00003570
                  FEIL_FUNNET = '1'B;                                   00003580
                  E3S.FNR_EKNR = 201;                                   00003590
               END;                                                     00003600
         END;                                                           00003610
                                                                        00003620
               EXEC CICS HANDLE CONDITION NOTFND(NOTFND);               00003630
                                                                        00003640
 /*******************************************************************/  00003650
                                                                        00003660
  /* HER SETTES VERDIER IN I MENY_OMR */                                00003670
      FØDSNUMMER = E3S.FNR;                                             00003680
      VIRKNINGSDATO = E3S.VIRK_DATO_MÅ;                                 00003690
 %SKIP(3);                             /*  */                           00003700
 /*   KRYSS KONTROLLER       */                                         00003710
 %SKIP;                                                                 00003720
      IF ^ FEIL_FUNNET THEN                                             00003730
         DO;                                                            00003740
            HJ_FRAMLEGGSDATO_MÅ = E3S.FRAMLEGGSDATO_MÅ;                 00003750
            FRAMLEGGSDATO_Å     = HJ_FRAMLEGGSDATO_Å;                   00003760
            FRAMLEGGSDATO_M     = HJ_FRAMLEGGSDATO_M;                   00003770
            HJ_VIRK_DATO_MÅ     = E3S.VIRK_DATO_MÅ;                     00003780
            VIRK_DATO_Å         = HJ_VIRK_DATO_Å;                       00003790
            VIRK_DATO_M         = HJ_VIRK_DATO_M;                       00003800
            HJ_DØDSDATO_DMÅ     = E3S.DØDSDATO_EK;                      00003810
            DØDSDATO_D          = HJ_DØDSDATO_D;                        00003820
            DØDSDATO_M          = HJ_DØDSDATO_M;                        00003830
            DØDSDATO_Å          = HJ_DØDSDATO_Å;                        00003840
                                                                        00003850
                                                                        00003860
                                                                        00003870
  /*LOVENDRING MED VIRKNING FRA 1.1.91 SP : */                          00003880
          IF  HJ_VIRK_DATO_ÅM > 9200 &                                  00003890
              HJ_DØDSDATO_ÅMD < 9200    THEN                            00003900
                                                                        00003910
               DIV_PARAM_OMR.REGN_1291 = 'J';                           00003920
                                                                        00003930
                                                                        00003940
                                                                        00003950
            /* DIVERSE TESTER VEDR. RETT TIL PENSJON/OVERGANSST. */     00003960
            IF E3S.GP_OS_KODE  = 'O' !                                  00003970
               E3S.GP_OS_KODE  = 'P' THEN                               00003980
              DO;                                                       00003990
                IF E3S.SIVILSTAND = 'E' THEN                            00004000
                  DO;                                                   00004010
                           IF E3S.OMSORG_AVD_BA = 'J' THEN              00004020
                              DO;                                       00004030
                                 /*** OMSORG = J        ***/            00004040
                                 IF E3S.VILKÅR_10_5 = 'N' THEN          00004050
                                    DO;                                 00004060
                                       FEIL_FUNNET = '1'B;              00004070
                                       E3S.OMSORG_AVD_BANR=255;         00004080
                                       E3S.VILKÅR_10_5NR=999;           00004090
                                    END;                                00004100
                                 ELSE                                   00004110
                                    DO;                                 00004120
                                       /**** VILKÅR 10-5 = J   ***/     00004130
                                       IF E3S.GP_OS_KODE = 'O' THEN     00004140
                                          DO;                           00004150
                                             FEIL_FUNNET = '1'B;        00004160
                                             E3S.SIVILSTANDNR =254;     00004170
                                             E3S.VILKÅR_10_5NR=999;     00004180
                                             E3S.GP_OS_KODENR=999;      00004190
                                          END;                          00004200
                                       /***  END VILKÅR 10-5 = J   ***/ 00004210
                                    END;                                00004220
                                 /*** END OMSORG = J   ***/             00004230
                              END;                                      00004240
                           ELSE                                         00004250
                              DO;                                       00004260
                                 /*** OMSORG = N ***/                   00004270
                                 IF E3S.VILKÅR_10_5 = 'J' THEN          00004280
                                    DO;                                 00004290
                                       /*** VILKÅR 10-5 = J ***/        00004300
                                       IF E3S.GP_OS_KODE = 'O' THEN     00004310
                                          DO;                           00004320
                                             FEIL_FUNNET = '1'B;        00004330
                                             E3S.SIVILSTANDNR =254;     00004340
                                             E3S.VILKÅR_10_5NR=999;     00004350
                                             E3S.GP_OS_KODENR=999;      00004360
                                          END;                          00004370
                                       /*** END VILKÅR 10-5 = J ***/    00004380
                                    END;                                00004390
                                 ELSE                                   00004400
                                    DO;                                 00004410
                                       /*** VILKÅR 10-5 = N ***/        00004420
                                       IF E3S.GP_OS_KODE = 'P' THEN     00004430
                                          DO;                           00004440
                                            /* PENSJON */               00004450
                                            FEIL_FUNNET = '1'B;         00004460
                                            E3S.SIVILSTANDNR =253;      00004470
                                            E3S.VILKÅR_10_5NR=999;      00004480
                                            E3S.GP_OS_KODENR=999;       00004490
                                          END;                          00004500
                                       /*** END VILKÅR 10-5 = N ***/    00004510
                                    END;                                00004520
                                 /*** END OMSORG = N ***/               00004530
                        END;                                            00004540
                     /*** END SIVILSTAND = E ***/                       00004550
                  END;                                                  00004560
                ELSE                                                    00004570
                  DO;                                                   00004580
 /*YS*/              IF E3S.SIVILSTAND = 'S' THEN                       00004590
 /*YS*/                 DO;                                             00004600
                           /*** SIVILSTAND = S ***/                     00004610
                           IF E3S.OMSORG_AVD_BA = 'J' THEN              00004620
                              DO;                                       00004630
                                 /*** OMSORG BARN = J ***/              00004640
                                 IF E3S.VILKÅR_10_5 = 'N' THEN          00004650
                                    DO;                                 00004660
                                       FEIL_FUNNET = '1'B;              00004670
                                       E3S.OMSORG_AVD_BANR =255;        00004680
                                       E3S.VILKÅR_10_5NR=999;           00004690
                                    END;                                00004700
                                 /*** END OMSORG BARN = J ***/          00004710
                              END;                                      00004720
                           ELSE                                         00004730
                              DO;                                       00004740
                                 /*** OMSORG BARN = N ***/              00004750
                                 IF E3S.VILKÅR_10_5 = 'N' THEN          00004760
                                    DO;                                 00004770
                                       IF E3S.GP_OS_KODE = 'P' THEN     00004780
                                          DO;                           00004790
                                             FEIL_FUNNET = '1'B;        00004800
                                             E3S.SIVILSTANDNR=256;      00004810
                                             E3S.VILKÅR_10_5NR=999;     00004820
                                             E3S.GP_OS_KODENR=999;      00004830
                                          END;                          00004840
                                    END;                                00004850
                                 /*** END OMSORG BARN = N ***/          00004860
                              END;                                      00004870
 /*YS*/                 END;                                            00004880
                     /*** END SIVILSTAND = S ***/                       00004890
 /*YS*/              ELSE                                               00004900
 /*YS*/                 /*** SIVILSTAND = U ***/                        00004910
 /*YS*/                 DO;                                             00004920
 /*YS*/                    IF E3S.OMSORG_AVD_BA = 'N' THEN              00004930
 /*YS*/                       DO;                                       00004940
 /*YS*/                           FEIL_FUNNET = '1'B;                   00004950
 /*YS*/                           E3S.SIVILSTANDNR = 322;               00004960
 /*YS*/                           E3S.OMSORG_AVD_BANR = 999;            00004970
 /*YS*/                       END;                                      00004980
 /*YS*/                 END;                                            00004990
 /*YS*/           END;                                                  00005000
              END;   /* GP_OS KODE = O ELLER P */                       00005010
         END;   /* FEIL_FUNNET */                                       00005020
         /**************************/                                   00005030
                                                                        00005040
                                                                        00005050
                                                                        00005060
         IF ^ FEIL_FUNNET THEN                                          00005070
            DO;                                                         00005080
               ALDER = F_ALDER(E3S.FNR,E3S.VIRK_DATO_MÅ);               00005090
               IF ((ALDER > 6612 & VIRK_DATO_Å < 91) !                  00005100
 /*HL*/            (ALDER > 6700 & VIRK_DATO_Å > 90))      &            00005110
                    E3S.FORVENTET > 0                THEN               00005120
                  DO;                                                   00005130
                     FEIL_FUNNET = '1'B;                                00005140
                     E3S.FORVENTETNR = 67;                              00005150
                  END;                                                  00005160
               IF ((ALDER < 6700 ! ALDER > 6912) & E3S.FAI > 0   &      00005170
                    VIRK_DATO_Å < 91 )                     !            00005180
                  ((ALDER < 6701 ! ALDER > 7000) & E3S.FAI > 0   &      00005190
                    VIRK_DATO_Å < 91 )                    THEN          00005200
                  DO;                                                   00005210
                     FEIL_FUNNET = '1'B;                                00005220
                     E3S.FAINR = 117;                                   00005230
                  END;                                                  00005240
               IF E3S.GP_OS_KODE   = 'O' &                              00005250
              (E3S.FRAMLEGGSKODE = ' ' ! E3S.FRAMLEGGSDATO_MÅ = 0) THEN 00005260
                  DO;                                                   00005270
                     FEIL_FUNNET = '1'B;                                00005280
                     E3S.FRAMLEGGSKODENR = 74;                          00005290
                     E3S.FRAMLEGGSDATO_MÅNR = 999;                      00005300
                     E3S.GP_OS_KODENR = 999;                            00005310
                  END;                                                  00005320
               IF E3S.GP_OS_KODE   = 'P' &                              00005330
                  (E3S.FRAMLEGGSKODE ^= ' ' !                           00005340
                   E3S.FRAMLEGGSDATO_MÅ > 0) THEN                       00005350
                  DO;                                                   00005360
                     FEIL_FUNNET = '1'B;                                00005370
                     E3S.FRAMLEGGSKODENR = 263;                         00005380
                     E3S.FRAMLEGGSDATO_MÅNR = 999;                      00005390
                     E3S.GP_OS_KODENR = 999;                            00005400
                  END;                                                  00005410
                                                                        00005420
               IF ^F_40DAGER(HJ_VIRK_DATO_ÅM)    THEN                   00005430
                  DO;                                                   00005440
                     FEIL_FUNNET = '1'B;                                00005450
                     E3S.VIRK_DATO_MÅNR = 10;                           00005460
                  END;                                                  00005470
               IF HJ_VIRK_DATO_ÅM < 9101 THEN                           00005480
                  DO;                                                   00005490
                     FEIL_FUNNET = '1'B;                                00005500
                     E3S.VIRK_DATO_MÅNR = 364;                          00005510
                  END;                                                  00005520
 /*YS*/        IF HJ_VIRK_DATO_ÅM     < 7101   &                        00005530
 /*YS*/           E3S.YSKADE_TILLEGG  = 'J'    THEN                     00005540
 /*YS*/           DO;                                                   00005550
 /*YS*/              FEIL_FUNNET = '1'B;                                00005560
 /*YS*/              E3S.VIRK_DATO_MÅNR   = 310;                        00005570
 /*YS*/              E3S.YSKADE_TILLEGGNR = 999;                        00005580
 /*YS*/           END;                                                  00005590
            END;   /* FEIL_FUNNET */                                    00005600
                                                                        00005610
                                                                        00005620
                                                                        00005630
      IF ^ FEIL_FUNNET & HJ_DØDSDATO_ÅMD > 670000 THEN                  00005640
         DO;                                                            00005650
            IF E3S.FNR_EK = 0 THEN                                      00005660
               DO;                                                      00005670
                                                                        00005680
                                                                        00005690
                  FEIL_FUNNET = '1'B;                                   00005700
                  E3S.FNR_EKNR = 201;                                   00005710
               END;                                                     00005720
            IF E3S.NAVN_EK = (25)' ' THEN                               00005730
               DO;                                                      00005740
                                                                        00005750
                                                                        00005760
                  FEIL_FUNNET = '1'B;                                   00005770
                  E3S.NAVN_EKNR = 201;                                  00005780
               END;                                                     00005790
            IF E3S.NORSK_BOSATT_EK = ' ' THEN                           00005800
               DO;                                                      00005810
                                                                        00005820
                                                                        00005830
                  FEIL_FUNNET = '1'B;                                   00005840
                  E3S.NORSK_BOSATT_EKNR = 201;                          00005850
               END;                                                     00005860
            IF E3S.VILKÅR_8_4_EK = ' ' THEN                             00005870
               DO;                                                      00005880
                  FEIL_FUNNET = '1'B;                                   00005890
                  E3S.VILKÅR_8_4_EKNR = 201;                            00005900
               END;                                                     00005910
         END;                                                           00005920
                                                                        00005930
         IF E3S.NORSK_BOSATT = 'J' THEN                                 00005940
            DO;                                                         00005950
               HJ_FNR      = E3S.FNR;                                   00005960
                                                                        00005970
               IF HJ_FNR_PNR <= 499 THEN                                00005980
                  SEKSTISEKS_ÅR = (HJ_FNR_ÅR + 66) * 100 ;              00005990
               ELSE                                                     00006000
                  SEKSTISEKS_ÅR = ((HJ_FNR_ÅR + 66) - 100)  *           00006010
                                                    100  ;              00006020
               IF SEKSTISEKS_ÅR   >   DØDSDATO_ÅM THEN                  00006030
                  TT_FRA1937ÅM = DØDSDATO_ÅM - ((HJ_FNR_ÅR + 16) * 100) 00006040
                                  + HJ_FNR_MND;                         00006050
               ELSE                                                     00006060
                  TT_FRA1937ÅM  = (SEKSTISEKS_ÅR - 37) * 100;           00006070
                                                                        00006080
               E3SP.TT_FRA_1937ÅR  = TT_FRA1937_ÅR;                     00006090
               E3SP.TT_FRA_1937MND = TT_FRA1937_MND;                    00006100
            END;                                                        00006110
                                                                        00006120
         IF E3S.NORSK_BOSATT_EK = 'J' THEN                              00006130
            DO;                                                         00006140
               HJ_FNR      = E3S.FNR_EK;                                00006150
                                                                        00006160
               IF HJ_FNR_PNR <= 499 THEN                                00006170
                  SEKSTISEKS_ÅR = (HJ_FNR_ÅR + 66) * 100 ;              00006180
               ELSE                                                     00006190
                  SEKSTISEKS_ÅR = ((HJ_FNR_ÅR + 66) - 100) *            00006200
                                                    100 ;               00006210
               IF SEKSTISEKS_ÅR >=  DØDSDATO_ÅM THEN                    00006220
                     TT_FRA1937ÅM  = DØDSDATO_ÅM - ( 37 * 100);         00006230
               ELSE                                                     00006240
                  TT_FRA1937ÅM = DØDSDATO_ÅM - ((HJ_FNR_ÅR + 16) * 100) 00006250
                                  + HJ_FNR_MND;                         00006260
               E3SP.TT_FRA_1937_ÅR_EK  = TT_FRA1937_ÅR;                 00006270
               E3SP.TT_FRA_1937_MND_EK = TT_FRA1937_MND;                00006280
            END;                                                        00006290
                                                                        00006300
                                                                        00006310
 /*******************************************************************/  00006320
 /* ALLE DØDSFALL MED YSKADE_TILLEGG SKAL AVVISES HVIS DØDSDATO ER  */  00006330
 /* FØR 1.1.71.  HUSK F.MELD.NR.  ERIK 19.1.88.                     */  00006340
 /*******************************************************************/  00006350
                                                                        00006360
  /*YS*/      IF ^ FEIL_FUNNET & HJ_DØDSDATO_ÅMD < 710101  &            00006370
  /*YS*/           HJ_DØDSDATO_ÅMD > 0  &                               00006380
  /*YS*/           E3S.FNR_EK  = 11111111111  THEN                      00006390
  /*YS*/               DO;                                              00006400
  /*YS*/                  FEIL_FUNNET          = '1'B;                  00006410
  /*YS*/                  E3S.DØDSDATO_EKNR    = 323;                   00006420
  /*YS*/                  E3S.YSKADE_TILLEGGNR = 999;                   00006430
  /*YS*/               END;                                             00006440
                                                                        00006450
 /*******************************************************************/  00006460
 /* TIL HIT.  ERIK 19.1.88.                                         */  00006470
 /*******************************************************************/  00006480
  /* FJERNET 9708 HL : *********************                            00006490
      IF ^ FEIL_FUNNET & HJ_DØDSDATO_ÅMD < 670000 THEN                  00006500
         DO;                                                            00006510
            IF E3S.FNR_EK > 0 &                                         00006520
               E3S.FNR_EK ^= 11111111111 THEN                           00006530
               DO;                                                      00006540
                  FEIL_FUNNET = '1'B;                                   00006550
                  E3S.FNR_EKNR = 202;                                   00006560
               END;                                                     00006570
            IF E3S.NAVN_EK ^= (25)' ' THEN                              00006580
               DO;                                                      00006590
                  FEIL_FUNNET = '1'B;                                   00006600
                  E3S.NAVN_EKNR = 202;                                  00006610
               END;                                                     00006620
            IF E3S.NORSK_BOSATT_EK ^= ' ' THEN                          00006630
               DO;                                                      00006640
                  FEIL_FUNNET = '1'B;                                   00006650
                  E3S.NORSK_BOSATT_EKNR = 202;                          00006660
               END;                                                     00006670
               IF E3S.VILKÅR_8_4_EK ^= ' ' THEN                         00006680
                  DO;                                                   00006690
                     FEIL_FUNNET = '1'B;                                00006700
                     E3S.VILKÅR_8_4_EKNR = 202;                         00006710
                  END;                                                  00006720
               IF E3S.PI_EK > 0 THEN                                    00006730
                  DO;                                                   00006740
                     FEIL_FUNNET = '1'B;                                00006750
                     E3S.PI_EKNR = 202;                                 00006760
                  END;                                                  00006770
               DO IÅR = 1 TO 4;                                         00006780
                  IF E3S.VP_ÅR_EK(IÅR) > 0 THEN                         00006790
                     DO;                                                00006800
                        FEIL_FUNNET = '1'B;                             00006810
                        E3S.VP_ÅR_EKNR(IÅR) = 202;                      00006820
                     END;                                               00006830
               END;                                                     00006840
         END;                                                           00006850
   ******************************** HIT HL ********************* */     00006860
      IF ^ FEIL_FUNNET  THEN /* & HJ_DØDSDATO_ÅMD > 670000 THEN*/       00006870
         DO;                                                            00006880
   /* FJERNET 9809 *********                                            00006890
            IF E3S.FNR_EK >0 & F_KJØNN(E3S.FNR)=F_KJØNN(E3S.FNR_EK) THEN00006900
               DO;                                                      00006910
                  FEIL_FUNNET = '1'B;                                   00006920
                  E3S.FNRNR = 16;                                       00006930
                  E3S.FNR_EKNR = 999;                                   00006940
               END;                                                     00006950
   ************************** HIT 9809 */                               00006960
            IF E3S.VP_ÅR_EK(1) > 0 &                                    00006970
            E3S.VP_ÅR_EK(1) = E3S.VP_ÅR_EK(2) THEN                      00006980
               DO;                                                      00006990
                  FEIL_FUNNET = '1'B;                                   00007000
                  E3S.VP_ÅR_EKNR(1) = 124;                              00007010
                  E3S.VP_ÅR_EKNR(2) = 999;                              00007020
               END;                                                     00007030
            IF HJ_DØDSDATO_ÅMD >= DAGENS_DATO_ÅMD THEN                  00007040
               DO;                                                      00007050
                  FEIL_FUNNET = '1'B;                                   00007060
                  E3S.DØDSDATO_EKNR = 76;                               00007070
               END;                                                     00007080
            ELSE                                                        00007090
            IF (HJ_VIRK_DATO_ÅM < DØDSDATO_ÅM  &                        00007100
 /*HL*/           DØDSDATO_ÅM < 9100) !                                 00007110
               (HJ_VIRK_DATO_ÅM < DØDSDATO_ÅM + 1   &                   00007120
                  DØDSDATO_ÅM > 9012)                 THEN              00007130
               DO;                                                      00007140
                  FEIL_FUNNET = '1'B;                                   00007150
                  E3S.DØDSDATO_EKNR = 77;                               00007160
                  E3S.VIRK_DATO_MÅNR = 999;                             00007170
               END;                                                     00007180
            IF ^FEIL_FUNNET THEN                                        00007190
               IF F_KJØNN(E3S.FNR_EK) = 'K' THEN                        00007200
                  DO IÅR = 1 TO 4;                                      00007210
                     IF E3S.VP_ÅR_EK(IÅR) > 0 THEN                      00007220
                        DO;                                             00007230
                           FEIL_FUNNET = '1'B;                          00007240
                           E3S.VP_ÅR_EKNR(IÅR) = 47;                    00007250
                           E3S.FNR_EKNR = 999;                          00007260
                        END;                                            00007270
                  END;                                                  00007280
         END;                                                           00007290
                                                                        00007300
                                                                        00007310
                                                                        00007320
 END KONTROLL_E3_SØKER;                                                 00007330
                                                                        00007340
 /*YS*//* ************************************************ */           00007350
 /*YS*//* PROSEDYREN KONTROLLERER OPPLYSNINGENE PÅ         */           00007360
 /*YS*//* YRKESSKADEBILDET.                                */           00007370
 /*YS*//* ************************************************ */           00007380
                                                                        00007390
 /*YS*/KONTROLL_E3_YRKESSKADE:                                          00007400
 /*YS*/   PROC(FEIL_FUNNET);                                            00007410
                                                                        00007420
 /*YS*/ DCL FEIL_FUNNET         BIT (1);                                00007430
                                                                        00007440
 /*YS*/ DCL HJ_DØDSDATO_ÅMD               PIC '999999',                 00007450
 /*YS*/     DØDSDATO_Å DEF HJ_DØDSDATO_ÅMD POS(1) PIC '99',             00007460
 /*YS*/     DØDSDATO_M DEF HJ_DØDSDATO_ÅMD POS(3) PIC '99',             00007470
 /*YS*/     DØDSDATO_D DEF HJ_DØDSDATO_ÅMD POS(5) PIC '99',             00007480
 /*YS*/     DØDSDATO_ÅM DEF HJ_DØDSDATO_ÅMD PIC '9999';                 00007490
                                                                        00007500
 /*YS*/ DCL HJ_DØDSDATO_DMÅ PIC '999999',                               00007510
 /*YS*/     HJ_DØDSDATO_D DEF HJ_DØDSDATO_DMÅ POS(1) PIC '99',          00007520
 /*YS*/     HJ_DØDSDATO_M DEF HJ_DØDSDATO_DMÅ POS(3) PIC '99',          00007530
 /*YS*/     HJ_DØDSDATO_Å DEF HJ_DØDSDATO_DMÅ POS(5) PIC '99';          00007540
                                                                        00007550
 /*YS*/ DCL 1 FNR_REG,                                                  00007560
 /*YS*/       2 FNR1 FIXED DEC(11),                                     00007570
 /*YS*/       2 FNR2 FIXED DEC(11);                                     00007580
                                                                        00007590
 /*YS*/ HJ_DØDSDATO_DMÅ = E3S.DØDSDATO_EK;                              00007600
 /*YS*/ DØDSDATO_Å      = HJ_DØDSDATO_Å;                                00007610
 /*YS*/ DØDSDATO_M      = HJ_DØDSDATO_M;                                00007620
 /*YS*/ DØDSDATO_D      = HJ_DØDSDATO_D;                                00007630
                                                                        00007640
 /*YS*/ ANT_FEIL_SKREVET = 0;                                           00007650
 /*YS   HVIS INGEN FELT I UFØREDELEN ER UTFYLT, SÅ GÅR VI UT FRA */     00007660
 /*YS   AT DET ER DØDSFALL PGA EN GAMMEL YRKESSKADE - DA SKAL    */     00007670
 /*YS   NEMLIG INGEN OPPLYSNINGER ENDRES                         */     00007680
                                                                        00007690
 /*YS*/ IF ^ (                                                          00007700
 /*YS*/     E3Y.VILKÅR_1_2_2A   = ' '         &                         00007710
 /*YS*/     E3Y.VILKÅR_1_2_2B   = ' '         &                         00007720
 /*YS*/     E3Y.YST_MÅ          = 0           &                         00007730
 /*YS*/     E3Y.YSYKDOM         = 'N'         &                         00007740
 /*YS*/     E3Y.YUG             = 0           &                         00007750
 /*YS*/     E3Y.KAP_11_7_UTLØST = ' '         &                         00007760
 /*YS*/     E3Y.YRKE11          = ' '         &                         00007770
 /*YS*/     E3Y.AÅI             = 9999999        )   THEN               00007780
 /*YS                                                                   00007790
 /*YS*/ DO;                                                             00007800
                                                                        00007810
 /*YS*/ IF ^(E3Y.VILKÅR_1_2_2A = 'J' ! E3Y.VILKÅR_1_2_2A = ' ') THEN    00007820
 /*YS*/    DO;                                                          00007830
 /*YS*/       FEIL_FUNNET   ='1'B;                                      00007840
 /*YS*/       E3Y.VILKÅR_1_2_2ANR = 301;                                00007850
 /*YS*/    END;                                                         00007860
 /*YS*/                                                                 00007870
 /*YS*/                                                                 00007880
 /*YS*/ IF ^(E3Y.VILKÅR_1_2_2B = 'J' ! E3Y.VILKÅR_1_2_2B = ' ') THEN    00007890
 /*YS*/    DO;                                                          00007900
 /*YS*/       FEIL_FUNNET   ='1'B;                                      00007910
 /*YS*/       E3Y.VILKÅR_1_2_2BNR = 302;                                00007920
 /*YS*/    END;                                                         00007930
 /*YS*/                                                                 00007940
 /*YS*/ IF ^F_NUMERISK(F_FELT_PIC_CHAR4(E3Y.YST_MÅ)) THEN               00007950
 /*YS*/    DO;                                                          00007960
 /*YS*/       FEIL_FUNNET    = '1'B;                                    00007970
 /*YS*/       E3Y.YST_MÅNR = 200;                                       00007980
 /*YS*/    END;                                                         00007990
 /*YS*/ ELSE                                                            00008000
 /*YS*/    DO;                                                          00008010
 /*YS*/       IF ^F_GYLDIG_DATO(E3Y.YST_MÅ) THEN                        00008020
 /*YS*/          DO;                                                    00008030
 /*YS*/             FEIL_FUNNET    = '1'B;                              00008040
 /*YS*/             E3Y.YST_MÅNR = 304;                                 00008050
 /*YS*/          END;                                                   00008060
 /*YS*/       ELSE                                                      00008070
 /*YS*/          IF F_SNU_DATO(E3Y.YST_MÅ) < 7101 THEN                  00008080
 /*YS*/             DO;                                                 00008090
 /*YS*/                FEIL_FUNNET    = '1'B;                           00008100
 /*YS*/                E3Y.YST_MÅNR = 305;                              00008110
 /*YS*/             END;                                                00008120
 /*YS*/    END;                                                         00008130
 /*YS*/                                                                 00008140
 /*YS*/ IF ^(E3Y.YSYKDOM = 'J' ! E3Y.YSYKDOM = 'N') THEN                00008150
 /*YS*/    DO;                                                          00008160
 /*YS*/       FEIL_FUNNET   ='1'B;                                      00008170
 /*YS*/       E3Y.YSYKDOMNR = 306;                                      00008180
 /*YS*/    END;                                                         00008190
 /*YS*/                                                                 00008200
 /*YS*/ IF F_FELT_PIC_CHAR3(E3Y.YUG) ^= '000' THEN                      00008210
 /*YS*/    DO;                                                          00008220
 /*YS*/       FEIL_FUNNET = '1'B;                                       00008230
 /*YS*/       E3Y.YUGNR = 326;                                          00008240
 /*YS*/    END;                                                         00008250
                                                                        00008260
 /*YS*/ IF E3Y.KAP_11_7_UTLØST ^= ' ' THEN                              00008270
 /*YS*/    DO;                                                          00008280
 /*YS*/       FEIL_FUNNET   ='1'B;                                      00008290
 /*YS*/       E3Y.KAP_11_7_UTLØSTNR = 326;                              00008300
 /*YS*/    END;                                                         00008310
                                                                        00008320
 /*YS*/ IF VERIFY(E3Y.YRKE11,'FMUEVSA') ^= 0 THEN                       00008330
 /*YS*/    DO;                                                          00008340
 /*YS*/       FEIL_FUNNET = '1'B;                                       00008350
 /*YS*/       E3Y.YRKE11NR =  309 ;                                     00008360
 /*YS*/    END;                                                         00008370
 /*YS*/                                                                 00008380
 /*YS*/ IF ^F_NUMERISK(F_FELT_PIC_CHAR7(E3Y.AÅI)) THEN                  00008390
 /*YS*/    DO;                                                          00008400
 /*YS*/       FEIL_FUNNET = '1'B;                                       00008410
 /*YS*/       E3Y.AÅINR = 200 ;                                         00008420
 /*YS*/    END;                                                         00008430
 /*YS*/                                                                 00008440
 /*YS*/ IF F_SNU_DATO(E3Y.YST_MÅ) > F_SNU_DATO(E3S.VIRK_DATO_MÅ) !      00008450
 /*YS*/    F_SNU_DATO(E3Y.YST_MÅ) > DØDSDATO_ÅM  &                      00008460
 /*YS*/     E3S.FNR_EK  > 11111111111  THEN                             00008470
 /*YS*/    DO;                                                          00008480
                                                                        00008490
 /*YS*/             /* ****************************************** */    00008500
 /*YS*/             /* FEIL,YSKADETIDSPUNKTET > VIRK ELLER        */    00008510
 /*YS*/             /* DØDSDATO PÅ KAP.10-BLANKETTEN.             */    00008520
 /*YS*/             /* ****************************************** */    00008530
                                                                        00008540
 /*YS*/       FEIL_FUNNET    = '1'B;                                    00008550
 /*YS*/       E3Y.YST_MÅNR   =  328 ;                                   00008560
 /*YS*/    END;                                                         00008570
 /*YS*/ IF ^FEIL_FUNNET THEN                                            00008580
 /*YS*/    DO;                                                          00008590
                                                                        00008600
 /*YS*/       IF (E3Y.YRKE11    = 'F' !                                 00008610
 /*YS*/           E3Y.YRKE11    = 'V' !                                 00008620
 /*YS*/           E3Y.YRKE11    = 'U' !                                 00008630
 /*YS*/           E3Y.YRKE11    = 'E' )      THEN                       00008640
 /*YS*/           IF E3Y.AÅI      ^= 9999999 THEN                       00008650
 /*YS*/             DO;                                                 00008660
                                                                        00008670
 /*YS*/ /* ********************************************************** */00008680
 /*YS*/ /* KODE F = FISKER.  KODE V = ELEV.  INNTEKT SKAL IKKE OPPGIS */00008690
 /*YS*/ /* FOR DISSE.                                                 */00008700
 /*YS*/ /* ********************************************************** */00008710
                                                                        00008720
 /*YS*/                FEIL_FUNNET     = '1'B;                          00008730
 /*YS*/                E3Y.AÅINR       =  314;                          00008740
 /*YS*/                E3Y.YRKE11NR    =  999;                          00008750
 /*YS*/             END;                                                00008760
                 ELSE;                                                  00008770
 /*YS*/       ELSE    /*YRKE ER DA M,S,A */                             00008780
 /*YS*/          IF E3Y.AÅI      = 9999999 THEN                         00008790
 /*YS*/             DO;                                                 00008800
                                                                        00008810
 /*YS*/ /* ********************************************************** */00008820
 /*YS*/ /* INNTEKT SKAL REGISTRERES FOR ALLE ANDRE KODER.             */00008830
 /*YS*/ /* ********************************************************** */00008840
                                                                        00008850
 /*YS*/                FEIL_FUNNET     = '1'B;                          00008860
 /*YS*/                E3Y.AÅINR       =  316;                          00008870
 /*YS*/                E3Y.YRKE11NR    =  999;                          00008880
 /*YS*/             END;                                                00008890
 /*YS*/    END;                                                         00008900
                                                                        00008910
 /*YS*/ END; /*SLUTT PÅ TEST OM ALLE FELT ER BLANKE*/                   00008920
 /*YS*/                                                                 00008930
 /*YS*/ IF F_FELT_PIC_CHAR11(E3Y.FNR_EK) ^= (11) '0' THEN               00008940
 /*YS*/    IF ^F_NUMERISK(F_FELT_PIC_CHAR11(E3Y.FNR_EK)) THEN           00008950
 /*YS*/       DO;                                                       00008960
 /*YS*/          FEIL_FUNNET = '1'B;                                    00008970
 /*YS*/          E3Y.FNR_EKNR = 200;                                    00008980
 /*YS*/       END;                                                      00008990
 /*YS*/    ELSE                                                         00009000
 /*YS*/       IF ^F_GYLDIG_FNR(E3Y.FNR_EK) THEN                         00009010
 /*YS*/          DO;                                                    00009020
 /*YS*/             FEIL_FUNNET = '1'B;                                 00009030
 /*YS*/             E3Y.FNR_EKNR = 1;                                   00009040
 /*YS*/          END;                                                   00009050
 /*YS*/       ELSE                                                      00009060
 /*YS*/          DO;                                                    00009070
 /*YS*/             FNR_REG.FNR1 = E3Y.FNR_EK;                          00009080
 /*YS*/             EXEC CICS LINK PROGRAM ('R0019906')                 00009090
 /*YS*/                            COMMAREA(FNR_REG   );                00009100
 /*YS*/             IF FNR_REG.FNR2 > 0 THEN                            00009110
 /*YS*/                DO;                                              00009120
 /*YS*/                   E3Y.FNR_EKNR = 203;                           00009130
 /*YS*/                   E3Y.FNR_GML_EK = E3Y.FNR_EK;                  00009140
 /*YS*/                   E3Y.FNR_EK = FNR_REG.FNR2;                    00009150
 /*YS*/                END;                                             00009160
 /*YS*/             IF F_FELT_PIC_CHAR11(E3Y.FNR_SAMBOER) ^= (11)'0'    00009170
 /*YS*/                                                      THEN       00009180
 /*YS*/                DO;                                              00009190
 /*YS*/                   FEIL_FUNNET = '1'B;                           00009200
 /*YS*/                   E3Y.FNR_EKNR      = 336;                      00009210
 /*YS*/                   E3Y.FNR_SAMBOERNR = 999;                      00009220
 /*YS*/                END;                                             00009230
 /*YS*/             IF E3Y.FNR_EK ^= E3S.FNR                 THEN       00009240
 /*YS*/                DO;                                              00009250
 /*YS*/                   FEIL_FUNNET = '1'B;                           00009260
 /*YS*/                   E3Y.FNR_EKNR = 335;                           00009270
 /*YS*/                END;                                             00009280
 /*YS*/          END;                                                   00009290
 /*YS*/ ELSE                                                            00009300
 /*YS*/    IF F_FELT_PIC_CHAR11(E3Y.FNR_SAMBOER) ^= (11) '0' THEN       00009310
 /*YS*/       IF ^F_NUMERISK(F_FELT_PIC_CHAR11(E3Y.FNR_SAMBOER)) THEN   00009320
 /*YS*/          DO;                                                    00009330
 /*YS*/             FEIL_FUNNET = '1'B;                                 00009340
 /*YS*/             E3Y.FNR_SAMBOERNR = 200;                            00009350
 /*YS*/          END;                                                   00009360
 /*YS*/       ELSE                                                      00009370
 /*YS*/          IF ^F_GYLDIG_FNR(E3Y.FNR_SAMBOER) THEN                 00009380
 /*YS*/             DO;                                                 00009390
 /*YS*/                FEIL_FUNNET = '1'B;                              00009400
 /*YS*/                E3Y.FNR_SAMBOERNR = 1;                           00009410
 /*YS*/             END;                                                00009420
 /*YS*/          ELSE                                                   00009430
 /*YS*/             DO;                                                 00009440
 /*YS*/                FNR_REG.FNR1 = E3Y.FNR_SAMBOER;                  00009450
 /*YS*/                EXEC CICS LINK PROGRAM ('R0019906')              00009460
 /*YS*/                               COMMAREA( FNR_REG  );             00009470
 /*YS*/                IF FNR_REG.FNR2 > 0 THEN                         00009480
 /*YS*/                   DO;                                           00009490
 /*YS*/                      E3Y.FNR_SAMBOERNR = 203;                   00009500
 /*YS*/                      E3Y.FNR_GML_SAMBOER = E3Y.FNR_SAMBOER;     00009510
 /*YS*/                      E3Y.FNR_SAMBOER = FNR_REG.FNR2;            00009520
 /*YS*/                   END;                                          00009530
 /*YS*/                IF F_FELT_PIC_CHAR11(E3Y.FNR_EK) ^=              00009540
 /*YS*/                                              (11)'0' THEN       00009550
 /*YS*/                   DO;                                           00009560
 /*YS*/                      FEIL_FUNNET = '1'B;                        00009570
 /*YS*/                      E3Y.FNR_EKNR      = 336;                   00009580
 /*YS*/                      E3Y.FNR_SAMBOERNR = 999;                   00009590
 /*YS*/                   END;                                          00009600
 /*YS*/                IF E3Y.FNR_SAMBOER ^= E3S.FNR          THEN      00009610
 /*YS*/                   DO;                                           00009620
 /*YS*/                      FEIL_FUNNET = '1'B;                        00009630
 /*YS*/                      E3Y.FNR_SAMBOERNR = 335;                   00009640
 /*YS*/                   END;                                          00009650
 /*YS*/             END;                                                00009660
 /*YS*/    ELSE                                                         00009670
 /*YS*/       /* ****************************************** */          00009680
 /*YS*/       /* VERKEN FNR_EK ELLER FNR_SAMBOER ER FYLT UT */          00009690
 /*YS*/       /* ****************************************** */          00009700
 /*YS*/       DO;                                                       00009710
 /*YS*/          FEIL_FUNNET         = '1'B;                            00009720
 /*YS*/          E3Y.FNR_EKNR        = 327 ;                            00009730
 /*YS*/       END;                                                      00009740
 /*YS*/                                                                 00009750
 /*YS*/ IF F_FELT_PIC_CHAR11(E3Y.FNR_Y_BARN) ^= (11)'0'  THEN           00009760
 /*YS*/    DO;                                                          00009770
 /*YS*/       FEIL_FUNNET         = '1'B;                               00009780
 /*YS*/       E3Y.FNR_Y_BARNNR    =  326 ;                              00009790
 /*YS*/    END;                                                         00009800
 /*YS*/                                                                 00009810
 /*YS*/ IF E3Y.PLEIEBARN ^= ' '  THEN                                   00009820
 /*YS*/    DO;                                                          00009830
 /*YS*/       FEIL_FUNNET         = '1'B;                               00009840
 /*YS*/       E3Y.PLEIEBARNNR     = 326 ;                               00009850
 /*YS*/    END;                                                         00009860
                                                                        00009870
                                                                        00009880
                                                                        00009890
 /*YS*/ IF ^FEIL_FUNNET THEN                                            00009900
 /*YS*/    DO;                                                          00009910
                                                                        00009920
                                                                        00009930
 /*YS*/       IF ^(E3Y.VILKÅR_1_2_2A   = ' '  !                         00009940
 /*YS*/            E3Y.VILKÅR_1_2_2B   = ' '  )  &                      00009950
 /*YS*/            E3S.NORSK_BOSATT = 'J'  THEN                         00009960
 /*YS*/          DO;                                                    00009970
                                                                        00009980
 /*YS*/ /* ********************************************************** */00009990
 /*YS*/ /* VILKÅR 1-2-2 ER UTFYLT.  PERSONEN ER DA IKKE BOSATT I      */00010000
 /*YS*/ /* NORGE, MEN EP-BLANKETTEN ER KRYSSET AV MED JA I FELTET     */00010010
 /*YS*/ /* NORSK BOSATT.  BLANKETTEN AVVISES.                         */00010020
 /*YS*/ /* JEG HAR IKKE SATT OPP NOE FEILMELDINGSNUMMER HER.          */00010030
 /*YS*/ /* ********************************************************** */00010040
                                                                        00010050
 /*YS*/             FEIL_FUNNET         = '1'B;                         00010060
 /*YS*/             E3Y.VILKÅR_1_2_2ANR =  318 ;                        00010070
 /*YS*/             E3Y.VILKÅR_1_2_2BNR =  999 ;                        00010080
 /*YS*/          END;                                                   00010090
 /*YS*/    END;                                                         00010100
                                                                        00010110
 /*YS*/ END KONTROLL_E3_YRKESSKADE;                                     00010120
