 /*       SIST ENDRET 22/09-94 11.33.10 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 08/12-93 09.55.37 AV   HERMAN                   */00000010
 /*       SIST ENDRET 12/10-89 14.53.01 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 10/07-85 11.46.46 AV   LUNDEBY                  */00000030
 /*       SIST ENDRET 18/06-85 08.36.03 AV   FARVIK                   */00000040
 /*       SIST ENDRET 06/06-85 09.02.04 AV   LUNDEBY                  */00000050
 /*       SIST ENDRET 13/01-84 11.12.15 AV   LUNDEBY                  */00000060
 /*       SIST ENDRET 19/10-83 10.58.33 AV   LUNDEBY                  */00000070
 /*       SIST ENDRET 13/05-83 09.56.10 AV   LUNDEBY                  */00000080
                                                                        00000090
                                                                        00000100
  /* **************************************************************** */00000110
  /*IDENTIFIKASJON:                                                   */00000120
  /*    R0015501 - HOVEDPROGRAM I PLI                                 */00000130
  /*    PROGRAMMERER: LUNDEBY JUNI     1982                           */00000140
  /*                                                                  */00000150
  /*HENSIKT:                                                          */00000160
  /*    FJERNER EN ELLER FLERE TRANSER UNDER EN PERSON                */00000170
  /*                                                                  */00000180
  /*PROGRAMTILKNYTNING:                                               */00000190
  /*                                                                  */00000200
  /*BRUK:                                                             */00000210
  /*                                                                  */00000220
  /* **************************************************************** */00000230
                                                                        00000240
  R001550 :                                                             00000250
    PROC            (LOKAL_KOM_PTR)                                     00000260
           OPTIONS  (MAIN);                                             00000270
                                                                        00000280
  %PAGE;                                                                00000290
  %INCLUDE P0019908;                      /*   KOM_OMR        (B) */    00000300
                                                                        00000310
  %PAGE;                                                                00000320
  %INCLUDE P0019912;                      /*   DIV_PARAM_OMR  (B) */    00000330
                                                                        00000340
  %PAGE;                                                                00000350
  %INCLUDE P0019913;                      /*   LOKAL_KOM_OMR  (B) */    00000360
                                                                        00000370
  %PAGE;                                                                00000380
  /* **************************************************************** */00000390
  /*     INNEBYGDE PLI-FUNKSJONER  + PEKER-DEF.                       */00000400
  /* **************************************************************** */00000410
                                                                        00000420
     DCL                                                                00000430
       ( ADDR , LOW , CSTG )                BUILTIN;                    00000440
                                                                        00000450
     DCL                                                                00000460
       PLITDLI ENTRY;                                                   00000470
                                                                        00000480
     DCL                                                                00000490
       ( LOKAL_KOM_PTR , COMMAREA_PEKER , W001_HJELPE_PEKER )  POINTER; 00000500
                                                                        00000510
                                                                        00000520
  /* **************************************************************** */00000530
  /*     ARBEIDSFELTER SOM BRUKES AV UIB OG PCB  .                    */00000540
  /* **************************************************************** */00000550
                                                                        00000560
  %INCLUDE DLIUIB;                                                      00000570
                                                                        00000580
     DCL                                                                00000590
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00000600
                                                                        00000610
  %INCLUDE  P0012002;                  /* UIB_PCB_PEKER_OMR (BASED)   */00000620
                                                                        00000630
     DCL  1 RF1                    BASED (RF1_PCB_PEKER),               00000640
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */ 00000650
                                                                        00000660
     DCL  1 RF2                    BASED (RF2_PCB_PEKER),               00000670
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */ 00000680
                                                                        00000690
     DCL  1 RF3                    BASED (RF3_PCB_PEKER),               00000700
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */ 00000710
                                                                        00000720
  /* **************************************************************** */00000730
  /*     OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */00000740
  /* **************************************************************** */00000750
                                                                        00000760
     DCL 1  W001_OPPTELL_OMR,                                           00000770
            2   I                  FIXED    BIN   (15)   INIT ( 0  ),   00000780
            2   ROT_SKAL_FJERNES            BIT   (1 )   INIT ('0'B),   00000790
            2   MER_DATA                    BIT   (1 )   INIT ('1'B),   00000800
            2   B                           CHAR  (1)    INIT (' ' );   00000810
                                                                        00000820
                                                                        00000830
    /* ************************************************************ */  00000840
    /* TILKNYTTNINGS-SEGM .  BRUKES I 1. RF-PCB.   (RF1)            */  00000850
    /* ************************************************************ */  00000860
                                                                        00000870
     DCL 1  W01_TILKN1             UNALIGNED,                           00000880
     %INCLUDE  P0019931;                     /*   TILKN-SEGM        */  00000890
                                                                        00000900
    /* ************************************************************ */  00000910
    /* TILKNYTTNINGS-SEGM .  BRUKES I 2. RF-PCB.  (RF2)             */  00000920
    /* ************************************************************ */  00000930
                                                                        00000940
     DCL 1  W01_TILKN2             UNALIGNED,                           00000950
     %INCLUDE  P0019931;                     /*   TILKN-SEGM        */  00000960
                                                                        00000970
                                                                        00000980
    /* ************************************************************ */  00000990
    /* TILBERPO-SEGM.BRUKES I OPPDATERING AV TILBERPO-SEGM.         */  00001000
    /* ************************************************************ */  00001010
                                                                        00001020
     DCL 1  W01_TILBERPO           UNALIGNED,                           00001030
     %INCLUDE  P0019929;                     /*   TILBERPO-SEGM.    */  00001040
                                                                        00001050
                                                                        00001060
  /* **************************************************************** */00001070
  /*     DLI CALL-PARAMETRE                                           */00001080
  /* **************************************************************** */00001090
                                                                        00001100
     DCL 1  W001_DLI               UNALIGNED,                           00001110
            2   GET                CHAR     (4)   INIT ('    '),        00001120
            2   GHU                CHAR     (4)   INIT ('GHU '),        00001130
            2   GNP                CHAR     (4)   INIT ('GNP '),        00001140
            2   GHNP               CHAR     (4)   INIT ('GHNP'),        00001150
            2   DLET               CHAR     (4)   INIT ('DLET'),        00001160
            2   FUNC               CHAR     (4)   INIT ('    '),        00001170
            2   PARM_CT_3          FIXED BIN(31)  INIT (3),             00001180
            2   PARM_CT_4          FIXED BIN(31)  INIT (4),             00001190
            2   PARM_CT_5          FIXED BIN(31)  INIT (5),             00001200
            2   PARM_CT_6          FIXED BIN(31)  INIT (6),             00001210
            2   OUT2               CHAR     (20)  INIT ('');            00001220
                                                                        00001230
     DCL  1 W001_IO      UNALIGNED                            ,         00001240
            2   FILLER1            CHAR     ( 31) INIT  ('')  ,         00001250
            2   RF0PERSN_TKNR      DEC FIXED  (5) INIT  ('')  ,         00001260
            2   FILLER2            CHAR     ( 04) INIT  ('')  ,         00001270
            2   RF0PERSN_SPERRE    CHAR     (  1) INIT  ('')  ,         00001280
            2   FILLER3            CHAR     (111) INIT  ('')  ;         00001290
                                                                        00001300
     DCL    W001_HJELPE_IO         CHAR (150) BASED (W001_HJELPE_PEKER);00001310
                                                                        00001320
  %PAGE;                                                                00001330
  /* **************************************************************** */00001340
  /*     DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001350
  /* **************************************************************** */00001360
                                                                        00001370
     DCL    SSA_UQUAL                            CHAR (9)  INIT ('');   00001380
                                                                        00001390
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00001400
            2    HDEL                            CHAR (17) INIT         00001410
                 ('RF0PERSN(FNR     '),                                 00001420
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001430
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00001440
            2    HP                              CHAR (1)  INIT (')');  00001450
                                                                        00001460
     DCL 1  SSA2_RF0PERSN          UNALIGNED,                           00001470
            2    HDEL                            CHAR (17) INIT         00001480
                 ('RF0PERSN(FNR     '),                                 00001490
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001500
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00001510
            2    HP                              CHAR (1)  INIT (')');  00001520
                                                                        00001530
     DCL 1  SSA3_RF0PERSN          UNALIGNED,                           00001540
            2    HDEL                            CHAR (17) INIT         00001550
                 ('RF0PERSN(FNR     '),                                 00001560
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001570
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00001580
            2    HP                              CHAR (1)  INIT (')');  00001590
                                                                        00001600
     DCL 1  SSA1_PINNTEKT          UNALIGNED,                           00001610
            2    HDEL                            CHAR (17) INIT         00001620
                 ('PINNTEKT(INNTTYPE'),                                 00001630
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001640
            2    TYPE                            CHAR (1)  INIT ('A' ), 00001650
            2    HP                              CHAR (1)  INIT (')' ); 00001660
                                                                        00001670
     DCL 1  SSA2_PINNTEKT          UNALIGNED     CHAR (11) INIT         00001680
               ('PINNTEKT*F ');                                         00001690
                                                                        00001700
                                                                        00001710
     DCL 1  SSA1_STATUS            UNALIGNED,                           00001720
            2    HDEL                            CHAR (17) INIT         00001730
                 ('STATUS  (STATKODE'),                                 00001740
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001750
            2    KODE                            CHAR (1)  INIT (' ' ), 00001760
            2    HP                              CHAR (1)  INIT (')' ); 00001770
                                                                        00001780
     DCL 1  SSA1_TILKN             UNALIGNED,                           00001790
            2    HDEL                            CHAR (17) INIT         00001800
                 ('TILKN   (FNRANDR '),                                 00001810
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001820
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00001830
            2    HP                              CHAR (1)  INIT (')');  00001840
                                                                        00001850
                                                                        00001860
                                                                        00001870
  %PAGE;                                                                00001880
  /* **************************************************************** */00001890
  /*                                                                  */00001900
  /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001910
  /*       ---------------------------------------------------        */00001920
  /*                                                                  */00001930
  /*                                                                  */00001940
  /*        INITIERER VISSE DEFAULTVERDIER.                           */00001950
  /*                                                                  */00001960
  /* **************************************************************** */00001970
                                                                        00001980
                                                                        00001990
    COMMAREA_PEKER                          =    HOVED_KOM_OMR_PTR ;    00002000
    PROGRAM_ID                              =   'R0015501'         ;    00002010
    UIBPTR                                  =    UIB_PEKER         ;    00002020
                                                                        00002030
    IF FJERN_ALLE                                THEN                   00002040
       DO;                                                              00002050
          /* ******************************************************** */00002060
          /* GÅR IGJENNOM TILKNYTTINGENE TIL HOVEDPERSON FOR Å FJERNE.*/00002070
          /*                                                          */00002080
          /*  HVIS FJERN ALLE :                                       */00002090
          /*                                                          */00002100
          /*       SØKER                                              */00002110
          /*       SØKERS TILKNYTTNINGER                              */00002120
          /*       TILKNYTTNINGENE  TIL SØKERS TILKNYTTNINGER         */00002130
          /*                                                          */00002140
          /* NEST SISTE OG SISTE STATUS . I TILLEGG FJERNES OGSÅ      */00002150
          /* FORELØPIGE INNTEKTER,TILBERPO OG TRANHIST.               */00002160
          /*                                                          */00002170
          /*  HVIS IKKE       FJERNES BARE SISTE TRANHIST             */00002180
          /* ******************************************************** */00002190
                                                                        00002200
          SSA1_RF0PERSN.PKEY                    =    SEARCH_FNR        ;00002210
                                                                        00002220
          SSA1_STATUS.KODE                      =   'S'                ;00002230
          CALL P030_LEST_TILKN_FJERNET_ALT                             ;00002240
                                                                        00002250
          IF FEIL_MELD_NR    >  0      THEN                             00002260
             GO   TO   L999;                                            00002270
                                                                        00002280
                                                                        00002290
          SSA1_STATUS.KODE                      =   'N'                ;00002300
          CALL P030_LEST_TILKN_FJERNET_ALT                             ;00002310
                                                                        00002320
          IF FEIL_MELD_NR    >  0      THEN                             00002330
             GO   TO   L999;                                            00002340
                                                                        00002350
       END;     /*   IF   FJERN_ALLE                   */               00002360
    ELSE                                                                00002370
       DO;                                                              00002380
          /* ****************************************************** */  00002390
          /* FJERNER SISTE :     TRANHIST                           */  00002400
          /* ****************************************************** */  00002410
                                                                        00002420
          SSA_UQUAL                           =   'TRANHIST '        ;  00002430
          W001_DLI.GET                        =   'GU  '             ;  00002440
          SSA3_RF0PERSN.PKEY                  =    SEARCH_FNR        ;  00002450
          CALL P005_LES_RF0PERSN;                                       00002460
                                                                        00002470
          IF FEIL_MELD_NR                     >    0   THEN             00002480
             GO   TO   L999;                                            00002490
                                                                        00002500
          CALL P014_FJERN_SEGM    ;                                     00002510
                                                                        00002520
          IF FEIL_MELD_NR    >  0  THEN                                 00002530
             GO   TO   L999;                                            00002540
       END;                                                             00002550
                                                                        00002560
                                                                        00002570
                                                                        00002580
    /* ************************************************************** */00002590
    /* ************************************************************** */00002600
    /* ********                                        ************** */00002610
    /* ********    I N T E R N E  P R O C E D U R E R  ************** * 00002620
    /* ********                                        ************** */00002630
    /* ************************************************************** */00002640
    /* ************************************************************** */00002650
                                                                        00002660
                                                                        00002670
                                                                        00002680
    %PAGE;                                                              00002690
    /* ************************************************************** */00002700
    /*                                                                */00002710
    /* PROCEDURE FOR Å LESE    : RF0PERSN                             */00002720
    /*                                                                */00002730
    /* ************************************************************** */00002740
                                                                        00002750
    P005_LES_RF0PERSN :                                                 00002760
      PROC ;                                                            00002770
                                                                        00002780
                                                                        00002790
                                                                        00002800
      CALL PLITDLI                          (W001_DLI.PARM_CT_4,        00002810
                                             W001_DLI.GET,              00002820
                                             RF3,                       00002830
                                             W001_IO,                   00002840
                                             SSA3_RF0PERSN);            00002850
                                                                        00002860
      IF  DLIUIB.UIBRCODE.UIBFCTR   ^=       UIB_RC_OK    THEN          00002870
        DO;                                                             00002880
          /* ******************************************** */            00002890
          /* FEIL VED LES   AV :  RF0PERSN                */            00002900
          /* ******************************************** */            00002910
  L100:                                                                 00002920
          FEIL_MELD_NR               =       500 ;                      00002930
          FEIL_VED_LABEL             =      '100';                      00002940
          GO   TO  RETUR;                                               00002950
        END;                                                            00002960
                                                                        00002970
      SELECT  ( RF3.STATUS_KODE );                                      00002980
                                                                        00002990
         WHEN ('  ')                                                    00003000
                                                                        00003010
              /* ******************************************** */        00003020
              /* RF0PERSN   FUNNET                            */        00003030
              /* ******************************************** */        00003040
                                                                        00003050
              MER_DATA   =  '1'B ;                                      00003060
                                                                        00003070
         WHEN ('GE')                                                    00003080
                                                                        00003090
              /* ******************************************** */        00003100
              /* RF0PERSN   IKKE FUNNET                       */        00003110
              /* ******************************************** */        00003120
                                                                        00003130
              MER_DATA   =  '0'B ;                                      00003140
                                                                        00003150
         OTHERWISE                                                      00003160
            DO;                                                         00003170
              /* ******************************************** */        00003180
              /* FEIL VED LES   AV :  RF0PERSN                */        00003190
              /* ******************************************** */        00003200
  L110:                                                                 00003210
              FEIL_MELD_NR             =       500 ;                    00003220
              FEIL_VED_LABEL           =      '110';                    00003230
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00003240
              GO   TO   RETUR;                                          00003250
            END;                                                        00003260
                                                                        00003270
      END;/*   SELECT                               */                  00003280
                                                                        00003290
  RETUR:                                                                00003300
    END P005_LES_RF0PERSN;                                              00003310
                                                                        00003320
                                                                        00003330
                                                                        00003340
                                                                        00003350
    %PAGE;                                                              00003360
    /* ************************************************************** */00003370
    /*                                                                */00003380
    /* PROCEDURE FOR Å SJEKKE OM :   UNDERLIGGENDE SEGMENTER FINNES   */00003390
    /*                                                                */00003400
    /* ************************************************************** */00003410
                                                                        00003420
    P006_SJEKK_OM_UNDERSEGM_FINNES:                                     00003430
      PROC ;                                                            00003440
                                                                        00003450
                                                                        00003460
                                                                        00003470
      W001_DLI.GET                   =      'GU  ';                     00003480
      CALL P005_LES_RF0PERSN;                                           00003490
                                                                        00003500
      IF FEIL_MELD_NR                >       0          THEN            00003510
         GO   TO   RETUR;                                               00003520
                                                                        00003530
      CALL PLITDLI                          (W001_DLI.PARM_CT_3,        00003540
                                             W001_DLI.GNP,              00003550
                                             RF3,                       00003560
                                             W001_IO);                  00003570
                                                                        00003580
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK    THEN            00003590
        DO;                                                             00003600
          /* ******************************************** */            00003610
          /* FEIL VED DB                                  */            00003620
          /* ******************************************** */            00003630
  L120:                                                                 00003640
          FEIL_MELD_NR             =       500 ;                        00003650
          FEIL_VED_LABEL           =      '120';                        00003660
          GO   TO  RETUR;                                               00003670
        END;                                                            00003680
                                                                        00003690
                                                                        00003700
      SELECT  ( RF3.STATUS_KODE );                                      00003710
                                                                        00003720
         WHEN ('  ')                                                    00003730
                                                                        00003740
              /* *************************************************** */ 00003750
              /* UNDERLIGGENDE SEGM FINNES. ROT SKAL IKKE FJERNES    */ 00003760
              /* *************************************************** */ 00003770
                                                                        00003780
              ROT_SKAL_FJERNES         =     '0'B ;                     00003790
                                                                        00003800
         WHEN ('GE')                                                    00003810
                                                                        00003820
              /* *************************************************** */ 00003830
              /* UNDERLIGGENDE SEGM FINNES IKKE. ROT SKAL FJERNES    */ 00003840
              /* *************************************************** */ 00003850
                                                                        00003860
    /*        ROT_SKAL_FJERNES         =      '1'B ;  SP 15.10.92 */    00003870
              ROT_SKAL_FJERNES         =      '0'B ;                    00003880
                                                                        00003890
         OTHERWISE                                                      00003900
            DO;                                                         00003910
              /* ******************************************** */        00003920
              /* FEIL VED LES  GNP                            */        00003930
              /* ******************************************** */        00003940
  L125:                                                                 00003950
              FEIL_MELD_NR             =       500 ;                    00003960
              FEIL_VED_LABEL           =      '125';                    00003970
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00003980
              GO   TO  RETUR;                                           00003990
            END;                                                        00004000
                                                                        00004010
      END;/*   SELECT                               */                  00004020
                                                                        00004030
                                                                        00004040
  RETUR:                                                                00004050
                                                                        00004060
    END P006_SJEKK_OM_UNDERSEGM_FINNES;                                 00004070
                                                                        00004080
                                                                        00004090
                                                                        00004100
    %PAGE;                                                              00004110
    /* ************************************************************** */00004120
    /*                                                                */00004130
    /* PROCEDURE FOR Å FJERNE / REPLACE :  RF0PERSN                   */00004140
    /*                                                                */00004150
    /* ************************************************************** */00004160
                                                                        00004170
    P008_FJERN_REPL_ROT :                                               00004180
      PROC ;                                                            00004190
                                                                        00004200
                                                                        00004210
                                                                        00004220
      W001_DLI.GET                   =      'GHU ';                     00004230
      CALL P005_LES_RF0PERSN;                                           00004240
                                                                        00004250
       IF FJERN_ALLE      THEN                                          00004260
          RF0PERSN_TKNR   =     0     ;                                 00004270
      IF FEIL_MELD_NR                >       0          THEN            00004280
         GO   TO   RETUR;                                               00004290
                                                                        00004300
      CALL PLITDLI                          (W001_DLI.PARM_CT_3,        00004310
                                             W001_DLI.FUNC,             00004320
                                             RF3,                       00004330
                                             W001_IO);                  00004340
                                                                        00004350
      IF DLIUIB.UIBRCODE.UIBFCTR    ^=       UIB_RC_OK    !             00004360
         RF3.STATUS_KODE            ^=       '  '         THEN          00004370
        DO;                                                             00004380
          /* ******************************************** */            00004390
          /* FEIL VED FJERN / REPL  :  RF0PERSN           */            00004400
          /* ******************************************** */            00004410
  L130:                                                                 00004420
          FEIL_MELD_NR               =       500 ;                      00004430
          FEIL_VED_LABEL             =      '130';                      00004440
          DB_STATUS_KODE             =       RF3.STATUS_KODE;           00004450
          GO   TO  RETUR;                                               00004460
        END;                                                            00004470
                                                                        00004480
  RETUR:                                                                00004490
    END P008_FJERN_REPL_ROT;                                            00004500
                                                                        00004510
                                                                        00004520
                                                                        00004530
    %PAGE;                                                              00004540
    /* ************************************************************** */00004550
    /*                                                                */00004560
    /* PROCEDURE FOR Å FJERNE FORELØPIG PINNTEKT, TILBERPO, TRANHIST  */00004570
    /*                                                                */00004580
    /* ************************************************************** */00004590
                                                                        00004600
    P010_FJERN_RESTEN :                                                 00004610
      PROC ;                                                            00004620
                                                                        00004630
                                                                        00004640
                                                                        00004650
      W001_DLI.GET              =   'GU  ';                             00004660
      CALL P005_LES_RF0PERSN;                                           00004670
                                                                        00004680
      IF FEIL_MELD_NR           >    0    THEN                          00004690
         GO   TO   RETUR;                                               00004700
                                                                        00004710
       IF MER_DATA                        THEN                          00004720
          DO;                                                           00004730
             /* *********************************************** */      00004740
             /* FJERNER ALLE  FORELØPIGE PINNTEKT               */      00004750
             /* *********************************************** */      00004760
                                                                        00004770
             DO      WHILE ( MER_DATA );                                00004780
                CALL P012_FJERN_FORELØPIG_PINNTEKT;                     00004790
                                                                        00004800
                IF   FEIL_MELD_NR          >      0    THEN             00004810
                     GO   TO   RETUR;                                   00004820
             END;                                                       00004830
                                                                        00004840
                                                                        00004850
             /* *********************************************** */      00004860
             /* OPPDATERER TILBERPO-SEGMENTET.                  */      00004870
             /* *********************************************** */      00004880
                                                                        00004890
                                                                        00004900
             SSA_UQUAL  =  'TILBERPO '                            ;     00004910
                                                                        00004920
             CALL  P013_LES_TILBERPO                              ;     00004930
                                                                        00004940
             IF FEIL_MELD_NR    >  0  THEN                              00004950
                GO   TO   RETUR                                   ;     00004960
             ELSE                                                       00004970
                IF MER_DATA THEN                                        00004980
                   DO;                                                  00004990
                      CALL  P015_REPL_TILBERPO                    ;     00005000
                                                                        00005010
                      IF FEIL_MELD_NR    >  0  THEN                     00005020
                         GO   TO   RETUR                          ;     00005030
                   END;                                                 00005040
                                                                        00005050
             /* ************************************************ */     00005060
             /* FJERNER ALLE            TRANHIST                 */     00005070
             /* ************************************************ */     00005080
                                                                        00005090
             MER_DATA   =  '1'B                                   ;     00005100
             SSA_UQUAL  =  'TRANHIST '                            ;     00005110
                                                                        00005120
             DO WHILE ( MER_DATA )                                ;     00005130
                CALL  P014_FJERN_SEGM                             ;     00005140
                                                                        00005150
                IF FEIL_MELD_NR    >  0  THEN                           00005160
                   GO   TO   RETUR                                ;     00005170
             END;                                                       00005180
                                                                        00005190
             /* *********************************************** */      00005200
             /* SJEKKER OM ROT-SEGM SKAL FJERNES                */      00005210
             /* HVIS IKKE MÅ SPERRE_KODEN BLANKES .             */      00005220
             /* *********************************************** */      00005230
                                                                        00005240
             CALL P006_SJEKK_OM_UNDERSEGM_FINNES;                       00005250
                                                                        00005260
             IF FEIL_MELD_NR               >      0    THEN             00005270
                GO   TO   RETUR;                                        00005280
                                                                        00005290
             IF ROT_SKAL_FJERNES                       THEN             00005300
                DO;                                                     00005310
                   W001_DLI.FUNC           =     'DLET';                00005320
                   CALL P008_FJERN_REPL_ROT;                            00005330
                END;                                                    00005340
             ELSE                                                       00005350
                DO;                                                     00005360
                   W001_DLI.FUNC           =     'REPL';                00005370
                   RF0PERSN_SPERRE         =     ' '   ;                00005380
                   CALL P008_FJERN_REPL_ROT;                            00005390
                END;                                                    00005400
          END;                                                          00005410
                                                                        00005420
  RETUR:                                                                00005430
    END P010_FJERN_RESTEN;                                              00005440
                                                                        00005450
    %PAGE;                                                              00005460
    /* ************************************************************** */00005470
    /*                                                                */00005480
    /* PROCEDURE FOR Å FJERNE    FORELØPIG  PINNTEKT                  */00005490
    /*                                                                */00005500
    /* ************************************************************** */00005510
                                                                        00005520
    P012_FJERN_FORELØPIG_PINNTEKT:                                      00005530
      PROC ;                                                            00005540
                                                                        00005550
                                                                        00005560
                                                                        00005570
      CALL PLITDLI                          (W001_DLI.PARM_CT_4,        00005580
                                             W001_DLI.GHNP,             00005590
                                             RF3,                       00005600
                                             W001_IO,                   00005610
                                             SSA1_PINNTEKT);            00005620
                                                                        00005630
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK    THEN            00005640
        DO;                                                             00005650
          /* ******************************************** */            00005660
          /* FEIL VED LES   AV :  PINNTEKT                */            00005670
          /* ******************************************** */            00005680
  L140:                                                                 00005690
          FEIL_MELD_NR             =       500 ;                        00005700
          FEIL_VED_LABEL           =      '140';                        00005710
          GO   TO  RETUR;                                               00005720
        END;                                                            00005730
                                                                        00005740
                                                                        00005750
      SELECT  ( RF3.STATUS_KODE );                                      00005760
                                                                        00005770
         WHEN ('  ')                                                    00005780
            DO;                                                         00005790
              /* ******************************************** */        00005800
              /* PINNTEKT   FUNNET . SEGMENTET FJERNES        */        00005810
              /* ******************************************** */        00005820
                                                                        00005830
              MER_DATA             =         '1'B ;                     00005840
                                                                        00005850
              CALL PLITDLI                   (W001_DLI.PARM_CT_3,       00005860
                                              W001_DLI.DLET,            00005870
                                              RF3,                      00005880
                                              W001_IO);                 00005890
                                                                        00005900
              IF  DLIUIB.UIBRCODE.UIBFCTR ^=  UIB_RC_OK                 00005910
                ! RF3.STATUS_KODE         ^=  '  '         THEN         00005920
                DO;                                                     00005930
                  /* ******************************************** */    00005940
                  /* FEIL VED DELETE  AV :  PINNTEKT              */    00005950
                  /* ******************************************** */    00005960
  L150:                                                                 00005970
                  FEIL_MELD_NR             =   500 ;                    00005980
                  FEIL_VED_LABEL           =  '150';                    00005990
                  DB_STATUS_KODE           =   RF3.STATUS_KODE;         00006000
                  MER_DATA                 =   '0'B ;                   00006010
                  GO   TO  RETUR;                                       00006020
                END;                                                    00006030
                                                                        00006040
            END;                                                        00006050
                                                                        00006060
         WHEN ('GE')                                                    00006070
            DO;                                                         00006080
              /* ******************************************** */        00006090
              /* PINNTEKT   IKKE FUNNET                       */        00006100
              /* ******************************************** */        00006110
                                                                        00006120
              MER_DATA                 =      '0'B ;                    00006130
            END;                                                        00006140
                                                                        00006150
         OTHERWISE                                                      00006160
            DO;                                                         00006170
              /* ******************************************** */        00006180
              /* FEIL VED LES   AV :  PINNTEKT                */        00006190
              /* ******************************************** */        00006200
  L160:                                                                 00006210
              FEIL_MELD_NR             =       500 ;                    00006220
              FEIL_VED_LABEL           =      '160';                    00006230
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00006240
              GO   TO  RETUR;                                           00006250
            END;                                                        00006260
                                                                        00006270
      END;/*   SELECT                               */                  00006280
                                                                        00006290
                                                                        00006300
  RETUR:                                                                00006310
                                                                        00006320
    END P012_FJERN_FORELØPIG_PINNTEKT;                                  00006330
                                                                        00006340
                                                                        00006350
                                                                        00006360
                                                                        00006370
    %PAGE;                                                              00006380
    /* ************************************************************** */00006390
    /*                                                                */00006400
    /* PROCEDURE FOR Å LESE TILBERPO.                                 */00006410
    /*                                                                */00006420
    /* ************************************************************** */00006430
                                                                        00006440
                                                                        00006450
    P013_LES_TILBERPO:                                                  00006460
      PROC ;                                                            00006470
                                                                        00006480
                                                                        00006490
                                                                        00006500
      CALL PLITDLI                          (W001_DLI.PARM_CT_4,        00006510
                                             W001_DLI.GHNP,             00006520
                                             RF3,                       00006530
                                             W01_TILBERPO,              00006540
                                             SSA_UQUAL);                00006550
                                                                        00006560
      IF  DLIUIB.UIBRCODE.UIBFCTR   ^=       UIB_RC_OK    THEN          00006570
        DO;                                                             00006580
          /* ******************************************** */            00006590
          /* FEIL VED LES   AV :  TILBERPO                */            00006600
          /* ******************************************** */            00006610
  L162:                                                                 00006620
          FEIL_MELD_NR               =       500 ;                      00006630
          FEIL_VED_LABEL             =      '162';                      00006640
          GO   TO  RETUR;                                               00006650
        END;                                                            00006660
                                                                        00006670
      SELECT  ( RF3.STATUS_KODE );                                      00006680
                                                                        00006690
         WHEN ('  ')                                                    00006700
                                                                        00006710
              /* ******************************************** */        00006720
              /* TILBERPO   FUNNET                            */        00006730
              /* ******************************************** */        00006740
                                                                        00006750
              MER_DATA   =  '1'B ;                                      00006760
                                                                        00006770
         WHEN ('GE')                                                    00006780
                                                                        00006790
              /* ******************************************** */        00006800
              /* TILBERPO   IKKE FUNNET                       */        00006810
              /* ******************************************** */        00006820
                                                                        00006830
              MER_DATA   =  '0'B ;                                      00006840
                                                                        00006850
         OTHERWISE                                                      00006860
            DO;                                                         00006870
              /* ******************************************** */        00006880
              /* FEIL VED LES   AV :  TILBERPO                */        00006890
              /* ******************************************** */        00006900
  L164:                                                                 00006910
              FEIL_MELD_NR             =       500 ;                    00006920
              FEIL_VED_LABEL           =      '164';                    00006930
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00006940
              GO   TO   RETUR;                                          00006950
            END;                                                        00006960
                                                                        00006970
      END;/*   SELECT                               */                  00006980
                                                                        00006990
  RETUR:                                                                00007000
    END P013_LES_TILBERPO;                                              00007010
                                                                        00007020
                                                                        00007030
                                                                        00007040
    %PAGE;                                                              00007050
    /* ************************************************************** */00007060
    /*                                                                */00007070
    /* PROCEDURE FOR Å FJERNE ET SEGM UNDER RF0PERSN                  */00007080
    /*                                                                */00007090
    /* ************************************************************** */00007100
                                                                        00007110
    P014_FJERN_SEGM :                                                   00007120
      PROC ;                                                            00007130
                                                                        00007140
                                                                        00007150
                                                                        00007160
      CALL PLITDLI                          (W001_DLI.PARM_CT_4,        00007170
                                             W001_DLI.GHNP,             00007180
                                             RF3,                       00007190
                                             W001_IO,                   00007200
                                             SSA_UQUAL);                00007210
                                                                        00007220
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK    THEN            00007230
        DO;                                                             00007240
          /* ******************************************** */            00007250
          /* FEIL PÅ DB                                   */            00007260
          /* ******************************************** */            00007270
  L170:                                                                 00007280
          FEIL_MELD_NR             =       500 ;                        00007290
          FEIL_VED_LABEL           =      '170';                        00007300
          GO   TO  RETUR;                                               00007310
        END;                                                            00007320
                                                                        00007330
                                                                        00007340
      SELECT  ( RF3.STATUS_KODE );                                      00007350
                                                                        00007360
         WHEN ('  ')                                                    00007370
            DO;                                                         00007380
              /* ******************************************** */        00007390
              /* ØNSKET SEGM FUNNET  OG KAN FJERNES           */        00007400
              /* ******************************************** */        00007410
                                                                        00007420
              MER_DATA                 =      '1'B ;                    00007430
                                                                        00007440
              CALL PLITDLI                   (W001_DLI.PARM_CT_3,       00007450
                                              W001_DLI.DLET,            00007460
                                              RF3,                      00007470
                                              W001_IO);                 00007480
                                                                        00007490
              IF  DLIUIB.UIBRCODE.UIBFCTR ^=  UIB_RC_OK                 00007500
                ! RF3.STATUS_KODE         ^=  '  '         THEN         00007510
                DO;                                                     00007520
                  /* ******************************************** */    00007530
                  /* FEIL VED DELETE  ØNSKET SEGM                 */    00007540
                  /* ******************************************** */    00007550
  L180:                                                                 00007560
                  FEIL_MELD_NR             =   500 ;                    00007570
                  FEIL_VED_LABEL           =  '180';                    00007580
                  DB_STATUS_KODE           =   RF3.STATUS_KODE;         00007590
                  MER_DATA                 =  '0'B ;                    00007600
                  GO   TO  RETUR;                                       00007610
                END;                                                    00007620
            END;                                                        00007630
                                                                        00007640
         WHEN ('GE')                                                    00007650
                                                                        00007660
              /* ************************************************* */   00007670
              /* ØNSKET SEGM FINNES IKKE. RETUR_KODE ER OK         */   00007680
              /* ************************************************* */   00007690
                                                                        00007700
              MER_DATA                 =      '0'B ;                    00007710
                                                                        00007720
         OTHERWISE                                                      00007730
            DO;                                                         00007740
              /* ******************************************** */        00007750
              /* FEIL VED LES   ØNSKET SEGM                   */        00007760
              /* ******************************************** */        00007770
  L190:                                                                 00007780
              FEIL_MELD_NR             =       500 ;                    00007790
              FEIL_VED_LABEL           =      '190';                    00007800
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00007810
              GO   TO  RETUR;                                           00007820
            END;                                                        00007830
                                                                        00007840
      END;/*   SELECT                               */                  00007850
                                                                        00007860
  RETUR:                                                                00007870
                                                                        00007880
    END P014_FJERN_SEGM;                                                00007890
                                                                        00007900
                                                                        00007910
                                                                        00007920
    %PAGE;                                                              00007930
    /* ************************************************************** */00007940
    /*                                                                */00007950
    /* PROCEDURE FOR Å FJERNE  VERNEPLIKTSÅR I TILBERPO.              */00007960
    /*                                                                */00007970
    /* ************************************************************** */00007980
                                                                        00007990
    P015_REPL_TILBERPO:                                                 00008000
      PROC ;                                                            00008010
                                                                        00008020
                                                                        00008030
      W01_TILBERPO.VERNEPLIKTÅR(1) = 0                       ;          00008040
      W01_TILBERPO.VERNEPLIKTÅR(2) = 0                       ;          00008050
      W01_TILBERPO.VERNEPLIKTÅR(3) = 0                       ;          00008060
      W01_TILBERPO.VERNEPLIKTÅR(4) = 0                       ;          00008070
                                                                        00008080
      W001_DLI.FUNC = 'REPL '                                ;          00008090
                                                                        00008100
      CALL PLITDLI                          (W001_DLI.PARM_CT_3,        00008110
                                             W001_DLI.FUNC,             00008120
                                             RF3,                       00008130
                                             W01_TILBERPO);             00008140
                                                                        00008150
      IF DLIUIB.UIBRCODE.UIBFCTR    ^=       UIB_RC_OK    !             00008160
         RF3.STATUS_KODE            ^=       '  '         THEN          00008170
        DO;                                                             00008180
          /* ******************************************** */            00008190
          /* FEIL VED REPL AV TILBERPO                    */            00008200
          /* ******************************************** */            00008210
  L192:                                                                 00008220
          FEIL_MELD_NR               =       500 ;                      00008230
          FEIL_VED_LABEL             =      '192';                      00008240
          DB_STATUS_KODE             =       RF3.STATUS_KODE;           00008250
          GO   TO  RETUR;                                               00008260
        END;                                                            00008270
                                                                        00008280
  RETUR:                                                                00008290
                                                                        00008300
                                                                        00008310
    END P015_REPL_TILBERPO;                                             00008320
                                                                        00008330
                                                                        00008340
    %PAGE;                                                              00008350
    /* ************************************************************** */00008360
    /*                                                                */00008370
    /* PROCEDURE FOR Å FJERNE    SISTE / NEST SISTE   STATUS FOR :    */00008380
    /*                                                                */00008390
    /*       SØKER                                                    */00008400
    /*       SØKERS TILKNYTTNINGER                                    */00008410
    /*       TILKNYTTNINGENE  TIL SØKERS TILKNYTTNINGER               */00008420
    /*                                                                */00008430
    /* ************************************************************** */00008440
                                                                        00008450
    P030_LEST_TILKN_FJERNET_ALT :                                       00008460
      PROC;                                                             00008470
                                                                        00008480
                                                                        00008490
      SSA_UQUAL                       =   'TILKN    ';                  00008500
      W001_DLI.GET                    =   'GU  '     ;                  00008510
                                                                        00008520
      /************************************************************** */00008530
      /*  LESER TILKNYTTNINGENE TIL SØKER.                            */00008540
      /************************************************************** */00008550
                                                                        00008560
      DO WHILE   ( P034_LEST_TILKN_PCB1 );                              00008570
                                                                        00008580
         SSA2_RF0PERSN.PKEY           =    W01_TILKN1.FNR_TILKN;        00008590
         W001_DLI.GET                 =   'GU  '         ;              00008600
                                                                        00008610
         /* ****************************************************** */   00008620
         /* LESER TILKNYTTNINGENE TIL SØKER'S TILKNYTTNINGER.      */   00008630
         /* FJERNER DERES STATUS_SEGM. HVIS DE ER FORSKJELLIG      */   00008640
         /* FRA SØKER.                                             */   00008650
         /* ****************************************************** */   00008660
                                                                        00008670
         IF W01_TILKN1.TILKNYTNINGSKODE      ^=    'D'       THEN       00008680
            DO;                                                         00008690
               DO WHILE   ( P036_LEST_TILKN_PCB2 );                     00008700
                                                                        00008710
                  IF W01_TILKN2.FNR_TILKN    ^=  SSA1_RF0PERSN.PKEY THEN00008720
                     DO;                                                00008730
                        SSA3_RF0PERSN.PKEY    =  W01_TILKN2.FNR_TILKN;  00008740
                                                                        00008750
                        IF W01_TILKN2.TILKNYTNINGSKODE =  'D'  THEN     00008760
                           DO;                                          00008770
                              SSA1_TILKN.REL_OP = '^='            ;     00008780
                              SSA1_TILKN.PKEY   = W01_TILKN1.FNR_TILKN; 00008790
                                                                        00008800
                              IF P037_FLERE_TILKN                   THEN00008810
                                 DO;                                    00008820
                                    SSA1_TILKN.REL_OP  =  ' ='      ;   00008830
                                    CALL P038_FJERN_TILKN           ;   00008840
                                 END;                                   00008850
                              ELSE                                      00008860
                                 DO;                                    00008870
                                    CALL P032_FJERN_STATUS          ;   00008880
                                                                        00008890
                                    IF   FEIL_MELD_NR     >  0      THEN00008900
                                         GO   TO   RETUR;               00008910
                                                                        00008920
                                    CALL P010_FJERN_RESTEN          ;   00008930
                                 END;                                   00008940
                           END;                                         00008950
                        ELSE                                            00008960
                           DO;                                          00008970
                              CALL P032_FJERN_STATUS                ;   00008980
                                                                        00008990
                              IF   FEIL_MELD_NR      >   0          THEN00009000
                                   GO   TO   RETUR;                     00009010
                                                                        00009020
                              CALL P010_FJERN_RESTEN                ;   00009030
                           END;                                         00009040
                                                                        00009050
                        IF FEIL_MELD_NR             >   0           THEN00009060
                           GO   TO   RETUR;                             00009070
                     END;                                               00009080
                                                                        00009090
                  W001_DLI.GET       = 'GN  ';                          00009100
                                                                        00009110
               END;  /*    DO WHILE  (  P036_LEST_TILKN_PCB2 )      */  00009120
                                                                        00009130
               IF FEIL_MELD_NR          >  0      THEN                  00009140
                                                                        00009150
                  /* ****************************************** */      00009160
                  /* FEIL VED LESING AV    :      TILKN         */      00009170
                  /* ****************************************** */      00009180
                                                                        00009190
                  GO TO  RETUR;                                         00009200
                                                                        00009210
               SSA3_RF0PERSN.PKEY          =  W01_TILKN1.FNR_TILKN;     00009220
               CALL P032_FJERN_STATUS;                                  00009230
                                                                        00009240
               IF FEIL_MELD_NR             >  0         THEN            00009250
                  GO   TO   RETUR;                                      00009260
                                                                        00009270
               CALL P010_FJERN_RESTEN                   ;               00009280
                                                                        00009290
               IF   FEIL_MELD_NR           >  0         THEN            00009300
                    GO   TO   RETUR;                                    00009310
            END;                                                        00009320
         ELSE                                                           00009330
            /* *************************************************** */   00009340
            /* TILKN_KODE = D ): DØD PERSN. SJEKKER OM FLERE TILKN.*/   00009350
            /* ER DET FJERNES BARE TILKN . HVIS IKKE TAS STATUS   .*/   00009360
            /* *************************************************** */   00009370
            DO;                                                         00009380
               SSA1_TILKN.REL_OP           =  '^='               ;      00009390
               SSA1_TILKN.PKEY             =  SSA1_RF0PERSN.PKEY ;      00009400
               SSA3_RF0PERSN.PKEY          =  W01_TILKN1.FNR_TILKN;     00009410
                                                                        00009420
               IF P037_FLERE_TILKN                   THEN               00009430
                  DO;                                                   00009440
                     SSA1_TILKN.REL_OP     =  ' ='               ;      00009450
                     CALL P038_FJERN_TILKN                       ;      00009460
                  END;                                                  00009470
               ELSE                                                     00009480
                  DO;                                                   00009490
                     CALL P032_FJERN_STATUS                      ;      00009500
                                                                        00009510
                     IF   FEIL_MELD_NR      >  0              THEN      00009520
                          GO   TO   RETUR;                              00009530
                                                                        00009540
                     CALL P010_FJERN_RESTEN                      ;      00009550
                  END;                                                  00009560
                                                                        00009570
               IF FEIL_MELD_NR      >  0                      THEN      00009580
                  GO   TO   RETUR;                                      00009590
            END;                                                        00009600
                                                                        00009610
         W001_DLI.GET                      =  'GN  '             ;      00009620
                                                                        00009630
      END;  /*   DO  WHILE          ( P034_LEST_TILKN_PCB1 )   */       00009640
                                                                        00009650
                                                                        00009660
      IF FEIL_MELD_NR          >  0      THEN                           00009670
         DO;                                                            00009680
            /* ****************************************** */            00009690
            /* FEIL VED LESING AV    :      TILKN         */            00009700
            /* ****************************************** */            00009710
                                                                        00009720
            GO TO  RETUR;                                               00009730
         END;                                                           00009740
                                                                        00009750
      SSA3_RF0PERSN.PKEY       =     SSA1_RF0PERSN.PKEY    ;            00009760
      CALL P032_FJERN_STATUS                               ;            00009770
                                                                        00009780
      IF   FEIL_MELD_NR        >     0                     THEN         00009790
           GO   TO   RETUR;                                             00009800
                                                                        00009810
      CALL P010_FJERN_RESTEN                               ;            00009820
                                                                        00009830
      IF   FEIL_MELD_NR        >     0             THEN                 00009840
           GO   TO   RETUR;                                             00009850
                                                                        00009860
  RETUR:                                                                00009870
    END P030_LEST_TILKN_FJERNET_ALT;                                    00009880
                                                                        00009890
                                                                        00009900
                                                                        00009910
    %PAGE;                                                              00009920
    /* ************************************************************** */00009930
    /*                                                                */00009940
    /* PROCEDURE FOR Å FJERNE    :   STATUS                           */00009950
    /*                                                                */00009960
    /* ************************************************************** */00009970
                                                                        00009980
    P032_FJERN_STATUS:                                                  00009990
      PROC;                                                             00010000
                                                                        00010010
                                                                        00010020
      CALL PLITDLI                              (W001_DLI.PARM_CT_5,    00010030
                                                 W001_DLI.GHU,          00010040
                                                 RF3,                   00010050
                                                 W001_IO,               00010060
                                                 SSA3_RF0PERSN,         00010070
                                                 SSA1_STATUS);          00010080
                                                                        00010090
      IF  UIBFCTR                          ^=    UIB_RC_OK  THEN        00010100
        DO;                                                             00010110
          /* ******************************************************** */00010120
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */00010130
          /* ******************************************************** */00010140
  L200:                                                                 00010150
          FEIL_MELD_NR                      =    500;                   00010160
          FEIL_VED_LABEL                    =   '200';                  00010170
          GO   TO  RETUR;                                               00010180
        END;                                                            00010190
                                                                        00010200
      IF RF3.STATUS_KODE                    =    '  '             THEN  00010210
        DO;                                                             00010220
          CALL PLITDLI                          (W001_DLI.PARM_CT_3,    00010230
                                                 W001_DLI.DLET,         00010240
                                                 RF3,                   00010250
                                                 W001_IO);              00010260
                                                                        00010270
          IF  RF3.STATUS_KODE              ^=    '  '                   00010280
            ! UIBFCTR                      ^=   UIB_RC_OK  THEN         00010290
            DO;                                                         00010300
            /* **************************************************** */  00010310
            /*  UAKSEPTABEL KODE FRA  :   UIB                       */  00010320
            /*                            RF3.STATUS_KODE           */  00010330
            /* **************************************************** */  00010340
  L210:                                                                 00010350
            FEIL_MELD_NR              =   500;                          00010360
            FEIL_VED_LABEL            =  '210';                         00010370
            DB_STATUS_KODE            =   RF3.STATUS_KODE;              00010380
            GO TO     RETUR;                                            00010390
            END;                                                        00010400
        END;                                                            00010410
                                                                        00010420
      ELSE                                                              00010430
        IF RF3.STATUS_KODE                 ^=    'GE'             THEN  00010440
          DO;                                                           00010450
            /* **************************************************** */  00010460
            /*  UAKSEPTABEL KODE FRA  :   RF3.STATUS_KODE           */  00010470
            /* **************************************************** */  00010480
  L220:                                                                 00010490
            FEIL_MELD_NR              =   500;                          00010500
            FEIL_VED_LABEL            =  '220';                         00010510
            DB_STATUS_KODE            =   RF3.STATUS_KODE;              00010520
            GO TO     RETUR;                                            00010530
          END;                                                          00010540
                                                                        00010550
  RETUR:                                                                00010560
    END P032_FJERN_STATUS;                                              00010570
                                                                        00010580
                                                                        00010590
                                                                        00010600
    %PAGE;                                                              00010610
    /* ************************************************************** */00010620
    /*                                                                */00010630
    /* PROCEDURE FOR Å LESE TILKNYTTNINGENE TIL STATUS-SEGM.          */00010640
    /*                                                                */00010650
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */00010660
    /*                                                                */00010670
    /* ************************************************************** */00010680
                                                                        00010690
    P034_LEST_TILKN_PCB1 :                                              00010700
      PROC           RETURNS (BIT(1));                                  00010710
                                                                        00010720
                                                                        00010730
      DCL   W01_RETUR                            BIT   (1) INIT ('0'B); 00010740
      SSA_UQUAL                             =   'TILKN    ';            00010750
                                                                        00010760
      CALL PLITDLI                              (W001_DLI.PARM_CT_6,    00010770
                                                 W001_DLI.GET,          00010780
                                                 RF1,                   00010790
                                                 W01_TILKN1,            00010800
                                                 SSA1_RF0PERSN,         00010810
                                                 SSA1_STATUS,           00010820
                                                 SSA_UQUAL);            00010830
                                                                        00010840
      IF UIBFCTR                           ^=    UIB_RC_OK        THEN  00010850
         DO;                                                            00010860
            /* ************************************************** */    00010870
            /* UAKSEPTABEL KODE FRA   :      UIB                  */    00010880
            /* ************************************************** */    00010890
  L230:                                                                 00010900
            FEIL_MELD_NR                     =     500;                 00010910
            FEIL_VED_LABEL                   =    '230';                00010920
         END;                                                           00010930
                                                                        00010940
      SELECT  ( RF1.STATUS_KODE   );                                    00010950
                                                                        00010960
         WHEN ('  ' , 'GA' , 'GK' )                                     00010970
            DO;                                                         00010980
             /* ************************************************ */     00010990
             /* LEST INN EN   :   TILKN                          */     00011000
            /* ************************************************* */     00011010
                                                                        00011020
            W01_RETUR                        =    '1'B;                 00011030
         END;                                                           00011040
                                                                        00011050
         WHEN ('GE' , 'GB')                                             00011060
            DO;                                                         00011070
              /* ********************************************* */       00011080
              /* LOVLIG KODE MEN IKKE FUNNET NOEN   : TILKN    */       00011090
              /* ********************************************* */       00011100
                                                                        00011110
              W01_RETUR                        =    '0'B;               00011120
         END;                                                           00011130
                                                                        00011140
         OTHERWISE                                                      00011150
            DO;                                                         00011160
               /* ************************************************* */  00011170
               /* LEST INN EN   :   TILKN                           */  00011180
               /* ************************************************* */  00011190
                                                                        00011200
  L240:                                                                 00011210
               FEIL_MELD_NR                     =     500;              00011220
               FEIL_VED_LABEL                   =    '240';             00011230
               DB_STATUS_KODE                   =     RF1.STATUS_KODE;  00011240
               W01_RETUR                        =     '0'B;             00011250
            END;                                                        00011260
      END;     /*   SELECT (RF1.STATUS_KODE )                   */      00011270
                                                                        00011280
  RETUR:                                                                00011290
      RETURN (W01_RETUR);                                               00011300
    END P034_LEST_TILKN_PCB1;                                           00011310
                                                                        00011320
                                                                        00011330
                                                                        00011340
    %PAGE;                                                              00011350
    /* ************************************************************** */00011360
    /*                                                                */00011370
    /* PROCEDURE FOR Å LESE TILKNYTTNINGENE TIL STATUS-SEGM.          */00011380
    /*                                                                */00011390
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */00011400
    /*                                                                */00011410
    /* ************************************************************** */00011420
                                                                        00011430
    P036_LEST_TILKN_PCB2 :                                              00011440
      PROC           RETURNS (BIT(1));                                  00011450
                                                                        00011460
                                                                        00011470
      DCL   W01_RETUR                            BIT   (1) INIT ('0'B); 00011480
      SSA_UQUAL                             =   'TILKN    ';            00011490
                                                                        00011500
      CALL PLITDLI                              (W001_DLI.PARM_CT_6,    00011510
                                                 W001_DLI.GET,          00011520
                                                 RF2,                   00011530
                                                 W01_TILKN2,            00011540
                                                 SSA2_RF0PERSN,         00011550
                                                 SSA1_STATUS,           00011560
                                                 SSA_UQUAL);            00011570
                                                                        00011580
      IF   UIBFCTR                         ^=    UIB_RC_OK        THEN  00011590
        DO;                                                             00011600
           /* ******************************************************* */00011610
           /* UAKSEPTABEL KODE FRA   :      UIB                       */00011620
           /* ******************************************************* */00011630
  L250:                                                                 00011640
           FEIL_MELD_NR                     =     500;                  00011650
           FEIL_VED_LABEL                   =    '250';                 00011660
        END;                                                            00011670
                                                                        00011680
      SELECT   ( RF2.STATUS_KODE );                                     00011690
         WHEN  ( '  ' , 'GA' , 'GK' )                                   00011700
            DO;                                                         00011710
               /* ************************************************** */ 00011720
               /* LEST INN EN  :    TILKN                            */ 00011730
               /* ************************************************** */ 00011740
                                                                        00011750
               W01_RETUR                        =    '1'B;              00011760
            END;                                                        00011770
                                                                        00011780
         WHEN  ( 'GE' , 'GB' )                                          00011790
            DO;                                                         00011800
               /* ************************************************** */ 00011810
               /* FINNES IKKE  :    TILKN                            */ 00011820
               /* ************************************************** */ 00011830
                                                                        00011840
               W01_RETUR                        =    '0'B;              00011850
            END;                                                        00011860
                                                                        00011870
         OTHERWISE                                                      00011880
            DO;                                                         00011890
               /* ************************************************* */  00011900
               /* UAKSEPTABEL KODE FRA   :      RF1.STATUS_KODE     */  00011910
               /* ************************************************* */  00011920
  L260:                                                                 00011930
               FEIL_MELD_NR                     =     500;              00011940
               FEIL_VED_LABEL                   =    '260';             00011950
               DB_STATUS_KODE                   =     RF2.STATUS_KODE;  00011960
               W01_RETUR                        =    '0'B;              00011970
            END;                                                        00011980
      END;                                                              00011990
                                                                        00012000
  RETUR:                                                                00012010
      RETURN (W01_RETUR);                                               00012020
    END P036_LEST_TILKN_PCB2;                                           00012030
                                                                        00012040
                                                                        00012050
                                                                        00012060
                                                                        00012070
    %PAGE;                                                              00012080
    /* ************************************************************** */00012090
    /*                                                                */00012100
    /* PROCEDURE FOR Å FJERNE  : TILKN                                */00012110
    /*                                                                */00012120
    /* ************************************************************** */00012130
                                                                        00012140
    P037_FLERE_TILKN :                                                  00012150
      PROC  RETURNS          ( BIT (1) );                               00012160
                                                                        00012170
                                                                        00012180
      DCL   W037_RETUR         BIT (1)     INIT ('0'B);                 00012190
                                                                        00012200
                                                                        00012210
      CALL PLITDLI                        (W001_DLI.PARM_CT_6,          00012220
                                           W001_DLI.GHU,                00012230
                                           RF3,                         00012240
                                           W001_IO,                     00012250
                                           SSA3_RF0PERSN,               00012260
                                           SSA1_STATUS,                 00012270
                                           SSA1_TILKN);                 00012280
                                                                        00012290
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK    THEN            00012300
        DO;                                                             00012310
          /* ******************************************** */            00012320
          /* FEIL VED DB                                  */            00012330
          /* ******************************************** */            00012340
  L270:                                                                 00012350
          FEIL_MELD_NR             =       500 ;                        00012360
          FEIL_VED_LABEL           =      '270';                        00012370
          GO   TO  RETUR;                                               00012380
        END;                                                            00012390
                                                                        00012400
                                                                        00012410
      SELECT  ( RF3.STATUS_KODE );                                      00012420
                                                                        00012430
         WHEN ('  ')                                                    00012440
              /* ******************************************** */        00012450
              /* ET ANNET TILKN SEGM FUNNET .                 */        00012460
              /* ******************************************** */        00012470
                                                                        00012480
              W037_RETUR    =   '1'B;                                   00012490
                                                                        00012500
         WHEN ('GE')                                                    00012510
              /* ******************************************** */        00012520
              /* DET FINNES IKKE FLERE TILKNYTTINGS-SEGM.     */        00012530
              /* ******************************************** */        00012540
                                                                        00012550
              W037_RETUR    =   '0'B;                                   00012560
                                                                        00012570
         OTHERWISE                                                      00012580
            DO;                                                         00012590
              /* ******************************************** */        00012600
              /* FEIL VED LES   AV :  TILKN                   */        00012610
              /* ******************************************** */        00012620
  L280:                                                                 00012630
              FEIL_MELD_NR             =       500 ;                    00012640
              FEIL_VED_LABEL           =      '280';                    00012650
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00012660
              GO   TO  RETUR;                                           00012670
            END;                                                        00012680
                                                                        00012690
      END;/*   SELECT                               */                  00012700
                                                                        00012710
                                                                        00012720
  RETUR:                                                                00012730
      RETURN (W037_RETUR);                                              00012740
                                                                        00012750
    END P037_FLERE_TILKN;                                               00012760
                                                                        00012770
                                                                        00012780
                                                                        00012790
                                                                        00012800
    %PAGE;                                                              00012810
    /* ************************************************************** */00012820
    /*                                                                */00012830
    /* PROCEDURE FOR Å FJERNE  : TILKN                                */00012840
    /*                                                                */00012850
    /* ************************************************************** */00012860
                                                                        00012870
    P038_FJERN_TILKN :                                                  00012880
      PROC ;                                                            00012890
                                                                        00012900
                                                                        00012910
      CALL PLITDLI                        (W001_DLI.PARM_CT_6,          00012920
                                           W001_DLI.GHU,                00012930
                                           RF3,                         00012940
                                           W001_IO,                     00012950
                                           SSA3_RF0PERSN,               00012960
                                           SSA1_STATUS,                 00012970
                                           SSA1_TILKN);                 00012980
                                                                        00012990
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK    THEN            00013000
        DO;                                                             00013010
          /* ******************************************** */            00013020
          /* FEIL VED LES   AV :  TILKN                   */            00013030
          /* ******************************************** */            00013040
  L300:                                                                 00013050
          FEIL_MELD_NR             =       500 ;                        00013060
          FEIL_VED_LABEL           =      '300';                        00013070
          GO   TO  RETUR;                                               00013080
        END;                                                            00013090
                                                                        00013100
                                                                        00013110
      SELECT  ( RF3.STATUS_KODE );                                      00013120
                                                                        00013130
         WHEN ('  ')                                                    00013140
            DO;                                                         00013150
              /* ******************************************** */        00013160
              /* TILKN      FUNNET  . SEGMENTET FJERNES .     */        00013170
              /* ******************************************** */        00013180
                                                                        00013190
              CALL PLITDLI                   (W001_DLI.PARM_CT_3,       00013200
                                              W001_DLI.DLET,            00013210
                                              RF3,                      00013220
                                              W001_IO);                 00013230
                                                                        00013240
              IF  DLIUIB.UIBRCODE.UIBFCTR ^=  UIB_RC_OK                 00013250
                ! RF3.STATUS_KODE         ^=  '  '         THEN         00013260
                DO;                                                     00013270
                  /* ******************************************** */    00013280
                  /* FEIL VED DELETE  AV :  TILKN                 */    00013290
                  /* ******************************************** */    00013300
  L310:                                                                 00013310
                  FEIL_MELD_NR             =   500 ;                    00013320
                  FEIL_VED_LABEL           =  '310';                    00013330
                  DB_STATUS_KODE           =   RF3.STATUS_KODE;         00013340
                  GO   TO  RETUR;                                       00013350
                END;                                                    00013360
                                                                        00013370
            END;                                                        00013380
                                                                        00013390
         WHEN ('GE')                                                    00013400
            DO;                                                         00013410
              /* ******************************************** */        00013420
              /* TILKN      IKKE FUNNET   FEIL                */        00013430
              /* ******************************************** */        00013440
  L320:                                                                 00013450
              FEIL_MELD_NR             =       504 ;                    00013460
              FEIL_VED_LABEL           =      '320';                    00013470
              GO   TO  RETUR;                                           00013480
            END;                                                        00013490
                                                                        00013500
         OTHERWISE                                                      00013510
            DO;                                                         00013520
              /* ******************************************** */        00013530
              /* FEIL VED LES   AV :  TILKN                   */        00013540
              /* ******************************************** */        00013550
  L330:                                                                 00013560
              FEIL_MELD_NR             =       500 ;                    00013570
              FEIL_VED_LABEL           =      '330';                    00013580
              DB_STATUS_KODE           =       RF3.STATUS_KODE;         00013590
              GO   TO  RETUR;                                           00013600
            END;                                                        00013610
                                                                        00013620
      END;/*   SELECT                               */                  00013630
                                                                        00013640
                                                                        00013650
  RETUR:                                                                00013660
                                                                        00013670
    END P038_FJERN_TILKN;                                               00013680
                                                                        00013690
                                                                        00013700
  L999:                                                                 00013710
                                                                        00013720
    EXEC CICS RETURN;                                                   00013730
  END  R001550;                                                         00013740
