 /*       SIST ENDRET 25/07-94 13.50.55 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 25/02-94 12.33.09 AV   HERMAN                   */00000010
 /*       SIST ENDRET 26/04-91 11.44.04 AV   DYBVIK                   */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R001UC09  -                                                    */00000040
 /*    PROGRAMMERER:                                                  */00000050
 /*HENSIKT:                                                           */00000060
 /*    R001UC09 INNHOLDER:                                            */00000070
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000080
 /*           FO_TRANS_OMR.                                           */00000090
 /*ENDRING:                                                           */00000100
 /*    PROSEDYRENE ER SKILT UT FRA R001UC02                           */00000110
 /*PROGRAMTILKNYTNING:                                                */00000120
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000130
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000140
 /*    FOLKETRYGDSYSTEMET.                                            */00000150
 /*    ARBEIDSOMRÅDE: P001UC01                                        */00000160
 /*BRUK:                                                              */00000170
 /*    %INCLUDE R001UC09;                                             */00000180
 /*    OVERFØR_FO_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */00000190
 /* ***************************************************************** */00000200
 /*                                                                   */00000210
 /*   PROSEDYRE FOR Å BLANKE MAPEN                                    */00000220
 /*                                                                   */00000230
 /* ***************************************************************** */00000240
 %SKIP;                                                                 00000250
   BLANK_FO_MAP:                                                        00000260
      PROC;                                                             00000270
   DCL                                                                  00000280
     LOW BUILTIN;                                                       00000290
     BT_ANTO      = LOW(2);                                             00000300
     FNR_EKO      = LOW(11);                                            00000310
     TILL_EKO     = ' ';                                                00000320
     PIO          = LOW(7 );                                            00000330
     AIO          = LOW(7 );                                            00000340
     PI_EKO       = LOW(7 );                                            00000350
     AI_EKO       = LOW(7 );                                            00000360
     MINST4GO     = LOW(7 );                                            00000370
                                                                        00000380
     DO A = 1 TO 8;                                                     00000390
       FNR_BARNO(A)   = LOW(11);                                        00000400
       RBT_E0591O(A)        = LOW(1);                                   00000410
       RBT_F0591O(A)        = LOW(1);                                   00000420
     END;                                                               00000430
                                                                        00000440
     MELDING1O    = (78)' ';                                            00000450
     MELDING2O    = (78)' ';                                            00000460
     MELDING3O    = (78)' ';                                            00000470
     MELDING4O    = (78)' ';                                            00000480
     MELDING5O    = (78)' ';                                            00000490
     MELDING6O    = (78)' ';                                            00000500
   END BLANK_FO_MAP;                                                    00000510
 %PAGE;                                /*   */                          00000520
 /* ***************************************************************** */00000530
 /*                                                                   */00000540
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000550
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL FO_TRANS_OMR I              */00000560
 /*   KOM_OMR FOR FO_SØKER.                                           */00000570
 /*           MAPSET:  S001123   MAP S001121                          */00000580
 /*                                                                   */00000590
 /* ***************************************************************** */00000600
 %SKIP;                                                                 00000610
                                                                        00000620
 OVERFØR_FO_SØKER:                                                      00000630
   PROC;                                                                00000640
      IF REGDATOL > 0 THEN                                              00000650
           FOS.REGDATO = F_FELT_CHAR_PIC6 (REGDATOI);                   00000660
      IF TERMIDL  > 0 THEN                                              00000670
           FOS.TERMID  = TERMIDI;                                       00000680
      IF FNRL > 0 THEN                                                  00000690
           FOS.FNR = F_FELT_CHAR_PIC11 (FNRI);                          00000700
      IF TKNRL > 0 THEN                                                 00000710
           FOS.TKNR = F_FELT_CHAR_PIC4 (TKNRI);                         00000720
      IF TILL_EKL > 0 THEN                                              00000730
           FOS.TILL_EK = TILL_EKI;                                      00000740
      IF BT_ANTL > 0 THEN                                               00000750
           FOS.BT_ANT = F_FELT_CHAR_PIC2 (BT_ANTI);                     00000760
      IF VIRK_DATO_MÅL > 0 THEN                                         00000770
           FOS.VIRK_DATO_MÅ = F_FELT_CHAR_PIC4 (VIRK_DATO_MÅI);         00000780
      IF FNR_EKL > 0 THEN                                               00000790
           FOS.FNR_EK = F_FELT_CHAR_PIC11 (FNR_EKI);                    00000800
      IF MINST4GL > 0 THEN                                              00000810
           FOS.MINST_4G = MINST4GI;                                     00000820
                                                                        00000830
   END OVERFØR_FO_SØKER;                                                00000840
 /***  ********************************* ***/                           00000850
 /*    SISTE 2 LINJE                       */                           00000860
 /******************************************/                           00000870
 OVERFØR_FO_SØKER2:                                                     00000880
   PROC;                                                                00000890
                                                                        00000900
      IF PIL         > 0 THEN                                           00000910
           FOS.PENSJONSINNTEKT = PII;                                   00000920
      IF AIL         > 0 THEN                                           00000930
           FOS.ARBEIDSINNTEKT = AII;                                    00000940
      IF PI_EKL      > 0 THEN                                           00000950
           FOS.PENSJONSINNTEKT_EK = PI_EKI;                             00000960
      IF AI_EKL      > 0 THEN                                           00000970
           FOS.ARBEIDSINNTEKT_EK = AI_EKI;                              00000980
   END OVERFØR_FO_SØKER2;                                               00000990
