 /*       SIST ENDRET 06/09-90 14.31.08 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 05/07-90 09.24.12 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014580 - PROSEDYRE I PLI                                     */00000040
 /*    PROGRAMMERER: TRUDE SPONBERG MARS 1990                         */00000050
 /*HENSIKT:                                                           */00000060
 /*    BEREGNE GRUNNPENSJON ETTERLATT-UFØR  BOSATT UTLAND             */00000070
 /*PROGRAMTILKNYTNING:                                                */00000080
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTEPEN-  */00000090
 /*    SJONSBEREGNINGEN                                               */00000100
 /*    INCLUDES I R0014501                                            */00000110
 /*BRUK:                                                              */00000120
 /*    CALL BEREGN_GP_ETTERLATT_UP_UTLAND;                            */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
                                                                        00000160
 /*------------------------------------------------------------------*/ 00000170
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00000180
 /* GRUNNPENSJON. BEREGNINGSREGLENES PUNKT 6.1.1.2 . TRUDE, 21.03.90 */ 00000190
 /*------------------------------------------------------------------*/ 00000200
                                                                        00000210
 BEREGN_GP_ETTERLATT_UP_UTLAND:                                         00000220
   PROC;                                                                00000230
 %SKIP(2);                                                              00000240
                                                                        00000250
 DCL HJ_DATO                     PIC'(6)9';                             00000260
 DCL HJ_DATO_ÅR DEF HJ_DATO POS(1) PIC '99';                            00000270
                                                                        00000280
                                                                        00000290
  DCL BOTID_EGEN   FIXED DEC (3) INIT(0),                               00000300
      BOTID_EK     FIXED DEC (3) INIT(0);                               00000310
                                                                        00000320
  DCL FAKTISK_BOTID_EGEN   FIXED DEC (3) INIT(0),                       00000330
      FAKTISK_BOTID_EK     FIXED DEC (3) INIT(0);                       00000340
                                                                        00000350
  DCL TT_MED_FREMT_ÅR_EGEN  FIXED DEC (3) INIT(0),                      00000360
      TT_MED_FREMT_ÅR_EK    FIXED DEC (3) INIT(0);                      00000370
                                                                        00000380
  DCL TT_ANV_GP    FIXED DEC (3) INIT(0);                               00000390
                                                                        00000400
  DCL GRUNNPENSJON  FIXED DEC (11,4) INIT(0);                           00000410
                                                                        00000420
  HJ_DATO = B02.DØDSDATO_ÅMD(BER_EK_IND);                               00000430
                                                                        00000440
  IF HJ_DATO_ÅR - FNR_EK_R.ÅR_EK > 66 THEN                              00000450
     CALL REGN_TT_67_TIL_70_DØD;                                        00000460
                                                                        00000470
  BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                          00000480
                 B02.TT_FRAMT_VED_FRAVIK_10_1(BER_SØ_IND) +             00000490
                 B02.TT_FRAMT_DØD(BER_SØ_IND) +                         00000500
                ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);            00000510
                                                                        00000520
  IF BOTID_EGEN > 40   THEN                                             00000530
     BOTID_EGEN = 40;                                                   00000540
                                                                        00000550
                                                                        00000560
  TT_MED_FREMT_ÅR_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                  00000570
                       ((B02.TT_ETTER_1966(BER_SØ_IND) +                00000580
                         B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);          00000590
                                                                        00000600
                                                                        00000610
  TT_MED_FREMT_ÅR_EK   = B02.TT_FØR_1967(BER_EK_IND) +                  00000620
                         B02.TT_67_TIL_70(BER_EK_IND) +                 00000630
                       ((B02.TT_ETTER_1966(BER_EK_IND) +                00000640
                         B02.TT_FRAMT(BER_EK_IND) + 11) / 12);          00000650
                                                                        00000660
  IF TT_MED_FREMT_ÅR_EGEN > 40  THEN                                    00000670
     TT_MED_FREMT_ÅR_EGEN = 40 ;                                        00000680
                                                                        00000690
  IF TT_MED_FREMT_ÅR_EK   > 40  THEN                                    00000700
     TT_MED_FREMT_ÅR_EK   = 40 ;                                        00000710
                                                                        00000720
  FAKTISK_BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                  00000730
                       ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);     00000740
  FAKTISK_BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                  00000750
                       ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);     00000760
                                                                        00000770
  IF FAKTISK_BOTID_EGEN > 40 THEN                                       00000780
     FAKTISK_BOTID_EGEN = 40;                                           00000790
                                                                        00000800
  IF FAKTISK_BOTID_EK   > 40 THEN                                       00000810
     FAKTISK_BOTID_EK   = 40;                                           00000820
                                                                        00000830
 /*IF TT_MED_FREMT_ÅR_EK    > 20  !      **** SKAL VÆRE 20 ÅRS BOTID */ 00000840
 /*  TT_MED_FREMT_ÅR_EGEN  > 20  THEN     ** TRUDE,060990           */  00000850
   IF FAKTISK_BOTID_EGEN    > 20  !                                     00000860
      FAKTISK_BOTID_EK     > 20  THEN                                   00000870
      DO;                                                               00000880
         IF TT_MED_FREMT_ÅR_EGEN > TT_MED_FREMT_ÅR_EK THEN              00000890
            TT_ANV_GP  = TT_MED_FREMT_ÅR_EGEN;                          00000900
         ELSE                                                           00000910
            TT_ANV_GP  = TT_MED_FREMT_ÅR_EK;                            00000920
                                                                        00000930
         B02.TT_ANV(BER_EK_IND) = TT_MED_FREMT_ÅR_EK; /*TRUDE,240890*/  00000940
         GO TO L100;                                                    00000950
      END;                                                              00000960
                                                                        00000970
  BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                          00000980
                ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);            00000990
                                                                        00001000
  IF BOTID_EK   > 40   THEN                                             00001010
     BOTID_EK   = 40;                                                   00001020
                                                                        00001030
  IF (B02.TRYGDET_DØD(BER_SØ_IND)    = 'J' !                            00001040
      B02.TRYGDET_DØD(BER_EK_IND)    = 'J')  &                          00001050
     (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND)    = 'J' !                        00001060
      B02.TRYGDET_3ÅR_DØD(BER_EK_IND)    = 'J') THEN                    00001070
   DO;                                                                  00001080
                                                                        00001090
      /*PUNKT 1.1 MINST 20 ÅR BOTID , SAMME REGLER SOM BOSATT(6.1.1.1)*/00001100
                                                                        00001110
      /* PUNKT 1.2 :  */                                                00001120
                                                                        00001130
                                                                        00001140
      IF  (BOTID_EGEN              >  9  &                              00001150
           BOTID_EGEN              < 20 ) !                             00001160
          (BOTID_EK                >  9  &                              00001170
           BOTID_EK                < 20 )  THEN                         00001180
         DO;                                                            00001190
            IF BOTID_EGEN          >=  BOTID_EK  THEN                   00001200
               TT_ANV_GP           =   BOTID_EGEN;                      00001210
            ELSE                                                        00001220
               TT_ANV_GP           = BOTID_EK  ;                        00001230
         B02.TT_ANV(BER_EK_IND) = BOTID_EK; /*TRUDE,240890*/            00001240
         END;                                                           00001250
   END;                                                                 00001260
                                                      /*PUNKT 2: */     00001270
                                                                        00001280
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001290
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                        00001300
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001310
       B02.TRYGDET_DØD(BER_EK_IND)      = 'J' ) THEN                    00001320
     DO;                                                                00001330
        IF FAKTISK_BOTID_EGEN > FAKTISK_BOTID_EK  THEN                  00001340
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001350
        ELSE                                                            00001360
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001370
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/     00001380
     END;                                                               00001390
                                                                        00001400
                                                       /*PUNKT 3: */    00001410
                                                                        00001420
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001430
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                        00001440
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001450
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                    00001460
     DO;                                                                00001470
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                 00001480
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001490
        ELSE                                                            00001500
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001510
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/     00001520
     END;                                                               00001530
                                                                        00001540
                                                                        00001550
                                                        /*PUNKT 4: */   00001560
                                                                        00001570
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001580
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) = 'J') !                         00001590
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001600
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                    00001610
     DO;                                                                00001620
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                 00001630
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001640
        ELSE                                                            00001650
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001660
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/     00001670
     END;                                                               00001680
                                                                        00001690
                                                                        00001700
                                              /*6.1.1.4 KONVENSJON   */ 00001710
                                                                        00001720
  IF B02.KONVENSJON(BER_SØ_IND) = 'J' THEN   /* DEN STØRSTE TT ??? */   00001730
   DO;                                                                  00001740
     IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                    00001750
        TT_ANV_GP          = FAKTISK_BOTID_EGEN;                        00001760
     ELSE                                                               00001770
        TT_ANV_GP          = FAKTISK_BOTID_EK  ;                        00001780
     B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/        00001790
   END;                                                                 00001800
                                                     /* PUNKT 1.3 :  */ 00001810
                                                                        00001820
 /*IF B02.ETTEPENS.PÅ_AVD (BER_SØ_IND)  >  BOTID_EK    THEN             00001830
                    TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND); ? */   00001840
                                                                        00001850
   IF B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) > 0   THEN                     00001860
     DO;                                                                00001870
       IF TT_ANV_GP < B02.ETTEPENS.PÅ_AVD(BER_SØ_IND) THEN              00001880
          TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);                  00001890
     B02.TT_ANV(BER_EK_IND) = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);          00001900
     END;                                                               00001910
 L100:                                                                  00001920
  IF  TT_ANV_GP  >  3  !                                                00001930
     (TT_ANV_GP  <  3  &                                                00001940
      B02.KONVENSJON(BER_SØ_IND)  = 'J') THEN                           00001950
          DO;                                                           00001960
            GP_UP                     = G * TT_ANV_GP / 40;             00001970
            GP_UP                     = (GRUNNPENSJON / 12) + 0.5;      00001980
            GP_UP                     = GRUNNPENSJON;                   00001990
            B02.TT_ANV(BER_SØ_IND)             = TT_ANV_GP;             00002000
          END;                                                          00002010
  ELSE                                                                  00002020
            GP_UP = 0;                                                  00002030
                                                                        00002040
 /*YS*/ IF B02.YRKEPENS.YUG(BER_SØ_IND) > 0 THEN                        00002050
                                                                        00002060
 /*YS*/    DO;                                                          00002070
 /*YS*/       GP_UP      = G * UFGRAD * B02.TT_ANV(BER_SØ_IND) /        00002080
 /*YS*/                    (100 * 40 * 12) + 0.5;                       00002090
 /*YS*/                                                                 00002100
 /*YS*/       GP_YP      = G * B02.YRKEPENS.YUG(BER_SØ_IND) /           00002110
 /*YS*/                    (12 * 100 ) + 0.5;                           00002120
 /*YS*/                                                                 00002130
 /*YS*/       GP_EGEN    = GP_UP + GP_YP;                               00002140
 /*YS*/                                                                 00002150
 /*YS*/    END;                                                         00002160
 /*YS*/                                                                 00002170
 /*YS*/ ELSE                                                            00002180
 /*YS*/   DO;                                                           00002190
 /*YS*/     GP_EGEN = G * B02.UFØRPENS.UFG(BER_SØ_IND) *                00002200
 /*YS*/               B02.TT_ANV(BER_SØ_IND) / (100 * 40 * 12) + 0.5;   00002210
                                                                        00002220
 /*YS*/     GP_UP = GP_EGEN;                                            00002230
 /*YS*/   END;                                                          00002240
  /*  ********    IF TT_ANV_UP   > TT_ANV_AVD THEN                      00002250
                     TT_ANV_EP   = TT_ANV_UP;                           00002260
                                                                        00002270
                  ELSE                                                  00002280
                                                                        00002290
                  TT_ANV_EP   = TT_ANV_AVD;  *************** */         00002300
                                                                        00002310
 /*YS*/ IF B02.YRKEPENS.YUG(BER_EK_IND) > 0 THEN                        00002320
 /* BYTTER UT TT_ANV_EP MED B02.TT_ANV .PENSJON UTL. TRUDE   */         00002330
 /*YS*/    GP_EP = G * B02.TT_ANV(BER_SØ_IND) *                         00002340
 /*YS*/                (100 - B02.YRKEPENS.YUG(BER_EK_IND))             00002350
 /*YS*/                / (40 * 12 * 100)                  +             00002360
 /*YS*/                G * B02.YRKEPENS.YUG(BER_EK_IND)                 00002370
 /*YS*/                / (12 * 100) + 0.5;                              00002380
 /*YS*/                                                                 00002390
 /*YS*/ ELSE                                                            00002400
                                                                        00002410
 /*YS*/    GP_EP = G * B02.TT_ANV(BER_SØ_IND) / (40 * 12) + 0.5;        00002420
  /* END;    ??? TRUDE 050990  */                                       00002430
                                                                        00002440
  IF B02.IKKE_GP(BER_SØ_IND)  = 'J' THEN                                00002450
    DO;                                                                 00002460
     GP_EP   = 0 ;                                                      00002470
     GP_UP   = 0 ;                                                      00002480
     GP_EGEN = 0 ;                                                      00002490
    END;                                                                00002500
                                                                        00002510
 /*------------------------------------------------------------------*/ 00002520
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00002530
 /* TIL HIT. TRUDE                                                   */ 00002540
 /*------------------------------------------------------------------*/ 00002550
                                                                        00002560
   END BEREGN_GP_ETTERLATT_UP_UTLAND;                                   00002570
