 /*       SIST ENDRET 05/12-97 12.30.22 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 10.59.53 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/07-97 12.35.08 AV   HLA7339                  */00000020
 /*       SIST ENDRET 12/08-96 15.05.51 AV   TSB0310                  */00000030
 /*       SIST ENDRET 18/04-96 08.34.54 AV   JDA0310                  */00000040
 /*       SIST ENDRET 08/08-95 09.08.17 AV   JDA0310                  */00000050
 /*       SIST ENDRET 18/10-94 15.12.43 AV   JDA0310                  */00000060
 /*       SIST ENDRET 28/09-94 12.26.03 AV   JDA0310                  */00000070
 /*       SIST ENDRET 05/01-94 12.54.25 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 06/05-93 13.14.18 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 25/09-92 12.15.41 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 23/04-92 09.41.21 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 30/01-92 09.51.41 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 18/12-91 16.20.26 AV   HERMAN                   */00000130
 /*       SIST ENDRET 13/12-91 12.34.38 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 10/10-91 13.56.07 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 27/09-91 11.06.39 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 11/07-91 14.22.18 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 26/04-91 11.47.09 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 08/04-91 12.06.11 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 04/09-90 12.53.04 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 11/04-90 12.00.42 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 19/03-90 10.41.14 AV   HERMAN                   */00000220
 /*       SIST ENDRET 18/01-90 12.01.01 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 19/10-89 08.41.40 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 16/10-89 12.44.26 AV   DYBVIK                   */00000250
 /*       SIST ENDRET 22/05-89 14.15.40 AV   DYBVIK                   */00000260
 /*       SIST ENDRET 14/04-89 13.39.54 AV   HERMAN                   */00000270
 /*       SIST ENDRET 29/03-88 13.12.09 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 24/03-87 11.46.32 AV   DYBVIK                   */00000290
 /*       SIST ENDRET 11/07-85 14.01.29 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 08/07-85 09.54.04 AV   DYBVIK                   */00000310
 /*       SIST ENDRET 04/03-85 12.29.24 AV   OLAV                     */00000320
 /*       SIST ENDRET 01/03-85 14.33.03 AV   OLAV                     */00000330
 /*       SIST ENDRET 11/10-84 15.03.05 AV   FARVIK                   */00000340
 /*       SIST ENDRET 09/10-84 08.46.20 AV   DYBVIK                   */00000350
  /* *************************************************************** */ 00000360
  /* IDENTIFIKASJON:   R0017031                                      */ 00000370
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */ 00000380
  /* HENSIKT:                                                        */ 00000390
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */ 00000400
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */ 00000410
  /*        HVER AJOURFØRT TRANSAKSJON.                              */ 00000420
  /* PROGRAMTILKNYTNING:                                             */ 00000430
  /*        PROGRAMMET INKLUDERES I  R0017001                        */ 00000440
  /*                                                                 */ 00000450
  /* *************************************************************** */ 00000460
  LAG_ALDERSP_HEND:                                                     00000470
      PROC (AP_IND,AE_IND);                                             00000480
                                                                        00000490
  EXEC CICS ADDRESS EIB(DFHEIPTR);                                      00000500
                                                                        00000510
 DCL  AP_IND                                FIXED BIN(15);              00000520
                                                                        00000530
 DCL  AE_IND                                FIXED BIN(15);              00000540
                                                                        00000550
 DCL  W_BARN_IND                            FIXED BIN (15);   /*HL*/    00000560
 DCL  W_BER_SØ_IND                          FIXED BIN(15);              00000570
                                                                        00000580
 DCL  AALDER                                FIXED DEC (5);              00000590
                                                                        00000600
 DCL F_NUMMER                               PIC '99999999999';          00000610
                                                                        00000620
 DCL FNR_ÅM DEF F_NUMMER POS (3)            PIC '9999';                 00000630
                                                                        00000640
 DCL  FYLL_70_ÅM                            PIC '9999';                 00000650
                                                                        00000660
 DCL FYLL_70_ÅR  DEF FYLL_70_ÅM POS (1)     PIC '99';                   00000670
                                                                        00000680
 DCL FYLL_70_MND DEF FYLL_70_ÅM POS (3)     PIC '99';                   00000690
                                                                        00000700
 DCL  FYLL_67_ÅM                            PIC '9999';                 00000710
                                                                        00000720
 DCL FYLL_67_ÅR  DEF FYLL_67_ÅM POS (1)     PIC '99';                   00000730
                                                                        00000740
 DCL FYLL_67_MND DEF FYLL_67_ÅM POS (3)     PIC '99';                   00000750
                                                                        00000760
 DCL MAX_ÅM                                 PIC '9999';                 00000770
                                                                        00000780
 DCL MAX_MND DEF MAX_ÅM            POS (3)  PIC '99';                   00000790
                                                                        00000800
 DCL MAX_ÅR  DEF MAX_ÅM            POS (1)  PIC '99';                   00000810
                                                                        00000820
 DCL MIN_ÅM                                 PIC '9999';                 00000830
                                                                        00000840
 DCL MIN_MND DEF MIN_ÅM            POS (3)  PIC '99';                   00000850
                                                                        00000860
 DCL MIN_ÅR  DEF MIN_ÅM            POS (1)  PIC '99';                   00000870
                                                                        00000880
 DCL MND                                    PIC '9999';                 00000890
                                                                        00000900
 DCL                                                                    00000910
    W_TAI               FIXED DEC (7),                                  00000920
    W_BRP               FIXED DEC (7,2),                                00000930
    W_APD               FIXED DEC (7,3),                                00000940
    W_FAI_MAX           FIXED DEC (7),                                  00000950
    W_FAI_MAX_FRAVIK    FIXED DEC (7);                                  00000960
                                                                        00000970
  /* *************************************************************** */ 00000980
  /*   PROGRAMMET BEGYNNER HER. VI BLANKER W_HENDELSE.               */ 00000990
  /* *************************************************************** */ 00001000
                                                                        00001010
                                                                        00001020
    W_HENDELSE              =  '';                                      00001030
    OMR_DATO                = F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO); 00001040
    /* AALDER                = F_ALDER(TRANS_OPPL_OMR.FØDSNUMMER,       00001050
                                      TRANS_OPPL_OMR.VIRKNINGSDATO); */ 00001060
    AALDER                = F_ALDER((B02.FNR(AP_IND)),                  00001070
                                      TRANS_OPPL_OMR.VIRKNINGSDATO);    00001080
    W_APD                   = B02.ALDERSP.APD(AP_IND);                  00001090
                                                                        00001100
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                               00001110
       DO;                                                              00001120
          HENDDATO  =  OMR_DATO;                                        00001130
       END;                                                             00001140
    ELSE                                                                00001150
       DO;                                                              00001160
          IF DIV_PERIODE.INTENDR_ÅM > 0    THEN                         00001170
             HENDDATO     = DIV_PERIODE.INTENDR_ÅM;                     00001180
          ELSE                                                          00001190
             DO;                                                        00001200
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅM(AP_IND); 00001210
                HENDDATO     =  R_HENDDATO.AAR!!R_HENDDATO.MND;         00001220
             END;                                                       00001230
       END;                                                             00001240
                                                                        00001250
                                                                        00001260
  /* *************************************************************** */ 00001270
  /* ANTALL MÅNEDER VENTET PÅ ALDERSPENSJON                          */ 00001280
  /* *************************************************************** */ 00001290
                                                                        00001300
  /* *************************************************************** */ 00001310
  /*   VI SKRIVER BARE UT VENTEMÅNEDER NÅR DET TAS UT 100%           */ 00001320
  /* *************************************************************** */ 00001330
                                                                        00001340
   MND                       = 0;                                       00001350
   MAX_ÅM                    = 0;                                       00001360
   MIN_ÅM                    = 0;                                       00001370
                                                                        00001380
   IF B02.ALDERSP.APD (AP_IND) = 100  THEN                              00001390
     DO;                                                                00001400
       F_NUMMER                  = B02.FNR(AP_IND);                     00001410
       FYLL_67_ÅM                = F_SNU_DATO(FNR_ÅM) + 6700;           00001420
       IF FYLL_67_ÅM < 7301 THEN                                        00001430
          FYLL_67_ÅM = 7301;                                            00001440
       FYLL_70_ÅM                = F_SNU_DATO(FNR_ÅM) + 7000;           00001450
       IF FYLL_70_ÅM < 7301 THEN                                        00001460
          FYLL_70_ÅM = 7301;                                            00001470
                                                                        00001480
       IF B02.UTTAKSDATO_ÅM(AP_IND) > FYLL_70_ÅM THEN                   00001490
          DO;                                                           00001500
    /* HL 9.7.84 */   IF FYLL_70_ÅM > 8404          THEN                00001510
                         MAX_ÅM   = 8404;                               00001520
                      ELSE                                              00001530
                         MAX_ÅM   = FYLL_70_ÅM;                         00001540
    /* HL -  HIT */   MIN_ÅM   = FYLL_67_ÅM;                            00001550
                      MND      = (MAX_ÅR * 12 + MAX_MND)                00001560
                            - (MIN_ÅR * 12 + MIN_MND);                  00001570
          END;                                                          00001580
       ELSE                                                             00001590
                                                                        00001600
  /* *************************************************************** */ 00001610
  /* LOVENDRING - VENTETILLEGGET FALLER BORT 01.04.84                */ 00001620
  /* *************************************************************** */ 00001630
                                                                        00001640
       IF FYLL_67_ÅM < 8404 THEN                                        00001650
          DO;                                                           00001660
                                                                        00001670
  /* *************************************************************** */ 00001680
  /* FRA 67 ÅR TIL FØRSTE UTTAKSDATO                                 */ 00001690
  /* *************************************************************** */ 00001700
                                                                        00001710
              MAX_ÅM   = B02.UTTAKSDATO_ÅM(AP_IND);                     00001720
              MIN_ÅM   = FYLL_67_ÅM;                                    00001730
              IF MAX_ÅM > 8404 THEN                                     00001740
                 MAX_ÅM = 8404;                                         00001750
              IF MIN_ÅM > 8404 THEN                                     00001760
                 MIN_ÅM = 8404;                                         00001770
              MND      = (MAX_ÅR * 12 + MAX_MND)                        00001780
                       - (MIN_ÅR * 12 + MIN_MND);                       00001790
                                                                        00001800
  /* *************************************************************** */ 00001810
  /* VIDERE FRA FØRSTE UTTAKSDATO                                    */ 00001820
  /* *************************************************************** */ 00001830
                                                                        00001840
                  IF B02.UTTAKS_APD(AP_IND) < 100 THEN                  00001850
                     MIN_ÅM = B02.UTTAKSDATO_ÅM(AP_IND);                00001860
                  ELSE                                                  00001870
                     MIN_ÅM = 0;                                        00001880
                  IF MIN_ÅM > 8404 THEN                                 00001890
                     MIN_ÅM = 8404;                                     00001900
                                                                        00001910
  /* *************************************************************** */ 00001920
  /* VENTEMÅNEDER REGNES FREM TIL HVER VENTEPERIODE                  */ 00001930
  /* *************************************************************** */ 00001940
                                                                        00001950
                  DO I = 1 TO 5 WHILE (B02.UTTAKSDATO_ÅM_ØVRIGE         00001960
                                    (AP_IND,I) > 0);                    00001970
                        IF MIN_ÅM > 0  THEN                             00001980
                           DO;                                          00001990
                                                                        00002000
                              MAX_ÅM = B02.UTTAKSDATO_ÅM_ØVRIGE         00002010
                                                         (AP_IND,I);    00002020
                              IF MAX_ÅM > 8404 THEN                     00002030
                                 MAX_ÅM = 8404;                         00002040
                              MND      = (MAX_ÅR * 12 + MAX_MND)        00002050
                                        - (MIN_ÅR * 12 + MIN_MND)       00002060
                                        + MND;                          00002070
                           END;                                         00002080
                                                                        00002090
                         IF B02.APD_ØVRIGE(AP_IND,I) < 100 THEN         00002100
                            MIN_ÅM = B02.UTTAKSDATO_ÅM_ØVRIGE(AP_IND,I);00002110
                         ELSE                                           00002120
                            MIN_ÅM = 0;                                 00002130
                   END;                                                 00002140
         END;                                                           00002150
     END;                                                               00002160
                                                                        00002170
   W_HENDELSE.ANTALL_MND_VENTET  =  MND;                                00002180
   IF W_HENDELSE.ANTALL_MND_VENTET  > 36 THEN                           00002190
      W_HENDELSE.ANTALL_MND_VENTET  = 36;                               00002200
                                                                        00002210
    W_HENDELSE.VERSJON     =  W_ROT.NESTE_SB_VERSJON_NR;                00002220
    W_HENDELSE.TERMINAL    =  EIBTRMID;                                 00002230
              /* J.D 26.1.87 */                                         00002240
    IF TRANS_OPPL_OMR.TRANSTYPE = 21 THEN                               00002250
       DO;                                                              00002260
         W_HENDELSE.FNR_EKTEF   =  0;                                   00002270
         W_HENDELSE.NAVN_EKTEF  =  ' ';                                 00002280
       END;                                                             00002290
    ELSE                                                                00002300
       DO;                                                              00002310
         W_HENDELSE.FNR_EKTEF   = B02.RF0PERSN.FNR(AE_IND);             00002320
         W_HENDELSE.NAVN_EKTEF  = B02.RF0PERSN.NAVN(AE_IND);            00002330
       END;                                                             00002340
              /* J.D 26.1.87 HIT */                                     00002350
    W_HENDELSE.PENSJONSTYPE1 =  B02.STATUS.PENSJONSTYPE1(AP_IND);       00002360
    W_HENDELSE.PENSJONSTYPE2 =  B02.STATUS.PENSJONSTYPE2(AP_IND);       00002370
    W_HENDELSE.PENSJONSTYPE3 =  B02.STATUS.PENSJONSTYPE3(AP_IND);       00002380
    W_HENDELSE.PENSJONSTYPE1_EK =  B02.STATUS.PENSJONSTYPE1(AE_IND);    00002390
    W_HENDELSE.PENSJONSTYPE2_EK =  B02.STATUS.PENSJONSTYPE2(AE_IND);    00002400
    W_HENDELSE.PENSJONSTYPE3_EK =  B02.STATUS.PENSJONSTYPE3(AE_IND);    00002410
    W_HENDELSE.SIVILSTAND_EK =  B02.STATUS.SIVILSTAND(AE_IND);          00002420
    W_HENDELSE.GP_BRUTTO   =  B02.PERSON.ALDERSP.GP(AP_IND);            00002430
  /*W_HENDELSE.GP_NETTO    =  B02.PERSON.ALDERSP.GP(AP_IND);   */       00002440
    W_HENDELSE.TP_BRUTTO   =  B02.PERSON.ALDERSP.TP(AP_IND);            00002450
  /*W_HENDELSE.TP_NETTO    =  B02.PERSON.ALDERSP.TP(AP_IND);*/          00002460
    W_HENDELSE.ST          =  B02.PERSON.ALDERSP.ST(AP_IND);            00002470
    W_HENDELSE.KT          =  B02.PERSON.ALDERSP.KT(AP_IND);            00002480
    W_HENDELSE.ET          =  B02.PERSON.ALDERSP.ET(AP_IND);            00002490
    W_HENDELSE.AFP_TILLEGG =  B02.PERSON.ALDERSP.AFP_TILLEGG(AP_IND);   00002500
    W_HENDELSE.BT          =  B02.PERSON.ALDERSP.BT(AP_IND);            00002510
    W_HENDELSE.BT_SÆRBARN  =  B02.PERSON.FORSI.BT_SÆRBARN(AP_IND);      00002520
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(AP_IND);   00002530
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(AP_IND);     00002540
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(AP_IND);   00002550
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(AP_IND); 00002560
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(AP_IND);00002570
                                                                        00002580
    /* ******NESTE STATEMENT MÅ INNEHOLDE FEIL INDEX                    00002590
    W_HENDELSE.FOLKETRYGD_EK = DIV_PARAM_OMR.FOLKETRYGD(EKTEF_IND);     00002600
      ERSTATTES MED NESTE    , TRUDE 290192 ****** */                   00002610
                                                                        00002620
    W_HENDELSE.FOLKETRYGD_EK = DIV_PARAM_OMR.FOLKETRYGD(AE_IND);        00002630
    W_HENDELSE.FOLKETRYGD    = DIV_PARAM_OMR.FOLKETRYGD(AP_IND);        00002640
                                    /* HIT TRUDE */                     00002650
    W_HENDELSE.TEI   = DIV_PARAM_OMR.TAI(AP_IND) / 1000;         /*92*/ 00002660
                                                                        00002670
 /* NESTE LINJE ER ERSTATTET MED EN TEST.  HL 1294 */                   00002680
 /* RETTET TILBAKE 120896. TRUDE                   */                   00002690
 /* SELV OM IKKE TP ETTER AVDØDE, SKAL ETTERLATTE MODELL KUNNE */       00002700
 /* BRUKES. TELF. MED ANNA RIBE. SIVISTATUS SOM AVGJØR.        */       00002710
                                                                        00002720
    W_HENDELSE.BEREGN_ALT_AEY = DIV_PARAM_OMR.AP_KODE_AEY(AP_IND);      00002730
  /*IF B02.ETTEPENS.TP_BRUTTO(AP_IND) > 0        THEN                   00002740
       W_HENDELSE.BEREGN_ALT_AEY = 'E';                                 00002750
    ** HIT TRUDE 120896*/                                               00002760
                                                                        00002770
    /* B02.ALDERSP.ST(AP_IND) > 0 THEN*//*TS 05093*/                    00002780
           W_HENDELSE.FULLT_SÆRTILLEGG  =                               00002790
                DIV_PARAM_OMR.FULLT_SÆRTILLEGG(AP_IND);                 00002800
                                                                        00002810
    IF B02.ALDERSP.ST(AP_IND) >                                         00002820
               DIV_PARAM_OMR.FULLT_SÆRTILLEGG(AP_IND) THEN              00002830
           W_HENDELSE.FULLT_SÆRTILLEGG  =  0; /*050593 TS*/             00002840
                                                                        00002850
                                                                        00002860
    W_HENDELSE.TP_GAR_KODE =  B02.PERSON.TP_GAR_KODE(AP_IND);           00002870
    W_HENDELSE.ANTALL_BARN =  B02.PERSON.STATUS.ANTALL_BARN(AP_IND);    00002880
    W_HENDELSE.ANTALL_BARN_TIDL                                         00002890
                           =  B01.PERSON.STATUS.ANTALL_BARN(AP_IND);    00002900
    W_HENDELSE.VT_GP       =  B02.PERSON.ALDERSP.VT_GP(AP_IND);         00002910
    IF B02.PERSON.ALDERSP.VT_TP(AP_IND) > 0 THEN                        00002920
       DO;                                                              00002930
          W_HENDELSE.VT_TP  =  B02.PERSON.ALDERSP.VT_TP(AP_IND);        00002940
       END;                                                             00002950
    /* LAGT INN 03.7 1985 J.D */                                        00002960
    IF AALDER < 7000  & B02.ETTEPENS.FORVENTET(AP_IND) = 0 THEN         00002970
       W_HENDELSE.FORVENTET_INNTEKT = B02.ALDERSP.FAI(AP_IND);          00002980
    ELSE                                                                00002990
       W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(AP_IND);   00003000
    /* HIT J.D                */                                        00003010
    W_HENDELSE.FAI         =  B02.PERSON.ALDERSP.FAI(AP_IND);           00003020
    W_HENDELSE.APD         =  B02.PERSON.ALDERSP.APD(AP_IND);           00003030
    /*0697:*/                                                           00003040
    DO M = 1 TO 7 WHILE (B02.UFØRHIST.UFT_ÅM(AP_IND,M) > 0); /*UFF67*/  00003050
      W_HENDELSE.BUP_GARANTI = B02.UFØRHIST.BUP_GARANTI(AP_IND,M);      00003060
    END;         /*END UFF67 JD 01.90 */                                00003070
                                                                        00003080
    W_HENDELSE.REDUSERT_GP_2G = DIV_PARAM_OMR.REDUSERT_GP_2G(AP_IND);   00003090
                                                                        00003100
 /*20.9.89 HL : */                                                      00003110
    W_HENDELSE.GAMMEL_SAMMENSTØTS_REGEL =                               00003120
               B02.PERSON.STATUS.GAMMEL_SAMMENSTØTS_REGEL(AP_IND);      00003130
 /*HIT 20.9.89 HL */                                                    00003140
                                                                        00003150
                                                                        00003160
 /*2.4.91 HL : */                                                       00003170
                                                                        00003180
          IF AP_IND < 3        THEN                                     00003190
             W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.              00003200
                                GARANTITILLEGG_TP(AP_IND);              00003210
                                                                        00003220
                                 /* TRUDE FT0591 FRA HIT */             00003230
      /* HER ER DET FEIL INDEX EKTEF_IND SKAL VÆRE AE_IND*/             00003240
      /* RETTES, 290192 TRUDE                            */             00003250
                                                                        00003260
    IF B02.PENSJONSTYPE1(AE_IND)  =  'F' THEN                           00003270
         DO I = 1 TO 13;                                                00003280
            IF B02.FNR_TILKN(AP_IND,I) =   B02.FNR(AE_IND) THEN         00003290
                DO;                                                     00003300
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(AP_IND,I);    00003310
                   I = 13;                                              00003320
                END;                                                    00003330
         END;                                                           00003340
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(AP_IND); 00003350
    W_HENDELSE.FRIBELØP_FELLESBARN =                                    00003360
                              DIV_PARAM_OMR.FRIBELØP_FELLESBARN(AP_IND);00003370
   W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(AP_IND);00003380
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(AP_IND); 00003390
    W_HENDELSE.GARANTITILLEGG_BARN =                                    00003400
                            B02.FORSI.GARANTITILLEGG_BARN(AP_IND);      00003410
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                 00003420
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(AP_IND);       00003430
                                /* FT 0591 TIL HIT */                   00003440
                                                                        00003450
  /* *************************************************************** */ 00003460
  /* NY LOV 0192     JD 11.91                                        */ 00003470
  /* *************************************************************** */ 00003480
                                                                        00003490
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(AP_IND);              00003500
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(AP_IND);  00003510
    W_HENDELSE.GARANTI_DATO_ÅM  = B02.STATUS.GARANTI_DATO_ÅM(AP_IND);   00003520
    W_HENDELSE.AP_TP_NETTO      = B02.ALDERSP.AP_TP_NETTO   (AP_IND);   00003530
    W_HENDELSE.AP_GP_NETTO      = B02.ALDERSP.AP_GP_NETTO   (AP_IND);   00003540
    W_HENDELSE.SPT_1291         = B02.ALDERSP.SPT_1291      (AP_IND);   00003550
    W_HENDELSE.OPT_1291         = B02.ALDERSP.OPT_1291      (AP_IND);   00003560
    W_HENDELSE.PÅ_1291         = B02.ALDERSP.PÅ_1291      (AP_IND);     00003570
    W_HENDELSE.PÅ_ETTER91      = B02.ALDERSP.PÅ_ETTER91   (AP_IND);     00003580
    W_HENDELSE.SPT_1291_EK      = B02.ALDERSP.SPT_1291      (AE_IND);   00003590
    W_HENDELSE.OPT_1291_EK      = B02.ALDERSP.OPT_1291      (AE_IND);   00003600
    W_HENDELSE.PÅ_1291_EK      = B02.ALDERSP.PÅ_1291      (AE_IND);     00003610
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ALDERSP.PÅ_ETTER91   (AE_IND);     00003620
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (AP_IND);     00003630
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(AP_IND);  00003640
             /* HIT JD 1191 */                                          00003650
    W_HENDELSE.YRKE_UFG    =  B02.PERSON.YRKEPENS.YUG(AP_IND);   /*YS*/ 00003660
    W_HENDELSE.YRKE_SPT    =  B02.YRKEPENS.SPT(AP_IND);          /*YS*/ 00003670
                                                                        00003680
    IF B02.YRKE_POENG_1291(AP_IND)   >  B02.YRKEPENS.YPT(AP_IND) THEN   00003690
       W_HENDELSE.YRKE_YPT    =  B02.YRKE_POENG_1291(AP_IND);           00003700
    ELSE                                                                00003710
       W_HENDELSE.YRKE_YPT    =  B02.YRKEPENS.YPT(AP_IND);              00003720
                                                                        00003730
    W_HENDELSE.YRKE_PAÅ    =  B02.YRKEHIST.PAÅ(AP_IND,1);       /*YS*/  00003740
    W_HENDELSE.YRKE_AÅI    =  B02.YRKEHIST.AÅI(AP_IND,1);       /*YS*/  00003750
    W_HENDELSE.YRKE_YUFT_ÅM =  B02.YRKEHIST.YUFT_ÅM(AP_IND,1); /*YS*/   00003760
    W_HENDELSE.YRKE_YST_ÅM =  B02.YRKEHIST.YST_ÅM(AP_IND,1);   /*YS*/   00003770
                                                                        00003780
    IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '3'  THEN                  00003790
       DO;                                                              00003800
          W_HENDELSE.ØNSKET_APD = B02.PERSON.ALDERSP.APD(AP_IND);       00003810
       END;                                                             00003820
    ELSE                                                                00003830
       DO;                                                              00003840
          W_HENDELSE.ØNSKET_APD   = 0;                                  00003850
       END;                                                             00003860
                                                                        00003870
  /* *************************************************************** */ 00003880
  /* HENTES FRA BEREGNING                                            */ 00003890
  /* *************************************************************** */ 00003900
                                                                        00003910
    IF AALDER < 7000 THEN                                               00003920
       DO;                                                              00003930
          W_BER_SØ_IND              = BER_SØ_IND;                       00003940
          BER_SØ_IND                = AP_IND;                           00003950
          W_FNR                     = B02.FNR(AP_IND);                  00003960
          CALL TIDLIGERE_ARBEIDSINNTEKT(W_TAI,W_BRP);                   00003970
                                                                        00003980
          IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '1'  THEN            00003990
             DO;                                                        00004000
                CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);                00004010
                CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX_FRAVIK);        00004020
                                                                        00004030
                IF W_FAI_MAX < W_FAI_MAX_FRAVIK   THEN                  00004040
                   W_FAI_MAX = W_FAI_MAX_FRAVIK;                        00004050
             END;                                                       00004060
          ELSE                                                          00004070
             IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '2'  THEN         00004080
                W_FAI_MAX = 0;                                          00004090
             ELSE               /* P67_KODE '3', VIL SI EGET ØNSKE */   00004100
                IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '3'  THEN      00004110
                   DO;                                                  00004120
                      IF W_TAI * 1000 < G * 2 THEN   /* *1000  TRUDE */ 00004130
                         CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX);      00004140
                      ELSE                                              00004150
                         CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);       00004160
                   END;                                                 00004170
                ELSE                                                    00004180
                   CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX);            00004190
          IF B02.ALDERSP.KONV_P_KODE(AP_IND) = 'F' THEN                 00004200
             W_HENDELSE.FAI_MAX      = (G * 1.10)/100;                  00004210
          ELSE                                                          00004220
             W_HENDELSE.FAI_MAX      = W_FAI_MAX/100;                   00004230
                                                                        00004240
          BER_SØ_IND              = W_BER_SØ_IND;                       00004250
       END;                                                             00004260
                                                                        00004270
    W_HENDELSE.TT           = B02.PERSON.STATUS.TT_ANV(AP_IND);         00004280
    W_HENDELSE.TT_EK        = B02.PERSON.STATUS.TT_ANV(AE_IND);         00004290
                                                                        00004300
    W_HENDELSE.PÅ            = B02.ALDERSP.PÅ      (AP_IND);            00004310
    W_HENDELSE.OPT           = B02.ALDERSP.OPT     (AP_IND);            00004320
    W_HENDELSE.SPT           = B02.ALDERSP.SPT     (AP_IND);            00004330
    W_HENDELSE.PÅ_P67        = B02.ALDERSP.VT_PÅ   (AP_IND);            00004340
    W_HENDELSE.OPT_P67       = B02.ALDERSP.VT_OPT  (AP_IND);            00004350
    W_HENDELSE.SPT_P67       = B02.ALDERSP.VT_SPT  (AP_IND);            00004360
    W_HENDELSE.VENTEFAKTOR   = B02.VENTEFAKTOR     (AP_IND);            00004370
    W_HENDELSE.BOSATT        = B02.BOSATT   (AP_IND); /* JD 08.90*/     00004380
                                                                        00004390
    /*T.S.SØRGER FOR AT TP_PROSENT BLIR RIKTIG  */                      00004400
                                                                        00004410
    IF B02.STATUS.SIVILSTAND(AP_IND) = 'E'  THEN                        00004420
       W_HENDELSE.TP_PROSENT    = 55;                                   00004430
    ELSE                                                                00004440
       W_HENDELSE.TP_PROSENT    = B02.ETTEPENS.TP_PROSENT(AP_IND);      00004450
                                                                        00004460
                                                                        00004470
                                                                        00004480
 /*TILLEGG 16.3.90 HL - DET SKAL OGSÅ TESTES PÅ 'K'  */                 00004490
                                                                        00004500
    IF B02.PENSJONSTYPE1(AE_IND) = 'A'    !                             00004510
       (B02.PENSJONSTYPE1(AE_IND) = 'K' &                               00004520
        B02.PENSJONSTYPE2(AE_IND) ^= 'N' )         THEN                 00004530
                                                                        00004540
       DO;                                                              00004550
          W_HENDELSE.PÅ_EK         = B02.ALDERSP.PÅ      (AE_IND);      00004560
         W_HENDELSE.PÅ_ETTER91_EK = B02.ALDERSP.PÅ_ETTER91(AE_IND);     00004570
          W_HENDELSE.OPT_EK        = B02.ALDERSP.OPT     (AE_IND);      00004580
          W_HENDELSE.SPT_EK        = B02.ALDERSP.SPT     (AE_IND);      00004590
       END;                                                             00004600
                                                                        00004610
    ELSE                                                                00004620
                                                                        00004630
       DO;                                                              00004640
          W_HENDELSE.PÅ_EK         = B02.UFØRPENS.PÅ      (AE_IND);     00004650
         W_HENDELSE.PÅ_ETTER91_EK = B02.UFØRPENS.PÅ_ETTER91(AE_IND);    00004660
          W_HENDELSE.OPT_EK        = B02.UFØRPENS.OPT     (AE_IND);     00004670
          W_HENDELSE.SPT_EK        = B02.UFØRPENS.SPT     (AE_IND);     00004680
       END;                                                             00004690
                                                                        00004700
  /*  T.S. TEST PÅ 'D'   */                                             00004710
                                                                        00004720
    IF B02.PENSJONSTYPE1(AE_IND) = 'D'    THEN                          00004730
                                                                        00004740
       DO;                                                              00004750
          W_HENDELSE.PÅ_EK         = B02.ETTEPENS.PÅ_AVD  (AP_IND);     00004760
          W_HENDELSE.OPT_EK        = B02.ETTEPENS.OPT_AVD (AP_IND);     00004770
          W_HENDELSE.SPT_EK        = B02.ETTEPENS.SPT_AVD (AP_IND);     00004780
       END;                                                             00004790
                                                                        00004800
    IF B02.PENSJONSTYPE2(AE_IND) = 'U' !                                00004810
       B02.PENSJONSTYPE2(AE_IND) = 'M' THEN                             00004820
           W_HENDELSE.INNT4G_EK = B02.PENSJONSTYPE2(AE_IND);            00004830
                                                                        00004840
    W_BARN_IND = 1;                                                     00004850
       DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                            00004860
                                                                        00004870
          DO K = 1 TO 13 WHILE (B02.FNR_TILKN(AP_IND,K) > 0);           00004880
                                                                        00004890
             IF B02.FNR(J) = B02.FNR_TILKN(AP_IND,K) THEN               00004900
                                                                        00004910
                DO;                                                     00004920
                   W_HENDELSE.BARN.FNR_B(W_BARN_IND)    = B02.FNR(J);   00004930
                   W_HENDELSE.BARN.PENSJONSTYPE2_B(W_BARN_IND) =        00004940
                                                  B02.PENSJONSTYPE2(J); 00004950
                   W_HENDELSE.BT_FØR_0591(W_BARN_IND)   =               00004960
                               B02.FT_FØR_91(AP_IND,K);  /*NY0591*/     00004970
                   W_BARN_IND = W_BARN_IND + 1;                         00004980
                   K = 13;                                              00004990
                END;                                                    00005000
          END;                                                          00005010
       END;                                                             00005020
                                                                        00005030
    IF B02.PENSJONSTYPE1(AE_IND) = 'G' &                                00005040
      (B02.SIVILSTAND   (AE_IND) = 'G' !                                00005050
       B02.SIVILSTAND   (AE_IND) = 'W'   ) &   /*9710 HL*/              00005060
       B02.PENSJONSTYPE2(AE_IND) = 'M' THEN                             00005070
       DO;                                                              00005080
                                                                        00005090
  /* *************************************************************** */ 00005100
  /* EKTEFELLEN HAR IKKE PENSJON OG SØKEREN MOTTAR IKKE EKTEFELLE-   */ 00005110
  /* TILLEGG FOR EKTEFELLEN OG EKTEFELLEN HAR EN INNTEKT SOM ER      */ 00005120
  /* MINST 4G.                                                          00005130
  /* *************************************************************** */ 00005140
                                                                        00005150
          DO I = 3 TO 14 WHILE (B02.FNR(I) > 0);                        00005160
             IF B02.PENSJONSTYPE2(I) = 'R' &                            00005170
                W_HENDELSE.ANT_BT_REDUSERT < 3 THEN                     00005180
                W_HENDELSE.ANT_BT_REDUSERT =                            00005190
                W_HENDELSE.ANT_BT_REDUSERT + 1;                         00005200
          END;                                                          00005210
       END;                                                             00005220
                                                                        00005230
                                                                        00005240
  /* *************************************************************** */ 00005250
  /* FØLGENDE  FELT HENTES FRA P0014009                     .        */ 00005260
  /* *************************************************************** */ 00005270
                                                                        00005280
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(AP_IND);              00005290
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(AE_IND);              00005300
                                                                        00005310
    CALL PLASSER_TEKST(AP_IND,AE_IND);                                  00005320
                                                                        00005330
    CALL INSERT_HENDELSE;                                               00005340
                                                                        00005350
  /* *************************************************************** */ 00005360
  /* HVIS SLUTTPOENGTALLET ER STØRRE ENN 0 SKAL BEREGNINGSGRUNNLAG-  */ 00005370
  /* SEGMENT BYGGES OPP                                              */ 00005380
  /* *************************************************************** */ 00005390
                                                                        00005400
                                                                        00005410
    IF W_HENDELSE.SPT > 0 ! W_HENDELSE.OPT > 0 THEN                     00005420
       DO;                                                              00005430
          CALL BYGG_OPP_BERGRUNL_SEGMENT(AP_IND);                       00005440
       END;                                                             00005450
                                                                        00005460
                                                                        00005470
  END  LAG_ALDERSP_HEND;                                                00005480
                                                                        00005490
