 /*       SIST ENDRET 04/03-96 12.48.20 AV   JDA0310                  */00000000
 /*       SIST ENDRET 06/03-91 11.47.52 AV   DYBVIK                   */00000010
 %PAGE;                                /*   */                          00000020
 /* ***************************************************************** */00000030
 /*                R 0 0 1 N 6 0 2                                    */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R001N602 - SUBPROGRAM - BLANKER ARBEIDSOMRÅDE UP */00000080
 /*  PROGRAM-SPRÅK : PLI                                              */00000090
 /*  PROGRAMMERER  : JAN                                              */00000100
 /*  PROGRAMMET BLE LAGET : MAI 1981                                  */00000110
 /*  ENDRINGERSDATO :                                                 */00000120
 /*  ENDRINGEN GJELDER:                                               */00000130
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*  ENDRINGERSDATO :          220487                                 */00000170
 /*  ENDRINGEN GJELDER:        PROSEDYRENE BLANK_U2_MAP,              */00000180
 /*                            OVERFØR_U2_SØKER OG OVERFØR_U2_SPES    */00000190
 /*                            ER SKILT UT OG LAGT I R001N609         */00000200
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*HENSIKT:                                                           */00000240
 /* **********                                                        */00000250
 /*  BLANKER UP_TRANS_OMR.                                            */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*PROGRAMTILKNYTTING:                                                */00000290
 /* ********************                                              */00000300
 /*  PROGRAMMET INCLUDES AV R001N601 - KONTROLL_GRUNNBLANKETT_UP      */00000310
 /*  ALLE CICS-KOMMANDOS LIGGER I HOVEDPROG.                          */00000320
 /*  ARBEIDSOMRÅDET - P0010601 - ER INCLUDET I HOVEDPROG.             */00000330
 /*  DE INTERNE PROSEDYRER ER :                                       */00000340
 /*    BLANK_U2_SØKER:    BLANKER SØKERDELEN                          */00000350
 /*    BLANK_U2_BARN:     BLANKER BARNEDELEN                          */00000360
 /*    BLANK_U2_SPES:     BLANKER SPESIELL DEL                        */00000370
 /*    BLANK_U2_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000380
 /*    BLANK_YP:          BLANKER YRKESSKADEBLANKETTEN                */00000390
 /*    BLANK_YP_MELDNR:   SETTER 0 I Y-MELDINGSNUMRENE                */00000400
 /*                                                                   */00000410
 /* ***************************************************************** */00000420
 /*DATASETTOPPLYSNINGER:                                              */00000430
 /* ***********************                                           */00000440
 /*    INGEN                                                          */00000450
 /* ***************************************************************** */00000460
 /*FEILMELDINGER:                                                     */00000470
 /* *******************                                               */00000480
 /*    INGEN                                                          */00000490
 /* ***************************************************************** */00000500
 %PAGE;                                /*   */                          00000510
 BLANK_U2_SØKER:                                                        00000520
   PROC;                                                                00000530
         U2S.ATT_UF          = ' ';                                     00000540
         U2S.REGDATO         = 0;                                       00000550
         U2S.TERMID          = (4)' ';                                  00000560
         U2S.FNR             = 0;                                       00000570
         U2S.FNR_GML         = 0;                                       00000580
         U2S.NAVN            = (25)' ';                                 00000590
         U2S.TKNR            = 0;                                       00000600
         U2S.TILL_EK         = ' ';                                     00000610
         U2S.SIVILSTAND      = ' ';                                     00000620
         U2S.SPRÅK           = ' ';                                     00000630
         U2S.NORSK_BOSATT    = ' ';                                     00000640
         U2S.BT_ANT          = 0;                                       00000650
 /*YS*/  U2S.YSKADE_TILLEGG  = ' ';                                     00000660
         U2S.VP_ÅR(1)        = 0;                                       00000670
         U2S.VP_ÅR(2)        = 0;                                       00000680
         U2S.VP_ÅR(3)        = 0;                                       00000690
         U2S.VP_ÅR(4)        = 0;                                       00000700
         U2S.YRKESM_ATTF     = ' ';                                     00000710
         U2S.UTDANNING       = 0;                                       00000720
         U2S.VILKÅR_8_4_3A = ' ';                                       00000730
         U2S.UFG             = 0;                                       00000740
         U2S.UFT_MÅ          = 0;                                       00000750
         U2S.PI              = 0;                                       00000760
         U2S.INNTEKT_FØR_UP  = 0;                                       00000770
         U2S.YRKE            = 0;                                       00000780
         U2S.PRIMDIAG        = ' ';                                     00000790
         U2S.SEKUDIAG        = ' ';                                     00000800
         U2S.VIRK_DATO_MÅ    = 0;                                       00000810
         U2S.FNR_EK          = 0;                                       00000820
         U2S.FNR_GML_EK      = 0;                                       00000830
         U2S.NAVN_EK         = (25)' ';                                 00000840
         U2S.MINST4G         = ' ';                                     00000850
   END BLANK_U2_SØKER;                                                  00000860
 %PAGE;                                /*   */                          00000870
 /* ***************************************************************** */00000880
 /*                                                                   */00000890
 /*    PROSEDYREN BLANKER UP_BARNEDELEN I UP_TRANS_OMR I              */00000900
 /*    KOM_OMR FOR UFØREPENSJONSSØKNADER.                             */00000910
 /*                                                                   */00000920
 /* ***************************************************************** */00000930
 %SKIP;                                                                 00000940
 BLANK_U2_BARN:                                                         00000950
   PROC;                                                                00000960
   DCL                                                                  00000970
      ANT_BARN FIXED BIN (15);                                          00000980
 %SKIP;                                                                 00000990
      DO ANT_BARN                   = 1 TO 12;                          00001000
         U2B.FNR_BARN(ANT_BARN)     = 0;                                00001010
         U2B.RBT_BARN(ANT_BARN)     = ' ';                              00001020
         U2B.FNR_GML_BARN(ANT_BARN) = 0;                                00001030
      END;                                                              00001040
   END BLANK_U2_BARN;                                                   00001050
 %PAGE;                                /*   */                          00001060
 /* ***************************************************************** */00001070
 /*                                                                   */00001080
 /*    PROSEDYREN BLANKER UP_SPES.DELEN I UP_TRANS_OMR I              */00001090
 /*    KOM_OMR FOR UFØREPENSJONSSØKNADER.                             */00001100
 /*                                                                   */00001110
 /* ***************************************************************** */00001120
 %SKIP(2);                                                              00001130
 BLANK_U2_SPES:                                                         00001140
   PROC;                                                                00001150
      U2SP.STATSBORGER      = 0;                                        00001160
      U2SP.BOSATT           = 0;                                        00001170
      U2SP.PENSJONSTRYGDET  = ' ';                                      00001180
      U2SP.MINST_20_ÅR      = ' ';                                      00001190
      U2SP.KONVENSJON       = ' ';                                      00001200
      U2SP.FRAVIK_FLYKT     = '  ';                                     00001210
      U2SP.OVERKOMP_UTL     = ' ';                                      00001220
      U2SP.IKKE_GP          = ' ';                                      00001230
      U2SP.BEREGNING_KONV   = ' ';                                      00001240
      U2SP.TT_KONVENSJON_ÅR = 0;                                        00001250
      U2SP.TT_FRA1937_ÅR    = 0;                                        00001260
      U2SP.TT_FRA1937_MND   = 0;                                        00001270
      U2SP.TT_NORDEN_ANNET  = 0;                                        00001280
      U2SP.FRAVIK_8_1_NR3   = 0;                                        00001290
      U2SP.STI_MÅ           = 0;                                        00001300
   END BLANK_U2_SPES;                                                   00001310
 %PAGE;                                /* */                            00001320
 /* ***************************************************************** */00001330
 /*                                                                   */00001340
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I UP_TRANS_OMR I     */00001350
 /*    KOM_OMR.                                                       */00001360
 /*                                                                   */00001370
 /* ***************************************************************** */00001380
 %SKIP(2);                                                              00001390
 BLANK_U2_MELDNR:                                                       00001400
   PROC;                                                                00001410
   DCL                                                                  00001420
      ANT_BARN FIXED BIN (15);                                          00001430
   DCL                                                                  00001440
      ANT_VP_ÅR FIXED BIN (15);                                         00001450
 %SKIP(2);                                                              00001460
         U2S.ATT_UFNR               = 0;                                00001470
         U2S.REGDATONR              = 0;                                00001480
         U2S.TERMIDNR               = 0;                                00001490
         U2S.FNRNR                  = 0;                                00001500
         U2S.NAVNNR                 = 0;                                00001510
         U2S.TKNRNR                 = 0;                                00001520
         U2S.TILL_EKNR              = 0;                                00001530
         U2S.SIVILSTANDNR           = 0;                                00001540
         U2S.SPRÅKNR                = 0;                                00001550
         U2S.NORSK_BOSATTNR         = 0;                                00001560
         U2S.BT_ANTNR               = 0;                                00001570
 /*YS*/  U2S.YSKADE_TILLEGGNR       = 0;                                00001580
         DO ANT_VP_ÅR               = 1 TO 4;                           00001590
            U2S.VP_ÅRNR(ANT_VP_ÅR) = 0;                                 00001600
         END;                                                           00001610
         U2S.UTDANNINGNR            = 0;                                00001620
         U2S.YRKESM_ATTFNR          = 0;                                00001630
         U2S.VILKÅR_8_4_3ANR        = 0;                                00001640
         U2S.UFGNR                  = 0;                                00001650
         U2S.UFT_MÅNR               = 0;                                00001660
         U2S.PINR                   = 0;                                00001670
         U2S.INNTEKT_FØR_UPNR       = 0;                                00001680
         U2S.YRKENR                 = 0;                                00001690
         U2S.PRIMDIAGNR             = 0;                                00001700
         U2S.SEKUDIAGNR             = 0;                                00001710
         U2S.VIRK_DATO_MÅNR         = 0;                                00001720
         U2S.FNR_EKNR               = 0;                                00001730
         U2S.NAVN_EKNR              = 0;                                00001740
         U2S.MINST4GNR              = 0;                                00001750
 %SKIP(2);                             /*  */                           00001760
 /*  0 I MELDINGSNUMMERNE I  BARNEDELEN   */                            00001770
 %SKIP(2);                                                              00001780
      DO ANT_BARN                 = 1 TO 12;                            00001790
         U2B.FNR_BARNNR(ANT_BARN) = 0;                                  00001800
         U2B.RBT_BARNNR(ANT_BARN) = 0;                                  00001810
      END;                                                              00001820
 %SKIP(2);                             /*  */                           00001830
 /*   0 I MELDINGSNUMMERNE I SPESIELL DEL         */                    00001840
 %SKIP(2);                                                              00001850
      U2SP.STATSBORGERNR      = 0;                                      00001860
      U2SP.BOSATTNR           = 0;                                      00001870
      U2SP.PENSJONSTRYGDETNR  = 0;                                      00001880
      U2SP.MINST_20_ÅRNR      = 0;                                      00001890
      U2SP.KONVENSJONNR       = 0;                                      00001900
      U2SP.FRAVIK_FLYKTNR     = 0;                                      00001910
      U2SP.OVERKOMP_UTLNR     = 0;                                      00001920
      U2SP.IKKE_GPNR          = 0;                                      00001930
      U2SP.BEREGNING_KONVNR   = 0;                                      00001940
      U2SP.TT_KONVENSJON_ÅRNR = 0;                                      00001950
      U2SP.TT_FRA1937_ÅRNR    = 0;                                      00001960
      U2SP.TT_FRA1937_MNDNR   = 0;                                      00001970
      U2SP.TT_NORDEN_ANNETNR  = 0;                                      00001980
      U2SP.FRAVIK_8_1_NR3NR   = 0;                                      00001990
      U2SP.STI_MÅNR           = 0;                                      00002000
                                                                        00002010
   END BLANK_U2_MELDNR;                                                 00002020
                                                                        00002030
                                                                        00002040
 /*YS*/ BLANK_YP_U2:                                                    00002050
 /*YS*/  PROC;                                                          00002060
 /*YS*/                                                                 00002070
 /*YS*/     U2Y.VILKÅR_1_2_2A   = ' ';                                  00002080
 /*YS*/     U2Y.VILKÅR_1_2_2B   = ' ';                                  00002090
 /*YS*/     U2Y.YST_MÅ          = 0;                                    00002100
 /*YS*/     U2Y.YSYKDOM         = ' ';                                  00002110
 /*YS*/     U2Y.YUG             = 0;                                    00002120
 /*YS*/     U2Y.KAP_11_7_UTLØST = ' ';                                  00002130
 /*YS*/     U2Y.YRKE11          = ' ';                                  00002140
 /*YS*/     U2Y.AÅI             = 9999999;                              00002150
 /*YS*/     U2Y.FNR_EK          = 0;                                    00002160
 /*YS*/     U2Y.FNR_GML_EK      = 0;                                    00002170
 /*YS*/     U2Y.FNR_SAMBOER     = 0;                                    00002180
 /*YS*/     U2Y.FNR_GML_SAMBOER = 0;                                    00002190
 /*YS*/     U2Y.FNR_Y_BARN      = 0;                                    00002200
 /*YS*/     U2Y.FNR_GML_Y_BARN  = 0;                                    00002210
 /*YS*/     U2Y.PLEIEBARN       = ' ';                                  00002220
 /*YS*/                                                                 00002230
 /*YS*/ END BLANK_YP_U2;                                                00002240
                                                                        00002250
                                                                        00002260
 /*YS*/ BLANK_YP_MELDNR_U2:                                             00002270
 /*YS*/  PROC;                                                          00002280
 /*YS*/                                                                 00002290
 /*YS*/     U2Y.VILKÅR_1_2_2ANR   = 0;                                  00002300
 /*YS*/     U2Y.VILKÅR_1_2_2BNR   = 0;                                  00002310
 /*YS*/     U2Y.YST_MÅNR          = 0;                                  00002320
 /*YS*/     U2Y.YSYKDOMNR         = 0;                                  00002330
 /*YS*/     U2Y.YUGNR             = 0;                                  00002340
 /*YS*/     U2Y.KAP_11_7_UTLØSTNR = 0;                                  00002350
 /*YS*/     U2Y.YRKE11NR          = 0;                                  00002360
 /*YS*/     U2Y.AÅINR             = 0;                                  00002370
 /*YS*/     U2Y.FNR_EKNR          = 0;                                  00002380
 /*YS*/     U2Y.FNR_SAMBOERNR     = 0;                                  00002390
 /*YS*/     U2Y.FNR_Y_BARNNR      = 0;                                  00002400
 /*YS*/     U2Y.PLEIEBARNNR       = 0;                                  00002410
 /*YS*/ END BLANK_YP_MELDNR_U2;                                         00002420
