 /*       SIST ENDRET 28/07-98 12.50.26 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.29.23 AV   JDA7339                  */00000010
 /*       SIST ENDRET 29/08-96 15.22.05 AV   HLB0310                  */00000020
 /*       SIST ENDRET 01/04-96 14.50.21 AV   HLB0310                  */00000030
 /*       SIST ENDRET 23/04-91 10.56.55 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 04/04-91 13.58.50 AV   HERMAN                   */00000050
 /*       SIST ENDRET 02/01-90 15.42.55 AV   HERMAN                   */00000060
 /*       SIST ENDRET 02/01-90 14.32.02 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 14/12-88 13.20.04 AV   DYBVIK                   */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /*    R0014168 - SUBRUTINE I PLI                                     */00000100
 /*    PROGRAMMERER: HERMAN LARSSEN, OKT 1988                         */00000110
 /*HENSIKT:                                                           */00000120
 /*    LEGGE HISTORIKK OM AFP INN I TABELL - SOM OM DET VAR UFØRE-    */00000130
 /*                                                        HISTORIKK  */00000140
 /*    PROGRAMMET CALLES FRA 4152 I DE TILFELLER HVOR PERSONEN HAR    */00000150
 /*    PENSJONSTYPE1 = 'K' ELLER KONV_P_KODE = 'K'/'O'                */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
  LEGG_AFPHIST_I_TAB:                                                   00000190
    PROC(IND,FØDSELSÅR);                                                00000200
                                                                        00000210
  /*PROC(IND,FØDSELSÅR,TAB);   ENDERET AS SATISH  21.4.91            */ 00000220
 %SKIP(2);                                                              00000230
 /*  %INCLUDE P0014003;        ENDERET AS SATISH  21.4.91            */ 00000240
    DCL   1  W1,                                                        00000250
             2   APD     FIXED DEC (3) INIT(0);                         00000260
    DCL                                                                 00000270
       I                 FIXED BIN(15) INIT(0),                         00000280
       INDEKS            FIXED BIN(15),                                 00000290
       IND               FIXED BIN(15),                                 00000300
       AP_DATO           FIXED BIN(15)  INIT(0),                        00000310
       SAVE_IND          FIXED BIN(15)  INIT(1),                        00000320
       TAB_IND           FIXED BIN (15) INIT (0);                       00000330
    DCL                                                                 00000340
       FØDSELSÅR         PIC '99';                                      00000350
    DCL                                                                 00000360
       1 TID,                                                           00000370
         2 TID_ÅR     PIC '99',                                         00000380
         2 TID_MND    PIC '99';                                         00000390
                                                                        00000400
    DCL TID_ÅM DEF TID  PIC '9999';                                     00000410
  DCL  ALDER_PÅ_VIRKDATO                         PIC'(4)9' INIT(0),     00000420
       ALDER_ÅR DEF ALDER_PÅ_VIRKDATO POS(1)     PIC'(2)9';             00000430
  DCL FIXED_DEC5             FIXED DEC  (5)     INIT(0);                00000440
  DCL HJELPEDATO_ÅM          PIC       '9999'   INIT(0);                00000450
 %PAGE;                                                                 00000460
                                                                        00000470
  HJELPEDATO_ÅM = B02.VIRK_DATO_ÅM(IND);                                00000480
  FIXED_DEC5 = F_ALDER(W_FNR,F_SNU_DATO(HJELPEDATO_ÅM));                00000490
  ALDER_PÅ_VIRKDATO = FIXED_DEC5;                                       00000500
                                                                        00000510
 /*VI MÅ FINNE SISTE ÅR FOR OPPDATERING - DET ÅRET PERSONEN FYLLER 66*/ 00000520
 /*9807:  AP OG EP ETTER OFFENTLIG AFP SKAL BARE REGNES TIL 64 ÅR   */  00000530
                                                                        00000540
  IF B02.KONV_P_KODE(IND) = 'O'   THEN                                  00000550
      AP_DATO = FØDSELSÅR + 64;                                         00000560
  ELSE                                                                  00000570
      AP_DATO = FØDSELSÅR + 66;                                         00000580
           TID_ÅM    = B02.UTTAKSDATO_ÅM(IND);                          00000590
           TAB_IND   = TID_ÅR;                                          00000600
 /*                                                                   */00000610
           TAB.UFØR_START_MND(TAB_IND)   = TID_MND;                     00000620
                                                                        00000630
 /* UTTAKS_APD ER IKKE OPPDATERT FOR NYE TILFELLER : */                 00000640
                                                                        00000650
           IF B02.UTTAKS_APD(IND) = 0        THEN                       00000660
              W1.APD              = 100;                                00000670
           ELSE                                                         00000680
              W1.APD              = B02.UTTAKS_APD(IND);                00000690
                                                                        00000700
 /*TILLEGG/ENDRING 30.6.89 HL*/                                         00000710
                                                                        00000720
 /*IF TAB_IND <= AP_DATO        THEN                                    00000730
      DO; */                                                            00000740
         IF TAB.UFØR_GRAD(TAB_IND) < W1.APD     THEN                    00000750
 /*                                                                   */00000760
 /*              HVIS APD ER HØYERE ENN EN UFØREGRAD FOR SAMME ÅR,    */00000770
 /*              SÅ BRUKER VI APD.                                    */00000780
                                                                        00000790
          DO;                                                           00000800
             TAB.UFØR_GRAD(TAB_IND) = W1.APD;                           00000810
                                                                        00000820
             IF ALDER_PÅ_VIRKDATO < 7001        THEN                    00000830
                TAB.UFØR_KRIT(TAB_IND) = 6;                             00000840
             TAB.UFØR_PERIODE(TAB_IND) = 'S';                           00000850
          END;                                                          00000860
   /* END; */                                                           00000870
                                                                        00000880
                                                                        00000890
      I = 1;                                                            00000900
                                                                        00000910
   DO TAB_IND = TAB_IND TO AP_DATO;                                     00000920
      DO I = I TO 5 WHILE (B02.UTTAKSDATO_ÅM_ØVRIGE(IND,I) > 0);        00000930
         TID_ÅM = B02.UTTAKSDATO_ÅM_ØVRIGE(IND,I);                      00000940
         IF TAB_IND = TID_ÅR                    THEN                    00000950
            IF B02.APD_ØVRIGE(IND,I) > W1.APD       THEN                00000960
               W1.APD = B02.APD_ØVRIGE(IND,I);                          00000970
            ELSE;                                                       00000980
         ELSE                                                           00000990
            SAVE_IND = I;                                               00001000
      END;                                                              00001010
      I = SAVE_IND;                                                     00001020
      IF TAB.UFØR_GRAD(TAB_IND) < W1.APD     THEN                       00001030
 /*                                                                   */00001040
 /*              HVIS APD ER HØYERE ENN EN UFØREGRAD FOR SAMME ÅR,    */00001050
 /*              SÅ BRUKER VI APD.                                    */00001060
                                                                        00001070
          DO;                                                           00001080
             TAB.UFØR_GRAD(TAB_IND) = W1.APD;                           00001090
             IF ALDER_PÅ_VIRKDATO < 7001        THEN                    00001100
                TAB.UFØR_KRIT(TAB_IND) = 6;                             00001110
             IF TAB.UFØR_PERIODE(TAB_IND - 1) = ' '   THEN              00001120
                TAB.UFØR_PERIODE(TAB_IND) = 'S';                        00001130
             ELSE                                                       00001140
             IF B02.PENSJONSTYPE1(IND) = 'D'   !                        00001150
                ALDER_PÅ_VIRKDATO > 7000         THEN                   00001160
                TAB.UFØR_PERIODE(TAB_IND) = 'M';                        00001170
             ELSE                                                       00001180
                TAB.UFØR_PERIODE(TAB_IND) = 'L';                        00001190
          END;                                                          00001200
       IF TID_MND = 1     &                                             00001210
          TID_ÅR  = AP_DATO      &                                      00001220
          B02.UTTAKSDATO_ÅM_ØVRIGE(IND,SAVE_IND) > 0     THEN           00001230
                                                                        00001240
          W1.APD  = B02.APD_ØVRIGE(IND,SAVE_IND);                       00001250
                                                                        00001260
    END;                                                                00001270
    IF ALDER_PÅ_VIRKDATO > 7000      THEN                               00001280
       TAB.UFØR_PERIODE(AP_DATO + 1) = 'A';                             00001290
                                                                        00001300
 /*30.6.89 HL */                                                        00001310
                                                                        00001320
                                                                        00001330
 END LEGG_AFPHIST_I_TAB;                                                00001340
