 F_KONTROLL_TT:                                                         R0000010
   PROC(TT_FØR_1967,TT_E66_Å,TT_E66_M,FNR,DATO,TYPE) RETURNS (          R0000020
   BIT(1));                                                             R0000030
 %SKIP;  /*  */                                                         R0000040
 /*********************************************************************/R0000050
 /*IDENTIFIKASJON:                                                    */R0000060
 /*    R0019909 PLI       PER F.BERGESTAD                             */R0000070
 /*    PROGRAMMET ER LAGET I APRIL 1981.                              */R0000080
 /*HENSIKT:                                                           */R0000090
 /*    PROSEDYREN KONTROLLERER TRYGDETID;                             */R0000100
 /*     DVS.: -OM TT FØR 1967 ER FOR HØY,                             */R0000110
 /*           -OM TT FRA 1966 TIL HENHOLDSVIS FYLT 67 ÅR, UFØRETIDS-  */R0000120
 /*            PUNKT ELLER DØDSTIDSPUNKT ER FOR HØY.                  */R0000130
 /*BRUKES:                                                            */R0000140
 /*    F_KONTROLL_TT(APSP.TT_F67,APSP.TT_E66_Å,APSP.TT_E66_M,APSP.FNR,*/R0000150
 /*                  DATO,TYPE);                                      */R0000160
 /*PARAMETRE INN:                                                     */R0000170
 /*     TT_FØR_1967,TT_E66,FNR,DATO,TYPE                              */R0000180
 /*PARAMETRE UT :                                                     */R0000190
 /*     FEIL                                                          */R0000200
 /*********************************************************************/R0000210
 %PAGE;                                                                 R0000220
   DCL                                                                  R0000230
      TT_FØR_1967      PIC'(2)9',                                       R0000240
      TT_E66_Å         PIC'(2)9',                                       R0000250
      TT_E66_M         PIC'(2)9';                                       R0000260
 /*********************************************************************/R0000270
 /*   TT_E66 KAN IKKE VÆRE STØRRE ENN  EN AV FØLGENDE VERDIER:        */R0000280
 /*   ------                                                          */R0000290
 /*          F.O.M 1/1 - 67 T.O.M 67 ÅRS - MÅNEDEN                    */R0000300
 /*          F.O.M 1/1 - 67 T.O.M UFØREMÅNEDEN                        */R0000310
 /*          F.O.M 1/1 - 67 T.O.M DØDSMÅNEDEN                         */R0000320
 /*                                                                   */R0000330
 /*   TYPE KAN HA EN AV FØLGENDE VERDIER:                             */R0000340
 /*   ----                                                            */R0000350
 /*          A = ALDERSPENSJON                                        */R0000360
 /*          E = ETTERLATT EKTEFELLE                                  */R0000370
 /*          U = UFØREPENSJONIST                                      */R0000380
 /*   DATO:                                                           */R0000390
 /*   -----                                                           */R0000400
 /*          NÅR TYPE = A, DATO = 0                                   */R0000410
 /*          NÅR TYPE = E, DATO = DØDSDATO                            */R0000420
 /*          NÅR TYPE = U, DATO = UFØRETIDSPUNKT                      */R0000430
 /*********************************************************************/R0000440
 %PAGE;                                                                 R0000450
   DCL                                                                  R0000460
      FNR              PIC'(11)9';                                      R0000470
   DCL                                                                  R0000480
      W_FNR_MN         PIC'(2)9' DEF FNR POS(3),                        R0000490
      W_FNR_ÅR         PIC'(2)9' DEF FNR POS(5),                        R0000500
      W_PERSNR         PIC'(3)9' DEF FNR POS(7);                        R0000510
   DCL                                                                  R0000520
      DATO             PIC'(4)9',                                       R0000530
      TYPE             CHAR(1);                                         R0000540
   DCL                                                                  R0000550
      MAKS_TT_FØR_1967 PIC'(2)9',                                       R0000560
      TT_TIL_TPK       PIC'(4)9',                                       R0000570
      TT_E66_ÅM        PIC'(4)9';                                       R0000580
   DCL                                                                  R0000590
      FEIL             BIT(1);                                          R0000600
 %PAGE;                                                                 R0000610
      FEIL = '0'B;                                                      R0000620
      TT_E66_ÅM = (TT_E66_Å * 100) + TT_E66_M;                          R0000630
      SELECT (TYPE);                                                    R0000640
         WHEN ('A')                                                     R0000650
            DO;                                                         R0000660
               CALL TT_AP(FNR,MAKS_TT_FØR_1967,TT_TIL_TPK);             R0000670
               IF TT_FØR_1967 > MAKS_TT_FØR_1967 THEN                   R0000680
                  FEIL = '1'B;                                          R0000690
               IF TT_E66_ÅM > TT_TIL_TPK THEN                           R0000700
                  FEIL = '1'B;                                          R0000710
            END;                                                        R0000720
         OTHERWISE                                                      R0000730
            DO;                                                         R0000740
               CALL TT_UP_EP(FNR,DATO,MAKS_TT_FØR_1967,TT_TIL_TPK);     R0000750
               IF TT_FØR_1967 > MAKS_TT_FØR_1967 THEN                   R0000760
                  FEIL = '1'B;                                          R0000770
               IF TT_E66_ÅM > TT_TIL_TPK THEN                           R0000780
                  FEIL = '1'B;                                          R0000790
            END;                                                        R0000800
      END;                                                              R0000810
      RETURN(FEIL);                                                     R0000820
   END F_KONTROLL_TT;                                                   R0000830
