 /*       SIST ENDRET 30/10-98 08.29.45 AV   JDA7339                  */00000000
 /*       SIST ENDRET 30/10-98 08.27.27 AV   JDA7339                  */00000010
 /*       SIST ENDRET 23/04-98 08.22.47 AV   JDA7339                  */00000020
 /*       SIST ENDRET 23/04-98 08.21.14 AV   JDA7339                  */00000030
 /*       SIST ENDRET 15/04-98 08.38.51 AV   JDA7339                  */00000040
 /*       SIST ENDRET 15/04-98 08.37.10 AV   JDA7339                  */00000050
 /*       SIST ENDRET 23/01-98 12.23.42 AV   JDA7339                  */00000060
 /*       SIST ENDRET 11/12-97 09.18.09 AV   JDA7339                  */00000070
 /*       SIST ENDRET 05/12-97 12.18.41 AV   JDA7339                  */00000080
 /*       SIST ENDRET 27/11-97 10.43.03 AV   JDA7339                  */00000090
 /*       SIST ENDRET 19/09-97 10.49.35 AV   JDA7339                  */00000100
 /*       SIST ENDRET 19/09-97 10.26.28 AV   JDA7339                  */00000110
 /*       SIST ENDRET 30/05-97 09.24.01 AV   JDA7339                  */00000120
 /*       SIST ENDRET 11/02-97 13.40.52 AV   JDA7339                  */00000130
 /* ***************************************************************** */00000140
 /*IDENTIFIKASJON:                                                    */00000150
 /* **********************                                            */00000160
 /*  PROGRAM-IDENT : R001UJ03  KONTROLL_KFP_SØKER   SUBPROGRAM        */00000170
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000180
 /*  PROGRAMMERER  : SATISH - TRUDE                                   */00000190
 /*  PROGRAMMET BLE LAGET : 0895                                      */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /*HENSIKT:                                                           */00000230
 /* **********                                                        */00000240
 /*  FORETAR KONTROLL AV GRUNNBLANKETT  KFP - SØKERDELEN.             */00000250
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*PROGRAMTILKNYTTING:                                                */00000290
 /* ********************                                              */00000300
 /*  PROGRAMMET INCLUDES AV R001UJ01 - KONTROLL_GRUNNBLANKETT_KFP     */00000310
 /*  ARBEIDSOMRÅDET P001UJ01 ER INCLUDET I HOVEDPROG                  */00000320
 /*  BRUK :                                                           */00000330
 /*  CALL KONTROLL_KFP_SØKER(FEIL_I_AP_SØKER)                         */00000340
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000350
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000360
 /*          R0019901 - F_GYLDIG_DATO                                 */00000370
 /*          R0019902 - F_KJØNN                                       */00000380
 /*          R0019903 - F_EK_ALDER                                    */00000390
 /*          R0019904 - F_GYLDIG_FNR                                  */00000400
 /*          R0019905 - F_ALDER                                       */00000410
 /*          R0019907 - F_TABSØKC_FUNNET                              */00000420
 /*          R0019910 - F_NUMERISK                                    */00000430
 /*          R0019912 - F_FELT_PIC_CHAR11                             */00000440
 /*          R0019964 - F_6MDR                                        */00000450
 /*          VERIFY   - BUILTIN-FUNCTION                              */00000460
 /* ***************************************************************** */00000470
 /*DATASETTOPPLYSNINGER:                                              */00000480
 /* ***********************                                           */00000490
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */00000500
 /*                                                                   */00000510
 /* ***************************************************************** */00000520
 /*FEILMELDINGER:                                                     */00000530
 /* *******************                                               */00000540
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000550
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000560
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */00000570
 /*                                                                   */00000580
 /*   FEILMELDINGSNUMMER SOM GJELDER SPESIELT FOR KFP, SKAL VÆRE      */00000590
 /*   FRA OG MED 400 TIL 494.  ERIK 31.10.88                          */00000600
 /*                                                                   */00000610
 /* ***************************************************************** */00000620
 /*    ************************************************************** */00000630
 %PAGE;                                /*   */                          00000640
 %SKIP(2);                                                              00000650
 KONTROLL_KFP_SØKER:                                                    00000660
   PROC (FEIL_FUNNET) ;                                                 00000670
   DCL                                                                  00000680
      FEIL_FUNNET                               BIT (1);                00000690
   DCL                                                                  00000700
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000710
      KEY_PEKER                  POINTER,                               00000720
      TK_RECL                    CHAR (101);                            00000730
 %SKIP;                                                                 00000740
   DCL                                                                  00000750
      1 FNR_REG,                                                        00000760
        2 FNR1                                  FIXED DEC(11),          00000770
        2 FNR2                                  FIXED DEC(11),          00000780
        2 BRUKERID                              CHAR     ( 4),          00000790
                                                                        00000800
      ALDER                                     FIXED DEC (5);          00000810
                                                                        00000820
  DCL ALDER_EK                                  FIXED DEC (5);          00000830
                                                                        00000840
 %SKIP;                                                                 00000850
   DCL                                                                  00000860
      W_FNR                                     PIC'(11)9';             00000870
   DCL                                                                  00000880
      FNR_AAR_MND                               PIC'(4)9';              00000890
   DCL                                                                  00000900
      1 FNR DEF W_FNR,                                                  00000910
        2 DAG                                   PIC'(2)9',              00000920
        2 MND                                   PIC'(2)9',              00000930
        2 AAR                                   PIC'(2)9',              00000940
        2 ÅRHUNDRE                              PIC'9',                 00000950
        2 REST                                  PIC'(4)9';              00000960
   DCL                                                                  00000970
      W_FNR_EK                                  PIC'(11)9';             00000980
   DCL                                                                  00000990
      1 FNR_EK DEF W_FNR_EK,                                            00001000
        2 DAG                                   PIC'(2)9',              00001010
        2 MND                                   PIC'(2)9',              00001020
        2 AAR                                   PIC'(2)9',              00001030
        2 ÅRHUNDRE                              PIC'9',                 00001040
        2 REST                                  PIC'(4)9';              00001050
 %PAGE;                                /*   */                          00001060
 /*  HJELPE DCL FOR Å SNU DATO           */                             00001070
 %SKIP(1);                                                              00001080
   DCL                                                                  00001090
      HJ_VIRK_DATO_ÅM                           PIC '9999',             00001100
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1)    PIC '99',               00001110
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3)    PIC '99';               00001120
 %SKIP;                                                                 00001130
   DCL                                                                  00001140
      HJ_VIRK_DATO_MÅ                           PIC '9999',             00001150
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00001160
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00001170
 %SKIP;                                                                 00001180
   DCL                                                                  00001190
      TT_FRAM_TIL                               PIC'99',                00001200
      TT_FRA_37_M                               PIC'9999',              00001210
      TT_FRA_37_Å                               PIC'99',                00001220
      TT_HJELP_M                                PIC'9999';              00001230
 %SKIP;                                                                 00001240
   W_FNR     = KFP.FNR;                                                 00001250
   KEY_PEKER = ADDR(KFP.TKNR);                                          00001260
 %PAGE;                                                                 00001270
   HJ_VIRK_DATO_MÅ = KFP.VIRK_DATO_MÅ;                                  00001280
   VIRK_DATO_Å     = HJ_VIRK_DATO_Å;                                    00001290
   VIRK_DATO_M     = HJ_VIRK_DATO_M;                                    00001300
                                                                        00001310
 /* SPERRE OPPHEVET ETTER ØNSKE FRA LINDA AASEBØ :                      00001320
   IF HJ_VIRK_DATO_ÅM > 9806                          THEN              00001330
      DO;                                                               00001340
         FEIL_FUNNET = '1'B;                                            00001350
         KFP.VIRK_DATO_MÅNR = 1742;                                     00001360
      END;                                                              00001370
 *************************** */                                         00001380
                                                                        00001390
                                                                        00001400
   IF VERIFY(KFP.SIVILSTAND,'GASUEPWV') ^= 0 THEN                       00001410
      DO;                                                               00001420
         FEIL_FUNNET      = '1'B;                                       00001430
         KFP.SIVILSTANDNR = 5;                                          00001440
      END;                                                              00001450
                                                                        00001460
   IF HJ_VIRK_DATO_ÅM < 9308 & (KFP.SIVILSTAND = 'P') THEN              00001470
      DO;                                                               00001480
         FEIL_FUNNET = '1'B;                                            00001490
         KFP.SIVILSTANDNR = 388;                                        00001500
      END;                                                              00001510
                                                                        00001520
   IF HJ_VIRK_DATO_ÅM < 9401 & (KFP.SIVILSTAND = 'W') THEN              00001530
      DO;                                                               00001540
         FEIL_FUNNET = '1'B;                                            00001550
         KFP.SIVILSTANDNR = 389;                                        00001560
      END;                                                              00001570
                                                                        00001580
   /* SPERREDATAO FOR NESTE ÅR PGA INNTEKTSOPPDATERING */               00001590
   /* ER IKKE KJØRT. JD 8.10.97                        */               00001600
   /* HUSK Å LEGGE INN G-VEIET I R0019H90              */               00001610
   /* HJ_VIRK_DATO_ÅM > 9900  THEN                                      00001620
      DO;                                                               00001630
         FEIL_FUNNET = '1'B;                                            00001640
         KFP.VIRK_DATO_MÅNR = 415;                                      00001650
      END;   TATT UT 30.98     JD                */                     00001660
                                                                        00001670
   IF KFP.NAVN       = (25)' ' THEN                                     00001680
       DO;                                                              00001690
           FEIL_FUNNET = '1'B;                                          00001700
           KFP.NAVNNR  = 2;                                             00001710
       END;                                                             00001720
       IF ^F_GYLDIG_FNR(KFP.FNR) THEN                                   00001730
          DO;                                                           00001740
             FEIL_FUNNET = '1'B;                                        00001750
             KFP.FNRNR   = 1;                                           00001760
          END;                                                          00001770
       ELSE                                                             00001780
          DO;                                                           00001790
             FNR_REG.BRUKERID =   DIV_PARAM_OMR.CICS_IND;               00001800
             FNR_REG.FNR1     =   KFP.FNR;                              00001810
                                                                        00001820
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00001830
                                                                        00001840
             IF FNR_REG.FNR2 > 0 THEN                                   00001850
                DO;                                                     00001860
                   KFP.FNRNR   = 203;                                   00001870
                   KFP.FNR_GML = KFP.FNR;                               00001880
                   KFP.FNR     = FNR_REG.FNR2;                          00001890
                END;                                                    00001900
          END;                                                          00001910
                                                                        00001920
       IF KFP.TKNR ^= 0 THEN                                            00001930
            DO;                                                         00001940
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                  00001950
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)          00001960
                                               INTO(TK_RECL);           00001970
            GOTO TKNR_UT;                                               00001980
        NOTFND:                                                         00001990
            FEIL_FUNNET = '1'B;                                         00002000
            KFP.TKNRNR  = 3;                                            00002010
            LEAVE;                                                      00002020
        TKNR_UT:                                                        00002030
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00002040
           END;                                                         00002050
                                                                        00002060
      IF VERIFY(KFP.SPRÅK,'NBE ') ^= 0 THEN                             00002070
         DO;                                                            00002080
            FEIL_FUNNET = '1'B;                                         00002090
            KFP.SPRÅKNR = 6;                                            00002100
         END;                                                           00002110
                                                                        00002120
      IF HJ_VIRK_DATO_ÅM  < 9100    THEN                                00002130
         DO;                                                            00002140
            FEIL_FUNNET = '1'B;                                         00002150
            KFP.VIRK_DATO_MÅNR = 364;                                   00002160
         END;                                                           00002170
                                                                        00002180
    IF VERIFY(KFP.NORSK_BOSATT,'JN') ^= 0 THEN                          00002190
       DO;                                                              00002200
          FEIL_FUNNET        = '1'B;                                    00002210
          KFP.NORSK_BOSATTNR = 8;                                       00002220
       END;                                                             00002230
                                                                        00002240
      IF KFP.NORSK_BOSATT = 'J' THEN                                    00002250
         DO;                                                            00002260
            TT_FRA_37_M  = (HJ_VIRK_DATO_Å - (FNR.AAR + 16)) * 12       00002270
                               + HJ_VIRK_DATO_M - FNR.MND;              00002280
            TT_FRA_37_Å  = TT_FRA_37_M / 12;                            00002290
            TT_HJELP_M   = TT_FRA_37_Å * 12;                            00002300
            KFPSP.TT_16_66_Å  = TT_FRA_37_Å;                            00002310
            KFPSP.TT_16_66_M  = TT_FRA_37_M - TT_HJELP_M;               00002320
         END;                                                           00002330
      IF KFP.NORSK_BOSATT = 'N' THEN                                    00002340
         DO;                                                            00002350
       /*-----------------------------------------------------*/        00002360
       /* HVIS IKKE NORSK BOSATT, SKAL SPESIELLE OPPLYSNINGER */        00002370
       /* FYLLES UT.                                          */        00002380
       /*-----------------------------------------------------*/        00002390
        /* HVORFOR ER DETTE STJERNET UT I 1903 ????                     00002400
               S001UJ1O.TT_16_66_ÅA   =  DFHBMUNN;                      00002410
               S001UJ1O.TT_16_66_MA   =  DFHBMUNN;                      00002420
               S001UJ1O.STATSBORGERA  =  DFHBMUNN;                      00002430
               S001UJ1O.BOSATTA       =  DFHBMUNN;                      00002440
               S001UJ1O.FRAVIK_FLYKTA =  DFHBMUNN;                      00002450
               S001UJ1O.OVERKOMP_UTLA =  DFHBMUNN;                      00002460
               */                                                       00002470
         END;                                                           00002480
                                                                        00002490
                                                                        00002500
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(KFP.PI_SISTE_ÅR)) THEN              00002510
       DO;                                                              00002520
          FEIL_FUNNET = '1'B;                                           00002530
          KFP.PI_SISTE_ÅRNR   = 200;                                    00002540
       END;                                                             00002550
                                                                        00002560
                                                                        00002570
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(KFP.FAI)) THEN                   00002580
         DO;                                                            00002590
            FEIL_FUNNET = '1'B;                                         00002600
            KFP.FAINR   = 200;                                          00002610
         END;                                                           00002620
                                                                        00002630
    IF KFP.FAI = 9999999 THEN                                           00002640
       KFP.FAI = 0;                                                     00002650
                                                                        00002660
    IF KFP.PI_SISTE_ÅR  = 9999999 THEN                                  00002670
       KFP.PI_SISTE_ÅR  = 0;                                            00002680
                                                                        00002690
    IF KFP.PEN_INNT = 9999999 THEN                                      00002700
       KFP.PEN_INNT = 0;                                                00002710
                                                                        00002720
    IF ^F_GYLDIG_DATO(KFP.VIRK_DATO_MÅ) THEN                            00002730
        DO;                                                             00002740
            FEIL_FUNNET        = '1'B;                                  00002750
            KFP.VIRK_DATO_MÅNR = 9;                                     00002760
        END;                                                            00002770
                                                                        00002780
      IF ^( KFP.AFP_TILLEGGKODE  = ' ' !                                00002790
            KFP.AFP_TILLEGGKODE = 'N' )      THEN                       00002800
         DO;                                                            00002810
            FEIL_FUNNET    ='1'B;                                       00002820
            KFP.AFP_TILLEGGKODENR = 421;                                00002830
         END;                                                           00002840
                                                                        00002850
  /*  IF ^(KFP.AFP_ORDNING = ' ' ! KFP.AFP_ORDNING = 'J' !              00002860
           KFP.AFP_ORDNING = 'S' ! KFP.AFP_ORDNING = 'K' !              00002870
                                KFP.AFP_ORDNING = 'N' !                 00002880
                                KFP.AFP_ORDNING = 'B' ) THEN */         00002890
      IF VERIFY(KFP.AFP_ORDNING,'BJKLNS') ^= 0 THEN   /*9712 HL*/       00002900
         DO;                                                            00002910
            FEIL_FUNNET    ='1'B;                                       00002920
            KFP.AFP_ORDNINGNR = 400;                                    00002930
         END;                                                           00002940
                                                                        00002950
                                                                        00002960
      IF HJ_VIRK_DATO_ÅM > 9801             THEN                        00002970
         DO;                                                            00002980
            IF VERIFY(KFP.EK_INNT_OVER_2G,'JN ') ^= 0    THEN           00002990
               DO;                                                      00003000
                  FEIL_FUNNET   ='1'B;                                  00003010
                  KFP.EK_INNT_OVER_2GNR = 1541;                         00003020
               END;                                                     00003030
            IF KFP.EK_INNT_OVER_2G = ' '          THEN                  00003040
               DO;                                                      00003050
                  IF (KFP.SIVILSTAND = 'G'  !                           00003060
                      KFP.SIVILSTAND = 'P'  !                           00003070
                      KFP.SIVILSTAND = 'V'  !                           00003080
                      KFP.SIVILSTAND = 'W' )              THEN          00003090
                      DO;                                               00003100
                         FEIL_FUNNET   ='1'B;                           00003110
                         KFP.EK_INNT_OVER_2GNR = 272;                   00003120
                      END;                                              00003130
               END;                                                     00003140
            ELSE                                                        00003150
            IF ^(KFP.SIVILSTAND = 'G'  !                                00003160
                 KFP.SIVILSTAND = 'P'  !                                00003170
                 KFP.SIVILSTAND = 'V'  !                                00003180
                 KFP.SIVILSTAND = 'W' )              THEN               00003190
                 DO;                                                    00003200
                    FEIL_FUNNET   ='1'B;                                00003210
                    KFP.EK_INNT_OVER_2GNR = 1542;                       00003220
                 END;                                                   00003230
         END;                                                           00003240
      ELSE                                                              00003250
         KFP.EK_INNT_OVER_2G = ' ';                                     00003260
                                                                        00003270
      IF ^(KFP.TILL_EK = 'J' ! KFP.TILL_EK = ' ') THEN                  00003280
         DO;                                                            00003290
            FEIL_FUNNET   ='1'B;                                        00003300
            KFP.TILL_EKNR = 4;                                          00003310
         END;                                                           00003320
                                                                        00003330
      IF KFP.FNR_EK  ^= 0       THEN                                    00003340
         DO;                                                            00003350
            IF ^F_GYLDIG_FNR(KFP.FNR_EK) THEN                           00003360
                DO;                                                     00003370
                   FEIL_FUNNET  = '1'B;                                 00003380
                   KFP.FNR_EKNR = 1;                                    00003390
                END;                                                    00003400
           ELSE                                                         00003410
                DO;                                                     00003420
                   FNR_REG.FNR1     = KFP.FNR_EK;                       00003430
                                                                        00003440
                   EXEC CICS LINK PROGRAM('R0019906')                   00003450
                                                      COMMAREA(FNR_REG);00003460
                     IF FNR_REG.FNR2 > 0 THEN                           00003470
                        DO;                                             00003480
                           KFP.FNR_EKNR   = 203;                        00003490
                           KFP.FNR_GML_EK = KFP.FNR_EK;                 00003500
                           KFP.FNR_EK     = FNR_REG.FNR2;               00003510
                        END;                                            00003520
               END;                                                     00003530
                  IF KFP.NAVN_EK    = (25)' ' THEN                      00003540
                     DO;                                                00003550
                        FEIL_FUNNET = '1'B;                             00003560
                        KFP.NAVN_EKNR  = 2;                             00003570
                     END;                                               00003580
         END;                                                           00003590
                                                                        00003600
 /* HER SETTES VERDIER INN I   M E N Y - O M R                        */00003610
      FØDSNUMMER    = KFP.FNR;                                          00003620
      VIRKNINGSDATO = KFP.VIRK_DATO_MÅ;                                 00003630
 %SKIP(3);                             /*  */                           00003640
 /*   K R Y S S - K O N T R O L L E R                               */  00003650
 %SKIP;                                                                 00003660
      IF ^FEIL_FUNNET THEN                                              00003670
         DO;                                                            00003680
            ALDER           = F_ALDER(KFP.FNR,KFP.VIRK_DATO_MÅ);        00003690
                                                                        00003700
            /*NYE KODER FRA 01.10.93   */                               00003710
            IF  (KFP.AFP_ORDNING = 'S' !                                00003720
                 KFP.AFP_ORDNING = 'K' ) &                              00003730
                 HJ_VIRK_DATO_ÅM < 9310  THEN                           00003740
                     DO;                                                00003750
                        FEIL_FUNNET  = '1'B;                            00003760
                        KFP.AFP_ORDNINGNR = 414;                        00003770
                     END;                                               00003780
                                                                        00003790
             /* GYLDIGE KODER FRA 01.93 ER S OG K*/                     00003800
            IF   KFP.AFP_ORDNING = 'J' &                                00003810
                 HJ_VIRK_DATO_ÅM > 9309  THEN                           00003820
                     DO;                                                00003830
                        FEIL_FUNNET  = '1'B;                            00003840
                        KFP.AFP_ORDNINGNR = 414;                        00003850
                     END;                                               00003860
                                                                        00003870
            IF   KFP.AFP_ORDNING = 'J' &                                00003880
                 ALDER        < 6501  THEN                              00003890
                     DO;                                                00003900
                        FEIL_FUNNET  = '1'B;                            00003910
                        KFP.AFP_ORDNINGNR = 420;                        00003920
                     END;                                               00003930
            /*HIT NYE KODE. TRUDE */                                    00003940
                                                                        00003950
            IF   KFP.AFP_ORDNING = 'B' &                                00003960
                 HJ_VIRK_DATO_ÅM < 9500  THEN                           00003970
                     DO;                                                00003980
                        FEIL_FUNNET  = '1'B;                            00003990
                        KFP.AFP_ORDNINGNR = 416;                        00004000
                     END;                                               00004010
                                                                        00004020
            IF   KFP.AFP_ORDNING = 'N' &                                00004030
                 HJ_VIRK_DATO_ÅM < 9705  THEN                           00004040
                     DO;                                                00004050
                        FEIL_FUNNET  = '1'B;                            00004060
                        KFP.AFP_ORDNINGNR = 417;                        00004070
                     END;                                               00004080
                                                                        00004090
            IF KFP.FNR_EK > 0 THEN                                      00004100
               DO;                                                      00004110
                  IF F_KJØNN(KFP.FNR) = F_KJØNN(KFP.FNR_EK) &           00004120
                     KFP.SIVILSTAND ^= 'P' THEN                         00004130
                     DO;                                                00004140
                        FEIL_FUNNET  = '1'B;                            00004150
                        KFP.FNRNR    = 999;                             00004160
                        KFP.FNR_EKNR = 16;                              00004170
                     END;                                               00004180
                                                                        00004190
                  IF F_KJØNN(KFP.FNR) ^= F_KJØNN(KFP.FNR_EK) &          00004200
                     KFP.SIVILSTAND  = 'P' THEN                         00004210
                     DO;                                                00004220
                        FEIL_FUNNET  = '1'B;                            00004230
                        KFP.FNRNR    = 999;                             00004240
                        KFP.FNR_EKNR = 392;                             00004250
                     END;                                               00004260
               END;                                                     00004270
                                                                        00004280
                                                                        00004290
            ALDER_EK        = F_ALDER(KFP.FNR_EK,KFP.VIRK_DATO_MÅ);     00004300
                                                                        00004310
            IF KFP.TILL_EK = 'J' & ALDER_EK < 6001 THEN                 00004320
             DO;                                                        00004330
               FEIL_FUNNET   = '1'B;                                    00004340
               KFP.TILL_EKNR =  413;                                    00004350
             END;                                                       00004360
                                                                        00004370
                                                                        00004380
            W_FNR_EK = KFP.FNR_EK;                                      00004390
                                                                        00004400
            IF (HJ_VIRK_DATO_ÅM > 9100  &                               00004410
                HJ_VIRK_DATO_ÅM < 9310) & ALDER < 6501 THEN             00004420
               DO;                                                      00004430
                  FEIL_FUNNET        = '1'B;                            00004440
                  KFP.VIRK_DATO_MÅNR = 409;                             00004450
               END;                                                     00004460
            ELSE                                                        00004470
            IF  HJ_VIRK_DATO_ÅM > 9309  &                               00004480
                HJ_VIRK_DATO_ÅM < 9710  & ALDER < 6401 THEN             00004490
               DO;                                                      00004500
                  FEIL_FUNNET        = '1'B;                            00004510
                  KFP.VIRK_DATO_MÅNR = 410;                             00004520
               END;                                                     00004530
                                                                        00004540
            IF  HJ_VIRK_DATO_ÅM > 9709  &                               00004550
                HJ_VIRK_DATO_ÅM < 9801  & ALDER < 6301 &                00004560
                AFP_ORDNING     = 'B'      THEN                         00004570
               DO;                                                      00004580
                  FEIL_FUNNET        = '1'B;                            00004590
                  KFP.VIRK_DATO_MÅNR = 410;                             00004600
               END;                                                     00004610
                                                                        00004620
            IF  HJ_VIRK_DATO_ÅM > 9800  &                               00004630
                HJ_VIRK_DATO_ÅM < 9803  & ALDER < 6201 &                00004640
                AFP_ORDNING    ^= 'B'   THEN                            00004650
               DO;                                                      00004660
                  FEIL_FUNNET        = '1'B;                            00004670
                  KFP.VIRK_DATO_MÅNR = 410;                             00004680
               END;                                                     00004690
                                                                        00004700
            IF  HJ_VIRK_DATO_ÅM > 9802  & ALDER < 6201 THEN             00004710
               DO;                                                      00004720
                  FEIL_FUNNET        = '1'B;                            00004730
                  KFP.VIRK_DATO_MÅNR = 410;                             00004740
               END;                                                     00004750
                                                                        00004760
            FNR_AAR_MND = FNR.AAR !! FNR.MND;                           00004770
                                                                        00004780
            IF ALDER > 6700 THEN                                        00004790
               DO;                                                      00004800
                  FEIL_FUNNET        = '1'B;                            00004810
                  KFP.VIRK_DATO_MÅNR = 408;                             00004820
               END;                                                     00004830
                                                                        00004840
            IF ^F_6MDR(HJ_VIRK_DATO_ÅM)             THEN                00004850
               DO;                                                      00004860
                  FEIL_FUNNET        = '1'B;                            00004870
                  KFP.VIRK_DATO_MÅNR = 205;                             00004880
               END;                                                     00004890
                                                                        00004900
                                                                        00004910
            IF ^((KFP.FNR_EK = 0 & KFP.NAVN_EK = (25)' ') !             00004920
                 (KFP.FNR_EK > 0 & KFP.NAVN_EK ^= (25)' ')) THEN        00004930
                  DO;                                                   00004940
                     FEIL_FUNNET   = '1'B;                              00004950
                     KFP.NAVN_EKNR = 204;                               00004960
                     KFP.FNR_EKNR  = 999;                               00004970
                  END;                                                  00004980
                 ELSE                                                   00004990
                  IF KFP.FNR_EK > 0  & (KFP.SIVILSTAND = 'S' !          00005000
                     KFP.SIVILSTAND = 'U' ! KFP.SIVILSTAND = 'E') THEN  00005010
                      DO;                                               00005020
                         FEIL_FUNNET      = '1'B;                       00005030
                         KFP.SIVILSTANDNR = 123;                        00005040
                         KFP.FNR_EKNR     = 999;                        00005050
                         KFP.NAVN_EKNR    = 999;                        00005060
                      END;                                              00005070
                                                                        00005080
            IF KFP.TILL_EK = 'J' THEN                                   00005090
               DO;                                                      00005100
                  IF KFP.NAVN_EK = (25)' ' THEN                         00005110
                     DO;                                                00005120
                        FEIL_FUNNET   = '1'B;                           00005130
                        KFP.NAVN_EKNR = 19;                             00005140
                        KFP.TILL_EKNR = 999;                            00005150
                     END;                                               00005160
                  ELSE                                                  00005170
                  IF KFP.FNR_EK = 0 THEN                                00005180
                     DO;                                                00005190
                        FEIL_FUNNET   = '1'B;                           00005200
                        KFP.FNR_EKNR  = 15;                             00005210
                        KFP.TILL_EKNR = 999;                            00005220
                     END;                                               00005230
                  ELSE                                                  00005240
                  IF ^F_EK_ALDER_GYLDIG(KFP.FNR_EK,KFP.VIRK_DATO_MÅ)    00005250
                                                                    THEN00005260
                     DO;                                                00005270
                        FEIL_FUNNET        = '1'B;                      00005280
                        KFP.FNR_EKNR       = 17;                        00005290
                        KFP.VIRK_DATO_MÅNR = 999;                       00005300
                        KFP.TILL_EKNR      = 999;                       00005310
                     END;                                               00005320
                  ELSE                                                  00005330
                  IF ^(KFP.SIVILSTAND = 'G' ! KFP.SIVILSTAND = 'A' !    00005340
                       KFP.SIVILSTAND = 'P' ! KFP.SIVILSTAND = 'W') THEN00005350
                     DO;                                                00005360
                        FEIL_FUNNET      = '1'B;                        00005370
                        KFP.SIVILSTANDNR = 54;                          00005380
                        KFP.TILL_EKNR    = 999;                         00005390
                     END;                                               00005400
               END;                                                     00005410
            ELSE                                                        00005420
               DO;                                                      00005430
               IF (KFP.FNR_EK ^> 0 ! KFP.NAVN_EK = (25)' ') &           00005440
               (KFP.SIVILSTAND = 'G' ! KFP.SIVILSTAND = 'A' ) THEN      00005450
                  DO;                                                   00005460
                     FEIL_FUNNET      = '1'B;                           00005470
                     KFP.FNR_EKNR     = 18;                             00005480
                     KFP.NAVN_EKNR    = 999;                            00005490
                     KFP.SIVILSTANDNR = 999;                            00005500
                  END;                                                  00005510
               IF (KFP.FNR_EK ^> 0 ! KFP.NAVN_EK = (25)' ') &           00005520
               (KFP.SIVILSTAND = 'W' !                                  00005530
                KFP.SIVILSTAND = 'V') THEN                              00005540
                  DO;                                                   00005550
                     FEIL_FUNNET      = '1'B;                           00005560
                     KFP.FNR_EKNR     = 390;                            00005570
                     KFP.NAVN_EKNR    = 999;                            00005580
                     KFP.SIVILSTANDNR = 999;                            00005590
                  END;                                                  00005600
               IF (KFP.FNR_EK ^> 0 ! KFP.NAVN_EK = (25)' ') &           00005610
               (KFP.SIVILSTAND = 'P') THEN                              00005620
                  DO;                                                   00005630
                     FEIL_FUNNET      = '1'B;                           00005640
                     KFP.FNR_EKNR     = 391;                            00005650
                     KFP.NAVN_EKNR    = 999;                            00005660
                     KFP.SIVILSTANDNR = 999;                            00005670
                  END;                                                  00005680
              END;                                                      00005690
         END;                                                           00005700
   END KONTROLL_KFP_SØKER;                                              00005710
