 /*       SIST ENDRET 09/03-88 14.30.56 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 01/09-87 08.49.47 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 14/09-84 11.29.07 AV   LUNDEBY                  */00000020
 /*       SIST ENDRET 06/09-84 12.27.55 AV   LUNDEBY                  */00000030
 /*       SIST ENDRET 19/06-84 08.19.54 AV   LUNDEBY                  */00000040
 /*       SIST ENDRET 06/10-82 13.42.03 AV   JANKR                    */00000050
                                                                        00000060
 /* ***************************************************************** */00000070
 /* IDENTIFIKASJON                                                    */00000080
 /*     R0019906 - PROGRAM SJEKKER OM ETT FNR ER ENDRET  .            */00000090
 /*                                                                   */00000100
 /* HENSIKT                                                           */00000110
 /*     PROGRAMMET BLIR KALT FOR HVERT FNR SOM SKAL SJEKKES OG DET    */00000120
 /*     FINNER RETURNERER MED DET ENDREDE FNR .                       */00000130
 /*                                                                   */00000140
 /* PROGRAMTILKNYTNING                                                */00000150
 /*     BLIR GITT KONTROLL FRA ALLE BALNKETT-STYREPROGRAM.            */00000160
 /*                                                                   */00000170
 /* ENDRET 25.08.84 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000180
 /*     RUTINEN LEGGES OM SLIK AT DEN LESER EN VSAM-FILE MED DD-NAVN  */00000190
 /*    'VSKJEDE'. DEN DANNES I FNR-ENDRINGSKJØRINGEN .                */00000200
 /*                                                                   */00000210
 /* ENDRET 06.09.84 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000220
 /*     RUTINEN SJEKKER IKKE MOT VSKJEDE OM FNR ER ENDRET FOR ET      */00000230
 /*     BESTEMT BRUKERID .                                            */00000240
 /*                                                                   */00000250
 /* ENDRET 08.03.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000260
 /*     RUTINEN SJEKKER IKKE MOT VSKJEDE OM FNR ER ENDRET FOR ET      */00000270
 /*     BESTEMT BRUKERID MED G I 2. POSISJON (SOM FOR CICS_IND).      */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
                                                                        00000310
 R00199:                                                                00000320
   PROC (COMMAREA_PEKER)   OPTIONS(MAIN);                               00000330
                                                                        00000340
   DCL                                                                  00000350
      COMMAREA_PEKER       PTR;                                         00000360
   DCL                                                                  00000370
      1 FNR_ENDR_REG BASED (COMMAREA_PEKER)                           , 00000380
        2 FNR1             FIXED  DEC  (11)                           , 00000390
        2 FNR2             FIXED  DEC  (11)                           , 00000400
        2 BRUKERID         CHAR        ( 4)                           ; 00000410
                                                                        00000420
   DCL                                                                  00000430
      1 REG,                                                            00000440
        2 KODE             CHAR        ( 1)     INIT   (' ')          , 00000450
        2 FNR_1            FIXED  DEC  (11)     INIT   (  0)          , 00000460
        2 FNR_2            FIXED  DEC  (11)     INIT   (  0)          ; 00000470
   DCL                                                                  00000480
      LEN                  FIXED  BIN  (15)     INIT   ( 13)          , 00000490
      TELL                 FIXED  BIN  (15)                           ; 00000500
   DCL                                                                  00000510
     (ADDR , STG ,LENGTH,SUBSTR)  BUILTIN                             , 00000520
      EP                   POINTER                                    , 00000530
      KEYBIT         BASED (EP)   BIT  (48)                           ; 00000540
                                                                        00000550
                                                                        00000560
 /* ***************************************************************** */00000570
 /*   EKSEKVERING                                                     */00000580
 /* ***************************************************************** */00000590
                                                                        00000600
                                                                        00000610
                                                                        00000620
      EXEC CICS HANDLE CONDITION NOTFND (NOT_FOUND)                  ;  00000630
                                                                        00000640
      FNR_ENDR_REG.FNR2             =    0                           ;  00000650
      EP                            =    ADDR (FNR_ENDR_REG.FNR1)    ;  00000660
                                                                        00000670
                                                                        00000680
      IF SUBSTR (FNR_ENDR_REG.BRUKERID , 2)  =  'G'      THEN           00000690
         GO  TO  NOT_FOUND;                                             00000700
                                                                        00000710
                                                                        00000720
      EXEC CICS READ DATASET('VSKJEDE')  INTO(REG) RIDFLD(KEYBIT)    ;  00000730
                                                                        00000740
      IF REG.FNR_2                  >    0         &                    00000750
         REG.FNR_2                 ^=    REG.FNR_1 &                    00000760
         REG.KODE                   =   'F'        THEN                 00000770
         DO;                                                            00000780
             FNR_ENDR_REG.FNR1      =    REG.FNR_1                   ;  00000790
             FNR_ENDR_REG.FNR2      =    REG.FNR_2                   ;  00000800
         END;                                                           00000810
                                                                        00000820
   EXEC CICS RETURN;                                                    00000830
                                                                        00000840
 NOT_FOUND:                                                             00000850
   EXEC CICS RETURN;                                                    00000860
                                                                        00000870
   END R00199;                                                          00000880
