 /*       SIST ENDRET 28/07-98 12.50.17 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/07-98 12.27.09 AV   JDA7339                  */00000010
 /*       SIST ENDRET 26/03-98 14.04.45 AV   JDA7339                  */00000020
 /*       SIST ENDRET 26/03-98 14.01.30 AV   JDA7339                  */00000030
 /*       SIST ENDRET 28/07-97 12.33.08 AV   HLA7339                  */00000040
 /*       SIST ENDRET 01/04-96 14.50.03 AV   HLB0310                  */00000050
 /*       SIST ENDRET 03/03-92 09.52.06 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 13/12-91 12.20.24 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 26/04-91 11.45.11 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 13/03-91 13.20.59 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 21/01-91 13.49.34 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 01/12-89 08.39.20 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 16/06-87 08.19.22 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 12/11-84 09.31.27 AV   HERMAN                   */00000130
 /*       SIST ENDRET 05/11-84 13.39.50 AV   FARVIK                   */00000140
 /*       SIST ENDRET 08/10-84 16.21.49 AV   FARVIK                   */00000150
 /*       SIST ENDRET 13/09-84 13.41.15 AV   FARVIK                   */00000160
 /*       SIST ENDRET 28/08-84 08.50.57 AV   KARIN                    */00000170
           /* ************************ */                               00000180
           /* IDENTIFIKASJON: R0011622 */                               00000190
           /*   AJOURFØR_HIST_AVDØDE_  */                               00000200
           /*     I_STATUS             */                               00000210
           /* PROGRAMMERER: HELEN      */                               00000220
           /* DATO:    MAI   1982      */                               00000230
           /* HENSIKT:  OPPRETTER      */                               00000240
           /*   DØDSHISTORIKK FOR EN   */                               00000250
           /*   PERSON SOM HAR         */                               00000260
           /*   PENSJONSSTATUS FRA     */                               00000270
           /*   FØR.                   */                               00000280
           /* BRUK: BRUKES I DEN       */                               00000290
           /*   GENERERTE DØDSMELDING. */                               00000300
           /*   ANDRE OPPLYSNINGER     */                               00000310
           /*   REGISTRERES NÅR DE     */                               00000320
           /*   ENKELTE BLANKETTER     */                               00000330
           /*   BEHANDLES.             */                               00000340
           /* ************************ */                               00000350
 AJOURFØR_HIST_AVDØDE_I_STATUS:                                         00000360
  PROC(IND);                                                            00000370
 DCL IND           FIXED BIN(15);                                       00000380
 DCL 1 HJ_ÅM_PIC   PIC '(4)9';                                          00000390
 DCL 1 HJ_ÅM DEF HJ_ÅM_PIC,                                             00000400
       2 HJ_ÅR     PIC '(2)9',                                          00000410
       2 HJ_MND    PIC '(2)9';                                          00000420
                                                                        00000430
 IF IND > 2 THEN                                                        00000440
    DO;                                                                 00000450
      B02.DØDSDATO_ÅMD(IND)       =  HJ_DØDSDATO_ÅMD;                   00000460
      B02.VIRK_DATO_ÅM(IND)       =  F_SNU_DATO(VIRKNINGSDATO);         00000470
    END;                                                                00000480
    B02.FØRSTE_GANG_REG(IND)    =  'N';                                 00000490
    B02.STATUS_KODE_HIST(IND)   =  'X';                                 00000500
 /* B02.GT_LOV92        (IND)   =    0;             HL*/                00000510
    B02.GT_TILLEGG_LOV92(IND)   =    0;                                 00000520
    B02.FNR_TILKN(IND,*)        =    0;                                 00000530
    B02.TILKNYTNINGSKODE(IND,*) =  ' ';                                 00000540
    B02.FT_FØR_91       (IND,*) =  ' ';                                 00000550
 /*9807: OFFENTLIG AFP AVGIR BARE BUP TIL 64-ÅRS_ÅRET - KODE 'O'*/      00000560
    IF B02.AFP_BUP    (IND)     >  0     THEN    /*9803-FEIL 11A*/      00000570
       IF (B01.PENSJONSTYPE3(IND) = 'K'  !                              00000580
           B01.PENSJONSTYPE3(IND) = 'S')   THEN                         00000590
           B02.KONV_P_KODE(IND)     = 'O';                              00000600
       ELSE                                                             00000610
           B02.KONV_P_KODE(IND)     = 'K';                              00000620
    ELSE                                                                00000630
       B02.ALDERSP(IND)         =   '';                                 00000640
  /*    B02.UFØRPENS(IND)           =   '';     */                      00000650
                                                                        00000660
 /* VI LAR YRKEPENS.YUG , YPT OG YPT_KODE BLI STÅENDE*/                 00000670
 /* OGSÅ PÅ_ETTER91 OG YRKE_POENG_1291   BLIR STÅENDE*/                 00000680
                                                                        00000690
    B02.YRKEPENS.GP(IND)           =   0;                               00000700
    B02.YRKEPENS.BT(IND)           =   0;                               00000710
    B02.YRKEPENS.TP(IND)           =   0;                               00000720
 /* B02.YRKEPENS.SPT(IND)          =   0      HL  */                    00000730
    B02.ETTEPENS(IND)           =   '';                                 00000740
    B02.PENSJONSTYPE1(IND)      =  'D';                                 00000750
    B02.PENSJONSTYPE2(IND)      =  ' ';                                 00000760
    B02.ETTEBARN (IND)          =   '';                                 00000770
    B02.ANTALL_BARN(IND)        =    0;                                 00000780
    B02.SUM_YTELSE (IND)        =    0;                                 00000790
 /* ***************************************************************** */00000800
 /*  AVDØD HAR EKTEFELLE MED PENSJON .                                */00000810
 /* ***************************************************************** */00000820
    IF B01.PENSJONSTYPE2(IND) = 'S' THEN                                00000830
                                                                        00000840
 /* FJERNET OPPDATERING AV TT_ETTER_1966 FOR PERSONER OVER 67 ÅR      */00000850
 /* 12.11.84  HL                                                      */00000860
                                                                        00000870
       IF HJ_DØDSDATO_ÅM   <  SEKSTISJU_ÅRSDATO           THEN          00000880
          DO;                                                           00000890
                                                                        00000900
 /*ENDRET 9.6.87 HL - JFR FEILRAPP 502 -                          */    00000910
 /*TRYGDETIDEN ENDRES IKKE VED DØD, MEN FORDELINGEN MELLOM        */    00000920
 /*FAKTISK OG FRAMTIDIG BLIR ENDRET                               */    00000930
                                                                        00000940
 /*          HJ_ÅM_PIC              = HJ_DØDSDATO_ÅM - 6700;      */    00000950
 /*          B02.TT_ETTER_1966(IND) = (HJ_ÅR * 12) + HJ_MND;      */    00000960
             HJ_ÅM_PIC              =                                   00000970
                              SEKSTISJU_ÅRSDATO - HJ_DØDSDATO_ÅM;       00000980
             B02.TT_FRAMT_DØD(IND)  = (HJ_ÅR *12) + HJ_MND;             00000990
             B02.TT_FRAMT(IND)      = B02.TT_FRAMT_DØD(IND);            00001000
             B02.TT_ETTER_1966(IND) = B01.TT_ETTER_1966(IND) +          00001010
                                      B01.TT_FRAMT(IND)      -          00001020
                                      B02.TT_FRAMT_DØD(IND);            00001030
                                                                        00001040
 /*HIT 9.6.87 HL   */                                                   00001050
                                                                        00001060
          END;                                                          00001070
 /* ***************************************************************** */00001080
 /*  AVDØDE ER UFØRE-/YRKEPENSJONIST                                  */00001090
 /* ***************************************************************** */00001100
    IF B01.PENSJONSTYPE1(IND) = 'U' !                                   00001110
       B01.PENSJONSTYPE1(IND) = 'Y' !                                   00001120
                                B01.PENSJONSTYPE3(IND) = 'U' THEN       00001130
       DO;                                                              00001140
          B02.STATUS.VILKÅR_8_4_3A(IND) =                               00001150
                                    B01.UFØRPENS.VILKÅR_8_4_3A(IND);    00001160
          DO I = 1 TO 7 WHILE (B01.UFT_ÅM(IND,I) > 0);  /*0697 HL*/     00001170
             IF B02.OPPHØRSDATO_ÅM(IND,I) = 0 THEN                      00001180
                DO;                                                     00001190
                   IF B02.PENSJONSTYPE3(IND) = 'A' THEN                 00001200
                      B02.UFØRHIST(IND,I)    = '';                      00001210
                   ELSE                                                 00001220
                      DO;                                               00001230
                         HJ_ÅM_PIC            =      HJ_DØDSDATO_ÅM;    00001240
 /*VED DØDSFALL ETTER 1997 SKAL DET IKKE VÆRE 01 I OPH_MND*/            00001250
                         IF ^(HJ_ÅR  > 97  &                            00001260
                              HJ_MND = 12    )   THEN                   00001270
                            HJ_MND         =      HJ_MND + 1;           00001280
                         IF HJ_MND > 12   THEN                          00001290
                            DO;                                         00001300
                               HJ_MND = 1;                              00001310
                               HJ_ÅR  = HJ_ÅR + 1;                      00001320
                            END;                                        00001330
                         B02.OPPHØRSDATO_ÅM(IND,I) =                    00001340
                                                       HJ_ÅM_PIC;       00001350
                         B02.OPPHØRSKODE(IND,I)    = 'D';               00001360
                                                                        00001370
                      END;                                              00001380
                   I = 7;                             /*0697 HL*/       00001390
                END;                                                    00001400
          END;                                                          00001410
          IF B01.PENSJONSTYPE1(IND) = 'Y'              THEN             00001420
          DO I = 1 TO 5 WHILE (B01.YUFT_ÅM(IND,I) > 0);                 00001430
             IF B02.OPPH_DATO_ÅM(IND,I) = 0 THEN                        00001440
                DO;                                                     00001450
                   IF B02.PENSJONSTYPE3(IND) = 'A' THEN                 00001460
                      B02.YRKEHIST(IND,I)    = '';                      00001470
                   ELSE                                                 00001480
                      DO;                                               00001490
                         B02.OPPH_DATO_ÅM(IND,I) =                      00001500
                                                       HJ_ÅM_PIC;       00001510
                         B02.OPPH_KODE(IND,I)    = 'D';                 00001520
                                                                        00001530
                      END;                                              00001540
                   I = 5;                                               00001550
                END;                                                    00001560
          END;                                                          00001570
       END;                                                             00001580
                                                                        00001590
    B02.PENSJONSTYPE3(IND)      =  ' ';                                 00001600
                                                                        00001610
    IF  O1.PI_DØD > 0 &                                                 00001620
        O1.PI_DØD < 9999999 THEN                                        00001630
        IF  B01.PI_KODE(IND,HJ_DØDSDATO_ÅR_RE - 1)  = 'F'  !            00001640
            B01.PI_KODE(IND,HJ_DØDSDATO_ÅR_RE - 1)  = ' '  THEN         00001650
            DO;                                                         00001660
               B02.PI(IND,HJ_DØDSDATO_ÅR_RE - 1)      = O1.PI_DØD / 100;00001670
               B02.PI_KODE(IND,HJ_DØDSDATO_ÅR_RE - 1) = 'F';            00001680
            END;                                                        00001690
  END AJOURFØR_HIST_AVDØDE_I_STATUS;                                    00001700
                                                                        00001710
                                                                        00001720
