 /*       SIST ENDRET 25/02-97 11.56.05 AV   JDA7339                  */00000000
 /*       SIST ENDRET 13/02-96 15.54.50 AV   HLB0310                  */00000010
 /*       SIST ENDRET 06/02-96 13.27.36 AV   JDA0310                  */00000020
 /*       SIST ENDRET 10/01-96 11.05.30 AV   TSB0310                  */00000030
 /*       SIST ENDRET 23/02-94 11.07.03 AV   TRUDE                    */00000040
 /*       SIST ENDRET 22/02-94 09.44.26 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 21/02-94 12.02.35 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 17/02-94 13.19.51 AV   TRUDE                    */00000070
                                                                        00000080
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000090
                                                                        00000100
          %INCLUDE P0019906;                                            00000110
          %INCLUDE P0019908;                                            00000120
          %INCLUDE P0019910;                                            00000130
          %INCLUDE P0019912;                                            00000140
          %INCLUDE P0019913;                                            00000150
                                                                        00000160
 DCL                                                                    00000170
      (CSTG, ADDR)                   BUILTIN;                           00000180
 DCL  COMMAREA_PEKER         PTR,                                       00000190
      LOKAL_KOM_PTR          PTR;                                       00000200
                                                                        00000210
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000220
 DCL                                                                    00000230
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000240
    DFHBMUNP             CHAR(1) INIT(' '),                             00000250
    DFHBMBRY             CHAR(1) INIT('H'),                             00000260
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000270
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000280
    MELDING6O            CHAR(10),                                      00000290
    YMELDING6O           CHAR(10);                                      00000300
                                                                        00000310
          %INCLUDE S001F1  ;                                            00000320
          %INCLUDE P0011831;                                            00000330
                                                                        00000340
                                                                        00000350
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000360
                                                                        00000370
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000380
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000390
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000400
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000410
                                                                        00000420
                                                                        00000430
                                                                        00000440
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000450
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000460
                                                                        00000470
                                                                        00000480
           CALL OVERFØR_SØKER_TIL_MAP;               /* R0011836 */     00000490
           S001831O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000500
      /*                                                                00000510
           FREE TRANS_OMR,TRANS_OPPL_OMR;                               00000520
      */                                                                00000530
                                                                        00000540
      EXEC CICS RETURN;                                                 00000550
                                                                        00000560
                                                                        00000570
                                                                        00000580
                                                                        00000590
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000600
      PROC(FIXED_DEC_5);                                                00000610
                                                                        00000620
      DCL                                                               00000630
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00000640
                                                                        00000650
   END SKRIV_FEIL;                                                      00000660
                                                                        00000670
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00000680
                                                                        00000690
           DCL                                                          00000700
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00000710
                                                                        00000720
        END SKRIV_FEIL_YP;                                              00000730
                                                                        00000740
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00000750
                                                                        00000760
           DCL                                                          00000770
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00000780
                                                                        00000790
        END SKRIV_FEIL_SP;                                              00000800
                                                                        00000810
          %INCLUDE R0019912;                                            00000820
          %INCLUDE R0011836;                                            00000830
                                                                        00000840
 END R001041;                                                           00000850
