 /*       SIST ENDRET 23/09-94 14.27.57 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 06/03-91 11.50.03 AV   DYBVIK                   */00000010
 %PAGE;                                /*   */                          00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R001N809  -                                                    */00000040
 /*    PROGRAMMERER:                                                  */00000050
 /*HENSIKT:                                                           */00000060
 /*    R001N809 INNHOLDER:                                            */00000070
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000080
 /*           EP_TRANS_OMR.                                           */00000090
 /*    PROSEDYRENE ER SKILT UT FRA R001N802.  R.FARVIK DU AS NOV-90   */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYRENE INCLUDES I ETTERLATTEBEHANDLINGA TIL DET MASKIN-   */00000120
 /*    ELLE FOLKETRYGDSYSTEMET.                                       */00000130
 /*    ARBEIDSOMRÅDE: P001N801  (LIGGER I R001.TEST.COPYLIB)          */00000140
 /*BRUK:                                                              */00000150
 /*    %INCLUDE R001N809;                                             */00000160
 /*    BLANK_EP_MAP:           BLANKER FELTENE PÅ MAPEN               */00000170
 /*    OVERFØR_E3_SØKER:       OVERFØRER EPDELEN MAP->ARBEIDSOMR      */00000180
 /*    OVERFØR_E3_SPES_SØKER:  OVERFØRER SPESIELL DEL SØKER           */00000190
 /*                            MAP->ARBEIDSOMR                        */00000200
 /*    OVERFØR_E3_SPES_AVDØDE: OVERFØRER SPESIELL DEL AVDØDE          */00000210
 /*                            MAP->ARBEIDSOMR                        */00000220
 /*    BLANK_YP_MAP: *//*YS*//*BLANKER FELTENE PÅ MAP YRKESSKADE      */00000230
 /*    OVERFØR_Y3_SØKER:*//*YS*//*OVERFØRER Y.SK.OPPL MAP->ARBEIDSOMR */00000240
 /* ***************************************************************** */00000250
 %PAGE;                                /*   */                          00000260
 /* BLANKING AV MAPEN  */                                               00000270
   BLANK_E3_MAP:                                                        00000280
   PROC;                                                                00000290
   DCL                                                                  00000300
     LOW BUILTIN;                                                       00000310
 /*YS*/S001N81O.REGDATOO = LOW(6);                                      00000320
 /*YS*/S001N81O.TERMIDO  = LOW(4);                                      00000330
       FORVENTETO        = LOW(7);                                      00000340
       FAIO              = LOW(7);                                      00000350
 /*YS*/YSKADE_TILLEGGO   = LOW(1);                                      00000360
       FRAML_DATO_MÅO    = LOW(4);                                      00000370
 /*YS*/S001N81O.FNR_EKO  = LOW(11);                                     00000380
       DØDSDATO_EKO      = LOW(6);                                      00000390
       PI_EKO            = LOW(7);                                      00000400
       VP_ÅR1_EKO        = LOW(2);                                      00000410
       VP_ÅR2_EKO        = LOW(2);                                      00000420
       VP_ÅR3_EKO        = LOW(2);                                      00000430
       VP_ÅR4_EKO        = LOW(2);                                      00000440
       STATSBORGERO      = LOW(3);                                      00000450
       BOSATTO           = LOW(3);                                      00000460
       PENSJONSTRYGDETO  = LOW(1);                                      00000470
       MINST_20ÅRO       = LOW(1);                                      00000480
       FRAVIK_KONVO      = LOW(1);                                      00000490
       FRAVIK_FLYKTO     = LOW(1);                                      00000500
       OVERKOMP_UTLO     = LOW(1);                                      00000510
       IKKE_GPO          = LOW(1);                                      00000520
       BEREGNING_KONVO   = LOW(1);                                      00000530
       TT_KONV_ÅRO       = LOW(2);                                      00000540
       TT_FRA_1937ÅRO    = LOW(2);                                      00000550
       TT_FRA_1937MNDO   = LOW(2);                                      00000560
       TT_NORDEN_ANNETO  = LOW(1);                                      00000570
       VILKÅR_10_5_NR2O  = LOW(2);                                      00000580
       STIO              = LOW(4);                                      00000590
       STATSBORGER_EKO   = LOW(3);                                      00000600
       BOSATT_EKO        = LOW(3);                                      00000610
       FRAVIK_FLYKT_EKO  = LOW(1);                                      00000620
       TT_1937_ÅR_EKO    = LOW(2);                                      00000630
       TT_1937_MND_EKO   = LOW(2);                                      00000640
       OVERKOMP_UTL_EKO  = LOW(1);                                      00000650
       TT_NORD_ANNET_EO  = LOW(1);                                      00000660
       MELDING1O         = (78)' ';                                     00000670
       MELDING2O         = (78)' ';                                     00000680
       MELDING3O         = (78)' ';                                     00000690
       MELDING4O         = (78)' ';                                     00000700
       MELDING5O         = (78)' ';                                     00000710
       MELDING6O         = (78)' ';                                     00000720
   END BLANK_E3_MAP;                                                    00000730
 %PAGE;                                /*   */                          00000740
 /*YS*//* BLANKING AV MAPEN FOR YRKESSKADEOPPL */                       00000750
 /*YS*/BLANK_Y3_MAP:                                                    00000760
 /*YS*/PROC;                                                            00000770
 /*YS*/DCL                                                              00000780
 /*YS*/  LOW BUILTIN;                                                   00000790
 /*YS*/   VILKÅR_1_2_2AO   = LOW(1);                                    00000800
 /*YS*/   VILKÅR_1_2_2BO   = LOW(1);                                    00000810
 /*YS*/   YST_MÅO          = LOW(4);                                    00000820
 /*YS*/   YSYKDOMO         = LOW(1);                                    00000830
 /*YS*/   YUGO             = LOW(3);                                    00000840
 /*YS*/   KAP11_7_UTLØSTO  = LOW(1);                                    00000850
 /*YS*/   YRKE11O          = LOW(1);                                    00000860
 /*YS*/   AÅIO             = LOW(7);                                    00000870
 /*YS*/   S001201O.FNR_EKO = LOW(11);                                   00000880
 /*YS*/   FNR_SAMBOERO     = LOW(11);                                   00000890
 /*YS*/   FNR_Y_BARNO      = LOW(11);                                   00000900
 /*YS*/   PLEIEBARNO       = LOW(1);                                    00000910
 /*YS*/   YMELDING1O       = (78)' ';                                   00000920
 /*YS*/   YMELDING2O       = (78)' ';                                   00000930
 /*YS*/   YMELDING3O       = (78)' ';                                   00000940
 /*YS*/   YMELDING4O       = (78)' ';                                   00000950
 /*YS*/   YMELDING5O       = (78)' ';                                   00000960
 /*YS*/   YMELDING6O       = (78)' ';                                   00000970
 /*YS*/END BLANK_Y3_MAP;                                                00000980
 %PAGE;                                /*   */                          00000990
 /* ***************************************************//*YS*//****** */00001000
 /*                                                   *//*YS*//*      */00001010
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,    *//*YS*//*      */00001020
 /*   EVENTUELT ENDRET PÅ SKJERMBILDET FOR YRKESKADE  *//*YS*//*      */00001030
 /*   TIL TRANSOMR EP.                                *//*YS*//*      */00001040
 /*           MAPSET:  S001203   MAP S001201          *//*YS*//*      */00001050
 /*                                                   *//*YS*//*      */00001060
 /* ***************************************************//*YS*//****** */00001070
 %SKIP;                                                                 00001080
 /*YS*/OVERFØR_Y3_SØKER:                                                00001090
 /*YS*/PROC;                                                            00001100
 /*YS*/ IF VILKÅR_1_2_2AL > 0 THEN                                      00001110
 /*YS*/    E3Y.VILKÅR_1_2_2A = VILKÅR_1_2_2AI;                          00001120
 /*YS*/ IF VILKÅR_1_2_2BL > 0 THEN                                      00001130
 /*YS*/    E3Y.VILKÅR_1_2_2B = VILKÅR_1_2_2BI;                          00001140
 /*YS*/ IF YST_MÅL > 0 THEN                                             00001150
 /*YS*/    E3Y.YST_MÅ = F_FELT_CHAR_PIC4(YST_MÅI);                      00001160
 /*YS*/ IF YSYKDOML > 0 THEN                                            00001170
 /*YS*/    E3Y.YSYKDOM = YSYKDOMI;                                      00001180
 /*YS*/ IF YUGL > 0 THEN                                                00001190
 /*YS*/    E3Y.YUG = F_FELT_CHAR_PIC3(YUGI);                            00001200
 /*YS*/ IF KAP11_7_UTLØSTL > 0 THEN                                     00001210
 /*YS*/    E3Y.KAP_11_7_UTLØST = KAP11_7_UTLØSTI;                       00001220
 /*YS*/ IF YRKE11L > 0 THEN                                             00001230
 /*YS*/    E3Y.YRKE11 = YRKE11I;                                        00001240
 /*YS*/ IF AÅIL > 0 THEN                                                00001250
 /*YS*/    E3Y.AÅI = F_FELT_CHAR_PIC7(AÅII);                            00001260
 /*YS*/ IF S001201I.FNR_EKL > 0 THEN                                    00001270
 /*YS*/    E3Y.FNR_EK = F_FELT_CHAR_PIC11(S001201I.FNR_EKI);            00001280
 /*YS*/ IF FNR_SAMBOERL > 0 THEN                                        00001290
 /*YS*/    E3Y.FNR_SAMBOER = F_FELT_CHAR_PIC11(FNR_SAMBOERI);           00001300
 /*YS*/ IF FNR_Y_BARNL > 0 THEN                                         00001310
 /*YS*/    E3Y.FNR_Y_BARN = F_FELT_CHAR_PIC11(FNR_Y_BARNI);             00001320
 /*YS*/ IF PLEIEBARNL > 0 THEN                                          00001330
 /*YS*/    E3Y.PLEIEBARN = PLEIEBARNI;                                  00001340
 /*YS*/END OVERFØR_Y3_SØKER;                                            00001350
 %PAGE;                                /*   */                          00001360
 /* ***************************************************************** */00001370
 /*                                                                   */00001380
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00001390
 /*   EVENTUELT ENDRET PÅ SKJERMBILDET TIL EP_TRANS_OMR I             */00001400
 /*   KOM_OMR FOR EP_SØKER.                                           */00001410
 /*           MAPSET:  S001N83   MAP S001N81                          */00001420
 /*                                                                   */00001430
 /* ***************************************************************** */00001440
 %SKIP;                                                                 00001450
   OVERFØR_E3_SØKER:                                                    00001460
   PROC;                                                                00001470
 /*YS*/ IF S001N81I.REGDATOL > 0 THEN                                   00001480
 /*YS*/    E3S.REGDATO = F_FELT_CHAR_PIC6(S001N81I.REGDATOI);           00001490
 /*YS*/ IF S001N81I.TERMIDL > 0 THEN                                    00001500
 /*YS*/    E3S.TERMID = S001N81I.TERMIDI;                               00001510
 /*YS*/ IF S001N81I.FNRL > 0 THEN                                       00001520
 /*YS*/    E3S.FNR = F_FELT_CHAR_PIC11(S001N81I.FNRI);                  00001530
 /*YS*/ IF S001N81I.NAVNL > 0 THEN                                      00001540
 /*YS*/    E3S.NAVN = S001N81I.NAVNI;                                   00001550
        IF SPRÅKL > 0 THEN                                              00001560
           E3S.SPRÅK = SPRÅKI;                                          00001570
        IF S001N81I.TKNRL > 0 THEN                                      00001580
           E3S.TKNR = F_FELT_CHAR_PIC4(S001N81I.TKNRI);                 00001590
        IF SIVILSTANDL > 0 THEN                                         00001600
           E3S.SIVILSTAND = SIVILSTANDI;                                00001610
        IF NORSK_BOSATTL > 0 THEN                                       00001620
           E3S.NORSK_BOSATT = NORSK_BOSATTI;                            00001630
        IF VILKÅR_10_5L > 0 THEN                                        00001640
           E3S.VILKÅR_10_5 = VILKÅR_10_5I;                              00001650
        IF OMSORG_AVD_BAL > 0 THEN                                      00001660
           E3S.OMSORG_AVD_BA = OMSORG_AVD_BAI;                          00001670
        IF FORVENTETL > 0 THEN                                          00001680
           E3S.FORVENTET = F_FELT_CHAR_PIC7(FORVENTETI);                00001690
        IF FAIL > 0 THEN                                                00001700
           E3S.FAI = F_FELT_CHAR_PIC7(FAII);                            00001710
 /*YS*/ IF YSKADE_TILLEGGL > 0 THEN                                     00001720
 /*YS*/    E3S.YSKADE_TILLEGG = YSKADE_TILLEGGI;                        00001730
        IF GP_OS_KODEL > 0 THEN                                         00001740
           E3S.GP_OS_KODE = GP_OS_KODEI;                                00001750
        IF FRAML_DATO_MÅL > 0 THEN                                      00001760
           E3S.FRAMLEGGSDATO_MÅ = F_FELT_CHAR_PIC4(FRAML_DATO_MÅI);     00001770
        IF FRAMLEGGSKODEL > 0 THEN                                      00001780
           E3S.FRAMLEGGSKODE = FRAMLEGGSKODEI;                          00001790
        IF VIRK_DATO_MÅL > 0 THEN                                       00001800
           E3S.VIRK_DATO_MÅ = F_FELT_CHAR_PIC4(VIRK_DATO_MÅI);          00001810
 /*YS*/ IF S001N81I.FNR_EKL > 0 THEN                                    00001820
 /*YS*/    E3S.FNR_EK = F_FELT_CHAR_PIC11(S001N81I.FNR_EKI);            00001830
        IF NAVN_EKL > 0 THEN                                            00001840
           E3S.NAVN_EK = NAVN_EKI;                                      00001850
        IF NORSK_BOSATT_EKL > 0 THEN                                    00001860
           E3S.NORSK_BOSATT_EK = NORSK_BOSATT_EKI;                      00001870
        IF DØDSDATO_EKL > 0 THEN                                        00001880
           E3S.DØDSDATO_EK = F_FELT_CHAR_PIC6(DØDSDATO_EKI);            00001890
        IF VILKÅR_8_4_EKL > 0 THEN                                      00001900
           E3S.VILKÅR_8_4_EK = VILKÅR_8_4_EKI;                          00001910
        IF PI_EKL > 0 THEN                                              00001920
           E3S.PI_EK = F_FELT_CHAR_PIC7(PI_EKI);                        00001930
        IF VP_ÅR1_EKL > 0 THEN                                          00001940
           E3S.VP_ÅR_EK(1) = F_FELT_CHAR_PIC2(VP_ÅR1_EKI);              00001950
        IF VP_ÅR2_EKL > 0 THEN                                          00001960
           E3S.VP_ÅR_EK(2) = F_FELT_CHAR_PIC2(VP_ÅR2_EKI);              00001970
        IF VP_ÅR3_EKL > 0 THEN                                          00001980
           E3S.VP_ÅR_EK(3) = F_FELT_CHAR_PIC2(VP_ÅR3_EKI);              00001990
        IF VP_ÅR4_EKL > 0 THEN                                          00002000
           E3S.VP_ÅR_EK(4) = F_FELT_CHAR_PIC2(VP_ÅR4_EKI);              00002010
   END OVERFØR_E3_SØKER;                                                00002020
 %PAGE;                                 /*  */                          00002030
 /* ***************************************************************** */00002040
 /*                                                                   */00002050
 /*   PROSEDYRE FOR Å OVERFØRE SPESIELLE OPPLYSNINGER FRA             */00002060
 /*   SKJERMBILDET TIL EP_TRANS_OMR I KOM_OMR FOR EP_SPES.OPPL.SØKER  */00002070
 /*                 MAPSET S001N83   MAP S001N81                      */00002080
 /*                                                                   */00002090
 /* ***************************************************************** */00002100
 %SKIP(1);                                                              00002110
   OVERFØR_E3_SPES_SØKER:                                               00002120
   PROC;                                                                00002130
      IF STATSBORGERL > 0 THEN                                          00002140
           E3SP.STATSBORGER = F_FELT_CHAR_PIC3(STATSBORGERI);           00002150
      IF BOSATTL > 0 THEN                                               00002160
           E3SP.BOSATT = F_FELT_CHAR_PIC3(BOSATTI);                     00002170
      IF PENSJONSTRYGDETL > 0 THEN                                      00002180
         E3SP.PENSJONSTRYGDET = PENSJONSTRYGDETI;                       00002190
      IF MINST_20ÅRL > 0 THEN                                           00002200
         E3SP.MINST_20ÅR = MINST_20ÅRI;                                 00002210
      IF FRAVIK_KONVL > 0 THEN                                          00002220
         E3SP.FRAVIK_KONVENSJON = FRAVIK_KONVI;                         00002230
      IF FRAVIK_FLYKTL > 0 THEN                                         00002240
         E3SP.FRAVIK_FLYKT = FRAVIK_FLYKTI;                             00002250
      IF OVERKOMP_UTLL > 0 THEN                                         00002260
         E3SP.OVERKOMP_UTL = OVERKOMP_UTLI;                             00002270
      IF IKKE_GPL > 0 THEN                                              00002280
         E3SP.IKKE_GP = IKKE_GPI;                                       00002290
      IF BEREGNING_KONVL > 0 THEN                                       00002300
         E3SP.BEREGNING_KONVENSJON = BEREGNING_KONVI;                   00002310
      IF TT_KONV_ÅRL > 0 THEN                                           00002320
         E3SP.TT_KONVENSJON_ÅR = TT_KONV_ÅRI;                           00002330
      IF TT_KONV_ÅRL > 0 THEN                                           00002340
         E3SP.TT_KONVENSJON_ÅR = F_FELT_CHAR_PIC2(TT_KONV_ÅRI);         00002350
      IF TT_FRA_1937ÅRL > 0 THEN                                        00002360
         E3SP.TT_FRA_1937ÅR = F_FELT_CHAR_PIC2(TT_FRA_1937ÅRI);         00002370
      IF TT_FRA_1937MNDL > 0 THEN                                       00002380
         E3SP.TT_FRA_1937MND = F_FELT_CHAR_PIC2(TT_FRA_1937MNDI);       00002390
      IF VILKÅR_10_5_NR2L > 0 THEN                                      00002400
         E3SP.VILKÅR_10_5_NR2 = VILKÅR_10_5_NR2I;                       00002410
      IF TT_NORDEN_ANNETL > 0 THEN                                      00002420
         E3SP.TT_NORDEN_ANNET = TT_NORDEN_ANNETI;                       00002430
      IF STIL > 0 THEN                                                  00002440
           E3SP.STI = F_FELT_CHAR_PIC4(STII);                           00002450
   END OVERFØR_E3_SPES_SØKER;                                           00002460
 %PAGE;                         /*  */                                  00002470
 /* ***************************************************************** */00002480
 /*                                                                   */00002490
 /*   PROSEDYRE FOR Å OVERFØRE SPESIELLE OPPLYSNINGER FRA             */00002500
 /*   SKJERMBILDET TIL EP_TRANS_OMR I KOM_OMR FOR EP_SPES_AVDØDE.     */00002510
 /*                 MAPSET: S001N83   MAP: S001N81                    */00002520
 /*                                                                   */00002530
 /* ***************************************************************** */00002540
 %SKIP(1);                                                              00002550
   OVERFØR_E3_SPES_AVDØDE:                                              00002560
   PROC;                                                                00002570
      IF STATSBORGER_EKL > 0 THEN                                       00002580
           E3SP.STATSBORGER_EK = F_FELT_CHAR_PIC3(STATSBORGER_EKI);     00002590
      IF BOSATT_EKL > 0 THEN                                            00002600
           E3SP.BOSATT_EK = F_FELT_CHAR_PIC3(BOSATT_EKI);               00002610
      IF FRAVIK_FLYKT_EKL > 0 THEN                                      00002620
         E3SP.FRAVIK_FLYKT_EK = FRAVIK_FLYKT_EKI;                       00002630
      IF TT_1937_ÅR_EKL > 0 THEN                                        00002640
           E3SP.TT_FRA_1937_ÅR_EK = TT_1937_ÅR_EKI ;                    00002650
       /*                                                               00002660
           E3SP.TT_FRA_1937_ÅR_EK = F_FELT_CHAR_PIC2(TT_1937_ÅR_EKI);   00002670
       ENDERET SP 23.9.94  */                                           00002680
                                                                        00002690
      IF TT_1937_MND_EKL > 0 THEN                                       00002700
           E3SP.TT_FRA_1937_MND_EK = TT_1937_MND_EKI ;                  00002710
      /*                                                                00002720
           E3SP.TT_FRA_1937_MND_EK = F_FELT_CHAR_PIC2(TT_1937_MND_EKI); 00002730
       ENDERET SP 23.9.94  */                                           00002740
      IF TT_NORD_ANNET_EL > 0 THEN                                      00002750
         E3SP.TT_NORDEN_ANNET_EK = TT_NORD_ANNET_EI;                    00002760
      IF OVERKOMP_UTL_EKL > 0 THEN                                      00002770
         E3SP.OVERKOMP_UTL_EK = OVERKOMP_UTL_EKI;                       00002780
   END OVERFØR_E3_SPES_AVDØDE;                                          00002790
