 /*       SIST ENDRET 23/05-86 09.03.15 AV   ANNE                     */00000000
 /*       SIST ENDRET 20/02-86 11.53.12 AV   FARVIK                   */00000010
 /*       SIST ENDRET 19/02-86 14.41.56 AV   ANNE                     */00000020
 /*       SIST ENDRET 22/09-83 09.25.13 AV   JANKR                    */00000030
 /* ***************************************************************** */00000040
 /* IDENTIFIKASJON                                                    */00000050
 /*     R0010427 - PROGRAM SOM HENTER FRAM OMREGNINGSLOGGEN,          */00000060
 /*                KJØRES UNDER ADMINISTRASJONSDELEN AV SYSTEMET.     */00000070
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000080
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SEPTEMBER 1983.             */00000090
 /* HENSIKT                                                           */00000100
 /*     PROGRAMMET SKAL LESE RECORDENE I OMREGNINGSLOGGEN OG PAGE     */00000110
 /*     DISSE UT TIL TERMINAL.                                        */00000120
 /* PROGRAMTILKNYTNING                                                */00000130
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */00000140
 /*     UNDER ADMINISTRASJONSDELEN.                                   */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
                                                                        00000180
 R0010427: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);        00000190
                                                                        00000200
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000210
    %INCLUDE S001A0;              /* HOVED - MAP FOR ADMINISTRASJON   */00000220
    %INCLUDE P0019908;            /* KOM_OMR                          */00000230
    %INCLUDE P0019910;            /* STYRE_OMR                        */00000240
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000250
    %INCLUDE S001A7;              /* MAP TIL Å BESTEMME HVILKEN       */00000260
                                  /* SATSVIS JOBB SOM SKAL KJØRES     */00000270
                                                                        00000280
    DCL PLIXOPT CHAR(27) VAR STATIC EXTERNAL                            00000290
                            INIT('ISASIZE(3000) NOSTAE NOSPIE');        00000300
    DCL                                                                 00000310
      ACCUM_ANT_G_STAT           FIXED DEC(7) INIT(0),                  00000320
      ACCUM_ANT_OMR_FAM          FIXED DEC(7) INIT(0),                  00000330
      ACCUM_ANT_TIL_TRKLISTE     FIXED DEC(7) INIT(0),                  00000340
      ACCUM_ANT_TIL_OMRNULL      FIXED DEC(7) INIT(0),                  00000350
      CSTG                       BUILTIN,                               00000360
      ADDR                       BUILTIN,                               00000370
      LOW                        BUILTIN,                               00000380
      MAP_CHAR                   CHAR(250) BASED(BMSMAPBR),             00000390
      UNP                        CHAR(1)      INIT(' '),                00000400
      BRI_PROT                   CHAR(1)      INIT('Y'),                00000410
      RBA_PEKER                  POINTER,                               00000420
      BMSMAPBR                   POINTER,                               00000430
      COMMAREA_PEKER             POINTER;                               00000440
                                                                        00000450
                                                                        00000460
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);             00000470
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);               00000480
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000490
    TRANSKODE               = 'RA27';        /* DETTE PROGRAM  */       00000500
    PROGRAM_ID              = 'R0010427'  ;  /* DETTE PROGRAM  */       00000510
                                                                        00000520
                                                                        00000530
    EXEC CICS HANDLE CONDITION ENDFILE(ENDFILE);                        00000540
    EXEC CICS STARTBR DATASET ('OMRLOGG') RIDFLD(RBA_PEKER) RBA;        00000550
    EXEC CICS READNEXT DATASET ('OMRLOGG') RIDFLD(RBA_PEKER) RBA        00000560
                                           SET   (BMSMAPBR);            00000570
                                                                        00000580
    DO WHILE ('A' = 'A');                                               00000590
                                                                        00000600
       EXEC CICS READNEXT DATASET ('OMRLOGG') RIDFLD(RBA_PEKER) RBA     00000610
                                              SET   (BMSMAPBR);         00000620
       ACCUM_ANT_G_STAT       =                                         00000630
             ACCUM_ANT_G_STAT       + S001A7O.ANT_G_STATO;              00000640
       ACCUM_ANT_OMR_FAM      =                                         00000650
             ACCUM_ANT_OMR_FAM      + S001A7O.ANT_OMR_FAMO;             00000660
       ACCUM_ANT_TIL_OMRNULL  =                                         00000670
             ACCUM_ANT_TIL_OMRNULL  + S001A7O.ANT_TIL_OMRNULLO;         00000680
       ACCUM_ANT_TIL_TRKLISTE =                                         00000690
             ACCUM_ANT_TIL_TRKLISTE + S001A7O.ANT_TIL_TRKLISTO;         00000700
                                                                        00000710
       S001A7O.DATO_MÅA       =       UNP;                              00000720
       S001A7O.RECORD_TYPEA   =       BRI_PROT;                         00000730
       S001A7I.DATO_MÅL       =       -1;                               00000740
                                                                        00000750
       EXEC CICS SEND MAP('S001A7') MAPSET('S001A73')  ERASE            00000760
                          CURSOR    ACCUM PAGING;                       00000770
                                                                        00000780
    END;                                                                00000790
                                                                        00000800
                                                                        00000810
                                                                        00000820
                                                                        00000830
  ENDFILE:                                                              00000840
    MAP_CHAR                  =  LOW (250);                             00000850
    S001A7O.DATO_MÅA          =  UNP;                                   00000860
    S001A7I.DATO_MÅI          =  ' ';                                   00000870
    S001A7I.DATO_MÅL          =  -1;                                    00000880
    S001A7O.ANT_G_STATO       =  ACCUM_ANT_G_STAT;                      00000890
    S001A7O.ANT_OMR_FAMO      =  ACCUM_ANT_OMR_FAM;                     00000900
    S001A7O.ANT_TIL_OMRNULLO  =  ACCUM_ANT_TIL_OMRNULL ;                00000910
    S001A7O.ANT_TIL_TRKLISTO  =  ACCUM_ANT_TIL_TRKLISTE;                00000920
    S001A7O.MELDINGO          = 'HER ER DE AKKUMULERTE TALLENE';        00000930
                                                                        00000940
    EXEC CICS SEND   MAP('S001A7') MAPSET('S001A73')  ERASE             00000950
                                   CURSOR  ACCUM PAGING;                00000960
                                                                        00000970
    EXEC CICS SEND   PAGE RETAIN;                                       00000980
                                                                        00000990
    EXEC CICS SEND   MAP  ('S001A0') MAPSET  ('S001A03') MAPONLY ERASE; 00001000
                                                                        00001010
    EXEC CICS RETURN TRANSID('RA20') COMMAREA(KOM_OMR);                 00001020
                                                                        00001030
 END R0010427;                                                          00001040
                                                                        00001050
