 /*       SIST ENDRET 05/12-97 12.28.45 AV   JDA7339                  */00000000
 /*       SIST ENDRET 27/11-97 10.58.58 AV   JDA7339                  */00000010
 /*       SIST ENDRET 26/08-94 08.51.59 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 25/02-94 14.56.40 AV   HERMAN                   */00000030
 /*       SIST ENDRET 25/02-94 12.23.29 AV   HERMAN                   */00000040
 /*       SIST ENDRET 06/01-93 12.29.57 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 03/01-92 11.01.31 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 10/10-91 13.57.53 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 06/12-90 13.43.49 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 02/08-90 13.18.30 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 23/07-90 13.15.42 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 25/10-88 13.04.38 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 16/05-88 12.28.41 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 25/04-86 07.54.57 AV   TASSEN                   */00000130
 /*       SIST ENDRET 28/06-84 10.01.20 AV   OLAV                     */00000140
 /*       SIST ENDRET 12/06-84 11.59.57 AV   FARVIK                   */00000150
 /*       SIST ENDRET 04/06-84 09.49.43 AV   FARVIK                   */00000160
 /*       SIST ENDRET 17/02-84 12.05.35 AV   OLAV                     */00000170
 /*       SIST ENDRET 02/12-83 09.09.59 AV   LUNDEBY                  */00000180
 /*       SIST ENDRET 04/11-83 13.13.41 AV   FARVIK                   */00000190
 /*       SIST ENDRET 09/09-83 12.14.04 AV   DYBVIK                   */00000200
                                                                        00000210
                                                                        00000220
 /* ***************************************************************** */00000230
 /*IDENTIFIKASJON:                                                    */00000240
 /*    R0011403 - PROSEDYRE I PLI                                     */00000250
 /*    PROGRAMMERER: JAN, SEPTEMBER 1981                              */00000260
 /*HENSIKT:                                                           */00000270
 /*    PROSEDYREN FORETAR KONTROLL AV DATA FRA ENDRINGSBLANKETTEN     */00000280
 /*    FELTENE 1,6 OG 7                                               */00000290
 /*PROGRAMTILKNYTNING:                                                */00000300
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV ENDRINGS-        */00000310
 /*    BLANKETTEN.                                                    */00000320
 /*    INCLUDES I  R0011401.                                          */00000330
 /*BRUK:                                                              */00000340
 /* CALL KONRTOLL_E1_SØKER(FEIL_I_E1_SØKER);                          */00000350
 /*                                                                   */00000360
 /* ***************************************************************** */00000370
 /*                                                                   */00000380
 /*ENDRET: 14.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000390
 /* ******                                                            */00000400
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000410
 /*    OM FNR ER ENDRET (R0019906).                                   */00000420
 /* ***************************************************************** */00000430
 /*                                                                   */00000440
 /*   MODULEN KONTROLLERER E1_SØKER, OG RETURNERER                    */00000450
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000460
 /*                                                                   */00000470
 /* ***************************************************************** */00000480
                                                                        00000490
                                                                        00000500
 KONTROLL_E1_SØKER:                                                     00000510
   PROC (FEIL_FUNNET);                                                  00000520
                                                                        00000530
                                                                        00000540
   DCL                                                                  00000550
      FEIL_FUNNET BIT (1);                                              00000560
                                                                        00000570
 /* ***************************************************************** */00000580
 /* DIVERSE DEKLARASJONER                                             */00000590
 /* DCL'ENE ER UTVIDET I FORB. MED FEILM.NR. 290.  21.2.86.  ERIK S.  */00000600
 /* ***************************************************************** */00000610
                                                                        00000620
   DCL                                                                  00000630
      DAGENS_DATO_ÅMD                                  PIC '999999'    ,00000640
      DAGENS_DATO_ÅM DEF DAGENS_DATO_ÅMD               PIC '9999'      ,00000650
      DAGENS_DATO_Å  DEF DAGENS_DATO_ÅMD               PIC '99'        ,00000660
      DAGENS_DATO_M  DEF DAGENS_DATO_ÅMD POS (3)       PIC '99'        ,00000670
      DAGENS_DATO_D  DEF DAGENS_DATO_ÅMD POS (5)       PIC '99'        ;00000680
                                                                        00000690
   DCL                                                                  00000700
      HJ_DAGENS_DATO_ÅM                                PIC '9999'      ,00000710
      HJ_DAGENS_DATO_Å  DEF HJ_DAGENS_DATO_ÅM          PIC '99'        ,00000720
      HJ_DAGENS_DATO_M  DEF HJ_DAGENS_DATO_ÅM  POS (3) PIC '99'        ;00000730
                                                                        00000740
   DCL                                                                  00000750
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000760
      KEY_PEKER                  POINTER,                               00000770
      TK_RECL                    CHAR (101);                            00000780
                                                                        00000790
 /* ***************************************************************** */00000800
 /*  HJELPE DCL FOR Å SNU VIRK.DATO                                   */00000810
 /* ***************************************************************** */00000820
                                                                        00000830
   DCL                                                                  00000840
      HJ_VIRK_DATO_ÅM PIC '9999',                                       00000850
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00000860
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99';                  00000870
                                                                        00000880
   DCL                                                                  00000890
      HJ_VIRK_DATO_MÅ PIC '9999',                                       00000900
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00000910
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99';               00000920
                                                                        00000930
   DCL                                                                  00000940
      1 FNR_REG,                                                        00000950
        2 FNR1        FIXED DEC(11),                                    00000960
        2 FNR2        FIXED DEC(11),                                    00000970
        2 BRUKERID    CHAR     ( 4);                                    00000980
                                                                        00000990
                                                                        00001000
                                                                        00001010
      FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                       00001020
      ANT_FEIL_SKREVET =  0;                                            00001030
      FEIL_FUNNET      = '0'B;                                          00001040
      KEY_PEKER        =  ADDR(E1S.TKNR);                               00001050
                                                                        00001060
 /* ***************************************************************** */00001070
 /* DATE () ER EN BUILT-IN-FUNCTION I PLI SOM RETURNERER DAGENS DATO  */00001080
 /* I FORMEN ÅR/MÅNED/DAG.                                            */00001090
 /* ***************************************************************** */00001100
                                                                        00001110
      DAGENS_DATO_ÅMD = DATE ();                                        00001120
                                                                        00001130
                                                                        00001140
    HJ_VIRK_DATO_MÅ  = E1S.VIRK_DATO_MÅ;                                00001150
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00001160
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00001170
                                                                        00001180
                                                                        00001190
   /*ENDRING 9711 HL*/                                                  00001200
   IF HJ_VIRK_DATO_ÅM > 9801  THEN                                      00001210
      DO;                                                               00001220
         FEIL_FUNNET = '1'B;                                            00001230
         E1S.VIRK_DATO_MÅNR = 1543;                                     00001240
      END;                                                              00001250
                                                                        00001260
                                                                        00001270
 /* ***************************************************************** */00001280
 /* KONTROLL AV FELT 1 (OPPLYSNINGER OM STØNADSMOTTAKEREN)            */00001290
 /*                                                                   */00001300
 /* F_NUMERISK KONTROLLERER OM ET OVERFØRT CHAR FELT ER NUMERISK.     */00001310
 /* DERSOM FELTET ER NUMERISK RETURNERES '1' B, HVIS IKKE '0'B.       */00001320
 /* ***************************************************************** */00001330
                                                                        00001340
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(E1S.FNR)) THEN                  00001350
                                                                        00001360
 /* ***************************************************************** */00001370
 /* F_FELT_PIC_CHAR ER EN FUNKSJON SOM KONVERTERER PIC-FELT TIL CHAR  */00001380
 /* ***************************************************************** */00001390
                                                                        00001400
         DO;                                                            00001410
            FEIL_FUNNET = '1'B;                                         00001420
                                                                        00001430
 /* ***************************************************************** */00001440
 /* FEILMELDING 200: TEGN SOM IKKE ER TALL FOREKOMMER I TALLFELTET    */00001450
 /* ***************************************************************** */00001460
                                                                        00001470
            E1S.FNRNR   = 200;                                          00001480
         END;                                                           00001490
      ELSE                                                              00001500
                                                                        00001510
 /* ***************************************************************** */00001520
 /* F_GYLDIG_FNR ER EN FUNKSJON SOM KONTROLLERER OM FNR ER GYLDIG.    */00001530
 /* HVIS DET IKKE ER NUMERISK ELLER INNEHOLDER FEIL RETURNERES '0'B.  */00001540
 /* HVIS FØDSELSNUMMERET BLIR AKSEPTERT RETURNESES '1'B               */00001550
 /* ***************************************************************** */00001560
                                                                        00001570
      IF ^ F_GYLDIG_FNR(E1S.FNR) THEN                                   00001580
         DO;                                                            00001590
            FEIL_FUNNET = '1'B;                                         00001600
                                                                        00001610
 /* ***************************************************************** */00001620
 /* FEILMELDING 1: FEIL I FØDSELSNUMMER                               */00001630
 /* ***************************************************************** */00001640
                                                                        00001650
            E1S.FNRNR   = 1;                                            00001660
         END;                                                           00001670
      ELSE                                                              00001680
         DO;                                                            00001690
            FNR_REG.FNR1 = E1S.FNR;                                     00001700
            EXEC CICS LINK PROGRAM ('R0019906') COMMAREA (FNR_REG);     00001710
            IF FNR_REG.FNR2 > 0 THEN                                    00001720
              DO;                                                       00001730
                                                                        00001740
 /* ***************************************************************** */00001750
 /* FEILMELDING 203: DETTE FØDSELSNUMMERER ER ENDRET                  */00001760
 /* ***************************************************************** */00001770
                                                                        00001780
                E1S.FNRNR   = 203;                                      00001790
                E1S.FNR_GML = E1S.FNR;                                  00001800
                E1S.FNR     = FNR_REG.FNR2;                             00001810
              END;                                                      00001820
         END;                                                           00001830
                                                                        00001840
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E1S.TKNR)) THEN                  00001850
         DO;                                                            00001860
            FEIL_FUNNET = '1'B;                                         00001870
            E1S.TKNRNR  = 200;                                          00001880
         END;                                                           00001890
      ELSE                                                              00001900
         DO;                                                            00001910
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                  00001920
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)          00001930
                                                     INTO(TK_RECL);     00001940
            GOTO TKNR_UT;                                               00001950
   NOTFND:                                                              00001960
            FEIL_FUNNET = '1'B;                                         00001970
                                                                        00001980
 /* ***************************************************************** */00001990
 /* FEILMELD 3: FEIL I TRYGDEKONTORNUMMER                             */00002000
 /* ***************************************************************** */00002010
                                                                        00002020
                  E1S.TKNRNR  = 3;                                      00002030
                  LEAVE;                                                00002040
             TKNR_UT:                                                   00002050
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00002060
         END;                                                           00002070
                                                                        00002080
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(E1S.VIRK_DATO_MÅ)) THEN          00002090
         DO;                                                            00002100
            FEIL_FUNNET        = '1'B;                                  00002110
            E1S.VIRK_DATO_MÅNR = 200;                                   00002120
         END;                                                           00002130
      ELSE                                                              00002140
                                                                        00002150
 /* **************************************************************** */ 00002160
 /* FUNKSJONEN F_GYLDIG_DATO KONTROLLERER OM EN DATO(ÅR/MND) ER      */ 00002170
 /* GYLDIG. HVIS GYLDIG RETURNERES '1'B, HVIS IKKE GYLDIG '0'B.      */ 00002180
 /* **************************************************************** */ 00002190
                                                                        00002200
      IF ^ F_GYLDIG_DATO(E1S.VIRK_DATO_MÅ) THEN                         00002210
         DO;                                                            00002220
            FEIL_FUNNET        = '1'B;                                  00002230
                                                                        00002240
 /* **************************************************************** */ 00002250
 /* FEILMELD 9: UGYLDIG VIRKNINGSDATO                                */ 00002260
 /* **************************************************************** */ 00002270
                                                                        00002280
            E1S.VIRK_DATO_MÅNR = 9;                                     00002290
         END;                                                           00002300
                                                                        00002310
      IF VERIFY(E1S.SKILSMISSE,'X ') ^= 0 THEN                          00002320
         DO;                                                            00002330
            FEIL_FUNNET = '1'B;                                         00002340
                                                                        00002350
 /* ***************************************************************** */00002360
 /* FEILMELD 264: FEIL I SKILSMISSE                                   */00002370
 /* ***************************************************************** */00002380
                                                                        00002390
            E1S.SKILSMISSENR = 264;                                     00002400
         END;                                                           00002410
                                                                        00002420
                                                                        00002430
      IF VERIFY(E1S.FLYTTET_SAMMEN,'X ') ^= 0 THEN                      00002440
         DO;                                                            00002450
            FEIL_FUNNET = '1'B;                                         00002460
                                                                        00002470
 /* ***************************************************************** */00002480
 /* FEILMELD 264: FEIL I FLYTTET SAMMEN.                              */00002490
 /* ***************************************************************** */00002500
                                                                        00002510
            E1S.FLYTTET_SAMMENNR = 264;                                 00002520
         END;                                                           00002530
                                                                        00002540
                                                                        00002550
                                                                        00002560
      IF VERIFY(E1S.FLYTTET_FRA,'X ') ^= 0 THEN                         00002570
         DO;                                                            00002580
            FEIL_FUNNET = '1'B;                                         00002590
                                                                        00002600
 /* ***************************************************************** */00002610
 /* FEILMELD 264: FEIL I FLYTTET FRA.                                 */00002620
 /* ***************************************************************** */00002630
                                                                        00002640
            E1S.FLYTTET_SAMMENNR = 264;                                 00002650
         END;                                                           00002660
                                                                        00002670
                                                                        00002680
                                                                        00002690
      IF VERIFY(E1S.EK_INNTU,'X ') ^= 0 THEN                            00002700
         DO;                                                            00002710
            FEIL_FUNNET = '1'B;                                         00002720
                                                                        00002730
 /* ***************************************************************** */00002740
 /* FEILMELD 275: UGYLDIG KODE.                                       */00002750
 /* ***************************************************************** */00002760
                                                                        00002770
            E1S.EK_INNTUNR = 275;                                       00002780
         END;                                                           00002790
                                                                        00002800
                                                                        00002810
      IF VERIFY(E1S.EK_INNTM,'X ') ^= 0 THEN                            00002820
         DO;                                                            00002830
            FEIL_FUNNET = '1'B;                                         00002840
                                                                        00002850
 /* ***************************************************************** */00002860
 /* FEILMELD 275: UGYLDIG KODE.                                       */00002870
 /* ***************************************************************** */00002880
                                                                        00002890
            E1S.EK_INNTMNR = 275;                                       00002900
         END;                                                           00002910
                                                                        00002920
 /* **************************************************************** */ 00002930
 /* KONTROLL AV FELT 6 (ENDRING I EKTESKAPSFORHOLD)                  */ 00002940
 /* **************************************************************** */ 00002950
                                                                        00002960
      IF E1S.FNR_EK  > 0 THEN                                           00002970
         DO;                                                            00002980
            IF    E1S.SKILSMISSE     = 'X' !                            00002990
                  E1S.FLYTTET_FRA    = 'X' !                            00003000
                  E1S.EK_INNTU       = 'X' !                            00003010
                  E1S.EK_INNTM       = 'X' !                            00003020
                  E1S.FLYTTET_SAMMEN = 'X'                              00003030
                                            THEN                        00003040
               DO;                                                      00003050
                  FEIL_FUNNET          = '1'B;                          00003060
                                                                        00003070
 /* **************************************************************** */ 00003080
 /* FEILMELD 69: FLERE ENN ET FELT ER UTFYLT                         */ 00003090
 /* **************************************************************** */ 00003100
                                                                        00003110
                  E1S.SKILSMISSENR     = 69;                            00003120
                  E1S.FLYTTET_FRANR    = 999;                           00003130
                  E1S.FLYTTET_SAMMENNR = 999;                           00003140
                  E1S.EK_INNTUNR       = 999;                           00003150
                  E1S.EK_INNTMNR       = 999;                           00003160
               END;                                                     00003170
                                                                        00003180
            IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(E1S.FNR_EK)) THEN         00003190
              DO;                                                       00003200
                 FEIL_FUNNET  = '1'B;                                   00003210
                 E1S.FNR_EKNR = 200;                                    00003220
              END;                                                      00003230
            ELSE                                                        00003240
               IF ^ F_GYLDIG_FNR(E1S.FNR_EK) THEN                       00003250
                  DO;                                                   00003260
                     FEIL_FUNNET  = '1'B;                               00003270
                                                                        00003280
 /* **************************************************************** */ 00003290
 /* FEILMELD 15: FEIL I EKTEFELLENS FØDSELSNUMMER                    */ 00003300
 /* **************************************************************** */ 00003310
                                                                        00003320
                     E1S.FNR_EKNR = 15;                                 00003330
                  END;                                                  00003340
               ELSE                                                     00003350
               IF E1S.FNR_EK > 0  & E1S.FNR                             00003360
                                  = E1S.FNR_EK  THEN                    00003370
                  DO;                                                   00003380
                     FEIL_FUNNET  = '1'B;                               00003390
                     E1S.FNR_EKNR = 16;                                 00003400
                  END;                                                  00003410
               ELSE                                                     00003420
                  DO;                                                   00003430
                     FNR_REG.FNR1 = E1S.FNR_EK;                         00003440
                     EXEC CICS LINK PROGRAM ('R0019906')                00003450
                     COMMAREA (FNR_REG);                                00003460
                     IF FNR_REG.FNR2 > 0 THEN                           00003470
                       DO;                                              00003480
                         E1S.FNR_EKNR   = 203;                          00003490
                         E1S.FNR_GML_EK = E1S.FNR_EK;                   00003500
                         E1S.FNR_EK     = FNR_REG.FNR2;                 00003510
                       END;                                             00003520
                  END;                                                  00003530
            IF E1S.NAVN_EK = (25)' ' THEN                               00003540
               DO;                                                      00003550
                  FEIL_FUNNET = '1'B;                                   00003560
                                                                        00003570
 /* **************************************************************** */ 00003580
 /* FEILMELD 154: EKTEFELLENS NAVN ER IKKE UTFYLT                    */ 00003590
 /* **************************************************************** */ 00003600
                                                                        00003610
                  E1S.NAVN_EK = 154;                                    00003620
               END;                                                     00003630
         END;                                                           00003640
      ELSE                                                              00003650
         DO;                                                            00003660
            IF (E1S.SKILSMISSE  = 'X' & E1S.FLYTTET_FRA    = 'X') !     00003670
               (E1S.SKILSMISSE  = 'X' & E1S.FLYTTET_SAMMEN = 'X') !     00003680
               (E1S.SKILSMISSE  = 'X' & E1S.EK_INNTU       = 'X') !     00003690
               (E1S.SKILSMISSE  = 'X' & E1S.EK_INNTM       = 'X') !     00003700
               (E1S.FLYTTET_FRA = 'X' & E1S.EK_INNTU       = 'X') !     00003710
               (E1S.FLYTTET_FRA = 'X' & E1S.EK_INNTM       = 'X') !     00003720
               (E1S.FLYTTET_SAMMEN = 'X' & E1S.EK_INNTU    = 'X') !     00003730
               (E1S.FLYTTET_SAMMEN = 'X' & E1S.EK_INNTM    = 'X') !     00003740
               (E1S.EK_INNTU       = 'X' & E1S.EK_INNTM    = 'X') !     00003750
               (E1S.FLYTTET_FRA = 'X' & E1S.FLYTTET_SAMMEN = 'X') THEN  00003760
               DO;                                                      00003770
                  FEIL_FUNNET          = '1'B;                          00003780
                  E1S.SKILSMISSENR     = 69;                            00003790
                  E1S.FLYTTET_FRANR    = 999;                           00003800
                  E1S.FLYTTET_SAMMENNR = 999;                           00003810
                  E1S.EK_INNTUNR       = 999;                           00003820
                  E1S.EK_INNTMNR       = 999;                           00003830
               END;                                                     00003840
         END;                                                           00003850
                                                                        00003860
 /* ***************************************************************** */00003870
 /* KONTROLL AV FELT 7 (ENDRING I SPRÅKFORM)                          */00003880
 /* ***************************************************************** */00003890
                                                                        00003900
      IF VERIFY(E1S.SPRÅK,'NB ') ^= 0 THEN                              00003910
         DO;                                                            00003920
            FEIL_FUNNET = '1'B;                                         00003930
                                                                        00003940
 /* ***************************************************************** */00003950
 /* FEILMELD 6: FEIL I SPRÅK                                          */00003960
 /* ***************************************************************** */00003970
                                                                        00003980
            E1S.SPRÅKNR = 6;                                            00003990
         END;                                                           00004000
                                                                        00004010
 /* ***************************************************************** */00004020
 /*   KRYSSKONTROLLER .  TESTEN ER UTVIDET TIL Å GODTA VIRK.DATO      */00004030
 /*   40 DAGER FØR DAGENS DATO.  FEILMELDING 290.  24.4.86.  ERIK.    */00004040
 /* ***************************************************************** */00004050
                                                                        00004060
      IF ^FEIL_FUNNET THEN                                              00004070
                                                                        00004080
          DO;                                                           00004090
                                                                        00004100
              HJ_VIRK_DATO_MÅ    =  E1S.VIRK_DATO_MÅ    ;               00004110
              VIRK_DATO_M        =  HJ_VIRK_DATO_M      ;               00004120
              VIRK_DATO_Å        =  HJ_VIRK_DATO_Å      ;               00004130
                                                                        00004140
 /*           IF HJ_VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN           */     00004150
 /*                                                              */     00004160
 /*              DO;                                             */     00004170
 /*                                                              */     00004180
 /*                 IF DAGENS_DATO_D > 19 THEN                   */     00004190
 /*                                                              */     00004200
 /*                    DO;                                       */     00004210
 /*                                                                */   00004220
 /*                       HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 2 ; */   00004230
 /*                                                                */   00004240
 /*                    END;                                        */   00004250
 /*                                                                */   00004260
 /*                 ELSE                                           */   00004270
 /*                                                                */   00004280
 /*                    HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 1 ;    */   00004290
 /*                                                                */   00004300
 /*                 IF HJ_DAGENS_DATO_M > 12 THEN                  */   00004310
 /*                                                                */   00004320
 /*                    DO;                                         */   00004330
 /*                                                                */   00004340
 /*                       HJ_DAGENS_DATO_Å = HJ_DAGENS_DATO_Å + 1 ;*/   00004350
 /*                       HJ_DAGENS_DATO_M = HJ_DAGENS_DATO_M - 12;*/   00004360
 /*                                                                */   00004370
 /*                    END;                                        */   00004380
 /*                                                                */   00004390
 /*                                                                */   00004400
 /*                 IF HJ_VIRK_DATO_ÅM >  HJ_DAGENS_DATO_ÅM THEN   */   00004410
 /*                                                                */   00004420
 /*                                                                */   00004430
 /*                    DO;                                         */   00004440
 /*                                                                */   00004450
 /* ***************************************************************** */00004460
 /* FEILMELD 185: VIRKNINGSDATO STØRRE ENN 40 DAGER FRA DAGS DATO.    */00004470
 /* ***************************************************************** */00004480
 /*                                                                */   00004490
 /*                                                                */   00004500
 /*                        E1S.VIRK_DATO_MÅNR = 9;                 */   00004510
 /*                        FEIL_FUNNET        = '1'B;              */   00004520
 /*                                                                */   00004530
 /*                    END;                                        */   00004540
 /*               END;                                             */   00004550
 /*                                                                */   00004560
 /* ENDRET 22.6.88 HL - VI AKSEPTERER VIRKDATO 6 MNDR FREM I TID   */   00004570
                                                                        00004580
                  IF ^ F_6MDR(HJ_VIRK_DATO_ÅM)      THEN                00004590
                                                                        00004600
                     DO;                                                00004610
                        FEIL_FUNNET           = '1'B;                   00004620
                        E1S.VIRK_DATO_MÅNR    = 205;                    00004630
                     END;                                               00004640
                                                                        00004650
                                                                        00004660
          END;                                                          00004670
                                                                        00004680
                                                                        00004690
    IF E1S.EK_INNTU = 'X' !                                             00004700
       E1S.EK_INNTM = 'X' THEN                                          00004710
       DO;                                                              00004720
          IF F_SNU_DATO(E1S.VIRK_DATO_MÅ) < 8407 THEN                   00004730
             DO;                                                        00004740
                FEIL_FUNNET = '1'B;                                     00004750
                E1S.VIRK_DATO_MÅNR = 273;                               00004760
             END;                                                       00004770
       END;                                                             00004780
                                                                        00004790
 /* ***************************************************************** */00004800
 /* LEGGER FNR OG VIRK_DATO INN I MENY_OMR I KOM_OMR.                 */00004810
 /* ***************************************************************** */00004820
                                                                        00004830
     FØDSNUMMER    = E1S.FNR;                                           00004840
     VIRKNINGSDATO = E1S.VIRK_DATO_MÅ;                                  00004850
   END KONTROLL_E1_SØKER;                                               00004860
