 /*       SIST ENDRET 09/05-89 08.50.29 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 09/02-88 13.22.23 AV   DYBVIK                   */00000010
 %SKIP(3);                                                              00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R001NO16  UNDERPROGRAM SOM BRUKES AV R001NO10.   */00000060
 /*                            KONTROLL E1-BLANKETT.                  */00000070
 /*  PROGRAM-SPRÅK : PLI                                              */00000080
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */00000090
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */00000100
 /*  ENDRINGERSDATO :                                                 */00000110
 /*  ENDRINGEN GJELDER:                                               */00000120
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*BRUK:                                                              */00000160
 /* ********                                                          */00000170
 /*                                                                   */00000180
 /*  %INCLUDE R001NO16                                                */00000190
 /*                                                                   */00000200
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */00000210
 /*                                                                   */00000220
 /*    R0011402   BLANK E1 TRANSOMRÅDE                                */00000230
 /*    R0011403   KONTR E1 SØKER                                      */00000240
 /*    R0011405   KONTR KAP 7,8,10                                    */00000250
 /*    FUNKSJONER SOM BLIR BRUKT ER INKLUDERT I HOVEDPROGRAMMET.      */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 /*                                                                   */00000290
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR E1 OG FLYTTER DERETTER        */00000300
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */00000310
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */00000320
 /*  NUMRE TATT VARE PÅ.                                              */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
                                                                        00000360
 P114_BEHANDLE_E1: PROC;                                                00000370
                                                                        00000380
                                                                        00000390
 %INCLUDE P0011401;                               /* TRANSOMR E1 */     00000400
                                                                        00000410
    DCL ANTALL_FEIL_SKREVET   FIXED DEC (3);                            00000420
                                                                        00000430
          FEIL_I_BOSATT = '0'B;                                         00000440
          FEIL_BLANKETT = '0'B;                                         00000450
          FEIL_FUNNET   = '0'B;                                         00000460
          CALL BLANK_E1_SØKER;                        /* R0011402 */    00000470
          CALL BLANK_E1_KAP7;                         /* R0011402 */    00000480
          CALL BLANK_E1_KAP8;                         /* R0011402 */    00000490
          CALL BLANK_E1_KAP10;                        /* R0011402 */    00000500
          CALL BLANK_E1_KAP11;                        /* R0011402 */    00000510
 /*YS*/   CALL BLANK_E1_MELDNR;                       /* R0011402 */    00000520
          CALL OVERFØR_E1_BLANKETT;                                     00000530
          CALL KONTROLL_E1_SØKER(FEIL_FUNNET);        /* R0011403 */    00000540
          CALL KONTROLL_E1_KAP7(FEIL_FUNNET);         /* R0011405 */    00000550
          CALL KONTROLL_E1_KAP8(FEIL_FUNNET);         /* R0011405 */    00000560
          CALL KONTROLL_E1_KAP10(FEIL_FUNNET);        /* R0011405 */    00000570
                                                                        00000580
          IF FEIL_FUNNET     THEN                                       00000590
             DO;                                                        00000600
                CALL FINN_FEIL_E1;                                      00000610
             END;                                                       00000620
                                                                        00000630
                                                                        00000640
                                                                        00000650
 /* ***************************************************************** */00000660
 /*   PROSEDYRE FOR Å OVERFØRE VERDIER FRA INPUT_RECORDEN             */00000670
 /*   TIL E1_TRANS_OMR I KOM_OMR.                                     */00000680
 /* ***************************************************************** */00000690
 OVERFØR_E1_BLANKETT:                                                   00000700
   PROC;                                                                00000710
                                                                        00000720
                                                                        00000730
          E1S.REGDATO            = BLANKETT_RECORD.TRANS_DATO_ÅMD;      00000740
          E1S.TERMID             = 'NORT';                              00000750
          E1S.FNR                = BLANKETT_RECORD.FNR;                 00000760
          E1S.TKNR               = BLANKETT_RECORD.TKNR;                00000770
          E1S.SPRÅK              = E1_BLANKETT.SPRÅK;                   00000780
          E1S.VIRK_DATO_MÅ       = E1_BLANKETT.VIRK_DATO_MÅ;            00000790
          E1S.NAVN_NYTT          = E1_BLANKETT.NAVN_NYTT;               00000800
          E1S.NAVN_NYTT_EK       = E1_BLANKETT.NAVN_NYTT_EK;            00000810
                                                                        00000820
          IF F_FELT_PIC_CHAR11(E1_BLANKETT.FNR_EK) ^= (11)' '   THEN    00000830
             E1S.FNR_EK          = E1_BLANKETT.FNR_EK;                  00000840
                                                                        00000850
          E1S.NAVN_EK            = E1_BLANKETT.NAVN_EK;                 00000860
          E1S.SKILSMISSE         = E1_BLANKETT.SKILSMISSE;              00000870
          E1S.FLYTTET_FRA        = E1_BLANKETT.FLYTTET_FRA;             00000880
          E1S.FLYTTET_SAMMEN     = E1_BLANKETT.FLYTTET_SAMMEN;          00000890
          E1S.EK_INNTU           = E1_BLANKETT.EK_INNT_U4G;             00000900
          E1S.EK_INNTM           = E1_BLANKETT.EK_INNT_M4G;             00000910
                                                                        00000920
          IF F_FELT_PIC_CHAR5(E1_BLANKETT.FAI) ^= (5)' '        THEN    00000930
             E1K7.FAI            = E1_BLANKETT.FAI * 100;               00000940
                                                                        00000950
          E1K7.APD_MAX           = E1_BLANKETT.APD_MAX;                 00000960
                                                                        00000970
          IF F_FELT_PIC_CHAR3(E1_BLANKETT.APD) ^= (3)' '        THEN    00000980
             E1K7.APD            = E1_BLANKETT.APD;                     00000990
                                                                        00001000
          IF F_FELT_PIC_CHAR3(E1_BLANKETT.UFG) ^= (3)' '        THEN    00001010
             E1K8.UFG            = E1_BLANKETT.UFG;                     00001020
                                                                        00001030
          IF F_FELT_PIC_CHAR5(E1_BLANKETT.FORVENTET) ^= (5)' '  THEN    00001040
             E1K10.FORVENTET     = E1_BLANKETT.FORVENTET * 100;         00001050
                                                                        00001060
          E1K10.O_TIL_PENSJON    = E1_BLANKETT.O_TIL_PENSJON;           00001070
                                                                        00001080
          IF F_FELT_PIC_CHAR3(E1_BLANKETT.TP_PROSENT) ^= (3)' ' THEN    00001090
             E1K10.TP_PROSENT    = E1_BLANKETT.TP_PROSENT;              00001100
                                                                        00001110
          IF F_FELT_PIC_CHAR4(E1_BLANKETT.FRAML_DATO_MÅ) ^= (4)' ' THEN 00001120
             E1K10.FRAML_DATO_MÅ = E1_BLANKETT.FRAML_DATO_MÅ;           00001130
                                                                        00001140
          E1K10.OPPHØR_EO        = E1_BLANKETT.OPPHØR_EO;               00001150
                                                                        00001160
                                                                        00001170
    END OVERFØR_E1_BLANKETT;                                            00001180
                                                                        00001190
                                                                        00001200
 /* ***************************************************************** */00001210
 /*   PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRENE NÅR DET */00001220
 /*   ER FEIL I DEN OVERFØRTE TRANSEN.                                */00001230
 /* ***************************************************************** */00001240
 FINN_FEIL_E1:PROC;                                                     00001250
                                                                        00001260
                                                                        00001270
          FEIL_IND = 1;                                                 00001280
                                                                        00001290
          IF E1S.FNRNR ^= 0   &                                         00001300
             E1S.FNRNR ^= 999 THEN                                      00001310
             DO;                                                        00001320
                W01_FEIL_NR(FEIL_IND) = E1S.FNRNR;                      00001330
                FEIL_IND = FEIL_IND + 1;                                00001340
             END;                                                       00001350
                                                                        00001360
          IF E1S.TKNRNR ^= 0   &                                        00001370
             E1S.TKNRNR ^= 999 THEN                                     00001380
             DO;                                                        00001390
                W01_FEIL_NR(FEIL_IND) = E1S.TKNRNR;                     00001400
                FEIL_IND = FEIL_IND + 1;                                00001410
             END;                                                       00001420
                                                                        00001430
          IF E1S.SPRÅKNR ^= 0 &                                         00001440
             E1S.SPRÅKNR ^= 999 THEN                                    00001450
             DO;                                                        00001460
                W01_FEIL_NR(FEIL_IND) = E1S.SPRÅKNR;                    00001470
                IF FEIL_IND ^= 3  THEN                                  00001480
                   FEIL_IND  = FEIL_IND + 1;                            00001490
             END;                                                       00001500
                                                                        00001510
          IF E1S.VIRK_DATO_MÅNR ^= 0   &                                00001520
             E1S.VIRK_DATO_MÅNR ^= 999 THEN                             00001530
             DO;                                                        00001540
                W01_FEIL_NR(FEIL_IND) = E1S.VIRK_DATO_MÅNR;             00001550
                IF FEIL_IND ^= 3  THEN                                  00001560
                   FEIL_IND  = FEIL_IND + 1;                            00001570
             END;                                                       00001580
                                                                        00001590
          IF E1S.NAVN_NYTTNR ^= 0   &                                   00001600
             E1S.NAVN_NYTTNR ^= 999 THEN                                00001610
             DO;                                                        00001620
                W01_FEIL_NR(FEIL_IND) = E1S.NAVN_NYTTNR;                00001630
                IF FEIL_IND ^= 3  THEN                                  00001640
                   FEIL_IND  = FEIL_IND + 1;                            00001650
             END;                                                       00001660
                                                                        00001670
          IF E1S.NAVN_NYTT_EKNR ^= 0   &                                00001680
             E1S.NAVN_NYTT_EKNR ^= 999 THEN                             00001690
             DO;                                                        00001700
                W01_FEIL_NR(FEIL_IND) = E1S.NAVN_NYTT_EKNR;             00001710
                IF FEIL_IND ^= 3  THEN                                  00001720
                   FEIL_IND  = FEIL_IND + 1;                            00001730
             END;                                                       00001740
                                                                        00001750
          IF E1S.FNR_EKNR ^= 0   &                                      00001760
             E1S.FNR_EKNR ^= 999 THEN                                   00001770
             DO;                                                        00001780
                W01_FEIL_NR(FEIL_IND) = E1S.FNR_EKNR;                   00001790
                IF FEIL_IND ^= 3  THEN                                  00001800
                   FEIL_IND  = FEIL_IND + 1;                            00001810
             END;                                                       00001820
                                                                        00001830
          IF E1S.NAVN_EKNR ^= 0   &                                     00001840
             E1S.NAVN_EKNR ^= 999 THEN                                  00001850
             DO;                                                        00001860
                W01_FEIL_NR(FEIL_IND) = E1S.NAVN_EKNR;                  00001870
                IF FEIL_IND ^= 3  THEN                                  00001880
                   FEIL_IND  = FEIL_IND + 1;                            00001890
             END;                                                       00001900
                                                                        00001910
          IF E1S.SKILSMISSENR ^= 0   &                                  00001920
             E1S.SKILSMISSENR ^= 999 THEN                               00001930
             DO;                                                        00001940
                W01_FEIL_NR(FEIL_IND) = E1S.SKILSMISSENR;               00001950
                IF FEIL_IND ^= 3  THEN                                  00001960
                   FEIL_IND  = FEIL_IND + 1;                            00001970
             END;                                                       00001980
                                                                        00001990
          IF E1S.FLYTTET_FRANR ^= 0   &                                 00002000
             E1S.FLYTTET_FRANR ^= 999 THEN                              00002010
             DO;                                                        00002020
                W01_FEIL_NR(FEIL_IND) = E1S.FLYTTET_FRANR;              00002030
                IF FEIL_IND ^= 3  THEN                                  00002040
                   FEIL_IND  = FEIL_IND + 1;                            00002050
             END;                                                       00002060
                                                                        00002070
          IF E1S.FLYTTET_SAMMENNR ^= 0   &                              00002080
             E1S.FLYTTET_SAMMENNR ^= 999 THEN                           00002090
             DO;                                                        00002100
                W01_FEIL_NR(FEIL_IND) = E1S.FLYTTET_SAMMENNR;           00002110
                IF FEIL_IND ^= 3  THEN                                  00002120
                   FEIL_IND  = FEIL_IND + 1;                            00002130
             END;                                                       00002140
                                                                        00002150
          IF E1S.EK_INNTUNR ^= 0   &                                    00002160
             E1S.EK_INNTUNR ^= 999 THEN                                 00002170
             DO;                                                        00002180
                W01_FEIL_NR(FEIL_IND) = E1S.EK_INNTUNR;                 00002190
                IF FEIL_IND ^= 3  THEN                                  00002200
                   FEIL_IND  = FEIL_IND + 1;                            00002210
             END;                                                       00002220
                                                                        00002230
          IF E1S.EK_INNTMNR ^= 0   &                                    00002240
             E1S.EK_INNTMNR ^= 999 THEN                                 00002250
             DO;                                                        00002260
                W01_FEIL_NR(FEIL_IND) = E1S.EK_INNTMNR;                 00002270
                IF FEIL_IND ^= 3  THEN                                  00002280
                   FEIL_IND  = FEIL_IND + 1;                            00002290
             END;                                                       00002300
                                                                        00002310
          IF E1K7.FAINR ^= 0   &                                        00002320
             E1K7.FAINR ^= 999 THEN                                     00002330
             DO;                                                        00002340
                W01_FEIL_NR(FEIL_IND) = E1K7.FAINR;                     00002350
                IF FEIL_IND ^= 3  THEN                                  00002360
                   FEIL_IND  = FEIL_IND + 1;                            00002370
             END;                                                       00002380
                                                                        00002390
          IF E1K7.APD_MAXNR ^= 0   &                                    00002400
             E1K7.APD_MAXNR ^= 999 THEN                                 00002410
             DO;                                                        00002420
                W01_FEIL_NR(FEIL_IND) = E1K7.APD_MAXNR;                 00002430
                IF FEIL_IND ^= 3  THEN                                  00002440
                   FEIL_IND  = FEIL_IND + 1;                            00002450
             END;                                                       00002460
                                                                        00002470
          IF E1K7.APDNR ^= 0   &                                        00002480
             E1K7.APDNR ^= 999 THEN                                     00002490
             DO;                                                        00002500
                W01_FEIL_NR(FEIL_IND) = E1K7.APDNR;                     00002510
                IF FEIL_IND ^= 3  THEN                                  00002520
                   FEIL_IND  = FEIL_IND + 1;                            00002530
             END;                                                       00002540
                                                                        00002550
          IF E1K8.UFGNR ^= 0   &                                        00002560
             E1K8.UFGNR ^= 999 THEN                                     00002570
             DO;                                                        00002580
                W01_FEIL_NR(FEIL_IND) = E1K8.UFGNR;                     00002590
                IF FEIL_IND ^= 3  THEN                                  00002600
                   FEIL_IND  = FEIL_IND + 1;                            00002610
             END;                                                       00002620
                                                                        00002630
          IF E1K10.FORVENTETNR ^= 0   &                                 00002640
             E1K10.FORVENTETNR ^= 999 THEN                              00002650
             DO;                                                        00002660
                W01_FEIL_NR(FEIL_IND) = E1K10.FORVENTETNR;              00002670
                IF FEIL_IND ^= 3  THEN                                  00002680
                   FEIL_IND  = FEIL_IND + 1;                            00002690
             END;                                                       00002700
                                                                        00002710
          IF E1K10.O_TIL_PENSJONNR ^= 0   &                             00002720
             E1K10.O_TIL_PENSJONNR ^= 999 THEN                          00002730
             DO;                                                        00002740
                W01_FEIL_NR(FEIL_IND) = E1K10.O_TIL_PENSJONNR;          00002750
                IF FEIL_IND ^= 3  THEN                                  00002760
                   FEIL_IND  = FEIL_IND + 1;                            00002770
             END;                                                       00002780
                                                                        00002790
          IF E1K10.TP_PROSENTNR ^= 0   &                                00002800
             E1K10.TP_PROSENTNR ^= 999 THEN                             00002810
             DO;                                                        00002820
                W01_FEIL_NR(FEIL_IND) = E1K10.TP_PROSENTNR;             00002830
                IF FEIL_IND ^= 3  THEN                                  00002840
                   FEIL_IND  = FEIL_IND + 1;                            00002850
             END;                                                       00002860
                                                                        00002870
          IF E1K10.FRAML_DATO_MÅNR ^= 0   &                             00002880
             E1K10.FRAML_DATO_MÅNR ^= 999 THEN                          00002890
             DO;                                                        00002900
                W01_FEIL_NR(FEIL_IND) = E1K10.FRAML_DATO_MÅNR;          00002910
                IF FEIL_IND ^= 3  THEN                                  00002920
                   FEIL_IND  = FEIL_IND + 1;                            00002930
             END;                                                       00002940
                                                                        00002950
          IF E1K10.OPPHØR_EONR ^= 0   &                                 00002960
             E1K10.OPPHØR_EONR ^= 999 THEN                              00002970
             DO;                                                        00002980
                W01_FEIL_NR(FEIL_IND) = E1K10.OPPHØR_EONR;              00002990
                IF FEIL_IND ^= 3  THEN                                  00003000
                   FEIL_IND  = FEIL_IND + 1;                            00003010
             END;                                                       00003020
                                                                        00003030
                                                                        00003040
    END FINN_FEIL_E1;                                                   00003050
                                                                        00003060
                                                                        00003070
 %PAGE;                                                                 00003080
 /* ***************************************************************** */00003090
 /*          E K S T E R N E    P R O C E D U R E R                   */00003100
 /* ***************************************************************** */00003110
                                                                        00003120
                                                                        00003130
 %PAGE;                                                                 00003140
 %INCLUDE R0011402;          /*     BLANK E1 TRANSOMR   */              00003150
                                                                        00003160
 %PAGE;                                                                 00003170
 %INCLUDE R0011403;          /*     KONTR E1 SØKER      */              00003180
                                                                        00003190
 %PAGE;                                                                 00003200
 %INCLUDE R0011405;          /*     KONTR E1 KAP.7,8,10 */              00003210
                                                                        00003220
                                                                        00003230
 END P114_BEHANDLE_E1;                                                  00003240
                                                                        00003250
                                                                        00003260
