 /*       SIST ENDRET 13/12-91 12.33.51 AV   DYBVIK                   */00000000
 /*********************************************************************/00000010
 /* IDENTIFIKASJON:                                                   */00000020
 /*    R0016052 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000030
 /* HENSIKT:                                                          */00000040
 /*    EN PROGRAMMERT FUNKSJON SOM REGNER UT "ARVETE" DATA            */00000050
 /* PROGRAMTILKNYTNING:                                               */00000060
 /*    LOKAL PROSEDYRE I R0016001                                     */00000070
 /* BRUK:                                                             */00000080
 /*    W_FELT = MAGIC (FNR, SPT, OPT, PÅ)                             */00000090
 /*                                                                   */00000100
 /*BØ9201-KOMM:                                                       */00000110
 /*    FRA 1992 KOMMER OGSÅ POENG-ÅR SOM SKAL GI 42% TILLEGGS-PENSJON.*/00000120
 /*    DERMED VIL FUNKSJONEN UTEN ENDRING KUNNE VIRKE UNØYAKTIG, MEN  */00000130
 /*    DETTE LAR VI INNTIL VIDERE VÆRE SOM DET ER. JFR. 2BS V/PBK.    */00000140
 /*********************************************************************/00000150
                                                                        00000160
 F_MAGIC: PROC (FNR,SPT,OPT,PÅ) RETURNS (FIXED DEC (10,5));             00000170
                                                                        00000180
    /*----------------------------------------------------------------*/00000190
    /* MAGIC REGNER PÅ FØLGENDE OPPLYSNINGER :                        */00000200
    /*    SPT   SLUTTPOENGTALL                                        */00000210
    /*    OPT   OVERKOMP. SLUTTPOENGTALL                              */00000220
    /*    PÅ    POENGÅR                                               */00000230
    /* OG GIR ET 'MAGISK' TALL. DETTE TALLET AVGJØR OM FORELDRELØSE   */00000240
    /* BARN SKAL HA MOR ELLER FAR'S SPT-, OPT- OG PÅ-VERDIER          */00000250
    /* I ETTERL-SEGMENTET FOR AVDØDE-OPPLYSNINGER.                    */00000260
    /*                                                                */00000270
    /*----------------------------------------------------------------*/00000280
                                                                        00000290
    DCL FNR                  FIXED DEC (11);                            00000300
    DCL (SPT,OPT)            FIXED DEC (3,2);                           00000310
    DCL PÅ                   FIXED DEC (3);                             00000320
    DCL PNR                  PIC '(11)9',                               00000330
        ÅR                   PIC '99' DEF PNR POS(5);                   00000340
    DCL SVAR                 FIXED DEC (10,5) STATIC;                   00000350
                                                                        00000360
    PNR = FNR;                                                          00000370
    SELECT;                                                             00000380
       WHEN (ÅR < 18) SVAR = OPT*PÅ/20 + SPT*PÅ/40;                     00000390
       WHEN (ÅR > 36) SVAR = SPT*PÅ/40;                                 00000400
       OTHERWISE SVAR = OPT*PÅ/(ÅR+3) + SPT*PÅ/40;                      00000410
    END; /* OF SELECT */                                                00000420
    RETURN (SVAR);                                                      00000430
 END; /* OF F_MAGIC */                                                  00000440
                                                                        00000450
