 /*       SIST ENDRET 14/03-96 15.45.19 AV   HLB0310                  */00000000
 /*       SIST ENDRET 17/02-92 13.44.07 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 21/01-91 13.51.52 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 06/03-90 12.50.32 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/03-83 08.41.34 AV   OLAV                     */00000040
 /*       SIST ENDRET 24/03-83 12.18.32 AV   OLAV                     */00000050
 /*                                                                   */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /*    R0014165 - SUBRUTINE I PLI                                     */00000080
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000090
 /*HENSIKT:                                                           */00000100
 /*    RUTINEN PLUKKER UT ET ANTALL POENG GITT I VARIABELEN ANTALL    */00000110
 /*    BESTE FRA POENGREKKEN INNENFOR STARTÅR OG SLUTTÅR OG REGNER    */00000120
 /*    UT SPT OG OPT.                                                 */00000130
 /*    RUTINEN TELLER OGSÅ OPP ANTALL ÅR HVOR DET ER GODSKREVET POENG */00000140
 /*BRUK   :                                                           */00000150
 /*    CALL PLUKK_UT_BESTE_POENG(    );                               */00000160
 /*                                                                   */00000170
 /*    PROGRAMMET INCLUDES I R0014153 OG R0014156 OG 4470             */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
  PLUKK_UT_BESTE_POENG:                                                 00000210
   PROC(START_ÅR,SLUTT_ÅR,ANTALL_BESTE,POREKKE,W_ÅR);                   00000220
 %SKIP(2);                                                              00000230
 %INCLUDE P0014001;   /*      POREKKE                             */    00000240
 %PAGE;                                                                 00000250
 %INCLUDE P0014002;   /*      W_POREKKE                           */    00000260
 %PAGE;                                                                 00000270
    DCL                                                                 00000280
       SUM                       BUILTIN;                               00000290
                                                                        00000300
    DCL    (I,J)                 FIXED BIN(15);                         00000310
    DCL    K                     FIXED BIN(15) INIT (0);                00000320
    DCL                                                                 00000330
       START_ÅR                  FIXED DEC(3),                          00000340
       SLUTT_ÅR                  FIXED DEC(3);                          00000350
    DCL                                                                 00000360
       ANTALL_BESTE              FIXED DEC(3);                          00000370
    DCL                                                                 00000380
       SUM_OPT                   FIXED DEC(5,3) INIT(0);                00000390
    DCL                                                                 00000400
       BESTE_POENG(20)           FIXED DEC(5,3),                        00000410
       SEKSTINIÅR                   FIXED DEC(3);                       00000420
    DCL                                                                 00000430
       RUNDING                   FIXED DEC(5,3) INIT(0.005),            00000440
       W_ÅR                      PIC '(2)9',                            00000450
       W_FELT                    CHAR(1);                               00000460
    DCL POENG_FØR92              FIXED DEC (3)  INIT (0);               00000470
 %PAGE;                                                                 00000480
  SUM_OPT              = 0;                                             00000490
  BESTE_POENG          = 0;                                             00000500
                                                                        00000510
    W_POREKKE.TYPE      = POREKKE.TYPE;                                 00000520
    W_POREKKE.SPT       = POREKKE.SPT;                                  00000530
    W_POREKKE.OPT       = POREKKE.OPT;                                  00000540
    W_POREKKE.PÅ        = POREKKE.PÅ;                                   00000550
                                                                        00000560
    SEKSTINIÅR = W_ÅR + 69;                                             00000570
                                                                        00000580
    IF W_FNR_R.ÅRHUNDRE > 4             THEN                            00000590
       SEKSTINIÅR = SEKSTINIÅR - 100;                                   00000600
                                                                        00000610
    DO I = 63 TO 150 UNTIL(I = SEKSTINIÅR);                             00000620
       W_POREKKE.POENG(I) = POREKKE.POENG(I);                           00000630
       W_POREKKE.KODE (I) = POREKKE.KODE (I);                           00000640
       W_POREKKE.UFG  (I) = POREKKE.UFG  (I);                           00000650
    END;                                                                00000660
 %SKIP(3);                                                              00000670
                                                                        00000680
  /*LOVENDRING : TP-PROSENTEN GÅR NED TIL 42 FOR ÅR ETTER 1991 : */     00000690
                                                                        00000700
  IF START_ÅR < 92          THEN                                        00000710
     DO J = START_ÅR TO 91 ;                                            00000720
        IF POREKKE.POENG(J) > 0       THEN                              00000730
           POENG_FØR92 = POENG_FØR92 + 1;                               00000740
     END;                                                               00000750
  POREKKE.PÅ_ETTER91 = POREKKE.PÅ - POENG_FØR92;                        00000760
                                                                        00000770
  /*HIT 15.1.92 HL */                                                   00000780
  DO I = 1 TO ANTALL_BESTE;                                             00000790
     DO J = START_ÅR TO SLUTT_ÅR;                                       00000800
        IF W_POREKKE.POENG(J) > BESTE_POENG(I) THEN                     00000810
           DO;                                                          00000820
              BESTE_POENG(I) = W_POREKKE.POENG(J);                      00000830
              K              = J;                                       00000840
           END;                                                         00000850
     END;                                                               00000860
     IF K > 0  THEN                                                     00000870
        DO;                                                             00000880
           IF W_POREKKE.POENG(K) > 4.00 THEN                            00000890
 /*                                                                   */00000900
 /*     BARE POENG OPP TIL 4.00 BLIR DET GITT OVERKOMPENSASJON FOR    */00000910
 /*                                                                   */00000920
              SUM_OPT = SUM_OPT + 4.00;                                 00000930
           ELSE                                                         00000940
              SUM_OPT = SUM_OPT + W_POREKKE.POENG(K);                   00000950
           W_POREKKE.POENG(K) = 0;                                      00000960
        END;                                                            00000970
  END;                                                                  00000980
                                                                        00000990
  IF DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J'     THEN                    00001000
     DO;                                                                00001010
        POREKKE.SPT = SUM(BESTE_POENG) / ANTALL_BESTE + RUNDING;        00001020
        POREKKE.OPT = SUM_OPT          / ANTALL_BESTE + RUNDING;        00001030
     END;                                                               00001040
  ELSE                                                                  00001050
  IF POREKKE.PÅ > 0     THEN                                            00001060
     DO;                                                                00001070
        IF POREKKE.PÅ < 20    THEN                                      00001080
           DO;                                                          00001090
              POREKKE.SPT = SUM(BESTE_POENG) / POREKKE.PÅ + RUNDING;    00001100
              POREKKE.OPT = SUM_OPT          / POREKKE.PÅ + RUNDING;    00001110
           END;                                                         00001120
        ELSE                                                            00001130
           DO;                                                          00001140
              POREKKE.SPT = SUM(BESTE_POENG) / 20 + RUNDING;            00001150
              POREKKE.OPT = SUM_OPT          / 20 + RUNDING;            00001160
           END;                                                         00001170
     END;                                                               00001180
  ELSE                                                                  00001190
     DO;                                                                00001200
        POREKKE.SPT = 0;                                                00001210
        POREKKE.OPT = 0;                                                00001220
     END;                                                               00001230
                                                                        00001240
 /*LOVENDRING 1.1.91 - HL : */                                          00001250
                                                                        00001260
  IF B02.VIRK_DATO_ÅM(IND) > 9100 &                                     00001270
     B02.OVERKOMP_UTL(IND) = 'N' THEN                                   00001280
     POREKKE.OPT = 0;                                                   00001290
                                                                        00001300
                                                                        00001310
                                                                        00001320
  END PLUKK_UT_BESTE_POENG;                                             00001330
