 /*       SIST ENDRET 16/10-89 12.58.09 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 14/04-89 15.29.23 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 07/02-84 16.06.45 AV   FARVIK                   */00000020
  /* **************************************************************** */00000030
  /*IDENTIFIKASJON:                                                   */00000040
  /*    R0010460 - HOVEDPROGRAM I PLI.                                */00000050
  /*    PROGRAMMERER: FARVIK,ROLF  MARS -83                           */00000060
  /*                                                                  */00000070
  /*HENSIKT:                                                          */00000080
  /*    FJERNER TRANSHIST MED ØNSKET KEY.                             */00000090
  /*                                                                  */00000100
  /*PROGRAMTILKNYTNING:                                               */00000110
  /*                                                                  */00000120
  /*BRUK:                                                             */00000130
  /*    EXEC CICS LINK PROGRAM('R0010460')                            */00000140
  /*                                                                  */00000150
  /* **************************************************************** */00000160
                                                                        00000170
  R001046 :                                                             00000180
    PROC            (COMMAREA_PEKER)                                    00000190
           OPTIONS  (MAIN);                                             00000200
                                                                        00000210
  %PAGE;                                                                00000220
  %INCLUDE P0019906;                     /*   TRANS_OPPL_OMR (B) */     00000230
                                                                        00000240
  %PAGE;                                                                00000250
  %INCLUDE P0019908;                      /*   KOM_OMR        (B) */    00000260
                                                                        00000270
  %PAGE;                                                                00000280
  %INCLUDE P0019910;                      /*   STYRINGS_OMR   (B) */    00000290
                                                                        00000300
  %PAGE;                                                                00000310
  %INCLUDE P0019912;                      /*   DIV_PARAM_OMR  (B) */    00000320
                                                                        00000330
  %PAGE;                                                                00000340
  /* **************************************************************** */00000350
  /*     INNEBYGDE PLI-FUNKSJONER  + PEKER-DEF.                       */00000360
  /* **************************************************************** */00000370
                                                                        00000380
     DCL                                                                00000390
       ( ADDR , LOW , CSTG , DATE )      BUILTIN;                       00000400
                                                                        00000410
     DCL                                                                00000420
       PLITDLI ENTRY;                                                   00000430
                                                                        00000440
     DCL                                                                00000450
          COMMAREA_PEKER PTR;                                           00000460
                                                                        00000470
  /* **************************************************************** */00000480
  /*     ARBEIDSFELTER SOM BRUKES AV UIB OG PCB  .                    */00000490
  /* **************************************************************** */00000500
                                                                        00000510
  %INCLUDE DLIUIB;                                                      00000520
                                                                        00000530
     DCL                                                                00000540
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00000550
                                                                        00000560
  %INCLUDE  P0012002;                  /* UIB_PCB_PEKER_OMR (BASED)   */00000570
                                                                        00000580
     DCL  1 RF1                    BASED (RF1_PCB_PEKER),               00000590
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */ 00000600
                                                                        00000610
                                                                        00000620
  /* **************************************************************** */00000630
  /*     DLI CALL-PARAMETRE                                           */00000640
  /* **************************************************************** */00000650
                                                                        00000660
     DCL 1  W001_DLI               UNALIGNED,                           00000670
            2   FUNC               CHAR     (4)   INIT('    '),         00000680
            2   GHU                CHAR     (4)   INIT('GHU '),         00000690
            2   DLET               CHAR     (4)   INIT('DLET'),         00000700
            2   REPL               CHAR     (4)   INIT('REPL'),         00000710
            2   ISRT               CHAR     (4)   INIT('ISRT'),         00000720
            2   PARM_CT_1          FIXED BIN(31)  INIT(1),              00000730
            2   PARM_CT_2          FIXED BIN(31)  INIT(2),              00000740
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),              00000750
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),              00000760
            2   PARM_CT_5          FIXED BIN(31)  INIT(5),              00000770
            2   PARM_CT_6          FIXED BIN(31)  INIT(6),              00000780
            2   PARM_CT_7          FIXED BIN(31)  INIT(7),              00000790
            2   OUT2               CHAR     (20)  INIT                  00000800
                        ('                    ');                       00000810
                                                                        00000820
     DCL    W001_IO                CHAR (150) INIT  (   ( 150 )  ' '  );00000830
  %PAGE;                                                                00000840
  /* **************************************************************** */00000850
  /*     DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00000860
  /* **************************************************************** */00000870
                                                                        00000880
                                                                        00000890
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00000900
            2    HDEL                            CHAR (17) INIT         00000910
                 ('RF0PERSN(FNR     '),                                 00000920
            2    REL_OP                          CHAR (2)  INIT (' ='), 00000930
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),  00000940
            2    HP                              CHAR (1)  INIT (')');  00000950
                                                                        00000960
     DCL 1  SSA1_TRANHIST          UNALIGNED,                           00000970
            2    HDEL                            CHAR (17) INIT         00000980
                 ('TRANHIST(VTPBLKOD'),                                 00000990
            2    REL_OP                          CHAR (2)  INIT (' ='), 00001000
            2    VTP_KEY            FIXED        DEC  (4)  INIT ( 0 ),  00001010
            2    GRBLKODE                        CHAR (2)  INIT ('  '), 00001020
            2    HP                              CHAR (1)  INIT (')');  00001030
                                                                        00001040
                                                                        00001050
                                                                        00001060
  %PAGE;                                                                00001070
  /* **************************************************************** */00001080
  /*                                                                  */00001090
  /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001100
  /*       ---------------------------------------------------        */00001110
  /*                                                                  */00001120
  /*                                                                  */00001130
  /*        INITIERER VISSE DEFAULTVERDIER.                           */00001140
  /*                                                                  */00001150
  /* **************************************************************** */00001160
                                                                        00001170
                                                                        00001180
    PROGRAM_ID              = 'R0010460';                               00001190
    UIBPTR                  =  UIB_PEKER;                               00001200
                                                                        00001210
    SSA1_RF0PERSN.PKEY      =  TRANS_OPPL_OMR.FØDSNUMMER;               00001220
    SSA1_TRANHIST.VTP_KEY   =  9999 -                                   00001230
                               F_SNU_DATO(TRANS_OPPL_OMR.VIRKNINGSDATO);00001240
                                                                        00001250
 /* TRUDE ANG. UNGE UFØRE  FØR 1967                                  */ 00001260
 /*AFP   IF TRANS_OPPL_OMR.BLANKETTYPE ^= 'AF' THEN             ******/ 00001270
 /*         SSA1_TRANHIST.GRBLKODE = TRANS_OPPL_OMR.BLANKETTYPE;  ****/ 00001280
 /*AFP   ELSE                                                  *******/ 00001290
 /*AFP      SSA1_TRANHIST.GRBLKODE = 'AP';                       *****/ 00001300
                                                                        00001310
 /*UF*/  IF TRANS_OPPL_OMR.BLANKETTYPE  = 'AF' THEN                     00001320
 /*UF*/     SSA1_TRANHIST.GRBLKODE = 'AP';                              00001330
 /*UF*/  ELSE                                                           00001340
 /*UF*/      IF TRANS_OPPL_OMR.BLANKETTYPE     = 'UF' THEN              00001350
 /*UF*/         SSA1_TRANHIST.GRBLKODE         = 'UP';                  00001360
 /*UF*/      ELSE                                                       00001370
 /*UF*/         SSA1_TRANHIST.GRBLKODE = TRANS_OPPL_OMR.BLANKETTYPE;    00001380
                                                                        00001390
                                                                        00001400
    /* ************************************************************** */00001410
    /*                                                                */00001420
    /* TAR ET GHU-KALL,FØR DLET.                                      */00001430
    /*                                                                */00001440
    /* ************************************************************** */00001450
                                                                        00001460
    CALL PLITDLI                        (W001_DLI.PARM_CT_5,            00001470
                                         W001_DLI.GHU,                  00001480
                                         RF1,                           00001490
                                         W001_IO,                       00001500
                                         SSA1_RF0PERSN,                 00001510
                                         SSA1_TRANHIST);                00001520
                                                                        00001530
    IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                      00001540
      ! RF1.STATUS_KODE         ^=       '  '         THEN              00001550
        DO;                                                             00001560
           /* ******************************************** */           00001570
           /* FEIL VED LES   AV :  TRANHIST                */           00001580
           /* ******************************************** */           00001590
  L110:                                                                 00001600
           FEIL_MELD_NR             =       500 ;                       00001610
           FEIL_VED_LABEL           =      '110';                       00001620
           DB_STATUS_KODE           =       RF1.STATUS_KODE;            00001630
           GO   TO  L999;                                               00001640
        END;                                                            00001650
                                                                        00001660
                                                                        00001670
        /* ******************************************** */              00001680
        /* KALLET GHU GIKK OK . DELETER TRANHIST.       */              00001690
        /* ******************************************** */              00001700
                                                                        00001710
    CALL PLITDLI                        (W001_DLI.PARM_CT_3,            00001720
                                         W001_DLI.DLET,                 00001730
                                         RF1,                           00001740
                                         W001_IO);                      00001750
                                                                        00001760
    IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                      00001770
      ! RF1.STATUS_KODE         ^=       '  '         THEN              00001780
        DO;                                                             00001790
           /* ******************************************** */           00001800
           /* FEIL VED DELETE  AV :  TRANHIST              */           00001810
           /* ******************************************** */           00001820
  L120:                                                                 00001830
           FEIL_MELD_NR             =       500 ;                       00001840
           FEIL_VED_LABEL           =      '120';                       00001850
           GO   TO  L999;                                               00001860
        END;                                                            00001870
  L999:                                                                 00001880
                                                                        00001890
    EXEC CICS RETURN;                                                   00001900
                                                                        00001910
    %INCLUDE R0019913; /* PROC. FOR Å SNU DATO .     MMÅÅ -> ÅÅMM    */ 00001920
                                                                        00001930
                                                                        00001940
                                                                        00001950
  END  R001046;                                                         00001960
