 /*       SIST ENDRET 29/11-88 09.50.19 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 27/10-88 09.01.08 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 16/05-88 12.31.37 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 28/10-87 14.54.11 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 01/09-87 08.46.47 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 19/05-87 10.27.49 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 29/09-86 10.09.28 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 16/12-85 07.44.51 AV   FARVIK                   */00000070
 /*       SIST ENDRET 29/11-85 08.56.33 AV   FARVIK                   */00000080
 /*       SIST ENDRET 11/10-85 10.16.26 AV   LUNDEBY                  */00000090
 /*       SIST ENDRET 02/08-85 14.04.53 AV   FARVIK                   */00000100
 /*       SIST ENDRET 10/07-85 07.02.58 AV   LUNDEBY                  */00000110
 /*       SIST ENDRET 29/01-85 15.58.52 AV   LUNDEBY                  */00000120
 /*       SIST ENDRET 18/09-84 07.47.31 AV   FARVIK                   */00000130
 /*       SIST ENDRET 13/09-84 14.18.56 AV   FARVIK                   */00000140
 /*       SIST ENDRET 20/07-84 10.15.52 AV   FARVIK                   */00000150
                                                                        00000160
                                                                        00000170
 /* ***************************************************************** */00000180
 /*                                                                   */00000190
 /*  PROGRAMMET FJERNER INNTEKTER FOR ET FØDSELSNUMMER OPPGITT I      */00000200
 /*                                                                   */00000210
 /*  PROGRAM R001I101.                                                */00000220
 /*                                                                   */00000230
 /*                                                                   */00000240
 /*  PROGRAMMERER ROLF FARVIK, JUN 1983.                              */00000250
 /* ***************************************************************** */00000260
 /* ENDRET 29.01.85 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */00000270
 /* ---------------                                                   */00000280
 /*    LEGGER UT DATA TIL NORTRYGD. TKNR FINNES VED 1. OG SJEKKE OM   */00000290
 /*    DET FINNES I ROT-SEGM. ER RF0PERSN.TKNR = 0 BRUKES KOMMNR. I   */00000300
 /*    SISTE INNTEKTS-SEGM.                                           */00000310
 /*                                                                   */00000320
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000330
 /* ******                                                            */00000340
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000350
 /*    OM FNR ER ENDRET (R0019906).                                   */00000360
 /*                                                                   */00000370
 /*ENDRET: 22.11.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000380
 /* ******                                                            */00000390
 /*    VED GFNR BLE DET IKKE SKREVET PÅ KONTROLL-LISTA. ER ENDRET     */00000400
 /* ***************************************************************** */00000410
                                                                        00000420
 R001I30:                                                               00000430
   PROC (INTERN_KOM_PTR) OPTIONS(MAIN);                                 00000440
                                                                        00000450
 %PAGE;                                                                 00000460
      %INCLUDE S001I1;     /*  INNTEKTMAPSET1    (BASED) */             00000470
                                                                        00000480
 %PAGE;                                                                 00000490
      %INCLUDE S001I3;     /*  INNTEKTMAPSET3    (BASED) */             00000500
                                                                        00000510
 %PAGE;                                                                 00000520
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000530
 %PAGE;                                                                 00000540
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000550
 %PAGE;                                                                 00000560
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000570
 %PAGE;                                                                 00000580
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000590
 %PAGE;                                                                 00000600
 %SKIP(1);                                                              00000610
   DCL                                                                  00000620
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00000630
       1  FEIL_STRUC,                                                   00000640
          2  FEIL_NR               FIXED DEC(5),                        00000650
          2  FEIL_MELDING          CHAR     (78),                       00000660
          2  KOM_OMR_PEKER         POINTER;                             00000670
    %PAGE;                                                              00000680
    /* ************************************************************** */00000690
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000700
    /* ************************************************************** */00000710
                                                                        00000720
       DCL                                                              00000730
         ( ADDR , CSTG , LOW , STG , SUBSTR , ONCODE , NULL )  BUILTIN; 00000740
                                                                        00000750
       DCL                                                              00000760
           PLITDLI      ENTRY,                                          00000770
           BMSMAPBR     PTR  ;                                          00000780
                                                                        00000790
    /* ************************************************************** */00000800
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000810
    /* ************************************************************** */00000820
                                                                        00000830
    %INCLUDE DLIUIB;                                                    00000840
                                                                        00000850
       DCL                                                              00000860
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000870
                                                                        00000880
       DCL                                                              00000890
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )       00000900
                                               POINTER;                 00000910
                                                                        00000920
       DCL GAMMEL_AKSJONSKODE        CHAR (2)     ;                     00000930
       DCL W02_INNT_MÅ               PIC '(4)9';                        00000940
       DCL INNT_ALDER_FRA            PIC '(2)9';                        00000950
       DCL ANTALL_FRA_LEST           FIXED DEC (3);                     00000960
       DCL ANTALL_LEST               FIXED DEC (3);                     00000970
       DCL LOW_VALUES            CHAR(6);                               00000980
       DCL W01_IO                CHAR(150);                             00000990
       DCL LOW_VALUES_1500       CHAR(1500);                            00001000
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);           00001010
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                   00001020
       DCL CICSINFO              CHAR (16);                             00001030
                                                                        00001040
       DCL 1 FNR_REG,                                                   00001050
             2 FNR1              FIXED DEC(11),                         00001060
             2 FNR2              FIXED DEC(11),                         00001070
             2 BRUKERID          CHAR     ( 4);                         00001080
                                                                        00001090
       DCL HUSK_PI_ÅR_FRA      FIXED    DEC   (3) ,                     00001100
           HUSK_PI_TYPE_FRA             CHAR  (1) ;                     00001110
                                                                        00001120
    /* ************************************************************** */00001130
    /*   ROT-SEGMENTET                                                */00001140
    /* ************************************************************** */00001150
                                                                        00001160
       DCL 1  RF0PERSN                UNALIGNED,                        00001170
       %INCLUDE P0019927;                                               00001180
                                                                        00001190
    /* ************************************************************** */00001200
    /*   INNTEKT-SEGMENTET                                            */00001210
    /* ************************************************************** */00001220
                                                                        00001230
       DCL 1  W01_PINT               UNALIGNED,                         00001240
       %INCLUDE P0019928;                                               00001250
                                                                        00001260
    /* ************************************************************** */00001270
    /*   INNTEKTSTABELL.                                              */00001280
    /* ************************************************************** */00001290
                                                                        00001300
       DCL 1  W03                    UNALIGNED,                         00001310
              2  W02(24),                                               00001320
                 3   TAB_PI_ÅR          FIXED    DEC   (3) ,            00001330
                 3   TAB_PI_KODE,                                       00001340
                     4   TAB_PI_TYPE             CHAR  (1) ,            00001350
                     4   TAB_PI_MERKE            PIC   '9' ,            00001360
                 3   TAB_PI             FIXED    DEC   (7) ,            00001370
                 3   TAB_PI_KOMMNR      FIXED    DEC   (5) ,            00001380
                 3   TAB_PI_RAPPDATO    FIXED    DEC   (5) ;            00001390
                                                                        00001400
                                                                        00001410
       DCL INTERN_KOM_PTR        POINTER;                               00001420
                                                                        00001430
       DCL 1 INTERN_KOM_OMR  BASED (INTERN_KOM_PTR),                    00001440
             2 HOVED_KOM_PTR        POINTER,                            00001450
             2 FRA_FNR              PIC '(11)9',                        00001460
             2 TIL_FNR              PIC '(11)9';                        00001470
                                                                        00001480
    /* ************************************************************** */00001490
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00001500
    /* ************************************************************** */00001510
                                                                        00001520
       DCL 1  W01                       UNALIGNED,                      00001530
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00001540
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),   00001550
              2   STYRINGSKODE_IKKE_SATT      BIT  (1)   INIT ('0'B),   00001560
              2   AKSJONSKODE                 CHAR (2),                 00001570
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00001580
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('1'B),   00001590
              2   NAVN                        CHAR (25)  INIT ((25)' '),00001600
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00001610
              2   I                    FIXED  BIN  (15)  INIT (1),      00001620
              2   J                    FIXED  BIN  (15)  INIT (1);      00001630
                                                                        00001640
    /* ************************************************************** */00001650
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001660
    /* ************************************************************** */00001670
                                                                        00001680
       DCL 1  W01_DLI_PARAM,                                            00001690
              2   W02_GET                 CHAR (4)   INIT ('    '),     00001700
              2   W02_GHU                 CHAR (4)   INIT('GHU '),      00001710
              2   W02_DLET                CHAR (4)   INIT('DLET'),      00001720
              2   W02_ISRT                CHAR (4)   INIT('ISRT'),      00001730
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00001740
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00001750
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00001760
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001770
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001780
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001790
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001800
                                                                        00001810
                                                                        00001820
    /* ************************************************************** */00001830
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001840
    /* ************************************************************** */00001850
                                                                        00001860
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ') ; 00001870
                                                                        00001880
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ') ; 00001890
                                                                        00001900
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');00001910
                                                                        00001920
       DCL 1  SSA1_RF0PERSN        STATIC,                              00001930
              2    HDEL                       CHAR (17)  INIT           00001940
                   ('RF0PERSN(FNR     '),                               00001950
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001960
              2    PKEY               FIXED   DEC  (11),                00001970
              2    HP                         CHAR (1)   INIT (')');    00001980
                                                                        00001990
                                                                        00002000
       DCL 1  SSA1_PINNTEKT        STATIC,                              00002010
              2    HDEL                       CHAR (17)  INIT           00002020
                   ('PINNTEKT(INNTÅRTY'),                               00002030
              2    REL_OP                     CHAR (2)   INIT (' ='),   00002040
              2    ÅR                 FIXED   DEC  (2),                 00002050
              2    TYPE                       CHAR (1),                 00002060
              2    HP                         CHAR (1)   INIT (')');    00002070
                                                                        00002080
                                                                        00002090
    /* ************************************************************** */00002100
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00002110
    /* ************************************************************** */00002120
                                                                        00002130
    %PAGE;                                                              00002140
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00002150
    %PAGE;                                                              00002160
                                                                        00002170
       DCL 1  B01              BASED (B01_PEKER),                       00002180
    %INCLUDE P0019921;                         /* B01_OMR (BASED)     */00002190
                                                                        00002200
                                                                        00002210
    %PAGE;                                                              00002220
       DCL 1  B02              BASED (B02_PEKER),                       00002230
    %INCLUDE P0019921;                         /* B02_OMR (BASED)     */00002240
                                                                        00002250
    %PAGE;                                                              00002260
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00002270
    %INCLUDE P0012003;                         /* PCB                 */00002280
                                                                        00002290
                                                                        00002300
    %PAGE;                                                              00002310
       DCL 1  RF2              BASED (RF2_PCB_PEKER),                   00002320
    %INCLUDE P0012003;                         /* PCB                 */00002330
                                                                        00002340
    /* ************************************************************** */00002350
    /*                                                                */00002360
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00002370
    /*     ---------------------------------------------------        */00002380
    /*                                                                */00002390
    /*                                                                */00002400
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */00002410
    /*                                                                */00002420
    /*                                                                */00002430
    /* ************************************************************** */00002440
                                                                        00002450
                                                                        00002460
  COMMAREA_PEKER                        = HOVED_KOM_PTR;                00002470
                                                                        00002480
 %PAGE;                                                                 00002490
      ON ERROR SNAP BEGIN;                                              00002500
         ON ERROR SYSTEM;                                               00002510
         ONKODE=ONCODE;                                                 00002520
         EXEC CICS ABEND ABCODE(ONK);                                   00002530
      END;                                                              00002540
                                                                        00002550
 EXEC CICS HANDLE CONDITION ERROR(ERRBEH);                              00002560
                                                                        00002570
  EXEC CICS HANDLE AID PF2(PF2);                                        00002580
  EXEC CICS HANDLE AID PF1(PF2);                                        00002590
                                                                        00002600
                                                                        00002610
  PROGRAM_ID        = 'R001I301'                   ;                    00002620
  DB_STATUS_KODE    = '  '                         ;                    00002630
  FEIL_MELD_NR      = 0                            ;                    00002640
  FNR_REG.BRUKERID  = DIV_PARAM_OMR.CICS_IND;                           00002650
  CICSINFO          = F_CICSINFO (DIV_PARAM_OMR.CICS_IND);              00002660
                                                                        00002670
  LOW_VALUES        = (6)' '                       ;/* HEXA LOW-VALUES*/00002680
  LOW_VALUES_1500   = (1500)' '                    ;/* HEXA LOW-VALUES*/00002690
  %PAGE;                                                                00002700
                                                                        00002710
                                                                        00002720
  /**********    H O V E D S T Y R I N G   S T A R T   *************/   00002730
                                                                        00002740
  IF TRANSKODE = 'R0I3' !                                               00002750
     TRANSKODE = 'RI3A' THEN                                            00002760
     DO;                                                                00002770
                                                                        00002780
  /***  ÅPNER RF_BASEN                            *********/            00002790
                                                                        00002800
                                                                        00002810
        IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                           00002820
            CALL DATABASE('OPEN');                                      00002830
                                                                        00002840
        ELSE                                                            00002850
            UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                   00002860
                                                                        00002870
        IF FEIL_MELD_NR > 0   THEN                                      00002880
           DO;                                                          00002890
              TERMINERINGS_IND = FATAL_FEIL;                            00002900
              GO TO L999;                                               00002910
           END;                                                         00002920
     END;                                                               00002930
                                                                        00002940
                                                                        00002950
  FEILMELDING_SATT       = '1'B    ;                                    00002960
  AKSJON_IKKE_SATT       = '1'B    ;                                    00002970
  W01.MER_DATA           = '1'B    ;                                    00002980
  ANTALL_FRA_LEST        = 0       ;                                    00002990
  ANTALL_LEST            = 0       ;                                    00003000
                                                                        00003010
                                                                        00003020
                                                                        00003030
                                                                        00003040
  GAMMEL_AKSJONSKODE = 'DU';  /* GIS DUMMY-INIT-VERDI*/                 00003050
                                                                        00003060
  DO WHILE (GAMMEL_AKSJONSKODE ^= '  ');                                00003070
                                                                        00003080
     CALL BYGG_FJERNINGSBILDE;                                          00003090
     IF FEIL_MELD_NR > 0 THEN                                           00003100
        DO;                                                             00003110
           TERMINERINGS_IND = FATAL_FEIL;                               00003120
           GO TO L999;                                                  00003130
        END;                                                            00003140
                                                                        00003150
     IF GAMMEL_AKSJONSKODE = 'BE' THEN                                  00003160
        DO;                                                             00003170
                                                                        00003180
           /***  SKRIVER UT FJERNINGSBILDET MED  DATA.**/               00003190
                                                                        00003200
           S001I03O.CICS_INFOO   =  CICSINFO         ;                  00003210
           MAP_MELDING           = 'INNTEKT(ER) FJERNET.TRYKK ENTER.';  00003220
           S001I03O.MELDING6O    =  MAP_MELDING;                        00003230
           S001I03I.AKSJONL      = -1; /* CURSOR POS */                 00003240
                                                                        00003250
           EXEC CICS SEND MAP('S001I03')                                00003260
                               MAPSET('S001I33')  CURSOR ERASE;         00003270
           EXEC CICS RECEIVE MAP('S001I03')                             00003280
                               MAPSET('S001I33');                       00003290
           GAMMEL_AKSJONSKODE = '  ';                                   00003300
                                                                        00003310
           GO TO FERDIG;                                                00003320
        END;                                                            00003330
     ELSE                                                               00003340
        DO;                                                             00003350
                                                                        00003360
           /***  SKRIVER UT FJERNINGSBILDET MED  DATA.**/               00003370
                                                                        00003380
           S001I03I.MRK1L    = -1; /* CURSOR POS */                     00003390
                                                                        00003400
           EXEC CICS SEND MAP('S001I03')                                00003410
                               MAPSET('S001I33')  CURSOR ERASE;         00003420
                                                                        00003430
        END;                                                            00003440
                                                                        00003450
     IF GAMMEL_AKSJONSKODE = 'ME' THEN                                  00003460
        AKSJON_IKKE_SATT       = '1'B    ;                              00003470
                                                                        00003480
     DO WHILE (AKSJON_IKKE_SATT);                                       00003490
                                                                        00003500
        CALL AKSJON_BEHANDLING;                                         00003510
                                                                        00003520
     END;                                                               00003530
                                                                        00003540
                                                                        00003550
   FERDIG:                                                              00003560
  END;                                                                  00003570
                                                                        00003580
                                                                        00003590
  L999:                                                                 00003600
                                                                        00003610
                                                                        00003620
 IF FEIL_MELD_NR > 0 THEN                                               00003630
    DO;                                                                 00003640
       TERMINERINGS_IND = FATAL_FEIL;                                   00003650
       CALL SKRIV_FEILMELDING;                                          00003660
    END;                                                                00003670
 ELSE                                                                   00003680
    DO;                                                                 00003690
                                                                        00003700
  /***** O M R E G N I N G   P.G.A. I N N T E K T S E N D R I N G **/   00003710
                                                                        00003720
                                                                        00003730
       FØDSNUMMER = FRA_FNR;                                            00003740
                                                                        00003750
       IF INNT_ALDER_FRA = '66' THEN                                    00003760
          ØNSKET_STATUS  = '6';                                         00003770
       ELSE                                                             00003780
          IF INNT_ALDER_FRA = '69' THEN                                 00003790
             ØNSKET_STATUS  = '9';                                      00003800
                                                                        00003810
                                                                        00003820
       EXEC CICS LINK PROGRAM('R001I601')                               00003830
                                     COMMAREA (KOM_OMR);                00003840
                                                                        00003850
      IF FEIL_MELD_NR > 0 THEN                                          00003860
         DO;                                                            00003870
            GOTO L999;                                                  00003880
         END;                                                           00003890
      ELSE                                                              00003900
         PROGRAM_ID = 'R001I301';                                       00003910
                                                                        00003920
      CALL DATABASE('CLOSE');                                           00003930
                                                                        00003940
      ALLOCATE S001I01O;                                                00003950
      ALLOCATE S001I01I;                                                00003960
                                                                        00003970
      EXEC CICS LOAD PROGRAM('S001I13');                                00003980
                                                                        00003990
      S001I01I.STYREKODEL   = -1;                                       00004000
      S001I01O.CICS_INFOO   =  CICSINFO;                                00004010
                                                                        00004020
      EXEC CICS SEND MAP('S001I01')                                     00004030
                                MAPSET('S001I13') CURSOR ERASE;         00004040
                                                                        00004050
      EXEC CICS RETURN;                                                 00004060
   END;                                                                 00004070
                                                                        00004080
                                                                        00004090
                                                                        00004100
                                                                        00004110
  /**********    H O V E D S T Y R I N G   S L U T T   *************/   00004120
                                                                        00004130
                                                                        00004140
                                                                        00004150
                                                                        00004160
 BYGG_FJERNINGSBILDE:                                                   00004170
   PROC;                                                                00004180
                                                                        00004190
    ALLOCATE S001I03O;                                                  00004200
    ALLOCATE S001I03I;                                                  00004210
                                                                        00004220
    EXEC CICS LOAD PROGRAM('S001I33');                                  00004230
                                                                        00004240
    S001I03O.FNRO         = FRA_FNR;                                    00004250
    S001I03O.CICS_INFOO   = CICSINFO;                                   00004260
                                                                        00004270
    SSA1_RF0PERSN.PKEY    = FRA_FNR;                                    00004280
                                                                        00004290
    IF ANTALL_FRA_LEST  < 25 THEN                                       00004300
       DO;                                                              00004310
          W02_GET      = W02_GU;                                        00004320
          CALL P005_LES_ROT_QUAL_FNR;                                   00004330
                                                                        00004340
          IF W01.MER_DATA THEN                                          00004350
             ANTALL_FRA_LEST  = 1;                                      00004360
          ELSE                                                          00004370
             DO;                                                        00004380
             /* ******************************************** */         00004390
             /* FRA-FNR IKKE I DATABASE--> FEILMELDING.     */          00004400
             /* ******************************************** */         00004410
                                                                        00004420
                MAP_MELDING =                                           00004430
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!         00004440
                                  ' ER IKKE I DATABASEN.' ;             00004450
                ALLOCATE S001I01O;                                      00004460
                ALLOCATE S001I01I;                                      00004470
                                                                        00004480
                EXEC CICS LOAD PROGRAM('S001I13');                      00004490
                                                                        00004500
                S001I01O.FRAFNRA      = 'I';                            00004510
                S001I01O.FRAFNRO      = FRA_FNR;                        00004520
                S001I01I.FRAFNRL      = -1; /* CURSOR POS       */      00004530
                S001I01O.STYREKODEO   = STYREKODE;                      00004540
                S001I01O.CICS_INFOO   = CICSINFO;                       00004550
                S001I01O.MELDINGO     = MAP_MELDING;                    00004560
                                                                        00004570
                EXEC CICS SEND MAP('S001I01')                           00004580
                                      MAPSET('S001I13') CURSOR ERASE;   00004590
                                                                        00004600
                TRANSKODE = 'R0I1';                                     00004610
                                                                        00004620
                CALL DATABASE('CLOSE');                                 00004630
                                                                        00004640
                IF FEIL_MELD_NR > 0   THEN                              00004650
                   DO;                                                  00004660
                      TERMINERINGS_IND = FATAL_FEIL;                    00004670
                      GO TO L999;                                       00004680
                   END;                                                 00004690
                                                                        00004700
                EXEC CICS RETURN;                                       00004710
             END;                                                       00004720
       END;                                                             00004730
    ELSE                                                                00004740
                                                                        00004750
       DO;                                                              00004760
          ANTALL_FRA_LEST  = 1;                                         00004770
                                                                        00004780
          SSA1_RF0PERSN.PKEY       = FRA_FNR;                           00004790
                                                                        00004800
          W02_GET      = W02_GU;                                        00004810
                                                                        00004820
          CALL P005_LES_ROT_QUAL_FNR;                                   00004830
                                                                        00004840
          SSA1_PINNTEKT.ÅR           =     HUSK_PI_ÅR_FRA     ;         00004850
          SSA1_PINNTEKT.TYPE         =     HUSK_PI_TYPE_FRA   ;         00004860
                                                                        00004870
          W02_GET      = W02_GNP;                                       00004880
          CALL P010_LES_INNT_QUAL;                                      00004890
                                                                        00004900
          CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                          00004910
                                                                        00004920
          ANTALL_FRA_LEST  = ANTALL_FRA_LEST + 1;                       00004930
       END;                                                             00004940
                                                                        00004950
    DO WHILE(W01.MER_DATA  &  ANTALL_FRA_LEST < 25);                    00004960
                                                                        00004970
                                                                        00004980
       /*******    LES NESTE PINNTEKT     *********/                    00004990
                                                                        00005000
       CALL P020_LES_NESTE_PINNTEKT_FNR;                                00005010
                                                                        00005020
       IF W01.MER_DATA     THEN                                         00005030
          DO;                                                           00005040
                                                                        00005050
             CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                       00005060
                                                                        00005070
                                                                        00005080
             ANTALL_FRA_LEST = ANTALL_FRA_LEST + 1;                     00005090
          END;                                                          00005100
    END;                                                                00005110
                                                                        00005120
    ANTALL_LEST = ANTALL_FRA_LEST - 1;                                  00005130
                                                                        00005140
    IF    ANTALL_FRA_LEST > 24 THEN                                     00005150
                                                                        00005160
          CALL SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                         00005170
    ELSE                                                                00005180
       CALL SJEKK_OM_INGEN_INNTEKTER;                                   00005190
  END BYGG_FJERNINGSBILDE;                                              00005200
                                                                        00005210
                                                                        00005220
                                                                        00005230
 SJEKK_OM_FLERE_INNTEKTER_FRAFNR:                                       00005240
   PROC;                                                                00005250
                                                                        00005260
     /*******    LES VENTE_BASE   *********/                            00005270
                                                                        00005280
  CALL P020_LES_NESTE_PINNTEKT_FNR;                                     00005290
                                                                        00005300
  IF W01.MER_DATA     THEN                                              00005310
     DO;                                                                00005320
        MAP_MELDING =                                                   00005330
                     'FLERE EN 24 INNTEKTER REGISTERT PÅ FRA-FNR. ' !!  00005340
                               'AKSJONSKODE = ME ==> NESTE SIDE.';      00005350
                                                                        00005360
        S001I03O.CICS_INFOO = CICSINFO            ;                     00005370
        S001I03O.MELDING6O  = MAP_MELDING;                              00005380
                                                                        00005390
        HUSK_PI_ÅR_FRA   = W02_PI_ÅR;                                   00005400
        HUSK_PI_TYPE_FRA = W02_PI_TYPE;                                 00005410
                                                                        00005420
                                                                        00005430
     END;                                                               00005440
  ELSE                                                                  00005450
     ANTALL_FRA_LEST = 24;                                              00005460
                                                                        00005470
  END SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                                  00005480
                                                                        00005490
                                                                        00005500
                                                                        00005510
                                                                        00005520
                                                                        00005530
                                                                        00005540
 SJEKK_OM_INGEN_INNTEKTER:                                              00005550
   PROC;                                                                00005560
                                                                        00005570
                                                                        00005580
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                            00005590
                          ANTALL_FRA_LEST = 1 THEN                      00005600
          DO;                                                           00005610
             FEILMELDING_SATT   = '1'B;                                 00005620
             MAP_MELDING =                                              00005630
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!         00005640
                                  ' HAR IKKE REGISTERTE INNTEKTER ' ;   00005650
             ALLOCATE S001I01O;                                         00005660
             ALLOCATE S001I01I;                                         00005670
                                                                        00005680
             EXEC CICS LOAD PROGRAM('S001I13');                         00005690
                                                                        00005700
             S001I01I.FRAFNRL      = -1; /* CURSOR POS       */         00005710
             S001I01O.FRAFNRA      = 'I';                               00005720
             S001I01O.STYREKODEO   = STYREKODE;                         00005730
             S001I01O.FRAFNRO      = FRA_FNR;                           00005740
             S001I01O.CICS_INFOO   = CICSINFO       ;                   00005750
             S001I01O.MELDINGO     = MAP_MELDING;                       00005760
                                                                        00005770
             EXEC CICS SEND MAP('S001I01')                              00005780
                                      MAPSET('S001I13') CURSOR ERASE;   00005790
                                                                        00005800
             TRANSKODE = 'R0I1';                                        00005810
                                                                        00005820
             EXEC CICS RETURN;                                          00005830
          END;                                                          00005840
               WHEN('FM')                                               00006630
                  DO;                                                   00006640
                     CALL BEHANDLE_MARKERTE_LINJER;                     00006650
                                                                        00006660
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00006670
                                                                        00006680
                     S001I03I.AKSJONL    = -1; /* CURSOR POS */         00006690
                                                                        00006700
                     EXEC CICS SEND MAP('S001I03')                      00006710
                               MAPSET('S001I33')  CURSOR ERASE;         00006720
                                                                        00006730
                  END;                                                  00006740
                                                                        00006750
               WHEN('BE')                                               00006760
                  DO;                                                   00006770
                     IF GAMMEL_AKSJONSKODE    = 'FA' !                  00006780
                        GAMMEL_AKSJONSKODE    = 'ME' !                  00006790
                        GAMMEL_AKSJONSKODE    = 'FM'            THEN    00006800
                        DO;                                             00006810
                           SSA1_RF0PERSN.PKEY =  FRA_FNR;               00006820
                                                                        00006830
                           /*--------------------------------------*/   00006840
                           /* SKRIVER DATA TIL NORTRYGD            */   00006850
                           /*--------------------------------------*/   00006860
                                                                        00006870
                           W_TKNR = F100_FINN_TKNR (FRA_FNR)        ;   00006880
                           W_FNR              =     FRA_FNR         ;   00006890
                                                                        00006900
                           IF FEIL_MELD_NR    >  0              THEN    00006910
                              DO;                                       00006920
                                 AKSJON_IKKE_SATT  = '0'B;              00006930
                                 GO TO RETUR;                           00006940
                              END;                                      00006950
                                                                        00006960
                           IF W_TKNR          > 0               THEN    00006970
                              CALL P900_NOR_DATA  (W_FNR , W_TKNR)  ;   00006980
                                                                        00006990
                           IF FEIL_MELD_NR    >  0              THEN    00007000
                              DO;                                       00007010
                                 AKSJON_IKKE_SATT  = '0'B;              00007020
                                 GO TO RETUR;                           00007030
                              END;                                      00007040
                           ELSE                                         00007050
                              PROGRAM_ID      = 'R001I301'          ;   00007060
                                                                        00007070
                           CALL FJERN_INNTEKTER;                        00007080
                                                                        00007090
                           IF FEIL_MELD_NR         >  0         THEN    00007100
                              DO;                                       00007110
                                 TERMINERINGS_IND  =  FATAL_FEIL    ;   00007120
                                 AKSJON_IKKE_SATT  = '0'B;              00007130
                                 GO TO RETUR;                           00007140
                              END;                                      00007150
                                                                        00007160
                           GAMMEL_AKSJONSKODE = 'BE';                   00007170
                           AKSJON_IKKE_SATT   = '0'B;                   00007180
                        END;                                            00007190
                      ELSE                                              00007200
                        DO;                                             00007210
                           MAP_MELDING       = 'FA/FM MÅ OPPGIS FØRST.';00007220
                           FEILMELDING_SATT  = '1'B;                    00007230
                           S001I03I.AKSJONL  =                          00007240
                                                -1; /* CURSOR POS */    00007250
                           S001I03O.MELDING6O = MAP_MELDING;            00007260
                                                                        00007270
                           EXEC CICS SEND MAP('S001I03')                00007280
                                         MAPSET('S001I33') CURSOR ERASE;00007290
                        END;                                            00007300
                  END;                                                  00007310
               WHEN('SI')                                               00007320
                  DO;                                                   00007330
                     TRANSKODE =   'RI3A';                              00007340
                     EXEC CICS XCTL PROGRAM('R001I301')                 00007350
                                       COMMAREA(INTERN_KOM_OMR);        00007360
                  END;                                                  00007370
               WHEN('ME')                                               00007380
                  DO;                                                   00007390
                     AKSJON_IKKE_SATT       = '0'B;                     00007400
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                  00007410
                  END;                                                  00007420
               OTHERWISE                                                00007430
                  DO;                                                   00007440
                     MAP_MELDING        = 'UGYLDIG AKSJONSKODE';        00007450
                     FEILMELDING_SATT   = '1'B;                         00007460
                     S001I03I.AKSJONL  =                                00007470
                                          -1; /* CURSOR POS */          00007480
                     S001I03O.MELDING6O = MAP_MELDING;                  00007490
                                                                        00007500
                     EXEC CICS SEND MAP('S001I03')                      00007510
                                          MAPSET('S001I33') CURSOR;     00007520
                  END;                                                  00007530
            END;                                                        00007540
         END;                                                           00007550
      ELSE                                                              00007560
         DO;                                                            00007570
            MAP_MELDING        = 'AKSJONSKODE MÅ OPPGIS';               00007580
            FEILMELDING_SATT   = '1'B;                                  00007590
            S001I03I.AKSJONL   = -1; /* CURSOR POS */                   00007600
            S001I03O.CICS_INFOO = CICSINFO        ;                     00007610
            S001I03O.MELDING6O = MAP_MELDING;                           00007620
                                                                        00007630
            EXEC CICS SEND MAP('S001I03')  MAPSET('S001I33') CURSOR;    00007640
         END;                                                           00007650
  END;                                                                  00007660
  RETUR:                                                                00007670
                                                                        00007680
  END AKSJON_BEHANDLING;                                                00007690
                                                                        00007700
  FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR:                                       00007710
     PROC;                                                              00007720
     SELECT(ANTALL_FRA_LEST);                                           00007730
        WHEN(1)                                                         00007740
            DO;                                                         00007750
               S001I03O.ÅR1O    = W02_PI_ÅR;                            00007760
               S001I03O.TYPE1O  = W02_PI_TYPE;                          00007770
               S001I03O.BELØP1O = W02_PI * 100;                         00007780
               W02.TAB_PI_ÅR(1)       = W02_PI_ÅR;                      00007790
               W02.TAB_PI_KODE(1)     = W02_PI_KODE;                    00007800
               W02.TAB_PI(1)          = W02_PI;                         00007810
               W02.TAB_PI_KOMMNR(1)   = W02_PI_KOMMNR;                  00007820
               W02.TAB_PI_RAPPDATO(1) = W02_PI_RAPPDATO;                00007830
            END;                                                        00007840
        WHEN(2)                                                         00007850
            DO;                                                         00007860
               S001I03O.ÅR2O    = W02_PI_ÅR;                            00007870
               S001I03O.TYPE2O  = W02_PI_TYPE;                          00007880
               S001I03O.BELØP2O = W02_PI * 100;                         00007890
               W02.TAB_PI_ÅR(2)       = W02_PI_ÅR;                      00007900
               W02.TAB_PI_KODE(2)     = W02_PI_KODE;                    00007910
               W02.TAB_PI(2)          = W02_PI;                         00007920
               W02.TAB_PI_KOMMNR(2)   = W02_PI_KOMMNR;                  00007930
               W02.TAB_PI_RAPPDATO(2) = W02_PI_RAPPDATO;                00007940
            END;                                                        00007950
        WHEN(3)                                                         00007960
            DO;                                                         00007970
               S001I03O.ÅR3O    = W02_PI_ÅR;                            00007980
               S001I03O.TYPE3O  = W02_PI_TYPE;                          00007990
               S001I03O.BELØP3O = W02_PI * 100;                         00008000
               W02.TAB_PI_ÅR(3)       = W02_PI_ÅR;                      00008010
               W02.TAB_PI_KODE(3)     = W02_PI_KODE;                    00008020
               W02.TAB_PI(3)          = W02_PI;                         00008030
               W02.TAB_PI_KOMMNR(3)   = W02_PI_KOMMNR;                  00008040
               W02.TAB_PI_RAPPDATO(3) = W02_PI_RAPPDATO;                00008050
            END;                                                        00008060
        WHEN(4)                                                         00008070
            DO;                                                         00008080
               S001I03O.ÅR4O    = W02_PI_ÅR;                            00008090
               S001I03O.TYPE4O  = W02_PI_TYPE;                          00008100
               S001I03O.BELØP4O = W02_PI * 100;                         00008110
               W02.TAB_PI_ÅR(4)       = W02_PI_ÅR;                      00008120
               W02.TAB_PI_KODE(4)     = W02_PI_KODE;                    00008130
               W02.TAB_PI(4)          = W02_PI;                         00008140
               W02.TAB_PI_KOMMNR(4)   = W02_PI_KOMMNR;                  00008150
               W02.TAB_PI_RAPPDATO(4) = W02_PI_RAPPDATO;                00008160
            END;                                                        00008170
        WHEN(5)                                                         00008180
            DO;                                                         00008190
               S001I03O.ÅR5O    = W02_PI_ÅR;                            00008200
               S001I03O.TYPE5O  = W02_PI_TYPE;                          00008210
               S001I03O.BELØP5O = W02_PI * 100;                         00008220
               W02.TAB_PI_ÅR(5)       = W02_PI_ÅR;                      00008230
               W02.TAB_PI_KODE(5)     = W02_PI_KODE;                    00008240
               W02.TAB_PI(5)          = W02_PI;                         00008250
               W02.TAB_PI_KOMMNR(5)   = W02_PI_KOMMNR;                  00008260
               W02.TAB_PI_RAPPDATO(5) = W02_PI_RAPPDATO;                00008270
            END;                                                        00008280
        WHEN(6)                                                         00008290
            DO;                                                         00008300
               S001I03O.ÅR6O    = W02_PI_ÅR;                            00008310
               S001I03O.TYPE6O  = W02_PI_TYPE;                          00008320
               S001I03O.BELØP6O = W02_PI * 100;                         00008330
               W02.TAB_PI_ÅR(6)       = W02_PI_ÅR;                      00008340
               W02.TAB_PI_KODE(6)     = W02_PI_KODE;                    00008350
               W02.TAB_PI(6)          = W02_PI;                         00008360
               W02.TAB_PI_KOMMNR(6)   = W02_PI_KOMMNR;                  00008370
               W02.TAB_PI_RAPPDATO(6) = W02_PI_RAPPDATO;                00008380
            END;                                                        00008390
        WHEN(7)                                                         00008400
            DO;                                                         00008410
               S001I03O.ÅR7O    = W02_PI_ÅR;                            00008420
               S001I03O.TYPE7O  = W02_PI_TYPE;                          00008430
               S001I03O.BELØP7O = W02_PI * 100;                         00008440
               W02.TAB_PI_ÅR(7)       = W02_PI_ÅR;                      00008450
               W02.TAB_PI_KODE(7)     = W02_PI_KODE;                    00008460
               W02.TAB_PI(7)          = W02_PI;                         00008470
               W02.TAB_PI_KOMMNR(7)   = W02_PI_KOMMNR;                  00008480
               W02.TAB_PI_RAPPDATO(7) = W02_PI_RAPPDATO;                00008490
            END;                                                        00008500
        WHEN(8)                                                         00008510
            DO;                                                         00008520
               S001I03O.ÅR8O    = W02_PI_ÅR;                            00008530
               S001I03O.TYPE8O  = W02_PI_TYPE;                          00008540
               S001I03O.BELØP8O = W02_PI * 100;                         00008550
               W02.TAB_PI_ÅR(8)       = W02_PI_ÅR;                      00008560
               W02.TAB_PI_KODE(8)     = W02_PI_KODE;                    00008570
               W02.TAB_PI(8)          = W02_PI;                         00008580
               W02.TAB_PI_KOMMNR(8)   = W02_PI_KOMMNR;                  00008590
               W02.TAB_PI_RAPPDATO(8) = W02_PI_RAPPDATO;                00008600
            END;                                                        00008610
        WHEN(9)                                                         00008620
            DO;                                                         00008630
               S001I03O.ÅR9O    = W02_PI_ÅR;                            00008640
               S001I03O.TYPE9O  = W02_PI_TYPE;                          00008650
               S001I03O.BELØP9O = W02_PI * 100;                         00008660
               W02.TAB_PI_ÅR(9)       = W02_PI_ÅR;                      00008670
               W02.TAB_PI_KODE(9)     = W02_PI_KODE;                    00008680
               W02.TAB_PI(9)          = W02_PI;                         00008690
               W02.TAB_PI_KOMMNR(9)   = W02_PI_KOMMNR;                  00008700
               W02.TAB_PI_RAPPDATO(9) = W02_PI_RAPPDATO;                00008710
            END;                                                        00008720
        WHEN(10)                                                        00008730
            DO;                                                         00008740
               S001I03O.ÅR10O    = W02_PI_ÅR;                           00008750
               S001I03O.TYPE10O  = W02_PI_TYPE;                         00008760
               S001I03O.BELØP10O = W02_PI * 100;                        00008770
               W02.TAB_PI_ÅR(10)       = W02_PI_ÅR;                     00008780
               W02.TAB_PI_KODE(10)     = W02_PI_KODE;                   00008790
               W02.TAB_PI(10)          = W02_PI;                        00008800
               W02.TAB_PI_KOMMNR(10)   = W02_PI_KOMMNR;                 00008810
               W02.TAB_PI_RAPPDATO(10) = W02_PI_RAPPDATO;               00008820
            END;                                                        00008830
        WHEN(11)                                                        00008840
            DO;                                                         00008850
               S001I03O.ÅR11O    = W02_PI_ÅR;                           00008860
               S001I03O.TYPE11O  = W02_PI_TYPE;                         00008870
               S001I03O.BELØP11O = W02_PI * 100;                        00008880
               W02.TAB_PI_ÅR(11)       = W02_PI_ÅR;                     00008890
               W02.TAB_PI_KODE(11)     = W02_PI_KODE;                   00008900
               W02.TAB_PI(11)          = W02_PI;                        00008910
               W02.TAB_PI_KOMMNR(11)   = W02_PI_KOMMNR;                 00008920
               W02.TAB_PI_RAPPDATO(11) = W02_PI_RAPPDATO;               00008930
            END;                                                        00008940
        WHEN(12)                                                        00008950
            DO;                                                         00008960
               S001I03O.ÅR12O    = W02_PI_ÅR;                           00008970
               S001I03O.TYPE12O  = W02_PI_TYPE;                         00008980
               S001I03O.BELØP12O = W02_PI * 100;                        00008990
               W02.TAB_PI_ÅR(12)       = W02_PI_ÅR;                     00009000
               W02.TAB_PI_KODE(12)     = W02_PI_KODE;                   00009010
               W02.TAB_PI(12)          = W02_PI;                        00009020
               W02.TAB_PI_KOMMNR(12)   = W02_PI_KOMMNR;                 00009030
               W02.TAB_PI_RAPPDATO(12) = W02_PI_RAPPDATO;               00009040
            END;                                                        00009050
        WHEN(13)                                                        00009060
            DO;                                                         00009070
               S001I03O.ÅR13O    = W02_PI_ÅR;                           00009080
               S001I03O.TYPE13O  = W02_PI_TYPE;                         00009090
               S001I03O.BELØP13O = W02_PI * 100;                        00009100
               W02.TAB_PI_ÅR(13)       = W02_PI_ÅR;                     00009110
               W02.TAB_PI_KODE(13)     = W02_PI_KODE;                   00009120
               W02.TAB_PI(13)          = W02_PI;                        00009130
               W02.TAB_PI_KOMMNR(13)   = W02_PI_KOMMNR;                 00009140
               W02.TAB_PI_RAPPDATO(13) = W02_PI_RAPPDATO;               00009150
            END;                                                        00009160
        WHEN(14)                                                        00009170
            DO;                                                         00009180
               S001I03O.ÅR14O    = W02_PI_ÅR;                           00009190
               S001I03O.TYPE14O  = W02_PI_TYPE;                         00009200
               S001I03O.BELØP14O = W02_PI * 100;                        00009210
               W02.TAB_PI_ÅR(14)       = W02_PI_ÅR;                     00009220
               W02.TAB_PI_KODE(14)     = W02_PI_KODE;                   00009230
               W02.TAB_PI(14)          = W02_PI;                        00009240
               W02.TAB_PI_KOMMNR(14)   = W02_PI_KOMMNR;                 00009250
               W02.TAB_PI_RAPPDATO(14) = W02_PI_RAPPDATO;               00009260
            END;                                                        00009270
        WHEN(15)                                                        00009280
            DO;                                                         00009290
               S001I03O.ÅR15O    = W02_PI_ÅR;                           00009300
               S001I03O.TYPE15O  = W02_PI_TYPE;                         00009310
               S001I03O.BELØP15O = W02_PI * 100;                        00009320
               W02.TAB_PI_ÅR(15)       = W02_PI_ÅR;                     00009330
               W02.TAB_PI_KODE(15)     = W02_PI_KODE;                   00009340
               W02.TAB_PI(15)          = W02_PI;                        00009350
               W02.TAB_PI_KOMMNR(15)   = W02_PI_KOMMNR;                 00009360
               W02.TAB_PI_RAPPDATO(15) = W02_PI_RAPPDATO;               00009370
            END;                                                        00009380
        WHEN(16)                                                        00009390
            DO;                                                         00009400
               S001I03O.ÅR16O    = W02_PI_ÅR;                           00009410
               S001I03O.TYPE16O  = W02_PI_TYPE;                         00009420
               S001I03O.BELØP16O = W02_PI * 100;                        00009430
               W02.TAB_PI_ÅR(16)       = W02_PI_ÅR;                     00009440
               W02.TAB_PI_KODE(16)     = W02_PI_KODE;                   00009450
               W02.TAB_PI(16)          = W02_PI;                        00009460
               W02.TAB_PI_KOMMNR(16)   = W02_PI_KOMMNR;                 00009470
               W02.TAB_PI_RAPPDATO(16) = W02_PI_RAPPDATO;               00009480
            END;                                                        00009490
        WHEN(17)                                                        00009500
            DO;                                                         00009510
               S001I03O.ÅR17O    = W02_PI_ÅR;                           00009520
               S001I03O.TYPE17O  = W02_PI_TYPE;                         00009530
               S001I03O.BELØP17O = W02_PI * 100;                        00009540
               W02.TAB_PI_ÅR(17)       = W02_PI_ÅR;                     00009550
               W02.TAB_PI_KODE(17)     = W02_PI_KODE;                   00009560
               W02.TAB_PI(17)          = W02_PI;                        00009570
               W02.TAB_PI_KOMMNR(17)   = W02_PI_KOMMNR;                 00009580
               W02.TAB_PI_RAPPDATO(17) = W02_PI_RAPPDATO;               00009590
            END;                                                        00009600
        WHEN(18)                                                        00009610
            DO;                                                         00009620
               S001I03O.ÅR18O    = W02_PI_ÅR;                           00009630
               S001I03O.TYPE18O  = W02_PI_TYPE;                         00009640
               S001I03O.BELØP18O = W02_PI * 100;                        00009650
               W02.TAB_PI_ÅR(18)       = W02_PI_ÅR;                     00009660
               W02.TAB_PI_KODE(18)     = W02_PI_KODE;                   00009670
               W02.TAB_PI(18)          = W02_PI;                        00009680
               W02.TAB_PI_KOMMNR(18)   = W02_PI_KOMMNR;                 00009690
               W02.TAB_PI_RAPPDATO(18) = W02_PI_RAPPDATO;               00009700
            END;                                                        00009710
        WHEN(19)                                                        00009720
            DO;                                                         00009730
               S001I03O.ÅR19O    = W02_PI_ÅR;                           00009740
               S001I03O.TYPE19O  = W02_PI_TYPE;                         00009750
               S001I03O.BELØP19O = W02_PI * 100;                        00009760
               W02.TAB_PI_ÅR(19)       = W02_PI_ÅR;                     00009770
               W02.TAB_PI_KODE(19)     = W02_PI_KODE;                   00009780
               W02.TAB_PI(19)          = W02_PI;                        00009790
               W02.TAB_PI_KOMMNR(19)   = W02_PI_KOMMNR;                 00009800
               W02.TAB_PI_RAPPDATO(19) = W02_PI_RAPPDATO;               00009810
            END;                                                        00009820
        WHEN(20)                                                        00009830
            DO;                                                         00009840
               S001I03O.ÅR20O    = W02_PI_ÅR;                           00009850
               S001I03O.TYPE20O  = W02_PI_TYPE;                         00009860
               S001I03O.BELØP20O = W02_PI * 100;                        00009870
               W02.TAB_PI_ÅR(20)       = W02_PI_ÅR;                     00009880
               W02.TAB_PI_KODE(20)     = W02_PI_KODE;                   00009890
               W02.TAB_PI(20)          = W02_PI;                        00009900
               W02.TAB_PI_KOMMNR(20)   = W02_PI_KOMMNR;                 00009910
               W02.TAB_PI_RAPPDATO(20) = W02_PI_RAPPDATO;               00009920
            END;                                                        00009930
        WHEN(21)                                                        00009940
            DO;                                                         00009950
               S001I03O.ÅR21O    = W02_PI_ÅR;                           00009960
               S001I03O.TYPE21O  = W02_PI_TYPE;                         00009970
               S001I03O.BELØP21O = W02_PI * 100;                        00009980
               W02.TAB_PI_ÅR(21)       = W02_PI_ÅR;                     00009990
               W02.TAB_PI_KODE(21)     = W02_PI_KODE;                   00010000
               W02.TAB_PI(21)          = W02_PI;                        00010010
               W02.TAB_PI_KOMMNR(21)   = W02_PI_KOMMNR;                 00010020
               W02.TAB_PI_RAPPDATO(21) = W02_PI_RAPPDATO;               00010030
            END;                                                        00010040
        WHEN(22)                                                        00010050
            DO;                                                         00010060
               S001I03O.ÅR22O    = W02_PI_ÅR;                           00010070
               S001I03O.TYPE22O  = W02_PI_TYPE;                         00010080
               S001I03O.BELØP22O = W02_PI * 100;                        00010090
               W02.TAB_PI_ÅR(22)       = W02_PI_ÅR;                     00010100
               W02.TAB_PI_KODE(22)     = W02_PI_KODE;                   00010110
               W02.TAB_PI(22)          = W02_PI;                        00010120
               W02.TAB_PI_KOMMNR(22)   = W02_PI_KOMMNR;                 00010130
               W02.TAB_PI_RAPPDATO(22) = W02_PI_RAPPDATO;               00010140
            END;                                                        00010150
        WHEN(23)                                                        00010160
            DO;                                                         00010170
               S001I03O.ÅR23O    = W02_PI_ÅR;                           00010180
               S001I03O.TYPE23O  = W02_PI_TYPE;                         00010190
               S001I03O.BELØP23O = W02_PI * 100;                        00010200
               W02.TAB_PI_ÅR(23)       = W02_PI_ÅR;                     00010210
               W02.TAB_PI_KODE(23)     = W02_PI_KODE;                   00010220
               W02.TAB_PI(23)          = W02_PI;                        00010230
               W02.TAB_PI_KOMMNR(23)   = W02_PI_KOMMNR;                 00010240
               W02.TAB_PI_RAPPDATO(23) = W02_PI_RAPPDATO;               00010250
            END;                                                        00010260
        WHEN(24)                                                        00010270
            DO;                                                         00010280
               S001I03O.ÅR24O    = W02_PI_ÅR;                           00010290
               S001I03O.TYPE24O  = W02_PI_TYPE;                         00010300
               S001I03O.BELØP24O = W02_PI * 100;                        00010310
               W02.TAB_PI_ÅR(24)       = W02_PI_ÅR;                     00010320
               W02.TAB_PI_KODE(24)     = W02_PI_KODE;                   00010330
               W02.TAB_PI(24)          = W02_PI;                        00010340
               W02.TAB_PI_KOMMNR(24)   = W02_PI_KOMMNR;                 00010350
               W02.TAB_PI_RAPPDATO(24) = W02_PI_RAPPDATO;               00010360
            END;                                                        00010370
        OTHERWISE;                                                      00010380
     END;                                                               00010390
  END FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                                   00010400
                                                                        00010410
                                                                        00010420
  MARKER_LINJE:                                                         00010430
     PROC;                                                              00010440
     SELECT(I);                                                         00010450
        WHEN(1)                                                         00010460
            S001I03I.MRK1I    = 'M';                                    00010470
        WHEN(2)                                                         00010480
            S001I03I.MRK2I    = 'M';                                    00010490
        WHEN(3)                                                         00010500
            S001I03I.MRK3I    = 'M';                                    00010510
        WHEN(4)                                                         00010520
            S001I03I.MRK4I    = 'M';                                    00010530
        WHEN(5)                                                         00010540
            S001I03I.MRK5I    = 'M';                                    00010550
        WHEN(6)                                                         00010560
            S001I03I.MRK6I    = 'M';                                    00010570
        WHEN(7)                                                         00010580
            S001I03I.MRK7I    = 'M';                                    00010590
        WHEN(8)                                                         00010600
            S001I03I.MRK8I    = 'M';                                    00010610
        WHEN(9)                                                         00010620
            S001I03I.MRK9I    = 'M';                                    00010630
        WHEN(10)                                                        00010640
            S001I03I.MRK10I    = 'M';                                   00010650
        WHEN(11)                                                        00010660
            S001I03I.MRK11I    = 'M';                                   00010670
        WHEN(12)                                                        00010680
            S001I03I.MRK12I    = 'M';                                   00010690
        WHEN(13)                                                        00010700
            S001I03I.MRK13I    = 'M';                                   00010710
        WHEN(14)                                                        00010720
            S001I03I.MRK14I    = 'M';                                   00010730
        WHEN(15)                                                        00010740
            S001I03I.MRK15I    = 'M';                                   00010750
        WHEN(16)                                                        00010760
            S001I03I.MRK16I    = 'M';                                   00010770
        WHEN(17)                                                        00010780
            S001I03I.MRK17I    = 'M';                                   00010790
        WHEN(18)                                                        00010800
            S001I03I.MRK18I    = 'M';                                   00010810
        WHEN(19)                                                        00010820
            S001I03I.MRK19I    = 'M';                                   00010830
        WHEN(20)                                                        00010840
            S001I03I.MRK20I    = 'M';                                   00010850
        WHEN(21)                                                        00010860
            S001I03I.MRK21I    = 'M';                                   00010870
        WHEN(22)                                                        00010880
            S001I03I.MRK22I    = 'M';                                   00010890
        WHEN(23)                                                        00010900
            S001I03I.MRK23I    = 'M';                                   00010910
        WHEN(24)                                                        00010920
            S001I03I.MRK24I    = 'M';                                   00010930
        OTHERWISE;                                                      00010940
     END;                                                               00010950
  END MARKER_LINJE;                                                     00010960
                                                                        00010970
                                                                        00010980
                                                                        00010990
                                                                        00011000
                                                                        00011010
  BEHANDLE_MARKERTE_LINJER:                                             00011020
   PROC;                                                                00011030
     IF S001I03I.MRK1I = 'M' THEN                                       00011040
        DO;                                                             00011050
           S001I03O.MRK1O   = '*';                                      00011060
           S001I03I.ÅR1I    = LOW_VALUES;                               00011070
           S001I03I.TYPE1I  = LOW_VALUES;                               00011080
           S001I03I.BELØP1I = LOW_VALUES;                               00011090
        END;                                                            00011100
     IF S001I03I.MRK2I = 'M' THEN                                       00011110
        DO;                                                             00011120
           S001I03O.MRK2O   = '*';                                      00011130
           S001I03I.ÅR2I    = LOW_VALUES;                               00011140
           S001I03I.TYPE2I  = LOW_VALUES;                               00011150
           S001I03I.BELØP2I = LOW_VALUES;                               00011160
        END;                                                            00011170
     IF S001I03I.MRK3I = 'M' THEN                                       00011180
        DO;                                                             00011190
           S001I03O.MRK3O   = '*';                                      00011200
           S001I03I.ÅR3I    = LOW_VALUES;                               00011210
           S001I03I.TYPE3I  = LOW_VALUES;                               00011220
           S001I03I.BELØP3I = LOW_VALUES;                               00011230
        END;                                                            00011240
     IF S001I03I.MRK4I = 'M' THEN                                       00011250
        DO;                                                             00011260
           S001I03O.MRK4O   = '*';                                      00011270
           S001I03I.ÅR4I    = LOW_VALUES;                               00011280
           S001I03I.TYPE4I  = LOW_VALUES;                               00011290
           S001I03I.BELØP4I = LOW_VALUES;                               00011300
        END;                                                            00011310
     IF S001I03I.MRK5I = 'M' THEN                                       00011320
        DO;                                                             00011330
           S001I03O.MRK5O   = '*';                                      00011340
           S001I03I.ÅR5I    = LOW_VALUES;                               00011350
           S001I03I.TYPE5I  = LOW_VALUES;                               00011360
           S001I03I.BELØP5I = LOW_VALUES;                               00011370
        END;                                                            00011380
     IF S001I03I.MRK6I = 'M' THEN                                       00011390
        DO;                                                             00011400
           S001I03O.MRK6O   = '*';                                      00011410
           S001I03I.ÅR6I    = LOW_VALUES;                               00011420
           S001I03I.TYPE6I  = LOW_VALUES;                               00011430
           S001I03I.BELØP6I = LOW_VALUES;                               00011440
        END;                                                            00011450
     IF S001I03I.MRK7I = 'M' THEN                                       00011460
        DO;                                                             00011470
           S001I03O.MRK7O   = '*';                                      00011480
           S001I03I.ÅR7I    = LOW_VALUES;                               00011490
           S001I03I.TYPE7I  = LOW_VALUES;                               00011500
           S001I03I.BELØP7I = LOW_VALUES;                               00011510
        END;                                                            00011520
     IF S001I03I.MRK8I = 'M' THEN                                       00011530
        DO;                                                             00011540
           S001I03O.MRK8O   = '*';                                      00011550
           S001I03I.ÅR8I    = LOW_VALUES;                               00011560
           S001I03I.TYPE8I  = LOW_VALUES;                               00011570
           S001I03I.BELØP8I = LOW_VALUES;                               00011580
        END;                                                            00011590
     IF S001I03I.MRK9I = 'M' THEN                                       00011600
        DO;                                                             00011610
           S001I03O.MRK9O   = '*';                                      00011620
           S001I03I.ÅR9I    = LOW_VALUES;                               00011630
           S001I03I.TYPE9I  = LOW_VALUES;                               00011640
           S001I03I.BELØP9I = LOW_VALUES;                               00011650
        END;                                                            00011660
     IF S001I03I.MRK10I = 'M' THEN                                      00011670
        DO;                                                             00011680
           S001I03O.MRK10O   = '*';                                     00011690
           S001I03I.ÅR10I    = LOW_VALUES;                              00011700
           S001I03I.TYPE10I  = LOW_VALUES;                              00011710
           S001I03I.BELØP10I = LOW_VALUES;                              00011720
        END;                                                            00011730
     IF S001I03I.MRK11I = 'M' THEN                                      00011740
        DO;                                                             00011750
           S001I03O.MRK11O   = '*';                                     00011760
           S001I03I.ÅR11I    = LOW_VALUES;                              00011770
           S001I03I.TYPE11I  = LOW_VALUES;                              00011780
           S001I03I.BELØP11I = LOW_VALUES;                              00011790
        END;                                                            00011800
     IF S001I03I.MRK12I = 'M' THEN                                      00011810
        DO;                                                             00011820
           S001I03O.MRK12O   = '*';                                     00011830
           S001I03I.ÅR12I    = LOW_VALUES;                              00011840
           S001I03I.TYPE12I  = LOW_VALUES;                              00011850
           S001I03I.BELØP12I = LOW_VALUES;                              00011860
        END;                                                            00011870
     IF S001I03I.MRK13I = 'M' THEN                                      00011880
        DO;                                                             00011890
           S001I03O.MRK13O   = '*';                                     00011900
           S001I03I.ÅR13I    = LOW_VALUES;                              00011910
           S001I03I.TYPE13I  = LOW_VALUES;                              00011920
           S001I03I.BELØP13I = LOW_VALUES;                              00011930
        END;                                                            00011940
     IF S001I03I.MRK14I = 'M' THEN                                      00011950
        DO;                                                             00011960
           S001I03O.MRK14O   = '*';                                     00011970
           S001I03I.ÅR14I    = LOW_VALUES;                              00011980
           S001I03I.TYPE14I  = LOW_VALUES;                              00011990
           S001I03I.BELØP14I = LOW_VALUES;                              00012000
        END;                                                            00012010
     IF S001I03I.MRK15I = 'M' THEN                                      00012020
        DO;                                                             00012030
           S001I03O.MRK15O   = '*';                                     00012040
           S001I03I.ÅR15I    = LOW_VALUES;                              00012050
           S001I03I.TYPE15I  = LOW_VALUES;                              00012060
           S001I03I.BELØP15I = LOW_VALUES;                              00012070
        END;                                                            00012080
     IF S001I03I.MRK16I = 'M' THEN                                      00012090
        DO;                                                             00012100
           S001I03O.MRK16O   = '*';                                     00012110
           S001I03I.ÅR16I    = LOW_VALUES;                              00012120
           S001I03I.TYPE16I  = LOW_VALUES;                              00012130
           S001I03I.BELØP16I = LOW_VALUES;                              00012140
        END;                                                            00012150
     IF S001I03I.MRK17I = 'M' THEN                                      00012160
        DO;                                                             00012170
           S001I03O.MRK17O   = '*';                                     00012180
           S001I03I.ÅR17I    = LOW_VALUES;                              00012190
           S001I03I.TYPE17I  = LOW_VALUES;                              00012200
           S001I03I.BELØP17I = LOW_VALUES;                              00012210
        END;                                                            00012220
     IF S001I03I.MRK18I = 'M' THEN                                      00012230
        DO;                                                             00012240
           S001I03O.MRK18O   = '*';                                     00012250
           S001I03I.ÅR18I    = LOW_VALUES;                              00012260
           S001I03I.TYPE18I  = LOW_VALUES;                              00012270
           S001I03I.BELØP18I = LOW_VALUES;                              00012280
        END;                                                            00012290
     IF S001I03I.MRK19I = 'M' THEN                                      00012300
        DO;                                                             00012310
           S001I03O.MRK19O   = '*';                                     00012320
           S001I03I.ÅR19I    = LOW_VALUES;                              00012330
           S001I03I.TYPE19I  = LOW_VALUES;                              00012340
           S001I03I.BELØP19I = LOW_VALUES;                              00012350
        END;                                                            00012360
     IF S001I03I.MRK20I = 'M' THEN                                      00012370
        DO;                                                             00012380
           S001I03O.MRK20O   = '*';                                     00012390
           S001I03I.ÅR20I    = LOW_VALUES;                              00012400
           S001I03I.TYPE20I  = LOW_VALUES;                              00012410
           S001I03I.BELØP20I = LOW_VALUES;                              00012420
        END;                                                            00012430
     IF S001I03I.MRK21I = 'M' THEN                                      00012440
        DO;                                                             00012450
           S001I03O.MRK21O   = '*';                                     00012460
           S001I03I.ÅR21I    = LOW_VALUES;                              00012470
           S001I03I.TYPE21I  = LOW_VALUES;                              00012480
           S001I03I.BELØP21I = LOW_VALUES;                              00012490
        END;                                                            00012500
     IF S001I03I.MRK22I = 'M' THEN                                      00012510
        DO;                                                             00012520
           S001I03O.MRK22O   = '*';                                     00012530
           S001I03I.ÅR22I    = LOW_VALUES;                              00012540
           S001I03I.TYPE22I  = LOW_VALUES;                              00012550
           S001I03I.BELØP22I = LOW_VALUES;                              00012560
        END;                                                            00012570
     IF S001I03I.MRK23I = 'M' THEN                                      00012580
        DO;                                                             00012590
           S001I03O.MRK23O   = '*';                                     00012600
           S001I03I.ÅR23I    = LOW_VALUES;                              00012610
           S001I03I.TYPE23I  = LOW_VALUES;                              00012620
           S001I03I.BELØP23I = LOW_VALUES;                              00012630
        END;                                                            00012640
     IF S001I03I.MRK24I = 'M' THEN                                      00012650
        DO;                                                             00012660
           S001I03O.MRK24O   = '*';                                     00012670
           S001I03I.ÅR24I    = LOW_VALUES;                              00012680
           S001I03I.TYPE24I  = LOW_VALUES;                              00012690
           S001I03I.BELØP24I = LOW_VALUES;                              00012700
        END;                                                            00012710
                                                                        00012720
  END BEHANDLE_MARKERTE_LINJER;                                         00012730
                                                                        00012740
                                                                        00012750
                                                                        00012760
  FJERN_INNTEKTER:                                                      00012770
     PROC;                                                              00012780
                                                                        00012790
                                                                        00012800
     IF S001I03O.MRK1O = '*' THEN                                       00012810
        CALL SKRIV_INNT  (1);                                           00012820
                                                                        00012830
     IF S001I03O.MRK2O = '*' THEN                                       00012840
        CALL SKRIV_INNT  (2);                                           00012850
                                                                        00012860
     IF S001I03O.MRK3O = '*' THEN                                       00012870
        CALL SKRIV_INNT  (3);                                           00012880
                                                                        00012890
     IF S001I03O.MRK4O = '*' THEN                                       00012900
        CALL SKRIV_INNT  (4);                                           00012910
                                                                        00012920
     IF S001I03O.MRK5O = '*' THEN                                       00012930
        CALL SKRIV_INNT  (5);                                           00012940
                                                                        00012950
     IF S001I03O.MRK6O = '*' THEN                                       00012960
        CALL SKRIV_INNT  (6);                                           00012970
                                                                        00012980
     IF S001I03O.MRK7O = '*' THEN                                       00012990
        CALL SKRIV_INNT  (7);                                           00013000
                                                                        00013010
     IF S001I03O.MRK8O = '*' THEN                                       00013020
        CALL SKRIV_INNT  (8);                                           00013030
                                                                        00013040
     IF S001I03O.MRK9O = '*' THEN                                       00013050
        CALL SKRIV_INNT  (9);                                           00013060
                                                                        00013070
     IF S001I03O.MRK10O = '*' THEN                                      00013080
        CALL SKRIV_INNT  (10);                                          00013090
                                                                        00013100
     IF S001I03O.MRK11O = '*' THEN                                      00013110
        CALL SKRIV_INNT  (11);                                          00013120
                                                                        00013130
     IF S001I03O.MRK12O = '*' THEN                                      00013140
        CALL SKRIV_INNT  (12);                                          00013150
                                                                        00013160
     IF S001I03O.MRK13O = '*' THEN                                      00013170
        CALL SKRIV_INNT  (13);                                          00013180
                                                                        00013190
     IF S001I03O.MRK14O = '*' THEN                                      00013200
        CALL SKRIV_INNT  (14);                                          00013210
                                                                        00013220
     IF S001I03O.MRK15O = '*' THEN                                      00013230
        CALL SKRIV_INNT  (15);                                          00013240
                                                                        00013250
     IF S001I03O.MRK16O = '*' THEN                                      00013260
        CALL SKRIV_INNT  (16);                                          00013270
                                                                        00013280
     IF S001I03O.MRK17O = '*' THEN                                      00013290
        CALL SKRIV_INNT  (17);                                          00013300
                                                                        00013310
     IF S001I03O.MRK18O = '*' THEN                                      00013320
        CALL SKRIV_INNT  (18);                                          00013330
                                                                        00013340
     IF S001I03O.MRK19O = '*' THEN                                      00013350
        CALL SKRIV_INNT  (19);                                          00013360
                                                                        00013370
     IF S001I03O.MRK20O = '*' THEN                                      00013380
        CALL SKRIV_INNT  (20);                                          00013390
                                                                        00013400
     IF S001I03O.MRK21O = '*' THEN                                      00013410
        CALL SKRIV_INNT  (21);                                          00013420
                                                                        00013430
     IF S001I03O.MRK22O = '*' THEN                                      00013440
        CALL SKRIV_INNT  (22);                                          00013450
                                                                        00013460
     IF S001I03O.MRK23O = '*' THEN                                      00013470
        CALL SKRIV_INNT  (23);                                          00013480
                                                                        00013490
     IF S001I03O.MRK24O = '*' THEN                                      00013500
        CALL SKRIV_INNT  (24);                                          00013510
                                                                        00013520
  END FJERN_INNTEKTER;                                                  00013530
                                                                        00013540
                                                                        00013550
                                                                        00013560
  SKRIV_INNT:                                                           00013570
   PROC      (I);                                                       00013580
                                                                        00013590
                                                                        00013600
   DCL I                                  PIC '99';                     00013610
                                                                        00013620
   W02_PI_ÅR                 = W02.TAB_PI_ÅR      (I);                  00013630
   W02_PI_KODE               = W02.TAB_PI_KODE    (I);                  00013640
   W02_PI                    = W02.TAB_PI         (I);                  00013650
   W02_PI_KOMMNR             = W02.TAB_PI_KOMMNR  (I);                  00013660
   W02_PI_RAPPDATO           = W02.TAB_PI_RAPPDATO(I);                  00013670
   SSA1_RF0PERSN.PKEY        = FRA_FNR;                                 00013680
                                                                        00013690
   /*----------------------------------------------------------------*/ 00013700
   /* SKRIVER FJERNET RECORD TIL STRYK-REG.                          */ 00013710
   /*     FEIL_MELD_NR = 9999   ==>    RECORD LÅ INNE. IKKE FEIL.    */ 00013720
   /*----------------------------------------------------------------*/ 00013730
                                                                        00013740
   CALL P9958_BEH_STRYK_REG ('SKRIV' , SSA1_RF0PERSN.PKEY , W02_PI_ÅR); 00013750
                                                                        00013760
   IF FEIL_MELD_NR           =    9999                      THEN        00013770
      FEIL_MELD_NR           =    0                                   ; 00013780
   ELSE IF                                                              00013790
      FEIL_MELD_NR           >    0                         THEN        00013800
      DO;                                                               00013810
         FATAL_FEIL          =   '1'B ;                                 00013820
         GO TO RETUR;                                                   00013830
      END;                                                              00013840
                                                                        00013850
   MAP_MELDING               = 'STRYK-REGISTERET OPPDATERT !';          00013860
                                                                        00013870
   CALL P10_FJERN_PINNTEKT;                                             00013880
                                                                        00013890
   IF FEIL_MELD_NR           >    0                         THEN        00013900
      DO;                                                               00013910
         FATAL_FEIL          =   '1'B ;                                 00013920
         GO TO RETUR;                                                   00013930
      END;                                                              00013940
                                                                        00013950
   W02_INNT_MÅ                        =    W02_PI_ÅR + 100;             00013960
                                                                        00013970
   IF F_ALDER(W02_INNT_MÅ,FRA_FNR)    =    66                THEN       00013980
      INNT_ALDER_FRA                  =   '66';                         00013990
   ELSE                                                                 00014000
      IF F_ALDER(W02_INNT_MÅ,FRA_FNR) =    69                THEN       00014010
         INNT_ALDER_FRA               =   '69';                         00014020
                                                                        00014030
                                                                        00014040
                                                                        00014050
                                                                        00014060
  SKRIV_LISTEDATA:                                                      00014070
                                                                        00014080
  /* **************************************************************** */00014090
  /*HENSIKT:                                                          */00014100
  /*    SKRIVER OPPLYSNINGER UT PÅ P001.OLINNTE FOR BRUK VED UTSKRIFT */00014110
  /*    AV KONTROLLISTE.                                              */00014120
  /*                                                                  */00014130
  /*BRUK:                                                             */00014140
  /*    CALL SKRIV_LISTEDATA;                                         */00014150
  /*                                                                  */00014160
  /* **************************************************************** */00014170
                                                                        00014180
                                                                        00014190
                                                                        00014200
   DCL                                                                  00014210
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00014220
      KEY_PEKER                  POINTER                ,               00014230
      KEY_RECL                   CHAR (97)              ,               00014240
      KEY                        CHAR (41)              ;               00014250
   DCL                                                                  00014260
      LISTE_RECL                 CHAR(97)   ;                           00014270
   DCL                                                                  00014280
      01 REC_OMR  DEF LISTE_RECL,                                       00014290
         02 KONTOR               CHAR(3)    ,                           00014300
         02 TERMID               CHAR(4)    ,                           00014310
         02 FNR                  PIC '(11)9',                           00014320
         02 REGTPK               CHAR(6)    ,                           00014330
         02 IÅR                  PIC '(2)9' ,                           00014340
         02 BLTYPE               CHAR(1)    ,                           00014350
         02 IART                 CHAR(1)    ,                           00014360
         02 KOMMNR1              PIC '(4)9' ,                           00014370
         02 AGIVNR               PIC '(3)9' ,                           00014380
         02 RAPPDATO             PIC '(6)9' ,                           00014390
         02 NAVN                 CHAR(25)   ,                           00014400
         02 INNTEKT              PIC '(7)9' ,                           00014410
         02 ETYPE                CHAR(1)    ,                           00014420
         02 MERKE                CHAR(1)    ,                           00014430
         02 DÅR                  PIC '(2)9' ,                           00014440
         02 KOMMNR2              PIC '(4)9' ,                           00014450
         02 BRUKERID             CHAR(4)    ,                           00014460
         02 FNR2                 PIC '(11)9',                           00014470
         02 INDEKS               CHAR(1)    ;                           00014480
   DCL                                                                  00014490
      01 HDATO                   PIC '(6)9';                            00014500
   DCL                                                                  00014510
      01 HDATO_REDEF DEF HDATO,                                         00014520
         02 ÅR                   PIC '(2)9',                            00014530
         02 MND                  PIC '(2)9',                            00014540
         02 DAG                  PIC '(2)9';                            00014550
   DCL                                                                  00014560
      01 NYKKEL     DEF KEY,                                            00014570
         02 KONTOR_N             CHAR(3)    ,                           00014580
         02 TERMID_N             CHAR(4)    ,                           00014590
         02 FNR_N                PIC '(11)9',                           00014600
         02 REGTPK_N             CHAR(6)    ,                           00014610
         02 IÅR_N                PIC '(2)9' ,                           00014620
         02 BLTYPE_N             CHAR(1)    ,                           00014630
         02 IART_N               CHAR(1)    ,                           00014640
         02 KOMMNR1_N            PIC '(4)9' ,                           00014650
         02 AGIVNR_N             PIC '(3)9' ,                           00014660
         02 RAPPDATO_N           PIC '(6)9' ;                           00014670
   DCL                                                                  00014680
      01 DATO                    PIC '(6)9';                            00014690
   DCL                                                                  00014700
      01 DATO_REDEF DEF DATO,                                           00014710
         02 DAG                  PIC '(2)9',                            00014720
         02 MND                  PIC '(2)9',                            00014730
         02 ÅR                   PIC '(2)9';                            00014740
                                                                        00014750
   DCL                                                                  00014760
      (DATE, TIME)    BUILTIN;                                          00014770
   DCL                                                                  00014780
      01 W02_BLTYPE              CHAR(1),                               00014790
      01 W02_ART                 CHAR(1);                               00014800
                                                                        00014810
                                                                        00014820
   DCL 1  TID,                                                          00014830
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */00014840
          2  TID2                          CHAR (3); /* MILL.SEK.     */00014850
  DCL TID_D          DEFINED   TID         CHAR (9);                    00014860
                                                                        00014870
                                                                        00014880
                                                                        00014890
                                                                        00014900
     SELECT(W02_PI_TYPE);                                               00014910
                                                                        00014920
        WHEN('B','C','D')                                               00014930
                                                                        00014940
           DO;                                                          00014950
              W02_BLTYPE = 'B';                                         00014960
                                                                        00014970
              IF W02_PI_TYPE = 'B' THEN                                 00014980
                 W02_ART    = '1';                                      00014990
              ELSE                                                      00015000
                 IF W02_PI_TYPE = 'C' THEN                              00015010
                    W02_ART    = '2';                                   00015020
                 ELSE                                                   00015030
                    IF W02_PI_TYPE = 'D' THEN                           00015040
                       W02_ART    = '3';                                00015050
           END;                                                         00015060
                                                                        00015070
        WHEN('E','F')                                                   00015080
                                                                        00015090
           DO;                                                          00015100
              W02_BLTYPE = 'C';                                         00015110
                                                                        00015120
              IF W02_PI_TYPE = 'E' THEN                                 00015130
                 W02_ART    = '1';                                      00015140
              ELSE                                                      00015150
                 IF W02_PI_TYPE = 'F' THEN                              00015160
                    W02_ART    = '2';                                   00015170
           END;                                                         00015180
                                                                        00015190
        WHEN('H','I')                                                   00015200
                                                                        00015210
           DO;                                                          00015220
              W02_BLTYPE = 'D';                                         00015230
                                                                        00015240
              IF W02_PI_TYPE = 'H' THEN                                 00015250
                 W02_ART    = '1';                                      00015260
              ELSE                                                      00015270
                 IF W02_PI_TYPE = 'I' THEN                              00015280
                    W02_ART    = '2';                                   00015290
           END;                                                         00015300
                                                                        00015310
        WHEN('S','T')                                                   00015320
                                                                        00015330
           DO;                                                          00015340
              W02_BLTYPE = 'S';                                         00015350
                                                                        00015360
              IF W02_PI_TYPE = 'S' THEN                                 00015370
                 W02_ART    = '1';                                      00015380
              ELSE                                                      00015390
                 IF W02_PI_TYPE = 'T' THEN                              00015400
                    W02_ART    = '2';                                   00015410
           END;                                                         00015420
                                                                        00015430
        WHEN('V','W')                                                   00015440
                                                                        00015450
           DO;                                                          00015460
              W02_BLTYPE = 'U';                                         00015470
                                                                        00015480
              IF W02_PI_TYPE = 'V' THEN                                 00015490
                 W02_ART    = '1';                                      00015500
              ELSE                                                      00015510
                 IF W02_PI_TYPE = 'W' THEN                              00015520
                    W02_ART    = '2';                                   00015530
           END;                                                         00015540
                                                                        00015550
        OTHERWISE                                                       00015560
           ;                                                            00015570
     END;                                                               00015580
                                                                        00015590
                                                                        00015600
                                                                        00015610
      HDATO             = DATE();                                       00015620
      TID_D             = TIME  ;                                       00015630
                                                                        00015640
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                              00015650
      DATO_REDEF.MND    = HDATO_REDEF.MND;                              00015660
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                              00015670
                                                                        00015680
      LISTE_RECL        = ''               ;                            00015690
      REC_OMR.KONTOR    = 'END'            ;                            00015700
      REC_OMR.FNR       = FRA_FNR          ;                            00015710
      REC_OMR.NAVN      = 'FJERNET'        ;                            00015720
      REC_OMR.TERMID    = EIBTRMID         ;                            00015730
      REC_OMR.REGTPK    = TID1             ;                            00015740
      REC_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                        00015750
      REC_OMR.IÅR       = W02_PI_ÅR        ;                            00015760
      REC_OMR.BLTYPE    = W02_BLTYPE       ;                            00015770
      REC_OMR.IART      = W02_ART          ;                            00015780
      REC_OMR.MERKE     = 'F'              ;                            00015790
      REC_OMR.KOMMNR1   = W02_PI_KOMMNR    ;                            00015800
      REC_OMR.RAPPDATO  = DATO             ;                            00015810
      REC_OMR.AGIVNR    = 0                ;                            00015820
      REC_OMR.INNTEKT   = W02_PI * 100     ;                            00015830
      REC_OMR.INDEKS    = '5'              ;                            00015840
                                                                        00015850
      NYKKEL.KONTOR_N   = 'END'            ;                            00015860
      NYKKEL.TERMID_N   = EIBTRMID         ;                            00015870
      NYKKEL.FNR_N      = FRA_FNR          ;                            00015880
      NYKKEL.REGTPK_N   = TID1             ;                            00015890
      NYKKEL.IÅR_N      = W02_PI_ÅR        ;                            00015900
      NYKKEL.IART_N     = W02_ART          ;                            00015910
      NYKKEL.BLTYPE_N   = W02_BLTYPE       ;                            00015920
      NYKKEL.KOMMNR1_N  = W02_PI_KOMMNR    ;                            00015930
      NYKKEL.AGIVNR_N   = 0                ;                            00015940
      NYKKEL.RAPPDATO_N = DATO             ;                            00015950
      KEY_PEKER         = ADDR(KEY)        ;                            00015960
      KEY_RECL          = LISTE_RECL       ;                            00015970
                                                                        00015980
                                                                        00015990
      EXEC CICS HANDLE CONDITION ERROR    (L105)             ;          00016000
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;          00016010
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (KEY_BIT )           00016020
                                           FROM    (KEY_RECL);          00016030
      GOTO ALT_OK;                                                      00016040
                                                                        00016050
   L105:                                                                00016060
      FEIL_MELD_NR                =    505 ;                            00016070
      FEIL_VED_LABEL              =   '105';                            00016080
      FATAL_FEIL                  =   '1'B ;                            00016090
                                                                        00016100
   ALT_OK:                                                              00016110
   RETUR:                                                               00016120
                                                                        00016130
  END SKRIV_INNT;                                                       00016140
                                                                        00016150
                                                                        00016160
                                                                        00016170
  P10_FJERN_PINNTEKT:                                                   00016180
     PROC;                                                              00016190
                                                                        00016200
  /* **************************************************************** */00016210
  /*HENSIKT:                                                          */00016220
  /*    FJERNER PINNTEKT MED ØNSKET KEY.                              */00016230
  /*                                                                  */00016240
  /*                                                                  */00016250
  /*BRUK:                                                             */00016260
  /*    CALL P10_FJERN_PINNTEKT;                                      */00016270
  /*                                                                  */00016280
  /* **************************************************************** */00016290
                                                                        00016300
                                                                        00016310
      SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR;                 00016320
      SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE;               00016330
                                                                        00016340
                                                                        00016350
    /* ************************************************************** */00016360
    /* TAR ET GHU-KALL,FØR DLET.                                      */00016370
    /* ************************************************************** */00016380
                                                                        00016390
                                                                        00016400
      CALL PLITDLI                        (W02_PARM_CT_5,               00016410
                                           W02_GHU,                     00016420
                                           RF1,                         00016430
                                           W01_PINT,                    00016440
                                           SSA1_RF0PERSN,               00016450
                                           SSA1_PINNTEKT);              00016460
                                                                        00016470
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                    00016480
          ! RF1.STATUS_KODE         ^=       '  '         THEN          00016490
          DO;                                                           00016500
              /* ******************************************** */        00016510
              /* FEIL VED LES   AV :  PINNTEKT                */        00016520
              /* ******************************************** */        00016530
  L110:                                                                 00016540
             FEIL_MELD_NR             =       500 ;                     00016550
             FEIL_VED_LABEL           =      '110';                     00016560
             DB_STATUS_KODE           =       RF1.STATUS_KODE;          00016570
             GO   TO  RETUR;                                            00016580
          END;                                                          00016590
                                                                        00016600
                                                                        00016610
       /* ******************************************** */               00016620
       /* KALLET GHU GIKK OK . DELETER PINNTEKT        */               00016630
       /* ******************************************** */               00016640
                                                                        00016650
       CALL PLITDLI                        (W02_PARM_CT_3,              00016660
                                           W02_DLET,                    00016670
                                           RF1,                         00016680
                                           W01_PINT);                   00016690
                                                                        00016700
       IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                   00016710
         ! RF1.STATUS_KODE         ^=       '  '         THEN           00016720
         DO;                                                            00016730
              /* ******************************************** */        00016740
              /* FEIL VED DELETE  AV :  PINNTEKT              */        00016750
              /* ******************************************** */        00016760
  L125:                                                                 00016770
            FEIL_MELD_NR             =       500 ;                      00016780
            FEIL_VED_LABEL           =      '125';                      00016790
            DB_STATUS_KODE           =       RF1.STATUS_KODE;           00016800
            GO   TO  RETUR;                                             00016810
         END;                                                           00016820
                                                                        00016830
                                                                        00016840
    /* ************************************************************** */00016850
    /*                                                                */00016860
    /* SJEKKER OM DET ER FLERE SEGMENTER UNDER ROT.                   */00016870
    /* HVIS IKKE,FJERNES ROT.                                         */00016880
    /* ************************************************************** */00016890
                                                                        00016900
                                                                        00016910
                                                                        00016920
                                                                        00016930
    /* ************************************************************** */00016940
    /*                                                                */00016950
    /* TAR ET GU-KALL,FØR GNP.                                       */ 00016960
    /*                                                                */00016970
    /* ************************************************************** */00016980
                                                                        00016990
                                                                        00017000
      CALL PLITDLI                        (W02_PARM_CT_4,               00017010
                                           W02_GU,                      00017020
                                           RF1,                         00017030
                                           RF0PERSN,                    00017040
                                           SSA1_RF0PERSN);              00017050
                                                                        00017060
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !                  00017070
          RF1.STATUS_KODE         ^=       '  '             THEN        00017080
          DO;                                                           00017090
              /* ******************************************** */        00017100
              /* FEIL VED LES   AV :  ROT                     */        00017110
              /* ******************************************** */        00017120
  L130:                                                                 00017130
             FEIL_MELD_NR             =       500 ;                     00017140
             FEIL_VED_LABEL           =      '130';                     00017150
             GO   TO  RETUR;                                            00017160
          END;                                                          00017170
                                                                        00017180
                                                                        00017190
      CALL PLITDLI                        (W02_PARM_CT_3,               00017200
                                           W02_GNP,                     00017210
                                           RF1,                         00017220
                                           W01_IO);                     00017230
                                                                        00017240
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK THEN               00017250
          DO;                                                           00017260
              /* ******************************************** */        00017270
              /* FEIL VED LES   AV :  ROT                     */        00017280
              /* ******************************************** */        00017290
  L135:                                                                 00017300
             FEIL_MELD_NR             =       500 ;                     00017310
             FEIL_VED_LABEL           =      '135';                     00017320
             GO   TO  RETUR;                                            00017330
          END;                                                          00017340
      ELSE                                                              00017350
         IF RF1.STATUS_KODE           =   'GE'             THEN         00017360
            DO;                                                         00017370
                                                                        00017380
                                                                        00017390
    /* ************************************************************** */00017400
    /*                                                                */00017410
    /* TAR ET GHU-KALL,FØR DLET.                                      */00017420
    /*                                                                */00017430
    /* ************************************************************** */00017440
                                                                        00017450
               CALL PLITDLI                        (W02_PARM_CT_4,      00017460
                                                    W02_GHU,            00017470
                                                    RF1,                00017480
                                                    W01_IO,             00017490
                                                    SSA1_RF0PERSN);     00017500
                                                                        00017510
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !         00017520
                   RF1.STATUS_KODE         ^=       '  '    THEN        00017530
                   DO;                                                  00017540
              /* ******************************************** */        00017550
              /* FEIL VED LES   AV :  ROT                     */        00017560
              /* ******************************************** */        00017570
  L140:                                                                 00017580
                      FEIL_MELD_NR             =       500 ;            00017590
                      FEIL_VED_LABEL           =      '140';            00017600
                      GO   TO  RETUR;                                   00017610
                   END;                                                 00017620
                                                                        00017630
                                                                        00017640
       /* ******************************************** */               00017650
       /* BARE ROT IGJEN.ROT FJERNES.                  */               00017660
       /* ******************************************** */               00017670
                                                                        00017680
               CALL PLITDLI                        (W02_PARM_CT_3,      00017690
                                                   W02_DLET,            00017700
                                                   RF1,                 00017710
                                                   W01_IO);             00017720
                                                                        00017730
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK           00017740
                 ! RF1.STATUS_KODE         ^=       '  '         THEN   00017750
                   DO;                                                  00017760
              /* ******************************************** */        00017770
              /* FEIL VED DELETE  AV :  ROT                   */        00017780
              /* ******************************************** */        00017790
  L145:                                                                 00017800
                      FEIL_MELD_NR             =       500 ;            00017810
                      FEIL_VED_LABEL           =      '145';            00017820
                      DB_STATUS_KODE           =       RF1.STATUS_KODE; 00017830
                      GO   TO  RETUR;                                   00017840
                   END;                                                 00017850
            END;                                                        00017860
                                                                        00017870
                                                                        00017880
                                                                        00017890
  RETUR:                                                                00017900
                                                                        00017910
  END P10_FJERN_PINNTEKT;                                               00017920
                                                                        00017930
                                                                        00017940
    %PAGE;                                                              00017950
    /* ************************************************************** */00017960
    /*                                                                */00017970
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */00017980
    /* PCB : RF1.                                                     */00017990
    /* ************************************************************** */00018000
                                                                        00018010
    P005_LES_ROT_QUAL_FNR:                                              00018020
      PROC;                                                             00018030
                                                                        00018040
      CALL PLITDLI                              (W02_PARM_CT_4,         00018050
                                                 W02_GET,               00018060
                                                 RF1,                   00018070
                                                 RF0PERSN,              00018080
                                                 SSA1_RF0PERSN);        00018090
                                                                        00018100
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00018110
        DO;                                                             00018120
          SELECT  ( RF1.STATUS_KODE );                                  00018130
                                                                        00018140
            WHEN  ( '  ' )                                              00018150
              W01.MER_DATA                 =    '1'B;                   00018160
                                                                        00018170
            WHEN  ( 'GE' )                                              00018180
              W01.MER_DATA                 =    '0'B;                   00018190
                                                                        00018200
            OTHERWISE                                                   00018210
              DO;                                                       00018220
                /* ************************************************** */00018230
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00018240
                /* ************************************************** */00018250
  L200:                                                                 00018260
                FEIL_MELD_NR               =     500;                   00018270
                FEIL_VED_LABEL             =    '200';                  00018280
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00018290
                W01.MER_DATA               =    '0'B;                   00018300
              END;                                                      00018310
          END;                                                          00018320
        END;                                                            00018330
      ELSE                                                              00018340
        DO;                                                             00018350
          /* ************************************************** */      00018360
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00018370
          /* ************************************************** */      00018380
  L205:                                                                 00018390
          FEIL_MELD_NR               =     500;                         00018400
          FEIL_VED_LABEL             =    '205';                        00018410
          W01.MER_DATA               =    '0'B;                         00018420
        END;                                                            00018430
    END P005_LES_ROT_QUAL_FNR;                                          00018440
                                                                        00018450
                                                                        00018460
                                                                        00018470
                                                                        00018480
    %PAGE;                                                              00018490
    /* ************************************************************** */00018500
    /*                                                                */00018510
    /* PROCEDURE FOR LESE INNT-SEGM GN QUAL.                          */00018520
    /*                                                                */00018530
    /* ************************************************************** */00018540
                                                                        00018550
    P010_LES_INNT_QUAL:                                                 00018560
      PROC;                                                             00018570
                                                                        00018580
                                                                        00018590
      CALL PLITDLI                          (W02_PARM_CT_4,             00018600
                                             W02_GET,                   00018610
                                             RF1,                       00018620
                                             W01_PINT,                  00018630
                                             SSA1_PINNTEKT);            00018640
                                                                        00018650
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00018660
        DO;                                                             00018670
          SELECT  ( RF1.STATUS_KODE );                                  00018680
                                                                        00018690
            WHEN  ( '  ' )                                              00018700
              W01.MER_DATA                 =    '1'B;                   00018710
                                                                        00018720
            WHEN  ( 'GE' )                                              00018730
              W01.MER_DATA                 =    '0'B;                   00018740
                                                                        00018750
            OTHERWISE                                                   00018760
              DO;                                                       00018770
                /* ************************************************** */00018780
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00018790
                /* ************************************************** */00018800
  L210:                                                                 00018810
                FEIL_MELD_NR               =     500;                   00018820
                FEIL_VED_LABEL             =    '210';                  00018830
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00018840
                W01.MER_DATA               =    '0'B;                   00018850
              END;                                                      00018860
          END;                                                          00018870
        END;                                                            00018880
      ELSE                                                              00018890
        DO;                                                             00018900
          /* ************************************************** */      00018910
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00018920
          /* ************************************************** */      00018930
  L220:                                                                 00018940
          FEIL_MELD_NR               =     500;                         00018950
          FEIL_VED_LABEL             =    '220';                        00018960
          W01.MER_DATA               =    '0'B;                         00018970
        END;                                                            00018980
                                                                        00018990
                                                                        00019000
    END P010_LES_INNT_QUAL;                                             00019010
                                                                        00019020
    /* ************************************************************** */00019030
    /*                                                                */00019040
    /* PROCEDURE FOR LESE NESTE PINNTEKT (GNP   UKVALIFISERT  )       */00019050
    /* PCB : RF1.                                                     */00019060
    /* ************************************************************** */00019070
                                                                        00019080
    P020_LES_NESTE_PINNTEKT_FNR:                                        00019090
      PROC;                                                             00019100
                                                                        00019110
      CALL PLITDLI                              (W02_PARM_CT_4,         00019120
                                                 W02_GNP,               00019130
                                                 RF1,                   00019140
                                                 W01_PINT,              00019150
                                                 SSA_UQUAL_PINNTEKT);   00019160
                                                                        00019170
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00019180
        DO;                                                             00019190
          SELECT ( RF1.STATUS_KODE );                                   00019200
                                                                        00019210
            WHEN ( '  ' )                                               00019220
              W01.MER_DATA                 =    '1'B;                   00019230
                                                                        00019240
            WHEN ( 'GE' , 'GB' )                                        00019250
              W01.MER_DATA                 =    '0'B;                   00019260
                                                                        00019270
            OTHERWISE                                                   00019280
              DO;                                                       00019290
                /* ************************************************** */00019300
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00019310
                /* ************************************************** */00019320
  L240:                                                                 00019330
                FEIL_MELD_NR               =     500;                   00019340
                FEIL_VED_LABEL             =    '240';                  00019350
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00019360
                W01.MER_DATA               =    '0'B;                   00019370
              END;                                                      00019380
          END;                                                          00019390
        END;                                                            00019400
      ELSE                                                              00019410
        DO;                                                             00019420
          /* ************************************************** */      00019430
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00019440
          /* ************************************************** */      00019450
  L250:                                                                 00019460
          FEIL_MELD_NR               =     500;                         00019470
          FEIL_VED_LABEL             =    '250';                        00019480
          W01.MER_DATA               =    '0'B;                         00019490
        END;                                                            00019500
    END P020_LES_NESTE_PINNTEKT_FNR;                                    00019510
                                                                        00019520
                                                                        00019530
                                                                        00019540
                                                                        00019550
                                                                        00019560
                                                                        00019570
    /* ************************************************************** */00019580
    /*                                                                */00019590
    /* PROCEDURE FOR FINNE RETT TKNR .   (GU KVAL. PÅ ROT OG PINNTEKT)*/00019600
    /*                                                                */00019610
    /*     TKNR FINNES VED 1. OG SJEKKE OM ROTSEGM. FNR > 0  . ER DET */00019620
    /*     IKKE DET BENYTTES KOMMNR. I SISTE INNTEKTS-SEGM.           */00019630
    /*                                                                */00019640
    /* ************************************************************** */00019650
                                                                        00019660
    F100_FINN_TKNR:                                                     00019670
      PROC            ( W100_FNR)   RETURNS (FIXED DEC(4))            ; 00019680
                                                                        00019690
      DCL W100_FNR      FIXED DEC   (11)                              , 00019700
          W100_TKNR     FIXED DEC   ( 4)     INIT     (0)             ; 00019710
                                                                        00019720
                                                                        00019730
      SSA1_RF0PERSN.PKEY                  =      W100_FNR             ; 00019740
      W02_GET                             =      W02_GU               ; 00019750
      CALL P005_LES_ROT_QUAL_FNR;                                       00019760
                                                                        00019770
                                                                        00019780
                                                                        00019790
      IF RF0PERSN.TKNR                    >      0                THEN  00019800
         W100_TKNR                        =      RF0PERSN.TKNR        ; 00019810
      ELSE                                                              00019820
         DO;                                                            00019830
            CALL PLITDLI                        (W02_PARM_CT_4,         00019840
                                                 W02_GNP,               00019850
                                                 RF1,                   00019860
                                                 W01_PINT,              00019870
                                                 SSA_UQUAL_PINNTEKT_L); 00019880
                                                                        00019890
            IF   UIBFCTR                   =     UIB_RC_OK    THEN      00019900
              DO;                                                       00019910
                 SELECT ( RF1.STATUS_KODE );                            00019920
                                                                        00019930
                    WHEN ( '  ' )                                       00019940
                        W100_TKNR          =     W01_PINT.W02_PI_KOMMNR;00019950
                                                                        00019960
                    WHEN ( 'GE' , 'GB' );                               00019970
                                                                        00019980
                    OTHERWISE                                           00019990
                                                                        00020000
                       /* ******************************************* */00020010
                       /*UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES*/00020020
                       /* ******************************************* */00020030
                       DO;                                              00020040
  L162:                                                                 00020050
                          FEIL_MELD_NR         =     500;               00020060
                          FEIL_VED_LABEL       =    '162';              00020070
                          DB_STATUS_KODE       =     RF1.STATUS_KODE;   00020080
                       END;                                             00020090
                 END;                                                   00020100
              END;                                                      00020110
            ELSE                                                        00020120
              DO;                                                       00020130
                 /* ******************************************* */      00020140
                 /* UIB'S RETUR-CODE ER UAKSEPTABEL             */      00020150
                 /* ******************************************* */      00020160
  L164:                                                                 00020170
                  FEIL_MELD_NR               =     500;                 00020180
                  FEIL_VED_LABEL             =    '164';                00020190
              END;                                                      00020200
         END;                                                           00020210
                                                                        00020220
      RETURN (W100_TKNR);                                               00020230
                                                                        00020240
    END F100_FINN_TKNR;                                                 00020250
                                                                        00020260
                                                                        00020270
                                                                        00020280
  PF2:                                                                  00020290
                                                                        00020300
     MAP_MELDING              = 'TRANSAKSJONEN FORKASTET';              00020310
     FEILMELDING_SATT         = '1'B;                                   00020320
     S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                00020330
     S001I01O.CICS_INFOO      = CICSINFO               ;                00020340
     S001I01O.MELDINGO        = MAP_MELDING;                            00020350
                                                                        00020360
     EXEC CICS SEND MAP('S001I01')                                      00020370
                                       MAPSET('S001I13') CURSOR ERASE;  00020380
                                                                        00020390
     TRANSKODE = 'R0I1';                                                00020400
     EXEC CICS XCTL PROGRAM('R001I101') COMMAREA(KOM_OMR);              00020410
                                                                        00020420
                                                                        00020430
                                                                        00020440
  ERRBEH:                                                               00020450
     EXEC CICS HANDLE CONDITION ERROR;                                  00020460
     EXEC CICS PURGE MESSAGE;                                           00020470
     EXEC CICS ABEND ABCODE('FEIL');                                    00020480
                                                                        00020490
                                                                        00020500
                                                                        00020510
  SKRIV_FEILMELDING:                                                    00020520
     PROC;                                                              00020530
                                                                        00020540
  /* **************************************************************** */00020550
  /*HENSIKT:                                                          */00020560
  /*    GIR UT FEILMELDING.                                           */00020570
  /*                                                                  */00020580
  /*                                                                  */00020590
  /*BRUK:                                                             */00020600
  /*    CALL SKRIV_FEILMELDING;                                       */00020610
  /*                                                                  */00020620
  /* **************************************************************** */00020630
                                                                        00020640
  DCL FNR_PIC                PIC  '(11)9'     INIT (0),                 00020650
      FNR_CHAR DEF FNR_PIC   CHAR  (11)               ;                 00020660
                                                                        00020670
                                                                        00020680
  IF TERMINERINGS_IND = FATAL_FEIL THEN                                 00020690
     DO;                                                                00020700
        EXEC CICS PURGE MESSAGE;                                        00020710
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!        00020720
                               ' GÅR I FEIL VED LABEL NR. '        !!   00020730
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;   00020740
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING      00020750
                                                           JUSTIFY(10); 00020760
                                                                        00020770
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                      00020780
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                        00020790
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);        00020800
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)            00020810
                                                         ACCUM PAGING;  00020820
                                                                        00020830
        IF FEIL_MELD_NR        =     500              THEN              00020840
           DO;                                                          00020850
                                                                        00020860
              /* *************************************************** */ 00020870
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */ 00020880
              /* *************************************************** */ 00020890
                                                                        00020900
              EXEC CICS SEND TEXT FROM  (MAP_MELDING) ACCUM             00020910
                                               PAGING   JUSTIFY (18);   00020920
           END;                                                         00020930
                                                                        00020940
        ELSE                                                            00020950
           IF FEIL_MELD_NR   =     499              THEN                00020960
              DO;                                                       00020970
                                                                        00020980
               /* *************************************************** */00020990
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */00021000
               /* *************************************************** */00021010
                                                                        00021020
                                                                        00021030
                 FNR_PIC          =  DIV_PARAM_OMR.SEARCH_FNR  ;        00021040
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR ;        00021050
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM         00021060
                                                  PAGING   JUSTIFY (18);00021070
              END;                                                      00021080
                                                                        00021090
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!             00021100
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';00021110
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)            00021120
                                                           ACCUM PAGING;00021130
        EXEC CICS SEND PAGE;                                            00021140
                                                                        00021150
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/            00021160
                                                                        00021170
         EXEC CICS ABEND                                                00021180
                     ABCODE(STOP);                                      00021190
     END;                                                               00021200
                                                                        00021210
  END SKRIV_FEILMELDING;                                                00021220
                                                                        00021230
                                                                        00021240
                                                                        00021250
  /* **************************************************************** */00021260
  /*                                                                  */00021270
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE RF-DATABASEN.                     */00021280
  /*                                                                  */00021290
  /* **************************************************************** */00021300
                                                                        00021310
  DATABASE:                                                             00021320
   PROC(STYRING);                                                       00021330
                                                                        00021340
   DCL                                                                  00021350
     STYRING                               CHAR(5),                     00021360
     NULL                                  BUILTIN,                     00021370
     UNSPEC                                BUILTIN,                     00021380
     PLITDLI                               ENTRY;                       00021390
                                                                        00021400
  /*------------------------------------------------------------------*/00021410
  /* DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL   */00021420
  /*------------------------------------------------------------------*/00021430
     DCL                                                                00021440
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00021450
     DCL                                                                00021460
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00021470
     DCL                                                                00021480
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00021490
                                                                        00021500
     DCL 1  W01_DLI_PARAM,                                              00021510
            2   W02_GU             CHAR (4)       INIT('GU  '),         00021520
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00021530
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);              00021540
                                                                        00021550
  %PAGE;                                                                00021560
                                                                        00021570
     IF STYRING = 'OPEN' THEN                                           00021580
        DO;                                                             00021590
           CALL   PLITDLI                        (W02_PARM_CT_3,        00021600
                                                  W01_PCB_FUNCTION,     00021610
                                                  W01_PSB_NAVN,         00021620
                                                  UIBPTR);              00021630
                                                                        00021640
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00021650
              DO;                                                       00021660
                 ALLOCATE PCB_UIB_PEKER_OMR;                            00021670
                 PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;        00021680
                 PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;          00021690
              END;                                                      00021700
           ELSE                                                         00021710
              DO;                                                       00021720
                 FEIL_MELD_NR      =  500;                              00021730
 L555:           FEIL_VED_LABEL    = '555';                             00021740
                 MAP_MELDING =                                          00021750
                         'NOE ER GALT MED DATABASEN, KODE: ' !!         00021760
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);   00021770
              END;                                                      00021780
        END;                                                            00021790
     ELSE                                                               00021800
        DO;                                                             00021810
           CALL   PLITDLI                        (W02_PARM_CT_1,        00021820
                                                  W01_TERM_FUNCTION);   00021830
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00021840
        END;                                                            00021850
                                                                        00021860
  END DATABASE;                                                         00021870
                                                                        00021880
                                                                        00021890
  %INCLUDE R0019912;          /*  NUM-> CHAR                      */    00021900
  %INCLUDE R0019905;          /*  F_ALDER                         */    00021910
  %INCLUDE R0019957;          /*  P900_NOR_DATA       (FNR,TKNR ) */    00021920
  %INCLUDE R0019958;          /*  P9958_BEH_STRYK_REG (BEH,FNR,ÅR)*/    00021930
  %INCLUDE R0019960;          /*  F_CICSINFO                      */    00021940
                                                                        00021950
                                                                        00021960
 END R001I30;                                                           00021970
