 /*       SIST ENDRET 04/03-96 12.49.35 AV   JDA0310                  */00000000
 /*       SIST ENDRET 14/04-89 13.27.16 AV   HERMAN                   */00000010
 /*       SIST ENDRET 12/05-87 08.30.13 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 23/07-86 11.17.38 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 10/12-85 14.51.54 AV   FARVIK                   */00000040
 /*       SIST ENDRET 19/10-84 09.08.22 AV   FARVIK                   */00000050
 /*       SIST ENDRET 01/06-84 14.13.23 AV   FARVIK                   */00000060
 /*       SIST ENDRET 07/02-84 12.25.57 AV   FARVIK                   */00000070
 /*       SIST ENDRET 26/09-83 14.12.19 AV   KARIN                    */00000080
 /*       SIST ENDRET 15/10-82 10.51.49 AV   PERB                     */00000090
 %PAGE;                                /*   */                          00000100
 /* ***************************************************************** */00000110
 /*                R 0 0 1 0 6 0 2                                    */00000120
 /* ***************************************************************** */00000130
 /*IDENTIFIKASJON:                                                    */00000140
 /* **********************                                            */00000150
 /*  PROGRAM-IDENT : R0010602 - SUBPROGRAM - BLANKER ARBEIDSOMRÅDE UP */00000160
 /*  PROGRAM-SPRÅK : PLI                                              */00000170
 /*  PROGRAMMERER  : JAN                                              */00000180
 /*  PROGRAMMET BLE LAGET : MAI 1981                                  */00000190
 /*  ENDRINGERSDATO :                                                 */00000200
 /*  ENDRINGEN GJELDER:                                               */00000210
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000220
 /*                                                                   */00000230
 /* ***************************************************************** */00000240
 /*  ENDRINGERSDATO :          220487                                 */00000250
 /*  ENDRINGEN GJELDER:        PROSEDYRENE BLANK_UP_MAP,              */00000260
 /*                            OVERFØR_UP_SØKER OG OVERFØR_UP_SPES    */00000270
 /*                            ER SKILT UT OG LAGT I R0010609         */00000280
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*HENSIKT:                                                           */00000320
 /* **********                                                        */00000330
 /*  BLANKER UP_TRANS_OMR.                                            */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*PROGRAMTILKNYTTING:                                                */00000370
 /* ********************                                              */00000380
 /*  PROGRAMMET INCLUDES AV R0010601 - KONTROLL_GRUNNBLANKETT_UP      */00000390
 /*  ALLE CICS-KOMMANDOS LIGGER I HOVEDPROG.                          */00000400
 /*  ARBEIDSOMRÅDET - P0010601 - ER INCLUDET I HOVEDPROG.             */00000410
 /*  DE INTERNE PROSEDYRER ER :                                       */00000420
 /*    BLANK_UP_SØKER:    BLANKER SØKERDELEN                          */00000430
 /*    BLANK_UP_BARN:     BLANKER BARNEDELEN                          */00000440
 /*    BLANK_UP_SPES:     BLANKER SPESIELL DEL                        */00000450
 /*    BLANK_UP_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */00000460
 /*    BLANK_YP:          BLANKER YRKESSKADEBLANKETTEN                */00000470
 /*    BLANK_YP_MELDNR:   SETTER 0 I Y-MELDINGSNUMRENE                */00000480
 /*                                                                   */00000490
 /* ***************************************************************** */00000500
 /*DATASETTOPPLYSNINGER:                                              */00000510
 /* ***********************                                           */00000520
 /*    INGEN                                                          */00000530
 /* ***************************************************************** */00000540
 /*FEILMELDINGER:                                                     */00000550
 /* *******************                                               */00000560
 /*    INGEN                                                          */00000570
 /* ***************************************************************** */00000580
 %PAGE;                                /*   */                          00000590
 BLANK_UP_SØKER:                                                        00000600
   PROC;                                                                00000610
         UPS.ATT_UF          = ' ';                                     00000620
         UPS.REGDATO         = 0;                                       00000630
         UPS.TERMID          = (4)' ';                                  00000640
         UPS.FNR             = 0;                                       00000650
         UPS.FNR_GML         = 0;                                       00000660
         UPS.NAVN            = (25)' ';                                 00000670
         UPS.TKNR            = 0;                                       00000680
         UPS.TILL_EK         = ' ';                                     00000690
         UPS.SIVILSTAND      = ' ';                                     00000700
         UPS.SPRÅK           = ' ';                                     00000710
         UPS.NORSK_BOSATT    = ' ';                                     00000720
         UPS.BT_ANT          = 0;                                       00000730
         UPS.YSKADE_TILLEGG  = ' ';                                     00000740
         UPS.VP_ÅR(1)        = 0;                                       00000750
         UPS.VP_ÅR(2)        = 0;                                       00000760
         UPS.VP_ÅR(3)        = 0;                                       00000770
         UPS.VP_ÅR(4)        = 0;                                       00000780
         UPS.VILKÅR_8_1      = ' ';                                     00000790
         UPS.VILKÅR_8_4      = ' ';                                     00000800
         UPS.UFG             = 0;                                       00000810
         UPS.UFT_MÅ          = 0;                                       00000820
         UPS.PI              = 0;                                       00000830
         UPS.YRKE            = 0;                                       00000840
         UPS.INNTEKT_FØR_UP  = 0;                                       00000850
         UPS.PRIMDIAG        = ' ';                                     00000860
         UPS.SEKUDIAG        = ' ';                                     00000870
         UPS.VIRK_DATO_MÅ    = 0;                                       00000880
         UPS.FNR_EK          = 0;                                       00000890
         UPS.FNR_GML_EK      = 0;                                       00000900
         UPS.NAVN_EK         = (25)' ';                                 00000910
         UPS.EK_INNT         = ' ';                                     00000920
   END BLANK_UP_SØKER;                                                  00000930
 %PAGE;                                /*   */                          00000940
 /* ***************************************************************** */00000950
 /*                                                                   */00000960
 /*    PROSEDYREN BLANKER UP_BARNEDELEN I UP_TRANS_OMR I              */00000970
 /*    KOM_OMR FOR UFØREPENSJONSSØKNADER.                             */00000980
 /*                                                                   */00000990
 /* ***************************************************************** */00001000
 %SKIP;                                                                 00001010
 BLANK_UP_BARN:                                                         00001020
   PROC;                                                                00001030
   DCL                                                                  00001040
      ANT_BARN FIXED BIN (15);                                          00001050
 %SKIP;                                                                 00001060
      DO ANT_BARN                   = 1 TO 12;                          00001070
         UPB.FNR_BARN(ANT_BARN)     = 0;                                00001080
         UPB.RBT_BARN(ANT_BARN)     = ' ';                              00001090
         UPB.FNR_GML_BARN(ANT_BARN) = 0;                                00001100
      END;                                                              00001110
   END BLANK_UP_BARN;                                                   00001120
 %PAGE;                                /*   */                          00001130
 /* ***************************************************************** */00001140
 /*                                                                   */00001150
 /*    PROSEDYREN BLANKER UP_SPES.DELEN I UP_TRANS_OMR I              */00001160
 /*    KOM_OMR FOR UFØREPENSJONSSØKNADER.                             */00001170
 /*                                                                   */00001180
 /* ***************************************************************** */00001190
 %SKIP(2);                                                              00001200
 BLANK_UP_SPES:                                                         00001210
   PROC;                                                                00001220
      UPSP.STATSBORGER    = 0;                                          00001230
      UPSP.BOSATT         = 0;                                          00001240
      UPSP.FRAVIK_BOSATT  = ' ';                                        00001250
      UPSP.TRYGDET_3ÅR    = 0 ;                                         00001260
      UPSP.FRA_TRY_3ÅR    = 0  ;                                        00001270
      UPSP.FRAVIK_8_1     = '  ';                                       00001280
      UPSP.KONVENSJON     = ' ';                                        00001290
      UPSP.FRAVIK_19_3    = ' ';                                        00001300
      UPSP.FRAVIK_FLYKT   = ' ';                                        00001310
      UPSP.OVERKOMP_UTL   = ' ';                                        00001320
      UPSP.UFØR_U_BOTID   = ' ';                                        00001330
      UPSP.TT_F67         = 0;                                          00001340
      UPSP.TT_E66_Å       = 0;                                          00001350
      UPSP.TT_E66_M       = 0;                                          00001360
      UPSP.TT_F67_EK      = 0;                                          00001370
      UPSP.TT_E66_Å_EK    = 0;                                          00001380
      UPSP.TT_E66_M_EK    = 0;                                          00001390
      UPSP.TT_FRAMT_8_1_Å = 0;                                          00001400
      UPSP.TT_ETTER_UFT   = 0;                                          00001410
      UPSP.IKKE_GP        = ' ';                                        00001420
   END BLANK_UP_SPES;                                                   00001430
 %PAGE;                                /* */                            00001440
 /* ***************************************************************** */00001450
 /*                                                                   */00001460
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I UP_TRANS_OMR I     */00001470
 /*    KOM_OMR.                                                       */00001480
 /*                                                                   */00001490
 /* ***************************************************************** */00001500
 %SKIP(2);                                                              00001510
 BLANK_UP_MELDNR:                                                       00001520
   PROC;                                                                00001530
   DCL                                                                  00001540
      ANT_BARN FIXED BIN (15);                                          00001550
   DCL                                                                  00001560
      ANT_VP_ÅR FIXED BIN (15);                                         00001570
 %SKIP(2);                                                              00001580
         UPS.ATT_UFNR               = 0;                                00001590
         UPS.REGDATONR              = 0;                                00001600
         UPS.TERMIDNR               = 0;                                00001610
         UPS.FNRNR                  = 0;                                00001620
         UPS.NAVNNR                 = 0;                                00001630
         UPS.TKNRNR                 = 0;                                00001640
         UPS.TILL_EKNR              = 0;                                00001650
         UPS.SIVILSTANDNR           = 0;                                00001660
         UPS.SPRÅKNR                = 0;                                00001670
         UPS.NORSK_BOSATTNR         = 0;                                00001680
         UPS.BT_ANTNR               = 0;                                00001690
         UPS.YSKADE_TILLEGGNR       = 0;                                00001700
         DO ANT_VP_ÅR               = 1 TO 4;                           00001710
            UPS.VP_ÅRNR(ANT_VP_ÅR) = 0;                                 00001720
         END;                                                           00001730
         UPS.VILKÅR_8_1NR           = 0;                                00001740
         UPS.VILKÅR_8_4NR           = 0;                                00001750
         UPS.UFGNR                  = 0;                                00001760
         UPS.UFT_MÅNR               = 0;                                00001770
         UPS.PINR                   = 0;                                00001780
         UPS.YRKENR                 = 0;                                00001790
         UPS.INNTEKT_FØR_UPNR       = 0;                                00001800
         UPS.PRIMDIAGNR             = 0;                                00001810
         UPS.SEKUDIAGNR             = 0;                                00001820
         UPS.VIRK_DATO_MÅNR         = 0;                                00001830
         UPS.FNR_EKNR               = 0;                                00001840
         UPS.NAVN_EKNR              = 0;                                00001850
         UPS.EK_INNTNR              = 0;                                00001860
 %SKIP(2);                             /*  */                           00001870
 /*  0 I MELDINGSNUMMERNE I  BARNEDELEN   */                            00001880
 %SKIP(2);                                                              00001890
      DO ANT_BARN                 = 1 TO 12;                            00001900
         UPB.FNR_BARNNR(ANT_BARN) = 0;                                  00001910
         UPB.RBT_BARNNR(ANT_BARN) = 0;                                  00001920
      END;                                                              00001930
 %SKIP(2);                             /*  */                           00001940
 /*   0 I MELDINGSNUMMERNE I SPESIELL DEL         */                    00001950
 %SKIP(2);                                                              00001960
      UPSP.STATSBORGERNR    = 0;                                        00001970
      UPSP.BOSATTNR         = 0;                                        00001980
      UPSP.FRAVIK_BOSATTNR  = 0;                                        00001990
      UPSP.TRYGDET_3ÅRNR    = 0;                                        00002000
      UPSP.FRA_TRY_3ÅRNR    = 0;                                        00002010
      UPSP.FRAVIK_8_1NR     = 0;                                        00002020
      UPSP.KONVENSJONNR     = 0;                                        00002030
      UPSP.FRAVIK_19_3NR    = 0;                                        00002040
      UPSP.FRAVIK_FLYKTNR   = 0;                                        00002050
      UPSP.OVERKOMP_UTLNR   = 0;                                        00002060
      UPSP.UFØR_U_BOTIDNR   = 0;                                        00002070
      UPSP.TT_F67NR         = 0;                                        00002080
      UPSP.TT_E66_ÅNR       = 0;                                        00002090
      UPSP.TT_E66_MNR       = 0;                                        00002100
      UPSP.TT_F67_EKNR      = 0;                                        00002110
      UPSP.TT_E66_Å_EKNR    = 0;                                        00002120
      UPSP.TT_E66_M_EKNR    = 0;                                        00002130
      UPSP.TT_FRAMT_8_1_ÅNR = 0;                                        00002140
      UPSP.TT_ETTER_UFTNR   = 0;                                        00002150
      UPSP.IKKE_GPNR        = 0;                                        00002160
   END BLANK_UP_MELDNR;                                                 00002170
                                                                        00002180
                                                                        00002190
        BLANK_YP:                                                       00002200
         PROC;                                                          00002210
                                                                        00002220
            UPY.VILKÅR_1_2_2A   = ' ';                                  00002230
            UPY.VILKÅR_1_2_2B   = ' ';                                  00002240
            UPY.YST_MÅ          = 0;                                    00002250
            UPY.YSYKDOM         = ' ';                                  00002260
            UPY.YUG             = 0;                                    00002270
            UPY.KAP_11_7_UTLØST = ' ';                                  00002280
            UPY.YRKE11          = ' ';                                  00002290
            UPY.AÅI             = 9999999;                              00002300
            UPY.FNR_EK          = 0;                                    00002310
            UPY.FNR_GML_EK      = 0;                                    00002320
            UPY.FNR_SAMBOER     = 0;                                    00002330
            UPY.FNR_GML_SAMBOER = 0;                                    00002340
            UPY.FNR_Y_BARN      = 0;                                    00002350
            UPY.FNR_GML_Y_BARN  = 0;                                    00002360
            UPY.PLEIEBARN       = ' ';                                  00002370
                                                                        00002380
        END BLANK_YP;                                                   00002390
                                                                        00002400
                                                                        00002410
        BLANK_YP_MELDNR:                                                00002420
         PROC;                                                          00002430
                                                                        00002440
            UPY.VILKÅR_1_2_2ANR   = 0;                                  00002450
            UPY.VILKÅR_1_2_2BNR   = 0;                                  00002460
            UPY.YST_MÅNR          = 0;                                  00002470
            UPY.YSYKDOMNR         = 0;                                  00002480
            UPY.YUGNR             = 0;                                  00002490
            UPY.KAP_11_7_UTLØSTNR = 0;                                  00002500
            UPY.YRKE11NR          = 0;                                  00002510
            UPY.AÅINR             = 0;                                  00002520
            UPY.FNR_EKNR          = 0;                                  00002530
            UPY.FNR_SAMBOERNR     = 0;                                  00002540
            UPY.FNR_Y_BARNNR      = 0;                                  00002550
            UPY.PLEIEBARNNR       = 0;                                  00002560
        END BLANK_YP_MELDNR;                                            00002570
