 /*       SIST ENDRET 15/09-95 09.16.58 AV   JDA0310                  */00000000
 /*       SIST ENDRET 05/08-93 10.18.53 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 06/05-93 13.59.37 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 07/08-90 14.11.30 AV   DYBVIK                   */00000030
 /*********************************************************************/00000040
 /*                                                                   */00000050
 /* IDENTIFIKASJON:                                                   */00000060
 /*    R001B03A   ET PROGR. :   P L I     D L I    H S S R            */00000070
 /*                             --------------------------            */00000080
 /*     GAMMELT NAVN R0019W30              ---------------            */00000090
 /*     DATO :  14.09.88                                              */00000100
 /*                                                                   */00000110
 /*     PROGRAMMERER: S. PATHAK                                       */00000120
 /*     ENDRET AV O.GØYTIL 13.04.93.                                  */00000130
 /*                                                                   */00000140
 /*                                                                   */00000150
 /*                                                                   */00000160
 /* HENSIKT:                                                          */00000170
 /*   PLUKKE ALLE FNR MED FØDSELSÅR < ÅR  & > ÅR   HVIS               */00000180
 /*     PENSJONSTYPE1    = ' '                                        */00000190
 /*    PROGRAMMET LAGER EN FILE.                                      */00000200
 /*                                                                   */00000210
 /*                                                                   */00000220
 /*   HSSR = B001E005                                                 */00000230
 /*********************************************************************/00000240
                                                                        00000250
 R001B03: PROC (RF1_PCB_PEKER) OPTIONS (MAIN);                          00000260
                                                                        00000270
                                                                        00000280
 DCL RF1_PCB_PEKER           POINTER;                                   00000290
                                                                        00000300
 DCL PARMFIL         FILE RECORD INPUT;                                 00000310
 DCL SYSPRINT                EXTERNAL    FILE                         ; 00000320
                                                                        00000330
 %PAGE;                                                                 00000340
 /*-------------------------------------------------------------------*/00000350
 /*                                                                   */00000360
 /*   RECORD-BESKRIVELSER AV FILENE OG AKTUELLE BASE-SEGMENTER        */00000370
 /*                                                                   */00000380
 /*-------------------------------------------------------------------*/00000390
                                                                        00000400
 /*-------------------------------------------------------------------*/00000410
 /* ROT , STATUS OG UFØREHIST                                         */00000420
 /*-------------------------------------------------------------------*/00000430
                                                                        00000440
    DCL 1 RF0PERSN  BASED  (IO_PEKER),                                  00000450
    %INCLUDE P0019927;      /*        ROT-SEGMENT                     */00000460
                                                                        00000470
    DCL 1 STATUS    BASED  (IO_PEKER),                                  00000480
    %INCLUDE P0019930;      /*        STATUS_SEGMENT                  */00000490
                                                                        00000500
                                                                        00000510
 %PAGE;                                                                 00000520
 /*-------------------------------------------------------------------*/00000530
 /* HSSR PARAMETERE                                                   */00000540
 /*-------------------------------------------------------------------*/00000550
                                                                        00000560
    DCL PLIHSSR              EXTERNAL  ENTRY;                           00000570
                                                                        00000580
    DCL                                                                 00000590
        GHN                  CHAR      ( 4)   INIT ('GHN '     )       ,00000600
        GU                   CHAR      ( 4)   INIT ('GU  '     )       ,00000610
        GET                  CHAR      ( 4)   INIT ('    '     )       ,00000620
        GNP                  CHAR      ( 4)   INIT ('GNP '     )       ,00000630
        REP                  CHAR      ( 4)   INIT ('REPL'     )       ,00000640
        TRE                  FIXED BIN (31)   INIT ( 3         )       ,00000650
        FIRE                 FIXED BIN (31)   INIT ( 4         )       ,00000660
        SSA_RF0PERSN_UQUAL   CHAR      ( 9)   INIT ('RF0PERSN ')       ;00000670
                                                                        00000680
                                                                        00000690
 /*-------------------------------------------------------------------*/00000700
 /*     SSA                                                           */00000710
 /*-------------------------------------------------------------------*/00000720
  DCL 1 SSA1_RF0PERSN          STATIC,                                  00000730
        2    HDEL                        CHAR (17)    INIT              00000740
                               ('RF0PERSN(FNR     '),                   00000750
        2    REL_OP                      CHAR (2)     INIT (' =')     , 00000760
        2    PKEY              FIXED     DEC  (11)    INIT ( 0  )     , 00000770
        2    HP                          CHAR (1)     INIT (')' )     ; 00000780
                                                                        00000790
                                                                        00000800
                                                                        00000810
 /*-------------------------------------------------------------------*/00000820
 /* PCB-OMRÅDER                                                       */00000830
 /*-------------------------------------------------------------------*/00000840
                                                                        00000850
                                                                        00000860
    DCL 1  RF1     BASED    (RF1_PCB_PEKER),                            00000870
    %INCLUDE P0012003;                                 /* PCB-OMRÅDE  */00000880
                                                                        00000890
                                                                        00000900
 /*-------------------------------------------------------------------*/00000910
 /*   HJELPE-VARIABLE                                                 */00000920
 /*-------------------------------------------------------------------*/00000930
                                                                        00000940
    DCL IO_PEKER             POINTER                                   ,00000950
        END_OF_BASE          BIT          ( 1) INIT ('0'B)             ,00000960
        TRUE                 BIT          ( 1) INIT ('1'B)             ,00000970
        FALS                 BIT          ( 1) INIT ('0'B)             ,00000980
        FNR_BRUT_KODE        BIT          ( 1) INIT ('1'B)             ,00000990
        STATUS_BRUT_KODE     BIT          ( 1) INIT ('1'B)             ,00001000
        TILKN_TELL           FIXED        ( 8) INIT ( 0  )             ,00001010
        LES_REC              PIC  '(9)9'       INIT ( 0  )             ,00001020
        DIS_REC              PIC  '(9)9'       INIT ( 0  )             ,00001030
        SKR_REC              PIC  '(9)9'       INIT ( 0  )             ,00001040
        ROOT_KODE            CHAR  (1)         INIT (' ')              ,00001050
        WFNR                 PIC '(11)9'                               ,00001060
        SEGM_NAVN            CHAR        (  8) INIT (''  )             ,00001070
        IO_AREA              CHAR        (187) INIT (''  )             ,00001080
        W_TYPE1              CHAR        (1) INIT (''  )               ,00001090
        IO_HELP              CHAR        (171) INIT (''  )             ;00001100
                                                                        00001110
                                                                        00001120
  DCL 01 SKRIV_CODE                 CHAR (1) INIT ('');                 00001130
                                                                        00001140
                                                                        00001150
                                                                        00001160
    DCL (VERIFY , SUBSTR , MIN , INDEX , ADDR , DATE , CHAR) BUILTIN ;  00001170
                                                                        00001180
    DCL  01 PARAM,                                                      00001190
           02  FRA_ÅR         PIC '(2)9',                               00001200
           02  FIL1           CHAR (1),                                 00001210
           02  TIL_ÅR         PIC '(2)9',                               00001220
           02  FIL2           CHAR (75);                                00001230
                                                                        00001240
    DCL  FNRUT        FILE RECORD OUTPUT;                               00001250
                                                                        00001260
    DCL  01 P_REC,                                                      00001270
            02  P_FNR             PIC '(11)9'  INIT (''),               00001280
            02  P_ST_KODE         CHAR (01)    INIT (' '),              00001290
            02  P_PENSJ1          CHAR (01)    INIT (' '),              00001300
            02  P_SPRÅK           CHAR (01)    INIT ('  '),             00001310
            02  P_FILLER          CHAR (01)    INIT ('  ');             00001320
                                                                        00001330
    DCL 01 W_FNR_ALF              CHAR (11)   INIT ('00000000000');     00001340
    DCL    W_FNR                  PIC '(11)9' INIT (0),                 00001350
           W_DD  DEF W_FNR POS(1) PIC '(02)9',                          00001360
           W_MM  DEF W_FNR POS(3) PIC '(02)9',                          00001370
           W_ÅÅ  DEF W_FNR POS(5) PIC '(02)9',                          00001380
           W_REST DEF W_FNR POS(7) PIC '(05)9';                         00001390
    DCL    X_FNR             PIC '(11)9'  INIT (0),                     00001400
           X_DATO  DEF X_FNR  POS(1)  PIC '(06)9',                      00001410
           X_REST  DEF X_FNR  POS(7)  PIC '(05)9';                      00001420
 /*-------------------------------------------------------------------*/00001430
 /*                                                                   */00001440
 /*      S T A R T   P R O G R A M   R0019X30                         */00001450
 /*                                                                   */00001460
 /*-------------------------------------------------------------------*/00001470
  ON ERROR BEGIN;                                                       00001480
     ON ERROR SYSTEM;                                                   00001490
       PUT SKIP LIST('FEIL I BEHANDLING,FNR :');                        00001500
       GO TO SLUTT;                                                     00001510
     END;                                                               00001520
                                                                        00001530
                                                                        00001540
    OPEN FILE (PARMFIL) INPUT;                                          00001550
    OPEN FILE (FNRUT) OUTPUT;                                           00001560
    READ FILE (PARMFIL) INTO (PARAM);                                   00001570
 /* FRA_ÅR = FRA_ÅR - 1;                                                00001580
    TIL_ÅR = TIL_ÅR + 1;      */                                        00001590
                                                                        00001600
                                                                        00001610
    IO_PEKER                =    ADDR (IO_AREA)                       ; 00001620
                                                                        00001630
    GET                     =    GU                                   ; 00001640
                                                                        00001650
    CALL P200_LES_DB                                        ;           00001660
                                                                        00001670
    GET                     =    GHN                                  ; 00001680
                                                                        00001690
 /* DO WHILE (SKR_REC < 100);    */                                     00001700
 /* DO WHILE (LES_REC < 10000);  */                                     00001710
                                                                        00001720
    DO WHILE (^END_OF_BASE);                                            00001730
                                                                        00001740
       SELECT  ( RF1.SEGM_NAVN);                                        00001750
                                                                        00001760
          WHEN ('RF0PERSN')                                             00001770
            DO;                                                         00001780
                                                                        00001790
               IF SKRIV_CODE   = 'J'  THEN                              00001800
                  DO;                                                   00001810
                     P_FNR  = W_FNR;                                    00001820
                     WRITE FILE(FNRUT) FROM (P_REC);                    00001830
                     P_REC = '';                                        00001840
                                                                        00001850
                     SKR_REC = SKR_REC + 1;                             00001860
                     SKRIV_CODE   = 'N';                                00001870
                  END;                                                  00001880
                                                                        00001890
               LES_REC = LES_REC + 1;                                   00001900
                                                                        00001910
           /*  IF LES_REC > DIS_REC   THEN                              00001920
                  DO;                                                   00001930
                  DIS_REC = DIS_REC + 500000;                           00001940
                  PUT SKIP (2) EDIT ('ANTALL REC LEST :', LES_REC   )   00001950
                                                          (X(10),A,A);  00001960
                  END;                                               */ 00001970
                                                                        00001980
               W_FNR     = RF0PERSN.FNR;                                00001990
               W_FNR_ALF = W_FNR;                                       00002000
               IF SUBSTR(W_FNR_ALF,5,2) > FRA_ÅR   &                    00002010
                  SUBSTR(W_FNR_ALF,5,2) < TIL_ÅR   THEN                 00002020
                  DO;                                                   00002030
                     SKRIV_CODE = 'J';                                  00002040
                     ROOT_KODE = 'J' ;                                  00002050
                     P_REC.P_SPRÅK  = RF0PERSN.SPRÅK;                   00002060
                                                                        00002070
                  END;                                                  00002080
               ELSE                                                     00002090
                   DO;                                                  00002100
                     ROOT_KODE = 'N' ;                                  00002110
                    SKRIV_CODE = 'N';                                   00002120
                   END;                                                 00002130
            END;                                                        00002140
                                                                        00002150
          WHEN ('STATUS  ')                                             00002160
            DO;                                                         00002170
                                                                        00002180
               IF STATUS.STATUS_KODE = 'S'  &                           00002190
                  ROOT_KODE = 'J'     THEN                              00002200
                  DO;                                                   00002210
                     SKRIV_CODE = 'J';                                  00002220
                                                                        00002230
                    IF STATUS.PENSJONSTYPE1    = 'A'  !                 00002240
                       STATUS.PENSJONSTYPE1    = 'K'  !                 00002250
                       STATUS.PENSJONSTYPE1    = 'D'   THEN             00002260
                       DO;                                              00002270
                         SKRIV_CODE = 'N';                              00002280
                       END;                                             00002290
                  ELSE                                                  00002300
                    IF STATUS.STATUS_KODE_HIST = ' '  &                 00002310
                     ( STATUS.PENSJONSTYPE1    = 'U'  !                 00002320
                       STATUS.PENSJONSTYPE1    = 'Y'  !                 00002330
                       STATUS.PENSJONSTYPE1    = 'E'  !                 00002340
                       STATUS.PENSJONSTYPE2    = 'E'  ) THEN            00002350
                       DO;                                              00002360
                         SKRIV_CODE = 'N';                              00002370
                       END;                                             00002380
                  END;                                                  00002390
            END;                                                        00002400
          OTHERWISE;                                                    00002410
       END;                           /* OF SELECT */                   00002420
                                                                        00002430
                                                                        00002440
          CALL P200_LES_DB;                                             00002450
                                                                        00002460
    END;                              /*  OF WHILE (^END_OF_BASE) */    00002470
                                                                        00002480
                                                                        00002490
                                                                        00002500
    SLUTT:                                                              00002510
            CLOSE  FILE (FNRUT) ;                                       00002520
            CLOSE  FILE (PARMFIL);                                      00002530
            PUT SKIP (2) EDIT ('END OF JOB: ')                          00002540
                                           (X(10),A,A);                 00002550
                                                                        00002560
    PUT PAGE     EDIT ('RESULTAT FRA PROGRAM R001B03A') (X(10),A);      00002570
    PUT SKIP     EDIT ('-----------------------------') (X(10),A);      00002580
                                                                        00002590
    PUT SKIP (2) EDIT ('ANTALL REC LEST            :', LES_REC   )      00002600
                    (X(10),A,A);                                        00002610
                                                                        00002620
    PUT SKIP (2) EDIT ('ANTALL REC SKRIV           :', SKR_REC   )      00002630
                    (X(10),A,A);                                        00002640
                                                                        00002650
                                                                        00002660
 /*-------------------------------------------------------------------*/00002670
 /*                                                                   */00002680
 /* MODUL FOR LESING AV DB.    (   GU / GN )                          */00002690
 /*                                                                   */00002700
 /*-------------------------------------------------------------------*/00002710
                                                                        00002720
    /*----------------------------------------------------------------*/00002730
    /* SJEKKER OM END-OF-FILE I DB                                    */00002740
    /*----------------------------------------------------------------*/00002750
                                                                        00002760
                                                                        00002770
 P200_LES_DB:                                                           00002780
    PROCEDURE;                                                          00002790
                                                                        00002800
    DCL    P800_IKKE_FR   CHAR(17),                                     00002810
           P900_FRRF      CHAR(40);                                     00002820
                                                                        00002830
    CALL PLIHSSR                                (TRE                 ,  00002840
                                                 GET                 ,  00002850
                                                 RF1                 ,  00002860
                                                 IO_AREA )           ;  00002870
                                                                        00002880
                                                                        00002890
    IF RF1.STATUS_KODE        ^=         '  '    THEN                   00002900
       DO;                                                              00002910
          IF RF1.STATUS_KODE  ^=         'GB'    THEN                   00002920
             DO;                                                        00002930
                 PUT EDIT ('FEIL VED LES I P200_LES_DB:    '     ,      00002940
                       'DL1-STATUS-KODE : ', RF1.STATUS_KODE )          00002950
                      (SKIP,A,X(5),A,A                       );         00002960
             END;                                                       00002970
          ELSE                                                          00002980
             DO;                                                        00002990
                END_OF_BASE = '1'B;                                     00003000
             END;                                                       00003010
       END;                                                             00003020
    ELSE                                                                00003030
       DO;                                                              00003040
           SEGM_NAVN          =                 RF1.SEGM_NAVN       ;   00003050
       END;                                                             00003060
    END P200_LES_DB;                                                    00003070
                                                                        00003080
                                                                        00003090
    END R001B03;                                                        00003100
