 /*       SIST ENDRET 25/05-98 09.08.38 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/05-98 09.02.54 AV   JDA7339                  */00000010
 /*       SIST ENDRET 28/04-98 14.47.18 AV   JDA7339                  */00000020
 /*       SIST ENDRET 28/04-98 14.45.36 AV   JDA7339                  */00000030
 /*       SIST ENDRET 16/09-97 10.24.44 AV   JDA7339                  */00000040
 /*       SIST ENDRET 15/09-97 13.31.31 AV   JDA7339                  */00000050
 /*       SIST ENDRET 29/08-97 12.28.37 AV   JDA7339                  */00000060
 /*       SIST ENDRET 28/08-97 08.53.06 AV   SPA7339                  */00000070
 /*       SIST ENDRET 24/08-92 12.27.40 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 17/02-92 13.45.35 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 13/12-91 12.25.06 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 01/12-89 08.40.22 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 19/04-83 14.44.54 AV   OLAV                     */00000120
 /*       SIST ENDRET 19/04-83 14.11.36 AV   OLAV                     */00000130
 /* ***************************************************************** */00000140
 /*IDENTIFIKASJON:                                                    */00000150
 /*    R0014323 - PROSEDYRE I PLI                                     */00000160
 /*    PROGRAMMERER: JAN, JUNI-82.                                    */00000170
 /*HENSIKT:                                                           */00000180
 /*    BEREGNE TILLEGGSPENSJON ETTERLATT                              */00000190
 /*PROGRAMTILKNYTNING:                                                */00000200
 /*    INCLUDES I R0014301                                            */00000210
 /*BRUK:                                                              */00000220
 /*    CALL BEREGN_TP_ETTERLATT;                                      */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
 /*   */                                                                00000260
 BEREGN_TP_ETTERLATT:                                                   00000270
   PROC;                                                                00000280
                                                                        00000290
 /* ***************************************************************** */00000300
 /* KALL UNDERPROGRAM SOM BEREGNER POENGREKKEN.                       */00000310
 /* ***************************************************************** */00000320
                                                                        00000330
    DCL W_GARANTI_TP      FIXED DEC (11,4) INIT (0);  /*TS*/            00000340
    DCL W_GAR_TP        FIXED DEC (5)    INIT (0);  /*TS*/              00000350
    DCL FIXED_DEC5      FIXED DEC (5)    INIT (0);  /*HL*/              00000360
    DCL DØDSDATO_ÅM      PIC '9999'      INIT (0);  /*HL*/              00000370
    DCL ALDER_VED_DØD    PIC 'S99999'    INIT (0);  /*HL*/              00000380
    DCL RETUR_POENG     FIXED DEC (3,2)  INIT (0);  /*HL*/              00000390
    DCL VIRK_ÅM          PIC '9999'    INIT (0);  /*HL*/                00000400
                                                                        00000410
    DCL SISTE_UFØRHIST_EK   FIXED DEC (5)  INIT (0); /*TS 240498*/      00000420
                                                                  /*93*/00000430
                                                                        00000440
    B01_B02_IND              = 2;                                       00000450
    POTALL_OPPL.IND          = BER_EK_IND;                              00000460
    EXEC CICS LINK PROGRAM ('R0014141') COMMAREA(KOM_OMR);              00000470
                                                                        00000480
    /* FINNE SISTE UFØRHIST  FOR EKTEFELLE. TRUDE  240498*/             00000490
                                                                        00000500
    DO K = 7 TO 1 BY - 1 UNTIL(B02.UFØRHIST.UFT_ÅM(BER_EK_IND,K) > 0);  00000510
       SISTE_UFØRHIST_EK  = K;                                          00000520
    END;     /*240498*/                                                 00000530
                                                                        00000540
    IF FEIL_MELD_NR > 0  THEN                                           00000550
       GO TO RETUR;                                                     00000560
    ELSE                                                                00000570
       PROGRAM_ID = 'R0014301';                                         00000580
                                                                        00000590
 /* 42 % TP FOR ÅR ETTER 1991 : */                                      00000600
                                                                        00000610
    IF ^(DØDSTP.ÅR > 91       &                                         00000620
         W_FNR_EK_ÅR  > 25       &                                      00000630
         W_FNR_EK_ÅRHUNDRE < 5 )   THEN                                 00000640
            POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                         00000650
                                                                        00000660
    /* DETTE VAR GLEMT :  */                                            00000670
                                                                        00000680
      IF (B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) < 7300 ) &  00000690
         (B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK) > 0    ) &  00000700
         ( B02.OPPHØRSKODE(BER_EK_IND,SISTE_UFØRHIST_EK) ^= 'J'    ) &  00000710
         ( B02.PENSJONSTYPE1(BER_EK_IND)                 = 'D')  THEN   00000720
                 POREKKE.PÅ_ETTER91(BER_EK_IND) = 0;                    00000730
                                                                        00000740
    /* HIT TRUDE 240498 */                                              00000750
                                                                        00000760
   /*    B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) =      */                  00000770
         B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) =                          00000780
                  POREKKE.PÅ_ETTER91(BER_EK_IND);                       00000790
                                                                        00000800
    /* DETTE VAR GLEMT :  */                                            00000810
                                                                        00000820
         IF W_FNR_EK_ÅR > 24         &                                  00000830
            ((B02.KONV_P_KODE(BER_EK_IND) = 'K' &                       00000840
             B02.UTTAKSDATO_ÅM(BER_EK_IND) < 9200)  !                   00000850
                                                                        00000860
             ((B02.KONV_P_KODE(BER_EK_IND) = 'U' !                      00000870
               B02.KONV_P_KODE(BER_EK_IND) = 'Y'  )  &                  00000880
               B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK)        00000890
                                               < 9200 )    !            00000900
             ( B02.UFØRHIST.UFT_ÅM(BER_EK_IND,SISTE_UFØRHIST_EK)        00000910
                                               < 9200    &              00000920
               B02.OPPHØRSKODE(BER_EK_IND,SISTE_UFØRHIST_EK)            00000930
                                               = 'A')) THEN             00000940
            DO;                                                         00000950
               FRADRAG = W_FNR_EK_ÅR - 25;                              00000960
               IF FRADRAG > POREKKE.PÅ_ETTER91(BER_EK_IND)    THEN      00000970
    /*            B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) = 0;    */        00000980
                  B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) = 0;              00000990
               ELSE                                                     00001000
                DO;                                                     00001010
    /*            B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND) =       */        00001020
                  B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) =                 00001030
                  POREKKE.PÅ_ETTER91(BER_EK_IND) - FRADRAG;             00001040
                  POREKKE.PÅ_ETTER91(BER_EK_IND) =                      00001050
        /*        B02.ETTEPENS.PÅ_ETTER91(BER_EK_IND);  */              00001060
                  B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND);                  00001070
                END;                                                    00001080
            END;                                                        00001090
                                                                        00001100
   /*HIT TRUDE 240498 */                                                00001110
                                                                        00001120
    B02.SPT_AVD  (BER_SØ_IND)     = POREKKE.SPT(BER_EK_IND);            00001130
    B02.OPT_AVD  (BER_SØ_IND)     = POREKKE.OPT(BER_EK_IND);            00001140
    B02.PÅ_AVD   (BER_SØ_IND)     = POREKKE.PÅ (BER_EK_IND);            00001150
    IF B02.SIVILSTAND(BER_SØ_IND) = 'E'   !                             00001160
       B02.SIVILSTAND(BER_SØ_IND) = 'U' THEN                            00001170
       W_TP_PROSENT = 55;                                               00001180
    ELSE                                                                00001190
       W_TP_PROSENT = B02.TP_PROSENT(BER_SØ_IND);                       00001200
    B02.TP_BRUTTO(BER_SØ_IND) = F_TP92(W_FNR_EK_ÅR,G,                   00001210
                                               POREKKE.SPT(BER_EK_IND), 00001220
                                               POREKKE.OPT(BER_EK_IND), 00001230
                                               POREKKE.PÅ (BER_EK_IND), 00001240
                                       POREKKE.PÅ_ETTER91(BER_EK_IND),  00001250
                                               100,W_TP_PROSENT,'J');   00001260
                                                                        00001270
  DØDSDATO_ÅM = B02.DØDSDATO_ÅMD(BER_EK_IND) / 100;                     00001280
  FIXED_DEC5  = F_ALDER(W_FNR_EK,F_SNU_DATO(DØDSDATO_ÅM));              00001290
  ALDER_VED_DØD = FIXED_DEC5;                                           00001300
  VIRK_ÅM = B02.VIRK_DATO_ÅM(SØKER_IND);                                00001310
                                                                        00001320
  IF B02.BUP_GAR_KODE(BER_EK_IND,1) = 'E'        THEN                   00001330
     CALL SPT_GARANTI_E(W_FNR_EK_ÅR,             /*4199*/               00001340
            VIRK_ÅM,RETUR_POENG);                                       00001350
  ELSE                                                                  00001360
  IF B02.TP_GAR_KODE(BER_EK_IND)  = 'E'        THEN                     00001370
                                                                        00001380
 /*4152 HAR ALLEREDE SATT TP_GAR_KODE= E FOR PERSONER SOM DØDE*/        00001390
 /* I UNG ALDER (OG SOM DERMED KAN FÅ GARANTI PÅ SPT          */        00001400
                                                                        00001410
     CALL UNGE_DØDE_E(B02.VIRK_DATO_ÅM(SØKER_IND),W_FNR_EK_ÅR,          00001420
                      ALDER_VED_DØD,RETUR_POENG);      /*4327*/         00001430
  IF RETUR_POENG > 0                        THEN                        00001440
                                                                        00001450
     DO;                                                                00001460
 /*   W_GARANTI_TP      =  G * 0.45 * B02.BUP_GARANTI(BER_EK_IND,1);*/  00001470
      W_GARANTI_TP      =  G * 0.45 * RETUR_POENG;                      00001480
      IF FULL_TT = 'N'       THEN                                       00001490
         W_GARANTI_TP   =  W_GARANTI_TP * B02.TT_ANV(BER_EK_IND) / 40;  00001500
      W_GARANTI_TP      =  W_GARANTI_TP * W_TP_PROSENT;                 00001510
      W_GARANTI_TP      =  W_GARANTI_TP / 100;                          00001520
      W_GARANTI_TP      =  W_GARANTI_TP / 12 ;                          00001530
      W_GAR_TP          = W_GARANTI_TP + 0.5;                           00001540
                                                                        00001550
      IF W_GAR_TP  >  B02.TP_BRUTTO(BER_SØ_IND) THEN                    00001560
         DO;                                                            00001570
            B02.TP_BRUTTO(BER_SØ_IND)  = W_GAR_TP;                      00001580
            B02.TP_GAR_KODE(BER_SØ_IND) = 'E';                          00001590
         END;                                                           00001600
      ELSE                                                              00001610
           B02.TP_GAR_KODE(BER_SØ_IND)  = ' ';                          00001620
    END;                                                                00001630
                                                                        00001640
    /*TIL HIT TRUDE */                                                  00001650
    RETUR:                                                              00001660
 END BEREGN_TP_ETTERLATT;                                               00001670
