 /*       SIST ENDRET 29/08-97 12.30.09 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 08.53.59 AV   SPA7339                  */00000010
 /*       SIST ENDRET 28/07-97 12.33.13 AV   HLA7339                  */00000020
 /*       SIST ENDRET 25/09-92 12.21.58 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/08-92 10.37.00 AV   TRUDE                    */00000040
 /*       SIST ENDRET 20/08-92 14.48.46 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 16/10-89 15.40.00 AV   HERMAN                   */00000060
 /*       SIST ENDRET 16/10-89 13.06.30 AV   DYBVIK                   */00000070
 /*IDENTIFIKASJON:                                                   */ 00000080
 /*    R0011840 - PROSEDYRE I PLI        HOVEDPROGRAM                */ 00000090
 /*    PROGRAMMERER: TRUDE SPONBERG JUNI 1989                        */ 00000100
 /*HENSIKT:                                                          */ 00000110
 /*    KONTROLLERE UFTRANS MOT STATUS FAMILIEFORHOLD.                */ 00000120
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000130
 /*    INFORMASJON I REGISTERET. FOR HVER FAMILIEPERSON SOM GÅR      */ 00000140
 /*    FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET NY STATUS      */ 00000150
 /*    FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.                  */ 00000160
 /* ***************************************************************  */ 00000170
 /* ***************************************************************  */ 00000180
 /*PROGRAMTILKNYTNING:                                               */ 00000190
 /*    KALLES OPP AV PROGRAM R0013520                                */ 00000200
 /*BRUK:                                                             */ 00000210
 /*    EXEC CICS XCTL PROGRAM ('R0011840') COMMAREA (KOM_OMR)        */ 00000220
 /*                                                                  */ 00000230
 /* **************************************************************** */ 00000240
                                                                        00000250
 %PAGE;                                                                 00000260
 UFTR:                                                                  00000270
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000280
                                                                        00000290
 %PAGE;                                                                 00000300
      %INCLUDE P0011831;                                                00000310
      %INCLUDE P0019906;                                                00000320
      %INCLUDE P0019908;                                                00000330
      %INCLUDE P0019910;                                                00000340
      %INCLUDE P0019912;                                                00000350
      %INCLUDE P0019913;                                                00000360
                                                                        00000370
   DCL (COMMAREA_PEKER,LOKAL_KOM_PTR) PTR;                              00000380
                                                                        00000390
 %PAGE;                                                                 00000400
   DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                       00000410
                                                                        00000420
 %PAGE;                                                                 00000430
   DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                       00000440
                                                                        00000450
 %PAGE;                                                                 00000460
   DCL 1 B00 BASED(B00_PEKER), %INCLUDE P0019921;/*HL 21.9.84*/         00000470
                                                                        00000480
   DCL                                                                  00000490
      I              FIXED BIN(15),                                     00000500
      J              FIXED BIN(15);                                     00000510
                                                                        00000520
 /* ***************************************************************** */00000530
 /* HJELPE DCL FOR Å SNU DATO                                         */00000540
 /* ***************************************************************** */00000550
   DCL                                                                  00000560
      FNR                      PIC '(11)9',                             00000570
      FNR_R_MÅ POS (3) DEF FNR PIC '9999',                              00000580
      FNR_R_Å  POS (5) DEF FNR PIC '99',                                00000590
      FNR_R_ÅRHUNDRE                                                    00000600
               POS (7) DEF FNR PIC '9',                                 00000610
      SISTE_PERIODE            PIC '99',                                00000620
      SISTE_UTFYLTE            PIC '99';                                00000630
   DCL                                                                  00000640
      1 STATUS_TYPE_SØKER  CHAR(1);                                     00000650
   DCL                                                                  00000660
      1 UFØRETIDSPUNKT     PIC '9999';                                  00000670
   DCL                                                                  00000680
      1 ALDER_UFT          FIXED DEC(5);                                00000690
   DCL                                                                  00000700
      1 HJ_VIRK_DATO_ÅM    PIC '9999';                                  00000710
   DCL                                                                  00000720
      CSTG BUILTIN;                                                     00000730
   DCL ALDER_UF           FIXED DEC (5) INIT (0); /*TS 200892*/         00000740
 %PAGE;                                                                 00000750
                                                                        00000760
 /* ***************************************************************** */00000770
 /* PROGRAMMET STARTER HER                                            */00000780
 /* ***************************************************************** */00000790
                                                                        00000800
    ALLOCATE LOKAL_KOM_OMR;                                             00000810
                                                                        00000820
    /*KOM_OMR.TRANS_OPPL_PEKER = TRANS_LISTE.TRANS_OPPL_PTR(1) */       00000830
                                                                        00000840
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                               00000850
    PROGRAM_ID          = 'R0011840';                                   00000860
    FNR                 = UFS.FNR;                                      00000870
    UFØRETIDSPUNKT      = UFS.UFT_MÅ;                                   00000880
    ALDER_UF      =  F_ALDER(UFS.FNR,UFS.UFT_MÅ);  /*TS 200892*/        00000890
                                                                        00000900
    /* RETTET HJ_VIRK_DATO_ÅM   */                                      00000910
                                                                        00000920
    IF ALDER_UF   > 2400  THEN           /*9708 HL*/                    00000930
      DO;                                                               00000940
       TRANS_OPPL_OMR.VIRKNINGSDATO     = 0797;                         00000950
       DIV_PARAM_OMR.U_TEXT_KODE         = 'G'; /*UFMELLOM  24 OG 26*/  00000960
      END;                                                              00000970
    ELSE                                                                00000980
    IF ALDER_UF   > 2200  THEN                                          00000990
      DO;                                                               00001000
       TRANS_OPPL_OMR.VIRKNINGSDATO     = 0592;                         00001010
       DIV_PARAM_OMR.U_TEXT_KODE         = 'E'; /*UFMELLOM  22 OG 24*/  00001020
      END;                                                              00001030
    ELSE                                                                00001040
      DO;                                                               00001050
       TRANS_OPPL_OMR.VIRKNINGSDATO     = 0789;                         00001060
       DIV_PARAM_OMR.U_TEXT_KODE         = 'F'; /*UF FØR 22 ÅR*/        00001070
      END;                                                              00001080
                                                                        00001090
    IF B01.FNR(SØKER_IND) = 0 THEN                                      00001100
       DO;                                                              00001110
 L100:                                                                  00001120
          FEIL_VED_LABEL  = '100';                                      00001130
          FEIL_MELD_NR    = 1538;                                       00001140
          GO TO L999;                                                   00001150
       END;                                                             00001160
                                                                        00001170
    IF STATUS_TYPE  = 'A' !      /* STATUS_TYPE A,I OG K FORTELLER  */  00001180
       STATUS_TYPE  = 'I' !      /* AT PERSONEN IKKE HAR EN AKTUELL */  00001190
       STATUS_TYPE  = 'K' THEN   /*PENSJONSSTATUS PÅ DETTE TIDSPUNKT*/  00001200
       DO;                                                              00001210
 L115:    FEIL_VED_LABEL   = '115';                                     00001220
          FEIL_MELD_NR     = 1538;                                      00001230
          GO TO L999;                                                   00001240
       END;                                                             00001250
                                                                        00001260
                                                                        00001270
    CALL  FLYTT_B01_TIL_B02(SØKER_IND);       /* R0019926  */           00001280
    IF B01.FNR(EKTEF_IND) ^= 0 THEN                                     00001290
       DO;                                                              00001300
          CALL  FLYTT_B01_TIL_B02(EKTEF_IND);       /* R0019926  */     00001310
       END;                                                             00001320
                                                                        00001330
    B02.FØRSTE_GANG_REG(SØKER_IND)     = 'N';                           00001340
                                                                        00001350
    DO I = 1 TO 13;                                                     00001360
       IF B02.FNR(I) > 0 THEN                                           00001370
          B02.FØRSTE_GANG_REG(I)  = 'N';                                00001380
    END;                                                                00001390
                                                                        00001400
                                                                        00001410
 L120:                                                                  00001420
                                                                        00001430
  /* INNTIL VIDERE FJERNET HL 9708 : *************************          00001440
        IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,1) = 6612  THEN                00001450
           DO;                                                          00001460
  *************************************************************** */    00001470
              B02.PENSJONSTYPE1(SØKER_IND)        =  B01.PENSJONSTYPE1  00001480
                                                     (SØKER_IND);       00001490
              B02.PENSJONSTYPE1(EKTEF_IND)        =  B01.PENSJONSTYPE1  00001500
                                                     (EKTEF_IND);       00001510
              B02.PENSJONSTYPE2(SØKER_IND)        =  B01.PENSJONSTYPE2  00001520
                                                     (SØKER_IND);       00001530
              B02.PENSJONSTYPE2(EKTEF_IND)        =  B01.PENSJONSTYPE2  00001540
                                                     (EKTEF_IND);       00001550
              B02.SIVILSTAND(SØKER_IND)           =  B01.SIVILSTAND     00001560
                                                     (SØKER_IND);       00001570
              B02.NAVN(SØKER_IND)                 =  B01.NAVN           00001580
                                                     (SØKER_IND);       00001590
              B02.UFØRPENS.UFG(SØKER_IND)         =  B01.UFØRPENS.UFG   00001600
                                                     (SØKER_IND);       00001610
              B02.STATUS.TT_FØR_1967(SØKER_IND)   =                     00001620
                                  B01.STATUS.TT_FØR_1967(SØKER_IND);    00001630
                                                                        00001640
              B02.TT_ETTER_1966(SØKER_IND)        =  B01.TT_ETTER_1966  00001650
                                                     (SØKER_IND);       00001660
              B02.STATUS.TT_FRAMT(SØKER_IND)      =  B01.STATUS.TT_FRAMT00001670
                                                     (SØKER_IND);       00001680
                               /*NB TEST PÅ UF_ALDER TS 200892*/        00001690
              IF ALDER_UF       > 2400    &      /*HL 9708*/            00001700
                 ALDER_UF       < 2601    THEN                          00001710
                DO;                                                     00001720
                  B02.STATUS.VIRK_DATO_ÅM(SØKER_IND)  = 9707;           00001730
                  B02.BUP_GAR_KODE(SØKER_IND,1)       = 'E';            00001740
 /* 9708          B02.BUP_GARANTI(SØKER_IND,1)        = 3.3; */         00001750
               END;                                                     00001760
              ELSE                                                      00001770
              IF ALDER_UF       > 2200    &      /*TS 010992*/          00001780
                 ALDER_UF       < 2401    THEN                          00001790
                DO;                                                     00001800
                  B02.STATUS.VIRK_DATO_ÅM(SØKER_IND)  = 9205;           00001810
                  B02.BUP_GAR_KODE(SØKER_IND,1)       = 'E';            00001820
 /* 9708          B02.BUP_GARANTI(SØKER_IND,1)        = 3.0; */         00001830
               END;                                                     00001840
              ELSE                                                      00001850
                DO;                                                     00001860
                  B02.STATUS.VIRK_DATO_ÅM(SØKER_IND)  = 8907;           00001870
                  B02.BUP_GAR_KODE(SØKER_IND,1)       = 'E';            00001880
 /* 9708          B02.BUP_GARANTI(SØKER_IND,1)        = 1.6; */         00001890
               END;                                                     00001900
  /* 9708  END; ***********                                             00001910
        ELSE                                                            00001920
           DO;                                                          00001930
              FEIL_VED_LABEL   = '120';                                 00001940
              FEIL_MELD_NR     = 1539;                                  00001950
              GO TO L999;                                               00001960
           END;                                                         00001970
  ******************************************************** */           00001980
    IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,2)  > 0  THEN                      00001990
       DO;                                                              00002000
          DO I =  2 TO 7 ;             /*0697 HL*/                      00002010
            IF B01.UFØRHIST.UFT_ÅM(SØKER_IND,I) > 0 THEN                00002020
              DO;                                                       00002030
                B02.BUP_GAR_KODE(SØKER_IND,I)     = 'E';   /* B01 ?? */ 00002040
 /* 9708        B02.BUP_GARANTI(SØKER_IND,I)      = 1.6;    */          00002050
              END;                                                      00002060
            ELSE                                                        00002070
                I = 7;                 /*0697 HL*/                      00002080
          END;                                                          00002090
       END;                                                             00002100
                                                                        00002110
    TRANSTYPE           = 7;   /* UFØREPENSJON-UFØR FØR 1967  */        00002120
    I                   = 0;                                            00002130
    IND                 = 0;                                            00002140
                                                                        00002150
                                                                        00002160
                                                                        00002170
  CALL P900_NOR_DATA (B02.FNR(SØKER_IND) , B02.TKNR(SØKER_IND) );       00002180
                                                                        00002190
 /*IF  FEIL_MELD_NR                 =  0                     THEN  */   00002200
 /*    PROGRAM_ID                   = 'R0011840'                ;  */   00002210
                                                                        00002220
  L999:                                                                 00002230
     EXEC CICS RETURN;                                                  00002240
                                                                        00002250
                                                                        00002260
                                                                        00002270
 %PAGE;                                                                 00002280
        %INCLUDE R0019905;  /* REGN ALDER PR VIRKDATO    */             00002290
        %INCLUDE R0019913;  /* SNU DATO                  */             00002300
        %INCLUDE R0019926;  /* FLYTT B01 TIL B02         */             00002310
        %INCLUDE R0019957;  /* P900_NOR_DATA (FNR,TKNR)  */             00002320
                                                                        00002330
                                                                        00002340
   END UFTR;                                                            00002350
