 /*       SIST ENDRET 12/06-98 13.34.18 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 12.52.29 AV   SPA7339                  */00000010
 /*       SIST ENDRET 20/09-94 09.42.10 AV   HERMAN                   */00000020
 /*       SIST ENDRET 09/01-92 14.58.00 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 05/07-90 09.23.31 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 13/04-83 09.55.01 AV   OLAV                     */00000050
 /*       SIST ENDRET 01/03-83 13.52.55 AV   OLAV                     */00000060
 /*       SIST ENDRET 27/10-82 11.43.42 AV   FARVIK                   */00000070
 /*       SIST ENDRET 01/10-82 13.36.41 AV   FARVIK                   */00000080
 /* ***************************************************************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /*    R0014142 - F_TILLEGGSPENSJON - INTERN FUNKSJON I PLI           */00000110
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982                           */00000120
 /*    ENDRET JULI 82 AV KARIN                                        */00000130
 /*HENSIKT:                                                           */00000140
 /*    FUNKSJONEN REGNER UT TILLEGGSPENSJON SOM BLIR RETURNERT.       */00000150
 /*    DETTE GJØRES PÅ GRUNNLAG AV MOTTATT FØDSELSÅR (2 SIFF),        */00000160
 /*    SLUTTPOENGTALL,OVERKOMP.SLUTTPOENGTALL , ANTALL POENGÅR OG     */00000170
 /*    PENSJONSGRAD.                                                  */00000180
 /*PROGRAMTILKNYTNING:                                                */00000190
 /*    FUNKSJONEN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.              */00000200
 /*BRUK:                                                              */00000210
 /*    TP=F_TILLEGGSPENSJON(FÅ,SPT,OPT,PÅ,UFG,TP_PROSENT,FORHØY_IND); */00000220
 /* ***************************************************************** */00000230
 F_TILLEGGSPENSJON:                                                     00000240
  PROC(FÅ,G,SPT,OPT,PÅ,UFG,TP_PROSENT,FORHØY_IND) RETURNS(DEC FIXED(5));00000250
  DCL                                                                   00000260
     FÅ                 PIC '99',                                       00000270
     G                  FIXED DEC(5),                                   00000280
     SPT                FIXED DEC(3,2),                                 00000290
     OPT                FIXED DEC(3,2),                                 00000300
     PÅ                 FIXED DEC(3),                                   00000310
     UFG                FIXED DEC(5,2),                                 00000320
     TP_PROSENT         FIXED DEC(3),                                   00000330
     OÅ                 FIXED DEC(3),                                   00000340
     FORHØY_IND         CHAR(1),                                        00000350
     TP_WORK            FIXED DEC(11,4),                                00000360
     TP_WORK_2          FIXED DEC(11,4),                                00000370
     TP                 FIXED DEC(5);                                   00000380
                                                                        00000390
   DCL PGNAVN         CHAR (8);                                         00000400
   PGNAVN = 'R0014142';                                                 00000410
                                                                        00000420
  IF ( PÅ < 3               &                  /* PENSJON UTLAND  */    00000430
       B02.KONVENSJON(BER_SØ_IND)  = 'J') !       /* PENSJON UTLAND  */ 00000440
     ( PÅ > 2               !                                           00000450
     (FÅ = 99 & PÅ = 2)   !                                             00000460
     (FÅ = 98 & PÅ = 1))        THEN                                    00000470
     DO;                                                                00000480
        IF FÅ > 36 & FÅ < 98        THEN                                00000490
           DO;                                                          00000500
            /* TP_WORK = G * 0.45 * SPT * (PÅ / 40) * (UFG / 100)       00000510
                           * (TP_PROSENT / 100) / 12              */    00000520
              TP_WORK = G * 45 /100;                                    00000530
              TP_WORK = TP_WORK * SPT;                                  00000540
              TP_WORK = TP_WORK * PÅ / 40;                              00000550
              TP_WORK = TP_WORK * UFG /100;                             00000560
              TP_WORK = TP_WORK * TP_PROSENT / 100;                     00000570
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00000580
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00000590
              TP_WORK = TP_WORK / 12;                                   00000600
           END;                                                         00000610
        ELSE                                                            00000620
           DO;                                                          00000630
              IF FÅ > 17 & FÅ < 98     THEN                             00000640
                 OÅ = 20 + FÅ - 17;                                     00000650
              ELSE                                                      00000660
                 OÅ = 20;                                               00000670
              IF SPT > OPT THEN                                         00000680
                 DO;                                                    00000690
                /* TP_WORK = ((G * 0.45 * OPT * (PÅ / OÅ)) +            00000700
                              (G * 0.45 * (SPT - OPT) * (PÅ / 40))) *   00000710
                               (UFG / 100) *                            00000720
                               (TP_PROSENT / 100) / 12                */00000730
                    TP_WORK = G * 45 /100;                              00000740
                    TP_WORK = TP_WORK * OPT;                            00000750
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00000760
                    TP_WORK_2 = G * 45 / 100;                           00000770
                    TP_WORK_2 = TP_WORK_2 * (SPT - OPT);                00000780
                    TP_WORK_2 = TP_WORK_2 * PÅ / 40;                    00000790
                    TP_WORK = (TP_WORK + TP_WORK_2) * UFG /100;         00000800
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000810
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00000820
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00000830
                    TP_WORK = TP_WORK / 12;                             00000840
                 END;                                                   00000850
              ELSE                                                      00000860
                 DO;                                                    00000870
                 /* TP_WORK = G * 0.45 * SPT * (PÅ / OÅ) * (UFG / 100)  00000880
                               * (TP_PROSENT / 100) / 12              */00000890
                    TP_WORK = G * 45 / 100;                             00000900
                    TP_WORK = TP_WORK * SPT;                            00000910
                    TP_WORK = TP_WORK * PÅ / OÅ;                        00000920
                    TP_WORK = TP_WORK * UFG /100;                       00000930
                    TP_WORK = TP_WORK * TP_PROSENT / 100;               00000940
              IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN               00000950
 /*9804*/        DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = TP_WORK + 0.5;     00000960
                    TP_WORK = TP_WORK / 12;                             00000970
                 END;                                                   00000980
           END;                                                         00000990
        IF FORHØY_IND ^= 'N' THEN                                       00001000
           TP_WORK = TP_WORK + 0.5;                                     00001010
     END;                                                               00001020
  ELSE                                                                  00001030
     TP_WORK = 0;                                                       00001040
  TP = TP_WORK;                                                         00001050
                                                                        00001060
   /* TEST IKKE GI KONV 'F' TILLEGGSPENSJON, TRUDE 060192  */           00001070
   DCL TRYGDETID FIXED DEC (3);                                         00001080
 /*                                                                     00001090
   TRYGDETID = ((B02.TT_16_66(BER_SØ_IND)      +                        00001100
               B02.TT_ETTER_1966(BER_SØ_IND)   + 11) / 12) +            00001110
               B02.TT_FØR_1967(BER_SØ_IND);                             00001120
    */                                                                  00001130
   IF B02.BOSATT(BER_SØ_IND)  = 000  &                                  00001140
      B02.TT_16_66(BER_SØ_IND) = 0     &                                00001150
      B02.TT_ETTER_1966(BER_SØ_IND) = 0 &                               00001160
      B02.TT_FØR_1967(BER_SØ_IND)   = 0 &                               00001170
      B02.ALDERSP.KONV_P_KODE(BER_SØ_IND)  = 'F'     &                  00001180
      B02.ALDERSP.KONV_GRAD(BER_SØ_IND)  = 0     THEN                   00001190
        TP  = 0 ;                                                       00001200
        /* TRUDE 060192 HIT */                                          00001210
                                                                        00001220
  RETURN(TP);                                                           00001230
                                                                        00001240
 END F_TILLEGGSPENSJON;                                                 00001250
