 /*       SIST ENDRET 19/06-98 08.05.54 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/06-98 07.56.33 AV   JDA7339                  */00000010
 /*       SIST ENDRET 08/05-98 12.39.24 AV   JDA7339                  */00000020
 /*       SIST ENDRET 05/05-98 13.02.34 AV   JDA7339                  */00000030
 /*       SIST ENDRET 17/03-98 08.28.09 AV   JDA7339                  */00000040
 /*       SIST ENDRET 17/03-98 08.26.46 AV   JDA7339                  */00000050
 /*       SIST ENDRET 27/09-96 14.10.02 AV   JDA0310                  */00000060
 /*       SIST ENDRET 02/01-96 08.35.07 AV   JDA0310                  */00000070
 /*       SIST ENDRET 27/07-95 08.58.09 AV   JDA0310                  */00000080
 /*       SIST ENDRET 02/02-95 08.33.17 AV   JDA0310                  */00000090
 /*       SIST ENDRET 05/01-95 11.18.38 AV   JDA0310                  */00000100
 /*       SIST ENDRET 16/12-93 14.32.50 AV   TRUDE                    */00000110
 /*       SIST ENDRET 11/02-93 13.28.46 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 12/10-92 15.30.23 AV   TRUDE                    */00000130
 /*       SIST ENDRET 28/09-92 14.32.15 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 28/09-92 13.16.59 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 23/09-92 15.29.55 AV   HERMAN                   */00000160
 /*       SIST ENDRET 16/09-92 11.26.53 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 12/06-92 13.33.11 AV   TRUDE                    */00000180
 /*       SIST ENDRET 19/03-92 14.02.16 AV   HERMAN                   */00000190
 /*       SIST ENDRET 03/03-92 09.51.31 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 12/02-92 14.07.11 AV   HERMAN                   */00000210
 /*       SIST ENDRET 13/12-91 12.20.36 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 10/10-91 13.56.00 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 23/09-91 11.25.21 AV   DYBVIK                   */00000240
 /*       SIST ENDRET 30/08-91 09.35.05 AV   HERMAN                   */00000250
 /*       SIST ENDRET 01/08-91 10.47.11 AV   HERMAN                   */00000260
 /*       SIST ENDRET 11/07-91 14.24.00 AV   DYBVIK                   */00000270
 /*       SIST ENDRET 04/07-91 12.50.20 AV   DYBVIK                   */00000280
 /*       SIST ENDRET 14/06-91 13.26.27 AV   DYBVIK                   */00000290
 /*       SIST ENDRET 06/06-91 14.39.57 AV   DYBVIK                   */00000300
 /*       SIST ENDRET 24/05-91 09.24.07 AV   HERMAN                   */00000310
 /*       SIST ENDRET 16/05-91 07.58.59 AV   HERMAN                   */00000320
 /*       SIST ENDRET 13/05-91 14.26.07 AV   HERMAN                   */00000330
 /*       SIST ENDRET 10/05-91 08.04.23 AV   HERMAN                   */00000340
 /*       SIST ENDRET 07/05-91 13.14.30 AV   HERMAN                   */00000350
 /*       SIST ENDRET 03/05-91 08.46.48 AV   HERMAN                   */00000360
 /*       SIST ENDRET 26/04-91 11.45.35 AV   DYBVIK                   */00000370
 /*IDENTIFIKASJON:                                                   */ 00000380
 /*    R0014011 - UNDERPROGRAM I PLI                                 */ 00000390
 /*    PROGRAMMERER:           HERMAN LARSSEN APRIL 1991             */ 00000400
 /*HENSIKT:                                                          */ 00000410
 /*    BEREGNE FORSØRGINGSTILLEGG - LOVGIVNING PR 1.5.91             */ 00000420
 /*    PROGRAMMET KALLES OPP NÅR DET KREVES FORSØRGINGSTILLEGG       */ 00000430
 /*    FOR EKTEFELLE OG/ELLER BARN, OG FT_SKAL_BEREGNES I FORSI      */ 00000440
 /*    ER SATT TIL 'J' (BLANKETT MED INNTEKTER ER REGISTRERT) ,      */ 00000450
 /*    ELLER FT_SKAL BEREGNES = N (GRUNNBELØPET ER BLITT HØYERE      */ 00000460
 /*    ENN DET VAR PR. APRIL 1991).                                  */ 00000470
 /*                                                                  */ 00000480
 /*    BEREGNER :                                                    */ 00000490
 /*        FULLT FORSØRGINGSTILLEGG                                  */ 00000500
 /*        INNTEKTS-REDUSERT FORSØRGINGSTILLEGG                      */ 00000510
 /*        GARANTITILLEGG                                            */ 00000520
 /*    OPPDATERER :                                                  */ 00000530
 /*        ET OG BT I ALDERSP OG UFØRPENS                            */ 00000540
 /*        BT_SÆRBARN OG GARANTITILLEGG I FORSI                      */ 00000550
 /*        SUM_YTELSE                                                */ 00000560
 /*        TILKNYTNINGSKODE OG FT_FØR_91 I TILKN                     */ 00000570
 /*        BLANKER KODEN FT_FØR_91 I TILKN, HVIS GARANTI FOR DENNE   */ 00000580
 /*                FORSØRGEDE GÅR I NULL.                            */ 00000590
 /*        BLANKER FT_SKAL_BEREGNES HVIS DET IKKE ER FORSØRGEDE IGJEN*/ 00000600
 /*                SETTER DA FT_SKAL_BEREGNES = 'D'.                 */ 00000610
 /*                                                                  */ 00000620
 /*                                                                  */ 00000630
 /*PROGRAMTILKNYTNING:                                               */ 00000640
 /*    INKLUDERES I 4001                                             */ 00000650
 /*PARAMETER : INDEKS_I_B02                                          */ 00000660
 /* **************************************************************** */ 00000670
 FORSØRG:                                                               00000680
 PROC (IND);                                                            00000690
 DCL ANT_REDU          FIXED DEC (3)   INIT (0);                        00000700
 DCL ANT_TT_RED        FIXED DEC (3)   INIT (0);                        00000710
 DCL ANT_V             FIXED DEC (3)   INIT (0);                        00000720
 DCL ANT_W             FIXED DEC (3)   INIT (0);                        00000730
 DCL BARN_0591         FIXED DEC (3)   INIT (0);                        00000740
 DCL BARN_FULL         FIXED DEC (3)   INIT (0);                        00000750
 DCL BT_PROSENT        FIXED DEC (3,2) INIT (0);    /*9805*/            00000760
 DCL BT_PROSENT_RED    FIXED DEC (5,3) INIT (0);    /*9805*/            00000770
 DCL BT_V              FIXED DEC (7)   INIT (0);                        00000780
 DCL BT_W              FIXED DEC (7)   INIT (0);                        00000790
 DCL EK_0591           CHAR      (1)   INIT (' ');                      00000800
 DCL W_FOLKTRYGD       FIXED DEC (7)   INIT (0);                        00000810
 DCL FOLKETRYGD_ÅR     FIXED DEC (7)   INIT (0);                        00000820
 DCL FOLKETRYGD_EK     FIXED DEC (7)   INIT (0);                        00000830
 DCL FOLKETRYGD_EK_ÅR  FIXED DEC (7)   INIT (0);                        00000840
 DCL FORDELINGS_INNT   FIXED DEC (7)   INIT (0);                        00000850
 DCL FRADRAG           FIXED DEC (7)   INIT (0);                        00000860
 DCL FRADRAG_ET        FIXED DEC (7)   INIT (0);                        00000870
 DCL FRIBELØP          FIXED DEC (7)   INIT (0);                        00000880
 DCL FRIBELØP_V        FIXED DEC (7)   INIT (0);                        00000890
 DCL FRIBELØP_W        FIXED DEC (7)   INIT (0);                        00000900
 DCL FULL_ET           FIXED DEC (7)   INIT (0);                        00000910
 DCL FULL_BT           FIXED DEC (7)   INIT (0);                        00000920
 DCL FULL_TT           FIXED DEC (3)   INIT (0);                        00000930
 DCL FULL_TT_BT        FIXED DEC (5)   INIT (0);                        00000940
 DCL FULL_V            FIXED DEC (7)   INIT (0);                        00000950
 DCL FULL_W            FIXED DEC (7)   INIT (0);                        00000960
 DCL GARANTI_BARN      FIXED DEC (3)   INIT (0);                        00000970
 DCL GARANTI_BT        FIXED DEC (7)   INIT (0);                        00000980
 DCL GARANTI_BT_V      FIXED DEC (7)   INIT (0);                        00000990
 DCL GARANTI_BT_W      FIXED DEC (7)   INIT (0);                        00001000
 DCL GARANTI_EK        FIXED DEC (7)   INIT (0);                        00001010
 DCL GARANTI_SUM       FIXED DEC (7)   INIT (0);                        00001020
 DCL GARANTI_PENSJON   FIXED DEC (7)   INIT (0);                        00001030
 DCL GARANTITILLEGG_EK FIXED DEC (7)   INIT (0);                        00001040
 DCL GARANTITILLEGG    FIXED DEC (7)   INIT (0);                        00001050
 DCL GRAD              FIXED DEC (3);                                   00001060
 DCL W_GRAD            FIXED DEC (7,3);                                 00001070
 DCL HJELPEFELT       FIXED DEC (13,4) INIT (0);                        00001080
 DCL HJELP1           FIXED DEC (13,4) INIT (0);                        00001090
 DCL HJELP2           FIXED DEC (13,4) INIT (0);                        00001100
 DCL HJELP3           FIXED DEC (13,4) INIT (0);                        00001110
 DCL HJELP4           FIXED DEC (13,4) INIT (0);                        00001120
 DCL HJELP5           FIXED DEC (13,4) INIT (0);                        00001130
 DCL HJELP6           FIXED DEC (13,4) INIT (0);                        00001140
 DCL HJELP_BT_V       FIXED DEC (13,4) INIT (0);                        00001150
 DCL HJELP_BT_W       FIXED DEC (13,4) INIT (0);                        00001160
 DCL IND               FIXED BIN (15);                                  00001170
 DCL IND_EK            FIXED BIN (15);                                  00001180
 DCL INNTEKT           FIXED DEC (7)   INIT (0);                        00001190
 DCL INNTEKT_V         FIXED DEC (7)   INIT (0);                        00001200
 DCL INNTEKT_W         FIXED DEC (7)   INIT (0);                        00001210
 DCL INNTEKT_EK        FIXED DEC (7)   INIT (0);                        00001220
 DCL JA                     CHAR (1)  INIT ('J');                       00001230
 DCL K                 FIXED BIN (15)  INIT (0);                        00001240
 DCL MINSTE_GP         FIXED DEC (7)   INIT (0);                        00001250
 DCL MINSTE_ST         FIXED DEC (7)   INIT (0);                        00001260
 DCL MINSTEPENSJON     FIXED DEC (7)   INIT (0);                        00001270
 DCL OMREGNET_GAR      FIXED DEC (7)   INIT (0);                        00001280
 DCL REDUSERT_EK       FIXED DEC (7)   INIT (0);                        00001290
 DCL REDUSERT_SB       FIXED DEC (7)   INIT (0);                        00001300
 DCL REDUSERT_FB       FIXED DEC (7)   INIT (0);                        00001310
 DCL REDUSERT_TOT      FIXED DEC (7)   INIT (0);                        00001320
 DCL REDUKSJON_ET      FIXED DEC (7)   INIT (0);                        00001330
 DCL REDUKSJON_BT      FIXED DEC (7)   INIT (0);                        00001340
 DCL REDUKSJON_FB      FIXED DEC (7)   INIT (0);                        00001350
 DCL REDUKSJON_SB      FIXED DEC (7)   INIT (0);                        00001360
 DCL REDUKSJON_BARN    FIXED DEC (7)   INIT (0);                        00001370
 DCL REDUKSJON_TOT     FIXED DEC (7)   INIT (0);                        00001380
 DCL REDUKSJONS_BELØP  FIXED DEC (7)   INIT (0);                        00001390
 DCL RETUR_ET          FIXED DEC (7)   INIT (0);                        00001400
 DCL RETUR_BT          FIXED DEC (7)   INIT (0);                        00001410
 DCL RETUR_SB          FIXED DEC (7)   INIT (0);                        00001420
 DCL RETUR_FB          FIXED DEC (7)   INIT (0);                        00001430
 DCL REGN_GARANTI      CHAR      (1)   INIT (' ');                      00001440
 DCL TILLEGG_FØR       FIXED DEC (7)   INIT (0);                        00001450
 DCL TILLEGG_ETTER     FIXED DEC (7)   INIT (0);                        00001460
 DCL TILLEGGS_INNT     FIXED DEC (7)   INIT (0);                        00001470
 DCL TILLEGGSINNT_V    FIXED DEC (7)   INIT (0);                        00001480
 DCL TILLEGGSINNT_W    FIXED DEC (7)   INIT (0);                        00001490
 DCL TILLEGG_V         FIXED DEC (3)   INIT (0);                        00001500
 DCL TILLEGG_W         FIXED DEC (3)   INIT (0);                        00001510
 DCL TOTALT_W          FIXED DEC (3)   INIT (0);                        00001520
 DCL TOTALT_V          FIXED DEC (3)   INIT (0);                        00001530
 DCL TP_DIFF           FIXED DEC (7)   INIT (0);                        00001540
 DCL TP_ETTER92        FIXED DEC (7)   INIT (0);                        00001550
 DCL TP_NY             FIXED DEC (7)   INIT (0);                        00001560
 DCL TP1               FIXED DEC (7)   INIT (0);                        00001570
 DCL TP2               FIXED DEC (7)   INIT (0);                        00001580
 DCL TT_BARN           FIXED DEC (3)   INIT (0);                        00001590
 DCL TT_FAKTOR         FIXED DEC (3)   INIT (0);                        00001600
 DCL W_BT             FIXED DEC (13,4) INIT (0);                        00001610
 DCL W_TP_GARANTI      FIXED DEC (7)   INIT (0);                        00001620
 DCL ÅFT_BT            FIXED DEC (7)   INIT (0);                        00001630
 DCL ÅFT_ET            FIXED DEC (7)   INIT (0);                        00001640
 DCL ÅFT_FORS_TILLEGG  FIXED DEC (7)   INIT (0);                        00001650
 DCL ÅFT_FRADRAG       FIXED DEC (7)   INIT (0);                        00001660
 DCL ÅFT_TILLEGG       FIXED DEC (7)   INIT (0);                        00001670
 DCL PROSENT_ST        FIXED DEC (5,2) INIT (0);                        00001680
                                                                        00001690
 /* FINNE INDEX FOR EKTEFELLE ELLER SAMBOER : */                        00001700
                                                                        00001710
 IND_EK = 3 - IND;                                                      00001720
                                                                        00001730
 /* ******                                                              00001740
 DO I = 3 TO 13 WHILE (B02.FNR_TILKN(IND,I) > 0);                       00001750
    IF B02.TILKNYTNINGSKODE(IND,I) = 'S'             THEN               00001760
       DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                           00001770
          IF B02.FNR_TILKN(IND,I) = B02.FNR(J)       THEN               00001780
             DO;                                                        00001790
                IND_EK = J ;                                            00001800
                J      = 14;                                            00001810
             END;                                                       00001820
       END;                                                             00001830
 END;                                                                   00001840
                                                                        00001850
  ************** */                                                     00001860
                                                                        00001870
 /*F  B02.VIRK_DATO_ÅM(IND) > 9400  THEN                   */           00001880
  IF  W_VIRK_DATO_ÅMD     > 940000  THEN  /* HL 0195       */           00001890
      PROSENT_ST  = ST_PROSENT_ENSLIG;                                  00001900
  ELSE                                                                  00001910
      PROSENT_ST  = ST_PROSENT_SAMST;                                   00001920
                                                                        00001930
                                                                        00001940
 /* ******************************************************** */         00001950
 /*             HOVED-PROSEDYRE                              */         00001960
 /*                                                          */         00001970
 /*   OPPDATERER RETUR_ET, RETUR_BT OG B02.BT_SÆRKULL        */         00001980
 /* ******************************************************** */         00001990
                                                                        00002000
 B02.GARANTITILLEGG_EK     (IND) = 0;                                   00002010
 B02.GARANTITILLEGG_BARN   (IND) = 0;                                   00002020
 B02.GARANTITILLEGG_SÆRBARN(IND) = 0;                                   00002030
 B02.BT_SÆRBARN            (IND) = 0;                                   00002040
                                                                        00002050
 IF (B02.ANTALL_BARN(IND)    = 0     &                                  00002060
     B02.PENSJONSTYPE2(IND) ^= 'F'     )   !                            00002070
     G < 35500                             THEN                         00002080
       DO;                                                              00002090
          B02.FORSI(IND)            = '';                               00002100
          B02.FT_SKAL_BEREGNES(IND) = 'D';                              00002110
                                                                        00002120
 /*HVORFOR SKAL FORSI BLANKES ?????? I B01 : */                         00002130
                                                                        00002140
      /*  IF B01.FT_SKAL_BEREGNES(IND) ^= ' ' THEN    */                00002150
      /*     DO;                                      */                00002160
      /*         B01.FORSI(IND)            = '';      */                00002170
      /*        B01.FT_SKAL_BEREGNES(IND) = 'D';      */                00002180
      /*     END;                                     */                00002190
                                                                        00002200
 /*HAR FJERNET BLANKINGEN 5.8.96 HL */                                  00002210
                                                                        00002220
          GO TO P99;                                                    00002230
       END;                                                             00002240
                                                                        00002250
 CALL P1_REGN_YTELSER;                                                  00002260
 CALL P2_TELL_FORSØRGEDE;                                               00002270
 CALL P3_REGN_INNT_FRIBELØP;                                            00002280
                                                                        00002290
 IF REGN_GARANTI = ' '   THEN   /*INGEN FORSØRGET FØR 0591*/            00002300
    IF B02.FT_SKAL_BEREGNES(IND) = 'J'         THEN                     00002310
       CALL P5_REGN_REDUKSJON;                                          00002320
    ELSE;                                                               00002330
 ELSE  /* DET SKAL REGNES GARANTI*/                                     00002340
 IF B02.FT_SKAL_BEREGNES(IND) ^= 'J'        THEN                        00002350
    DO;                                                                 00002360
       CALL P4_REGN_GARANTISUM;                                         00002370
       IF (GARANTI_SUM   > W_FOLKTRYGD     )     &                      00002380
          ((GARANTI_BT + GARANTI_EK) > 0)   THEN                        00002390
          DO;                                                           00002400
             GARANTITILLEGG = GARANTI_SUM - W_FOLKTRYGD;                00002410
             B02.GARANTITILLEGG_BARN(IND) = GARANTITILLEGG              00002420
                 * GARANTI_BT / (GARANTI_BT + GARANTI_EK) + 0.5;        00002430
             B02.GARANTITILLEGG_EK(IND) = GARANTITILLEGG                00002440
                 - B02.GARANTITILLEGG_BARN(IND);                        00002450
             B02.SUM_YTELSE(IND) = B02.SUM_YTELSE(IND) +                00002460
                                    GARANTITILLEGG;                     00002470
          END;                                                          00002480
       ELSE                                                             00002490
          DO;                                                           00002500
             B02.GARANTITILLEGG_BARN(IND) = 0;                          00002510
             B02.GARANTITILLEGG_EK(IND)   = 0;                          00002520
          END;                                                          00002530
    END;                                                                00002540
 ELSE                                                                   00002550
    DO;                                                                 00002560
       CALL P4_REGN_GARANTISUM;                                         00002570
       CALL P5_REGN_REDUKSJON;                                          00002580
       IF GARANTI_SUM < REDUKSJONS_BELØP     THEN                       00002590
          DO I = 1 TO 13 WHILE(B02.FNR_TILKN(IND,I) > 0);               00002600
             DO J = 1 TO 14 UNTIL                                       00002610
                  (B02.FNR_TILKN(IND,I) = B02.FNR(J));                  00002620
             END;                                                       00002630
             B02.GAMMEL_FT_KODE(J) = B02.FT_FØR_91(IND,I);              00002640
             B02.FT_FØR_91(IND,I) = ' ';                                00002650
               /* PROBLEMER MED VIRK_DATO=G_DATO FOR VIRK > G_DATO */   00002660
               /* TRUDE, 280992.NY TEST PÅ OM VIRK_DATO< G_DATO    */   00002670
             IF B02.VIRK_DATO_ÅM(IND) <   B02.G_DATO_ÅM(IND) THEN       00002680
               DO;                                                      00002690
                B02.VIRK_DATO_ÅM(J)   =  B02.G_DATO_ÅM(IND);            00002700
                B02.VIRK_DATO_ÅM(IND) =  B02.G_DATO_ÅM(IND);            00002710
   /*0795 TS*/  B02.VIRK_DATO_ÅM(IND_EK) =  B02.G_DATO_ÅM(IND);         00002720
               END;                                                     00002730
          END;                                                          00002740
       ELSE                                                             00002750
          CALL P6_GARANTITILLEGG;                                       00002760
    END;                                                                00002770
 /* ******************************************************** */         00002780
 /*              SLUTT PÅ HOVEDPROSEDYRA                     */         00002790
 /* ******************************************************** */         00002800
                                                                        00002810
                                                                        00002820
 /* ****************************************************** */           00002830
 /* RUTINE FOR Å SUMMERE OPP FULLE YTELSER :               */           00002840
 /* ****************************************************** */           00002850
                                                                        00002860
 P1_REGN_YTELSER : PROC;                                                00002870
                                                                        00002880
                                                                        00002890
 IF W_VIRK_DATO_ÅMD    < 980500  THEN  /* HL 9805       */              00002900
    DO;                                                                 00002910
       BT_PROSENT = 0.25;                                               00002920
       BT_PROSENT_RED = 0.125;                                          00002930
    END;                                                                00002940
 ELSE                                                                   00002950
    DO;                                                                 00002960
       BT_PROSENT = 0.30;                                               00002970
       BT_PROSENT_RED = 0.15;                                           00002980
    END;                                                                00002990
                                                                        00003000
 IF B02.YRKEPENS.YUG(IND)  > 0      THEN                                00003010
    TT_FAKTOR = 40;                                                     00003020
 ELSE                                                                   00003030
    TT_FAKTOR = B02.TT_ANV(IND);                                        00003040
                                                                        00003050
 IF TT_FAKTOR ^= 40             THEN                                    00003060
    DO;                                                                 00003070
       DO I = 3 TO 14;                                                  00003080
          IF B02.PENSJONSRETT_FØR_91(I) = 'J'   &                       00003090
             B02.STATUS_KODE_HIST(I) = ' '      THEN                    00003100
             FULL_TT = FULL_TT + 1;                                     00003110
       END;                                                             00003120
    END;                                                                00003130
 ELSE                                                                   00003140
    FULL_TT = B02.ANTALL_BARN(IND);                                     00003150
                                                                        00003160
 FULL_TT_BT  = G * BT_PROSENT * FULL_TT / 12 + 0.5;                     00003170
                                                                        00003180
 IF (B02.ANTALL_BARN(IND) - FULL_TT) > 0  THEN                          00003190
   DO;                                                                  00003200
      FULL_BT = G * BT_PROSENT * (B02.ANTALL_BARN(IND) - FULL_TT)*      00003210
                TT_FAKTOR / (40 * 12) + 0.5;                            00003220
   END;                                                                 00003230
  FULL_BT = FULL_BT + FULL_TT_BT;                                       00003240
                                                                        00003250
 /*FULL_BT    = G * 0.25 * B02.ANTALL_BARN(IND) * B02.TT_ANV(IND)       00003260
                          / (40 * 12) + 0.5;   TRUDE*/                  00003270
       /* TIL HIT , TRUDE  */                                           00003280
                                                                        00003290
 IF B02.PENSJONSTYPE2(IND) = 'F'  THEN                                  00003300
    IF W_VIRK_DATO_ÅMD    < 970500  THEN  /* HL 9803       */           00003310
       FULL_ET    = G * 0.5  * B02.TT_ANV(IND) / (40 * 12) + 0.5;       00003320
    ELSE                                                                00003330
       FULL_ET    = G * 0.5 * TT_FAKTOR /(40 * 12) + 0.5;/*9803*/       00003340
                                                                        00003350
 SELECT (B02.PENSJONSTYPE1(IND));                                       00003360
                                                                        00003370
    WHEN ('A', 'K')                                                     00003380
       DO;                                                              00003390
            /*-------------------------------------------------------*/ 00003400
            /* ENDRET FRA 270892. GRAD SKAL VÆRE I FORHOLD TIL       */ 00003410
            /* BRUTTO OG NETTO YTELSE.  TRUDE                        */ 00003420
            /* SKAL VI BRUKE DESIMALER PÅ GRADEN ???                 */ 00003430
            /* ENDRET FRA 121092. NETTO_GP ^= GP                     */ 00003440
            /*-------------------------------------------------------*/ 00003450
          /* GRAD = 100;  */                                            00003460
          IF B02.ALDERSP.APD(IND) = 0   THEN                            00003470
            DO;                                                         00003480
             IF B02.AP_GP_NETTO(IND) ^=  B02.ALDERSP.GP(IND)  THEN      00003490
               DO;                                                      00003500
                 W_GRAD = B02.AP_GP_NETTO(IND) * 100 /                  00003510
                                        B02.ALDERSP.GP(IND);            00003520
                 GRAD   = W_GRAD + 1;                                   00003530
               END;                                                     00003540
             ELSE                                                       00003550
                 GRAD  = 100;                                           00003560
                                                                        00003570
            END;    /* ENDRET TIL HIT TRUDE */                          00003580
          ELSE                                                          00003590
             GRAD = B02.ALDERSP.APD(IND);                               00003600
          TP_ETTER92 =  B02.AP_TP_NETTO(IND) +                          00003610
                        B02.ALDERSP.ST(IND) +                           00003620
                        B02.TP_NETTO(IND);                              00003630
          W_FOLKTRYGD = B02.AP_GP_NETTO(IND) +                          00003640
                        B02.GT_TILLEGG_LOV92(IND) +                     00003650
                        TP_ETTER92                +                     00003660
                        B02.ALDERSP.VT_GP(IND) +                        00003670
                        B02.ALDERSP.VT_TP(IND);                         00003680
          IF B02.GARANTI_TP(IND) > 0             THEN                   00003690
             IF B02.PENSJONSTYPE2(IND) ^= 'E'    THEN                   00003700
                DO;                                                     00003710
                   TP_NY =                                              00003720
                        B02.AP_TP_NETTO(IND) +                          00003730
                        B02.GT_TILLEGG_LOV92(IND) +                     00003740
                        B02.ALDERSP.ST(IND) +                           00003750
                        B02.ALDERSP.VT_TP(IND) +                        00003760
                        B02.TP_NETTO(IND);                              00003770
                                                                        00003780
                   IF B02.GARANTI_TP(IND) > TP_NY        THEN           00003790
                      W_TP_GARANTI = B02.GARANTI_TP(IND);               00003800
                END;                                                    00003810
       END;                                                             00003820
                                                                        00003830
    WHEN ('U', 'Y')                                                     00003840
       DO;                                                              00003850
          GRAD = B02.UFØRPENS.UFG(IND);                                 00003860
          TP_ETTER92 =  B02.UFØRPENS.TP(IND) +                          00003870
                        B02.UFØRPENS.ST(IND) +                          00003880
                        B02.YRKEPENS.TP(IND) +                          00003890
                        B02.ETTEPENS.ST(IND) +                          00003900
                        B02.TP_NETTO(IND);                              00003910
          W_FOLKTRYGD = B02.UFØRPENS.GP(IND) +                          00003920
                        B02.GT_TILLEGG_LOV92(IND) +                     00003930
                        TP_ETTER92            +                         00003940
                        B02.UFØRPENS.ÅFT(IND) +                         00003950
                        B02.YRKEPENS.GP(IND) +                          00003960
                        B02.GP_NETTO(IND);                              00003970
          IF B02.GARANTI_TP(IND) > 0             THEN                   00003980
             IF B02.PENSJONSTYPE2(IND) ^= 'E'    THEN                   00003990
                DO;                                                     00004000
                   TP_NY =                                              00004010
                        B02.UFØRPENS.TP(IND) +                          00004020
                        B02.GT_TILLEGG_LOV92(IND) +                     00004030
                        B02.UFØRPENS.ST(IND) +                          00004040
                        B02.UFØRPENS.ÅFT(IND) +                         00004050
                        B02.YRKEPENS.TP(IND) +                          00004060
                        B02.TP_NETTO(IND);                              00004070
                                                                        00004080
                   IF B02.GARANTI_TP(IND) > TP_NY        THEN           00004090
                      W_TP_GARANTI = B02.GARANTI_TP(IND);               00004100
                END;                                                    00004110
       END;                                                             00004120
                                                                        00004130
    OTHERWISE;                                                          00004140
                                                                        00004150
 END;  /*SELECT*/                                                       00004160
                                                                        00004170
 IF W_TP_GARANTI > 0               THEN                                 00004180
    W_FOLKTRYGD = W_FOLKTRYGD - TP_NY + W_TP_GARANTI;                   00004190
                                                                        00004200
 DIV_PARAM_OMR.FOLKETRYGD(IND) = W_FOLKTRYGD * 12;                      00004210
                                                                        00004220
                                                                        00004230
 /* FJERNET TEST PÅ PT2 - HL 0295 : */                                  00004240
                                                                        00004250
 /*  IF B02.PENSJONSTYPE2(IND) = 'S'        THEN   */                   00004260
 SELECT (B02.PENSJONSTYPE1(IND_EK));                                    00004270
                                                                        00004280
    WHEN ('A', 'K')                                                     00004290
       DO;                                                              00004300
          FOLKETRYGD_EK =  B02.AP_GP_NETTO(IND_EK) +                    00004310
                           B02.GT_TILLEGG_LOV92(IND_EK) +               00004320
                           B02.AP_TP_NETTO(IND_EK) +                    00004330
                           B02.ALDERSP.ST(IND_EK) +                     00004340
                           B02.ALDERSP.VT_GP(IND_EK) +                  00004350
                           B02.ALDERSP.VT_TP(IND_EK);                   00004360
       END;                                                             00004370
                                                                        00004380
    WHEN ('U', 'Y')                                                     00004390
       DO;                                                              00004400
          FOLKETRYGD_EK =  B02.UFØRPENS.GP(IND_EK) +                    00004410
                           B02.GT_TILLEGG_LOV92(IND_EK) +               00004420
                           B02.UFØRPENS.TP(IND_EK) +                    00004430
                           B02.UFØRPENS.ST(IND_EK) +                    00004440
                           B02.UFØRPENS.ÅFT(IND_EK) +                   00004450
                           B02.YRKEPENS.GP(IND_EK) +                    00004460
                           B02.YRKEPENS.TP(IND_EK);                     00004470
       END;                                                             00004480
                                                                        00004490
    OTHERWISE;                                                          00004500
                                                                        00004510
 END;  /*SELECT*/                                                       00004520
                                                                        00004530
 FOLKETRYGD_EK_ÅR  =  FOLKETRYGD_EK * 12;                               00004540
 DIV_PARAM_OMR.FOLKETRYGD(IND_EK) = FOLKETRYGD_EK_ÅR;                   00004550
                                                                        00004560
 /*  TT_FAKTOR = B02.TT_ANV(IND)- FLYTTES FØRST I PROSEDYREN.TRUDE*/    00004570
                                                                        00004580
 END P1_REGN_YTELSER;                                                   00004590
                                                                        00004600
 P2_TELL_FORSØRGEDE : PROC;                                             00004610
                                                                        00004620
  /*REGNER OGSÅ GARANTI BARNETILLEGG, FORDELT PÅ V/W      */            00004630
  /*OPPDATERE KODER, NÅR DETTE IKKE KAN VÆRE GJORT FRA FØR*/            00004640
  /*FT_FØR_91 FOR FORSØRGET EKTEFELLE (F) OG BARN (R,L)   */            00004650
  /*TILKNYTNINGSKODE FOR BARN (W)                         */            00004660
  /*PENSJONSTYPE2    FOR BARN (W)                         */            00004670
                                                                        00004680
 IF B02.FT_SKAL_BEREGNES(IND) = 'N'         THEN                        00004690
 /* B01.FT_SKAL_BEREGNES(IND) = ' '         THEN       */               00004700
    DO;                                                                 00004710
       IF B02.PENSJONSTYPE1(IND_EK) = 'F'    THEN                       00004720
          DO J = 1 TO 13 WHILE(B02.FNR_TILKN(IND,J) > 0);               00004730
             IF B02.FNR(IND_EK)= B02.FNR_TILKN(IND,J) THEN              00004740
                DO;                                                     00004750
                   B02.FT_FØR_91(IND,J)   = 'F';                        00004760
                   J=13;                                                00004770
                END;                                                    00004780
          END;                                                          00004790
       DO I = 3 TO 14 WHILE(B02.FNR(I) > 0);                            00004800
          DO J = 1 TO 13 WHILE(B02.FNR_TILKN(IND,J) > 0);               00004810
             IF B02.FNR(I) = B02.FNR_TILKN(IND,J)   THEN                00004820
               DO;                                                      00004830
                 IF B02.FT_FØR_91(IND,J) = ' '     THEN                 00004840
                   DO;                                                  00004850
                      IF B02.PENSJONSTYPE2(I)         = 'R'   &         00004860
                         B02.PENSJONSTYPE2(IND_EK)    = 'M'   THEN      00004870
                         DO;                                            00004880
                            B02.FT_FØR_91(IND,J)      = 'R';            00004890
                            B02.TILKNYTNINGSKODE(IND,J)   = 'W';        00004900
                            B02.PENSJONSTYPE2(I)   = 'W';               00004910
                         END;                                           00004920
                      ELSE                                              00004930
                      IF B02.PENSJONSTYPE1(I)         = 'L'   THEN      00004940
                         DO;                                            00004950
                            B02.FT_FØR_91(IND,J)   = 'L';               00004960
                            B02.TILKNYTNINGSKODE(IND,J)   = 'W';        00004970
                            B02.PENSJONSTYPE2(I)   = 'W';               00004980
                         END;                                           00004990
                   END;                                                 00005000
                 J=13;                                                  00005010
               END;                                                     00005020
          END;                                                          00005030
       END;                                                             00005040
    END;                                                                00005050
                                                                        00005060
 /*OPPTELLING AV FORSØRGEDE FØR OG ETTER 0591*/                         00005070
                                                                        00005080
                                                                        00005090
 DO I = 1 TO 13 WHILE (B02.FNR_TILKN(IND,I) > 0);                       00005100
                                                                        00005110
    IF B02.FT_FØR_91(IND,I) = 'F'               THEN                    00005120
       DO;                                                              00005130
          REGN_GARANTI = 'J';                                           00005140
          EK_0591      = 'J';                                           00005150
       END;                                                             00005160
    ELSE                                                                00005170
    IF B02.FT_FØR_91(IND,I) = 'L'               THEN                    00005180
       DO;                                                              00005190
          REGN_GARANTI = 'J';                                           00005200
          BARN_FULL = BARN_FULL + 1;                                    00005210
          BARN_0591 = BARN_0591 + 1;                                    00005220
          IF  B02.ANTALL_BARN(IND) > FULL_TT     THEN                   00005230
             CALL P2_TT_BARN;                                           00005240
          ELSE                                                          00005250
             TT_BARN = 40;                                              00005260
          IF B02.TILKNYTNINGSKODE(IND,I) = 'W'  THEN                    00005270
             DO;                                                        00005280
                ANT_W = ANT_W + 1;                                      00005290
                HJELP_BT_W = HJELP_BT_W +                               00005300
                   34100 * TT_BARN/40 * BT_PROSENT * GRAD/100;          00005310
             END;                                                       00005320
          ELSE                                                          00005330
             DO;                                                        00005340
                ANT_V = ANT_V + 1;                                      00005350
                HJELP_BT_V = HJELP_BT_V +                               00005360
                   34100 * TT_BARN/40 * BT_PROSENT * GRAD/100;          00005370
             END;                                                       00005380
       END;                                                             00005390
    ELSE                                                                00005400
    IF B02.FT_FØR_91(IND,I) = 'R'               THEN                    00005410
       DO;                                                              00005420
          REGN_GARANTI = 'J';                                           00005430
          ANT_REDU  = ANT_REDU  + 1;                                    00005440
          BARN_0591 = BARN_0591 + 1;                                    00005450
          IF  B02.ANTALL_BARN(IND) > FULL_TT     THEN                   00005460
             CALL P2_TT_BARN;                                           00005470
          ELSE                                                          00005480
             TT_BARN = 40;                                              00005490
          IF B02.TILKNYTNINGSKODE(IND,I) = 'W'  THEN                    00005500
             DO;                                                        00005510
                ANT_W = ANT_W + 1;                                      00005520
                HJELP_BT_W = HJELP_BT_W +                               00005530
                  34100 * TT_BARN/40 * BT_PROSENT_RED * GRAD/100;       00005540
             END;                                                       00005550
          ELSE                                                          00005560
             DO;                                                        00005570
                ANT_V = ANT_V + 1;                                      00005580
                HJELP_BT_V = HJELP_BT_V +                               00005590
                  34100 * TT_BARN/40 * BT_PROSENT_RED * GRAD/100;       00005600
             END;                                                       00005610
       END;                                                             00005620
    ELSE                                                                00005630
    IF B02.TILKNYTNINGSKODE(IND,I) = 'W'  THEN                          00005640
       TILLEGG_W = TILLEGG_W + 1;                                       00005650
    ELSE                                                                00005660
    IF B02.TILKNYTNINGSKODE(IND,I) = 'V'  THEN                          00005670
       TILLEGG_V = TILLEGG_V + 1;                                       00005680
                                                                        00005690
 END;                                                                   00005700
                                                                        00005710
 GARANTI_BT_V = HJELP_BT_V / 12 + 0.5;                                  00005720
 GARANTI_BT_W = HJELP_BT_W / 12 + 0.5;                                  00005730
 TOTALT_W = ANT_W + TILLEGG_W;                                          00005740
 TOTALT_V = ANT_V + TILLEGG_V;                                          00005750
                                                                        00005760
 IF (TOTALT_W + TOTALT_V) > 0      THEN                                 00005770
    DO;                                                                 00005780
       BT_W = FULL_BT * TOTALT_W / ( TOTALT_W + TOTALT_V) + 0.5;        00005790
       BT_V = FULL_BT - BT_W;                                           00005800
    END;                                                                00005810
                                                                        00005820
 P2_TT_BARN : PROC;                                                     00005830
                                                                        00005840
       DO K = 3 TO 14 UNTIL (B02.FNR(K) = B02.FNR_TILKN(IND,I));        00005850
       END;                                                             00005860
       IF B02.PENSJONSRETT_FØR_91(K) = 'J'      THEN                    00005870
          TT_BARN             = 40;                                     00005880
       ELSE                                                             00005890
          TT_BARN             = B02.TT_ANV(IND);                        00005900
                                                                        00005910
 END P2_TT_BARN;                                                        00005920
                                                                        00005930
 END P2_TELL_FORSØRGEDE;                                                00005940
                                                                        00005950
                                                                        00005960
 /* ******************************************************** */         00005970
 /*PROSEDYRE FOR Å BEREGNE INNTEKT OG FRIBELØP               */         00005980
 /*                                                          */         00005990
 /* REGNER : INNTEKT, INNTEKT_EK, INNTEKT_V, INNTEKT_W,      */         00006000
 /*          FRIBELØP_V, FRIBELØP_W                          */         00006010
 /* ******************************************************** */         00006020
                                                                        00006030
 P3_REGN_INNT_FRIBELØP : PROC;                                          00006040
                                                                        00006050
 INNTEKT       = B02.ARBEIDSINNTEKT(IND) * 100 +                        00006060
                 B02.PENSJONSINNTEKT(IND) * 100 + W_FOLKTRYGD * 12;     00006070
 INNTEKT_EK    = B02.ARBEIDSINNTEKT_EK(IND) * 100 +                     00006080
                 B02.PENSJONSINNTEKT_EK(IND) * 100;                     00006090
 IF INNTEKT_EK > G   THEN                                               00006100
    INNTEKT_EK = INNTEKT_EK + FOLKETRYGD_EK_ÅR - G;                     00006110
 ELSE                                                                   00006120
    INNTEKT_EK = FOLKETRYGD_EK_ÅR;                                      00006130
                                                                        00006140
 IF TOTALT_V > 0            THEN                                        00006150
    DO;                                                                 00006160
       IF B02.PENSJONSTYPE2(IND) = 'F'             &                    00006170
          B02.SIVILSTAND   (IND) = 'A'             THEN                 00006180
          DO;                                                           00006190
 /*          HJELPEFELT = G * (1.75 + (PROSENT_ST * 2 /100)             00006200
                        + 0.25 * TOTALT_V)                              00006210
                       * TT_FAKTOR / 40 + 0.5;                */        00006220
             HJELP2     = PROSENT_ST * 2 /100;                          00006230
             IF TOTALT_V > 1            THEN       /*9805*/             00006240
                HJELP3     = BT_PROSENT * (TOTALT_V - 1);               00006250
             HJELP4     = 2 + HJELP2 + HJELP3;                          00006260
             HJELP5     = G * HJELP4;                                   00006270
             HJELP6     = HJELP5 * TT_FAKTOR/ 40 + 0.5;                 00006280
                                                                        00006290
             FULL_V = FULL_ET + BT_V;                                   00006300
             FULL_W = BT_W;                                             00006310
          END;                                                          00006320
       ELSE                                                             00006330
          DO;                                                           00006340
 /*          HJELPEFELT = G * (1 + (ST_PROSENT_ENSLIG / 100)            00006350
                        + 0.25 * TOTALT_V)                              00006360
                        * TT_FAKTOR / 40 + 0.5;        */               00006370
             HJELP2     = ST_PROSENT_ENSLIG /100;                       00006380
             IF TOTALT_V > 1            THEN       /*9805*/             00006390
                HJELP3     = BT_PROSENT * (TOTALT_V - 1);               00006400
             HJELP4     = 1.50 + HJELP2 + HJELP3;                       00006410
                                                                        00006420
   /* OBS OBS  LEGGES INN ETTER OMREGNINGEN  :                 */       00006430
   /*                                                          */       00006440
             IF G > 35500 THEN            /*  LOVENDRING 1.5.92*/       00006450
                HJELP4 = HJELP4 + 0.25;                                 00006460
             HJELP5     = G * HJELP4;                                   00006470
             HJELP6     = HJELP5 * TT_FAKTOR/ 40 + 0.5;                 00006480
             FULL_V = BT_V;                                             00006490
             FULL_W = BT_W + FULL_ET;                                   00006500
          END;                                                          00006510
       FRIBELØP_V = HJELP6;                                             00006520
       DIV_PARAM_OMR.FRIBELØP_SÆRBARN(IND) = FRIBELØP_V;                00006530
    END;                                                                00006540
 ELSE                                                                   00006550
    FULL_W = BT_W + FULL_ET;                                            00006560
                                                                        00006570
 IF TOTALT_W > 0 !                                                      00006580
    FULL_ET  > 0             THEN                                       00006590
    DO;                                                                 00006600
 /*    HJELPEFELT = G * (1.75 + (ST_PROSENT_SAMST * 2 /100)             00006610
                     + 0.25 * TOTALT_W)                                 00006620
                    * TT_FAKTOR / 40 + 0.5;                   */        00006630
             HJELP2     = PROSENT_ST * 2 /100;                          00006640
             HJELP3     = BT_PROSENT * TOTALT_W;                        00006650
             HJELP4     = 1.75 + HJELP2 + HJELP3;                       00006660
             HJELP5     = G * HJELP4;                                   00006670
             HJELP6     = HJELP5 * TT_FAKTOR/ 40 + 0.5;                 00006680
       FRIBELØP_W = HJELP6;                                             00006690
       DIV_PARAM_OMR.FRIBELØP_FELLESBARN(IND) = FRIBELØP_W;             00006700
    END;                                                                00006710
                                                                        00006720
 IF FRIBELØP_V > 0             &                                        00006730
    FRIBELØP_W > 0             &                                        00006740
    INNTEKT > FRIBELØP_V       &                                        00006750
    INNTEKT > FRIBELØP_W             THEN                               00006760
    DO;                                                                 00006770
       IF FRIBELØP_W > FRIBELØP_V                 THEN                  00006780
             FORDELINGS_INNT = INNTEKT - FRIBELØP_W;                    00006790
       ELSE                                                             00006800
             FORDELINGS_INNT = INNTEKT - FRIBELØP_V;                    00006810
                                                                        00006820
       HJELPEFELT      = FORDELINGS_INNT * FULL_V  /                    00006830
                         (FULL_V + FULL_W) + 0.5;                       00006840
       TILLEGGSINNT_V  = HJELPEFELT;                                    00006850
       TILLEGGSINNT_W  = FORDELINGS_INNT - TILLEGGSINNT_V;              00006860
       INNTEKT_V = INNTEKT + TILLEGGSINNT_V - FORDELINGS_INNT;          00006870
       INNTEKT_W = INNTEKT + TILLEGGSINNT_W - FORDELINGS_INNT;          00006880
    END;                                                                00006890
                                                                        00006900
 ELSE                                                                   00006910
    DO;                                                                 00006920
       INNTEKT_V = INNTEKT;                                             00006930
       INNTEKT_W = INNTEKT;                                             00006940
    END;                                                                00006950
  /* **********                                                         00006960
 IF FRIBELØP_V > FRIBELØP_W THEN                                        00006970
    IF FRIBELØP_W > 0          THEN                                     00006980
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_W;                      00006990
    ELSE                                                                00007000
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_V;                      00007010
 ELSE                                                                   00007020
    IF FRIBELØP_V > 0          THEN                                     00007030
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_V;                      00007040
    ELSE                                                                00007050
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_W;                      00007060
               ****** SLIK VAR DET . TRUDE 031091   *********   */      00007070
  /* ********** LAGET INDEX PÅ FRIBELØPENE :   TRUDE,031091  */         00007080
                                                                        00007090
 IF FRIBELØP_V > FRIBELØP_W THEN                                        00007100
    IF FRIBELØP_W > 0          THEN                                     00007110
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_W;                 00007120
    ELSE                                                                00007130
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_V;                 00007140
 ELSE                                                                   00007150
    IF FRIBELØP_V > 0          THEN                                     00007160
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_V;                 00007170
    ELSE                                                                00007180
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_W;                 00007190
                 /* TIL HIT 3.10.91  TRUDE */                           00007200
 END P3_REGN_INNT_FRIBELØP;                                             00007210
                                                                        00007220
 /* ******************************************************** */         00007230
 /*PROSEDYRE FOR Å BEREGNE GARANTERT      FORSØRGINGSTILLEGG */         00007240
 /* ******************************************************** */         00007250
                                                                        00007260
 P4_REGN_GARANTISUM : PROC;                                             00007270
                                                                        00007280
 HJELPEFELT  = 0;                                                       00007290
 IF W_TP_GARANTI > 0           THEN                                     00007300
    GARANTI_PENSJON = (W_FOLKTRYGD - W_TP_GARANTI) * 34100/G + 1        00007310
                       + W_TP_GARANTI;                                  00007320
 ELSE                                                                   00007330
 /* IF B02.GT_LOV92(IND) > TP_ETTER92   THEN   */                       00007340
 IF B02.GT_LOV92(IND) > 0             THEN                              00007350
    DO;                                                                 00007360
       TP1 = B02.GT_LOV92(IND) * 341/355 + 0.5;                         00007370
       TP2 = TP_ETTER92 * 34100/G + 0.5;                                00007380
       IF B02.TP_NETTO(IND) < B02.TP_BRUTTO(IND) THEN                   00007390
          TP1 = TP1 - (B02.TP_BRUTTO(IND) - B02.TP_NETTO(IND))          00007400
                                  * 34100/G;                            00007410
       ELSE                                                             00007420
                                                                        00007430
 /*TILLEGG 18.9.92 HL */                                                00007440
                                                                        00007450
       IF B02.YRKEPENS.TP(IND) > 0             THEN                     00007460
          TP1 = (B02.GT_LOV92(IND) - B02.YRKEPENS.TP(IND)) * 341/355    00007470
                + B02.YRKEPENS.TP(IND) * 34100/G  + 0.5;                00007480
 /*HIT HL */                                                            00007490
       ELSE /*HL 6.9.93*/                                               00007500
       IF B02.AP_TP_NETTO(IND) < B02.ALDERSP.TP(IND)   THEN             00007510
          TP1 = B02.GT_LOV92(IND) * 341/355 * GRAD/100 + 0.5;           00007520
 /*       TP1 = TP1 - (B02.ALDERSP.TP(IND) - B02.AP_TP_NETTO(IND))      00007530
                                  * 34100/G;                  */        00007540
 /*GARANTIEN PÅ TP SKAL VÆRE DIFFERANSEN MELLOM GT_LOV92 OG   */        00007550
 /*BRUTTO TP (BRUTTO_TP OMREGNET ETTER G=34100), MED FRADRAG  */        00007560
 /*AV DET BELØP SOM FAKTISK ER TRUKKET I TILLEGGSPENSJONEN    */        00007570
 /*       TP_TREKK = B02.ALDERSP.TP(IND) - B02.AP_TP_NETTO(IND);*/      00007580
 /*       TP_DIFF  = TP1 - (TP_ETTER92 * 34100/G) - TP_TREKK;   */      00007590
                                                                        00007600
     /*HIT HL */                                                        00007610
                                                                        00007620
       IF TP1 > TP2 THEN                                                00007630
          GARANTI_PENSJON = (W_FOLKTRYGD - TP_ETTER92 -                 00007640
                B02.GT_TILLEGG_LOV92(IND)) * 34100/G + TP1 + 1;         00007650
       ELSE                                                             00007660
          GARANTI_PENSJON = W_FOLKTRYGD * 34100/G + 1;                  00007670
    END;                                                                00007680
 ELSE                                                                   00007690
    DO;                                                                 00007700
       GARANTI_PENSJON = W_FOLKTRYGD * 34100 / G + 1;                   00007710
       B02.GT_TILLEGG_LOV92(IND) = 0;                                   00007720
    END;                                                                00007730
                                                                        00007740
 GARANTI_BARN = BARN_FULL + ANT_REDU;                                   00007750
                                                                        00007760
 IF ANT_REDU > 3 THEN                                                   00007770
    DO;                                                                 00007780
       BARN_FULL = BARN_FULL + ANT_REDU - 3;                            00007790
       ANT_REDU  = 3;                                                   00007800
    END;                                                                00007810
                                                                        00007820
 IF TT_FAKTOR ^= 40             THEN                                    00007830
    DO;                                                                 00007840
 /********** HL                                                         00007850
                                                                        00007860
       DO I = 3 TO 14;                                                  00007870
          IF B02.PENSJONSRETT_FØR_91(I) = 'J'   THEN                    00007880
             FULL_TT = FULL_TT + 1;                                     00007890
       END;                                                             00007900
                                                                        00007910
  ********** */                                                         00007920
       ANT_TT_RED = GARANTI_BARN - FULL_TT;                             00007930
    END;                                                                00007940
                                                                        00007950
 CALL BT_ET;                                                            00007960
                                                                        00007970
 GARANTI_BT = W_BT / 12 + 0.5;                                          00007980
 GARANTI_EK = HJELPEFELT / (40 * 12 * 100) + 0.5;                       00007990
                                                                        00008000
                                                                        00008010
 /* ******************************************************** */         00008020
 /*BEREGNINGEN AV ET TILLEGG TIL ÅFT - FOR Å FINNE KORREKT   */         00008030
 /*            UTBETALING I APRIL 1991    :                  */         00008040
 /* ******************************************************** */         00008050
                                                                        00008060
 IF RETT_TIL_ÅFT(IND) = 'J'   THEN                                      00008070
    DO;                                                                 00008080
       GRAD = 100;                                                      00008090
       CALL BT_ET;                                                      00008100
       ÅFT_BT = W_BT / 12 + 0.5;                                        00008110
       ÅFT_ET = HJELPEFELT / (40 * 12 * 100) + 0.5;                     00008120
       ÅFT_FORS_TILLEGG = ÅFT_ET + ÅFT_BT - GARANTI_BT - GARANTI_EK;    00008130
       IF B02.PENSJONSTYPE2(IND) = 'S' THEN                             00008140
          DO;                                                           00008150
             MINSTE_ST = 34100 * PROSENT_ST * TT_FAKTOR                 00008160
                          / (100 * 40 * 12) + 0.5;                      00008170
             MINSTE_GP = 34100 * 0.75 / 12 + 0.5;                       00008180
          END;                                                          00008190
       ELSE                                                             00008200
          DO;                                                           00008210
             MINSTE_ST = 34100 * ST_PROSENT_ENSLIG * TT_FAKTOR          00008220
                          / (100 * 40 * 12) + 0.5;                      00008230
             MINSTE_GP = 34100 / 12 + 0.5;                              00008240
          END;                                                          00008250
       MINSTEPENSJON = MINSTE_GP + MINSTE_ST;                           00008260
       IF GARANTI_PENSJON > MINSTEPENSJON        THEN                   00008270
          ÅFT_FRADRAG = GARANTI_PENSJON - MINSTEPENSJON;                00008280
       ELSE                                                             00008290
          ÅFT_FRADRAG = 0;                                              00008300
       ÅFT_TILLEGG = ÅFT_FORS_TILLEGG - ÅFT_FRADRAG;                    00008310
       IF ÅFT_TILLEGG < 0     THEN                                      00008320
          ÅFT_TILLEGG = 0;                                              00008330
    END;                                                                00008340
                                                                        00008350
 /* ******************************************************** */         00008360
 /*BEREGNINGEN AV BT/ET - GARANTI                            */         00008370
 /* ******************************************************** */         00008380
                                                                        00008390
 BT_ET : PROC;                                                          00008400
                                                                        00008410
    IF ANT_TT_RED  > 0               THEN                               00008420
       IF ANT_REDU > 0               THEN                               00008430
          IF ANT_TT_RED  > ANT_REDU  THEN                               00008440
                                                                        00008450
             W_BT = ((ANT_REDU * 34100 *                                00008460
                              BT_PROSENT_RED * TT_FAKTOR/40) +          00008470
                    ((ANT_TT_RED - ANT_REDU) * 34100 * BT_PROSENT *     00008480
                       TT_FAKTOR/40)                              +     00008490
                    ((GARANTI_BARN - ANT_TT_RED)                        00008500
                     * 34100 * BT_PROSENT)) * GRAD / 100;               00008510
          ELSE                                                          00008520
                                                                        00008530
             W_BT = ((ANT_TT_RED * 34100 *                              00008540
                               BT_PROSENT_RED * TT_FAKTOR/40)  +        00008550
                    (ANT_REDU - ANT_TT_RED) * 34100 * BT_PROSENT_RED +  00008560
                    ((GARANTI_BARN - ANT_REDU)                          00008570
                     * 34100 * BT_PROSENT)) * GRAD / 100;               00008580
                                                                        00008590
       ELSE                                                             00008600
                                                                        00008610
          W_BT = ((ANT_TT_RED * 34100 * BT_PROSENT * TT_FAKTOR/40)  +   00008620
                 ((GARANTI_BARN - ANT_TT_RED)                           00008630
                  * 34100 * BT_PROSENT)) * GRAD / 100;                  00008640
                                                                        00008650
    ELSE                                                                00008660
                                                                        00008670
       W_BT = ((ANT_REDU * 34100 * BT_PROSENT_RED )    +                00008680
                 ((GARANTI_BARN - ANT_REDU)                             00008690
                  * 34100 * BT_PROSENT)) * GRAD / 100;                  00008700
                                                                        00008710
    IF EK_0591 = 'J'                          THEN                      00008720
       HJELPEFELT = 34100 * B02.TT_ANV(IND) * GRAD * 0.5;               00008730
                                                                        00008740
 END BT_ET;                                                             00008750
                                                                        00008760
   /*GARANTI_SUM ER MÅNEDSBELØP*/                                       00008770
                                                                        00008780
 GARANTI_SUM = GARANTI_PENSJON + GARANTI_EK + GARANTI_BT                00008790
               + ÅFT_TILLEGG;                                           00008800
                                                                        00008810
 END P4_REGN_GARANTISUM;                                                00008820
                                                                        00008830
 /* ******************************************************** */         00008840
 /*      PROSEDYRE FOR Å BEREGNE REDUKSJONSBELØPET           */         00008850
 /*                                                          */         00008860
 /* REGNER     : REDUKSJON_ET, REDUKSJON_FB, REDUKSJON_SB    */         00008870
 /* REGNER     : RETUR_ET, RETUR_FB OG RETUR_SB              */         00008880
 /* OPPDATERER : B02.ET, B02.BT, B02.SB OG B02.SUM_YTELSE    */         00008890
 /*              MED RETUR-BELØPENE                          */         00008900
 /* ******************************************************** */         00008910
                                                                        00008920
 P5_REGN_REDUKSJON : PROC;                                              00008930
                                                                        00008940
                                                                        00008950
 IF B02.ANTALL_BARN(IND) = 0        THEN /*BARE RETUR_ET*/              00008960
    CALL P51_EK;                                                        00008970
 ELSE                                                                   00008980
    DO;                                                                 00008990
       IF B02.PENSJONSTYPE2(IND) = 'F'           THEN                   00009000
          IF TOTALT_V > 0                           THEN                00009010
             IF B02.SIVILSTAND(IND) = 'A'              THEN             00009020
                CALL P52_EK_V;                                          00009030
             ELSE                                                       00009040
                DO;                                                     00009050
                   CALL P55_V;                                          00009060
                   IF TOTALT_W > 0                           THEN       00009070
                      CALL P53_EK_W;                                    00009080
                   ELSE                                                 00009090
                      CALL P51_EK;                                      00009100
                END;                                                    00009110
          ELSE                                                          00009120
          IF TOTALT_W > 0                           THEN                00009130
             CALL P53_EK_W;                                             00009140
          ELSE                                                          00009150
             CALL P51_EK;                                               00009160
       ELSE                                                             00009170
       IF TOTALT_W > 0                           THEN                   00009180
          DO;                                                           00009190
             CALL P54_W;                                                00009200
             IF TOTALT_V > 0                        THEN                00009210
                CALL P55_V;                                             00009220
          END;                                                          00009230
       ELSE                                                             00009240
       IF TOTALT_V > 0                           THEN                   00009250
          CALL P55_V;                                                   00009260
                                                                        00009270
    END;                                                                00009280
                                                                        00009290
    /* IKKE RETT TIL ÅFT_TILLEGG NÅR BT OSV. = 0     */                 00009300
    /* PENSJONSKTR 23.09.96 I TELF. TRUDE            */                 00009310
                                                                        00009320
    IF (RETUR_SB + RETUR_FB + RETUR_ET )  = 0 THEN                      00009330
      DO;                                                               00009340
        GARANTI_SUM  = GARANTI_SUM - ÅFT_TILLEGG;                       00009350
        ÅFT_TILLEGG  = 0;                                               00009360
      END;                                                              00009370
    /* TRUDE 24.09.96 */                                                00009380
                                                                        00009390
    REDUKSJONS_BELØP = W_FOLKTRYGD + REDUKSJON_ET + REDUKSJON_FB        00009400
                       + REDUKSJON_SB;                                  00009410
                                                                        00009420
   IF (RETUR_SB = BT_V)   &                                             00009430
      (BT_V > 0 )    THEN DIV_PARAM_OMR.FULLT_BT_V  = JA;               00009440
   IF (RETUR_FB = BT_W)   &                                             00009450
      (BT_W > 0 )    THEN DIV_PARAM_OMR.FULLT_BT_W  = JA;               00009460
   IF (RETUR_ET = FULL_ET)   &                                          00009470
      (FULL_ET > 0 )    THEN DIV_PARAM_OMR.FULLT_ET = JA;               00009480
                                                                        00009490
   B02.BT_SÆRBARN(IND)  = RETUR_SB;                                     00009500
   B02.SUM_YTELSE (IND) = B02.SUM_YTELSE (IND) + RETUR_SB;              00009510
                                                                        00009520
 SELECT (B02.PENSJONSTYPE1(IND));                                       00009530
                                                                        00009540
   WHEN ('A','K')                                                       00009550
      DO;                                                               00009560
         B02.SUM_YTELSE(IND) = B02.SUM_YTELSE(IND)                      00009570
               - B02.ALDERSP.ET (IND) - B02.ALDERSP.BT(IND)             00009580
               + RETUR_ET             + RETUR_FB;                       00009590
         B02.ALDERSP.ET (IND) = RETUR_ET;                               00009600
         B02.ALDERSP.BT (IND) = RETUR_FB;                               00009610
      END;                                                              00009620
                                                                        00009630
   WHEN ('U','Y')                                                       00009640
      DO;                                                               00009650
         B02.SUM_YTELSE (IND) = B02.SUM_YTELSE (IND)                    00009660
               - B02.UFØRPENS.ET (IND) - B02.UFØRPENS.BT(IND)           00009670
                                       - B02.YRKEPENS.BT(IND)           00009680
               + RETUR_ET             + RETUR_FB;                       00009690
         B02.UFØRPENS.ET(IND) = RETUR_ET;                               00009700
         B02.UFØRPENS.BT(IND) = RETUR_FB;                               00009710
         B02.YRKEPENS.BT(IND) = 0;                                      00009720
      END;                                                              00009730
                                                                        00009740
 END; /*SELECT*/                                                        00009750
                                                                        00009760
 P51_EK : PROC;      /*RETUR_ET OG REDUKSJON_ET*/                       00009770
                                                                        00009780
  IF INNTEKT_W > FRIBELØP_W            THEN                             00009790
     DO;                                                                00009800
        FRADRAG = (INNTEKT_W - FRIBELØP_W) * 0.5;                       00009810
        FRADRAG = FRADRAG / 12;                                         00009820
        IF FULL_ET    > FRADRAG         THEN                            00009830
           RETUR_ET = FULL_ET - FRADRAG;                                00009840
     END;                                                               00009850
  ELSE                                                                  00009860
     RETUR_ET = FULL_ET;                                                00009870
                                                                        00009880
  IF EK_0591 = 'J'     THEN                                             00009890
     REDUKSJON_ET = RETUR_ET;                                           00009900
                                                                        00009910
 END P51_EK;                                                            00009920
                                                                        00009930
 P52_EK_V : PROC;/*RETUR_EK,RETUR_SB,REDUKSJON_EK OG REDUKSJON_SB*/     00009940
                 /*EKTEFELLETILLEGGET REGNES SAMMEN MED SÆRK.BARN*/     00009950
                                                                        00009960
  IF INNTEKT_V > FRIBELØP_V          THEN                               00009970
     DO;                                                                00009980
        FRADRAG = (INNTEKT_V - FRIBELØP_V) / (12 * 2);                  00009990
        TILLEGG_FØR  = FULL_ET + BT_V;                                  00010000
        IF TILLEGG_FØR  > FRADRAG         THEN                          00010010
           DO;                                                          00010020
              HJELPEFELT = FRADRAG * FULL_ET /                          00010030
                                (FULL_ET + BT_V) + 0.5;                 00010040
              FRADRAG_ET = HJELPEFELT;                                  00010050
              RETUR_ET = FULL_ET - FRADRAG_ET;                          00010060
              RETUR_SB = BT_V - FRADRAG + FRADRAG_ET;                   00010070
           END;                                                         00010080
     END;                                                               00010090
  ELSE                                                                  00010100
     DO;                                                                00010110
        RETUR_ET = FULL_ET;                                             00010120
        RETUR_SB = BT_V;                                                00010130
     END;                                                               00010140
                                                                        00010150
  IF EK_0591 = 'J'                            THEN                      00010160
     REDUKSJON_ET = RETUR_ET;                                           00010170
                                                                        00010180
  IF TILLEGG_V > 0 THEN                                                 00010190
     DO;                                                                00010200
        HJELPEFELT   = RETUR_SB * ANT_V / TOTALT_V + 0.5;               00010210
        REDUKSJON_SB = HJELPEFELT;                                      00010220
     END;                                                               00010230
  ELSE                                                                  00010240
     REDUKSJON_SB = RETUR_SB;                                           00010250
                                                                        00010260
 END P52_EK_V;                                                          00010270
                                                                        00010280
 P53_EK_W : PROC;/*RETUR_ET,RETUR_FB,REDUKSJON_EK OG REDUKSJON_FB*/     00010290
                 /*EKTEFELLETILLEGGET REGNES SAMMEN MED FELLESBARN*/    00010300
                                                                        00010310
  IF INNTEKT_W > FRIBELØP_W          THEN                               00010320
     DO;                                                                00010330
        FRADRAG = (INNTEKT_W - FRIBELØP_W) / (12 * 2);                  00010340
        TILLEGG_FØR  = FULL_ET + BT_W;                                  00010350
        IF TILLEGG_FØR  > FRADRAG         THEN                          00010360
           DO;                                                          00010370
              HJELPEFELT = FRADRAG * FULL_ET /                          00010380
                                (FULL_ET + BT_W) + 0.5;                 00010390
              FRADRAG_ET = HJELPEFELT;                                  00010400
              RETUR_ET = FULL_ET - FRADRAG_ET;                          00010410
              RETUR_FB = BT_W - FRADRAG + FRADRAG_ET;                   00010420
           END;                                                         00010430
     END;                                                               00010440
  ELSE                                                                  00010450
     DO;                                                                00010460
        RETUR_ET = FULL_ET;                                             00010470
        RETUR_FB = BT_W;                                                00010480
     END;                                                               00010490
                                                                        00010500
  IF EK_0591 = 'J'                            THEN                      00010510
     REDUKSJON_ET = RETUR_ET;                                           00010520
                                                                        00010530
  IF TILLEGG_W > 0 THEN                                                 00010540
     DO;                                                                00010550
        HJELPEFELT   = RETUR_FB * ANT_W / TOTALT_W + 0.5;               00010560
        REDUKSJON_FB = HJELPEFELT;                                      00010570
     END;                                                               00010580
  ELSE                                                                  00010590
     REDUKSJON_FB = RETUR_FB;                                           00010600
                                                                        00010610
 END P53_EK_W;                                                          00010620
                                                                        00010630
 P54_W : PROC; /* RETUR_FB OG REDUKSJON_FB */                           00010640
               /* FELLESBARN, IKKE TILLEGG EKTEFELLE*/                  00010650
                                                                        00010660
  FRADRAG = (INNTEKT_W + INNTEKT_EK - FRIBELØP_W)/(12 * 2);             00010670
  IF FRADRAG > 0              THEN                                      00010680
     IF BT_W > FRADRAG              THEN                                00010690
        RETUR_FB = BT_W - FRADRAG;                                      00010700
     ELSE;                                                              00010710
                                                                        00010720
  ELSE RETUR_FB = BT_W;                                                 00010730
                                                                        00010740
  IF TILLEGG_W > 0 THEN                                                 00010750
     DO;                                                                00010760
        HJELPEFELT   = RETUR_FB * ANT_W / TOTALT_W + 0.5;               00010770
        REDUKSJON_FB = HJELPEFELT;                                      00010780
     END;                                                               00010790
  ELSE                                                                  00010800
     REDUKSJON_FB = RETUR_FB;                                           00010810
                                                                        00010820
 END P54_W;                                                             00010830
                                                                        00010840
 P55_V : PROC; /* RETUR_SB OG REDUKSJON_SB */                           00010850
               /* SÆRKULLSBARN */                                       00010860
                                                                        00010870
  IF INNTEKT_V > FRIBELØP_V          THEN                               00010880
     DO;                                                                00010890
        FRADRAG = (INNTEKT_V - FRIBELØP_V)/(12 * 2);                    00010900
        IF BT_V > FRADRAG              THEN                             00010910
           RETUR_SB = BT_V - FRADRAG;                                   00010920
     END;                                                               00010930
  ELSE                                                                  00010940
     RETUR_SB = BT_V;                                                   00010950
                                                                        00010960
  IF TILLEGG_V > 0 THEN                                                 00010970
     DO;                                                                00010980
        HJELPEFELT   = RETUR_SB * ANT_V / TOTALT_V + 0.5;               00010990
        REDUKSJON_SB = HJELPEFELT;                                      00011000
     END;                                                               00011010
  ELSE                                                                  00011020
     REDUKSJON_SB = RETUR_SB;                                           00011030
                                                                        00011040
 END P55_V;                                                             00011050
                                                                        00011060
 END P5_REGN_REDUKSJON;                                                 00011070
                                                                        00011080
                                                                        00011090
 /* ******************************************************** */         00011100
 /*PROSEDYRE FOR Å BEREGNE OG FORDELE GARANTITILLEGGET       */         00011110
 /*                                                          */         00011120
 /* REGNER: B02.GARANTITILLEGG_EK, B02.GARANTITILLEGG_BARN OG*/         00011130
 /*         B02.GARANTITILLEGG_SÆRBARN                      */          00011140
 /* ******************************************************** */         00011150
                                                                        00011160
 P6_GARANTITILLEGG : PROC;                                              00011170
                                                                        00011180
  GARANTITILLEGG       = GARANTI_SUM - REDUKSJONS_BELØP;                00011190
  B02.SUM_YTELSE (IND) =  B02.SUM_YTELSE(IND) + GARANTITILLEGG;         00011200
  IF ÅFT_TILLEGG > 0        THEN                                        00011210
     DO;                                                                00011220
        IF ÅFT_TILLEGG > GARANTITILLEGG    THEN                         00011230
           DO;                                                          00011240
              B02.ÅFT(IND)   = B02.ÅFT(IND) + GARANTITILLEGG;           00011250
              GARANTITILLEGG = 0;                                       00011260
           END;                                                         00011270
        ELSE                                                            00011280
           DO;                                                          00011290
              B02.ÅFT(IND)   = B02.ÅFT(IND) + ÅFT_TILLEGG;              00011300
              GARANTITILLEGG = GARANTITILLEGG - ÅFT_TILLEGG;            00011310
           END;                                                         00011320
     END;                                                               00011330
  REDUSERT_EK = GARANTI_EK - REDUKSJON_ET;                              00011340
                                                                        00011350
 /*NY BEREGNING AV FORDELING AV GARANTI - HL 25.9.92 : */               00011360
                                                                        00011370
 /* ********************************                                    00011380
  IF BARN_0591 > 0 THEN                                                 00011390
     HJELPEFELT  = GARANTI_BT * ANT_W/BARN_0591 + 0.5                   00011400
                   - REDUKSJON_FB                                       00011410
  ELSE                                                                  00011420
     HJELPEFELT = 0                                                     00011430
  REDUSERT_FB = HJELPEFELT                                              00011440
  REDUSERT_SB = GARANTI_BT - REDUKSJON_SB - REDUSERT_FB - REDUKSJON_FB  00011450
                                                                        00011460
    ************************************************* */                00011470
                                                                        00011480
  REDUSERT_FB = GARANTI_BT_W - REDUKSJON_FB;                            00011490
  REDUSERT_SB = GARANTI_BT_V - REDUKSJON_SB;                            00011500
                                                                        00011510
 /* HIT HL */                                                           00011520
                                                                        00011530
  REDUSERT_TOT = REDUSERT_EK + REDUSERT_FB + REDUSERT_SB;               00011540
  IF REDUSERT_EK > 0                  THEN                              00011550
     DO;                                                                00011560
        B02.GARANTITILLEGG_EK(IND) =                                    00011570
            GARANTITILLEGG * REDUSERT_EK/REDUSERT_TOT + 0.5;            00011580
        IF REDUSERT_FB > 0               THEN                           00011590
           IF REDUSERT_SB > 0            THEN                           00011600
              DO;                                                       00011610
                 B02.GARANTITILLEGG_BARN(IND)= GARANTITILLEGG           00011620
                  * REDUSERT_FB/REDUSERT_TOT + 0.5;                     00011630
                 B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG       00011640
                           - B02.GARANTITILLEGG_EK(IND)                 00011650
                           - B02.GARANTITILLEGG_BARN(IND);              00011660
              END;                                                      00011670
           ELSE                                                         00011680
              B02.GARANTITILLEGG_BARN(IND) = GARANTITILLEGG             00011690
                           - B02.GARANTITILLEGG_EK(IND);                00011700
        ELSE                                                            00011710
        IF REDUSERT_SB > 0 THEN                                         00011720
           B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG             00011730
                           - B02.GARANTITILLEGG_EK(IND);                00011740
     END;                                                               00011750
  ELSE                                                                  00011760
     IF REDUSERT_FB > 0               THEN                              00011770
        IF REDUSERT_SB > 0            THEN                              00011780
           DO;                                                          00011790
              B02.GARANTITILLEGG_BARN(IND)= GARANTITILLEGG              00011800
                  * REDUSERT_FB/REDUSERT_TOT + 0.5;                     00011810
              B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG          00011820
                           - B02.GARANTITILLEGG_BARN(IND);              00011830
           END;                                                         00011840
        ELSE                                                            00011850
           B02.GARANTITILLEGG_BARN(IND) = GARANTITILLEGG;               00011860
     ELSE                                                               00011870
        B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG;               00011880
                                                                        00011890
 END P6_GARANTITILLEGG;                                                 00011900
                                                                        00011910
 P99 :                                                                  00011920
                                                                        00011930
                                                                        00011940
 END FORSØRG;                                                           00011950
