 /*       SIST ENDRET 06/03-91 11.49.57 AV   DYBVIK                   */00000000
 TT_E3:                                                                 00000010
   PROC(FNR,TIL_DATO,TT_TIL_66_ÅR);                                     00000020
 /* ***************************************************************** */00000030
 /* PARAMETER INN: FNR,DØDSDATO ELLER STI                             */00000040
 /* PARAMETER UT : TT_TIL_66_ÅR                                       */00000050
 /* HVORDAN SKAL VI KALLE DENNE OPP? LEGGS INN I N805 ????            */00000060
 /* SLIK BLIR DETTE GJORT I DAG:                                      */00000070
 /* RUTINEN KALLES OPP FRA R0019909 (KONTROLL_TT), OG BEREGNER MAKS   */00000080
 /* TT FØR 1967 (MAKS_TT_FØR_1967), OG TT FRA 1966 TIL 67-ÅRS DAGEN   */00000090
 /* (TT_TIL_67_ÅR)                                                    */00000100
 /* ***************************************************************** */00000110
   DCL                                                                  00000120
      FNR              PIC'(11)9';                                      00000130
   DCL                                                                  00000140
      TIL_DATO         PIC'(4)9';                                       00000150
   DCL                                                                  00000160
      TT_TIL_66_ÅR     PIC'(4)9';                                       00000170
   DCL                                                                  00000180
      FYLT_SEKSTISEKS  PIC'(5)9';                                       00000190
   DCL                                                                  00000200
      W_FNR_MN         PIC'(2)9' DEF FNR POS(3),                        00000210
      W_FNR_ÅR         PIC'(2)9' DEF FNR POS(5),                        00000220
      W_PERSNR         PIC'(3)9' DEF FNR POS(7);                        00000230
      IF W_FNR_ÅR <  21  ! W_PERSNR < 500 THEN                          00000240
         MAKS_TT =  TIL_DATO - 37; /*TT REGNES FRA 010191 KUN FOM 1937*/00000250
      IF W_FNR_ÅR > 21 & W_PERSNR < 500 THEN                            00000260
         MAKS_TT  = TIL_DATO - W_FNR_ÅR + 66;                           00000270
      RETURN;                                                           00000280
   END TT_EP;                                                           00000290
