 /*       SIST ENDRET 31/01-97 14.00.34 AV   JDA0310                  */00000000
 /*       SIST ENDRET 20/09-93 15.25.40 AV   TRUDE                    */00000010
 /*       SIST ENDRET 23/04-93 15.32.29 AV   TRUDE                    */00000020
 /*       SIST ENDRET 22/03-93 09.18.37 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 29/04-92 14.47.09 AV   HERMAN                   */00000040
 /*       SIST ENDRET 23/03-92 14.59.10 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 03/03-92 09.52.30 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 17/02-92 13.44.16 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 13/12-91 12.21.05 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 02/10-91 13.23.10 AV   DYBVIK                   */00000090
 /*       SIST ENDRET 01/10-91 12.19.25 AV   DYBVIK                   */00000100
 /*       SIST ENDRET 14/06-91 13.25.53 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 21/05-91 14.45.50 AV   HERMAN                   */00000120
 /*       SIST ENDRET 23/04-91 18.16.36 AV   HERMAN                   */00000130
 /*       SIST ENDRET 08/04-91 12.05.21 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 29/08-90 11.01.54 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 11/12-89 14.35.30 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 01/12-89 08.39.45 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 06/10-87 10.03.17 AV   DYBVIK                   */00000180
 /*       SIST ENDRET 31/03-87 08.53.29 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 08/02-85 12.51.01 AV   OLAV                     */00000200
 /*       SIST ENDRET 01/02-85 12.27.15 AV   OLAV                     */00000210
 /*       SIST ENDRET 02/08-84 09.30.16 AV   HERMAN                   */00000220
 /*       SIST ENDRET 08/02-84 10.06.33 AV   OLAV                     */00000230
 /*       SIST ENDRET 18/11-83 09.27.49 AV   OLAV                     */00000240
 /*       SIST ENDRET 04/05-83 09.45.37 AV   OLAV                     */00000250
 /* ***************************************************************** */00000260
 /*IDENTIFIKASJON:                                                    */00000270
 /*    R0014126 - BEREGN_ETTERLATT_AP_DEL3 - INTERN PROC I PLI.       */00000280
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000290
 /*HENSIKT:                                                           */00000300
 /*    PROGRAMMET STYRER BEHANDLING AV JUSTERING MED APD OG BEREGNING */00000310
 /*    AV VENTETILLEGG.                                               */00000320
 /*    OPPDATERER : ALDERSP, ETTEPENS.TP_NETTO OG SUM_YTELSE          */00000330
 /*PROGRAMTILKNYTNING:                                                */00000340
 /*    PROGRAMMET BLIR INKLUDERT I R0014101 - BEREGN_ETTERLATT_AP.    */00000350
 /*BRUK:                                                              */00000360
 /*    CALL BEREGN_ETTERLATT_AP_DEL3;                                 */00000370
 /* ***************************************************************** */00000380
                                                                        00000390
 BEREGN_ETTERLATT_AP_DEL3: PROC;                                        00000400
                                                                        00000410
  DCL 1 B_OMR,                                                          00000420
  %INCLUDE P0019921;                                                    00000430
  DCL                                                                   00000440
    ALT1                 FIXED DEC(7),                                  00000450
    ALT2                 FIXED DEC(7),                                  00000460
    TT_AVDØD             FIXED DEC(3),                                  00000470
    FNR_ÅM                PIC'(4)9',                                    00000480
    FNR_Å                 PIC'(2)9' DEF FNR_ÅM POS(1),                  00000490
    FNR_M                 PIC'(2)9' DEF FNR_ÅM POS(3);                  00000500
                                                                        00000510
  DCL W_VT_TP_BRUTTO     FIXED DEC(5),                                  00000520
      W_VT_TP_EGEN_55    FIXED DEC(5);                                  00000530
                                                                        00000540
  DCL YRKE_TP_BRUTTO     FIXED DEC (7) INIT (0);                        00000550
  DCL YRKE_TP_EGEN_55    FIXED DEC (7) INIT (0);                        00000560
  DCL REST_GRAD          FIXED DEC (3) INIT (0);                        00000570
  DCL REST_GRAD_EK       FIXED DEC (3) INIT (0);                        00000580
  DCL YRKE_VT_TP         FIXED DEC (7) INIT (0);                        00000590
  DCL YRKE_VT_GP         FIXED DEC (7) INIT (0);                        00000600
  DCL GARANTITILLEGG     FIXED DEC (5) INIT (0);                        00000610
  DCL W_HJELP            FIXED DEC (13,4) INIT (0);                     00000620
                                                                        00000630
   DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = 0;                     00000640
   FNR_Å = FNR_R.ÅR;                                                    00000650
   FNR_M = FNR_R.MND;                                                   00000660
                                                                        00000670
   IF  B02.ALDERSP.APD(BER_SØ_IND) < 100 &          /*NY92*/            00000680
      ((W_FNR_ÅM                    < 2501    &                         00000690
       FNR_R.ÅRHUNDRE              < 5  )    !    /*TS 200292*/         00000700
      (B02.KONV_P_KODE(BER_SØ_IND)  = 'K' &         /*TS0393*/          00000710
       B02.UTTAKSDATO_ÅM(BER_SØ_IND) < 9200))  THEN  /*TS0393*/         00000720
     DO;                                                                00000730
        IF B02.ALDERSP.APD  (BER_SØ_IND)  =  0     &                    00000740
           B02.SIVILSTAND   (BER_SØ_IND) ^= 'S'       THEN              00000750
                                                                        00000760
           DO;                                                          00000770
              POREKKE    (BER_SØ_IND)     = POREKKE(14);                00000780
                                                                        00000790
              /* PLASS 14 BRUKT TIL OPPBEVARINGSOMR. DA DENNE ALLTID */ 00000800
              /* ER LEDIG PLASS FOR ALDERSP.                         */ 00000810
                                                                        00000820
              POREKKE_P67(BER_SØ_IND)     = W_POREKKE;                  00000830
                                                                        00000840
              B02.ALDERSP.SPT(BER_SØ_IND) = POREKKE.SPT (BER_SØ_IND);   00000850
              B02.ALDERSP.OPT(BER_SØ_IND) = POREKKE.OPT (BER_SØ_IND);   00000860
              B02.ALDERSP.PÅ (BER_SØ_IND) = POREKKE.PÅ  (BER_SØ_IND);   00000870
                                                                        00000880
              B02.VT_SPT(BER_SØ_IND) = POREKKE_P67.SPT (BER_SØ_IND);    00000890
              B02.VT_OPT(BER_SØ_IND) = POREKKE_P67.OPT (BER_SØ_IND);    00000900
              B02.VT_PÅ (BER_SØ_IND) = POREKKE_P67.PÅ  (BER_SØ_IND);    00000910
                                                                        00000920
              B02.POENGTILLEGG_DATO_ÅM(BER_SØ_IND) = 0;                 00000930
 /*19.3.87*/  B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';               00000940
              B02.POENGTILLEGG_DATO_ÅM(BER_EK_IND) = 0;                 00000950
 /* HL    */  B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';               00000960
           END;                                                         00000970
                                                                        00000980
       CALL JUSTER_MED_APD;                                             00000990
       B02.VT_GP     (BER_SØ_IND) = 0;                                  00001000
       B02.VT_TP     (BER_SØ_IND) = 0;                                  00001010
       B02.VT_SPT    (BER_SØ_IND) = 0;                                  00001020
       B02.VT_OPT    (BER_SØ_IND) = 0;                                  00001030
       B02.VT_PÅ     (BER_SØ_IND) = 0;                                  00001040
       B02.TT_VENT   (BER_SØ_IND) = 0;                                  00001050
       B02.VENTEFAKTOR(BER_SØ_IND) = 0;                                 00001060
     END;                                                               00001070
   ELSE                                                                 00001080
     DO;    /* APD = 100 */                                             00001090
        IF FNR_ÅM < 0302 THEN                                           00001100
           DO;                                                          00001110
              B02.VT_GP     (BER_SØ_IND) = 0;                           00001120
              B02.VT_TP     (BER_SØ_IND) = 0;                           00001130
              B02.VT_SPT    (BER_SØ_IND) = 0;                           00001140
              B02.VT_OPT    (BER_SØ_IND) = 0;                           00001150
              B02.VT_PÅ     (BER_SØ_IND) = 0;                           00001160
              B02.TT_VENT    (BER_SØ_IND) = 0;                          00001170
              B02.VENTEFAKTOR(BER_SØ_IND) = 0;                          00001180
           END;                                                         00001190
        ELSE                                                            00001200
           DO;                                                          00001210
              CALL BEREGN_VT;           /* OPPDATERER VENTEHISTORIKK */ 00001220
                                                                        00001230
              /* VI REGNER UT TT_VENT  */                               00001240
                                                                        00001250
              TT_AVDØD = B02.TT_FØR_1967 (BER_EK_IND)                   00001260
                       +(B02.TT_ETTER_1966 (BER_EK_IND)                 00001270
                       + B02.TT_FRAMT(BER_EK_IND) + 11) / 12            00001280
                       + B02.TT_67_TIL_70(BER_EK_IND);                  00001290
                                                                        00001300
                                                                        00001310
              IF TT_AVDØD > 40 THEN                                     00001320
                 TT_AVDØD = 40;                                         00001330
                                                                        00001340
              B02.TT_VENT(BER_SØ_IND) =                                 00001350
                     B02.STATUS.TT_FØR_1967  (BER_SØ_IND)               00001360
                  + (B02.STATUS.TT_ETTER_1966(BER_SØ_IND) + 11) / 12;   00001370
                                                                        00001380
              IF B02.TT_VENT(BER_SØ_IND) < 40 THEN                      00001390
                 DO;                                                    00001400
                    IF B02.TT_VENT(BER_SØ_IND) < TT_AVDØD THEN          00001410
                       B02.TT_VENT(BER_SØ_IND) = TT_AVDØD;              00001420
                 END;                                                   00001430
              ELSE                                                      00001440
                 B02.ALDERSP.TT_VENT(BER_SØ_IND) = 40;                  00001450
                                                                        00001460
 /* TILLEGG 2.8.84 HL.                                         */       00001470
                                                                        00001480
             IF B02.TT_VENT (BER_SØ_IND)                                00001490
                                < B02.TT_GARANTI(BER_SØ_IND) THEN       00001500
                B02.TT_VENT (BER_SØ_IND)                                00001510
                                = B02.TT_GARANTI(BER_SØ_IND);           00001520
                                                                        00001530
 /* HIT 2.8.                                                   */       00001540
                                                                        00001550
                /*  VT_TP */                                            00001560
                                                                        00001570
 /*ENDRET 23.9.87 HL - VENTETILLEGG SKAL REGNES AV 7-4-ALTERNATIVET*/   00001580
 /*                    NÅR DETTE ER STØRST PR 67-ÅRS-ALDER         */   00001590
 /*                    FEILRAPPORT 534                             */   00001600
                                                                        00001610
 /*YS*/                                                                 00001620
 /*YS*/  IF DIV_PARAM_OMR.BEREGNINGS_ALT_AVD  = '3'    THEN             00001630
                                                                        00001640
 /* ************************************************************** */   00001650
 /*  ALT = 3 BETYR AT PENSJON REGNET MED YP-FORDEL ER STØRST       */   00001660
 /* ************************************************************** */   00001670
                                                                        00001680
            DO;                                                         00001690
                                                                        00001700
               IF B02.YRKEPENS.PÅ(BER_EK_IND) > 0           THEN        00001710
               YRKE_TP_BRUTTO = B02.YRKEPENS.YUG(BER_EK_IND)            00001720
                                * G * B02.YRKEPENS.YPT(BER_EK_IND)      00001730
                                * 0.55 / (12 * 100)                     00001740
                   * (0.45 * (B02.YRKEPENS.PÅ(BER_EK_IND) -             00001750
                      B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND))  +           00001760
                      0.42 * B02.YRKEPENS.PÅ_ETTER91(BER_EK_IND))       00001770
                   /  B02.YRKEPENS.PÅ(BER_EK_IND) + 0.5;                00001780
               ELSE                                                     00001790
               YRKE_TP_BRUTTO = B02.YRKEPENS.YUG(BER_EK_IND)            00001800
                                * G * B02.YRKEPENS.YPT(BER_EK_IND)      00001810
                                * 0.45 * 0.55 / (12 * 100) + 0.5;       00001820
               REST_GRAD_EK = 100 - B02.YRKEPENS.YUG(BER_EK_IND);       00001830
               W_VT_TP_BRUTTO = F_TP92(FNR_EK_R.ÅR_EK,G,                00001840
                                         B02.SPT_AVD(BER_SØ_IND),       00001850
                                         B02.OPT_AVD(BER_SØ_IND),       00001860
                                         B02.PÅ_AVD(BER_SØ_IND),        00001870
                               B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND),     00001880
                                         REST_GRAD_EK,55,'J');          00001890
               W_VT_TP_BRUTTO = W_VT_TP_BRUTTO + YRKE_TP_BRUTTO;        00001900
            END;                                                        00001910
          ELSE                                                          00001920
                                                                        00001930
            W_VT_TP_BRUTTO = F_TP92(FNR_EK_R.ÅR_EK,G,                   00001940
                                         B02.SPT_AVD(BER_SØ_IND),       00001950
                                         B02.OPT_AVD(BER_SØ_IND),       00001960
                                         B02.PÅ_AVD(BER_SØ_IND),        00001970
                               B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND),     00001980
                                         100,55,'J');                   00001990
                                                                        00002000
                                                                        00002010
         IF DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4'    THEN             00002020
                                                                        00002030
 /* ************************************************************** */   00002040
 /*  ALT = 4 = EGENPENSJON MED Y-FORDELER + TP ETTER AVDØDE ER BEST*/   00002050
 /* ************************************************************** */   00002060
                                                                        00002070
            DO;                                                         00002080
                                                                        00002090
               IF B02.YRKEPENS.PÅ(BER_SØ_IND) > 0           THEN        00002100
               YRKE_TP_EGEN_55 = B02.YRKEPENS.YUG(BER_SØ_IND)           00002110
                                * G * B02.YRKEPENS.YPT(BER_SØ_IND)      00002120
                                * 0.55 / (12 * 100)                     00002130
                   * (0.45 * (B02.YRKEPENS.PÅ(BER_SØ_IND) -             00002140
                      B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND))  +           00002150
                      0.42 * B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND))       00002160
                   /  B02.YRKEPENS.PÅ(BER_SØ_IND) + 0.5;                00002170
               ELSE                                                     00002180
               YRKE_TP_EGEN_55 =  B02.YRKEPENS.YUG(BER_SØ_IND)          00002190
                                 * G * B02.YRKEPENS.YPT(BER_SØ_IND)     00002200
                                 * 0.45 * 0.55 / (12 * 100) + 0.5;      00002210
               REST_GRAD = 100 - B02.YRKEPENS.YUG(BER_SØ_IND);          00002220
               W_VT_TP_EGEN_55 = F_TP92(FNR_R.ÅR,G,                     00002230
                                    B02.VT_SPT(BER_SØ_IND),             00002240
                                    B02.VT_OPT(BER_SØ_IND),             00002250
                                    B02.VT_PÅ(BER_SØ_IND),              00002260
                               B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND),      00002270
                                    REST_GRAD,55,'J');                  00002280
               W_VT_TP_EGEN_55 = YRKE_TP_EGEN_55 + W_VT_TP_EGEN_55;     00002290
            END;                                                        00002300
         ELSE                                                           00002310
                                                                        00002320
                                                                        00002330
            W_VT_TP_EGEN_55 = F_TP92(FNR_R.ÅR,G,                        00002340
                                          B02.VT_SPT(BER_SØ_IND),       00002350
                                          B02.VT_OPT(BER_SØ_IND),       00002360
                                          B02.VT_PÅ(BER_SØ_IND),        00002370
                               B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND),      00002380
                                          100,55,'J');                  00002390
                                                                        00002400
         IF B02.TP_BRUTTO (BER_SØ_IND) = 0 THEN                         00002410
                                                                        00002420
 /* AT TP_BRUTTO = 0  INNEBÆRER AT 7-4-ALTERNATIVET ER MINST -  */      00002430
 /* DET KAN LIKEVEL VÆRE STØRRE ENN VENTEGRUNNLAGET (P67)       */      00002440
                                                                        00002450
            DO;                                                         00002460
 /*YS*/        IF DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '3'   THEN        00002470
                                                                        00002480
 /* ************************************************************** */   00002490
 /*  ALT = 3 BETYR AT PENSJON REGNET MED YP-FORDEL ER STØRST       */   00002500
 /* ************************************************************** */   00002510
                                                                        00002520
                                                                        00002530
                  DO;                                                   00002540
                                                                        00002550
               IF B02.YRKEPENS.PÅ(BER_SØ_IND) > 0           THEN        00002560
               YRKE_VT_TP      = B02.YRKEPENS.YUG(BER_SØ_IND)           00002570
                                * G * B02.YRKEPENS.YPT(BER_SØ_IND)      00002580
                                / (12 * 100)                            00002590
                   * (0.45 * (B02.YRKEPENS.PÅ(BER_SØ_IND) -             00002600
                      B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND))  +           00002610
                      0.42 * B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND))       00002620
                   /  B02.YRKEPENS.PÅ(BER_SØ_IND) + 0.5;                00002630
               ELSE                                                     00002640
                     YRKE_VT_TP = B02.YRKEPENS.YUG(BER_SØ_IND)          00002650
                                 * G * B02.YRKEPENS.YPT(BER_SØ_IND)     00002660
                                 * 0.45 / (12 * 100) + 0.5;             00002670
                                                                        00002680
                     B02.VT_TP(BER_SØ_IND) =                            00002690
                                          F_TP92(FNR_R.ÅR,G,            00002700
                                             B02.VT_SPT(BER_SØ_IND),    00002710
                                             B02.VT_OPT(BER_SØ_IND),    00002720
                                             B02.VT_PÅ(BER_SØ_IND),     00002730
                               B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND),      00002740
                                             REST_GRAD,100,'J');        00002750
                     B02.VT_TP(BER_SØ_IND) = B02.VT_TP(BER_SØ_IND)      00002760
                                            + YRKE_VT_TP;               00002770
                  END;                                                  00002780
               ELSE                                                     00002790
                                                                        00002800
                  B02.VT_TP (BER_SØ_IND) =                              00002810
                                          F_TP92(FNR_R.ÅR,G,            00002820
                                                B02.VT_SPT(BER_SØ_IND), 00002830
                                                B02.VT_OPT(BER_SØ_IND), 00002840
                                                B02.VT_PÅ (BER_SØ_IND), 00002850
                               B02.ALDERSP.PÅ_ETTER91(BER_SØ_IND),      00002860
                                                100,100,'J');           00002870
                                                                        00002880
               IF B02.VT_TP (BER_SØ_IND) < (W_VT_TP_BRUTTO              00002890
                             + W_VT_TP_EGEN_55)            THEN         00002900
                                                                        00002910
                  B02.VT_TP (BER_SØ_IND) = W_VT_TP_BRUTTO               00002920
                                        + W_VT_TP_EGEN_55;              00002930
            END;                                                        00002940
                                                                        00002950
         ELSE                                                           00002960
                                                                        00002970
            B02.VT_TP (BER_SØ_IND) = W_VT_TP_BRUTTO                     00002980
                                             + W_VT_TP_EGEN_55;         00002990
                                                                        00003000
         B02.VT_TP (BER_SØ_IND) =                                       00003010
                      B02.VT_TP (BER_SØ_IND) *                          00003020
                      B02.VENTEFAKTOR (BER_SØ_IND) / 100  + 0.5;        00003030
                                                                        00003040
 /*HIT 23.9.87 HL */                                                    00003050
                                                                        00003060
                                                                        00003070
          /* VT_GP  */                                                  00003080
                                                                        00003090
        IF DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '3'   !                  00003100
           DIV_PARAM_OMR.BEREGNINGS_ALT_EGEN = '4'   THEN               00003110
           DO;                                                          00003120
                                                                        00003130
              YRKE_VT_GP =  B02.YRKEPENS.YUG(BER_SØ_IND)  *             00003140
                            B02.VENTEFAKTOR (BER_SØ_IND)  *             00003150
                            G / (12 * 100 * 100) + 0.5;                 00003160
                                                                        00003170
              B02.VT_GP(BER_SØ_IND) = REST_GRAD  *                      00003180
                                      G * B02.TT_VENT(BER_SØ_IND) /     00003190
                                      (40 * 12 * 100) + 0.5;            00003200
              B02.VT_GP(BER_SØ_IND) = B02.VT_GP(BER_SØ_IND) *           00003210
                            B02.VENTEFAKTOR (BER_SØ_IND) / 100  + 0.5;  00003220
                                                                        00003230
              B02.VT_GP(BER_SØ_IND) = B02.VT_GP(BER_SØ_IND) +           00003240
                                      YRKE_VT_GP;                       00003250
           END;                                                         00003260
        ELSE                                                            00003270
           DO;                                                          00003280
                                                                        00003290
              B02.VT_GP(BER_SØ_IND) =                                   00003300
                                      G * B02.TT_VENT(BER_SØ_IND) /     00003310
                                      (40 * 12) + 0.5;                  00003320
                                                                        00003330
              B02.VT_GP(BER_SØ_IND) =                                   00003340
                            B02.VT_GP(BER_SØ_IND) *                     00003350
                            B02.VENTEFAKTOR (BER_SØ_IND) / 100  + 0.5;  00003360
 /*YS*/    END;                                                         00003370
                                                                        00003380
        /* VT_ST  */                                                    00003390
                                                                        00003400
              IF B02.ALDERSP.ST (BER_SØ_IND) >                          00003410
                                        B02.VT_TP (BER_SØ_IND) THEN     00003420
                 B02.ALDERSP.ST (BER_SØ_IND) =                          00003430
                   B02.ALDERSP.ST(BER_SØ_IND) - B02.VT_TP (BER_SØ_IND); 00003440
              ELSE                                                      00003450
                 B02.ALDERSP.ST = 0;                                    00003460
           END;                                                         00003470
     END;                                                               00003480
                                                                        00003490
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                    00003500
                                                                        00003510
  IF G > 34100 THEN                                                     00003520
     IF B02.ALDERSP.KT(BER_SØ_IND) > B02.ALDERSP.ST(BER_SØ_IND) THEN    00003530
        B02.ALDERSP.KT(BER_SØ_IND) =                                    00003540
        B02.ALDERSP.KT(BER_SØ_IND) - B02.ALDERSP.ST(BER_SØ_IND);        00003550
     ELSE                                                               00003560
        B02.ALDERSP.KT(BER_SØ_IND) = 0;                                 00003570
                                                                        00003580
                   /*----------------------------------*/               00003590
                   /*DERSOM IKKE GP, SKAL HELLER IKKE  */               00003600
                   /*HA VENTETILLEGG TIL GP. TRUDE10.91*/               00003610
                   /*----------------------------------*/               00003620
                                                             /*NY92*/   00003630
     DCL SUM_EP_TP FIXED DEC(5);                           /*NY92*/     00003640
                                                             /*NY92*/   00003650
     IF B02.GT_LOV92(BER_SØ_IND) >  0       !                           00003660
        B02.GT_LOV92(BER_EK_IND) >  0         THEN                      00003670
        CALL BEREGN_GTLOV92_AE;                                         00003680
                                                             /*NY92*/   00003690
     IF (W_FNR_ÅM        > 2412    &                          /*NY92*/  00003700
         FNR_R.ÅRHUNDRE  < 5       &                          /*NY92*/  00003710
         B02.KONV_P_KODE(BER_SØ_IND) ^= 'K') !              /*TS0393*/  00003720
        (W_FNR_ÅM        > 2412    &                          /*NY92*/  00003730
         FNR_R.ÅRHUNDRE  < 5       &                          /*NY92*/  00003740
         B02.KONV_P_KODE(BER_SØ_IND)  = 'K' &               /*TS0393*/  00003750
         B02.UTTAKSDATO_ÅM(BER_SØ_IND) > 9200)   THEN       /*TS0393*/  00003760
        DO;                                                  /*NY92*/   00003770
          DCL W_KOMP  FIXED DEC (3);                         /*NY92*/   00003780
                                                             /*NY92*/   00003790
          W_KOMP   = B02.ALDERSP.KT(BER_SØ_IND);             /*NY92*/   00003800
          IF B02.VIRK_DATO_ÅM(BER_SØ_IND) > 9700     THEN               00003810
             CALL JUSTER_AP_40PROS;                                     00003820
          ELSE                                                          00003830
             CALL JUSTER_MED_FORVENTET_INNTEKT_AP(B02.ALDERSP.KT        00003840
                                              (BER_SØ_IND)); /*NY92*/   00003850
          CALL JUSTER_AE_MED_F(W_KOMP,AP_TEI);               /*NY92*/   00003860
                                                             /*NY92*/   00003870
        END;                                                 /*NY92*/   00003880
     ELSE                                                    /*NY92*/   00003890
       DO;                                                   /*NY92*/   00003900
         B_OMR = B02;                                                   00003910
         DCL TEST_TP_NETTO   FIXED DEC (5) INIT (0),                    00003920
             TEST_TP_BRUTTO  FIXED DEC (5) INIT (0),                    00003930
             TEST_GTLOV      FIXED DEC (5) INIT (0);                    00003940
         TEST_TP_NETTO  =     B02.TP_NETTO (BER_SØ_IND);                00003950
         TEST_TP_BRUTTO =     B02.TP_BRUTTO (BER_SØ_IND);               00003960
         TEST_GTLOV     =     B02.GT_LOV92 (BER_SØ_IND);                00003970
                                                                        00003980
                                                                        00003990
         B02.TP_NETTO (BER_SØ_IND)      = B02.TP_BRUTTO (BER_SØ_IND);   00004000
         B02.ALDERSP.AP_GP_NETTO(BER_SØ_IND) = B02.ALDERSP.GP           00004010
                                                      (BER_SØ_IND);     00004020
         B02.ALDERSP.AP_TP_NETTO(BER_SØ_IND) = B02.ALDERSP.TP           00004030
                                                      (BER_SØ_IND);     00004040
         IF B02.GT_LOV92(BER_SØ_IND) > (B02.AP_TP_NETTO(BER_SØ_IND) +   00004050
                               B02.TP_NETTO(BER_SØ_IND)             +   00004060
                               B02.ALDERSP.ST(BER_SØ_IND))    THEN      00004070
            DO;                                                         00004080
               IF B02.VENTEFAKTOR(BER_SØ_IND) > 0      &                00004090
                  B02.TP_NETTO(BER_SØ_IND)    > 0      THEN             00004100
                  DO;                                                   00004110
                    W_HJELP = (GAR92_AVD - B02.TP_BRUTTO(BER_SØ_IND))   00004120
                         *  B02.VENTEFAKTOR(BER_SØ_IND)/100;            00004130
                    B02.GT_LOV92(BER_SØ_IND) = W_HJELP + 0.5            00004140
                                    +  B02.GT_LOV92(BER_SØ_IND);        00004150
                  END;                                                  00004160
               B02.GT_TILLEGG_LOV92(BER_SØ_IND) =                       00004170
                                B02.GT_LOV92(BER_SØ_IND)                00004180
                             - (B02.AP_TP_NETTO(BER_SØ_IND) +           00004190
                                B02.ALDERSP.ST(BER_SØ_IND)  +           00004200
                                B02.TP_NETTO(BER_SØ_IND));              00004210
            END;                                                        00004220
         ELSE                                                           00004230
            DO;                                                         00004240
               B02.GT_LOV92(BER_SØ_IND) = 0;                            00004250
               B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                    00004260
            END;                                                        00004270
       END;                                                  /*NY92*/   00004280
                                                             /*NY92*/   00004290
     IF B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0       THEN                 00004300
        DO;                                                             00004310
           B02.GT_LOV92(BER_SØ_IND)         = 0;                        00004320
           B02.GT_LOV92(BER_EK_IND)         = 0;                        00004330
        END;                                                            00004340
                                                                        00004350
     IF B02.IKKE_GP(BER_SØ_IND)  = 'J'    THEN                          00004360
        B02.ALDERSP.VT_GP(BER_SØ_IND)  = 0 ;                            00004370
                                                                        00004380
                                                                        00004390
  /* B02.STATUS.SUM_YTELSE(BER_SØ_IND) =                                00004400
                                    B02.ALDERSP.GP    (BER_SØ_IND) +    00004410
                                    B02.ALDERSP.ST    (BER_SØ_IND) +    00004420
                                    B02.ALDERSP.BT    (BER_SØ_IND) +    00004430
                                    B02.ALDERSP.KT    (BER_SØ_IND) +    00004440
                                    B02.ALDERSP.TP    (BER_SØ_IND) +    00004450
                                    B02.ALDERSP.VT_GP (BER_SØ_IND) +    00004460
                                    B02.ALDERSP.VT_TP (BER_SØ_IND) +    00004470
                                    B02.TP_BRUTTO (BER_SØ_IND);         00004480
    ******* */                                                          00004490
                                                                        00004500
     IF B02.GARANTI_TP(BER_SØ_IND) > 0            THEN                  00004510
        IF (G > 34100)                       !                          00004520
           ((G = 34100) & (TRANSTYPE ^= 27))      THEN                  00004530
        DO;                                                             00004540
          IF B02.TP_BRUTTO(SØKER_IND) = 0 THEN                          00004550
             GARANTITILLEGG    = B02.GARANTI_TP(BER_SØ_IND)             00004560
                              -  (B02.ALDERSP.ST    (BER_SØ_IND) +      00004570
                                  B02.ALDERSP.TP    (BER_SØ_IND) +      00004580
                                  B02.ALDERSP.VT_TP (BER_SØ_IND) ) ;    00004590
          ELSE                                                          00004600
          DO;                                                           00004610
             ALT1   = B02.GARANTI_TP(BER_SØ_IND) * 0.55 + 0.5           00004620
              - B02.ALDERSP.TP(BER_SØ_IND)                              00004630
              - (B02.ALDERSP.VT_TP(BER_SØ_IND) -                        00004640
                    (B02.TP_BRUTTO (BER_SØ_IND) *                       00004650
                     B02.VENTEFAKTOR(BER_SØ_IND) / 100));               00004660
             ALT2   = B02.GARANTI_TP(BER_SØ_IND)                        00004670
                      -  (B02.ALDERSP.ST    (BER_SØ_IND) +              00004680
                          B02.ALDERSP.TP    (BER_SØ_IND) +              00004690
                          B02.ALDERSP.VT_TP (BER_SØ_IND) +              00004700
                          B02.TP_BRUTTO     (BER_SØ_IND) ) ;            00004710
             IF ALT1 > ALT2 THEN                                        00004720
                GARANTITILLEGG = ALT1;                                  00004730
             ELSE                                                       00004740
                GARANTITILLEGG = ALT2;                                  00004750
          END;                                                          00004760
          IF GARANTITILLEGG > 0        THEN                             00004770
             DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) =              00004780
                           GARANTITILLEGG;                              00004790
          ELSE                                                          00004800
            DO;                                                         00004810
             B02.GARANTI_TP(BER_SØ_IND) = 0;                            00004820
             GARANTITILLEGG             = 0; /*GARANTITILL. BLIR LAGT */00004830
            END;                             /*TIL SUM YTELSE,SELV OM*/ 00004840
        END;                                /*NEGATIVT TALL. TRUDE0993*/00004850
                                                                        00004860
    /*NY92: */                                                          00004870
     B02.STATUS.SUM_YTELSE(BER_SØ_IND) =                                00004880
                                 B02.ALDERSP.AP_GP_NETTO(BER_SØ_IND) +  00004890
                                 B02.ALDERSP.ST(BER_SØ_IND) +           00004900
                                 B02.ALDERSP.BT(BER_SØ_IND) +           00004910
                                 B02.ALDERSP.KT(BER_SØ_IND) +           00004920
                                 B02.ALDERSP.AP_TP_NETTO(BER_SØ_IND) +  00004930
                                 B02.ALDERSP.VT_GP (BER_SØ_IND) +       00004940
                                 B02.ALDERSP.VT_TP (BER_SØ_IND) +       00004950
                              B02.GT_TILLEGG_LOV92 (BER_SØ_IND) +       00004960
                                 GARANTITILLEGG                 +       00004970
                                 B02.TP_NETTO (BER_SØ_IND);             00004980
                                                                        00004990
     B02.GP_NETTO (BER_SØ_IND)       = 0;                               00005000
     B02.GP_BRUTTO (BER_SØ_IND)      = 0;                               00005010
     B02.ETTEPENS.ST    (BER_SØ_IND) = 0;                               00005020
     B02.ETTEPENS.KT    (BER_SØ_IND) = 0;                               00005030
                                                                        00005040
 END BEREGN_ETTERLATT_AP_DEL3;                                          00005050
