 /*       SIST ENDRET 29/08-97 12.29.57 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/08-97 08.53.50 AV   SPA7339                  */00000010
 /*       SIST ENDRET 20/01-93 10.22.13 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 01/10-92 11.11.41 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 20/10-89 13.55.49 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 16/10-89 13.05.49 AV   DYBVIK                   */00000050
 /* ***************************************************************** */00000060
 /*               R 0 0 1 1 8 3 1                                     */00000070
 /* ***************************************************************** */00000080
 /*IDENTIFIKASJON:                                                    */00000090
 /* **********************                                            */00000100
 /*  PROGRAM-IDENT : R0011831 - KONTROLL AV BLANKETT FOR  UFØRETIDS-  */00000110
 /*                             PUNKT FOR PERSONER FØDT 1923 TIL 1944 */00000120
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000130
 /*  PROGRAMMERER  : TRUDE                                            */00000140
 /*  PROGRAMMET BLE LAGET  I JUNI 1989                                */00000150
 /*  ENDRINGERSDATO :                                                 */00000160
 /*  ENDRINGEN GJELDER:                                               */00000170
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 /*HENSIKT:                                                           */00000210
 /* **********                                                        */00000220
 /*  PROGRAMMET KONTROLLERER BLANKETT .                               */00000230
 /*  BLANKETTEN KONTROLLERES ISOLERT - IKKE MOT STATUS.               */00000240
 /*  OPERATØREN KAN BRUKE PF_TASENE:                                  */00000250
 /*    PF_2 FØRER TIL AT TRANSAKSJONEN FORKASTES                      */00000260
 /*    I BEGGE DISSE TILFELLENE SKRIVES DET UT MELDING PÅ SKJERMEN    */00000270
 /*    OG PROGRAM R0010401 SØRGER FOR Å LEGGE UT NYTT BILDE FOR       */00000280
 /*    REGISRERING AV NYTT UFØRETIDSPUNKT. TRANSKODE=R183             */00000290
 /*  NÅR INGEN MMIL FINNES, SETTES TRANSKODE = R041 OG DET RETURNERES */00000300
 /*  TIL R0010401.                                                    */00000310
 /* ***************************************************************** */00000320
 /*PROGRAMTILKNYTTING:                                                */00000330
 /* ********************                                              */00000340
 /*  PROGRAMMETS TRANSKODER ER:                                       */00000350
 /*  PROGRAMMET KALLES FRA R0010401 - REGISTRERING MED TRANSKODE      */00000360
 /*  R183:                                                            */00000370
 /*    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);         */00000380
 /*  PROGRAMMET HAR EXEC CICS XCTL TIL:                               */00000390
 /*    R0010301 - VALG AV FUNKSJON                                    */00000400
 /*    R0010401 - REGISTRERING                                        */00000410
 /*  PROGRAMMET INCLUDERER:                                           */00000420
 /*    R0011833 - KONTROLL_UF_SØKER                                     00000430
 /*    R0019902 - FINNE KJØNN                                         */00000440
 /*    R0019904 - FØDSELSNUMMERKONTROLL                               */00000450
 /*    R0019905 - BEREGN_ALDER                                        */00000460
 /*    R0019909 - KONTROLL TRYGDETID                                  */00000470
 /*    R0019910 - NUMERISK KONTROLL                                   */00000480
 /*    R0019911 - DATO KONTROLL                                       */00000490
 /*    R0019944 - SKRIV FEIL                                          */00000500
 /*  PROGRAMMET BRUKER FØLGENDE MAPSET:                               */00000510
 /*    S001833:                                                       */00000520
 /*      MAP - S001831 - REGISTRERINGSBILDE GRUNNBLANKETT-UNGE_UFØRE_ */00000530
 /*                                                      FØR_1967     */00000540
 /* ***************************************************************** */00000550
 /*DATASETTOPPLYSNINGER:                                              */00000560
 /* ***********************                                           */00000570
 /*  FØDSELSNUMMERENDRINGSREGISERET BLIR LEST I SUBPROGRAM R0011833   */00000580
 /*  VED CALL TIL R0019906.                                           */00000590
 /* ***************************************************************** */00000600
 /*FEILMELDINGER:                                                     */00000610
 /* *******************                                               */00000620
 /*  BLIR SKREVET UT PÅ SKJERMBILDET FOR UF-BLANKETT  AV              */00000630
 /*  PROSEDYRE SKRIV_FEIL I R0019944.                                 */00000640
 /*                                                                   */00000650
 /* ***************************************************************** */00000660
  R00118:                                                               00000670
    PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                 00000680
  %PAGE;                                                                00000690
  %INCLUDE S00183;    /*  UF-MAPSETTET   */                             00000700
  %PAGE;                                                                00000710
  %INCLUDE P0011831;  /*  TRANS_OMR  UNGE_UFØRE_FØR_1967*/              00000720
  %PAGE;                                                                00000730
  %INCLUDE P0019906;  /*  TRANS_OPPL_OMRÅDE (BASED)             */      00000740
  %PAGE;                                                                00000750
  %INCLUDE P0019908;  /*  COMMAREA     (BASED)           */             00000760
  %PAGE;                                                                00000770
  %INCLUDE P0019910;  /*  STYRINGS_OMRÅDE (BASED)           */          00000780
  %PAGE;                                                                00000790
  %INCLUDE P0019912;  /*  DIV-PARAM_OMRÅDE (BASED)          */          00000800
  %PAGE;                                                                00000810
  %INCLUDE DFHBMSCA;                                                    00000820
  %PAGE;                                                                00000830
    DCL                                                                 00000840
       (BMSMAPBR,COMMAREA_PEKER) PTR;                                   00000850
    DCL PLIXOPT CHAR(13) VAR STATIC EXTERNAL INIT(                      00000860
                                                'NOSPIE NOSTAE');       00000870
    DCL                                                                 00000880
       (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR,DATE) BUILTIN;            00000890
    DCL                                                                 00000900
       FEIL_FUNNET     BIT (1),                                         00000910
       FEIL_I_SØKER    BIT (1),                                         00000920
       FEIL_I_SPES     BIT (1),                                         00000930
       ONKODE PIC'9999',                                                00000940
       CURSOR_POS FIXED BIN(15) INIT(-1),                               00000950
       ONK DEF ONKODE CHAR(4),                                          00000960
       FEILKODE       CHAR(4),                                          00000970
       DSNAVN         CHAR(8),                                          00000980
       DATO           PIC '(6)9',                                       00000990
       ANT_FEIL_SKREVET FIXED DEC (3);                                  00001000
     DCL ALDER_UF   FIXED DEC (5) INIT (0);                             00001010
  %PAGE;                                                                00001020
                                                                        00001030
 FEILKODE  = 'FEIL';                                                    00001040
 DSNAVN     = '        ';                                               00001050
                                                                        00001060
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00001070
 EXEC CICS HANDLE AID PF2(PF2);                                         00001080
                                                                        00001090
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00001100
 DATO = DATE;                                                           00001110
                                                                        00001120
 IF FRA_CICS THEN                                                       00001130
  DO;                                                                   00001140
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00001150
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00001160
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00001170
  END;                                                                  00001180
                                                                        00001190
                                                                        00001200
 IF HENT_FRAM_MAP  THEN                                                 00001210
   DO;                                                                  00001220
     /* SKJERMBILDE GRUNNBLANKETT-UF */                                 00001230
     EXEC CICS SEND MAP('S001831') MAPSET('S001833') MAPONLY            00001240
                                                         SET (BMSMAPBR);00001250
     ALLOCATE S001831O;                                                 00001260
     S001831O.REGDATOO        =  DATO;                                  00001270
   END;                                                                 00001280
                                                                        00001290
 RECEIVE_MAP:                                                           00001300
                                                                        00001310
 IF ^HENT_FRAM_MAP  THEN                                                00001320
    DO;                                                                 00001330
          EXEC CICS RECEIVE MAP('S001831')                              00001340
                                    MAPSET('S001833') SET(BMSMAPBR);    00001350
       CALL BLANK_UF_MELDNR;                                            00001360
       FEIL_MELD_NR = 0;                                                00001370
    END;                                                                00001380
                                                                        00001390
 IF FUNKSJONSKODEL > 0 THEN                                             00001400
    DO;                                                                 00001410
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00001420
                                                                        00001430
             /* KONTROLLEN TILBAKE TIL R001030 - VALG AV FUNKSJON */    00001440
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00001450
    END;                                                                00001460
                                                                        00001470
 IF STYRE_KODEL > 0 THEN                                                00001480
    DO;                                                                 00001490
       STYREKODE = STYRE_KODEI;                                         00001500
       TRANSKODE = 'R041';                                              00001510
                                                                        00001520
             /* KONTROLLEN TILBAKE TIL R0010401 - REGISTRERING */       00001530
                                                                        00001540
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00001550
    END;                                                                00001560
                                                                        00001570
                                                                        00001580
 IF STYREKODE ^= 'UF'  &  FRA_CICS THEN                                 00001590
    TRANSKODE = 'R041';                                                 00001600
 ELSE                                                                   00001610
  DO;                                                                   00001620
                                                                        00001630
   TRANS_RETURKODE  = TRANSKODE;                                        00001640
   ANT_FEIL_SKREVET = 0;                                                00001650
   FEIL_FUNNET      = '0'B;                                             00001660
   FEIL_I_SØKER     = '0'B;                                             00001670
                                                                        00001680
   SELECT (TRANSKODE);                                                  00001690
     WHEN('R183')                                                       00001700
        DO;                                                             00001710
      /*   CALL BLANK_UF_SØKER;   */                                    00001720
           CALL BLANK_UF_MELDNR;                                        00001730
           CALL OVERFØR_MAP_TIL_SØKER;                                  00001740
           CALL KONTROLL_UF_SØKER(FEIL_I_SØKER);                        00001750
           TRANS_OPPL_OMR.FØDSNUMMER             = UFS.FNR;             00001760
           ALDER_UF   = F_ALDER(UFS.FNR,UFS.UFT_MÅ);  /*TS0992*/        00001770
           IF ALDER_UF   > 2400 THEN                                    00001780
              TRANS_OPPL_OMR.VIRKNINGSDATO    = 0797; /*HL0897*/        00001790
           ELSE                                                         00001800
           IF ALDER_UF   > 2200 THEN                                    00001810
              TRANS_OPPL_OMR.VIRKNINGSDATO    = 0592; /*TS0992*/        00001820
           ELSE                                                         00001830
              TRANS_OPPL_OMR.VIRKNINGSDATO    = 0789; /*TS0992*/        00001840
               /* TIL HIT TS 0992*/                                     00001850
        /* TRANS_OPPL_OMR.VIRKNINGSDATO          = 0789; */             00001860
        END;                                                            00001870
     OTHERWISE;                                                         00001880
        /*INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001890
    END;  /*END SELECT */                                               00001900
                                                                        00001910
                                                                        00001920
     IF FEIL_I_SØKER = '0'B  THEN                                       00001930
        FEIL_FUNNET = '0'B;                                             00001940
     ELSE                                                               00001950
        FEIL_FUNNET = '1'B;                                             00001960
                                                                        00001970
                                                                        00001980
                                                                        00001990
  IF FEIL_FUNNET ! HENT_FRAM_MAP !                                      00002000
     FRA_UTEN_DIALOG ! TRANS_RETURKODE ^= TRANSKODE THEN                00002010
     DO;                                                                00002020
        CALL BLANK_MAP_MELDING;                                         00002030
        CALL OVERFØR_SØKER_TIL_MAP;                                     00002040
                                                                        00002050
        IF HENT_FRAM_MAP THEN                                           00002060
            EXEC CICS SEND MAP('S001831') MAPSET('S001833')             00002070
                                        ERASE CURSOR;                   00002080
        ELSE                                                            00002090
            EXEC CICS SEND MAP('S001831') MAPSET('S001833') ERASEAUP    00002100
                                                     DATAONLY CURSOR;   00002110
        HENT_FRAM_MAP = '0'B;                                           00002120
        FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */               00002130
                                                                        00002140
        IF  FRA_CICS THEN                                               00002150
          EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);        00002160
        ELSE                                                            00002170
          GOTO RECEIVE_MAP;                                             00002180
     END;                                                               00002190
  ELSE                                                                  00002200
     DO;                                                                00002210
          IF TRANSKODE = 'R183' THEN                                    00002220
             TRANS_RETURKODE = 'R183';                                  00002230
          ELSE                                                          00002240
             TRANS_RETURKODE = TRANSKODE;                               00002250
          IF FRA_CICS  THEN                                             00002260
             DO;                                                        00002270
                BLANKETTYPE = STYREKODE;                                00002280
                TRANSKODE = 'R042';                                     00002290
             END;                                                       00002300
      END;                                                              00002310
   END;                                                                 00002320
   CALL UTGANG;                                                         00002330
                                                                        00002340
  BLANK_UF_SØKER: PROC;                                                 00002350
                                                                        00002360
           UFS.FNR            =  0;                                     00002370
           UFS.FNR_GML        =  0;                                     00002380
           UFS.UFT_MÅ         =  0;                                     00002390
  END BLANK_UF_SØKER;                                                   00002400
                                                                        00002410
                                                                        00002420
  BLANK_UF_MELDNR: PROC;                                                00002430
                                                                        00002440
           UFS.REGDATONR      =  0;                                     00002450
           UFS.TERMIDNR       =  0;                                     00002460
           UFS.FNRNR          =  0;                                     00002470
           UFS.UFT_MÅNR       =  0;                                     00002480
  END BLANK_UF_MELDNR;                                                  00002490
                                                                        00002500
  BLANK_MAP_MELDING: PROC;                                              00002510
                                                                        00002520
      DCL                                                               00002530
        LOW BUILTIN;                                                    00002540
                                                                        00002550
        S001831O.MELDING1O    = (78)' ';                                00002560
        S001831O.MELDING2O    = (78)' ';                                00002570
        S001831O.MELDING3O    = (78)' ';                                00002580
        S001831O.MELDING4O    = (78)' ';                                00002590
        S001831O.MELDING5O    = (78)' ';                                00002600
        S001831O.MELDING6O    = (78)' ';                                00002610
   END BLANK_MAP_MELDING;                                               00002620
                                                                        00002630
                                                                        00002640
                                                                        00002650
  OVERFØR_SØKER_TIL_MAP: PROC;                                          00002660
                                                                        00002670
 /*  S001831O.REGDATOO        =  F_FELT_PIC_CHAR6(UFS.REGDATO); */      00002680
     S001831O.REGDATOO        =  DATO;                                  00002690
     S001831O.TERMIDO         =  EIBTRNID;                              00002700
     S001831O.FNRO            =  F_FELT_PIC_CHAR11(UFS.FNR);            00002710
     S001831O.UFMÅO           =  F_FELT_PIC_CHAR4(UFS.UFT_MÅ);          00002720
                                                                        00002730
     /* FEILMELDINGER MARKERING AV FELT(ATTRIBUTTENE)  */               00002740
     S001831O.DUMMYA            = '_';                                  00002750
                                                                        00002760
     /*DERSOM FEIL FRA BEHANDLE-TRANS OVERFØRES FEIL HER, ...... */     00002770
     IF ^ FRA_CICS   THEN                                               00002780
        DO;                                                             00002790
           IF FEIL_MELD_NR > 0  THEN                                    00002800
              CALL SKRIV_FEIL(FEIL_MELD_NR);                            00002810
              FEIL_MELD_NR   = 0;                                       00002820
        END;                                                            00002830
     S001831O.REGDATOA        = DFHBMASK;                               00002840
     S001831O.TERMIDA         = DFHBMASK;                               00002850
                                                                        00002860
     IF UFS.FNRNR    =  0 THEN                                          00002870
        S001831O.FNRA = DFHBMUNN;                                       00002880
     ELSE                                                               00002890
        DO;                                                             00002900
           S001831O.FNRA  = DFHUNINT;                                   00002910
           S001831I.FNRL  = CURSOR_POS;                                 00002920
           IF UFS.FNRNR  ^= 999 THEN                                    00002930
              CALL SKRIV_FEIL(UFS.FNRNR);                               00002940
        END;                                                            00002950
                                                                        00002960
     IF UFS.UFT_MÅNR    =  0 THEN                                       00002970
        S001831O.UFMÅA  = DFHBMUNN;                                     00002980
     ELSE                                                               00002990
        DO;                                                             00003000
           S001831O.UFMÅA  = DFHUNINT;                                  00003010
           S001831I.UFMÅL  = CURSOR_POS;                                00003020
           IF UFS.UFT_MÅNR ^= 999 THEN                                  00003030
              CALL SKRIV_FEIL(UFS.UFT_MÅNR);                            00003040
        END;                                                            00003050
  END OVERFØR_SØKER_TIL_MAP;                                            00003060
                                                                        00003070
  OVERFØR_MAP_TIL_SØKER: PROC;                                          00003080
                                                                        00003090
      IF S001831I.FNRL       > 0  THEN                                  00003100
         UFS.FNR             = S001831I.FNRI ;                          00003110
      IF S001831I.UFMÅL      > 0  THEN                                  00003120
         UFS.UFT_MÅ          =  S001831I.UFMÅI;                         00003130
  END OVERFØR_MAP_TIL_SØKER;                                            00003140
                                                                        00003150
                                                                        00003160
                                                                        00003170
                                                                        00003180
                                                                        00003190
                                                                        00003200
                                                                        00003210
  UTGANG: PROC;                                                         00003220
    IF  FRA_CICS THEN                                                   00003230
        EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);           00003240
    ELSE                                                                00003250
        EXEC CICS RETURN;                                               00003260
  END UTGANG;                                                           00003270
                                                                        00003280
  FEILBEH:                                                              00003290
                                                                        00003300
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00003310
                                                                        00003320
     PROGRAM_ID = 'R0011831';                                           00003330
                                                                        00003340
     ALLOCATE S001831O;                                                 00003350
                                                                        00003360
     S001831O.MELDING2O =                                               00003370
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00003380
                                                                        00003390
     S001831O.MELDING3O =                                               00003400
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00003410
                                                                        00003420
     S001831O.MELDING4O =                                               00003430
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00003440
                                         !! '. DATASETT : ' !! DSNAVN;  00003450
                                                                        00003460
     S001831O.MELDING5O =                                               00003470
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00003480
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00003490
                                                                        00003500
     S001831O.MELDING6O =                                               00003510
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00003520
                                                                        00003530
                                                                        00003540
     EXEC CICS SEND MAP('S001831')                                      00003550
                                                 MAPSET('S001833');     00003560
                                                                        00003570
     EXEC CICS RECEIVE MAP('S001831')                                   00003580
                                    MAPSET('S001833') SET(BMSMAPBR);    00003590
                                                                        00003600
                                                                        00003610
     EXEC CICS SYNCPOINT ROLLBACK;                                      00003620
                                                                        00003630
                                                                        00003640
     TERMINERINGS_IND = 'F';                                            00003650
                                                                        00003660
     TRANSKODE  = 'R041';                                               00003670
                                                                        00003680
     CALL UTGANG;                                                       00003690
                                                                        00003700
  ABEND:                                                                00003710
     EXEC CICS ABEND ABCODE(FEIL);                                      00003720
                                                                        00003730
                                                                        00003740
  PF2:                                                                  00003750
     TERMINERINGS_IND   = 'F';                                          00003760
                                                                        00003770
     S001831O.MELDING6O =                                               00003780
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003790
                                                                        00003800
     EXEC CICS SEND MAP('S001831') MAPSET('S001833')                    00003810
                                                  DATAONLY;             00003820
     /* DUMMY SEND-KALL.                              */                00003830
                                                                        00003840
     EXEC CICS SEND MAP('S001831')                                      00003850
                           MAPSET('S001833');                           00003860
                                                                        00003870
     EXEC CICS DELAY INTERVAL(005);                                     00003880
                                                                        00003890
                                                                        00003900
     TRANSKODE = 'R183';                                                00003910
     CALL UTGANG;                                                       00003920
                                                                        00003930
  %PAGE;                                                                00003940
       %INCLUDE R0011833;               /*KONTROLL UF SØKER*/           00003950
  %PAGE;                                                                00003960
       %INCLUDE R0019902;               /*  FINNE KJØNN     */          00003970
  %PAGE;                                                                00003980
       %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */     00003990
  %PAGE;                                                                00004000
       %INCLUDE R0019905;               /* BEREGNER ALDER */            00004010
  %PAGE;                                                                00004020
       %INCLUDE R0019910;               /* NUMERISK KONTROLL */         00004030
  %PAGE;                                                                00004040
       %INCLUDE R0019911;               /*  DATO KONTROLL  */           00004050
 %PAGE;                                                                 00004060
      %INCLUDE R0019913;               /* F_SNU_DATO                */  00004070
  %PAGE;                                                                00004080
       %INCLUDE R0019944;               /* SKRIV_FEIL       */          00004090
  %PAGE;                                                                00004100
       %INCLUDE R0019912;/* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */ 00004110
    END R00118;                                                         00004120
                                                                        00004130
