 /*       SIST ENDRET 27/10-88 09.01.42 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 16/05-88 12.32.35 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 28/10-87 14.57.44 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 19/05-87 10.34.57 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 29/09-86 10.10.21 AV   DYBVIK                   */00000040
                                                                        00000050
                                                                        00000060
 /* ***************************************************************** */00000070
 /*                                                                   */00000080
 /*  PROGRAMMET ENDRER NAVN TIL EN PERSON SOM HAR INNTEKT.            */00000090
 /*                                                                   */00000100
 /*  FNR FÅES FRA R001I101.                                           */00000110
 /*                                                                   */00000120
 /*                                                                   */00000130
 /*  PROGRAMMERER ROLF FARVIK, JUN 1986.                              */00000140
 /* ***************************************************************** */00000150
 /* ***************************************************************** */00000160
                                                                        00000170
 R001I70:                                                               00000180
   PROC (INTERN_KOM_PTR) OPTIONS(MAIN);                                 00000190
                                                                        00000200
 %PAGE;                                                                 00000210
      %INCLUDE S001I1;     /*  INNTEKTMAPSET1    (BASED) */             00000220
                                                                        00000230
 %PAGE;                                                                 00000240
      %INCLUDE S001I3;     /*  INNTEKTMAPSET3    (BASED) */             00000250
                                                                        00000260
 %PAGE;                                                                 00000270
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */            00000280
 %PAGE;                                                                 00000290
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                    00000300
 %PAGE;                                                                 00000310
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */               00000320
 %PAGE;                                                                 00000330
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */              00000340
 %PAGE;                                                                 00000350
 %SKIP(1);                                                              00000360
   DCL                                                                  00000370
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00000380
       1  FEIL_STRUC,                                                   00000390
          2  FEIL_NR               FIXED DEC(5),                        00000400
          2  FEIL_MELDING          CHAR     (78),                       00000410
          2  KOM_OMR_PEKER         POINTER;                             00000420
    %PAGE;                                                              00000430
    /* ************************************************************** */00000440
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000450
    /* ************************************************************** */00000460
                                                                        00000470
       DCL                                                              00000480
         ( ADDR , CSTG , LOW , STG , SUBSTR , ONCODE , NULL )  BUILTIN; 00000490
                                                                        00000500
       DCL                                                              00000510
           PLITDLI      ENTRY,                                          00000520
           BMSMAPBR     PTR  ;                                          00000530
                                                                        00000540
    /* ************************************************************** */00000550
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000560
    /* ************************************************************** */00000570
                                                                        00000580
    %INCLUDE DLIUIB;                                                    00000590
                                                                        00000600
       DCL                                                              00000610
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000620
                                                                        00000630
       DCL                                                              00000640
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )       00000650
                                               POINTER;                 00000660
                                                                        00000670
                                                                        00000680
       DCL W01_IO                CHAR(150);                             00000690
                                                                        00000700
                                                                        00000710
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);           00000720
                                                                        00000730
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                   00000740
                                                                        00000750
       DCL 1 FNR_REG,                                                   00000760
             2 FNR1              FIXED DEC (11),                        00000770
             2 FNR2              FIXED DEC (11),                        00000780
             2 BRUKERID          CHAR      ( 4);                        00000790
                                                                        00000800
                                                                        00000810
                                                                        00000820
    /* ************************************************************** */00000830
    /*                                                                */00000840
    /*   ROT-SEGMENTET                                                */00000850
    /*                                                                */00000860
    /* ************************************************************** */00000870
                                                                        00000880
       DCL 1  RF0PERSN                UNALIGNED,                        00000890
       %INCLUDE P0019927;                                               00000900
                                                                        00000910
                                                                        00000920
    /* ************************************************************** */00000930
    /*                                                                */00000940
    /*   INNTEKT-SEGMENTET                                            */00000950
    /*                                                                */00000960
    /* ************************************************************** */00000970
                                                                        00000980
       DCL 1  W01_PINT               UNALIGNED,                         00000990
       %INCLUDE P0019928;                                               00001000
                                                                        00001010
                                                                        00001020
                                                                        00001030
       DCL INTERN_KOM_PTR        POINTER;                               00001040
                                                                        00001050
       DCL 1 INTERN_KOM_OMR  BASED (INTERN_KOM_PTR),                    00001060
             2 HOVED_KOM_PTR        POINTER,                            00001070
             2 FRA_FNR              PIC '(11)9',                        00001080
             2 TIL_FNR              PIC '(11)9';                        00001090
                                                                        00001100
    /* ************************************************************** */00001110
    /*   OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */00001120
    /* ************************************************************** */00001130
                                                                        00001140
       DCL 1  W01                       UNALIGNED,                      00001150
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00001160
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),   00001170
              2   STYRINGSKODE_IKKE_SATT      BIT  (1)   INIT ('0'B),   00001180
              2   AKSJONSKODE                 CHAR (2),                 00001190
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00001200
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('1'B),   00001210
              2   NAVN                        CHAR (25)  INIT ((25)' '),00001220
              2   VIRK_DATO_ÅM                PIC '9999' INIT ( 0  ),   00001230
              2   I                    FIXED  BIN  (15)  INIT (1),      00001240
              2   J                    FIXED  BIN  (15)  INIT (1);      00001250
                                                                        00001260
       DCL CICSINFO              CHAR (16);                             00001270
                                                                        00001280
    /* ************************************************************** */00001290
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00001300
    /* ************************************************************** */00001310
                                                                        00001320
       DCL 1  W01_DLI_PARAM,                                            00001330
              2   W02_GET                 CHAR (4)   INIT ('    '),     00001340
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00001350
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00001360
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00001370
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00001380
                                                                        00001390
                                                                        00001400
    /* ************************************************************** */00001410
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001420
    /* ************************************************************** */00001430
                                                                        00001440
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ') ; 00001450
                                                                        00001460
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ') ; 00001470
                                                                        00001480
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');00001490
                                                                        00001500
       DCL 1  SSA1_RF0PERSN        STATIC,                              00001510
              2    HDEL                       CHAR (17)  INIT           00001520
                   ('RF0PERSN(FNR     '),                               00001530
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001540
              2    PKEY               FIXED   DEC  (11),                00001550
              2    HP                         CHAR (1)   INIT (')');    00001560
                                                                        00001570
                                                                        00001580
       DCL 1  SSA1_PINNTEKT        STATIC,                              00001590
              2    HDEL                       CHAR (17)  INIT           00001600
                   ('PINNTEKT(INNTÅRTY'),                               00001610
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001620
              2    ÅR                 FIXED   DEC  (2),                 00001630
              2    TYPE                       CHAR (1),                 00001640
              2    HP                         CHAR (1)   INIT (')');    00001650
                                                                        00001660
                                                                        00001670
    /* ************************************************************** */00001680
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001690
    /* ************************************************************** */00001700
                                                                        00001710
    %PAGE;                                                              00001720
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001730
    %PAGE;                                                              00001740
                                                                        00001750
       DCL 1  B01              BASED (B01_PEKER),                       00001760
    %INCLUDE P0019921;                         /* B01_OMR (BASED)     */00001770
                                                                        00001780
                                                                        00001790
    %PAGE;                                                              00001800
       DCL 1  B02              BASED (B02_PEKER),                       00001810
    %INCLUDE P0019921;                         /* B02_OMR (BASED)     */00001820
                                                                        00001830
    %PAGE;                                                              00001840
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001850
    %INCLUDE P0012003;                         /* PCB                 */00001860
                                                                        00001870
                                                                        00001880
    %PAGE;                                                              00001890
       DCL 1  RF2              BASED (RF2_PCB_PEKER),                   00001900
    %INCLUDE P0012003;                         /* PCB                 */00001910
                                                                        00001920
    /* ************************************************************** */00001930
    /*                                                                */00001940
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001950
    /*     ---------------------------------------------------        */00001960
    /*                                                                */00001970
    /*                                                                */00001980
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */00001990
    /*                                                                */00002000
    /*                                                                */00002010
    /* ************************************************************** */00002020
                                                                        00002030
                                                                        00002040
     COMMAREA_PEKER                     = HOVED_KOM_PTR;                00002050
                                                                        00002060
      ON ERROR SNAP                                                     00002070
                                                                        00002080
         BEGIN;                                                         00002090
               ON ERROR SYSTEM;                                         00002100
               ONKODE=ONCODE;                                           00002110
               EXEC CICS ABEND ABCODE(ONK);                             00002120
         END;                                                           00002130
                                                                        00002140
    EXEC CICS HANDLE CONDITION ERROR(ERRBEH);                           00002150
                                                                        00002160
    EXEC CICS HANDLE AID PF1(PF2);                                      00002170
    EXEC CICS HANDLE AID PF2(PF2);                                      00002180
                                                                        00002190
                                                                        00002200
    PROGRAM_ID     = 'R001I701'                         ;               00002210
    CICSINFO       = F_CICSINFO (DIV_PARAM_OMR.CICS_IND);               00002220
    DB_STATUS_KODE = '  '                               ;               00002230
    FEIL_MELD_NR   = 0                                  ;               00002240
                                                                        00002250
                                                                        00002260
                                                                        00002270
  /**********    H O V E D S T Y R I N G   S T A R T   *************/   00002280
                                                                        00002290
                                                                        00002300
  FEILMELDING_SATT       = '1'B    ;                                    00002310
  AKSJON_IKKE_SATT       = '1'B    ;                                    00002320
  W01.MER_DATA           = '1'B    ;                                    00002330
                                                                        00002340
                                                                        00002350
                                                                        00002360
  IF TRANSKODE ^= 'I701' THEN                                           00002370
     DO;                                                                00002380
        CALL DATABASE('OPEN');                                          00002390
                                                                        00002400
        IF FEIL_MELD_NR > 0   THEN                                      00002410
           DO;                                                          00002420
              TERMINERINGS_IND = FATAL_FEIL;                            00002430
              CALL SKRIV_FEILMELDING;                                   00002440
        END;                                                            00002450
        ALLOCATE S001I07I;                                              00002460
        ALLOCATE S001I07O;                                              00002470
        EXEC CICS LOAD PROGRAM ('S001I13');                             00002480
        S001I07O.FNRO  = FRA_FNR;                                       00002490
        S001I07O.NAVNO = LOW(25);                                       00002500
        S001I07I.NAVNL = -1;                                            00002510
        S001I07O.CICS_INFOO = CICSINFO            ;                     00002520
                                                                        00002530
        EXEC CICS SEND MAP('S001I07')                                   00002540
                           MAPSET('S001I13') ERASE CURSOR;              00002550
     END;                                                               00002560
                                                                        00002570
  TRANSKODE = 'I701';                                                   00002580
                                                                        00002590
                                                                        00002600
  EXEC CICS RECEIVE MAP('S001I07')                                      00002610
                                  MAPSET('S001I13') SET (BMSMAPBR);     00002620
                                                                        00002630
                                                                        00002640
  IF S001I07I.NAVNL > 0 THEN                                            00002650
     W01.NAVN = S001I07I.NAVNI;                                         00002660
  ELSE                                                                  00002670
      /* ******************************************** */                00002680
      /* NAVN IKKE OPPGITT      --> FEILMELDING.     */                 00002690
      /* ******************************************** */                00002700
                                                                        00002710
     DO;                                                                00002720
        MAP_MELDING =                                                   00002730
                      'NAVN MÅ OPPGIS.';                                00002740
             ALLOCATE S001I07O;                                         00002750
             ALLOCATE S001I07I;                                         00002760
                                                                        00002770
             EXEC CICS LOAD PROGRAM('S001I13');                         00002780
                                                                        00002790
             S001I07O.FNRO         = FRA_FNR;                           00002800
             S001I07O.NAVNO        = LOW(25);                           00002810
             S001I07I.NAVNL        = -1; /* CURSOR POS       */         00002820
             S001I07O.CICS_INFOO   = CICSINFO       ;                   00002830
             S001I07O.MELDINGO     = MAP_MELDING;                       00002840
                                                                        00002850
             EXEC CICS SEND MAP('S001I07')                              00002860
                            MAPSET('S001I13') CURSOR ERASE;             00002870
                                                                        00002880
             TRANSKODE = 'I701';                                        00002890
                                                                        00002900
             CALL DATABASE('CLOSE');                                    00002910
                                                                        00002920
             IF FEIL_MELD_NR > 0   THEN                                 00002930
                DO;                                                     00002940
                   TERMINERINGS_IND = FATAL_FEIL;                       00002950
                   CALL SKRIV_FEILMELDING;                              00002960
                END;                                                    00002970
                                                                        00002980
             EXEC CICS RETURN;                                          00002990
          END;                                                          00003000
                                                                        00003010
  CALL FINN_PERSON;                                                     00003020
                                                                        00003030
                                                                        00003040
  IF W01.MER_DATA THEN                                                  00003050
     DO;                                                                00003060
        W02_GET               = 'GHU ';                                 00003070
        SSA1_RF0PERSN.PKEY    = FRA_FNR;                                00003080
                                                                        00003090
        CALL P005_LES_ROT_QUAL_FNR;                                     00003100
                                                                        00003110
        IF W01.MER_DATA THEN                                            00003120
           DO;                                                          00003130
             /* ******************************************** */         00003140
             /* OPPDATER ROTSEGMENT MED NAVN.               */          00003150
             /* ******************************************** */         00003160
              W02_GET      = 'REPL';                                    00003170
              RF0PERSN.NAVN = W01.NAVN;                                 00003180
                                                                        00003190
              CALL P015_REPL_ROT;                                       00003200
           END;                                                         00003210
      END;                                                              00003220
                                                                        00003230
                                                                        00003240
  IF FEIL_MELD_NR > 0 THEN                                              00003250
     DO;                                                                00003260
        TERMINERINGS_IND = FATAL_FEIL;                                  00003270
        CALL SKRIV_FEILMELDING;                                         00003280
     END;                                                               00003290
                                                                        00003300
  ALLOCATE S001I01I;                                                    00003310
  ALLOCATE S001I01O;                                                    00003320
  EXEC CICS LOAD PROGRAM ('S001I13');                                   00003330
  S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                   00003340
  S001I01O.CICS_INFOO      = CICSINFO ;                                 00003350
                                                                        00003360
  EXEC CICS SEND MAP('S001I01')                                         00003370
                                  MAPSET('S001I13') CURSOR ERASE;       00003380
                                                                        00003390
                                                                        00003400
  CALL DATABASE('CLOSE'); /* ENDRET 04.03.87 AL  */                     00003410
  TRANSKODE = 'R0I1';                                                   00003420
  EXEC CICS RETURN;                                                     00003430
                                                                        00003440
                                                                        00003450
                                                                        00003460
  PF2:                                                                  00003470
                                                                        00003480
     MAP_MELDING              = 'TRANSAKSJONEN ER FORKASTET';           00003490
     FEILMELDING_SATT         = '1'B;                                   00003500
     S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                00003510
     S001I01O.CICS_INFOO      = CICSINFO          ;                     00003520
     S001I07O.MELDINGO        = MAP_MELDING;                            00003530
                                                                        00003540
     EXEC CICS SEND MAP('S001I07')                                      00003550
                                       MAPSET('S001I13') CURSOR ERASE;  00003560
                                                                        00003570
     TRANSKODE = 'R0I1';                                                00003580
     EXEC CICS XCTL PROGRAM('R001I101') COMMAREA(KOM_OMR);              00003590
                                                                        00003600
                                                                        00003610
                                                                        00003620
  ERRBEH:                                                               00003630
     EXEC CICS HANDLE CONDITION ERROR;                                  00003640
     EXEC CICS PURGE MESSAGE;                                           00003650
     EXEC CICS ABEND ABCODE('FEIL');                                    00003660
                                                                        00003670
                                                                        00003680
  /**********    H O V E D S T Y R I N G   S L U T T   *************/   00003690
                                                                        00003700
                                                                        00003710
                                                                        00003720
                                                                        00003730
 FINN_PERSON:                                                           00003740
   PROC;                                                                00003750
                                                                        00003760
    ALLOCATE S001I03O;                                                  00003770
    ALLOCATE S001I03I;                                                  00003780
                                                                        00003790
    EXEC CICS LOAD PROGRAM('S001I33');                                  00003800
                                                                        00003810
    S001I03O.FNRO         = FRA_FNR;                                    00003820
    S001I03O.CICS_INFOO   = CICSINFO              ;                     00003830
                                                                        00003840
    SSA1_RF0PERSN.PKEY    = FRA_FNR;                                    00003850
                                                                        00003860
    W02_GET      = 'GU  ';                                              00003870
    CALL P005_LES_ROT_QUAL_FNR;                                         00003880
                                                                        00003890
    IF W01.MER_DATA THEN                                                00003900
       DO;                                                              00003910
         W02_GET      = 'GU ';                                          00003920
         CALL P010_LES_INNT_UQUAL;                                      00003930
                                                                        00003940
         IF ^W01.MER_DATA THEN                                          00003950
                                                                        00003960
           DO;                                                          00003970
             /* ******************************************** */         00003980
             /* FRA-FNR IKKE I DATABASE--> FEILMELDING.     */          00003990
             /* ******************************************** */         00004000
                                                                        00004010
             MAP_MELDING =                                              00004020
                      'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!           00004030
                                  ' HAR IKKE INNTEKT.' ;                00004040
             ALLOCATE S001I01O;                                         00004050
             ALLOCATE S001I01I;                                         00004060
                                                                        00004070
             EXEC CICS LOAD PROGRAM('S001I13');                         00004080
                                                                        00004090
             S001I01O.FRAFNRA      = 'I';                               00004100
             S001I01O.FRAFNRO      = FRA_FNR;                           00004110
             S001I01I.FRAFNRL      = -1; /* CURSOR POS       */         00004120
             S001I01O.STYREKODEO   = STYREKODE;                         00004130
             S001I01O.CICS_INFOO   = CICSINFO     ;                     00004140
             S001I01O.MELDINGO     = MAP_MELDING;                       00004150
                                                                        00004160
             EXEC CICS SEND MAP('S001I01')                              00004170
                            MAPSET('S001I13') CURSOR ERASE;             00004180
                                                                        00004190
             TRANSKODE = 'R0I1';                                        00004200
                                                                        00004210
             CALL DATABASE('CLOSE');                                    00004220
                                                                        00004230
             IF FEIL_MELD_NR > 0   THEN                                 00004240
                DO;                                                     00004250
                   TERMINERINGS_IND = FATAL_FEIL;                       00004260
                   CALL SKRIV_FEILMELDING;                              00004270
                END;                                                    00004280
                                                                        00004290
             EXEC CICS RETURN;                                          00004300
          END;                                                          00004310
        ELSE;                                                           00004320
       END;                                                             00004330
    ELSE                                                                00004340
       DO;                                                              00004350
           /* ******************************************** */           00004360
           /* FRA-FNR IKKE I DATABASE--> FEILMELDING.     */            00004370
           /* ******************************************** */           00004380
                                                                        00004390
          MAP_MELDING =                                                 00004400
                      'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!           00004410
                                  ' ER IKKE I DATABASEN.' ;             00004420
          ALLOCATE S001I01O;                                            00004430
          ALLOCATE S001I01I;                                            00004440
                                                                        00004450
          EXEC CICS LOAD PROGRAM('S001I13');                            00004460
                                                                        00004470
          S001I01O.FRAFNRA      = 'I';                                  00004480
          S001I01O.FRAFNRO      = FRA_FNR;                              00004490
          S001I01I.FRAFNRL      = -1; /* CURSOR POS       */            00004500
          S001I01O.STYREKODEO   = STYREKODE;                            00004510
          S001I01O.CICS_INFOO   = CICSINFO        ;                     00004520
          S001I01O.MELDINGO     = MAP_MELDING;                          00004530
                                                                        00004540
          EXEC CICS SEND MAP('S001I01')                                 00004550
                                      MAPSET('S001I13') CURSOR ERASE;   00004560
                                                                        00004570
          TRANSKODE = 'R0I1';                                           00004580
                                                                        00004590
          CALL DATABASE('CLOSE');                                       00004600
                                                                        00004610
          IF FEIL_MELD_NR > 0   THEN                                    00004620
             DO;                                                        00004630
                TERMINERINGS_IND = FATAL_FEIL;                          00004640
                CALL SKRIV_FEILMELDING;                                 00004650
             END;                                                       00004660
                                                                        00004670
                                                                        00004680
          EXEC CICS RETURN;                                             00004690
       END;                                                             00004700
                                                                        00004710
    END FINN_PERSON;                                                    00004720
                                                                        00004730
    %PAGE;                                                              00004740
    /* ************************************************************** */00004750
    /*                                                                */00004760
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */00004770
    /* PCB : RF1.                                                     */00004780
    /* ************************************************************** */00004790
                                                                        00004800
    P005_LES_ROT_QUAL_FNR:                                              00004810
      PROC;                                                             00004820
                                                                        00004830
      CALL PLITDLI                              (W02_PARM_CT_4,         00004840
                                                 W02_GET,               00004850
                                                 RF1,                   00004860
                                                 RF0PERSN,              00004870
                                                 SSA1_RF0PERSN);        00004880
                                                                        00004890
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00004900
        DO;                                                             00004910
          SELECT  ( RF1.STATUS_KODE );                                  00004920
                                                                        00004930
            WHEN  ( '  ' )                                              00004940
              W01.MER_DATA                 =    '1'B;                   00004950
                                                                        00004960
            WHEN  ( 'GE' )                                              00004970
              W01.MER_DATA                 =    '0'B;                   00004980
                                                                        00004990
            OTHERWISE                                                   00005000
              DO;                                                       00005010
                /* ************************************************** */00005020
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00005030
                /* ************************************************** */00005040
  L200:                                                                 00005050
                FEIL_MELD_NR               =     500;                   00005060
                FEIL_VED_LABEL             =    '200';                  00005070
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00005080
                W01.MER_DATA               =    '0'B;                   00005090
              END;                                                      00005100
          END;                                                          00005110
        END;                                                            00005120
      ELSE                                                              00005130
        DO;                                                             00005140
          /* ************************************************** */      00005150
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00005160
          /* ************************************************** */      00005170
  L205:                                                                 00005180
          FEIL_MELD_NR               =     500;                         00005190
          FEIL_VED_LABEL             =    '205';                        00005200
          W01.MER_DATA               =    '0'B;                         00005210
        END;                                                            00005220
    END P005_LES_ROT_QUAL_FNR;                                          00005230
                                                                        00005240
                                                                        00005250
                                                                        00005260
                                                                        00005270
    %PAGE;                                                              00005280
    /* ************************************************************** */00005290
    /*                                                                */00005300
    /* PROCEDURE FOR LESE INNT-SEGM GN QUAL.                          */00005310
    /*                                                                */00005320
    /* ************************************************************** */00005330
                                                                        00005340
    P010_LES_INNT_UQUAL:                                                00005350
      PROC;                                                             00005360
                                                                        00005370
                                                                        00005380
      CALL PLITDLI                          (W02_PARM_CT_5,             00005390
                                             W02_GET,                   00005400
                                             RF1,                       00005410
                                             W01_PINT,                  00005420
                                             SSA1_RF0PERSN,             00005430
                                             SSA_UQUAL_PINNTEKT);       00005440
                                                                        00005450
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00005460
        DO;                                                             00005470
          SELECT  ( RF1.STATUS_KODE );                                  00005480
                                                                        00005490
            WHEN  ( '  ' )                                              00005500
              W01.MER_DATA                 =    '1'B;                   00005510
                                                                        00005520
            WHEN  ( 'GE' )                                              00005530
              W01.MER_DATA                 =    '0'B;                   00005540
                                                                        00005550
            OTHERWISE                                                   00005560
              DO;                                                       00005570
                /* ************************************************** */00005580
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00005590
                /* ************************************************** */00005600
  L210:                                                                 00005610
                FEIL_MELD_NR               =     500;                   00005620
                FEIL_VED_LABEL             =    '210';                  00005630
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00005640
                W01.MER_DATA               =    '0'B;                   00005650
              END;                                                      00005660
          END;                                                          00005670
        END;                                                            00005680
      ELSE                                                              00005690
        DO;                                                             00005700
          /* ************************************************** */      00005710
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00005720
          /* ************************************************** */      00005730
  L220:                                                                 00005740
          FEIL_MELD_NR               =     500;                         00005750
          FEIL_VED_LABEL             =    '220';                        00005760
          W01.MER_DATA               =    '0'B;                         00005770
        END;                                                            00005780
                                                                        00005790
                                                                        00005800
    END P010_LES_INNT_UQUAL;                                            00005810
                                                                        00005820
                                                                        00005830
    %PAGE;                                                              00005840
    /* ************************************************************** */00005850
    /*                                                                */00005860
    /* PROCEDURE FOR REPL ROT-SEGM.                                   */00005870
    /* PCB : RF1.                                                     */00005880
    /* ************************************************************** */00005890
                                                                        00005900
    P015_REPL_ROT:                                                      00005910
      PROC;                                                             00005920
                                                                        00005930
      CALL PLITDLI                              (W02_PARM_CT_3,         00005940
                                                 W02_GET,               00005950
                                                 RF1,                   00005960
                                                 RF0PERSN);             00005970
                                                                        00005980
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00005990
        DO;                                                             00006000
          SELECT  ( RF1.STATUS_KODE );                                  00006010
                                                                        00006020
            WHEN  ( '  ' )                                              00006030
              W01.MER_DATA                 =    '1'B;                   00006040
                                                                        00006050
            OTHERWISE                                                   00006060
              DO;                                                       00006070
                /* ************************************************** */00006080
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00006090
                /* ************************************************** */00006100
  L230:                                                                 00006110
                FEIL_MELD_NR               =     500;                   00006120
                FEIL_VED_LABEL             =    '230';                  00006130
                DB_STATUS_KODE             =     RF1.STATUS_KODE;       00006140
                W01.MER_DATA               =    '0'B;                   00006150
              END;                                                      00006160
          END;                                                          00006170
        END;                                                            00006180
      ELSE                                                              00006190
        DO;                                                             00006200
          /* ************************************************** */      00006210
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00006220
          /* ************************************************** */      00006230
  L240:                                                                 00006240
          FEIL_MELD_NR               =     500;                         00006250
          FEIL_VED_LABEL             =    '240';                        00006260
          W01.MER_DATA               =    '0'B;                         00006270
        END;                                                            00006280
    END P015_REPL_ROT;                                                  00006290
                                                                        00006300
                                                                        00006310
  SKRIV_FEILMELDING:                                                    00006320
     PROC;                                                              00006330
                                                                        00006340
  /* **************************************************************** */00006350
  /*HENSIKT:                                                          */00006360
  /*    GIR UT FEILMELDING.                                           */00006370
  /*                                                                  */00006380
  /*                                                                  */00006390
  /*BRUK:                                                             */00006400
  /*    CALL SKRIV_FEILMELDING;                                       */00006410
  /*                                                                  */00006420
  /* **************************************************************** */00006430
                                                                        00006440
  DCL FNR_PIC                PIC  '(11)9'     INIT (0),                 00006450
      FNR_CHAR DEF FNR_PIC   CHAR  (11)               ;                 00006460
                                                                        00006470
                                                                        00006480
  IF TERMINERINGS_IND = FATAL_FEIL THEN                                 00006490
     DO;                                                                00006500
        EXEC CICS PURGE MESSAGE;                                        00006510
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!        00006520
                               ' GÅR I FEIL VED LABEL NR. '        !!   00006530
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;   00006540
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING      00006550
                                                           JUSTIFY(10); 00006560
                                                                        00006570
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                      00006580
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                        00006590
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);        00006600
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)            00006610
                                                         ACCUM PAGING;  00006620
                                                                        00006630
        IF FEIL_MELD_NR        =     500              THEN              00006640
           DO;                                                          00006650
                                                                        00006660
              /* *************************************************** */ 00006670
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */ 00006680
              /* *************************************************** */ 00006690
                                                                        00006700
              FEIL_MELDING     =  '  RETUR_KODE   =  '                  00006710
                                       !! DB_STATUS_KODE;               00006720
              EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM            00006730
                                               PAGING   JUSTIFY (18);   00006740
           END;                                                         00006750
                                                                        00006760
        ELSE                                                            00006770
           IF FEIL_MELD_NR   =     499              THEN                00006780
              DO;                                                       00006790
                                                                        00006800
               /* *************************************************** */00006810
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */00006820
               /* *************************************************** */00006830
                                                                        00006840
                                                                        00006850
                 FNR_PIC          =  DIV_PARAM_OMR.SEARCH_FNR  ;        00006860
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR ;        00006870
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM         00006880
                                                  PAGING   JUSTIFY (18);00006890
              END;                                                      00006900
                                                                        00006910
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!             00006920
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';00006930
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)            00006940
                                                           ACCUM PAGING;00006950
        EXEC CICS SEND PAGE;                                            00006960
                                                                        00006970
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/            00006980
                                                                        00006990
         EXEC CICS ABEND                                                00007000
                     ABCODE(STOP);                                      00007010
     END;                                                               00007020
                                                                        00007030
  END SKRIV_FEILMELDING;                                                00007040
                                                                        00007050
                                                                        00007060
                                                                        00007070
  /* **************************************************************** */00007080
  /*                                                                  */00007090
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE RF-DATABASEN.                     */00007100
  /*                                                                  */00007110
  /* **************************************************************** */00007120
                                                                        00007130
  DATABASE:                                                             00007140
   PROC(STYRING);                                                       00007150
                                                                        00007160
   DCL                                                                  00007170
     STYRING                               CHAR(5),                     00007180
     NULL                                  BUILTIN,                     00007190
     UNSPEC                                BUILTIN,                     00007200
     PLITDLI                               ENTRY;                       00007210
                                                                        00007220
  /*------------------------------------------------------------------*/00007230
  /* DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL   */00007240
  /*------------------------------------------------------------------*/00007250
     DCL                                                                00007260
       W01_PSB_NAVN                CHAR (8)       INIT('B001R001');     00007270
     DCL                                                                00007280
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');         00007290
     DCL                                                                00007300
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');         00007310
                                                                        00007320
     DCL 1  W01_DLI_PARAM,                                              00007330
            2   W02_GU             CHAR (4)       INIT('GU  '),         00007340
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),              00007350
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);              00007360
                                                                        00007370
  %PAGE;                                                                00007380
                                                                        00007390
     IF STYRING = 'OPEN' THEN                                           00007400
        DO;                                                             00007410
           CALL   PLITDLI                        (W02_PARM_CT_3,        00007420
                                                  W01_PCB_FUNCTION,     00007430
                                                  W01_PSB_NAVN,         00007440
                                                  UIBPTR);              00007450
                                                                        00007460
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN   00007470
              DO;                                                       00007480
                 ALLOCATE PCB_UIB_PEKER_OMR;                            00007490
                 PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;        00007500
                 PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;          00007510
              END;                                                      00007520
           ELSE                                                         00007530
              DO;                                                       00007540
                 FEIL_MELD_NR      =  500;                              00007550
 L555:           FEIL_VED_LABEL    = '555';                             00007560
                 MAP_MELDING =                                          00007570
                         'NOE ER GALT MED DATABASEN, KODE: ' !!         00007580
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);   00007590
              END;                                                      00007600
        END;                                                            00007610
     ELSE                                                               00007620
        DO;                                                             00007630
           CALL   PLITDLI                        (W02_PARM_CT_1,        00007640
                                                  W01_TERM_FUNCTION);   00007650
           KOM_OMR.PCB_UIB_PEKER = NULL;                                00007660
        END;                                                            00007670
                                                                        00007680
  END DATABASE;                                                         00007690
                                                                        00007700
                                                                        00007710
  %INCLUDE R0019912;          /*  NUM-> CHAR                      */    00007720
  %INCLUDE R0019905;          /*  F_ALDER                         */    00007730
  %INCLUDE R0019957;          /*  P900_NOR_DATA       (FNR,TKNR ) */    00007740
  %INCLUDE R0019960;          /*  F_CICSINFO                      */    00007750
                                                                        00007760
                                                                        00007770
 END R001I70;                                                           00007780
