 /*       SIST ENDRET 25/02-97 14.26.12 AV   JDA7339                  */00000000
 /*       SIST ENDRET 28/01-97 13.33.18 AV   JDA0310                  */00000010
 /*       SIST ENDRET 04/03-96 12.49.51 AV   JDA0310                  */00000020
 /*       SIST ENDRET 25/02-94 12.22.24 AV   HERMAN                   */00000030
 /*       SIST ENDRET 06/01-93 12.29.02 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 13/12-91 12.19.14 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 10/10-91 13.57.10 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 27/08-91 12.16.51 AV   DYBVIK                   */00000070
 /*       SIST ENDRET 01/08-91 14.15.06 AV   DYBVIK                   */00000080
 /*       SIST ENDRET 26/03-91 13.11.49 AV   HERMAN                   */00000090
 /*       SIST ENDRET 21/01-91 15.27.13 AV   HERMAN                   */00000100
 /*       SIST ENDRET 11/12-90 13.20.56 AV   DYBVIK                   */00000110
 /*       SIST ENDRET 03/12-90 12.32.13 AV   DYBVIK                   */00000120
 /*       SIST ENDRET 21/11-90 14.21.50 AV   DYBVIK                   */00000130
 /*       SIST ENDRET 15/11-90 14.15.19 AV   DYBVIK                   */00000140
 /*       SIST ENDRET 02/08-90 13.18.22 AV   DYBVIK                   */00000150
 /*       SIST ENDRET 03/11-89 13.06.53 AV   DYBVIK                   */00000160
 /*       SIST ENDRET 06/06-89 13.50.34 AV   DYBVIK                   */00000170
 /*       SIST ENDRET 14/04-89 13.28.37 AV   HERMAN                   */00000180
 /*       SIST ENDRET 25/03-87 15.05.36 AV   DYBVIK                   */00000190
 /*       SIST ENDRET 24/03-87 11.46.18 AV   DYBVIK                   */00000200
 /*       SIST ENDRET 11/11-86 11.28.03 AV   DYBVIK                   */00000210
 /*       SIST ENDRET 23/07-86 12.33.40 AV   DYBVIK                   */00000220
 /*       SIST ENDRET 16/07-86 09.24.30 AV   DYBVIK                   */00000230
 /*       SIST ENDRET 06/06-86 14.16.40 AV   FARVIK                   */00000240
 /*       SIST ENDRET 29/04-86 11.34.23 AV   FARVIK                   */00000250
 /* ***************************************************************** */00000260
 %SKIP;                                /*  */                           00000270
 /* ***************************************************************** */00000280
 /*               R 0 0 1 0 6 0 3                                     */00000290
 /* ***************************************************************** */00000300
 /*IDENTIFIKASJON:                                                    */00000310
 /* **********************                                            */00000320
 /*  PROGRAM-IDENT : R0010603  KONTROLL_UP_SØKER   SUBPROGRAM         */00000330
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000340
 /*  PROGRAMMERER  : JAN-HARALD KRISTENSEN                            */00000350
 /*  PROGRAMMET BLE LAGET : MAI 1981                                  */00000360
 /*  ENDRINGERSDATO :                                                 */00000370
 /*  ENDRINGEN GJELDER:                                               */00000380
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000390
 /*                                                                   */00000400
 /* ***************************************************************** */00000410
 /*HENSIKT:                                                           */00000420
 /* **********                                                        */00000430
 /*  FORETAR KONTROLL AV GRUNNBLANKETT UP - SØKERDELEN.               */00000440
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000450
 /*                                                                   */00000460
 /*                                                                   */00000470
 /*  ENDRING 22.6.87 AV ERIK:                                         */00000480
 /*  FORETAR KONTROLL AV TILLEGGSBLANKETT YP.                         */00000490
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000500
 /*                                                                   */00000510
 /* ***************************************************************** */00000520
 /*PROGRAMTILKNYTTING:                                                */00000530
 /* ********************                                              */00000540
 /*  PROGRAMMET INCLUDES AV R0010601 - KONTROLL_GRUNNBLANKETT_UP      */00000550
 /*  ARBEIDSOMRÅDET P0010601 ER INCLUDET I HOVEDPROG                  */00000560
 /*  BRUK :                                                           */00000570
 /*  CALL KONTROLL_UP_SØKER(FEIL_I_UP_SØKER);                         */00000580
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000590
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000600
 /*          R0019901 - F_GYLDIG_DATO                                 */00000610
 /*          R0019902 - F_KJØNN                                       */00000620
 /*          R0019903 - F_EK_ALDER                                    */00000630
 /*          R0019904 - F_GYLDIG_FNR                                  */00000640
 /*          R0019905 - F_ALDER                                       */00000650
 /*          R0019910 - F_NUMERISK                                    */00000660
 /*          R0019912 - F_FELT_PIC_CHAR11                             */00000670
 /*          R0019964 - F_6MDR                                        */00000680
 /*          VERIFY   - BUILTIN-FUNCTION                              */00000690
 /* ***************************************************************** */00000700
 /*DATASETTOPPLYSNINGER:                                              */00000710
 /* ***********************                                           */00000720
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */00000730
 /*   TKNR_TAB.LESES VED EXEC CICS READ DATASET.                      */00000740
 /*                                                                   */00000750
 /* ***************************************************************** */00000760
 /*FEILMELDINGER:                                                     */00000770
 /* *******************                                               */00000780
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000790
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000800
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */00000810
 /*                                                                   */00000820
 /* ***************************************************************** */00000830
 %PAGE;                                /*   */                          00000840
 /* ***************************************************************** */00000850
 /*                                                                   */00000860
 /*   MODULEN KONTROLLERER UP_SØKER, OG RETURNERER                    */00000870
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00000880
 /*                                                                   */00000890
 /* ENDRING : 31.7.85 - HL : VI SKAL AKSEPTERE VIRKNINGSDATO 1 MÅNED  */00000900
 /*                          FREM I TIDEN (F_DAGS_DATO_PLUSS1_ÅM)     */00000910
 /*                          FEILRAPPORT NR 225.                      */00000920
 /* ENDRING : 7.8.85  - HL : TRYGDETID BLE REGNET FEIL FOR PERSONER   */00000930
 /*                          SOM FYLLER 16 ÅR ETTER 1966              */00000940
 /*                          FEILRAPPORT NR 226.                      */00000950
 /* ENDRING : 11.9.86 - OG : VI SKAL AKSEPTERE VIRKNINGSDATO 40 DAGER */00000960
 /*                          FREM I TIDEN (F_40DAGER)                 */00000970
 /*                          FEILRAPPORT NR 185.                      */00000980
 /* ENDRING : 17.12.86  BF : UFØRETIDSPUNKT FØR FYLTE 16 ÅR           */00000990
 /*                          AKSEPTERES IKKE.                         */00001000
 /*                          FEILRAPPORT NR 435.                      */00001010
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00001020
 /* ******                                                            */00001030
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00001040
 /*    OM FNR ER ENDRET (R0019906).                                   */00001050
 /*ENDRET: 31.10.90 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00001060
 /* ******                                                            */00001070
 /*    LEGGER INN KRYSS-KONTROLL PÅ PRIMÆR- OG SEKUNDÆR-DIAGNOSE.     */00001080
 /*    REF.==> KAP.18 DIAGNOSE-KODER.                                 */00001090
 /* ***************************************************************** */00001100
 KONTROLL_UP_SØKER:                                                     00001110
   PROC (FEIL_FUNNET);                                                  00001120
   DCL                                                                  00001130
      FEIL_FUNNET     BIT (1);                                          00001140
   DCL                                                                  00001150
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00001160
      KEY_PEKER                  POINTER,                               00001170
      TK_RECL                    CHAR (101);                            00001180
                                                                        00001190
   DCL                                                                  00001200
      01 W01_PRIM                CHAR(6);                               00001210
   DCL                                                                  00001220
      01 W01_SEKU                CHAR(6);                               00001230
   DCL                                                                  00001240
      01 W01_DIAG_PRIM DEF W01_PRIM,                                    00001250
         10 FILLER               CHAR(4),                               00001260
         10 W01_REST_PRIM        CHAR(2);                               00001270
   DCL                                                                  00001280
      01 W01_DIAG_SEKU DEF W01_SEKU,                                    00001290
         10 FILLER               CHAR(4),                               00001300
         10 W01_REST_SEKU        CHAR(2);                               00001310
   DCL                                                                  00001320
      01 W01_DIA_RECL,                                                  00001330
         10 W01_DIA_RECL_KEY         CHAR(6);                           00001340
   DCL                                                                  00001350
      W_FNR                                     PIC'(11)9';             00001360
   DCL                                                                  00001370
      1 FNR DEF W_FNR,                                                  00001380
        2 DAG                                   PIC'(2)9',              00001390
        2 MND                                   PIC'(2)9',              00001400
        2 AAR                                   PIC'(2)9',              00001410
        2 ÅRHUNDRE                              PIC'9',                 00001420
        2 REST                                  PIC'(4)9';              00001430
   DCL                                                                  00001440
      W_FNR_EK                                  PIC'(11)9';             00001450
   DCL                                                                  00001460
      1 FNR_EK_DEF DEF W_FNR_EK,                                        00001470
        2 DAG                                   PIC'(2)9',              00001480
        2 MND                                   PIC'(2)9',              00001490
        2 AAR                                   PIC'(2)9',              00001500
        2 ÅRHUNDRE                              PIC'9',                 00001510
        2 REST                                  PIC'(4)9';              00001520
   DCL                                                                  00001530
      TT_E66_ÅM                                 PIC'(4)9';              00001540
   DCL                                                                  00001550
      ALDER           FIXED DEC (5),                                    00001560
      ALDERSGRENSE    FIXED DEC (5),    /*HL*/                          00001570
      IÅR             FIXED BIN (15),                                   00001580
      J               FIXED BIN (15),                                   00001590
      TELL            FIXED BIN (15),                                   00001600
      DATO            CHAR(6);                                          00001610
   DCL                                                                  00001620
      1 DAGENS_DATO   DEF DATO,                                         00001630
        2 ÅR          PIC'99',                                          00001640
        2 MN          PIC'99',                                          00001650
        2 DG          PIC'99';                                          00001660
   DCL                                                                  00001670
      DATE            BUILTIN;                                          00001680
   DCL                                                                  00001690
      DAGENS_DATO_ÅM  DEF DATO POS(1) PIC'(4)9';                        00001700
                                                                        00001710
 /*  HJELPE DCL FOR Å SNU DATO           */                             00001720
                                                                        00001730
   DCL                                                                  00001740
      HJ_VIRK_DATO_ÅM                        PIC '9999',                00001750
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅM POS(1) PIC '99',                  00001760
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅM POS(3) PIC '99',                  00001770
      HJ_UFT_ÅM                              PIC '9999',                00001780
      UFT_Å DEF HJ_UFT_ÅM POS(1)             PIC '99',                  00001790
      UFT_M DEF HJ_UFT_ÅM POS(3)             PIC '99';                  00001800
                                                                        00001810
   DCL                                                                  00001820
      HJ_VIRK_DATO_MÅ                           PIC '9999',             00001830
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_MÅ POS(1) PIC '99',               00001840
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_MÅ POS(3) PIC '99',               00001850
      HJ_UFT_MÅ                                 PIC '9999',             00001860
      HJ_UFT_M DEF HJ_UFT_MÅ POS(1)             PIC '99',               00001870
      HJ_UFT_Å DEF HJ_UFT_MÅ POS(3)             PIC '99';               00001880
                                                                        00001890
   DCL  W603_DIAG                   CHAR (6)    INIT ('      '),        00001900
        W603_D_P DEF W603_DIAG      PIC '(6)9'  POS  ( 1)      ,        00001910
        W603_S12 DEF W603_DIAG      CHAR ( 2)   POS  ( 1)      ,        00001920
        W603_KEY DEF W603_DIAG      CHAR ( 5)   POS  ( 1)      ,        00001930
        W603_S6  DEF W603_DIAG      CHAR ( 1)   POS  ( 6)      ,        00001940
                                                                        00001950
        W603_DIAG_LENGTH     FIXED  BIN  (15)   INIT ( 6)      ,        00001960
        W603_KEY_LENGTH      FIXED  BIN  (15)   INIT ( 5)      ,        00001970
                                                                        00001980
        W603_KAP18                  BIT  ( 1)                  ;        00001990
                                                                        00002000
   DCL                                                                  00002010
      1 FNR_REG,                                                        00002020
        2 FNR1      FIXED DEC(11),                                      00002030
        2 FNR2      FIXED DEC(11),                                      00002040
        2 BRUKERID  CHAR     ( 4);                                      00002050
                                                                        00002060
                                                                        00002070
 /*LOVENDRING MED VIRKNING FRA 1.1.91 SP : */                           00002080
    DIV_PARAM_OMR.REGN_1291 = ' ';                                      00002090
                                                                        00002100
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                         00002110
    DATO             =  DATE ()        ;                                00002120
    FEIL_FUNNET      =  '0'B           ;                                00002130
    KEY_PEKER        =  ADDR (UPS.TKNR);                                00002140
                                                                        00002150
    HJ_VIRK_DATO_MÅ  = UPS.VIRK_DATO_MÅ;                                00002160
    VIRK_DATO_Å      = HJ_VIRK_DATO_Å;                                  00002170
    VIRK_DATO_M      = HJ_VIRK_DATO_M;                                  00002180
                                                                        00002190
   IF HJ_VIRK_DATO_ÅM < 9308 & (UPS.SIVILSTAND = 'P') THEN              00002200
      DO;                                                               00002210
         FEIL_FUNNET = '1'B;                                            00002220
         UPS.SIVILSTANDNR = 388;                                        00002230
      END;                                                              00002240
   IF HJ_VIRK_DATO_ÅM < 9401 & (UPS.SIVILSTAND = 'W') THEN              00002250
      DO;                                                               00002260
         FEIL_FUNNET = '1'B;                                            00002270
         UPS.SIVILSTANDNR = 389;                                        00002280
      END;                                                              00002290
 /*MIDLERTIDIG STOPP AV ALLE FORSØRGINGSTILLEGG - HL 26.3.91 */         00002300
                                                                        00002310
 /*IF HJ_VIRK_DATO_ÅM > 9104 & (UPS.BT_ANT > 0)     THEN                00002320
      DO;                                                               00002330
         FEIL_FUNNET = '1'B;                                            00002340
         UPS.BT_ANTNR  = 999;                                           00002350
      END;                                                              00002360
   IF HJ_VIRK_DATO_ÅM > 9104 & (UPS.TILL_EK = 'J')   THEN               00002370
      DO;                                                               00002380
         FEIL_FUNNET = '1'B;                                            00002390
         UPS.TILL_EKNR = 999;                                           00002400
      END;    */                                                        00002410
 /*HIT 26.3.91 HL */                                                    00002420
                                                                        00002430
    W01_PRIM         = UPS.PRIMDIAG;                                    00002440
    W01_SEKU         = UPS.SEKUDIAG;                                    00002450
                                                                        00002460
                                                                        00002470
    IF VERIFY(UPS.ATT_UF,'AU') ^= 0 THEN                                00002480
                                                                        00002490
       DO;                                                              00002500
          FEIL_FUNNET  = '1'B;                                          00002510
          UPS.ATT_UFNR = 268;                                           00002520
       END;                                                             00002530
    IF ^F_NUMERISK(F_FELT_PIC_CHAR11(UPS.FNR)) THEN                     00002540
       DO;                                                              00002550
          FEIL_FUNNET = '1'B;                                           00002560
          UPS.FNRNR   = 200;                                            00002570
       END;                                                             00002580
    ELSE                                                                00002590
       IF ^F_GYLDIG_FNR(UPS.FNR) THEN                                   00002600
          DO;                                                           00002610
             FEIL_FUNNET = '1'B;                                        00002620
             UPS.FNRNR   = 1;                                           00002630
          END;                                                          00002640
       ELSE                                                             00002650
          DO;                                                           00002660
             FNR_REG.FNR1 = UPS.FNR;                                    00002670
             W_FNR        = UPS.FNR;                                    00002680
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00002690
             IF FNR_REG.FNR2 > 0 THEN                                   00002700
                DO;                                                     00002710
                   UPS.FNRNR   = 203;                                   00002720
                   UPS.FNR_GML = UPS.FNR;                               00002730
                   UPS.FNR     = FNR_REG.FNR2;                          00002740
                END;                                                    00002750
          END;                                                          00002760
    IF UPS.NAVN = (25)' ' THEN                                          00002770
       DO;                                                              00002780
          FEIL_FUNNET = '1'B;                                           00002790
          UPS.NAVNNR  = 2;                                              00002800
       END;                                                             00002810
    IF VERIFY(UPS.SPRÅK,'NB ') ^= 0 THEN                                00002820
       DO;                                                              00002830
          FEIL_FUNNET = '1'B;                                           00002840
          UPS.SPRÅKNR = 6;                                              00002850
       END;                                                             00002860
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(UPS.TKNR)) THEN                    00002870
       DO;                                                              00002880
          FEIL_FUNNET = '1'B;                                           00002890
          UPS.TKNRNR  = 200;                                            00002900
       END;                                                             00002910
    ELSE                                                                00002920
       DO;                                                              00002930
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                  00002940
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)          00002950
                                               INTO(TK_RECL);           00002960
            GOTO TKNR_UT;                                               00002970
        NOTFND:                                                         00002980
            FEIL_FUNNET = '1'B;                                         00002990
            UPS.TKNRNR  = 3;                                            00003000
            LEAVE;                                                      00003010
        TKNR_UT:                                                        00003020
               DIV_PARAM_OMR.DIV_TKNR = SUBSTR(TK_RECL,1,4);            00003030
       END;                                                             00003040
    IF VERIFY(UPS.SIVILSTAND,'GASUEPW') ^= 0 THEN                       00003050
       DO;                                                              00003060
          FEIL_FUNNET      = '1'B;                                      00003070
          UPS.SIVILSTANDNR = 5;                                         00003080
       END;                                                             00003090
                                                                        00003100
    IF ^(UPS.TILL_EK = 'J' ! UPS.TILL_EK = ' ') THEN                    00003110
       DO;                                                              00003120
          FEIL_FUNNET   ='1'B;                                          00003130
          UPS.TILL_EKNR = 4;                                            00003140
       END;                                                             00003150
                                                                        00003160
  /* ******************************************************** */        00003170
  /* TILLEGG FOR EKTEFELLE SKAL OGSÅ AVVISES HVIS UFØREGRADEN */        00003180
  /* ER UNDER 50 PROSENT.  GJELDER YRKESSKADETILFELLENE.      */        00003190
  /* ERIK 19.1.88.                                            */        00003200
  /* ******************************************************** */        00003210
                                                                        00003220
  /*YS*/ IF UPS.UFG < 50 &                                              00003230
  /*YS*/    UPS.TILL_EK = 'J' THEN                                      00003240
  /*YS*/    DO;                                                         00003250
  /*YS*/       FEIL_FUNNET = '1'B;                                      00003260
  /*YS*/       UPS.TILL_EKNR = 303;                                     00003270
  /*YS*/       UPS.UFGNR     = 999;                                     00003280
  /*YS*/    END;                                                        00003290
                                                                        00003300
  /* ******************************************************** */        00003310
  /* ERIK 19.1.88.                                            */        00003320
  /* ******************************************************** */        00003330
                                                                        00003340
    IF VERIFY(UPS.NORSK_BOSATT,'JN') ^= 0 THEN                          00003350
       DO;                                                              00003360
          FEIL_FUNNET        = '1'B;                                    00003370
          UPS.NORSK_BOSATTNR = 8;                                       00003380
       END;                                                             00003390
    /*                                                                  00003400
    IF ^F_NUMERISK(F_FELT_PIC_CHAR2(UPS.BT_ANT)) THEN                   00003410
       DO;                                                              00003420
          FEIL_FUNNET = '1'B;                                           00003430
          UPS.BT_ANTNR = 200;                                           00003440
       END;                                                             00003450
    ELSE                                                                00003460
    */                                                                  00003470
    IF UPS.BT_ANT > 12 THEN                                             00003480
       DO;                                                              00003490
          FEIL_FUNNET = '1'B;                                           00003500
          UPS.BT_ANTNR = 7;                                             00003510
       END;                                                             00003520
                                                                        00003530
                                                                        00003540
  /*YS*/  IF ^(UPS.YSKADE_TILLEGG = 'J' ! UPS.YSKADE_TILLEGG = ' ')     00003550
  /*YS*/     THEN                                                       00003560
  /*YS*/        DO;                                                     00003570
  /*YS*/           FEIL_FUNNET   ='1'B;                                 00003580
  /*YS*/           UPS.YSKADE_TILLEGGNR = 300;                          00003590
  /*YS*/        END;                                                    00003600
                                                                        00003610
                                                                        00003620
  /* DERSOM VP_ÅR1 ER NULL NOEN AV DE ANDRE UTFYLT, NULLES DISSE  */    00003630
                                                                        00003640
    DO J = 1 TO 4 UNTIL(F_FELT_PIC_CHAR2(UPS.VP_ÅR(J) = '00'));         00003650
       IF F_FELT_PIC_CHAR2(UPS.VP_ÅR(J)) = '00' THEN                    00003660
          DO TELL            = J TO 4;                                  00003670
             UPS.VP_ÅR(TELL) = 0;                                       00003680
          END;                                                          00003690
    END;                                                                00003700
    DO IÅR = 1 TO 4 WHILE (F_FELT_PIC_CHAR2(UPS.VP_ÅR(IÅR)) ^= '00');   00003710
       IF ^F_NUMERISK(F_FELT_PIC_CHAR2(UPS.VP_ÅR(IÅR))) THEN            00003720
          DO;                                                           00003730
             FEIL_FUNNET      = '1'B;                                   00003740
             UPS.VP_ÅRNR(IÅR) = 200;                                    00003750
          END;                                                          00003760
       ELSE                                                             00003770
          IF ^(UPS.VP_ÅR(IÅR)> 66 & UPS.VP_ÅR(IÅR)<= DAGENS_DATO.ÅR) !  00003780
             UPS.VP_ÅR(IÅR) < (FNR.AAR + 17)                       THEN 00003790
             DO;                                                        00003800
                FEIL_FUNNET      = '1'B;                                00003810
                UPS.VP_ÅRNR(IÅR) = 47;                                  00003820
             END;                                                       00003830
    END;                                                                00003840
    IF ^(UPS.VILKÅR_8_1 = 'J' ! UPS.VILKÅR_8_1 = 'N' !                  00003850
                                              UPS.VILKÅR_8_1 = ' ') THEN00003860
       DO;                                                              00003870
          FEIL_FUNNET      = '1'B;                                      00003880
          UPS.VILKÅR_8_1NR = 122;                                       00003890
       END;                                                             00003900
    IF ^(UPS.VILKÅR_8_4 = 'J' ! UPS.VILKÅR_8_4 = 'N') THEN              00003910
       DO;                                                              00003920
          FEIL_FUNNET      = '1'B;                                      00003930
          UPS.VILKÅR_8_4NR = 45;                                        00003940
       END;                                                             00003950
    IF ^F_NUMERISK(F_FELT_PIC_CHAR3(UPS.UFG)) THEN                      00003960
       DO;                                                              00003970
          FEIL_FUNNET = '1'B;                                           00003980
          UPS.UFGNR   = 200;                                            00003990
       END;                                                             00004000
    ELSE                                                                00004010
 /* ********************************************************* */        00004020
 /* HER KOMMER YRKESSKADEPENSJONENE.  ERIK 8.9.87             */        00004030
 /* SKAL GODTA F.O.M 15 %                                     */        00004040
 /* ********************************************************* */        00004050
 /* ********************************************************* */        00004060
 /* VI SKAL GODTA BLANK I UFG, DERSOM 'J' I YSKADE_TILLEGG.   */        00004070
 /* TRUDE 14.6.88                                             */        00004080
 /* ********************************************************* */        00004090
                                                                        00004100
 /*YS*/ IF (UPS.YSKADE_TILLEGG = 'J') & ^(                              00004110
 /*YS*/     UPS.UFG = 15 ! UPS.UFG = 20 ! UPS.UFG = 25 ! UPS.UFG = 30 ! 00004120
 /*YS*/     UPS.UFG = 35 ! UPS.UFG = 40 ! UPS.UFG = 45 !                00004130
 /*YS*/     UPS.UFG = 50 ! UPS.UFG = 55 ! UPS.UFG = 60 ! UPS.UFG = 65 ! 00004140
 /*YS*/     UPS.UFG = 70 ! UPS.UFG = 75 ! UPS.UFG = 80 ! UPS.UFG = 85 ! 00004150
 /*YS*/     UPS.UFG = 90 ! UPS.UFG = 95 ! UPS.UFG = 100 !               00004160
 /*YS*/                                   UPS.UFG = 0   )  THEN         00004170
 /*YS*/     DO;                                                         00004180
 /*YS*/        FEIL_FUNNET = '1'B;                                      00004190
 /*YS*/        UPS.UFGNR   = 350;                                       00004200
 /*YS*/     END;                                                        00004210
 /*YS*/ ELSE                                                            00004220
 /*YS*/   IF ^(UPS.YSKADE_TILLEGG = 'J') & ^(                           00004230
            UPS.UFG = 50 ! UPS.UFG = 55 ! UPS.UFG = 60 ! UPS.UFG = 65 ! 00004240
            UPS.UFG = 70 ! UPS.UFG = 75 ! UPS.UFG = 80 ! UPS.UFG = 85 ! 00004250
            UPS.UFG = 90 ! UPS.UFG = 95 ! UPS.UFG = 100) THEN           00004260
            DO;                                                         00004270
               FEIL_FUNNET = '1'B;                                      00004280
               UPS.UFGNR   = 38;                                        00004290
            END;                                                        00004300
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(UPS.UFT_MÅ)) THEN                   00004310
       DO;                                                              00004320
          FEIL_FUNNET  = '1'B;                                          00004330
          UPS.UFT_MÅNR = 200;                                           00004340
       END;                                                             00004350
    ELSE                                                                00004360
       IF ^F_GYLDIG_DATO(UPS.UFT_MÅ) THEN                               00004370
          DO;                                                           00004380
             FEIL_FUNNET  = '1'B;                                       00004390
             UPS.UFT_MÅNR = 40;                                         00004400
          END;                                                          00004410
                                                                        00004420
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(UPS.INNTEKT_FØR_UP)) THEN           00004430
       DO;                                                              00004440
          FEIL_FUNNET        = '1'B;                                    00004450
          UPS.INNTEKT_FØR_UPNR = 200;                                   00004460
       END;                                                             00004470
                                                                        00004480
    IF UPS.INNTEKT_FØR_UP > 0 & UPS.ATT_UF = 'A' THEN                   00004490
       DO;                                                              00004500
          FEIL_FUNNET        = '1'B;                                    00004510
          UPS.INNTEKT_FØR_UPNR = 399;   /* JD 02.97 */                  00004520
       END;                                                             00004530
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(UPS.PI)) THEN                       00004540
       DO;                                                              00004550
          FEIL_FUNNET = '1'B;                                           00004560
          UPS.PINR    = 200;                                            00004570
       END;                                                             00004580
    IF ^F_NUMERISK(F_FELT_PIC_CHAR2(UPS.YRKE)) THEN                     00004590
       DO;                                                              00004600
          FEIL_FUNNET = '1'B;                                           00004610
          UPS.YRKENR  = 200;                                            00004620
       END;                                                             00004630
    ELSE                                                                00004640
       IF ^ (UPS.YRKE >= 0 & UPS.YRKE <= 19) ! UPS.YRKE = 8 THEN        00004650
          DO;                                                           00004660
             FEIL_FUNNET = '1'B;                                        00004670
             UPS.YRKENR  = 42;                                          00004680
          END;                                                          00004690
                                                                        00004700
    W603_KAP18        = '0'B;                                           00004710
                                                                        00004720
    IF UPS.PRIMDIAG  ^= '      '  &                                     00004730
       W01_REST_PRIM ^= 'XX'      THEN                                  00004740
       DO;                                                              00004750
          /*-------------------------------------------------------*/   00004760
          /* SJEKKER OM GYLDIG DIAGNOSE-KODE MOT DIAGNOSE-FILEN    */   00004770
          /* SJEKKER OM PRIMÆRDIAGNOSE ER INNEFOR DE INTERVALLER   */   00004780
          /* SOM KREVER SEK.DIAG FRA KAP.18                        */   00004790
          /*-------------------------------------------------------*/   00004800
                                                                        00004810
          EXEC CICS HANDLE CONDITION         NOTFND (NOTFND1);          00004820
          EXEC CICS READ DATASET ('DIAGNOS') RIDFLD (UPS.PRIMDIAG)      00004830
                                             INTO   (W01_DIA_RECL);     00004840
                                                                        00004850
          IF VERIFY (UPS.PRIMDIAG , '0123456789')  = 0 THEN             00004860
             DO;                                                        00004870
                W603_DIAG         =  UPS.PRIMDIAG;                      00004880
                                                                        00004890
                IF (W603_D_P     >=  905000  &                          00004900
                    W603_D_P     <=  909900   )  !                      00004910
                   (W603_D_P     >=  998000  &                          00004920
                    W603_D_P     <=  998901   )      THEN               00004930
                                                                        00004940
                    W603_KAP18    = '1'B;                               00004950
             END;                                                       00004960
       END;                                                             00004970
                                                                        00004980
    GOTO DIAG_UT1;                                                      00004990
                                                                        00005000
 NOTFND1:                                                               00005010
    FEIL_FUNNET        = '1'B;                                          00005020
    UPS.PRIMDIAGNR     =  43;                                           00005030
                                                                        00005040
 DIAG_UT1:                                                              00005050
    IF UPS.SEKUDIAG   ^= '      ' &                                     00005060
       W01_REST_SEKU  ^= 'XX'     THEN                                  00005070
       DO;                                                              00005080
          W603_DIAG    =  UPS.SEKUDIAG;                                 00005090
                                                                        00005100
          IF W603_KAP18                       THEN                      00005110
             DO;                                                        00005120
                IF (W603_S12 ^=   'E9'     &                            00005130
                    W603_S12 ^=   'E8'      ) !                         00005140
                                                                        00005150
                   VERIFY (W603_S6,'123456789') > 0 THEN                00005160
                   DO;                                                  00005170
                      FEIL_FUNNET    = '1'B;                            00005180
                      UPS.SEKUDIAGNR =  295;                            00005190
                   END;                                                 00005200
                                                                        00005210
                ELSE DO;                                                00005220
                      /*-----------------------------------------*/     00005230
                      /* OPPSLAG MED SIFFER 1-5 I DIAGNOSE KAP18 */     00005240
                      /*-----------------------------------------*/     00005250
                                                                        00005260
                      EXEC CICS HANDLE  CONDITION   NOTFND (NOTFND2);   00005270
                      EXEC CICS READ    DATASET   ('DIAGNOS' )          00005280
                                        RIDFLD    ( W603_KEY )          00005290
                                        INTO      ( W01_DIA_RECL)       00005300
                                        LENGTH    ( W603_DIAG_LENGTH)   00005310
                                        KEYLENGTH ( W603_KEY_LENGTH )   00005320
                                        GENERIC                         00005330
                                        EQUAL;                          00005340
                      GOTO DIAG_UT2;                                    00005350
                   END;                                                 00005360
             END;                                                       00005370
          ELSE                                                          00005380
             DO;                                                        00005390
                /*-----------------------------------------------*/     00005400
                /* PRIM DIAG ULIK KAP18. SJEKKER OM SEKU DIAG =  */     00005410
                /*-----------------------------------------------*/     00005420
                IF W603_S12  =   'E9'     !                             00005430
                   W603_S12  =   'E8'                THEN               00005440
                   DO;                                                  00005450
                      FEIL_FUNNET    = '1'B;                            00005460
                      UPS.SEKUDIAGNR =  296;                            00005470
                      GOTO DIAG_UT2;                                    00005480
                   END;                                                 00005490
                                                                        00005500
             END;                                                       00005510
                                                                        00005520
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);                   00005530
          EXEC CICS READ DATASET ('DIAGNOS') RIDFLD (UPS.SEKUDIAG)      00005540
                                             INTO   (W01_DIA_RECL);     00005550
       END;                                                             00005560
    ELSE                                                                00005570
       DO;                                                              00005580
          /*--------------------------------------------------------*/  00005590
          /* SEKU DIAG IKKE REG. SJEKKER OM PRIM DIAG =  KAP18-KODE */  00005600
          /*--------------------------------------------------------*/  00005610
          IF W603_KAP18                              THEN               00005620
             DO;                                                        00005630
                FEIL_FUNNET          = '1'B;                            00005640
                UPS.SEKUDIAGNR       =  297;                            00005650
             END;                                                       00005660
       END;                                                             00005670
                                                                        00005680
    GOTO DIAG_UT2;                                                      00005690
                                                                        00005700
 NOTFND2:                                                               00005710
    FEIL_FUNNET        = '1'B;                                          00005720
    UPS.SEKUDIAGNR     = 44;                                            00005730
                                                                        00005740
 DIAG_UT2:                                                              00005750
                                                                        00005760
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(UPS.VIRK_DATO_MÅ)) THEN             00005770
       DO;                                                              00005780
          FEIL_FUNNET        = '1'B;                                    00005790
          UPS.VIRK_DATO_MÅNR = 200;                                     00005800
       END;                                                             00005810
    ELSE                                                                00005820
       DO;                                                              00005830
          IF ^F_GYLDIG_DATO(UPS.VIRK_DATO_MÅ) THEN                      00005840
             DO;                                                        00005850
                FEIL_FUNNET        = '1'B;                              00005860
                UPS.VIRK_DATO_MÅNR = 9;                                 00005870
             END;                                                       00005880
          ELSE                                                          00005890
             IF HJ_VIRK_DATO_ÅM < 6701 THEN                             00005900
                DO;                                                     00005910
                   FEIL_FUNNET        = '1'B;                           00005920
                   UPS.VIRK_DATO_MÅNR = 9;                              00005930
                END;                                                    00005940
                                                                        00005950
 /* LOVENDRING FRA 0191 - UTLAND PÅ NY BLANKETT - HL 30.11.90*/         00005960
                                                                        00005970
             ELSE                                                       00005980
             IF HJ_VIRK_DATO_ÅM > 9100     &                            00005990
                UPS.NORSK_BOSATT = 'N'      THEN                        00006000
                DO;                                                     00006010
                   FEIL_FUNNET        = '1'B;                           00006020
                   UPS.VIRK_DATO_MÅNR = 363;                            00006030
                END;                                                    00006040
       END;                                                             00006050
    IF F_FELT_PIC_CHAR11(UPS.FNR_EK) ^= (11)'0' THEN                    00006060
       DO;                                                              00006070
          IF ^F_NUMERISK(F_FELT_PIC_CHAR11(UPS.FNR_EK)) THEN            00006080
             DO;                                                        00006090
                FEIL_FUNNET  = '1'B;                                    00006100
                UPS.FNR_EKNR = 200;                                     00006110
             END;                                                       00006120
          ELSE                                                          00006130
             IF ^F_GYLDIG_FNR(UPS.FNR_EK) THEN                          00006140
                DO;                                                     00006150
                   FEIL_FUNNET  = '1'B;                                 00006160
                   UPS.FNR_EKNR = 1;                                    00006170
                END;                                                    00006180
             ELSE                                                       00006190
                DO;                                                     00006200
                   FNR_REG.FNR1 = UPS.FNR_EK;                           00006210
                   EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);00006220
                   IF FNR_REG.FNR2 > 0 THEN                             00006230
                      DO;                                               00006240
                         UPS.FNR_EKNR   = 203;                          00006250
                         UPS.FNR_GML_EK = UPS.FNR_EK;                   00006260
                         UPS.FNR_EK     = FNR_REG.FNR2;                 00006270
                      END;                                              00006280
                END;                                                    00006290
          IF UPS.EK_INNT = 'J' THEN                                     00006300
             DO;                                                        00006310
                IF F_SNU_DATO(UPS.VIRK_DATO_MÅ) < 8407 THEN             00006320
                   DO;                                                  00006330
                      FEIL_FUNNET = '1'B;                               00006340
                      UPS.VIRK_DATO_MÅNR = 273;                         00006350
                   END;                                                 00006360
                ELSE                                                    00006370
                   IF  UPS.SIVILSTAND ^= 'G' THEN                       00006380
                       DO;                                              00006390
                          FEIL_FUNNET = '1'B;                           00006400
                          UPS.SIVILSTANDNR = 274;                       00006410
                       END;                                             00006420
             END;                                                       00006430
          ELSE                                                          00006440
             IF UPS.EK_INNT  ^= 'N' THEN                                00006450
                DO;                                                     00006460
                   FEIL_FUNNET = '1'B;                                  00006470
                   UPS.EK_INNTNR = 272;                                 00006480
                END;                                                    00006490
       END;                                                             00006500
                                                                        00006510
 /* HER SETTES VERDIER INN I MENY_OMR                                 */00006520
                                                                        00006530
    FØDSNUMMER    = UPS.FNR;                                            00006540
    VIRKNINGSDATO = UPS.VIRK_DATO_MÅ;                                   00006550
 %SKIP(3);                             /*  */                           00006560
 /*   KRYSS KONTROLLER       */                                         00006570
 %SKIP;                                                                 00006580
    IF ^FEIL_FUNNET THEN                                                00006590
       DO;                                                              00006600
          HJ_UFT_MÅ       = UPS.UFT_MÅ;                                 00006610
          UFT_Å           = HJ_UFT_Å;                                   00006620
          UFT_M           = HJ_UFT_M;                                   00006630
          ALDER           = F_ALDER(UPS.FNR,UPS.UFT_MÅ);                00006640
                                                                        00006650
                                                                        00006660
                                                                        00006670
 /*LOVENDRING MED VIRKNING FRA 1.1.91 SP : */                           00006680
          IF  HJ_VIRK_DATO_ÅM > 9200 &                                  00006690
              HJ_UFT_ÅM       < 9200     THEN                           00006700
                                                                        00006710
               DIV_PARAM_OMR.REGN_1291 = 'J';                           00006720
                                                                        00006730
                                                                        00006740
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00006750
                                                                        00006760
          IF HJ_VIRK_DATO_ÅM > 9101 THEN                                00006770
             DO;                                                        00006780
                ALDERSGRENSE = 1601;                                    00006790
                IF ALDER < 1601 THEN                                    00006800
                   DO;                                                  00006810
                      FEIL_FUNNET = '1'B;                               00006820
                      UPS.UFT_MÅNR = 196;                               00006830
                   END;                                                 00006840
             END;                                                       00006850
          ELSE                                                          00006860
          IF HJ_VIRK_DATO_ÅM > 7600 THEN                                00006870
             DO;                                                        00006880
                ALDERSGRENSE = 1600;                                    00006890
                IF ALDER < 1600 THEN                                    00006900
                   DO;                                                  00006910
                      FEIL_FUNNET = '1'B;                               00006920
                      UPS.UFT_MÅNR = 196;                               00006930
                   END;                                                 00006940
             END;                                                       00006950
                                                                        00006960
          ELSE                                                          00006970
             DO;                                                        00006980
                ALDERSGRENSE = 1800;                                    00006990
                IF ALDER < 1800 THEN                                    00007000
                   DO;                                                  00007010
                      FEIL_FUNNET = '1'B;                               00007020
                      UPS.UFT_MÅNR = 197;                               00007030
                   END;                                                 00007040
             END;                                                       00007050
                                                                        00007060
          IF ALDER ^= ALDERSGRENSE             THEN                     00007070
             IF HJ_UFT_ÅM > DAGENS_DATO_ÅM     THEN                     00007080
                DO;                                                     00007090
                   FEIL_FUNNET = '1'B;                                  00007100
                   UPS.UFT_MÅNR = 206;                                  00007110
                END;                                                    00007120
             ELSE;                                                      00007130
          ELSE;                                                         00007140
                                                                        00007150
          ALDER           = F_ALDER(UPS.FNR,UPS.VIRK_DATO_MÅ);          00007160
          IF ALDER > 1812 THEN                                          00007170
             UPS.VILKÅR_8_1   = ' ';                                    00007180
          IF F_KJØNN(UPS.FNR) = 'K' THEN                                00007190
             DO IÅR = 1 TO 2;                                           00007200
                IF UPS.VP_ÅR(IÅR) > 0 THEN                              00007210
                   DO;                                                  00007220
                      FEIL_FUNNET      = '1'B;                          00007230
                      UPS.VP_ÅRNR(IÅR) = 47;                            00007240
                      UPS.FNRNR        = 999;                           00007250
                   END;                                                 00007260
             END;                                                       00007270
          IF ^FEIL_FUNNET & UPS.VP_ÅR(1) > 0 & UPS.VP_ÅR(2) > 0 &       00007280
                                       UPS.VP_ÅR(1) = UPS.VP_ÅR(2) THEN 00007290
             DO;                                                        00007300
                FEIL_FUNNET    = '1'B;                                  00007310
                UPS.VP_ÅRNR(1) = 124;                                   00007320
                UPS.VP_ÅRNR(2) = 999;                                   00007330
             END;                                                       00007340
          IF HJ_VIRK_DATO_ÅM < 8404 & UPS.ATT_UF = 'A' THEN             00007350
             DO;                                                        00007360
                FEIL_FUNNET = '1'B;                                     00007370
                UPS.VIRK_DATO_MÅNR = 269;                               00007380
                UPS.ATT_UFNR = 999;                                     00007390
             END;                                                       00007400
          IF HJ_VIRK_DATO_ÅM < 6701 & UPS.UFG < 100 THEN                00007410
             DO;                                                        00007420
                FEIL_FUNNET = '1'B;                                     00007430
                UPS.VIRK_DATO_MÅNR = 39;                                00007440
                UPS.UFGNR = 999;                                        00007450
             END;                                                       00007460
          ELSE                                                          00007470
             IF HJ_UFT_ÅM > HJ_VIRK_DATO_ÅM THEN                        00007480
               DO;                                                      00007490
                  FEIL_FUNNET        = '1'B;                            00007500
                  UPS.UFT_MÅNR       = 41;                              00007510
                  UPS.VIRK_DATO_MÅNR = 999;                             00007520
               END;                                                     00007530
             ELSE                                                       00007540
                IF ALDER < 1900 & VILKÅR_8_1 = ' ' THEN                 00007550
                   DO;                                                  00007560
                      FEIL_FUNNET      = '1'B;                          00007570
                      UPS.VILKÅR_8_1NR = 46;                            00007580
                   END;                                                 00007590
                                                                        00007600
                ELSE                                                    00007610
                                                                        00007620
 /*ENDRET 17.2.88 HL - CALL PÅ F_40DAGER ER ERSTATTET MED F_6MDR */     00007630
 /*                IF ^ F_40DAGER(HJ_VIRK_DATO_ÅM)          THEN */     00007640
                                                                        00007650
                   IF ^ F_6MDR(HJ_VIRK_DATO_ÅM)          THEN           00007660
                      DO;                                               00007670
                         FEIL_FUNNET        = '1'B;                     00007680
 /***********************UPS.VIRK_DATO_MÅNR = 48;*******************/   00007690
 /***********************UPS.VIRK_DATO_MÅNR = 281;******************/   00007700
 /* HL                   UPS.VIRK_DATO_MÅNR = 10;                  */   00007710
                                                                        00007720
 /*HL*/                  UPS.VIRK_DATO_MÅNR = 205;                      00007730
                      END;                                              00007740
                                                                        00007750
                   ELSE                                                 00007760
          IF HJ_VIRK_DATO_ÅM < 7601 & ALDER < 1800 THEN                 00007770
             DO;                                                        00007780
                FEIL_FUNNET        = '1'B;                              00007790
                UPS.FNRNR          = 49;                                00007800
                UPS.VIRK_DATO_MÅNR = 999;                               00007810
             END;                                                       00007820
                                                                        00007830
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00007840
                                                                        00007850
          ELSE                                                          00007860
             IF HJ_VIRK_DATO_ÅM > 9101 & ALDER < 1601 THEN              00007870
                DO;                                                     00007880
                   FEIL_FUNNET        = '1'B;                           00007890
                   UPS.FNRNR          = 50;                             00007900
                   UPS.VIRK_DATO_MÅNR = 999;                            00007910
                END;                                                    00007920
          ELSE                                                          00007930
             IF HJ_VIRK_DATO_ÅM > 7600 & ALDER < 1600 THEN              00007940
                DO;                                                     00007950
                   FEIL_FUNNET        = '1'B;                           00007960
                   UPS.FNRNR          = 50;                             00007970
                   UPS.VIRK_DATO_MÅNR = 999;                            00007980
                END;                                                    00007990
             ELSE                                                       00008000
                IF HJ_VIRK_DATO_ÅM < 7301 & ALDER >= 7000 THEN          00008010
                   DO;                                                  00008020
                      FEIL_FUNNET        = '1'B;                        00008030
                      UPS.FNRNR          = 51;                          00008040
                      UPS.VIRK_DATO_MÅNR = 999;                         00008050
                   END;                                                 00008060
                                                                        00008070
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00008080
                                                                        00008090
                ELSE                                                    00008100
                IF HJ_VIRK_DATO_ÅM > 9100 & ALDER > 6700 THEN           00008110
                      DO;                                               00008120
                         FEIL_FUNNET        = '1'B;                     00008130
                         UPS.FNRNR          = 52;                       00008140
                         UPS.VIRK_DATO_MÅNR = 999;                      00008150
                      END;                                              00008160
                ELSE                                                    00008170
                   IF HJ_VIRK_DATO_ÅM > 7300 &                          00008180
                      HJ_VIRK_DATO_ÅM < 9100 & ALDER > 6612 THEN        00008190
                      DO;                                               00008200
                         FEIL_FUNNET        = '1'B;                     00008210
                         UPS.FNRNR          = 52;                       00008220
                         UPS.VIRK_DATO_MÅNR = 999;                      00008230
                      END;                                              00008240
                   ELSE                                                 00008250
             IF (HJ_VIRK_DATO_ÅM < 7101 &                               00008260
                 UPS.YSKADE_TILLEGG = 'J') THEN                         00008270
                DO;                                                     00008280
                   FEIL_FUNNET          = '1'B;                         00008290
                   UPS.VIRK_DATO_MÅNR   = 310;                          00008300
                   UPS.YSKADE_TILLEGGNR = 999;                          00008310
                END;                                                    00008320
                   ELSE                                                 00008330
                      IF UPS.SIVILSTAND ^= 'P' &                        00008340
                        (UPS.FNR_EK > 0 & F_KJØNN(UPS.FNR)              00008350
                                           = F_KJØNN(UPS.FNR_EK))THEN   00008360
                         DO;                                            00008370
                            FEIL_FUNNET  = '1'B;                        00008380
                            UPS.FNRNR    = 16;                          00008390
                            UPS.FNR_EKNR = 999;                         00008400
                         END;                                           00008410
                      ELSE                                              00008420
                      IF UPS.SIVILSTAND = 'P' &                         00008430
                        (UPS.FNR_EK > 0 & F_KJØNN(UPS.FNR)              00008440
                                          ^= F_KJØNN(UPS.FNR_EK))THEN   00008450
                         DO;                                            00008460
                            FEIL_FUNNET  = '1'B;                        00008470
                            UPS.FNRNR    = 392;                         00008480
                            UPS.FNR_EKNR = 999;                         00008490
                         END;                                           00008500
            ELSE                                                        00008510
            IF ^(UPS.SIVILSTAND = 'G' ! UPS.SIVILSTAND = 'A'  !         00008520
                 UPS.SIVILSTAND = 'W' ! UPS.SIVILSTAND = 'P') &         00008530
            (UPS.FNR_EK > 0 ! UPS.NAVN_EK ^= (25)' ') THEN              00008540
               DO;                                                      00008550
                  FEIL_FUNNET = '1'B;                                   00008560
                  UPS.SIVILSTANDNR = 123;                               00008570
                  UPS.FNR_EKNR = 999;                                   00008580
                  UPS.NAVN_EKNR = 999;                                  00008590
               END;                                                     00008600
            ELSE                                                        00008610
            IF UPS.FNR_EK > 0 & UPS.NAVN_EK = (25)' ' THEN              00008620
               DO;                                                      00008630
                  FEIL_FUNNET = '1'B;                                   00008640
                  UPS.NAVN_EKNR = 118;                                  00008650
               END;                                                     00008660
            ELSE                                                        00008670
            IF UPS.TILL_EK = 'J' THEN                                   00008680
               DO;                                                      00008690
                  IF UPS.NAVN_EK = (25)' ' THEN                         00008700
                     DO;                                                00008710
                        FEIL_FUNNET = '1'B;                             00008720
                        UPS.NAVN_EKNR = 19;                             00008730
                        UPS.TILL_EKNR = 999;                            00008740
                     END;                                               00008750
                  ELSE                                                  00008760
                  IF UPS.FNR_EK = 0 THEN                                00008770
                     DO;                                                00008780
                        FEIL_FUNNET = '1'B;                             00008790
                        UPS.FNR_EKNR = 15;                              00008800
                        UPS.TILL_EKNR = 999;                            00008810
                     END;                                               00008820
                  ELSE                                                  00008830
                  IF ^F_EK_ALDER_GYLDIG(UPS.FNR_EK,UPS.VIRK_DATO_MÅ)    00008840
                  THEN                                                  00008850
                     DO;                                                00008860
                        FEIL_FUNNET = '1'B;                             00008870
                        UPS.FNR_EKNR = 17;                              00008880
                        UPS.VIRK_DATO_MÅNR = 999;                       00008890
                        UPS.TILL_EKNR = 999;                            00008900
                     END;                                               00008910
                  ELSE                                                  00008920
                  IF ^(UPS.SIVILSTAND = 'G' ! UPS.SIVILSTAND = 'A') THEN00008930
                     DO;                                                00008940
                        FEIL_FUNNET = '1'B;                             00008950
                        UPS.SIVILSTANDNR = 54;                          00008960
                        UPS.TILL_EKNR = 999;                            00008970
                     END;                                               00008980
               END;                                                     00008990
            ELSE                                                        00009000
               DO;                                                      00009010
               IF (UPS.FNR_EK = 0 ! UPS.NAVN_EK = (25)' ') &            00009020
               (UPS.SIVILSTAND = 'G' ! UPS.SIVILSTAND = 'A') THEN       00009030
                  DO;                                                   00009040
                     FEIL_FUNNET = '1'B;                                00009050
                     UPS.FNR_EKNR = 18;                                 00009060
                     UPS.NAVN_EKNR = 999;                               00009070
                     UPS.SIVILSTANDNR = 999;                            00009080
                  END;                                                  00009090
               IF (UPS.FNR_EK = 0 ! UPS.NAVN_EK = (25)' ') &            00009100
               (UPS.SIVILSTAND = 'W') THEN                              00009110
                  DO;                                                   00009120
                     FEIL_FUNNET = '1'B;                                00009130
                     UPS.FNR_EKNR = 390;                                00009140
                     UPS.NAVN_EKNR = 999;                               00009150
                     UPS.SIVILSTANDNR = 999;                            00009160
                  END;                                                  00009170
               IF (UPS.FNR_EK = 0 ! UPS.NAVN_EK = (25)' ') &            00009180
               (UPS.SIVILSTAND = 'P') THEN                              00009190
                  DO;                                                   00009200
                     FEIL_FUNNET = '1'B;                                00009210
                     UPS.FNR_EKNR = 391;                                00009220
                     UPS.NAVN_EKNR = 999;                               00009230
                     UPS.SIVILSTANDNR = 999;                            00009240
                  END;                                                  00009250
              END;                                                      00009260
         END;                                                           00009270
      IF UPS.NORSK_BOSATT = 'J' &                                       00009280
         (UPS.VILKÅR_8_1 = 'J' ! UPS.VILKÅR_8_1 = ' ') THEN             00009290
         DO;                                                            00009300
            IF FNR.ÅRHUNDRE < 5       THEN                              00009310
               DO;                                                      00009320
                  UPSP.TT_F67 = 67 - (FNR.AAR + 16);                    00009330
                  IF (FNR.AAR + 16) > 67 THEN                           00009340
                     DO;                                                00009350
                        UPSP.TT_F67 = 0;                                00009360
                        IF UFT_Å > 66  &                                00009370
                           UFT_Å >= (FNR.AAR + 16)   THEN               00009380
                           DO;                                          00009390
                                                                        00009400
 /* UTGÅR - FEIL              UPSP.TT_E66_Å = UFT_Å-(FNR.AAR + 16);*/   00009410
 /* UTGÅR - FEIL              UPSP.TT_E66_M = UFT_M;               */   00009420
                                                                        00009430
 /* ENDRET 7.8.85 - HL.  TT SKAL REGNES SOM FØLGER :               */   00009440
                                                                        00009450
                              IF UFT_M < FNR.MND          THEN          00009460
                                 DO;                                    00009470
                                    UPSP.TT_E66_Å = UFT_Å -             00009480
                                         (FNR.AAR + 17);                00009490
                                    UPSP.TT_E66_M = UFT_M -             00009500
                                          FNR.MND + 12;                 00009510
                                 END;                                   00009520
                              ELSE                                      00009530
                                                                        00009540
                                 DO;                                    00009550
                                    UPSP.TT_E66_Å = UFT_Å -             00009560
                                         (FNR.AAR + 16);                00009570
                                    UPSP.TT_E66_M = UFT_M -             00009580
                                          FNR.MND;                      00009590
                                 END;                                   00009600
                                                                        00009610
 /* HIT 7.8.85 - HL.                                             */     00009620
                                                                        00009630
                           END;                                         00009640
                        ELSE                                            00009650
                           DO;                                          00009660
                              UPSP.TT_E66_Å = 0;                        00009670
                              UPSP.TT_E66_M = 0;                        00009680
                           END;                                         00009690
                     END;                                               00009700
                  ELSE                                                  00009710
                     IF UFT_Å > 66    THEN                              00009720
                        DO;                                             00009730
                           UPSP.TT_E66_Å = UFT_Å - 67;                  00009740
                           UPSP.TT_E66_M = UFT_M;                       00009750
                        END;                                            00009760
                     ELSE                                               00009770
                        DO;                                             00009780
                           UPSP.TT_E66_Å = 0;                           00009790
                           UPSP.TT_E66_M = 0;                           00009800
                        END;                                            00009810
               END;                                                     00009820
            ELSE                                                        00009830
               DO;                                                      00009840
                  UPSP.TT_F67 = 67 - (FNR.AAR + 16 - 100);              00009850
                  IF UFT_Å > 66    THEN                                 00009860
                     DO;                                                00009870
                        UPSP.TT_E66_Å = UFT_Å - 67;                     00009880
                        UPSP.TT_E66_M = UFT_M;                          00009890
                     END;                                               00009900
                  ELSE                                                  00009910
                     DO;                                                00009920
                        UPSP.TT_E66_Å = 0;                              00009930
                        UPSP.TT_E66_M = 0;                              00009940
                     END;                                               00009950
               END;                                                     00009960
         END;                                                           00009970
   END KONTROLL_UP_SØKER;                                               00009980
                                                                        00009990
                                                                        00010000
  KONTROLL_YP:                                                          00010010
    PROC(FEIL_FUNNET);                                                  00010020
                                                                        00010030
   DCL FEIL_FUNNET   BIT(1);                                            00010040
                                                                        00010050
                                                                        00010060
    IF ^(UPY.VILKÅR_1_2_2A = 'J' ! UPY.VILKÅR_1_2_2A = ' ')             00010070
       THEN                                                             00010080
         DO;                                                            00010090
            FEIL_FUNNET   ='1'B;                                        00010100
            UPY.VILKÅR_1_2_2ANR = 301;                                  00010110
         END;                                                           00010120
                                                                        00010130
                                                                        00010140
    IF ^(UPY.VILKÅR_1_2_2B = 'J' ! UPY.VILKÅR_1_2_2B = ' ')             00010150
       THEN                                                             00010160
         DO;                                                            00010170
            FEIL_FUNNET   ='1'B;                                        00010180
            UPY.VILKÅR_1_2_2BNR = 302;                                  00010190
         END;                                                           00010200
                                                                        00010210
    IF ^F_NUMERISK(F_FELT_PIC_CHAR4(UPY.YST_MÅ)) THEN                   00010220
       DO;                                                              00010230
          FEIL_FUNNET    = '1'B;                                        00010240
          UPY.YST_MÅNR = 200;                                           00010250
       END;                                                             00010260
    ELSE                                                                00010270
       DO;                                                              00010280
        IF ^F_GYLDIG_DATO(UPY.YST_MÅ) THEN                              00010290
           DO;                                                          00010300
              FEIL_FUNNET    = '1'B;                                    00010310
              UPY.YST_MÅNR = 304;                                       00010320
           END;                                                         00010330
        ELSE                                                            00010340
           IF F_SNU_DATO(UPY.YST_MÅ) < 7101 THEN                        00010350
              DO;                                                       00010360
                 FEIL_FUNNET    = '1'B;                                 00010370
                 UPY.YST_MÅNR = 305;                                    00010380
              END;                                                      00010390
       END;                                                             00010400
                                                                        00010410
    IF ^(UPY.YSYKDOM = 'J' ! UPY.YSYKDOM = 'N')                         00010420
       THEN                                                             00010430
         DO;                                                            00010440
            FEIL_FUNNET   ='1'B;                                        00010450
            UPY.YSYKDOMNR = 306;                                        00010460
         END;                                                           00010470
                                                                        00010480
                                                                        00010490
    IF ^F_NUMERISK(F_FELT_PIC_CHAR3(UPY.YUG)) THEN                      00010500
       DO;                                                              00010510
          FEIL_FUNNET = '1'B;                                           00010520
          UPY.YUGNR = 200;                                              00010530
       END;                                                             00010540
    ELSE                                                                00010550
                                                                        00010560
                                                                        00010570
       IF UPY.YUG < 15 ! UPY.YUG > 100 THEN                             00010580
          DO;                                                           00010590
             FEIL_FUNNET = '1'B;                                        00010600
             UPY.YUGNR = 307;                                           00010610
          END;                                                          00010620
                                                                        00010630
 /* ********************************************************* */        00010640
 /* VI SKAL GODTA BLANK I UFG, DERSOM 'J' I YSKADE_TILLEGG.   */        00010650
 /* TRUDE 14.6.88                                             */        00010660
 /* ********************************************************* */        00010670
                                                                        00010680
    /* ELSE                                 */                          00010690
    /*    IF (UPS.UFG < 50) &               */                          00010700
    /*       (UPY.YUG ^= UPS.UFG) THEN      */                          00010710
    /*       DO;                            */                          00010720
    /*          FEIL_FUNNET = '1'B;         */                          00010730
    /*          UPY.YUGNR = 311;            */                          00010740
    /*       END;                           */                          00010750
                                                                        00010760
                                                                        00010770
                                                                        00010780
    IF ^(UPY.KAP_11_7_UTLØST = 'J' ! UPY.KAP_11_7_UTLØST = ' ')         00010790
        THEN                                                            00010800
         DO;                                                            00010810
            FEIL_FUNNET   ='1'B;                                        00010820
            UPY.KAP_11_7_UTLØSTNR = 308;                                00010830
         END;                                                           00010840
                                                                        00010850
                                                                        00010860
    IF VERIFY(UPY.YRKE11,'FMUEVSA') ^= 0 THEN                           00010870
       DO;                                                              00010880
          FEIL_FUNNET = '1'B;                                           00010890
          UPY.YRKE11NR =  309 ;                                         00010900
       END;                                                             00010910
                                                                        00010920
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(UPY.AÅI)) THEN                      00010930
       DO;                                                              00010940
          FEIL_FUNNET = '1'B;                                           00010950
          UPY.AÅINR = 200 ;                                             00010960
       END;                                                             00010970
                                                                        00010980
    IF F_FELT_PIC_CHAR11(UPY.FNR_EK) ^= (11) '0' THEN                   00010990
       DO;                                                              00011000
          FEIL_FUNNET         = '1'B;                                   00011010
          UPY.FNR_EKNR        = 315 ;                                   00011020
       END;                                                             00011030
                                                                        00011040
    IF F_FELT_PIC_CHAR11(UPY.FNR_SAMBOER) ^= (11) '0' THEN              00011050
       DO;                                                              00011060
          FEIL_FUNNET         = '1'B;                                   00011070
          UPY.FNR_SAMBOERNR   = 315 ;                                   00011080
       END;                                                             00011090
                                                                        00011100
    IF F_FELT_PIC_CHAR11(UPY.FNR_Y_BARN) ^= (11) '0' THEN               00011110
       DO;                                                              00011120
          FEIL_FUNNET         = '1'B;                                   00011130
          UPY.FNR_Y_BARNNR    =  315 ;                                  00011140
       END;                                                             00011150
                                                                        00011160
    IF UPY.PLEIEBARN ^= ' '  THEN                                       00011170
       DO;                                                              00011180
          FEIL_FUNNET         = '1'B;                                   00011190
          UPY.PLEIEBARNNR     = 315 ;                                   00011200
       END;                                                             00011210
                                                                        00011220
    IF ^FEIL_FUNNET THEN                                                00011230
       DO;                                                              00011240
                                                                        00011250
          IF F_SNU_DATO(UPY.YST_MÅ) >                                   00011260
                                    F_SNU_DATO(UPS.VIRK_DATO_MÅ) !      00011270
             F_SNU_DATO(UPY.YST_MÅ) >                                   00011280
                                    F_SNU_DATO(UPS.UFT_MÅ) THEN         00011290
             DO;                                                        00011300
                                                                        00011310
  /* ********************************************************** */      00011320
  /* FEIL,YSKADETIDSPUNKTET > VIRK ELLER > UFØRETIDSPUNKTET     */      00011330
  /* PÅ KAP.8 - BLANKETTEN.  ERIK 6.7.87                        */      00011340
  /* ********************************************************** */      00011350
                                                                        00011360
                FEIL_FUNNET    = '1'B;                                  00011370
                UPY.YST_MÅNR   =  312 ;                                 00011380
             END;                                                       00011390
                                                                        00011400
                                                                        00011410
          IF UPY.KAP_11_7_UTLØST = 'J' &                                00011420
             UPY.YUG > 29              THEN                             00011430
             DO;                                                        00011440
                                                                        00011450
  /* ********************************************************** */      00011460
  /* HVIS JA I ENGANGSUTLØST Y-PENSJON OG GRADEN      ER OVER   */      00011470
  /* 29 PROSENT, SÅ AVVISES BLANKETTEN.                         */      00011480
  /* ********************************************************** */      00011490
                                                                        00011500
                FEIL_FUNNET            = '1'B;                          00011510
                UPY.KAP_11_7_UTLØSTNR  =  313 ;                         00011520
                UPY.YUGNR              =  999 ;                         00011530
             END;                                                       00011540
                                                                        00011550
          IF UPY.KAP_11_7_UTLØST = 'J' &                                00011560
             UPS.UFG > 29              THEN                             00011570
             DO;                                                        00011580
                                                                        00011590
  /* ********************************************************** */      00011600
  /* HVIS JA I ENGANGSUTLØST Y-PENSJON OG SAMLET GRAD ER OVER   */      00011610
  /* 29 PROSENT, SÅ AVVISES BLANKETTEN.                         */      00011620
  /* ********************************************************** */      00011630
                                                                        00011640
                FEIL_FUNNET            = '1'B;                          00011650
                UPY.KAP_11_7_UTLØSTNR  =  313 ;                         00011660
                UPY.YUGNR              =  999 ;                         00011670
             END;                                                       00011680
                                                                        00011690
                                                                        00011700
                                                                        00011710
          IF UPY.KAP_11_7_UTLØST = 'J' &                                00011720
             UPS.BT_ANT > 0            THEN                             00011730
             DO;                                                        00011740
                                                                        00011750
  /* ********************************************************** */      00011760
  /* HVIS JA I ENGANGSUTLØST Y-PENSJON OG ANTALL BARN > 0 ,     */      00011770
  /* SKAL BLANKETTEN AVVISES.   TRUDE                           */      00011780
  /* ********************************************************** */      00011790
                                                                        00011800
                FEIL_FUNNET            = '1'B;                          00011810
                UPY.KAP_11_7_UTLØSTNR  =  329 ;                         00011820
                UPY.YUGNR              =  999 ;                         00011830
             END;                                                       00011840
          /* HIT TRUDE */                                               00011850
                                                                        00011860
                                                                        00011870
          IF UPY.YRKE11    = 'F' &                                      00011880
             UPY.AÅI      ^= 9999999 THEN                               00011890
             DO;                                                        00011900
                                                                        00011910
  /* ********************************************************** */      00011920
  /* KODE F = FISKER.  INNTEKT SKAL IKKE OPPGIS FOR DISSE.      */      00011930
  /* ********************************************************** */      00011940
                                                                        00011950
                FEIL_FUNNET     = '1'B;                                 00011960
                UPY.AÅINR       =  314;                                 00011970
                UPY.YRKE11NR    =  999;                                 00011980
             END;                                                       00011990
          ELSE                                                          00012000
             IF UPY.YRKE11    = 'A' &                                   00012010
                UPY.AÅI       = 9999999 THEN                            00012020
                DO;                                                     00012030
                                                                        00012040
  /* ********************************************************** */      00012050
  /* KODE A = ARBEIDSTAKER.  INNTEKT SKAL ALLTID OPPGIS.        */      00012060
  /* ********************************************************** */      00012070
                                                                        00012080
                   FEIL_FUNNET     = '1'B;                              00012090
                   UPY.AÅINR       =  316;                              00012100
                   UPY.YRKE11NR    =  999;                              00012110
                END;                                                    00012120
                                                                        00012130
          IF (UPY.YRKE11    = 'E' !                                     00012140
              UPY.YRKE11    = 'U' !                                     00012150
              UPY.YRKE11    = 'V' !                                     00012160
              UPY.YRKE11    = 'M' !                                     00012170
              UPY.YRKE11    = 'S'   ) &                                 00012180
              UPY.AÅI       = 9999999 THEN                              00012190
                                                                        00012200
  /* ********************************************************** */      00012210
  /* FOR YRKESKODENE E, U, V, M OG S KAN INNTEKT OPPGIS, MEN    */      00012220
  /* DET ER IKKE NOE KRAV OM DETTE.  JEG ER IMIDLERTID NOE      */      00012230
  /* USIKKER PÅ OM DETTE SKAL GJELDE FOR KODE S.  AVKLARES      */      00012240
  /* SENERE.  ERIK 29.3.88.                                     */      00012250
  /* ********************************************************** */      00012260
                                                                        00012270
             UPY.AÅI       = 0;                                         00012280
   /*************************************************************/      00012290
   /* DERSOM UFG = 0, FLYTTES YUG INN I FELTET . TRUDE          */      00012300
   /*************************************************************/      00012310
                                                                        00012320
          IF UPS.YSKADE_TILLEGG = 'J' THEN                              00012330
             DO;                                                        00012340
               IF UPS.UFG      = 0 THEN                                 00012350
                  UPS.UFG      = UPY.YUG;                               00012360
             END;                                                       00012370
                                                                        00012380
                                                                        00012390
          IF  UPY.YUG  >  UPS.UFG THEN                                  00012400
              DO;                                                       00012410
                                                                        00012420
  /* ********************************************************** */      00012430
  /* UFØREGRADEN I KAP. 8 ER MINDRE ENN Y-UFG.  BLANKETTEN      */      00012440
  /* SKAL FORKASTES.                                            */      00012450
  /* 20.6.88 VI SKAL GODTA BLANK I UFØREGRADEN I KAP 8, DERSOM  */      00012460
  /* 'J' I YSKADETILLEGG. TRUDE. (STJERNET UT  DENNE TEST)      */      00012470
  /* TATT MED IGJEN JD 0197                                     */      00012480
  /* ********************************************************** */      00012490
                                                                        00012500
                 FEIL_FUNNET     = '1'B;                                00012510
                 UPY.YUGNR       =  317 ;                               00012520
              END;                                                      00012530
                                                                        00012540
                                                                        00012550
          IF ^(UPY.VILKÅR_1_2_2A   = ' '  !                             00012560
               UPY.VILKÅR_1_2_2B   = ' '  )  &                          00012570
               UPS.NORSK_BOSATT = 'J'  THEN                             00012580
             DO;                                                        00012590
                                                                        00012600
  /* ********************************************************** */      00012610
  /* VILKÅR 1-2-2 ER UTFYLT.  PERSONEN ER DA IKKE BOSATT I      */      00012620
  /* NORGE, MEN UP-BLANKETTEN ER KRYSSET AV MED JA I FELTET     */      00012630
  /* NORSK BOSATT.  BLANKETTEN AVVISES.                         */      00012640
  /* ********************************************************** */      00012650
                                                                        00012660
                FEIL_FUNNET        = '1'B;                              00012670
                UPY.VILKÅR_1_2_2ANR  = 318 ;                            00012680
                UPY.VILKÅR_1_2_2BNR  = 999 ;                            00012690
             END;                                                       00012700
                                                                        00012710
                                                                        00012720
          ELSE                                                          00012730
             IF ^(UPY.VILKÅR_1_2_2A  = ' '  !                           00012740
                  UPY.VILKÅR_1_2_2B  = ' ' ) &                          00012750
                 (UPY.YUG    ^= UPS.UFG)   THEN                         00012760
                DO;                                                     00012770
                                                                        00012780
  /* ********************************************************** */      00012790
  /* PERSONEN ER IKKE BOSATT I NORGE.  KAP. 8 GRADEN ER UNDER   */      00012800
  /* 50 PROSENT, OG YRKEGRAD OG KAP. 8 GRADEN ER ULIK.          */      00012810
  /* BLANKETTEN SKAL AVVISES.                                   */      00012820
  /* ********************************************************** */      00012830
                                                                        00012840
                   FEIL_FUNNET          = '1'B;                         00012850
                   UPY.YUGNR            = 324 ;                         00012860
                   UPY.VILKÅR_1_2_2ANR  = 999 ;                         00012870
                   UPY.VILKÅR_1_2_2BNR  = 999 ;                         00012880
                END;                                                    00012890
       END;                                                             00012900
                                                                        00012910
    END KONTROLL_YP;                                                    00012920
