 /*       SIST ENDRET 26/05-94 11.07.53 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 25/02-94 12.23.58 AV   HERMAN                   */00000010
 /*       SIST ENDRET 03/09-93 09.56.20 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 26/08-93 14.46.56 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 05/07-90 09.25.36 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 17/03-89 15.01.20 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 29/04-83 13.31.07 AV   OLAV                     */00000060
 /*       SIST ENDRET 13/04-83 12.03.47 AV   OLAV                     */00000070
 /* ******************************************************************/ 00000080
 /* IDENTIFIKASJON                                                    */00000090
 /*     R0014133 - F_BEREGN_SÆRTILLEGG - FUNKSJON  I PLI.             */00000100
 /*     PROGRAMMERER: TOM JØRGENSEN, JUNI-82.                         */00000110
 /*     ENDRET I JULI AV KARIN                                        */00000120
 /* HENSIKT                                                           */00000130
 /*     BEREGNE SÆRTILLEGG.                                           */00000140
 /* PROGRAMTILKNYTNING                                                */00000150
 /*     PROSEDYREN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.             */00000160
 /* BRUK                                                              */00000170
 /*     ST = F_BEREGN_SÆRTILLEGG(SUM_TP,ÅFT_MAX,FORH_INDIKATOR,       */00000180
 /*                              ST_PROSENT,GRAD,TT_ANV)              */00000190
 /* ***************************************************************** */00000200
                                                                        00000210
 F_BEREGN_SÆRTILLEGG:                                                   00000220
  PROC (SUM_TP,ÅFT_MAX,FORH_INDIKATOR,ST_PROSENT,GRAD,TT_ANV)           00000230
       RETURNS(FIXED DEC (7,2));                                        00000240
                                                                        00000250
   DCL SUM_TP                   FIXED DEC (5),                          00000260
       ÅFT_MAX                  FIXED DEC (5),                          00000270
       FORH_INDIKATOR           CHAR      (1),                          00000280
       ST_PROSENT               FIXED DEC (5,2),                        00000290
       GRAD                     FIXED DEC (3),                          00000300
       TT_ANV                   FIXED DEC (3);                          00000310
                                                                        00000320
   DCL ST                       FIXED DEC (7,2);                        00000330
                                                                        00000340
   DCL W_ST                     FIXED DEC (15,4),                       00000350
       W_GRAD                   FIXED DEC (3),                          00000360
       W_ST_FRADRAG             FIXED DEC (5);                          00000370
                                                                        00000380
                                                                        00000390
  /* UTENLADSBOENDE MED 19_3 KODE LIK 1,    4,6 SKAL IKKE  */           00000400
  /* HA MEDREGNET TT FØR 1967 I SÆRTILLEGG, TRUDE 10.01.94 */           00000410
  /* TRYGDETID ETTER 66 MÅ VÆRE >= 3 ÅR FOR RETT TIL SÆRT.,*/           00000420
  /* ELLERS MÅ DET VÆRE EN KONVENSJONSSAK.  TRUDE250594    */           00000430
                                                                        00000440
   IF  B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND) = '1' !                     00000450
       B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND) = '4' !                     00000460
       B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND) = '6' THEN                  00000470
     DO;                                                                00000480
      TT_ANV       = B02.TT_ANV(BER_SØ_IND) -                           00000490
                     B02.TT_FØR_1967(BER_SØ_IND);                       00000500
      IF  TT_ANV      < 0 THEN                                          00000510
          TT_ANV      = 0 ;                                             00000520
     END;                                                               00000530
                                                                        00000540
        /* DERSOM TRYGDETID ER MINDRE ENN TRE ÅR, OG DET IKKE ER EN */  00000550
        /* KONVENSJONS-SAK , FORELIGGER DET IKKE RETT TIL SÆRTILLEGG*/  00000560
        /* FFU HAR PRØVD DETTE FOR RTV. TRUDE  24.010.93            */  00000570
                                                                        00000580
   IF  TT_ANV                        <  3  &                            00000590
       B02.KONVENSJON (BER_SØ_IND)  ^= 'J' THEN                         00000600
        DO;                                                             00000610
         TT_ANV                        = 0;                             00000620
         B02.ALDERSP.ST(BER_SØ_IND)    = 0;                             00000630
         B02.UFØRPENS.ST(BER_SØ_IND)   = 0;                             00000640
        END;                                                            00000650
                                                                        00000660
                                     /*HIT TRUDE, 250594           */   00000670
                                                                        00000680
   W_ST_FRADRAG = 0;                                                    00000690
   IF ST_PROSENT = 99.99      THEN                                      00000700
     /* 99.99 BETYR IKKE  SÆRTILLEGG. LOVEN KOM 1.7-69  */              00000710
      ST = 0;                                                           00000720
   ELSE                                                                 00000730
                                                                        00000740
     /* LOV OM SÆRTILLEGG KOM 1.7-69  */                                00000750
                                                                        00000760
      DO;                                                               00000770
         W_ST_FRADRAG = SUM_TP + B02.TP_NORDISK(BER_SØ_IND);            00000780
         W_GRAD = GRAD;                                                 00000790
                                                                        00000800
         IF ÅFT_MAX > 0 THEN                                            00000810
            DO;                                                         00000820
               W_GRAD = 100;                                            00000830
                                                                        00000840
               /* SÆRTILLEGG SKAL REGNES ETTER 100 % UFØRHET NÅR */     00000850
               /* PERSONEN HAR RETT TIL 8.5.1-TILLEGG            */     00000860
                                                                        00000870
               IF ÅFT_MAX > SUM_TP       THEN                           00000880
                  W_ST_FRADRAG = 0;                                     00000890
               ELSE                                                     00000900
                  W_ST_FRADRAG = SUM_TP - ÅFT_MAX;                      00000910
            END;                                                        00000920
                                                                        00000930
         /* W_ST = (ST_PROSENT_ENSLIG * G / 100 * (W_GRAD / 100) *      00000940
                                B02.TT_ANV(BER_SØ_IND)) / (40 * 12);*/  00000950
                                                                        00000960
         W_ST = ST_PROSENT * G / 100;                                   00000970
         W_ST = W_ST * W_GRAD / 100;                                    00000980
         W_ST = W_ST * TT_ANV;                                          00000990
         W_ST = W_ST / (40 * 12);                                       00001000
                                                                        00001010
         IF FORH_INDIKATOR = 'J' THEN                                   00001020
                                                                        00001030
          /* DET SKAL FORHØYES */                                       00001040
                                                                        00001050
            W_ST = W_ST + 0.5;                                          00001060
                                                                        00001070
         IF W_ST > W_ST_FRADRAG THEN                                    00001080
                                                                        00001090
          /* ST HAR IKKE DESIMALER */                                   00001100
                                                                        00001110
            ST = W_ST - W_ST_FRADRAG;                                   00001120
         ELSE                                                           00001130
            ST = 0;                                                     00001140
                                                                        00001150
                                                                        00001160
         IF B02.IKKE_GP(BER_SØ_IND) = 'J' THEN                          00001170
            ST = 0;                           /*  ERIK 22.2.1990 */     00001180
                                                                        00001190
                                                                        00001200
         /* NOTAT FRA S.JOSTAD FFU ANG. UTL SOM BARE HAR KAP11   */     00001210
         /* RETTIGHETER, SKAL IKKE HA SÆRTILLEGGG . TRUDE 260893 */     00001220
                                                                        00001230
         IF (B02.BOSATT(BER_SØ_IND) > 0  &                              00001240
            B02.YRKEPENS.YUG(BER_SØ_IND) > 0 )  &                       00001250
           (B02.UFØRPENS.UFG(BER_SØ_IND)   =                            00001260
            B02.YRKEPENS.YUG(BER_SØ_IND))  THEN                         00001270
            ST = 0;                                                     00001280
         /*HIT TRUDE */                                                 00001290
                                                                        00001300
      END;                                                              00001310
   RETURN (ST);                                                         00001320
 END F_BEREGN_SÆRTILLEGG;                                               00001330
