 /*       SIST ENDRET 14/04-89 13.59.28 AV   HERMAN                   */00000000
 /*       SIST ENDRET 12/05-87 08.36.55 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /* IDENTIFIKASJON                                                    */00000030
 /*     R0019961 - OMREGNING_PGA_FNRENDRING.                          */00000040
 /*               (LIK OMREGNING_PGA_INNTEKTSENDRING, FØR ENDRING     */00000050
 /*                I NOV. 1986                                     )  */00000060
 /*                PROSEDYRE I PLI.                                   */00000070
 /*     PROGRAMMERER: SVERRE LUNDEBY,DATA-UTVIKLING A/S               */00000080
 /*     LAGET       : UKE 18 1987.                                    */00000090
 /* HENSIKT                                                           */00000100
 /*     SE FORKLARING NEDENFOR.                                       */00000110
 /* PROGRAMTILKNYTNING                                                */00000120
 /*     INCLUDE MODUL.                                                */00000130
 /* ***************************************************************** */00000140
 /* ***************************************************************** */00000150
 /* OMREGNING ETTER INNTEKTSOPPDATERING.                              */00000160
 /*        MODULEN KALLER DE AKTUELLE PROGRAM SOM FORETAR             */00000170
 /*           BEREGNING, STØNADSBREVUTSKRIVING, DATABASESKRIV SAMT    */00000180
 /*           KALL PÅ STATISTIKKRUTINE.                               */00000190
 /*           NÅR EN PERSON I HOVEDREGISTERET ER BLITT OPPDATERT      */00000200
 /*           MED INNTEKT ELLER DET ER FORETATT INNTEKTSENDRING,      */00000210
 /*           KAN DET VÆRE GRUNN TIL Å FORETA OMREGNING AV            */00000220
 /*           YTELSENE OM SLIKE FINNES. DET ER AKTUELT                */00000230
 /*              - FOR ALDERS- OG UFØREPENSJONISTER NÅR DET GJELDER   */00000240
 /*                EGEN INNTEKT                                       */00000250
 /*              - VED SAMMENSTØTENDE PENSJON NÅR INNTEKTEN GJELDER   */00000260
 /*                EKTEFELLEN                                         */00000270
 /*              - FOR ETTERLATTE NÅR INNTEKTEN GJELDER DEN DØDE SOM  */00000280
 /*                AVGIR YTELSE                                       */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*                                                                   */00000320
                                                                        00000330
                                                                        00000340
    OMREGNING_PGA_FNRENDRING: PROC;                                     00000350
                                                                        00000360
                                                                        00000370
       DCL PIC4               PIC '(4 )9';                              00000380
       DCL IND1               FIXED BIN(15);                            00000390
       DCL IND2               FIXED BIN(15);                            00000400
       DCL DAGENS_DATO_MÅ     PIC '(4 )9';                              00000410
       DCL SAVE_KJØRINGSTYPE  CHAR(1);                                  00000420
                                                                        00000430
       PIC4           =       DATE /100;                                00000440
       DAGENS_DATO_MÅ =       F_SNU_DATO(PIC4);                         00000450
                                                                        00000460
                                                                        00000470
 /* ***************************************************************** */00000480
 /* BEREGNING UTFØRES                                                 */00000490
 /* ***************************************************************** */00000500
       EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);            00000510
                                                                        00000520
       IF FEIL_MELD_NR > 0 THEN                                         00000530
          GOTO SLUTT;                                                   00000540
                                                                        00000550
       IF (B02.ALDERSP .TP       (SØKER_IND) +                          00000560
           B02.UFØRPENS.TP       (SØKER_IND) +                          00000570
    /*YS*/ B02.YRKEPENS.TP       (SØKER_IND) +                          00000580
           B02.ETTEPENS.TP_BRUTTO(SØKER_IND) +                          00000590
           B02.ETTEBARN.TP       (SØKER_IND) )                          00000600
                                                   =                    00000610
          (B01.ALDERSP .TP       (SØKER_IND) +                          00000620
           B01.UFØRPENS.TP       (SØKER_IND) +                          00000630
    /*YS*/ B02.YRKEPENS.TP       (SØKER_IND) +                          00000640
           B01.ETTEPENS.TP_BRUTTO(SØKER_IND) +                          00000650
           B01.ETTEBARN.TP       (SØKER_IND) )     THEN                 00000660
                                                                        00000670
               ;                                                        00000680
         ELSE                                                           00000690
           DO;                                                          00000700
              /* *************************************************** */ 00000710
              /* STATISTIKK - TRANS BLIR LAGET PÅ GRUNNLAG AV        */ 00000720
              /* ENDRINGER B01 TIL B02                               */ 00000730
              /* *************************************************** */ 00000740
                                                                        00000750
              EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);     00000760
                                                                        00000770
              IF FEIL_MELD_NR > 0 THEN                                  00000780
                 GOTO SLUTT;                                            00000790
                                                                        00000800
              /* *************************************************** */ 00000810
              /* STØNADSBREV SKRIVES                                 */ 00000820
              /* *************************************************** */ 00000830
                                                                        00000840
              EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);     00000850
                                                                        00000860
              IF FEIL_MELD_NR > 0 THEN                                  00000870
                 DO;                                                    00000880
                    /* ********************************************* */ 00000890
                    /*    CALL FJERN-TRANS-FRA-STØNADSBREV-BASE      */ 00000900
                    /*             (STØNADSBREV-NØKKEL-TABELL)       */ 00000910
                    /* ********************************************* */ 00000920
                                                                        00000930
                    EXEC CICS LINK PROGRAM('R0016401')                  00000940
                                    COMMAREA(KOM_OMR);                  00000950
                                                                        00000960
                    GOTO SLUTT;                                         00000970
                 END;                                                   00000980
                                                                        00000990
                                                                        00001000
               CALL RYDD_OPP;                                           00001010
                                                                        00001020
           END;                                                         00001030
                                                                        00001040
                                                                        00001050
       SLUTT:;                                                          00001060
                                                                        00001070
    %INCLUDE R0019954;         /*     RULL_FORVENTET           */       00001080
                                                                        00001090
                                                                        00001100
       RYDD_OPP: PROC;                                                  00001110
                                                                        00001120
                                                                        00001130
              IF FEIL_MELD_NR = 0 THEN                                  00001140
                 DO;                                                    00001150
                                                                        00001160
 /* ***************************************************************** */00001170
 /* FAMILIEN BLIR SKREVET TILBAKE PÅ BASEN                            */00001180
 /* ***************************************************************** */00001190
                                                                        00001200
                    EXEC CICS LINK PROGRAM('R0015401')                  00001210
                                    COMMAREA(KOM_OMR);                  00001220
                                                                        00001230
                                                                        00001240
         /*******   CALL                                                00001250
                        JUSTER-SB-ROTSEGMENTSTØNADSBREV-BASEN           00001260
                          (ST-BREV-NØKKEL-TABELL)  *****/               00001270
                    EXEC CICS LINK PROGRAM('R0017101')                  00001280
                                    COMMAREA(KOM_OMR);                  00001290
                                                                        00001300
                                                                        00001310
                 END;                                                   00001320
                                                                        00001330
              IF FEIL_MELD_NR > 0 THEN                                  00001340
                                                                        00001350
                /******   CALL FJERN-TRANS-FRA-STØNADSBREV-BASE         00001360
                                   (STØNADSBREV-NØKKEL-TABELL)  **/     00001370
                    EXEC CICS LINK PROGRAM('R0016401')                  00001380
                                    COMMAREA(KOM_OMR);                  00001390
                                                                        00001400
                                                                        00001410
       END RYDD_OPP;                                                    00001420
                                                                        00001430
    END OMREGNING_PGA_FNRENDRING;                                       00001440
                                                                        00001450
