 /*       SIST ENDRET 26/08-91 14.42.36 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 19/06-91 10.17.40 AV   HERMAN                   */00000010
 /*       SIST ENDRET 14/06-91 09.31.13 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 08/05-91 13.24.15 AV   DYBVIK                   */00000030
 /******************************************************************* */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /************************                                            */00000060
 /*  PROGRAM-IDENT : R001TK04 - REGISTRERING TK-OPPLYSNINGER          */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS - HOVEDPROGRAM                          */00000080
 /*  PROGRAMMERER  : TUYEN                                            */00000090
 /*  PROGRAM LAGET : NOV 90                                           */00000100
 /******************************************************************* */00000110
 /*HENSIKT:                                                           */00000120
 /************                                                        */00000130
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN TIL TK-REGISTER.         */00000140
 /*  PROGRAMMETS TRANSKODE ER RT04.                                   */00000150
 /*  PROGRAMMET BLIR AKTIVISERT NÅR OPERATØREN TASTER INN 'R' I       */00000160
 /*  FUNKSJONSKODE, MAP S001014 MAPSET S001TK3.                       */00000170
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */00000180
 /*  OG SENDER UT DET FØRSTE BILDET AV OPPLYSNINGER SOM SKAL          */00000190
 /*  REGISTRERES:                                                     */00000200
 /*     K ---> MAP S001020 MAPSET S001T53 -                           */00000210
 /*     A ---> MAP S001021 MAPSET S001T43 -                           */00000220
 /*     M ---> MAP S001001 MAPSET S001T83 -                           */00000230
 /*     X ---> MAP S001013 MAPSET S001TK3 - INNHENTING FUNKSJONSKODE  */00000240
 /*                                                                   */00000250
 /******************************************************************* */00000260
 /*PROGRAMTILKNYTTING:*/                                                00000270
 /**********************                                              */00000280
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = RT04.          */00000290
 /*  DENNE TRANSID SETTES I R001TK03.                                 */00000300
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAM AVHENGIG AV     */00000310
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN.                */00000320
 /*   K - KONTIOPPLYSNINGER - RT06 - R001TK06                         */00000330
 /*   A - ANDRE OPPLYS.     - RT07 - R001TK07                         */00000340
 /*   M - MERKELAPPER       - RT80 - R001TK80                         */00000350
 /*   X - NY FUNKSJONSKODE  - RT03 - R001TK03                         */00000360
 /******************************************************************* */00000370
 /*DATASETTOPPLYSNINGER:                                              */00000380
 /*************************                                           */00000390
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000400
 /******************************************************************* */00000410
 /*FEILMELDINGER:*/                                                     00000420
 /*********************                                               */00000430
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */00000440
 /*  IKKE HAR GYLDIG VERDI                                            */00000450
 /* ***************************************************************** */00000460
 R001TK4:                                                               00000470
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000480
                                                                        00000490
 %PAGE;                                                                 00000500
      %INCLUDE S001TK;     /*  MENY MAPSETTET  */                       00000510
 %PAGE;                                                                 00000520
      %INCLUDE S001T4;     /*  TK-MAPSETTET  */                         00000530
 %PAGE;                                                                 00000540
      %INCLUDE S001T5;     /*  TKNR-MAPSETTET  */                       00000550
 %PAGE;                                                                 00000560
      %INCLUDE S001T8;     /*  MERKELAPP-MAPSETTET  */                  00000570
 %PAGE;                                                                 00000580
      %INCLUDE P001TK03;   /*  KOM_OMRÅDE (BASED) */                    00000590
 %PAGE;                                                                 00000600
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */              00000610
 %PAGE;                                                                 00000620
                                                                        00000630
   DCL                                                                  00000640
      (COMMAREA_PEKER,IDENT_PEKER,                                      00000650
       BMSMAPBR)                       POINTER;                         00000660
   DCL                                                                  00000670
      (DATE,NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                         00000680
                                                                        00000690
   DCL CURSOR_POS FIXED BIN(15) INIT (-1);                              00000700
                                                                        00000710
 /* SLUTT PÅ DEKLARASJON */                                             00000720
 /************************/                                             00000730
                                                                        00000740
  EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                            00000750
  EXEC CICS IGNORE CONDITION MAPFAIL       ;                            00000760
                                                                        00000770
  IF SEND_MAP THEN                                                      00000780
     DO;                                                                00000790
        SEND_MAP = '0'B;                                                00000800
                                                                        00000810
        ALLOCATE S001014O;                                              00000820
        EXEC CICS SEND MAP('S001014') MAPSET ('S001TK3') ERASE;         00000830
     END;                                                               00000840
                                                                        00000850
  EXEC CICS RECEIVE MAP('S001014') MAPSET ('S001TK3')                   00000860
           SET(BMSMAPBR);                                               00000870
                                                                        00000880
  /* LESER SKJERMBILDE MED STYRINGSKODE  */                             00000890
                                                                        00000900
  STYREKODE = S001014I.STYREKODEI;                                      00000910
                                                                        00000920
  SELECT(STYREKODE);                                                    00000930
      WHEN('K','k')                                                     00000940
        DO;                                                             00000950
            IF SUBSTR(FUNKSJON,6,1) = '' THEN                           00000960
               DO;                                                      00000970
                   S001014O.MELDING1O =                                 00000980
                     'DU HAR IKKE TILGANG TIL REGISTRERING AV KONTI';   00000990
                                                                        00001000
                   EXEC CICS SEND MAP('S001014') MAPSET ('S001TK3')     00001010
                          ERASE;                                        00001020
                                                                        00001030
                   TRANSKODE = 'RT04';                                  00001040
               END;                                                     00001050
            ELSE                                                        00001060
               DO;                                                      00001070
                  TRANSKODE = 'RT06';                                   00001080
                  ALLOCATE S001020O ;                                   00001090
                                                                        00001100
                  /* SKRIVER REGISTRERINGSBILDE FOR               */    00001110
                  /* KONTIOPPLYSNINGER                            */    00001120
                                                                        00001130
                  S001020I.TKNRL = CURSOR_POS;                          00001140
                  EXEC CICS SEND MAP('S001020') MAPSET('S001T53')       00001150
                        ERASE CURSOR;                                   00001160
               END;                                                     00001170
        END;                                                            00001180
                                                                        00001190
      WHEN('A','a')                                                     00001200
        DO;                                                             00001210
            IF SUBSTR(FUNKSJON,3,1) = '' THEN                           00001220
               DO;                                                      00001230
                   S001014O.MELDING1O =                                 00001240
                     'DU HAR IKKE TILGANG TIL REGISTRERING AV TK-REG.'; 00001250
                                                                        00001260
                   EXEC CICS SEND MAP('S001014') MAPSET ('S001TK3')     00001270
                          ERASE;                                        00001280
                                                                        00001290
                   TRANSKODE = 'RT04';                                  00001300
               END;                                                     00001310
            ELSE                                                        00001320
               DO;                                                      00001330
                  TRANSKODE = 'RT07';                                   00001340
                  ALLOCATE S001021O ;                                   00001350
                                                                        00001360
                  /* SKRIVER REGISTRERINGSBILDE FOR               */    00001370
                  /* ANDRE OPPLYSNINGER                            */   00001380
                                                                        00001390
                  S001021I.TKNRL = CURSOR_POS;                          00001400
                  EXEC CICS SEND MAP('S001021') MAPSET('S001T43')       00001410
                      ERASE CURSOR;                                     00001420
               END;                                                     00001430
        END;                                                            00001440
                                                                        00001450
      WHEN('M','m')                                                     00001460
        DO;                                                             00001470
            IF SUBSTR(FUNKSJON,1,1) = '' THEN                           00001480
               DO;                                                      00001490
                   S001014O.MELDING1O =                                 00001500
                    'DU HAR IKKE TILGANG TIL REGISTRERING AV MERKELAP'; 00001510
                                                                        00001520
                   EXEC CICS SEND MAP('S001014') MAPSET ('S001TK3')     00001530
                          ERASE;                                        00001540
                                                                        00001550
                   TRANSKODE = 'RT04';                                  00001560
               END;                                                     00001570
            ELSE                                                        00001580
               DO;                                                      00001590
                  TRANSKODE = 'RT80';                                   00001600
                  ALLOCATE S001001O ;                                   00001610
                                                                        00001620
                  /* SKRIVER MENYSBILDE FOR MERKELAPPER           */    00001630
                                                                        00001640
                  S001001I.VALGL = CURSOR_POS;                          00001650
                  EXEC CICS SEND MAP('S001001') MAPSET('S001T83')       00001660
                      ERASE CURSOR;                                     00001670
               END;                                                     00001680
        END;                                                            00001690
                                                                        00001700
      WHEN('X','x')                                                     00001710
        DO;                                                             00001720
            TRANSKODE = 'RT03';                                         00001730
            ALLOCATE S001013O;                                          00001740
                                                                        00001750
            /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */          00001760
            /* FUNKSJONSKODE                                */          00001770
                                                                        00001780
            EXEC CICS SEND MAP('S001013') MAPSET('S001TK3') ERASE;      00001790
        END;                                                            00001800
                                                                        00001810
      OTHERWISE                                                         00001820
        DO;                                                             00001830
            ALLOCATE S001014O;                                          00001840
            /* FEILMELDING 'UGYLDIG STYREKODE' SKRIVES */               00001850
            S001014O.MELDING1O   = 'UGYLDIG STYRINGSKODE';              00001860
            S001014O.STYREKODEA  = 'I';  /* MDT SET, HIGH INT */        00001870
            S001014O.STYREKODEO  = STYREKODE;                           00001880
            EXEC CICS SEND MAP('S001014') MAPSET('S001TK3') ERASE;      00001890
                                                                        00001900
            TRANSKODE = 'RT04';                                         00001910
        END;                                                            00001920
  END;                                                                  00001930
                                                                        00001940
  EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                00001950
                                                                        00001960
  FEILBEH:                                                              00001970
      TRANSKODE  = 'RT03';                                              00001980
                                                                        00001990
      /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */                00002000
      /* FUNKSJONSKODE                                */                00002010
                                                                        00002020
      EXEC CICS SEND MAP('S001013') MAPSET('S001TK3') MAPONLY ERASE;    00002030
                                                                        00002040
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00002050
                                                                        00002060
 %PAGE;                                                                 00002070
 END R001TK4;                                                           00002080
