 /*       SIST ENDRET 29/05-98 09.40.58 AV   JDA7339                  */00000000
 /*       SIST ENDRET 29/05-98 09.39.06 AV   JDA7339                  */00000010
 /*       SIST ENDRET 08/05-98 12.39.35 AV   JDA7339                  */00000020
 /*       SIST ENDRET 05/05-98 13.02.38 AV   JDA7339                  */00000030
 /*       SIST ENDRET 19/09-97 10.49.51 AV   JDA7339                  */00000040
 /*       SIST ENDRET 19/09-97 10.26.35 AV   JDA7339                  */00000050
 /*       SIST ENDRET 12/04-96 13.26.24 AV   HLB0310                  */00000060
 /*       SIST ENDRET 23/03-95 10.01.53 AV   JDA0310                  */00000070
 /*       SIST ENDRET 28/11-94 11.08.04 AV   JDA0310                  */00000080
 /* ***************************************************************** */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /*    R0014015 - PROSEDYRE I PLI.                                    */00000110
 /*    PROGRAMMERER: TRUDE NOV 94 VARIASJON AV R0014139               */00000120
 /*HENSIKT:                                                           */00000130
 /*    RUTINEN OPPDATERER TP_NETTO,GP_NETTO,SÆRTILLEGG                */00000140
 /*                                                                   */00000150
 /*    HERETTER ER ALDERSP.AP_GP_NETTO /-TP-/-ST- NETTO -BELØPENE     */00000160
 /*PROGRAMTILKNYTNING:                                                */00000170
 /*    PROGRAMMET BLIR INKLUDERT I R0014001,CALL FRA R0014010         */00000180
 /*BRUK:                                                              */00000190
 /*    CALL JUSTER_MED_FORVENTET                                      */00000200
 /* ***************************************************************** */00000210
                                                                        00000220
 JUSTER_MED_FORVENTET: PROC(W_KT,INDEX);                                00000230
                                                                        00000240
    DCL                                                                 00000250
       W_KT          DEC FIXED(3),                                      00000260
       INDEX         FIXED BIN(15);                                     00000270
    DCL                                                                 00000280
       I             FIXED BIN(15),                                     00000290
       EP_SUM_YTELSE DEC FIXED(7) INIT (0),                             00000300
       FRADRAG_F     DEC FIXED(7) INIT (0),                             00000310
       G_HALVE       DEC FIXED(7) INIT (0),                             00000320
       HJ_AP         DEC FIXED(7) INIT (0),                             00000330
       REST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000340
       TREDEC        DEC FIXED(3) INIT (0),                             00000350
       W_BRUTTO_AP   DEC FIXED(7) INIT (0),                             00000360
       W_BRUTTO_GP   DEC FIXED(5) INIT (0),                             00000370
       W_BRUTTO_TP   DEC FIXED(5) INIT (0),                             00000380
       W_BRUTTO_TP_EP DEC FIXED(7) INIT (0),                            00000390
       W_BRUTTO_ST   DEC FIXED(5) INIT (0),                             00000400
       W_BRUTTO_GT   DEC FIXED(7) INIT (0),                             00000410
       W_SUM_TP      DEC FIXED(7) INIT (0),                             00000420
       W_YP_AP       DEC FIXED(7) INIT (0),                             00000430
       W_YP          DEC FIXED(7) INIT (0),                             00000440
       W_NETTO_AP    DEC FIXED(7) INIT (0),                             00000450
       W_FULL_KT     DEC FIXED(5,2) INIT (0),                           00000460
       W_TEI         DEC FIXED(7)  INIT (0),                            00000470
       W_TAI         DEC FIXED(7)  INIT (0),                            00000480
       W_BRP         DEC FIXED(7,2) INIT (0),                           00000490
       W_TAK         DEC FIXED(7)  INIT (0),                            00000500
       W_APD_ANVENDT DEC FIXED(3)  INIT (0),                            00000510
       W_KT_FRADRAG  DEC FIXED(3)  INIT (0),                            00000520
       W_ST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000530
       W_GP_FRADRAG  DEC FIXED(5)  INIT (0),                            00000540
       W_ALDER_ÅM    PIC '9999',                                        00000550
       W_ETTER92     DEC FIXED(7)  INIT (0);                            00000560
                                                                        00000570
    DCL KODE         CHAR (1) INIT (' ');                               00000580
    DCL HJ_FAI       FIXED DEC (7);                                     00000590
    DCL W_FNR        FIXED DEC (11);                                    00000600
                                                                        00000610
    DCL ROUND        BUILTIN;                                           00000620
   W_FNR  = B02.FNR(INDEX);                                             00000630
                                                                        00000640
   DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'A';     /**TS*/           00000650
   W_ALDER_ÅM   = F_ALDER((W_FNR),(TRANS_OPPL_OMR.VIRKNINGSDATO));      00000660
                                                                        00000670
   IF W_ALDER_ÅM  > 7000  THEN                                          00000680
     DO;                                                                00000690
       B02.ALDERSP.FAI(INDEX)             = 0;                          00000700
       B02.ETTEPENS.FORVENTET(INDEX)       = 0;                         00000710
     END;                                                               00000720
                                                                        00000730
   /* VED ETTERLATT ER ALDERSP.TP ER ALEREDE OPPDATERT MED */           00000740
   /* EGEN YP . TRUDE 0492                                       */     00000750
                                                                        00000760
   IF B02.KONV_P_KODE(INDEX)        = 'Y'  &                            00000770
      B02.PENSJONSTYPE2(INDEX) ^=        'E'   THEN   /*TS0492*/        00000780
     DO;                                                                00000790
      B02.ALDERSP.APD(INDEX)       = 100;                               00000800
     END;                                                               00000810
                                                                        00000820
                                                                        00000830
   /* GP OG TP BRUTTO ER UTREGNET TIDLIGERE   */                        00000840
                                                                        00000850
 /*   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(INDEX) = 0;   */                   00000860
   W_BRUTTO_ST = DIV_PARAM_OMR.FULLT_SÆRTILLEGG(INDEX); /*HL*/          00000870
   B02.ALDERSP.ST(INDEX) = W_BRUTTO_ST;                 /*HL*/          00000880
   W_BRUTTO_GP  = B02.ALDERSP.GP(INDEX);                                00000890
   W_BRUTTO_TP  = B02.ALDERSP.TP(INDEX);                                00000900
 /*   W_BRUTTO_ST  = B02.ALDERSP.ST(INDEX); */                          00000910
   W_BRUTTO_TP_EP = B02.TP_BRUTTO(INDEX);                               00000920
   W_ETTER92    = W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;           00000930
                                                                        00000940
   IF B02.GT_LOV92(INDEX)       > W_ETTER92        THEN                 00000950
      W_BRUTTO_GT = B02.GT_LOV92(INDEX) - W_ETTER92;                    00000960
                                                                        00000970
   W_BRUTTO_AP       = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST          00000980
                       + B02.TP_BRUTTO(INDEX) + W_KT                    00000990
                       + W_BRUTTO_GT;                                   00001000
                                                                        00001010
   W_SUM_TP          = W_BRUTTO_TP                                      00001020
                       + B02.TP_BRUTTO(INDEX);                          00001030
                                                                        00001040
                                                                        00001050
 /*   W_TAI      = DIV_PARAM_OMR.TAI(INDEX);     */                     00001060
   W_TEI      = DIV_PARAM_OMR.TAI(INDEX);      /*980529*/               00001070
                                                                        00001080
   /*TIDLIGERE LAV ARBEIDSINNTEKT:  GJENNOMSNITT SKAL IKKE < 3 G */     00001090
   /*FORHØYES OPP TIL NÆRMESTE HELE TUSEN                        */     00001100
   /*AFP FOM 1097 SKAL IKKE DENNE REGEL GJELDE                   */     00001110
                                                                        00001120
    IF (B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                         00001130
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709 ) !                      00001140
       (B02.KONV_P_KODE  (BER_SØ_IND)   = 'K' &                         00001150
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709) THEN ;                  00001160
    ELSE                                                                00001170
     DO;                                                                00001180
    IF W_TEI < ( 3 * G )   THEN                                         00001190
      DO;                                                               00001200
       W_TEI   = 3 * G + 999;  /* ENDRET FRA 500 TIL 999, 5.7.94 TS*/   00001210
       TREDEC  = W_TEI / 1000;                                          00001220
       W_TEI   = TREDEC * 1000;                                         00001230
       DIV_PARAM_OMR.TAI(INDEX) = W_TEI; /*TRUDE 020993*/               00001240
      END;                                                              00001250
    END;                                                                00001260
                                                                        00001270
    IF B02.FAI(INDEX) = 0         THEN                                  00001280
      IF B02.KONV_P_KODE(INDEX)        = 'E'  THEN                      00001290
         B02.FAI(INDEX) = B01.FORVENTET(INDEX);                         00001300
         /* HIT 180992 */                                               00001310
                                                                        00001320
    G_HALVE   = G / 2;                                                  00001330
    W_FULL_KT = W_KT;                                                   00001340
    HJ_FAI  = B02.FAI(INDEX) * 100;                                     00001350
                                                                        00001360
 IF HJ_FAI  > G THEN                                                    00001370
   DO;                                                                  00001380
    FRADRAG_F = (B02.FAI(INDEX) * 100);                                 00001390
    FRADRAG_F = FRADRAG_F - G;                                          00001400
                                                                        00001410
    IF FRADRAG_F > 0 THEN                                               00001420
       FRADRAG_F = ( FRADRAG_F * 0.5 ) / 12;                            00001430
                                                                        00001440
   IF FRADRAG_F > W_BRUTTO_AP THEN                                      00001450
       DO;                                                              00001460
        IF B02.KONV_P_KODE(INDEX)       = 'E' !                         00001470
           B02.PENSJONSTYPE2(INDEX)       = 'E' THEN GOTO L999;         00001480
                                                                        00001490
      /*   B02.ALDERSP.GP         (INDEX)         = 0;  */              00001500
           B02.ALDERSP.AP_GP_NETTO(INDEX)         = 0;                  00001510
     /*    B02.ALDERSP.TP         (INDEX)         = 0;   */             00001520
           B02.ALDERSP.AP_TP_NETTO(INDEX)         = 0;                  00001530
           B02.TP_NETTO           (INDEX)         = 0;                  00001540
           B02.ALDERSP.ST         (INDEX)         = 0;                  00001550
           B02.ALDERSP.KT         (INDEX)         = 0;                  00001560
           W_KT                                   = 0;                  00001570
       END;                                                             00001580
                                                                        00001590
   ELSE                                                                 00001600
       DO;                                                              00001610
                                                                        00001620
 /* ***************************************************************** */00001630
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */00001640
 /* ***************************************************************** */00001650
                                                                        00001660
          DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'A';                00001670
                                                                        00001680
          W_NETTO_AP    = W_BRUTTO_AP - FRADRAG_F;                      00001690
                                                                        00001700
          /*-----------------------------------------------------*/     00001710
          /*SUMMEN AV PENSJON OG FREMTIDIG ARBEIDSINNTEKT KAN    */     00001720
          /*IKKE UTGJØRE MER ENN TIDLIGERER ARBEIDSINNTEKT.      */     00001730
          /*-----------------------------------------------------*/     00001740
                                                                        00001750
          W_TAK =   W_TEI -  (B02.FAI(INDEX) * 100);                    00001760
          IF W_TAK   > 0  THEN                                          00001770
             W_TAK   = W_TAK / 12;                                      00001780
                                                                        00001790
          IF W_TAK   > 0           &                                    00001800
             W_TAK   < W_NETTO_AP  THEN                                 00001810
            DO;                                                         00001820
             DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'B';             00001830
             W_NETTO_AP   =  W_TAK;                                     00001840
             FRADRAG_F    = W_BRUTTO_AP - W_NETTO_AP;                   00001850
            END;                                                        00001860
          ELSE                                                          00001870
            IF W_TAK <=  0  THEN   /*TS0492*/                           00001880
              DO;                                                       00001890
               IF B02.KONV_P_KODE(INDEX)       = 'E' THEN GOTO L999;    00001900
                                                                        00001910
          /*     B02.ALDERSP.GP (INDEX)         = 0;       ***0492 TS*/ 00001920
                 B02.ALDERSP.AP_GP_NETTO(INDEX)         = 0;  /*0492TS*/00001930
         /*      B02.ALDERSP.TP (INDEX)         = 0;     **** 0492 TS*/ 00001940
                 B02.ALDERSP.AP_TP_NETTO(INDEX)         = 0;  /*0492TS*/00001950
                 B02.TP_NETTO   (INDEX)         = 0;                    00001960
                 B02.ALDERSP.ST (INDEX)         = 0;                    00001970
                 B02.ALDERSP.KT (INDEX)         = 0;                    00001980
                 GOTO L500;    /*ENDRET FRA L999 TIL L500 220293 TS */  00001990
              END;                                                      00002000
                                                                        00002010
                                                                        00002020
          IF W_YP > W_NETTO_AP   THEN                                   00002030
            DO;                                                         00002040
               W_NETTO_AP   =  W_YP;                                    00002050
               FRADRAG_F    =  W_BRUTTO_AP - (W_NETTO_AP + W_KT);       00002060
               DIV_PARAM_OMR.AP_KODE_AEY(INDEX)        =  'Y';          00002070
               IF FRADRAG_F  <=  0 THEN              /*TS < 0  050593*/ 00002080
                              /*STM NEDENFOR LAGT INN 060593, TRUDE */  00002090
                  DO;                                                   00002100
        B02.AP_GP_NETTO(INDEX)        = B02.ALDERSP.GP(INDEX);          00002110
        B02.AP_TP_NETTO(INDEX)        = B02.ALDERSP.TP(INDEX);          00002120
        B02.TP_NETTO(INDEX)           = B02.TP_BRUTTO (INDEX);          00002130
        B02.ALDERSP.ST(INDEX)         = B02.ALDERSP.ST(INDEX);          00002140
        B02.ALDERSP.KT(INDEX)         = W_KT;                           00002150
        GOTO L500;  /*TS  050593*/                                      00002160
                  END;   /*FRADRAG <= 0 */                              00002170
            END;                                                        00002180
                                                                        00002190
                                                                        00002200
          B02.AP_GP_NETTO(INDEX) = ROUND(W_BRUTTO_GP *                  00002210
                                      W_NETTO_AP / W_BRUTTO_AP , 0);    00002220
                                                                        00002230
          REST_FRADRAG = FRADRAG_F - W_BRUTTO_GP                        00002240
                                   + B02.AP_GP_NETTO(INDEX);            00002250
          IF B02.TP_BRUTTO(INDEX) > 0 THEN                              00002260
            DO;                                                         00002270
             DCL TRUDE_TP  FIXED DEC (5);                               00002280
               B02.TP_NETTO(INDEX) =                                    00002290
                                   ROUND(B02.TP_BRUTTO(INDEX)           00002300
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00002310
               TRUDE_TP  = B02.TP_NETTO(INDEX);                         00002320
               REST_FRADRAG =  REST_FRADRAG -                           00002330
                               B02.TP_BRUTTO(INDEX) +                   00002340
                               B02.TP_NETTO(INDEX);                     00002350
            END;                                                        00002360
                                                                        00002370
          IF W_BRUTTO_GT   > 0 THEN                                     00002380
            DO;                                                         00002390
             B02.GT_TILLEGG_LOV92(INDEX)       =                        00002400
                              ROUND(W_BRUTTO_GT                         00002410
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00002420
              REST_FRADRAG =  REST_FRADRAG -                            00002430
                               W_BRUTTO_GT +                            00002440
                               B02.GT_TILLEGG_LOV92(INDEX);             00002450
            END;                                                        00002460
          ELSE                                                          00002470
            DO;                                                         00002480
             B02.GT_TILLEGG_LOV92(INDEX)       = 0;                     00002490
            END;                                                        00002500
                      /*ENDRET REKKEFØLGEN PÅ STM. PGA KT  */           00002510
          IF W_BRUTTO_TP > 0 THEN                                       00002520
            DO;                                                         00002530
              IF G > 35500    THEN                                      00002540
                DO;                                                     00002550
                 IF B02.ALDERSP.ST(INDEX)       =  0 THEN               00002560
                    B02.AP_TP_NETTO(INDEX) =                            00002570
                             B02.ALDERSP.TP(INDEX) - REST_FRADRAG;      00002580
                 ELSE                                                   00002590
                  DO;                                                   00002600
                   B02.AP_TP_NETTO(INDEX) = ROUND(W_BRUTTO_TP *         00002610
                                  W_NETTO_AP / W_BRUTTO_AP , 0);        00002620
                   REST_FRADRAG =  REST_FRADRAG -                       00002630
                                   W_BRUTTO_TP +                        00002640
                                   B02.AP_TP_NETTO(INDEX);              00002650
                  END;                                                  00002660
                END;                                                    00002670
              ELSE                                                      00002680
                 DO;                                                    00002690
                   B02.AP_TP_NETTO(INDEX) = ROUND(W_BRUTTO_TP *         00002700
                                  W_NETTO_AP / W_BRUTTO_AP , 0);        00002710
                   REST_FRADRAG =  REST_FRADRAG -                       00002720
                                   W_BRUTTO_TP +                        00002730
                                   B02.AP_TP_NETTO(INDEX);              00002740
                 END;                                                   00002750
            END;                                                        00002760
                                                                        00002770
          IF B02.ALDERSP.ST(INDEX)        > 0 THEN                      00002780
            DO;                                                         00002790
             IF W_KT  = 0 THEN                                          00002800
               DO;                                                      00002810
                 DCL SÆRT   PIC'9999';                                  00002820
                 DCL SÆRT2  PIC'9999';                                  00002830
                 SÆRT  =   B02.ALDERSP.ST(INDEX);                       00002840
                 B02.ALDERSP.ST(INDEX)       =                          00002850
                           B02.ALDERSP.ST(INDEX) - REST_FRADRAG;        00002860
                 SÆRT2 =   B02.ALDERSP.ST(INDEX);                       00002870
               END;                                                     00002880
             ELSE                                                       00002890
                DO;                                                     00002900
                   B02.ALDERSP.ST(INDEX) =                              00002910
                              ROUND(B02.ALDERSP.ST(INDEX)               00002920
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00002930
                    REST_FRADRAG =  REST_FRADRAG -                      00002940
                                    W_BRUTTO_ST +                       00002950
                                    B02.ALDERSP.ST(INDEX);              00002960
                END;                                                    00002970
            END;                                                        00002980
                                                                        00002990
          IF W_KT > 0 THEN                                              00003000
            DO;                                                         00003010
                                                                        00003020
             IF W_KT >= REST_FRADRAG THEN                               00003030
                W_KT = W_KT - REST_FRADRAG;                             00003040
             ELSE                                                       00003050
                W_KT  = 0;                                              00003060
                                                                        00003070
             B02.ALDERSP.KT(INDEX) = W_KT;                              00003080
            END;                                                        00003090
                                                                        00003100
     END;                                                               00003110
                                                                        00003120
    IF B02.AP_GP_NETTO(INDEX) +                                         00003130
       B02.AP_TP_NETTO(INDEX) < 10 THEN                                 00003140
                                                                        00003150
       DO;                                                              00003160
      /*  B02.ALDERSP.GP(INDEX)             = 0;  */                    00003170
          B02.AP_GP_NETTO(INDEX)            = 0;                        00003180
     /*   B02.ALDERSP.TP(INDEX)             = 0; */                     00003190
          B02.AP_TP_NETTO(INDEX)            = 0;                        00003200
          B02.ALDERSP.ST(INDEX)             = 0;                        00003210
          B02.ALDERSP.KT(INDEX)             = 0;                        00003220
          B02.GT_LOV92  (INDEX)             = 0;                        00003230
                                                                        00003240
          B02.GARANTITILLEGG_EK(INDEX)                = 0;              00003250
          B02.GARANTITILLEGG_BARN(INDEX)              = 0;              00003260
          B02.BT_SÆRBARN(INDEX)                       = 0;              00003270
          B02.GARANTITILLEGG_SÆRBARN(INDEX)           = 0;              00003280
          B02.FT_SKAL_BEREGNES(INDEX)                 = 'D';            00003290
                                                                        00003300
       END;                                                             00003310
   END;                                                                 00003320
 ELSE   /*FRADRAGET ER MINDRE ENN G */                                  00003330
     DO;                                                                00003340
        B02.AP_GP_NETTO(INDEX)        = B02.ALDERSP.GP(INDEX);          00003350
        B02.AP_TP_NETTO(INDEX)        = B02.ALDERSP.TP(INDEX);          00003360
        B02.TP_NETTO(INDEX)           = B02.TP_BRUTTO (INDEX);          00003370
        B02.ALDERSP.ST(INDEX)         = B02.ALDERSP.ST(INDEX);          00003380
        B02.ALDERSP.KT(INDEX)         = W_KT;                           00003390
     END;                                                               00003400
                                                                        00003410
 L500:                                                                  00003420
                                                                        00003430
  B02.ALDERSP.UTTAKS_APD(INDEX) = 000; /* 999 ØNSKE FRA NORTYGD */      00003440
  B02.ALDERSP.APD(INDEX) = 000;             /*  "  ØNSKE FRA NORTYGD */ 00003450
                                                                        00003460
  /*TRUDE 210292:  */                                                   00003470
  IF B02.ALDERSP.UTTAKSDATO_ÅM(INDEX) = 0        THEN                   00003480
     B02.ALDERSP.UTTAKSDATO_ÅM(INDEX) =                                 00003490
                            B02.VIRK_DATO_ÅM(INDEX);                    00003500
                                                                        00003510
  /* ALLE NYE AFP PENSJONISTER SKAL HA KODE 'N' */                      00003520
                                                                        00003530
    IF (B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                         00003540
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709 ) !                      00003550
       (B02.KONV_P_KODE  (BER_SØ_IND)   = 'K' &                         00003560
        B02.UTTAKSDATO_ÅM(BER_SØ_IND)   > 9709) THEN                    00003570
          DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'N';     /**TS*/    00003580
                                                                        00003590
  L999:                                                                 00003600
                                                                        00003610
 END JUSTER_MED_FORVENTET;                                              00003620
