 /*       SIST ENDRET 07/03-84 13.18.37 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 02/06-83 09.10.29 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 28/04-83 10.18.42 AV   FARVIK                   */00000020
 /*       SIST ENDRET 10/02-83 12.41.10 AV   DYBVIK                   */00000030
                                                                        00000040
 /* **************************************************************** */ 00000050
 /* IDENTIFIKASJON:  R0017021                                        */ 00000060
 /* PROGRAMMERER :   HELEN , JULI 1982                               */ 00000070
 /* HENSIKT:                                                         */ 00000080
 /*        LESER SBROT I STØNADSBREV BASEN. OPPRETTER SBROT          */ 00000090
 /*        OM DET IKKE FINNES FRA FØR.                               */ 00000100
 /* PROGRAM TILKNYTNING:                                             */ 00000110
 /*        PROGRAM INCLUDES I R0017001(LAG_STØNADSBREV_TRANSER)      */ 00000120
 /*                                                                  */ 00000130
 /*                                                                  */ 00000140
 /* **************************************************************** */ 00000150
                                                                        00000160
 OPPRETT_SB_ROT_SEGMENT:                                                00000170
    PROC(SB_FNR,PERSON_IND);                                            00000180
                                                                        00000190
                                                                        00000200
    DCL SB_FNR                    FIXED DEC(11);                        00000210
    DCL PERSON_IND                FIXED BIN(15);                        00000220
                                                                        00000230
                                                                        00000240
    /* ************************************************************* */ 00000250
    /*     HER BEGYNNER PROGRAMMET.                                  */ 00000260
    /* ************************************************************* */ 00000270
                                                                        00000280
    SSA1_SB0PERSN.PKEY        =   SB_FNR                              ; 00000290
    W_ROT.FNR                 =   SB_FNR                              ; 00000300
    W_ROT.NESTE_SB_VERSJON_NR =   1                                   ; 00000310
    W_ROT.NAVN                =  B02.PERSON.RF0PERSN.NAVN(PERSON_IND);  00000320
    W_ROT.TKNR                =  B02.PERSON.RF0PERSN.TKNR(PERSON_IND);  00000330
    W_ROT.SPRÅK               =  B02.PERSON.RF0PERSN.SPRÅK(PERSON_IND); 00000340
                                                                        00000350
        /* ********************************************************** */00000360
        /*   VI SKRIVER DEN NYE ROTEN TIL BASEN.                      */00000370
        /* ********************************************************** */00000380
                                                                        00000390
                                                                        00000400
        SSA_UQUAL             =        ('SB0PERSN ');                   00000410
                                                                        00000420
        CALL            PLITDLI        (PARM_CT_4,                      00000430
                                       ISRT,                            00000440
                                       PCB_SB1,                         00000450
                                       W_ROT,                           00000460
                                       SSA_UQUAL);                      00000470
                                                                        00000480
        IF PCB_SB1.STATUS_KODE     =  'II'            &                 00000490
           DLIUIB.UIBFCTR          =   UIB_RC_OK          THEN          00000500
                                                                        00000510
           CALL FINN_VERSJON_NR;                                        00000520
        ELSE                                                            00000530
           IF PCB_SB1.STATUS_KODE ^=  '  '           !                  00000540
              DLIUIB.UIBFCTR      ^=   UIB_RC_OK          THEN          00000550
              DO;                                                       00000560
 L100:                                                                  00000570
                 FEIL_MELD_NR      =   500;                             00000580
                 FEIL_VED_LABEL    =  'L100';                           00000590
                 DB_STATUS_KODE    =   PCB_SB1.STATUS_KODE;             00000600
              END;                                                      00000610
                                                                        00000620
                                                                        00000630
                                                                        00000640
                                                                        00000650
   /* ************************************************************** */ 00000660
   /*                                                                */ 00000670
   /* HER LESES ROT-SEGMENTET FOR Å FINNE SISTE VERSJON-NR.          */ 00000680
   /* DETTE OPPDATERES MED 1 FOR Å GI NESTE NR. TIL HENDELSENE .     */ 00000690
   /*                                                                */ 00000700
   /* ************************************************************** */ 00000710
                                                                        00000720
   FINN_VERSJON_NR:                                                     00000730
    PROC;                                                               00000740
                                                                        00000750
        DCL 1 SB0PERSN,                                                 00000760
            2 FNR       FIXED DEC      (11)      INIT (   0 )       ,   00000770
            2 VERS_NR   PIC            'ZZ9'     INIT ('000')       ,   00000780
            2 REST      CHAR           (136)     INIT (   '')       ;   00000790
                                                                        00000800
        CALL            PLITDLI        (PARM_CT_4,                      00000810
                                       GU,                              00000820
                                       PCB_SB1,                         00000830
                                       SB0PERSN,                        00000840
                                       SSA1_SB0PERSN);                  00000850
                                                                        00000860
        IF PCB_SB1.STATUS_KODE    ^=  '  '            !                 00000870
           DLIUIB.UIBFCTR         ^=   UIB_RC_OK          THEN          00000880
              DO;                                                       00000890
 L110:                                                                  00000900
                 FEIL_MELD_NR      =   500;                             00000910
                 FEIL_VED_LABEL    =  'L110';                           00000920
                 DB_STATUS_KODE    =   PCB_SB1.STATUS_KODE;             00000930
              END;                                                      00000940
        ELSE                                                            00000950
           W_ROT.NESTE_SB_VERSJON_NR = SB0PERSN.VERS_NR  ;              00000960
                                                                        00000970
   END FINN_VERSJON_NR;                                                 00000980
                                                                        00000990
                                                                        00001000
  END OPPRETT_SB_ROT_SEGMENT;                                           00001010
