 /*       SIST ENDRET 15/10-91 12.59.23 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 02/07-91 14.21.09 AV   HERMAN                   */00000010
 /*       SIST ENDRET 30/04-91 14.27.15 AV   HERMAN                   */00000020
 /*       SIST ENDRET 15/04-91 13.32.18 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 16/05-88 12.28.20 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 12/05-87 08.34.10 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 28/06-84 09.44.59 AV   OLAV                     */00000060
 /*       SIST ENDRET 12/06-84 11.59.37 AV   FARVIK                   */00000070
 /*       SIST ENDRET 04/06-84 11.01.04 AV   FARVIK                   */00000080
 /*       SIST ENDRET 27/10-82 11.35.43 AV   JANKR                    */00000090
 /*IDENTIFIKASJON:                                                    */00000100
 /*    R0011204 - PROGRAM I PLI                                       */00000110
 /*    PROGRAMMERT AV JAN I AUGUST 1981                               */00000120
 /*HENSIKT:                                                           */00000130
 /*    PROGRAMMET BEHANDLER BARNEDELEN.                               */00000140
 /*ENDRING:                                                           */00000150
 /*    PROGRAMMET OVERFØR_FT_BARN ER SKILT UT OG LAGT I R0011210.     */00000160
 /*                                                     050587 BRITT  */00000170
 /*BRUK:                                                              */00000180
 /*    KONTR_BARNEDEL    - KONTROLL AV BARNEDELEN                     */00000190
 /*       (VIRK_DATO_MÅ,FEIL_FUNNET)                                  */00000200
 /*                                                                   */00000210
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000220
 /* ******                                                            */00000230
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000240
 /*    OM FNR ER ENDRET (R0019906).                                   */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 /*                                                                   */00000280
 /*    KONTROLL AV FT_BARN.                                           */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 %SKIP(2);                                                              00000320
 KONTROLL_FT_BARN:                                                      00000330
   PROC (FEIL_FUNNET);                                                  00000340
 %SKIP;                                                                 00000350
   DCL                                                                  00000360
      FEIL_FUNNET BIT (1);                                              00000370
   DCL                                                                  00000380
      1 FNR_REG,                                                        00000390
        2 FNR1         FIXED DEC(11),                                   00000400
        2 FNR2         FIXED DEC(11),                                   00000410
        2 BRUKERID     CHAR     ( 4);                                   00000420
   DCL                                                                  00000430
      (FEIL19,                                                          00000440
      FEIL20,                                                           00000450
      FEIL21,                                                           00000460
      FEIL22) BIT (1);                                                  00000470
      FEIL19 = '0'B;                                                    00000480
      FEIL20 = '0'B;                                                    00000490
      FEIL21 = '0'B;                                                    00000500
      FEIL22 = '0'B;                                                    00000510
   DCL                                                                  00000520
      TELL                        FIXED BIN(15),                        00000530
      TELL_BARN                   FIXED BIN(15),                        00000540
      ANT_BARN                    FIXED BIN(15);                        00000550
   DCL                                                                  00000560
      ALDER FIXED(5);                                                   00000570
      TELL_BARN = 0;                                                    00000580
                                                                        00000590
                                                                        00000600
                                                                        00000610
      FNR_REG.BRUKERID =    DIV_PARAM_OMR.CICS_IND;                     00000620
                                                                        00000630
      DO ANT_BARN = 1 TO 8;                                             00000640
         IF F_FELT_PIC_CHAR11(FTB.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN   00000650
            DO;                                                         00000660
               IF ^F_NUMERISK(F_FELT_PIC_CHAR11(FTB.FNR_BARN(ANT_BARN)))00000670
               THEN                                                     00000680
                  DO;                                                   00000690
                     IF ^FEIL19 THEN                                    00000700
                        DO;                                             00000710
                           FEIL19 = '1'B;                               00000720
                           FTB.FNR_BARNNR(ANT_BARN) = 200;              00000730
                        END;                                            00000740
                     ELSE                                               00000750
                        FTB.FNR_BARNNR(ANT_BARN) = 200;                 00000760
                  END;                                                  00000770
               ELSE                                                     00000780
               IF ^ F_GYLDIG_FNR(FTB.FNR_BARN(ANT_BARN)) THEN           00000790
                  DO;                                                   00000800
                     IF ^FEIL20 THEN                                    00000810
                        DO;                                             00000820
                           FEIL20 = '1'B;                               00000830
                           FTB.FNR_BARNNR(ANT_BARN) = 20;               00000840
                        END;                                            00000850
                     ELSE                                               00000860
                        FTB.FNR_BARNNR(ANT_BARN) = 999;                 00000870
                  END;                                                  00000880
               ELSE                                                     00000890
                  DO;                                                   00000900
                     ALDER =                                            00000910
                     F_ALDER(FTB.FNR_BARN(ANT_BARN),FTS.VIRK_DATO_MÅ);  00000920
                    FNR_REG.FNR1 = FTB.FNR_BARN(ANT_BARN);              00000930
                    EXEC CICS LINK PROGRAM('R0019906')COMMAREA(FNR_REG);00000940
                    IF FNR_REG.FNR2 > 0 THEN                            00000950
                      DO;                                               00000960
                         FTB.FNR_BARNNR(ANT_BARN) = 203;                00000970
                         FTB.FNR_GML_BARN(ANT_BARN) =                   00000980
                         FTB.FNR_BARN(ANT_BARN);                        00000990
                         FTB.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;         00001000
                      END;                                              00001010
                     IF ALDER > 1712 THEN                               00001020
                        DO;                                             00001030
                           IF ^FEIL21 THEN                              00001040
                              DO;                                       00001050
                                 FEIL21 = '1'B;                         00001060
                                 FTB.FNR_BARNNR(ANT_BARN) = 21;         00001070
                              END;                                      00001080
                           ELSE                                         00001090
                              FTB.FNR_BARNNR(ANT_BARN) = 999;           00001100
                        END;                                            00001110
                     ELSE                                               00001120
                        IF ALDER < 0 THEN                               00001130
                           DO;                                          00001140
                              IF ^FEIL22 THEN                           00001150
                                 DO;                                    00001160
                                    FEIL22 = '1'B;                      00001170
                                    FTB.FNR_BARNNR( ANT_BARN) = 22;     00001180
                                 END;                                   00001190
                              ELSE                                      00001200
                                 FTB.FNR_BARNNR( ANT_BARN) = 999;       00001210
                           END;                                         00001220
                  END;                                                  00001230
                FEIL_FUNNET =                                           00001240
                       FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22; 00001250
                                                                        00001260
               IF ^ FEIL_FUNNET THEN                                    00001270
               IF F_SNU_DATO(FTS.VIRK_DATO_MÅ) > 9012 &  /*NY0191*/     00001280
                  ALDER  < 0001      THEN                               00001290
                    DO;                                                 00001300
                        FEIL_FUNNET = '1'B;                             00001310
                        FTB.RBT_BARNNR(ANT_BARN) = 63;                  00001320
                    END;                             /*TIL HIT TRUDE */ 00001330
               IF FTB.RBT_BARN(ANT_BARN) = 'J' THEN                     00001340
                  DO;                                                   00001350
                     IF F_SNU_DATO(FTS.VIRK_DATO_MÅ) < 8407 THEN        00001360
                        DO;                                             00001370
                           FEIL_FUNNET = '1'B;                          00001380
                           FTS.VIRK_DATO_MÅNR = 276;                    00001390
                        END;                                            00001400
                  END;                                                  00001410
               ELSE                                                     00001420
                  IF FTB.RBT_BARN(ANT_BARN) ^= ' ' THEN                 00001430
                     DO;                                                00001440
                        FEIL_FUNNET = '1'B;                             00001450
                        FTB.RBT_BARNNR(ANT_BARN) = 271;                 00001460
                     END;                                               00001470
               TELL_BARN = TELL_BARN + 1;                               00001480
            END;                                                        00001490
         ELSE                                                           00001500
            LEAVE;                                                      00001510
      END;                                                              00001520
                                                                        00001530
                                                                        00001540
                                                                        00001550
                                                                        00001560
                                                                        00001570
      IF ^ FEIL_FUNNET THEN                                             00001580
        IF FTS.BT_ANT ^= TELL_BARN THEN                                 00001590
           DO;                                                          00001600
              FEIL_FUNNET = '1'B;                                       00001610
              FTS.BT_ANTNR = 23;                                        00001620
           END;                                                         00001630
                                                                        00001640
      FEIL_FUNNET = FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22;    00001650
                                                                        00001660
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00001670
      IF ^FEIL_FUNNET THEN                                              00001680
        IF FTS.BT_ANT > 0 THEN                                          00001690
           DO ANT_BARN = 1 TO FTS.BT_ANT;                               00001700
              DO TELL = ANT_BARN TO FTS.BT_ANT;                         00001710
                 IF TELL ^= ANT_BARN THEN                               00001720
                    IF FTB.FNR_BARN(TELL) = FTB.FNR_BARN(ANT_BARN) THEN 00001730
                       DO;                                              00001740
                          FEIL_FUNNET = '1'B;                           00001750
                          FTB.FNR_BARNNR(ANT_BARN) = 124;               00001760
                          FTB.FNR_BARNNR(TELL) = 999;                   00001770
                       END;                                             00001780
              END;                                                      00001790
           END;                                                         00001800
                                                                        00001810
   END KONTROLL_FT_BARN;                                                00001820
