 /*       SIST ENDRET 01/12-89 08.59.08 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 29/03-88 13.18.00 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 17/04-85 15.27.43 AV   HERMAN                   */00000020
 /*       SIST ENDRET 13/03-85 13.15.38 AV   HERMAN                   */00000030
 /*       SIST ENDRET 22/02-85 13.29.23 AV   KARIN                    */00000040
 /*       SIST ENDRET 28/02-84 09.09.27 AV   KARIN                    */00000050
 /*       SIST ENDRET 14/10-83 07.58.26 AV   OLAV                     */00000060
 /*       SIST ENDRET 13/04-83 13.25.52 AV   OLAV                     */00000070
 /*       SIST ENDRET 25/03-83 10.05.32 AV   OLAV                     */00000080
 /*       SIST ENDRET 08/02-88 10.05.32 AV   SATISH                   */00000090
 /****************************************************************** */ 00000100
 /*IDENTIFIKASJON:                                                   */ 00000110
 /*    R0011120 - PROSEDYRE I PLI                                    */ 00000120
 /*    PROGRAMMERER: GEIR, JANUAR 1982                               */ 00000130
 /*  *****************************                                   */ 00000140
 /*  ENDRINGSDATO : 28/2-84                                          */ 00000150
 /*  ENDRINGEN GJELDER : DET ER BEHOV FOR Å REGISTRERE ETTERLATT     */ 00000160
 /*                      BARN UTEN OPPLYSNINGER OM AVDØD MOR/FAR     */ 00000170
 /*                      BPB.FNR_DØD  = 11111111111 OG ENDRINGENE    */ 00000180
 /*                      VEDRØRER KONTROLLER MOT OPPLYSNINGER I REG  */ 00000190
 /*  ENDRINGEN BLE UTFØRT AV KARIN                                   */ 00000200
 /*  *****************************                                   */ 00000210
 /*  ENDRINGSDATO : 11/2-85                                          */ 00000220
 /*  ENDRINGEN GJELDER : FEIL I TILKNYTTINGSSEGMENTENE NÅR DET BLIR  */ 00000230
 /*                      NYTT YNGSTE BARN I BARNEKULLET. (EKS.:      */ 00000240
 /*                      NYTT YNGSTE BARN FØDT ETTER DØDSFALLET)     */ 00000250
 /*  ENDRINGEN BLE UTFØRT AV KARIN                                   */ 00000260
 /*  *****************************                                   */ 00000270
 /*HENSIKT:                                                          */ 00000280
 /*    DETTE ER KONTROLL AV BARNEPENSJON - EN AV FORELDRENE ER DØD.  */ 00000290
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT        */ 00000300
 /*    INFORMASJON I REGISTERET.                                     */ 00000310
 /*    NÅR DET OPPDAGES UOVERENSSTEMMELSER, BLIR FEIL-MELD-NR SATT   */ 00000320
 /*    OG VI GÅR UT AV PGR.FOR HVER PERSON SOM GÅR FEILFRI GJENNOM   */ 00000330
 /*    KONTROLLENE BLIR DET OPPRETTET NY STATUS FOR PERSONEN OG      */ 00000340
 /*    SØKERENS STATUS OPPDATERES. TRANSTYPE SETTES I TRANSAKSJONEN. */ 00000350
 /*    DETTE FORUTSETTER AT DØDSMELDINGEN FOR AVDØDE ER BEHANDLET PÅ */ 00000360
 /*    FORHÅND OG AT BARNA ER SORTERT ETTER FNR. DETTE ER FORDI VI MÅ*/ 00000370
 /*    KONTROLLERE OM BARNET ER TILKNYTTET SAMME YNGSTE BARN SOM OGSÅ*/ 00000380
 /*    ER TILKNYTTET SAMME AVDØDE (SOM ER I TRANSEN). DETTE KAN VI   */ 00000390
 /*    IKKE GJØRE HVIS IKKE YNGSTE BARN ALT ER LEST INN. YNGSTE BARN */ 00000400
 /*    I TRANSEN BEHANDLES FØRST.                                    */ 00000410
 /*PROGRAMTILKNYTNING:                                               */ 00000420
 /*    KALLES OPP FRA PROGRAM R0013520.                              */ 00000430
 /*BRUK:                                                             */ 00000440
 /*    EXEC CICS XCTL PROGRAM ('R0011120') COMMAREA (KOM_OMR)        */ 00000450
 /*                                                                  */ 00000460
 /* ***************************************************************  */ 00000470
 %SKIP;                                                                 00000480
 BPTR:                                                                  00000490
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                00000500
 %SKIP;                                                                 00000510
      %INCLUDE P0019908;                                                00000520
      %INCLUDE P0019906;                                                00000530
      %INCLUDE P0011101;                                                00000540
      %INCLUDE P0019910;                                                00000550
      %INCLUDE P0019912;                                                00000560
      DCL 1 B01 BASED(B01_PEKER),%INCLUDE P0019921;                     00000570
      DCL 1 B02 BASED(B02_PEKER),%INCLUDE P0019921;                     00000580
   DCL                                                                  00000590
      COMMAREA_PEKER PTR;                                               00000600
 %PAGE;                                                                 00000610
   DCL                                                                  00000620
      BARN_IND                           FIXED BIN (15),                00000630
      FORRIGE_YNG_BARN_IND               FIXED BIN (15),                00000640
      AVDØD_IND                          FIXED BIN (15),                00000650
      YNG_BARN_LEST                      CHAR       (1),                00000660
      W_STATUS_TYPE                      CHAR       (1),                00000670
      BARN_ANTALL                        DEC FIXED (3),                 00000680
      I                                  FIXED BIN (15),                00000690
      J                                  FIXED BIN (15),                00000700
      HJ_VIRK_DATO_ÅM                    PIC     '(4)9',                00000710
      ANT_BARN_I_TRANS                   DEC FIXED (3);                 00000720
   DCL                                                                  00000730
      FNR                                PIC    '(11)9',                00000740
      KJØNN_SIFFER DEF FNR POS(9)        PIC        '9';                00000750
 %SKIP;                                /*   */                          00000760
                                                                        00000770
 /* ********************************************************** */       00000780
 /* PROGRAMMET BEGYNNER HER.                                   */       00000790
 /* ********************************************************** */       00000800
                                                                        00000810
 %SKIP;                                                                 00000820
      PROGRAM_ID           = 'R0011120';                                00000830
      EXEC CICS PURGE MESSAGE;                                          00000840
      TRANSTYPE            = 04;                                        00000850
      W_STATUS_TYPE        = STATUS_TYPE;                               00000860
      YNG_BARN_LEST        = 'N';                                       00000870
      I                    = 0;                                         00000880
      ANT_BARN_I_TRANS     = 0;                                         00000890
      BARN_ANTALL          = 0;                                         00000900
      BARN_IND             = 0;                                         00000910
      FORRIGE_YNG_BARN_IND = 0;                                         00000920
      FNR                  = BPB.FNR_DØD;                               00000930
      HJ_VIRK_DATO_ÅM = F_SNU_DATO (BPB.VIRK_DATO_MÅ);                  00000940
 %SKIP;                                                                 00000950
      IF VERIFY(KJØNN_SIFFER,'02468') = 0 THEN                          00000960
         AVDØD_IND = 1;                                                 00000970
      ELSE                                                              00000980
         AVDØD_IND = 2;                                                 00000990
 /* ***************************************************************** */00001000
 /* DERSOM AVDØD ER OPPGITT - FNR_DØD ULIK 11111111111                */00001010
 /* ***************************************************************** */00001020
      IF BPB.FNR_DØD ^= (11)'1' THEN                                    00001030
         DO;                                                            00001040
                                                                        00001050
 /* ***************************************************************** */00001060
 /* DERSOM AVDØD IKKE ER I BASEN.                                     */00001070
 /* ***************************************************************** */00001080
                                                                        00001090
            IF B01.FNR(AVDØD_IND) = 0 THEN                              00001100
               DO;                                                      00001110
                  DØD = '1'B;                                           00001120
                  SEARCH_FNR  = BPB.FNR_DØD;                            00001130
                  POS_I_B01   = AVDØD_IND;                              00001140
                 EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);00001150
                  IF FEIL_MELD_NR > 0 THEN                              00001160
                     GO  TO L999;                                       00001170
                  ELSE                                                  00001180
                     PROGRAM_ID = 'R0011120';                           00001190
                  DØD = '0'B;                                           00001200
               END;                                                     00001210
            ELSE                                                        00001220
               IF B01.FNR(AVDØD_IND) ^= BPB.FNR_DØD THEN                00001230
                  DO;                                                   00001240
  L100:                                                                 00001250
                     FEIL_VED_LABEL = '100';                            00001260
                     FEIL_MELD_NR   = 1307;                             00001270
                     GO TO L999;                                        00001280
                  END;                                                  00001290
                                                                        00001300
 /* ***************************************************************** */00001310
 /* DERSOM IKKE REGISTRERT SOM DØD.                                   */00001320
 /* ***************************************************************** */00001330
                                                                        00001340
            IF B01.DØDSDATO_ÅMD(AVDØD_IND) = 0 &                        00001350
               B01.FNR(AVDØD_IND) > 0            THEN                   00001360
               DO;                                                      00001370
  L120:                                                                 00001380
                  FEIL_VED_LABEL = '120';                               00001390
                  FEIL_MELD_NR   = 1710;                                00001400
                  GO TO L999;                                           00001410
               END;                                                     00001420
                                                                        00001430
 /* ***************************************************************** */00001440
 /* SØKER HAR IKKE PENSJONSSTATUS.                                    */00001450
 /* ***************************************************************** */00001460
                                                                        00001470
            STATUS_TYPE    = W_STATUS_TYPE;                             00001480
            IF STATUS_TYPE = 'A' !                                      00001490
               STATUS_TYPE = 'C' !                                      00001500
               STATUS_TYPE = 'I' !       /* TILLEGGSTEST PÅ 'I' OG */   00001510
               STATUS_TYPE = 'K' THEN    /* 'K' - 13.3.85  HL      */   00001520
               DO;                                                      00001530
                                                                        00001540
 /* ***************************************************************** */00001550
 /* DERSOM SØKER ER I BASEN.                                          */00001560
 /* ***************************************************************** */00001570
                                                                        00001580
                  IF B01.FNR(SØKER_IND) > 0 THEN                        00001590
                     DO;                                                00001600
                        /*  13/2-85 AV KARIN                          */00001610
                        /*  TIDL.:CALL FLYTT_B01_TIL_B02(SØKER_IND);  */00001620
                        /*  IF FEIL_MELD_NR > 0 THEN                  */00001630
                        /*     GO TO L999;                            */00001640
                        /*  ELSE                                      */00001650
                        /*     PROGRAM_ID = 'R0011120';               */00001660
                        B02.PERSON(SØKER_IND) = B01.PERSON(SØKER_IND);  00001670
 /* TILLEGG 17.4.85 HL                                              */  00001680
                                                                        00001690
                                     B02.STATUS_KODE_HIST(SØKER_IND)    00001700
                                         = ' ';                         00001710
 /**/                                                                   00001720
                     END;                                               00001730
                                                                        00001740
 /* ***************************************************************** */00001750
 /* SØKER ER IKKE I BASEN.                                            */00001760
 /* ***************************************************************** */00001770
                                                                        00001780
                  ELSE                                                  00001790
                     B02.FNR   (SØKER_IND) = BPB.FNR_BARN(1);           00001800
                                                                        00001810
                  B02.PERSON(AVDØD_IND) = B01.PERSON(AVDØD_IND);        00001820
                                                                        00001830
                  B02.NAVN  (SØKER_IND) = BPB.NAVN_BARN(1);             00001840
                  B02.SPRÅK (SØKER_IND) = BPB.SPRÅK;                    00001850
                  B02.TKNR  (SØKER_IND) = BPB.TKNR(1);                  00001860
                  BARN_IND              = SØKER_IND;                    00001870
                  CALL OPPRETT_STATUS_BP_BARN;                          00001880
                  CALL                                                  00001890
                      KOBLE_TO_PERSONER(SØKER_IND,AVDØD_IND);           00001900
               END;                                                     00001910
            ELSE                                                        00001920
                                                                        00001930
 /* ***************************************************************** */00001940
 /* SØKER HAR PENSJONSSTATUS.                                         */00001950
 /* ***************************************************************** */00001960
                                                                        00001970
               IF STATUS_TYPE ^= 'F' THEN                               00001980
                  DO;                                                   00001990
                     IF B01.TKNR(SØKER_IND) > 0 THEN                    00002000
                        IF B01.TKNR(SØKER_IND) ^= BPB.TKNR(1) THEN      00002010
                           DO;                                          00002020
  L140:                                                                 00002030
                              FEIL_VED_LABEL = '140';                   00002040
                              FEIL_MELD_NR   = 1702;                    00002050
                              GO TO L999;                               00002060
                           END;                                         00002070
                                                                        00002080
 /* ***************************************************************** */00002090
 /* DERSOM SØKER HAR UFØREPENSJON.                                    */00002100
 /* ***************************************************************** */00002110
                                                                        00002120
                     IF B01.PENSJONSTYPE1(SØKER_IND) = 'U' THEN         00002130
                        DO;                                             00002140
                                                                        00002150
 /* ***************************************************************** */00002160
 /* DERSOM SØKER ER UGIFT.                                            */00002170
 /* ***************************************************************** */00002180
                                                                        00002190
                           IF B01.SIVILSTAND(SØKER_IND) = 'U' THEN      00002200
                              DO;                                       00002210
                                 CALL                                   00002220
                                    FLYTT_B01_TIL_B02(SØKER_IND);       00002230
                                 IF FEIL_MELD_NR > 0 THEN               00002240
                                    GO TO L999;                         00002250
                                 ELSE                                   00002260
                                    PROGRAM_ID = 'R0011120';            00002270
                                 B02.PERSON(AVDØD_IND) =                00002280
                                           B01.PERSON(AVDØD_IND);       00002290
                                 B02.PENSJONSTYPE3(SØKER_IND) = 'U';    00002300
                                 CALL                                   00002310
                                    KOBLE_TO_PERSONER(                  00002320
                                    SØKER_IND,AVDØD_IND);               00002330
                              END;                                      00002340
                                                                        00002350
 /* ***************************************************************** */00002360
 /* ELLERS ER SØKER GIFT, SKILT, ETTERLATT.                           */00002370
 /* ***************************************************************** */00002380
                                                                        00002390
                           ELSE                                         00002400
                              DO;                                       00002410
  L150:                                                                 00002420
                                 FEIL_VED_LABEL = '150';                00002430
                                 FEIL_MELD_NR   = 1301;                 00002440
                                 GO TO L999;                            00002450
                              END;                                      00002460
                        END;                                            00002470
                     ELSE                                               00002480
                        IF B01.PENSJONSTYPE1(SØKER_IND) = 'N' THEN      00002490
                           DO;                                          00002500
                                                                        00002510
 /* ***************************************************************** */00002520
 /* DERSOM SØKER ER YNGSTE BARN.                                      */00002530
 /* ***************************************************************** */00002540
 /* ENDRET 08.02.88   SATISH                                         */ 00002550
 /*                           IF B01.PENSJONSTYPE2(SØKER_IND)        */ 00002560
 /*                                        = 'Y' THEN                */ 00002570
 /*  HIT TILL      08.02.88                                          */ 00002580
                                                                        00002590
                              IF B01.PENSJONSTYPE2(SØKER_IND) = 'P'     00002600
                                                 THEN                   00002610
                                 DO;                                    00002620
                                    YNG_BARN_LEST = 'J';                00002630
                                    B02.PERSON(AVDØD_IND) =             00002640
                                        B01.PERSON(AVDØD_IND);          00002650
                                    CALL                                00002660
                                      FLYTT_B01_TIL_B02(SØKER_IND);     00002670
                                    IF FEIL_MELD_NR > 0 THEN            00002680
                                       GO TO L999;                      00002690
                                    ELSE                                00002700
                                       PROGRAM_ID = 'R0011120';         00002710
                                                                        00002720
                                 END;                                   00002730
                                                                        00002740
 /* ***************************************************************** */00002750
 /* IKKE YNGSTE BARN.                                                 */00002760
 /* ***************************************************************** */00002770
                                                                        00002780
                              ELSE                                      00002790
                                 DO;                                    00002800
  L160:                                                                 00002810
                                    FEIL_VED_LABEL = '160';             00002820
                                    FEIL_MELD_NR   = 1303;              00002830
                                    GO TO L999;                         00002840
                                 END;                                   00002850
                           END;                                         00002860
                                                                        00002870
 /* ***************************************************************** */00002880
 /* BARNEPENSJONIST BEGGE FORELDRE DØDE                               */00002890
 /* ***************************************************************** */00002900
                                                                        00002910
                        ELSE                                            00002920
                           IF B01.PENSJONSTYPE1(SØKER_IND) = 'B' THEN   00002930
                              DO;                                       00002940
  L170:                                                                 00002950
                                 FEIL_VED_LABEL = '170';                00002960
                                 FEIL_MELD_NR   = 1306;                 00002970
                                 GO TO L999;                            00002980
                              END;                                      00002990
                                                                        00003000
 /* **************************************************************** */ 00003010
 /* ELLERS FORSØRGET BARN.                                           */ 00003020
 /* **************************************************************** */ 00003030
                                                                        00003040
                           ELSE                                         00003050
                              IF B01.PENSJONSTYPE1(SØKER_IND)           00003060
                                                  = 'L' THEN            00003070
                                 DO;                                    00003080
  L180:                                                                 00003090
                                   FEIL_VED_LABEL = '180';              00003100
                                   FEIL_MELD_NR   = 1203;               00003110
                                   GO TO L999;                          00003120
                                 END;                                   00003130
                                                                        00003140
 /* **************************************************************** */ 00003150
 /* PENSJONSTYPE1 = NOE ANNET.                                       */ 00003160
 /* **************************************************************** */ 00003170
                                                                        00003180
                              ELSE                                      00003190
                                 DO;                                    00003200
    L200:                                                               00003210
                                    FEIL_VED_LABEL = '200';             00003220
                                    FEIL_MELD_NR   = 1301;              00003230
                                    GO TO L999;                         00003240
                                 END;                                   00003250
                 /* 11/2-85 KARIN                                  */   00003260
                 /* FØLGENDE 3 STATEMENTS LÅ ETTER END-STATEMENTET */   00003270
                 /* OG BLE IKKE UTFØRT - DETTE FØRTE TIL FEIL I    */   00003280
                 /* TILKNYTNINGENE NÅR NYTT YNGSTE BARN I KULLET   */   00003290
                     I = 1;                                             00003300
                     BARN_IND = SØKER_IND;                              00003310
                     CALL AJOURFØR_B02_MED_BPTRANS(I);                  00003320
                  END;  /* STATUS_TYPE ^= F  */                         00003330
         END;                                                           00003340
      ELSE                                                              00003350
         DO;                                                            00003360
 /* **************************************************************** */ 00003370
 /* AVDØDES FNR ER UOPPGITT  - DVS 11111111111                       */ 00003380
 /* **************************************************************** */ 00003390
                                                                        00003400
                                                                        00003410
 /* ***************************************************************** */00003420
 /* SØKER HAR IKKE PENSJONSSTATUS.                                    */00003430
 /* ***************************************************************** */00003440
                                                                        00003450
            STATUS_TYPE    = W_STATUS_TYPE;                             00003460
            IF STATUS_TYPE = 'A' !                                      00003470
               STATUS_TYPE = 'C' THEN                                   00003480
               DO;                                                      00003490
                                                                        00003500
 /* ***************************************************************** */00003510
 /* DERSOM SØKER ER I BASEN.                                          */00003520
 /* ***************************************************************** */00003530
                                                                        00003540
                  IF B01.FNR(SØKER_IND) > 0 THEN                        00003550
                     DO;                                                00003560
                        /* ENDRET 13/2-85 AV KARIN                    */00003570
                        /* TIDL. CALL FLYTT_B01_TIL_B02(SØKER_IND);   */00003580
                        /* IF FEIL_MELD_NR > 0 THEN                   */00003590
                        /*    GO TO L999;                             */00003600
                        /* ELSE                                       */00003610
                        /*   PROGRAM_ID = 'R0011120';                 */00003620
                        B02.PERSON (SØKER_IND) = B01.PERSON (SØKER_IND);00003630
 /* TILLEGG 17.4.85 HL                                              */  00003640
                                                                        00003650
                                     B02.STATUS_KODE_HIST(SØKER_IND)    00003660
                                         = ' ';                         00003670
 /**/                                                                   00003680
                     END;                                               00003690
                                                                        00003700
 /* ***************************************************************** */00003710
 /* SØKER ER IKKE I BASEN.                                            */00003720
 /* ***************************************************************** */00003730
                                                                        00003740
                  ELSE                                                  00003750
                     B02.FNR   (SØKER_IND) = BPB.FNR_BARN(1);           00003760
                                                                        00003770
                  B02.NAVN  (SØKER_IND) = BPB.NAVN_BARN(1);             00003780
                  B02.SPRÅK (SØKER_IND) = BPB.SPRÅK;                    00003790
                  B02.TKNR  (SØKER_IND) = BPB.TKNR(1);                  00003800
                  BARN_IND              = SØKER_IND;                    00003810
                  CALL OPPRETT_STATUS_BP_BARN;                          00003820
               END;                                                     00003830
            ELSE                                                        00003840
               DO;                                                      00003850
                                                                        00003860
 /* ***************************************************************** */00003870
 /* SØKER HAR PENSJONSSTATUS.                                         */00003880
 /* ***************************************************************** */00003890
                                                                        00003900
                  IF STATUS_TYPE ^= 'F' THEN                            00003910
                     DO;                                                00003920
                        IF B01.TKNR(SØKER_IND) > 0 THEN                 00003930
                           IF B01.TKNR(SØKER_IND) ^= BPB.TKNR(1) THEN   00003940
                              DO;                                       00003950
  L210:                                                                 00003960
                                 FEIL_VED_LABEL = '210';                00003970
                                 FEIL_MELD_NR   = 1702;                 00003980
                                 GO TO L999;                            00003990
                              END;                                      00004000
                                                                        00004010
 /* ***************************************************************** */00004020
 /* DERSOM SØKER HAR UFØREPENSJON.                                    */00004030
 /* ***************************************************************** */00004040
                                                                        00004050
                        IF B01.PENSJONSTYPE1(SØKER_IND) = 'U' THEN      00004060
                           DO;                                          00004070
                                                                        00004080
 /* ***************************************************************** */00004090
 /* DERSOM SØKER ER UGIFT.                                            */00004100
 /* ***************************************************************** */00004110
                                                                        00004120
                              IF B01.SIVILSTAND(SØKER_IND) = 'U' THEN   00004130
                                 DO;                                    00004140
                                    CALL                                00004150
                                       FLYTT_B01_TIL_B02(SØKER_IND);    00004160
                                    IF FEIL_MELD_NR > 0 THEN            00004170
                                       GO TO L999;                      00004180
                                    ELSE                                00004190
                                       PROGRAM_ID = 'R0011120';         00004200
                                    B02.PENSJONSTYPE3(SØKER_IND) = 'U'; 00004210
                                 END;                                   00004220
                                                                        00004230
 /* ***************************************************************** */00004240
 /* ELLERS ER SØKER GIFT, SKILT, ETTERLATT.                           */00004250
 /* ***************************************************************** */00004260
                                                                        00004270
                              ELSE                                      00004280
                                 DO;                                    00004290
  L220:                                                                 00004300
                                    FEIL_VED_LABEL = '220';             00004310
                                    FEIL_MELD_NR   = 1301;              00004320
                                    GO TO L999;                         00004330
                                 END;                                   00004340
                           END;                                         00004350
                        ELSE                                            00004360
                           IF B01.PENSJONSTYPE1(SØKER_IND) = 'N' THEN   00004370
                              DO;                                       00004380
                                                                        00004390
 /* ***************************************************************** */00004400
 /* DERSOM SØKER ER YNGSTE BARN.                                      */00004410
 /* ***************************************************************** */00004420
                                                                        00004430
 /* ENDRET 08.02.88   SATISH                                         */ 00004440
 /*                              IF B01.PENSJONSTYPE2(SØKER_IND)     */ 00004450
 /*                                           = 'Y' THEN             */ 00004460
 /*  HIT TILL      08.02.88                                          */ 00004470
                                                                        00004480
                                IF B01.PENSJONSTYPE2(SØKER_IND) = 'P'   00004490
                                                    THEN                00004500
                                    DO;                                 00004510
                                       YNG_BARN_LEST = 'J';             00004520
                                       CALL                             00004530
                                         FLYTT_B01_TIL_B02(SØKER_IND);  00004540
                                       IF FEIL_MELD_NR > 0 THEN         00004550
                                          GO TO L999;                   00004560
                                       ELSE                             00004570
                                          PROGRAM_ID = 'R0011120';      00004580
                                                                        00004590
                                    END;                                00004600
                                                                        00004610
 /* ***************************************************************** */00004620
 /* IKKE YNGSTE BARN.                                                 */00004630
 /* ***************************************************************** */00004640
                                                                        00004650
                                 ELSE                                   00004660
                                    DO;                                 00004670
  L230:                                                                 00004680
                                       FEIL_VED_LABEL = '230';          00004690
                                       FEIL_MELD_NR   = 1303;           00004700
                                       GO TO L999;                      00004710
                                    END;                                00004720
                              END;                                      00004730
                                                                        00004740
 /* ***************************************************************** */00004750
 /* BARNEPENSJONIST BEGGE FORELDRE DØDE                               */00004760
 /* ***************************************************************** */00004770
                                                                        00004780
                           ELSE                                         00004790
                              IF B01.PENSJONSTYPE1(SØKER_IND) = 'B' THEN00004800
                                 DO;                                    00004810
  L240:                                                                 00004820
                                    FEIL_VED_LABEL = '240';             00004830
                                    FEIL_MELD_NR   = 1306;              00004840
                                    GO TO L999;                         00004850
                                 END;                                   00004860
                                                                        00004870
 /* **************************************************************** */ 00004880
 /* ELLERS FORSØRGET BARN.                                           */ 00004890
 /* **************************************************************** */ 00004900
                                                                        00004910
                              ELSE                                      00004920
                                 IF B01.PENSJONSTYPE1(SØKER_IND)        00004930
                                                     = 'L' THEN         00004940
                                    DO;                                 00004950
  L250:                                                                 00004960
                                      FEIL_VED_LABEL = '250';           00004970
                                      FEIL_MELD_NR   = 1203;            00004980
                                      GO TO L999;                       00004990
                                    END;                                00005000
                                                                        00005010
 /* **************************************************************** */ 00005020
 /* PENSJONSTYPE1 = NOE ANNET.                                       */ 00005030
 /* **************************************************************** */ 00005040
                                                                        00005050
                                 ELSE                                   00005060
                                    DO;                                 00005070
  L260:                                                                 00005080
                                       FEIL_VED_LABEL = '260';          00005090
                                       FEIL_MELD_NR   = 1301;           00005100
                                       GO TO L999;                      00005110
                                    END;                                00005120
                     END;  /* STATUS_TYPE ^= F  */                      00005130
                  I = 1;                                                00005140
                  BARN_IND = SØKER_IND;                                 00005150
                  CALL AJOURFØR_B02_MED_BPTRANS(I);                     00005160
               END;                                                     00005170
         END;     /* FNR_DØD = 11111111111 */                           00005180
                                                                        00005190
                                                                        00005200
 /* **************************************************************** */ 00005210
 /* BARNEDELEN.                                                      */ 00005220
 /* **************************************************************** */ 00005230
 /* NÅ HAR VI AVDØDE OG YNGSTE BARN MED EVENTUELLE TILKNYTTEDE BARN */  00005240
 /* PÅ PLASS OG KOBLET I B02                                        */  00005250
 /* HVIS YNGSTE BARN IKKE ER I BASEN FRA FØR ER INGEN AV DE ØVRIGE  */  00005260
 /* BARNA I BP_TRANSEN LEST INN ENNÅ.                               */  00005270
 /* *************************************************************** */  00005280
                                                                        00005290
 DO I = 2 TO 10 WHILE(BPB.FNR_BARN(I) > 0);                             00005300
    BARN_IND = 0;                                                       00005310
    DO J = 4 TO 14 WHILE (B02.FNR(J) > 0);                              00005320
       IF BPB.FNR_BARN(I) = B02.FNR(J) THEN                             00005330
          DO;                                                           00005340
             BARN_IND = J;                                              00005350
             J        = 14;                                             00005360
          END;                                                          00005370
    END;                                                                00005380
 %PAGE;                                /* */                            00005390
                                                                        00005400
 /* ***************************************************************** */00005410
 /* BARNET ER IKKE I B01, IKKE LEST INN I B01 SAMMEN MED YNGSTE BARN  */00005420
 /* ***************************************************************** */00005430
                                                                        00005440
    IF BARN_IND = 0 THEN                                                00005450
       DO;                                                              00005460
          BARN_IND        = J;                                          00005470
          SEARCH_FNR      = BPB.FNR_BARN(I);                            00005480
          POS_I_B01       = BARN_IND;                                   00005490
                                                                        00005500
          /* BARNET LESES INN I B01                          */         00005510
          EXEC CICS LINK PROGRAM ('R0019928') COMMAREA (KOM_OMR);       00005520
          IF FEIL_MELD_NR > 0 THEN                                      00005530
             GO  TO L999;                                               00005540
          ELSE                                                          00005550
             PROGRAM_ID = 'R0011120';                                   00005560
                                                                        00005570
 /* *************************************************************** */  00005580
 /* DERSOM BARNET ER I BASEN.                                       */  00005590
 /* *************************************************************** */  00005600
                                                                        00005610
          IF STATUS_TYPE = 'A' !                                        00005620
             STATUS_TYPE = 'C' THEN                                     00005630
             DO;                                                        00005640
                                                                        00005650
 /* *************************************************************** */  00005660
 /* DERSOM BARNET IKKE HAR PENSJONSSTATUS.                          */  00005670
 /* *************************************************************** */  00005680
                                                                        00005690
                IF B01.FNR(BARN_IND) > 0           THEN                 00005700
                   DO;                                                  00005710
                      /* ENDRET 13/2-85 AV KARIN      */                00005720
                      /* TIDL. CALL FLYTT_B01_TIL_B02(BARN_IND);    */  00005730
                      /*       IF FEIL_MELD_NR > 0 THEN             */  00005740
                      /*          GO TO L999;                       */  00005750
                      /*       ELSE                                 */  00005760
                      /*          PROGRAM_ID = 'R0011120';          */  00005770
                      B02.PERSON (BARN_IND) = B01.PERSON (BARN_IND);    00005780
 /* TILLEGG 17.4.85 HL                                              */  00005790
                                                                        00005800
                                     B02.STATUS_KODE_HIST(BARN_IND)     00005810
                                         = ' ';                         00005820
 /**/                                                                   00005830
                   END;                                                 00005840
                ELSE                                                    00005850
                                                                        00005860
 /* ***************************************************************** */00005870
 /* BARNET ER IKKE I BASEN                                            */00005880
 /* ***************************************************************** */00005890
                                                                        00005900
                   B02.FNR   (BARN_IND) = BPB.FNR_BARN(I);              00005910
                B02.NAVN  (BARN_IND) = BPB.NAVN_BARN(I);                00005920
                B02.TKNR  (BARN_IND) = BPB.TKNR(I);                     00005930
                B02.SPRÅK (BARN_IND) = BPB.SPRÅK;                       00005940
                CALL OPPRETT_STATUS_BP_BARN;                            00005950
                CALL                                                    00005960
                    KOBLE_TO_PERSONER(SØKER_IND,                        00005970
                                                       BARN_IND);       00005980
                                                                        00005990
             END;                                                       00006000
          ELSE                                                          00006010
             DO;                                                        00006020
                IF B01.TKNR(BARN_IND) ^=                                00006030
                                         BPB.TKNR(I) THEN               00006040
                   DO;                                                  00006050
  L300:                                                                 00006060
                      FEIL_VED_LABEL = '300';                           00006070
                      FEIL_MELD_NR   = 1702;                            00006080
                      GO TO L999;                                       00006090
                   END;                                                 00006100
                ELSE                                                    00006110
                   IF STATUS_TYPE ^= 'F' &                              00006120
                      STATUS_TYPE ^= 'H'        THEN                    00006130
                      DO;                                               00006140
                                                                        00006150
                         IF B01.PENSJONSTYPE1(BARN_IND) = 'U' THEN      00006160
                            DO;                                         00006170
                               IF B01.SIVILSTAND(BARN_IND) = 'U' THEN   00006180
                                  DO;                                   00006190
                                     /* ENDRET 13/2-85 AV KARIN     */  00006200
                                     /* TIDLIGERE:                  */  00006210
                                     /*CALL                         */  00006220
                                     /* FLYTT_B01_TIL_B02(BARN_IND);*/  00006230
                                     /* IF FEIL_MELD_NR > 0 THEN    */  00006240
                                     /*    GO TO L999;              */  00006250
                                     /* ELSE                        */  00006260
                                     /*    PROGRAM_ID = 'R0011120';*/   00006270
                                                                        00006280
                                     B02.PERSON(BARN_IND) =             00006290
                                     B01.PERSON(BARN_IND);              00006300
 /* TILLEGG 17.4.85 HL                                              */  00006310
                                                                        00006320
                                     B02.STATUS_KODE_HIST(BARN_IND)     00006330
                                         = ' ';                         00006340
 /**/                                                                   00006350
                                                                        00006360
                                  END;                                  00006370
                               ELSE                                     00006380
                                  DO;                                   00006390
  L310:                                                                 00006400
                                     FEIL_VED_LABEL = '310';            00006410
                                     FEIL_MELD_NR   = 1301;             00006420
                                     GO TO L999;                        00006430
                                  END;                                  00006440
                            END;                                        00006450
                         ELSE                                           00006460
                            IF B01.PENSJONSTYPE1(BARN_IND) = 'N' THEN   00006470
                               DO;                                      00006480
                                                                        00006490
 /* ***************************************************************** */00006500
 /* NÅ SUMMERER VI ANTALL BARN I SAMME BARNEKULL FOR Å VÆRE SIKKER PÅ */00006510
 /* AT DET ER INGEN IGJEN I REGISTERET. BARNA ER SORTERT PÅ FORHÅND   */00006520
 /* SLIK AT VI ALLTID LESER YNGSTE BARN FØRST.                        */00006530
 /* ***************************************************************** */00006540
                                                                        00006550
 /* ENDRET 08.02.88   SATISH                                         */ 00006560
 /*                               IF B01.PENSJONSTYPE2(              */ 00006570
 /*                                            BARN_IND) = 'Y' THEN  */ 00006580
 /*  HIT TILL      08.02.88                                          */ 00006590
                                                                        00006600
                                IF B01.PENSJONSTYPE2(BARN_IND) = 'P'    00006610
                                                           THEN         00006620
                                     DO;                                00006630
                                        IF YNG_BARN_LEST = 'J' THEN     00006640
                                           DO;                          00006650
  L330:                                                                 00006660
                                              FEIL_VED_LABEL = '330';   00006670
                                              FEIL_MELD_NR   = 1309;    00006680
                                              GO TO L999;               00006690
                                           END;                         00006700
                                        /* ENDRET 13/2-85 AV KARIN   */ 00006710
                                        /* TIDL.: CALL FLYTT_B01_TIL */ 00006720
                                        /* B02(BARN_IND);            */ 00006730
                                        /* IF FEIL_MELD_NR > 0 THEN  */ 00006740
                                        /*    GO TO L999;            */ 00006750
                                        /* ELSE                      */ 00006760
                                        /*    PROGRAM_ID = 'R0011120';*/00006770
                                                                        00006780
                                        B02.PERSON(BARN_IND) =          00006790
                                        B01.PERSON(BARN_IND);           00006800
 /* TILLEGG 17.4.85 HL                                              */  00006810
                                                                        00006820
                                        B02.STATUS_KODE_HIST(BARN_IND)  00006830
                                            = ' ';                      00006840
 /**/                                                                   00006850
                                        FORRIGE_YNG_BARN_IND =          00006860
                                                            BARN_IND;   00006870
 /* 14/2-85 AV KARIN                                                  */00006880
 /* ***************************************************************** */00006890
 /* VI MÅ SLETTE TIDLIGER KOBLINGER MELLOM BARNET OG AVDØDE           */00006900
 /* ***************************************************************** */00006910
                                        CALL OPPHØR_KOBLING_TO_PERSONER 00006920
                                      (FORRIGE_YNG_BARN_IND, AVDØD_IND);00006930
                                       YNG_BARN_LEST = 'J';             00006940
                                    END;                                00006950
                                 ELSE                                   00006960
                                                                        00006970
 /* ***************************************************************** */00006980
 /* DERSOM TILKNYTTET FORRIGE YNGSTE BARN OG PENSJONSTYPE2 = Ø.       */00006990
 /* ***************************************************************** */00007000
                                                                        00007010
                                    IF B01.PENSJONSTYPE2(               00007020
                                                  BARN_IND) = 'Ø' THEN  00007030
                                       DO;                              00007040
                                        /* ENDRET 13/2-85 AV KARIN */   00007050
                                        /* TIDL.: CALL             */   00007060
                                        /* FLYTT_B01_TIL_B02       */   00007070
                                        /*           (BARN_IND);   */   00007080
                                        /*IF FEIL_MELD_NR > 0 THEN*/    00007090
                                        /*   GO TO L999;           */   00007100
                                        /*ELSE                     */   00007110
                                        /*   PROGRAM_ID='R0011120';*/   00007120
                                        B02.PERSON(BARN_IND) =          00007130
                                        B01.PERSON(BARN_IND);           00007140
 /* TILLEGG 17.4.85 HL                                              */  00007150
                                                                        00007160
                                        B02.STATUS_KODE_HIST(BARN_IND)  00007170
                                            = ' ';                      00007180
 /**/                                                                   00007190
                                        /* 14/2-85 AV KARIN        */   00007200
                                        IF YNG_BARN_LEST = 'J' THEN     00007210
                                          DO;                           00007220
                                            IF B01.FNR_TILKN            00007230
                                               (BARN_IND, 1) =          00007240
                                               B01.FNR                  00007250
                                               (FORRIGE_YNG_BARN_IND)   00007260
                                               THEN                     00007270
                                      CALL OPPHØR_KOBLING_TO_PERSONER   00007280
                                      (FORRIGE_YNG_BARN_IND, BARN_IND); 00007290
                                            ELSE                        00007300
                                             DO;                        00007310
  L335:                                                                 00007320
                                              FEIL_VED_LABEL = '335';   00007330
                                              FEIL_MELD_NR   = 1310;    00007340
                                              GO TO L999;               00007350
                                             END;                       00007360
                                                                        00007370
                                          END;                          00007380
                                       END; /* END PT2 = 'Ø' */         00007390
                                    ELSE                                00007400
                                       DO;                              00007410
  L340:                                                                 00007420
                                          FEIL_VED_LABEL = '340';       00007430
                                          FEIL_MELD_NR   = 1307;        00007440
                                          GO TO L999;                   00007450
                                       END;                             00007460
                               END;                                     00007470
                            ELSE                                        00007480
                               IF B01.PENSJONSTYPE1(BARN_IND) =         00007490
                                                               'L' THEN 00007500
                                  DO;                                   00007510
                                                                        00007520
 /* ***************************************************************** */00007530
 /* BARNET ER FORSØRGET AV ANDRE                                      */00007540
 /* ***************************************************************** */00007550
                                                                        00007560
  L350:                                                                 00007570
                                     FEIL_VED_LABEL = '350';            00007580
                                     FEIL_MELD_NR   = 1203;             00007590
                                     GO TO L999;                        00007600
                                  END;                                  00007610
                               ELSE                                     00007620
                                                                        00007630
 /* ***************************************************************** */00007640
 /* BARNET ER REGISTRERT SOM GIFT/SKILT/ETTERLATT                     */00007650
 /* ***************************************************************** */00007660
 /* DERSOM FORSØRGET EKTEFELLE.                                       */00007670
 /* ***************************************************************** */00007680
                                                                        00007690
                                     IF B01.PENSJONSTYPE1(              00007700
                                                   BARN_IND) = 'F' THEN 00007710
                                        DO;                             00007720
  L360:                                                                 00007730
                                           FEIL_VED_LABEL = '360';      00007740
                                           FEIL_MELD_NR   = 1206;       00007750
                                           GO TO L999;                  00007760
                                        END;                            00007770
                                     ELSE                               00007780
                                        DO;                             00007790
  L370:                                                                 00007800
                                           FEIL_VED_LABEL = '370';      00007810
                                           FEIL_MELD_NR   = 1306;       00007820
                                           GO TO L999;                  00007830
                                        END;                            00007840
                         CALL                                           00007850
                             AJOURFØR_B02_MED_BPTRANS(I);               00007860
                         CALL                                           00007870
                             KOBLE_TO_PERSONER(                         00007880
                                               SØKER_IND,BARN_IND);     00007890
                      END;                                              00007900
                   ELSE                                                 00007910
                      DO;                                               00007920
  L380:                                                                 00007930
                         FEIL_VED_LABEL = '380';                        00007940
                         FEIL_MELD_NR   = 0601;                         00007950
                         GO TO L999;                                    00007960
                      END;                                              00007970
             END;                                                       00007980
       END;                                                             00007990
    ELSE                                                                00008000
       /*  BARNET ER LEST INN SAMMEN MED YNGSTE BARN, DVS KOBLET */     00008010
       /*  FRA FØR.                                              */     00008020
       CALL                                                             00008030
           AJOURFØR_B02_MED_BPTRANS(I);                                 00008040
 END;                                                                   00008050
                                                                        00008060
 ANT_BARN_I_TRANS = I - 1;                                              00008070
                                                                        00008080
 /* TATT BORT 14/2-84 AV KARIN - KOBLINGENE TAS BORT VED BEHANLINGEN  */00008090
 /* AV HVERT ENKELT BARN                                              */00008100
 /* IF FORRIGE_YNG_BARN_IND > 0 THEN                                  */00008110
 /*   DO;                                                             */00008120
 /*    DO I=1 TO 13 WHILE(B02.FNR_TILKN(FORRIGE_YNG_BARN_IND,I) > 0); */00008130
 /*       IF B02.FNR(SØKER_IND) ^=                                    */00008140
 /*          B02.FNR_TILKN(FORRIGE_YNG_BARN_IND,I) THEN               */00008150
 /*          DO;                                                      */00008160
 /*             DO J = 1 TO 14 UNTIL(B02.FNR(J) =                     */00008170
 /*                      B02.FNR_TILKN(FORRIGE_YNG_BARN_IND,I));      */00008180
 /*             END;                                                  */00008190
 /*             IF B02.TILKNYTNINGSKODE(FORRIGE_YNG_BARN_IND,I) =     */00008200
 /*                                       'Ø' THEN                    */00008210
 /*                B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) =            */00008220
 /*                B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) - 1;         */00008230
 /*             CALL OPPHØR_KOBLING_TO_PERSONER                       */00008240
 /*             (FORRIGE_YNG_BARN_IND,I);                             */00008250
 /*          END;                                                     */00008260
 /*    END;                                                           */00008270
 /*    B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) =                        */00008280
 /*                        B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) - 1; */00008290
 /*    IF B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) > 1 THEN              */00008300
                                                                        00008310
 /* ***************************************************************** */00008320
 /* DET ER FLERE BARN FREMDELES TILKNYTTET.                           */00008330
 /* ***************************************************************** */00008340
                                                                        00008350
 /*         DO;                                                       */00008360
 /*  L390:                                                            */00008370
 /*             FEIL_VED_LABEL = '390';                               */00008380
 /*             FEIL_MELD_NR   = 1308;                                */00008390
 /*             GO TO L999;                                           */00008400
 /*          END;                                                     */00008410
 /*    ELSE                                                           */00008420
 /*       B02.ANTALL_BARN(FORRIGE_YNG_BARN_IND) = 0;                  */00008430
 /*   END;                                                            */00008440
 /* *************** HIT TATT BORT 14/2-85    ************************ */00008450
                                                                        00008460
 /* ***************************************************************** */00008470
 /* NÅR ALLE BARNA I TRANSEN ER I B02 MÅ ANTALL BARN I DET NYE        */00008480
 /* BARNEKULLET SUMMERES OG PESTATUS TIL YNGSTE BARN AJOURFØRES MED   */00008490
 /* DETTE TALLET.                                                     */00008500
 /* ***************************************************************** */00008510
                                                                        00008520
 /* FØRSTE_GANG_REG MÅ VæRE LIKT FOR HELE FAMILIEN                    */00008530
 /* 15/2-85 AV KARIN                                                  */00008540
 IF B02.FØRSTE_GANG_REG (3) = 'J' &                                     00008550
    B02.FØRSTE_GANG_REG (4) = 'N' THEN                                  00008560
    B02.FØRSTE_GANG_REG (3) = 'N';                                      00008570
                                                                        00008580
                                                                        00008590
 DO I = 3 TO 14 WHILE(B02.FNR(I) > 0);                                  00008600
    BARN_ANTALL = BARN_ANTALL + 1;                                      00008610
 END;                                                                   00008620
                                                                        00008630
 B02.ANTALL_BARN(SØKER_IND) = BARN_ANTALL;                              00008640
                                                                        00008650
 IF B02.ANTALL_BARN(SØKER_IND) ^= ANT_BARN_I_TRANS THEN                 00008660
    DO;                                                                 00008670
  L400:                                                                 00008680
       FEIL_VED_LABEL = '400';                                          00008690
       FEIL_MELD_NR   = 1308;                                           00008700
       GO TO L999;                                                      00008710
   END;                                                                 00008720
 L999:                                                                  00008730
 EXEC CICS RETURN;                                                      00008740
 %PAGE;                                                                 00008750
 %INCLUDE R0011121;                                                     00008760
 %INCLUDE R0011122;                                                     00008770
 %INCLUDE R0019905;                                                     00008780
 %INCLUDE R0019913;                                                     00008790
 %INCLUDE R0019924;                                                     00008800
 %INCLUDE R0019926;                                                     00008810
 %INCLUDE R0019934;         /* OPPHØR_KOBLING_TO_PERSONER  */           00008820
 END BPTR;                                                              00008830
