 /*       SIST ENDRET 25/02-94 13.08.25 AV   HERMAN                   */00000000
 /*       SIST ENDRET 23/07-90 13.15.51 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 13/07-89 13.22.46 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/04-89 14.40.05 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 25/10-88 13.47.28 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 06/10-87 10.08.19 AV   DYBVIK                   */00000050
 /*       SIST ENDRET 12/05-87 09.17.41 AV   DYBVIK                   */00000060
 /*       SIST ENDRET 05/10-84 14.13.26 AV   FARVIK                   */00000070
 /*       SIST ENDRET 17/09-84 10.22.15 AV   FARVIK                   */00000080
 /*       SIST ENDRET 11/09-84 14.58.39 AV   FARVIK                   */00000090
 R00114:                                                                00000100
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000110
 %PAGE;                                                                 00000120
 %INCLUDE S00114;    /*  ENDRINGSBLANKETT-1 MAPSETTET   */              00000130
 %PAGE;                                                                 00000140
 %INCLUDE P0011401;  /*  TRANS-OMR FOR ENDRINGSBLANKETT-1        */     00000150
 %PAGE;                                                                 00000160
 %INCLUDE P0019906;  /*  TRANS-OPPL-OMRÅDE (BASED)        */            00000170
 %PAGE;                                                                 00000180
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)               */            00000190
 %PAGE;                                                                 00000200
 %INCLUDE P0019910;  /*  STYRINGS-OMRÅDE (BASED)          */            00000210
 %PAGE;                                                                 00000220
 %INCLUDE P0019912;  /*  DIV_OMRÅDE (BASED)      */                     00000230
 %PAGE;                                                                 00000240
 %INCLUDE DFHBMSCA;                                                     00000250
 %PAGE;                                                                 00000260
   DCL                                                                  00000270
      (BMSMAPBR,COMMAREA_PEKER) PTR;                                    00000280
   DCL                                                                  00000290
      (ADDR,UNSPEC,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                  00000300
   DCL                                                                  00000310
      FEIL_FUNNET  BIT (1),                                             00000320
      ONKODE PIC'9999',                                                 00000330
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000340
      ONK DEF ONKODE CHAR(4),                                           00000350
      FEILKODE       CHAR(4),                                           00000360
      DSNAVN         CHAR(8),                                           00000370
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000380
 %SKIP(1);                                                              00000390
 %PAGE;                                                                 00000400
      ON ERROR SNAP BEGIN       ;                                       00000410
         ON ERROR SYSTEM        ;                                       00000420
         ONKODE=ONCODE          ;                                       00000430
         FEILKODE = ONK         ;                                       00000440
         DSNAVN   = EIBDS       ;                                       00000450
         GO TO FEILBEH          ;                                       00000460
      END;                                                              00000470
                                                                        00000480
 FEILKODE = 'FEIL'      ;                                               00000490
 DSNAVN   = '        '  ;                                               00000500
                                                                        00000510
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000520
                                                                        00000530
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2);                                00000540
                                                                        00000550
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000560
                                                                        00000570
 IF FRA_CICS THEN                                                       00000580
  DO;                                                                   00000590
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);00000600
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);     00000610
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);  00000620
  END;                                                                  00000630
                                                                        00000640
 IF HENT_FRAM_MAP  THEN                                                 00000650
   DO;                                                                  00000660
     EXEC CICS SEND MAP('S001141') MAPSET('S001143') MAPONLY            00000670
     SET (BMSMAPBR);                                                    00000680
     ALLOCATE S001141O;                                                 00000690
   END;                                                                 00000700
                                                                        00000710
 RECEIVE_MAP:                                                           00000720
                                                                        00000730
                                                                        00000740
 IF ^HENT_FRAM_MAP THEN                                                 00000750
    DO;                                                                 00000760
       EXEC CICS RECEIVE MAP('S001141')                                 00000770
                                    MAPSET('S001143') SET(BMSMAPBR);    00000780
       CALL BLANK_E1_MELDNR;                                            00000790
       FEIL_MELD_NR = 0;                                                00000800
    END;                                                                00000810
                                                                        00000820
 IF FUNKSJONSKODEL > 0 THEN                                             00000830
    DO;                                                                 00000840
       FUNKSJONSKODE = FUNKSJONSKODEI;                                  00000850
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);            00000860
    END;                                                                00000870
                                                                        00000880
 IF STYRE_KODEL > 0 THEN                                                00000890
    DO;                                                                 00000900
       STYREKODE = STYRE_KODEI;                                         00000910
       TRANSKODE = 'R041';                                              00000920
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);            00000930
    END;                                                                00000940
                                                                        00000950
                                                                        00000960
                                                                        00000970
 IF STYREKODE ^= 'E1'  &  FRA_CICS THEN                                 00000980
    TRANSKODE = 'R041';                                                 00000990
                                                                        00001000
 ELSE                                                                   00001010
  DO;                                                                   00001020
   TRANS_RETURKODE = TRANSKODE;                                         00001030
                                                                        00001040
   SELECT (TRANSKODE);                                                  00001050
    WHEN('R140')                                                        00001060
       DO;                                                              00001070
         CALL BLANK_E1_SØKER;                                           00001080
         CALL BLANK_E1_KAP7;                                            00001090
         CALL BLANK_E1_KAP8;                                            00001100
         CALL BLANK_E1_KAP10;                                           00001110
 /*YS*/  CALL BLANK_E1_KAP11;                                           00001120
         CALL BLANK_E1_MELDNR;                                          00001130
         CALL OVERFØR_E1_SØKER;                                         00001140
         CALL OVERFØR_E1_KAP7;                                          00001150
         CALL OVERFØR_E1_KAP8;                                          00001160
         CALL OVERFØR_E1_KAP10;                                         00001170
 /*YS*/  CALL OVERFØR_E1_KAP11;                                         00001180
         CALL KONTROLL_E1_SØKER(FEIL_FUNNET);                           00001190
         CALL KONTROLL_E1_KAP7(FEIL_FUNNET);                            00001200
         CALL KONTROLL_E1_KAP8(FEIL_FUNNET);                            00001210
         CALL KONTROLL_E1_KAP10(FEIL_FUNNET);                           00001220
 /*YS*/  CALL KONTROLL_E1_KAP11(FEIL_FUNNET);                           00001230
       END;                                                             00001240
    WHEN('R141')                                                        00001250
       DO;                                                              00001260
         CALL BLANK_E1_MELDNR;                                          00001270
         CALL OVERFØR_E1_SØKER;                                         00001280
         CALL OVERFØR_E1_KAP7;                                          00001290
         CALL OVERFØR_E1_KAP8;                                          00001300
         CALL OVERFØR_E1_KAP10;                                         00001310
 /*YS*/  CALL OVERFØR_E1_KAP11;                                         00001320
         CALL KONTROLL_E1_SØKER(FEIL_FUNNET);                           00001330
         CALL KONTROLL_E1_KAP7(FEIL_FUNNET);                            00001340
         CALL KONTROLL_E1_KAP8(FEIL_FUNNET);                            00001350
         CALL KONTROLL_E1_KAP10(FEIL_FUNNET);                           00001360
 /*YS*/  CALL KONTROLL_E1_KAP11(FEIL_FUNNET);                           00001370
       END;                                                             00001380
    OTHERWISE;                                                          00001390
                                                                        00001400
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */00001410
                                                                        00001420
   END;                                                                 00001430
                                                                        00001440
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                     00001450
    TRANS_RETURKODE ^= TRANSKODE THEN                                   00001460
                                                                        00001470
    DO;                                                                 00001480
       IF TRANSKODE = 'R140' THEN                                       00001490
          TRANSKODE = 'R141';                                           00001500
       CALL BLANK_E1_MAP;                                               00001510
       CALL OVERFØR_E1SØKER_MAP;                                        00001520
       CALL OVERFØR_E1KAP7_MAP;                                         00001530
       CALL OVERFØR_E1KAP8_MAP;                                         00001540
       CALL OVERFØR_E1KAP10_MAP;                                        00001550
 /*YS*/CALL OVERFØR_E1KAP11_MAP;                                        00001560
                                                                        00001570
      IF HENT_FRAM_MAP THEN                                             00001580
        EXEC CICS SEND MAP('S001141') MAPSET('S001143') ERASE CURSOR;   00001590
      ELSE                                                              00001600
        EXEC CICS SEND MAP('S001141') MAPSET('S001143') ERASEAUP        00001610
                                                    DATAONLY CURSOR;    00001620
      FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                 00001630
      HENT_FRAM_MAP = '0'B;                                             00001640
                                                                        00001650
      IF  FRA_CICS THEN                                                 00001660
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);          00001670
      ELSE                                                              00001680
        GOTO RECEIVE_MAP;                                               00001690
                                                                        00001700
    END;                                                                00001710
                                                                        00001720
   ELSE                                                                 00001730
                                                                        00001740
    DO;                                                                 00001750
                                                                        00001760
      IF TRANSKODE = 'R140' THEN                                        00001770
        TRANS_RETURKODE = 'R141';                                       00001780
      ELSE                                                              00001790
        TRANS_RETURKODE = TRANSKODE;                                    00001800
      IF  FRA_CICS  THEN                                                00001810
        DO;                                                             00001820
          BLANKETTYPE = STYREKODE;                                      00001830
          TRANSKODE = 'R042';                                           00001840
        END;                                                            00001850
    END;                                                                00001860
  END;                                                                  00001870
                                                                        00001880
  CALL UTGANG;                                                          00001890
                                                                        00001900
  UTGANG: PROC;                                                         00001910
    IF  FRA_CICS THEN                                                   00001920
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00001930
    ELSE                                                                00001940
      EXEC CICS RETURN;                                                 00001950
  END UTGANG;                                                           00001960
                                                                        00001970
                                                                        00001980
  FEILBEH:                                                              00001990
                                                                        00002000
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00002010
                                                                        00002020
     PROGRAM_ID = 'R0011401';                                           00002030
                                                                        00002040
     S001141O.MELDING2O =                                               00002050
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00002060
                                                                        00002070
     S001141O.MELDING3O =                                               00002080
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00002090
                                                                        00002100
     S001141O.MELDING4O =                                               00002110
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00002120
                                         !! '. DATASETT : ' !! DSNAVN;  00002130
                                                                        00002140
     S001141O.MELDING5O =                                               00002150
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00002160
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00002170
                                                                        00002180
     S001141O.MELDING6O =                                               00002190
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00002200
                                                                        00002210
                                                                        00002220
     EXEC CICS SEND MAP('S001141')                                      00002230
                                                 MAPSET('S001143');     00002240
                                                                        00002250
     EXEC CICS RECEIVE MAP('S001141')                                   00002260
                                    MAPSET('S001143') SET(BMSMAPBR);    00002270
                                                                        00002280
                                                                        00002290
     EXEC CICS SYNCPOINT ROLLBACK;                                      00002300
                                                                        00002310
                                                                        00002320
     TERMINERINGS_IND = 'F';                                            00002330
                                                                        00002340
     TRANSKODE  = 'R041';                                               00002350
                                                                        00002360
     CALL UTGANG;                                                       00002370
                                                                        00002380
  ABEND:                                                                00002390
     EXEC CICS ABEND ABCODE(FEIL);                                      00002400
                                                                        00002410
  PF1:                                                                  00002420
                                                                        00002430
                                                                        00002440
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */      00002450
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */      00002460
                                                                        00002470
     IF ^(E1S.FNRNR = 1          !                                      00002480
          E1S.FNRNR = 200        !                                      00002490
          E1S.VIRK_DATO_MÅNR = 9 !                                      00002500
          E1S.VIRK_DATO_MÅNR = 200) THEN                                00002510
        DO;                                                             00002520
                                                                        00002530
           IF FØDSNUMMER    = 0   THEN                                  00002540
                                                                        00002550
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */      00002560
                                                                        00002570
              DO;                                                       00002580
                 FEIL_MELD_NR  = 0;                                     00002590
                 S001141O.MELDING6O =                                   00002600
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!00002610
                         '.TRANSAKSJONEN ER FORKASTET.';                00002620
                                                                        00002630
              END;                                                      00002640
           ELSE                                                         00002650
              DO;                                                       00002660
                                                                        00002670
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;               00002680
                 IF FRA_CICS THEN                                       00002690
                    BLANKETTYPE = STYREKODE;                            00002700
                                                                        00002710
                                                                        00002720
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/  00002730
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/ 00002740
                    FUNKSJONSKODE = 'B';                                00002750
                                                                        00002760
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);  00002770
                                                                        00002780
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/      00002790
                                                                        00002800
                 S001141O.MELDING6O =                                   00002810
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';  00002820
              END;                                                      00002830
                                                                        00002840
                                                                        00002850
           EXEC CICS SEND MAP('S001141') MAPSET('S001143')              00002860
                                                           DATAONLY;    00002870
     /* DUMMY SEND-KALL.                              */                00002880
                                                                        00002890
           EXEC CICS SEND MAP('S001141')                                00002900
                                                  MAPSET('S001143');    00002910
           EXEC CICS DELAY INTERVAL(005);                               00002920
                                                                        00002930
           TERMINERINGS_IND = 'F';                                      00002940
                                                                        00002950
           TRANSKODE  = 'R041';                                         00002960
                                                                        00002970
           CALL UTGANG;                                                 00002980
                                                                        00002990
        END;                                                            00003000
     ELSE                                                               00003010
        DO;                                                             00003020
           TERMINERINGS_IND = 'F';                                      00003030
                                                                        00003040
           TRANSKODE = 'R041';                                          00003050
                                                                        00003060
           S001141O.MELDING6O =                                         00003070
                                                                        00003080
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB'; 00003090
                                                                        00003100
           EXEC CICS SEND MAP('S001141') MAPSET('S001143')              00003110
                                                           DATAONLY;    00003120
     /* DUMMY SEND-KALL.                            */                  00003130
                                                                        00003140
           EXEC CICS SEND MAP('S001141')                                00003150
                                    MAPSET('S001143');                  00003160
                                                                        00003170
           EXEC CICS DELAY INTERVAL(005);                               00003180
           CALL UTGANG;                                                 00003190
        END;                                                            00003200
                                                                        00003210
                                                                        00003220
  PF2:                                                                  00003230
     TERMINERINGS_IND   = 'F';                                          00003240
                                                                        00003250
     S001141O.MELDING6O =                                               00003260
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';  00003270
                                                                        00003280
     EXEC CICS SEND MAP('S001141') MAPSET('S001143')                    00003290
                                                      DATAONLY ;        00003300
     /* DUMMY SEND-KALL.                                     */         00003310
                                                                        00003320
     EXEC CICS SEND MAP('S001141')                                      00003330
                                    MAPSET('S001143');                  00003340
     EXEC CICS DELAY INTERVAL(005);                                     00003350
                                                                        00003360
                                                                        00003370
     TRANSKODE = 'R041';                                                00003380
                                                                        00003390
     CALL UTGANG;                                                       00003400
 %PAGE;                                                                 00003410
      %INCLUDE R0011402;               /* BLANK  ARBEIDSOMRÅDE */       00003420
 %PAGE;                                                                 00003430
      %INCLUDE R0011403;               /* KONTROLL AV SØKERDELEN */     00003440
 %PAGE;                                                                 00003450
      %INCLUDE R0011405;               /* KONTROLL AV KAP 7,8,10 */     00003460
 %PAGE;                                                                 00003470
      %INCLUDE R0011406;               /* ARBEIDSOMRÅDE -> MAP */       00003480
 %PAGE;                                                                 00003490
      %INCLUDE R0011409;               /* MAP -> ARBEIDSOMRÅDE */       00003500
 %PAGE;                                                                 00003510
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */  00003520
 %PAGE;                                                                 00003530
      %INCLUDE R0019902;               /*  FINNE KJØNN              */  00003540
 %PAGE;                                                                 00003550
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */      00003560
 %PAGE;                                                                 00003570
      %INCLUDE R0019905;               /* BEREGNER ALDER */             00003580
 %PAGE;                                                                 00003590
      %INCLUDE R0019907;               /* TABELLSØKING */               00003600
 %PAGE;                                                                 00003610
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1 */        00003620
 %PAGE;                                                                 00003630
      %INCLUDE R0019910;               /* NUMERISK KONTROLL */          00003640
 %PAGE;                                                                 00003650
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */00003660
 %PAGE;                                                                 00003670
      %INCLUDE R0019913;               /* F_SNU_DATO   */               00003680
 %PAGE;                                                                 00003690
      %INCLUDE R0019944;               /* SKRIV_FEIL      */            00003700
 %PAGE;                                                                 00003710
      %INCLUDE R0019964;               /* F_6MDR          */            00003720
                                                                        00003730
   END R00114;                                                          00003740
