//C0010301 JOB 1014,'SPA2970',CLASS=A,NOTIFY=SPA2970,MSGCLASS=W         00010000
//*                                                                     00020000
//*   JCL FOR KOPILERE A0010301   SOM GIR IKKE TILGANG TIL REGSI.       00030001
//*                                                                     00040000
//*                                                                     00050000
//STP1    EXEC DFHYITPB,PARM.TRN='NOSOURCE'                             00060000
//TRN.SYSIN DD DSN=L001.PROD.PGMSRC(A0010301),DISP=SHR                  00070000
//PLI.SYSLIB  DD                                                        00080000
//            DD                                                        00090000
//            DD DSN=L001.PROD.PGMCOPY,DISP=SHR                         00100000
//            DD DSN=L001.PROD.PGMINCP,DISP=SHR                         00110000
//            DD DSN=CICSTS.V1R3M0.CICS.SDFHPL1,DISP=SHR                00120000
//            DD DSN=CICSTS.V1R3M0.CICS.SDFHMAC,DISP=SHR                00130000
//LKED.SYSLMOD  DD DSN=L001.PROD.PGMLOAD,DISP=SHR                       00140002
//LKED.SYSIN DD *                                                       00150000
    NAME R0010301(R)                                                    00160000
//                                                                      00170000
