 /*   SIST ENDRET PÅ PROD   2004.12.17 14.33.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.58.48 AV   JDA2970          */        
 /* ================================================================= */        
 /* R001U625 FKS_UNNTAK_VENTETID(UNNTAK_VENTETID,REAKTIVISERING)      */        
 /* ----------------------------------------------------------------- */        
 /* INKLUDERES I : R001U620 (22)                                      */        
 /* S_KODE ER KODE FOR UNNTAK_VENTETID (S,X,BLANK)                    */        
 /* T_KODE ER KODE FOR REAKTIVISERING (S,X,BLANK)                     */        
 /* ================================================================= */        
 FKS_UNNTAK_VENTETID : PROC (S_KODE,T_KODE) RETURNS (FIXED DEC (5));            
    /* -------------------------------------------------------------- */        
    DCL S_KODE           CHAR(1),                                               
        T_KODE           CHAR(1);                                               
    DCL FEILMELDING      FIXED DEC (5) INIT (0);                                
    /* -------------------------------------------------------------- */        
    SELECT (S_KODE);                                                            
       WHEN ('S') /* START SKJERM ATTFØRING */                                  
          IF B01.REAKTIVISERING(BER_SØ_IND) = 'J' &                             
             T_KODE ^= 'X' THEN                                                 
             /* KAN IKKJE STARTE VARIG UTEN STANS TIDSBEGR */                   
             FEILMELDING = 438;                                                 
       WHEN ('X') /* SLUTT SKJERM ATTFØRING */                                  
          IF B01.UFØRPENS.UNNTAK_VENTETID(BER_SØ_IND) ^= 'J' THEN               
             DO;                                                                
                /* ----------------------------------------------- */           
                /* VI AVVISER ALLE SOM SLUTTER FØR DE HAR STARTET  */           
                /* ----------------------------------------------- */           
                FEILMELDING = 431;                                              
             END;                                                               
         OTHER;     /* STANSES I INPUTKONTROLL  */                              
    END; /* SELECT S_KODE */                                                    
    /* -------------------------------------------------------------- */        
    /* OPPDATERER B02. DERSOM ALT ER OK                               */        
    /* -------------------------------------------------------------- */        
    IF FEILMELDING = 0 THEN                                                     
       IF S_KODE = 'S' THEN                                                     
          B02.UFØRPENS.UNNTAK_VENTETID(BER_SØ_IND) = 'J';                       
       ELSE                                                                     
          IF S_KODE = 'X' THEN                                                  
             B02.UFØRPENS.UNNTAK_VENTETID(BER_SØ_IND) = ' ';                    
    /* -------------------------------------------------------------- */        
    /* RETURNERER FEILKODE, 0 VISER AT ALT ER OK SÅ LANGT             */        
    /* -------------------------------------------------------------- */        
    RETURN (FEILMELDING);                                                       
                                                                                
 END FKS_UNNTAK_VENTETID;                                                       
