 /*   SIST ENDRET PÅ PROD   2008.05.31 11.11.06 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 11.36.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.43.30 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.58 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.10.03 12.09.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.10.03 12.03.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.07.26 12.23.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.09.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.01 10.10.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 12.54.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.58.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.14 10.55.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.37.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.06  8.53.35 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.28.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.35.53 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.05.23 13.08.54 AV   JDA7339          */        
 /*       SIST ENDRET 03/08-99 13.13.56 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.16.27 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.13.27 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.34 AV   JDA7339                  */        
 /*       SIST ENDRET 11/03-98 12.05.50 AV   JDA7339                  */        
  /* *************************************************************** */         
  /* IDENTIFIKASJON:   R0017036                                      */         
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */         
  /* HENSIKT:                                                        */         
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */         
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */         
  /*        HVER AJOURFØRT TRANSAKSJON.                              */         
  /* PROGRAMTILKNYTNING:                                             */         
  /*        PROGRAMMET INKLUDERES I  R0017001                        */         
  /* *************************************************************** */         
  LAG_ETTERL_UFØRPENS_HEND:                                                     
      PROC(IND);                                                                
                                                                                
                                                                                
    DCL   IND             FIXED BIN (15);                                       
    DCL EKIND             FIXED BIN (15);                                       
    DCL INNT_GRENSE            FIXED DEC (7) INIT (0);                          
  /* *************************************************************** */         
  /* PROGRAMMET BEGYNNER HER.VI BLANKER W_HENDELSE.                  */         
  /* ADDRESSERER EIB                                                 */         
  /* *************************************************************** */         
                                                                                
    EXEC CICS ADDRESS EIB(DFHEIPTR);                                            
                                                                                
    IF IND = 1 THEN                                                             
       EKIND = 2;                                                               
    ELSE                                                                        
       EKIND = 1;                                                               
                                                                                
    W_HENDELSE              =   '';                                             
    OMR_DATO                = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                 
                                                                                
    IF TRANS_OPPL_OMR.TRANSTYPE = 27     !                                      
       TRANS_OPPL_OMR.TRANSTYPE = 90     !    /*200506 HL */                    
       TRANS_OPPL_OMR.TRANSTYPE = 92     !    /*200302 HL */                    
       TRANS_OPPL_OMR.TRANSTYPE = 93 THEN                                       
                                                                                
       DO;                                                                      
          HENDDATO  =  OMR_DATO/100;                                            
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          IF DIV_PERIODE.INTENDR_ÅMD     > 0 THEN                               
             HENDDATO     = DIV_PERIODE.INTENDR_ÅMD/100;                        
          ELSE                                                                  
             DO;                                                                
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅMD(IND);           
                HENDDATO     =  R_HENDDATO.AAR * 100 + R_HENDDATO.MND;          
             END;                                                               
       END;                                                                     
                                                                                
    W_HENDELSE.FNR_EKTEF     = B02.PERSON.RF0PERSN.FNR(EKIND);                  
    W_HENDELSE.NAVN_EKTEF    = B02.PERSON.RF0PERSN.NAVN(EKIND);                 
    W_HENDELSE.VERSJON       =   W_ROT.NESTE_SB_VERSJON_NR;                     
    W_HENDELSE.TERMINAL      =   DIV_PARAM_OMR.BRUKER_ID;                       
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(IND);                   
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(IND);                   
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(IND);                   
    W_HENDELSE.SIVILSTAND_EK = B02.SIVILSTAND(EKIND);                           
    W_HENDELSE.PENSJONSTYPE1_EK = B02.PENSJONSTYPE1(EKIND);                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* OPPDATERER INNTEKTSKODER OG LOVLIG INNTEKT FOR UFØREPENSJON    */        
    /* -------------------------------------------------------------- */        
    W_HENDELSE.INNTEKTSKODE1 =                                                  
       B02.UFØRPENS.INNTEKTSKODE1(IND);                                         
    W_HENDELSE.INNTEKTSKODE2 =                                                  
       B02.UFØRPENS.INNTEKTSKODE2(IND);                                         
    W_HENDELSE.FRIINNTEKT_DATO_ÅMD =                                            
       B02.STATUS.FRIINNTEKT_DATO_ÅMD(IND);                                     
    W_HENDELSE.INNTEKTSGRENSE =                                                 
       B02.UFØRPENS.LOVLIG_INNTEKT(IND);                                        
                                                                                
  /* *************************************************************** */         
  /* DERSOM ETTERLATTE PENSJONEN ER STØRSTE                          */         
  /* *************************************************************** */         
                                                                                
    IF B02.PERSON.ETTEPENS.GP_BRUTTO(IND) > 0   THEN                            
                                                                                
       DO;  /* ETTERLATTEPENSJONEN ER STØRRE ENN UFØREPENSJONEN */              
                             /*NY 200410 HL :  */                               
      /*  W_HENDELSE.BRUK_AVDØDES_TT = DIV_PERIODE.BRUK_AVDØDES_TT; */          
          W_HENDELSE.GP_BRUTTO = B02.ETTEPENS.GP_BRUTTO(IND);                   
          W_HENDELSE.GP_NETTO  = B02.ETTEPENS.GP_NETTO(IND);                    
          W_HENDELSE.TP_BRUTTO = B02.ETTEPENS.TP_BRUTTO(IND) +                  
                                        B02.UFØRPENS.TP(IND);                   
          W_HENDELSE.TP_NETTO  = B02.ETTEPENS.TP_NETTO(IND) +                   
                                        B02.UFØRPENS.TP(IND);                   
          W_HENDELSE.ST        = B02.ETTEPENS.ST(IND);                          
          W_HENDELSE.FULLT_SÆRTILLEGG =                                         
                   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(IND);                         
          IF B02.STATUS.SIVILSTAND(IND) ^= 'S' THEN                             
             W_HENDELSE.TP_PROSENT     = 55;                                    
          ELSE                                                                  
             W_HENDELSE.TP_PROSENT     = B02.ETTEPENS.TP_PROSENT(IND);          
       END; /* ETTERLATTEPENSJONEN ER STØRRE ENN UFØREPENSJONEN */              
    ELSE                                                                        
       DO;  /* EGEN UFØREPENSJON LØNNER SEG */                                  
          W_HENDELSE.GP_BRUTTO  =  B02.UFØRPENS.GP(IND);                        
          W_HENDELSE.GP_NETTO   =  B02.UFØRPENS.GP(IND);                        
          W_HENDELSE.TP_BRUTTO  =  B02.UFØRPENS.TP(IND);                        
          W_HENDELSE.TP_NETTO   =  B02.UFØRPENS.TP(IND);                        
          W_HENDELSE.ST         =  B02.UFØRPENS.ST(IND);                        
       END; /* EGEN UFØREPENSJON LØNNER SEG */                                  
                                                                                
      IF IND < 3        THEN                                                    
         W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                          
                                GARANTITILLEGG_TP(IND);                         
    IF B02.PENSJONSTYPE1(EKIND)  =  'F' THEN                                    
         DO I = 1 TO 13;                                                        
            IF B02.FNR_TILKN(IND,I) =   B02.FNR(EKIND) THEN                     
                DO;                                                             
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(IND,I);               
                   I = 13;                                                      
                END;                                                            
         END;                                                                   
                                                                                
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(IND);            
    W_HENDELSE.GARANTITILLEGG_BARN =                                            
                            B02.FORSI.GARANTITILLEGG_BARN(IND);                 
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                         
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(IND);                  
                                                                                
    W_HENDELSE.KT            =  B02.UFØRPENS.KT(IND);                           
    W_HENDELSE.BT            =  B02.UFØRPENS.BT(IND);                           
                                                                                
    W_HENDELSE.BT_SÆRBARN    =  B02.FORSI.BT_SÆRBARN(IND);                      
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(IND);              
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(IND);                
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(IND);              
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(IND);            
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(IND);           
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(IND);            
    W_HENDELSE.FRIBELØP_FELLESBARN =                                            
                                DIV_PARAM_OMR.FRIBELØP_FELLESBARN(IND);         
    W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(IND);          
    W_HENDELSE.FOLKETRYGD        = DIV_PARAM_OMR.FOLKETRYGD(IND);               
    W_HENDELSE.FOLKETRYGD_EK  = DIV_PARAM_OMR.FOLKETRYGD(EKIND);                
                                                                                
    W_HENDELSE.FRYSDATO_ÅMD      = B02.FRYSDATO_ÅMD        (IND);               
    W_HENDELSE.INNT_DATO_ÅMD     = B02.INNT_DATO_ÅMD       (IND);               
    /*REMEDY 176 - 200309 HL : */                                               
    IF (B02.INNTEKT_FØR_UP(IND) > 0) THEN                                       
       DO;                                                                      
          CALL BEREGN_INNTEKT_FØR_UP;                                           
          W_HENDELSE.INNTEKT_FØR_UP = B02.INNTEKT_FØR_UP(IND);                  
       END;                                                                     
    W_HENDELSE.FRYSKODE          = B02.FRYSKODE            (IND);               
    W_HENDELSE.GARANTIGRAD       = B02.GARANTIGRAD         (IND);               
    IF B02.REAKTIVISERING(IND) = 'J' THEN                                       
       W_HENDELSE.ATTF_KODE ='1' ;                                              
    ELSE                                                                        
    IF B02.UNNTAK_VENTETID(IND) ='J'  THEN  /*200304 HL*/                       
       W_HENDELSE.ATTF_KODE ='2' ;                                              
                                                                                
    IF B02.FRYSDATO_ÅMD(IND)  = 0                 &                             
       B01.FRYSDATO_ÅMD(IND) ^= 0                   THEN                        
           W_HENDELSE.FRYSKODE = '0'; /*FRYS ER OPPHØRT- 200310 HL*/            
    ELSE                                                                        
    IF B01.UFØRPENS.UFG(IND) >                                                  
       B02.UFØRPENS.UFG(IND)  &                                                 
      (B02.FRYSKODE (IND) ^='1' &                                               
       B02.FRYSKODE (IND) ^='2') THEN                                           
       W_HENDELSE.FRYSKODE ='3' ;                                               
      /* TEST FRYSKODE JD 7.97                 */                               
    W_HENDELSE.YRKE_BT       =  B02.YRKEPENS.BT(IND);                           
    W_HENDELSE.YRKE_TP       =  B02.YRKEPENS.TP(IND);                           
    W_HENDELSE.YRKE_GP       =  B02.YRKEPENS.GP(IND);                           
                                                                                
    IF DIV_PARAM_OMR.FRADRAG_2G = 'J'           THEN                            
       W_HENDELSE.BEREGN_ALT_AEY    = 'F';                                      
    W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(IND);                 
                                                                                
    W_HENDELSE.ANTALL_BARN   =  B02.STATUS.ANTALL_BARN(IND);                    
    W_HENDELSE.ANTALL_BARN_TIDL                                                 
                             =  B01.STATUS.ANTALL_BARN(IND);                    
    W_HENDELSE.ÅFT           =  B02.UFØRPENS.ÅFT(IND);                          
    W_HENDELSE.DØD_AV_YSKADE =  B02.DØD_AV_YRKESSKADE(IND);                     
    W_HENDELSE.TP_GAR_KODE   =  B02.TP_GAR_KODE(IND);                           
    W_HENDELSE.TP_GAR_KODE_EK = B02.TP_GAR_KODE(EKIND);                         
    W_HENDELSE.REDUSERT_GP_2G = DIV_PARAM_OMR.REDUSERT_GP_2G(IND);              
                                                                                
  /* *************************************************************** */         
  /* FØLGENDE  3 FELT SKAL EVT. REDIGERES INN I TEKSTTYPE B1.        */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.UF_GRAD      =  B02.UFØRPENS.UFG(IND);                           
    W_HENDELSE.YRKE_UFG     =  B02.YRKEPENS.YUG(IND);                           
    W_HENDELSE.YRKE_KODE        = B02.YRKEPENS.YPT_KODE(IND);                   
                                                                                
    IF B02.YRKEPENS.YPT  (IND) < B02.YRKE_POENG_1291(IND)  THEN                 
       W_HENDELSE.YRKE_YPT     = B02.YRKE_POENG_1291(IND);                      
    ELSE                                                                        
       W_HENDELSE.YRKE_YPT     = B02.YRKEPENS.YPT  (IND);                       
                                                                                
    W_HENDELSE.YRKE_SPT         = B02.YRKEPENS.SPT  (IND);                      
    IF B02.YRKEPENS.YPT(EKIND) > 0  THEN                                        
       DO;                                                                      
                                                                                
    IF B02.YRKEPENS.YPT (EKIND) < B02.YRKE_POENG_1291(EKIND)  THEN              
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKE_POENG_1291(EKIND);                    
    ELSE                                                                        
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT  (EKIND);                     
                                                                                
         W_HENDELSE.YRKE_KODE_AVD = B02.YRKEPENS.YPT_KODE(EKIND);               
         W_HENDELSE.YRKE_SPT_AVD  = B02.YRKEPENS.SPT(EKIND);                    
         W_HENDELSE.YRKE_UFG_AVD = B02.YRKEPENS.YUG(EKIND);                     
       END;                                                                     
                                                                                
  /* *************************************************************** */         
  /* FØLGENDE FELT HENTES FRA YRKESSKADEHISTORIKKK                   */         
  /* *************************************************************** */         
                                                                                
  DCL K                 FIXED BIN(15) INIT (0);                                 
  DCL M                 FIXED BIN(15) INIT (0);                                 
  DCL Y                 FIXED BIN(15) INIT (0);                                 
                                                                                
  DO M = 10 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅMD                            
                                       (EKIND,M) > 0);                          
  END;                                                                          
 IF M > 0 THEN                                                                  
 DO;                                                                            
  W_HENDELSE.YRKE_YUFT_ÅMD_AVD = B02.YRKEHIST.YUFT_ÅMD(EKIND,M);                
  W_HENDELSE.YRKE_YST_ÅMD_AVD = B02.YRKEHIST.YST_ÅMD (EKIND,M);                 
  IF B02.YRKEHIST.AÅI (EKIND,M) = 9999999 THEN                                  
     W_HENDELSE.YRKE_AÅI_AVD         = 0;                                       
  ELSE                                                                          
     W_HENDELSE.YRKE_AÅI_AVD  = B02.YRKEHIST.AÅI (EKIND,M);                     
  W_HENDELSE.YRKE_YRKE11_AVD  = B02.YRKEHIST.YRKE11 (EKIND,M);                  
  W_HENDELSE.YRKE_PAÅ_AVD     = B02.YRKEHIST.PAÅ   (EKIND,M);                   
 END;                                                                           
                                                                                
  DO Y = 10 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅMD                            
                                       (IND,Y) > 0);                            
  END;                                                                          
 IF Y > 0 THEN                                                                  
 DO;                                                                            
    IF   DIV_PARAM_OMR.ENGANGSBELØP_11_7(IND) > 0 THEN                          
     DO;                                                                        
        W_HENDELSE.YRKE_UFG     = B02.YRKEHIST.YUG(IND,Y);                      
     END;                                                                       
                                                                                
  W_HENDELSE.YRKE_YUFT_ÅMD = B02.YRKEHIST.YUFT_ÅMD(IND,Y);                      
  W_HENDELSE.YRKE_YST_ÅMD = B02.YRKEHIST.YST_ÅMD (IND,Y);                       
  IF B02.YRKEHIST.AÅI (IND,Y) = 9999999 THEN                                    
     W_HENDELSE.YRKE_AÅI         = 0;                                           
  ELSE                                                                          
     W_HENDELSE.YRKE_AÅI         = B02.YRKEHIST.AÅI   (IND,Y);                  
  W_HENDELSE.YRKE_YRKE11  = B02.YRKEHIST.YRKE11 (IND,Y);                        
  W_HENDELSE.YRKE_PAÅ     = B02.YRKEHIST.PAÅ   (IND,Y);                         
 END;                                                                           
    W_HENDELSE.TT           =  B02.STATUS.TT_ANV(IND);                          
    W_HENDELSE.TT_EK        =  B02.STATUS.TT_ANV(EKIND);                        
    W_HENDELSE.PÅ            = B02.UFØRPENS.PÅ   (IND);                         
    W_HENDELSE.OPT           = B02.UFØRPENS.OPT  (IND);                         
    W_HENDELSE.SPT           = B02.UFØRPENS.SPT  (IND);                         
    W_HENDELSE.BOSATT        = B02.BOSATT        (IND);                         
    W_HENDELSE.BUP_GARANTI   = B02.BUP_GARANTI(IND,1);                          
                                                                                
    W_HENDELSE.PÅ_EK         = B02.ETTEPENS.PÅ_AVD  (IND);                      
    W_HENDELSE.OPT_EK        = B02.ETTEPENS.OPT_AVD (IND);                      
    W_HENDELSE.SPT_EK        = B02.ETTEPENS.SPT_AVD (IND);                      
                                                                                
  /* *************************************************************** */         
  /* NY LOV 0192     JD 11.91                                        */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(IND);                         
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(IND);             
    W_HENDELSE.GARANTI_DATO_ÅMD = B02.STATUS.GARANTI_DATO_ÅMD(IND);             
    W_HENDELSE.SPT_1291         = B02.UFØRPENS.SPT_1291      (IND);             
    W_HENDELSE.OPT_1291         = B02.UFØRPENS.OPT_1291      (IND);             
    W_HENDELSE.PÅ_1291         = B02.UFØRPENS.PÅ_1291      (IND);               
    W_HENDELSE.PÅ_ETTER91      = B02.UFØRPENS.PÅ_ETTER91   (IND);               
    W_HENDELSE.SPT_1291_EK      = B02.ETTEPENS.SPT_1291     (IND);              
    W_HENDELSE.OPT_1291_EK      = B02.ETTEPENS.OPT_1291      (IND);             
    W_HENDELSE.PÅ_1291_EK      = B02.ETTEPENS.PÅ_1291      (IND);               
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ETTEPENS.PÅ_ETTER91   (IND);               
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (IND);                
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(IND);             
    W_HENDELSE.YRKE_PÅ_ETTER91_AVD =                                            
                               B02.YRKEPENS.PÅ_ETTER91(EKIND);                  
    W_HENDELSE.YRKE_POENG_1291_AVD =                                            
                               B02.YRKEPENS.YRKE_POENG_1291(EKIND);             
       DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                                    
                                                                                
          DO K = 1 TO 13 WHILE (B02.FNR_TILKN(IND,K) > 0);                      
                                                                                
             IF B02.FNR(J) = B02.FNR_TILKN(IND,K) THEN                          
                                                                                
                DO;                                                             
                   W_HENDELSE.BARN.FNR_B(J-2)           = B02.FNR(J);           
                   W_HENDELSE.BARN.PENSJONSTYPE2_B(J-2) =                       
                                                  B02.PENSJONSTYPE2(J);         
                   W_HENDELSE.BARN.BT_FØR_0591(J-2)  =                          
                                          B02.FT_FØR_91(IND,K);                 
                   K = 13;                                                      
                END;                                                            
          END;                                                                  
       END;                                                                     
                                                                                
  /* *************************************************************** */         
  /* FØLGENDE FELT HENTES FRA P0014009                               */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(EKIND);                       
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(IND);                         
                                                                                
    CALL PLASSER_TEKST(IND,EKIND);                                              
                                                                                
    CALL INSERT_HENDELSE;                                                       
    W_HENDELSE.ALTERNATIV_GP_BRUTTO = B02.ALTERNATIV_GP_BRUTTO(EKIND);          
    W_HENDELSE.ALTERNATIV_TP_BRUTTO = B02.ALTERNATIV_TP_BRUTTO(EKIND);          
                                                                                
    IF W_HENDELSE.SPT > 0 ! W_HENDELSE.OPT > 0 THEN                             
       DO;                                                                      
          CALL BYGG_OPP_BERGRUNL_SEGMENT(IND);                                  
       END;                                                                     
                                                                                
  /* *************************************************************** */         
  /*   DERSOM AVDØDE ER EKTEFELLE                                    */         
  /* *************************************************************** */         
                                                                                
    IF (B02.PENSJONSTYPE1(IND) = 'E' &                                          
        B02.PENSJONSTYPE1(EKIND) = 'D' ) !                                      
       (W_HENDELSE.SPT_EK       >  0 !                                          
        W_HENDELSE.OPT_EK       >  0 ) THEN                                     
        DO;                                                                     
           CALL BYGG_OPP_BERGRUNL_SEGMENT_DØD(EKIND);                           
        END;                                                                    
                                                                                
 BEREGN_INNTEKT_FØR_UP: PROC;                                                   
     DCL        W_UFT_ÅMD                PIC '99999999',                        
                GAMMEL_GRAD              FIXED DEC     (3) INIT(0),             
                GV                       FIXED DEC     (7) INIT(0),             
                G_UFT                    FIXED DEC     (7) INIT(0),             
                INNTEKT                  FIXED DEC     (7) INIT(0),             
                POENG                    FIXED DEC   (5,2) INIT(0),             
                ÅRET                     FIXED DEC     (3);                     
     DCL        VIRK_ÅR_MND                  FIXED DEC (7);                     
     DCL        G_VIRK   FIXED DEC (9) INIT (0);                                
     DCL        W_INNTUP      FIXED DEC (9) INIT (0);                           
     DCL        W_FAK         FIXED DEC (9,6) INIT (0);                         
     /*PROGRAMMET BEGYNNER HER:*/                                               
     G_VIRK    = G;                                                             
     /* ************************************************************* */        
     /* FOR Å REGNE INNTEKT_FØR_UP ÅMD VI:                            */        
     /*          FINNE GRUNNBELØPET PÅ UFØRETIDSPUNKTET               */        
     /*          FINNE GRUNNBELØPET PÅ VIRKNINGSTIDSPUNKTET           */        
     /* INNTEKT_FØR_UP = INNTEKT_FØR_UP * G_NÅ / G_UFT                */        
     /*                                                               */        
     /* DET GRUNNBELØP VI HAR FUNNET TIDLIGERE (I 4001) GJELDER PÅ    */        
     /* VIRKNINGSTIDSPUNKTET.                                     */            
     /* ************************************************************* */        
                                                                                
     W_UFT_ÅMD  = B02.INNT_DATO_ÅMD(IND) +1;                                    
                                                                                
    /* ------------------------------------------------------------ */          
    /* IFLG. BREV FRA UFØRHETSKONTORET 08.09.97:                    */          
    /*   "DERSOM UFØRETIDSPUNKTET ER FØR 1967, SKAL DET FØRST FAST- */          
    /*    SATTE GRUNNBELØPET BENYTTES I OPPJUSTERINGEN, D.V.S.      */          
    /*    KR 5.400, SOM BLE FASTSATT FRA 0167."                     */          
    /* ------------------------------------------------------------ */          
  /*IF B02.INNT_DATO_ÅMD(IND) = 6612      THEN /*TS 210495 */                   
    IF B02.INNT_DATO_ÅMD(IND) < 19670000 THEN     /*100997 * MH */              
       G_UFT                     = 5400;                                        
    ELSE                                                                        
      DO;                                                                       
         DO J = 1 TO 65;                                                        
           IF W_UFT_ÅMD  >= PERIODE_START_ÅMD(J) &                              
              W_UFT_ÅMD  <= PERIODE_SLUTT_ÅMD(J) THEN                           
              DO;                                                               
                 G_UFT         = G_TAB_PERIODE.GRUNNBELØP(J);                   
                 J             = 99;                                            
              END;                                                              
         END;                                                                   
      END;                                                                      
    IF G_UFT > 0 THEN                                                           
       DO;                                                                      
          W_FAK       = ROUND(G / G_UFT,6);                                     
          W_INNTUP    = B02.INNTEKT_FØR_UP(IND) * 100;                          
          W_INNTUP    = W_INNTUP * W_FAK;                                       
          INNT_GRENSE = W_INNTUP / 10;                                          
       END;                                                                     
 END BEREGN_INNTEKT_FØR_UP ;                                                    
  /* *************************************************************** */         
 END  LAG_ETTERL_UFØRPENS_HEND;                                                 
