 /*   SIST ENDRET PÅ PROD   2008.11.05 16.23.23 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.08.16  8.11.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.08.14 13.57.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.41.37 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.33 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.01.05  8.52.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.37.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.29  9.55.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.11.21 13.04.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.01 11.50.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.10.19  8.15.37 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.09.28  8.07.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.43.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.53.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.17 12.04.32 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.08 13.57.07 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.02.09 15.08.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.02.09 15.08.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.02.08 13.45.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.02.08 13.44.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.33.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.09  8.23.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.25 11.41.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.25 11.37.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.24 11.55.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.24 11.53.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.09 12.23.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.09 12.19.53 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.27 14.16.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.27 14.15.44 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.07 12.43.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.18 11.08.43 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 12.54.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.48.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.11 11.43.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.02.05  9.56.07 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.05  9.49.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.07.11  9.26.09 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.05.06  9.02.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.05.06  8.46.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.06  8.44.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.04.30 12.19.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.04.30 12.06.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.25 12.11.49 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.24  9.58.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.15.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.10.18 12.12.27 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.05.31 12.29.08 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.17 12.07.21 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.03.22 12.15.42 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.06 10.17.26 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.04 15.15.41 AV   JDA7339          */        
 /*       SIST ENDRET 25/01-99 14.42.57 AV   JDA7339                  */        
 /*       SIST ENDRET 25/01-99 14.42.09 AV   JDA7339                  */        
 /*       SIST ENDRET 08/01-99 13.01.37 AV   JDA7339                  */        
 /*       SIST ENDRET 08/01-99 13.00.22 AV   JDA7339                  */        
 /*       SIST ENDRET 25/11-98 10.29.38 AV   JDA7339                  */        
 /*       SIST ENDRET 25/11-98 10.27.38 AV   JDA7339                  */        
 /*       SIST ENDRET 20/08-98 11.13.47 AV   TSB7339                  */        
 /*       SIST ENDRET 16/06-98 13.23.34 AV   TSB7339                  */        
 /*       SIST ENDRET 10/06-98 09.48.24 AV   TSB7339                  */        
 /*       SIST ENDRET 09/06-98 08.31.53 AV   SPA7339                  */        
 /*       SIST ENDRET 03/06-98 09.39.30 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R001U622 - PROSEDYRE I PLI                                     */        
 /*    PROGRAMMERER:    HERMAN - JULI 1993                            */        
 /* *****************************************                         */        
 /*HENSIKT:                                                           */        
 /*    PROSEDYREN AJOURFØRER SØKERS PENSJONSSTATUS MED INFO FRA TRANS */        
 /*    UFØREPENSJON.                                                  */        
 /* ****************************************************************  */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYREN INCLUDES I R001U620.                                */        
 /*BRUK:                                                              */        
 /*    CALL AJOURFØR_B02_MED_U3TRANS                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 AJOURFØR_B02_MED_U3TRANS:PROC OPTIONS(REENTRANT);                              
   DCL                                                                          
  /*  UF_IND           FIXED BIN(15),      */                                   
      YUF_IND          FIXED BIN(15),                                           
      I                FIXED BIN(15),                                           
      J                FIXED BIN(15),                                           
      K                FIXED BIN(15),                                           
      M                FIXED BIN(15),                                           
      HJELP            FIXED DEC (3),                                           
      ÅR_FØR_UFØRHET   PIC '9999';                                              
   DCL SISTE_IND                      FIXED BIN(15);                            
   DCL W_ÅR_MÅNED                     PIC '(6)9';                               
   DCL W_ÅR DEF W_ÅR_MÅNED POS(1)     PIC '9999';                               
   DCL W_MÅNED DEF W_ÅR_MÅNED POS(5)  PIC   '99';                               
   DCL MND_TIL                     FIXED DEC (5);                               
   DCL MND_FRA                     FIXED DEC (5);                               
   DCL TT_NY                       FIXED DEC (5);                               
                                                                                
    /* ============================================================= */         
    /* KONTROLL FELT 3.7 TRYGDETID FRA 1.1.1937                      */         
    /* NY KONTROLL - OPPDRAG 02040 - 200308 HL                       */         
    /* ============================================================= */         
    /* NÅR TT_16_66 > 0, SÅ ER VIRK 1991 ELLER SENERE                */         
    /* ============================================================= */         
    /* ØKNING I TRYGDETID ER MAX = DIFF MELLOM GAMMELT OG NYTT UFT   */         
    /* ==============================================================*/         
    IF (B01.TT_16_66(SØKER_IND) > 0)       &                                    
       (U3S.NORSK_BOSATT    = 'N'  )       &                                    
       (U3SP.TT_FRA1937_ÅR      > 0)           THEN                             
       DO;                                                                      
          SISTE_IND = 0;                                                        
          DO I = HBOUND(B02.UFØRHIST,2) TO                                      
                 1 BY -1 WHILE(SISTE_IND = 0);                                  
             IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) > 0   THEN                    
                SISTE_IND = I;                                                  
          END;                                                                  
          IF SISTE_IND > 0                         THEN                         
          DO;                                                                   
             W_ÅR_MÅNED =                                                       
               (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,SISTE_IND)) / 100;               
             MND_FRA = W_ÅR * 12  +  W_MÅNED;                                   
             W_ÅR_MÅNED =  U3S.UFT_ÅMD / 100;                                   
             MND_TIL = W_ÅR * 12  +  W_MÅNED;                                   
             TT_NY   = U3SP.TT_FRA1937_ÅR * 12 +                                
                       U3SP.TT_FRA1937_MND;                                     
             IF TT_NY > 480                          THEN                       
                TT_NY = 480;                                                    
             IF TT_NY > B01.TT_16_66(SØKER_IND)                                 
                           + MND_TIL - MND_FRA     THEN                         
                DO;                                                             
    L319:                                                                       
                   FEIL_VED_LABEL           = '319';                            
                   FEIL_MELD_NR             =  1832;                            
                END;                                                            
          END;                                                                  
       END;                                                                     
                                                                                
    IF (HJ_VIRK_DATO_ÅMD < 19980200  !                                          
        B01.PENSJON_FØR_9802(SØKER_IND) = 'J'  ! /* 181105JFA R 1303*/          
        B01.PENSJON_FØR_9802(SØKER_IND) = 'X') THEN /*JFA R 745*/               
       B02.PENSJON_FØR_9802(SØKER_IND) = 'J';     /* 7.3.05 */                  
                                                                                
 L102:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.02 TKNR, IKKE KONTROLL MOT STATUS                            */        
    /* -------------------------------------------------------------- */        
    B02.TKNR(SØKER_IND)            = U3S.TKNR;                                  
                                                                                
 L103:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.03 NAVN, IKKE KONTROLL MOT STATUS                            */        
    /* -------------------------------------------------------------- */        
    B02.NAVN(SØKER_IND) = U3S.NAVN;                                             
                                                                                
 L104:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.04 SPRÅK, IKKE KONTROLL MOT STATUS                           */        
    /* -------------------------------------------------------------- */        
    B02.SPRÅK(SØKER_IND)           = U3S.SPRÅK;                                 
                                                                                
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.XX UNNTAK VENTETID - KONTROLL MOT STATUS                     */        
    /* -------------------------------------------------------------- */        
    IF (U3S.UNNTAK_VENTETID = 'S') THEN                                         
       B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND)= 'J';                            
    ELSE                                                                        
       B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND)= ' ';                            
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.XX YRKESKODE, IKKE KONTROLL MOT STATUS                       */        
    /* -------------------------------------------------------------- */        
    IF (U3S.YRKE > 0) THEN                                                      
       B02.YRKES_KODE(SØKER_IND)   = U3S.YRKE;                                  
                                                                                
    DO I = 1 TO HBOUND(B02.PERSON,1);                                           
       IF B02.FNR(I) > 0 THEN                                                   
          B02.FØRSTE_GANG_REG(I) = 'N';                                         
    END;                                                                        
    /* 9705HL-------------------------------------------------------- */        
    IF   (B01.PENSJONSTYPE1(SØKER_IND) ^= 'U')  &                               
         (B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y')  &                               
         (U3S.YSKADE_TILLEGG ^= 'J'          )  &                               
         (U3S.UFG < 50                       )          THEN                    
        DO;                                                                     
    L320:                                                                       
           FEIL_VED_LABEL           = '320';                                    
           FEIL_MELD_NR             = '38';                                     
        END;                                                                    
    /* HIT 9705HL---------------------------------------------------- */        
    /* REG AV TRINNLØS UFG SOM ER HØYERE ENN GARANTIGRADEN - AVVISES- */        
  IF  ^(U3S.UFG = 20 ! U3S.UFG = 25 ! U3S.UFG = 30 !                            
          U3S.UFG = 35 ! U3S.UFG = 40 ! U3S.UFG = 45 !                          
          U3S.UFG = 50 ! U3S.UFG = 55 ! U3S.UFG = 60 !                          
          U3S.UFG = 65 ! U3S.UFG = 70 ! U3S.UFG = 75 !                          
          U3S.UFG = 80 ! U3S.UFG = 85 ! U3S.UFG = 90 !                          
          U3S.UFG = 95 ! U3S.UFG = 100) &                                       
         (U3S.UFG > B02.UFØRPENS.GARANTIGRAD(SØKER_IND)) &                      
         (U3S.REAKTIVISERING ^= 'S'                   ) &                       
        ((B01.PENSJONSTYPE1(SØKER_IND) = 'U')  !                                
         (B01.PENSJONSTYPE1(SØKER_IND) = 'Y')) THEN                             
        DO;                                                                     
    L325:                                                                       
           FEIL_VED_LABEL           = '325';                                    
           FEIL_MELD_NR             = '38';                                     
        END;                                                                    
    /* HIT 200201 JD------------------------------------------------- */        
                                                                                
 /* ***************************************************************** */        
 /* YTELSE_SEGMENTET                                                  */        
 /* ***************************************************************** */        
                                                                                
    IF B01.PENSJONSTYPE1(SØKER_IND) = 'N' !                                     
                           B01.PENSJONSTYPE1(SØKER_IND) = 'B' THEN              
       B02.PENSJONSTYPE3(SØKER_IND) = 'U';                                      
    /*    PT1 ER UENDRET                                              */        
    ELSE                                                                        
       B02.PENSJONSTYPE1(SØKER_IND) = 'U';                                      
                                                                                
  L330:                                                                         
    IF U3Y.KAP_11_7_UTLØST          = 'J'   &   /*TRUDE, 31.5.89*/              
       B01.PENSJONSTYPE1(SØKER_IND) = 'F'   THEN                                
          DO;                                                                   
             FEIL_VED_LABEL           = '330';                                  
             FEIL_MELD_NR             = '1732';                                 
          END;                                                                  
                                                                                
  L340:                                                                         
  /* REDUKSJON AV UFG SKAL SKJE MED ENDRINGSBLANKETT*/                          
    IF B01.UFØRPENS.UFG(SØKER_IND) > U3S.UFG          THEN                      
       DO;                                                                      
          FEIL_VED_LABEL           = '340';                                     
          FEIL_MELD_NR             = '1741';                                    
       END;                                                                     
                                                                                
  /*TILLEGG 120796 HL : */                                                      
    IF (U3S.UFT_ÅMD) < 19910000      THEN                                       
       B02.PENSJONSRETT_FØR_91(SØKER_IND) = 'J';                                
                                                                                
    IF U3S.YSKADE_TILLEGG           = 'J'  !                                    
       B01.PENSJONSTYPE1(SØKER_IND) = 'Y'     THEN                              
          B02.PENSJONSTYPE1(SØKER_IND) = 'Y';                                   
                                                                                
    IF U3S.ATT_UF = 'A' THEN                                                    
       IF (B01.PENSJONSTYPE1(SØKER_IND)     = 'U' !                             
           B01.PENSJONSTYPE1(SØKER_IND)     = 'Y' ) &                           
           B01.PENSJONSTYPE3(SØKER_IND)    ^= 'A' &                             
                                                                                
          B01.STATUS_KODE_HIST(SØKER_IND)  = ' ' THEN                           
          DO;                                                                   
                                                                                
             IF  (STATUS_TYPE = 'B' !                                           
                 STATUS_TYPE = 'I')  &                                          
                 TRANS_LISTE_INDEX = 1  THEN                                    
 /* ***************************************************************** */        
 /* FEIL,SØKEREN HAR UFØRPENSJON FRA FØR.                             */        
 /* ***************************************************************** */        
                 DO;                                                            
  L350:                                                                         
                    FEIL_VED_LABEL = '350';                                     
                    FEIL_MELD_NR   = 1717;                                      
                    GO TO RETUR;                                                
                 END;                                                           
 /* ***************************************************************** */        
 /* SØKEREN HAR ATTFØRING FRA FØR.TRANHIST BLIR DA FJERNET.           */        
 /* ***************************************************************** */        
             ELSE                                                               
                 DO;                                                            
                                                                                
                                                                                
                    SEARCH_FNR                  =                               
                                   TRANS_OPPL_OMR.FØDSNUMMER        ;           
                                                                                
                                                                                
                    FJERN_ALLE                  = '0'B              ;           
                                                                                
                                                                                
                    EXEC CICS LINK PROGRAM                                      
                               ('R0015501') COMMAREA(LOKAL_KOM_OMR) ;           
                                                                                
                    IF FEIL_MELD_NR > 0 THEN                                    
                       GO TO RETUR                                  ;           
                                                                                
                                                                                
  /* FJERNET FOR Å RETTE FEIL NR 3. 9712 HL : *************                     
                    ANTALL_TRANS_I_TRANS_LISTE =                                
                                      ANTALL_TRANS_I_TRANS_LISTE - 1;           
                     **************************************  */                 
                    TRANS_OPPL_OMR.BLANKETTYPE = 'UA'; /* KONS RF */            
                                                                                
                 END;                                                           
          END;                                                                  
       ELSE                                                                     
  /* DENNE TESTEN ER BEGRENSET I FORB. MED FEILM.274. ERIK 16.1.86 */           
                 IF B01.PENSJONSTYPE3(SØKER_IND) = 'A'  &                       
                    (B01.PENSJONSTYPE1(SØKER_IND)    ^= 'Y' &                   
                     B01.PENSJONSTYPE1(SØKER_IND)    ^= 'U' ) &                 
                    B01.STATUS_KODE_HIST(SØKER_IND)  = ' ' THEN                 
                 DO;                                                            
                                                                                
 /* ***************************************************************** */        
 /* FEIL,SØKEREN HAR ATTFØRING FRA FØR.                               */        
 /* ***************************************************************** */        
                                                                                
  L360:                                                                         
                FEIL_VED_LABEL = '360';                                         
                FEIL_MELD_NR   = 1718;                                          
                GO TO RETUR;                                                    
             END;                                                               
          ELSE                                                                  
             B02.PENSJONSTYPE3(SØKER_IND) = 'A';                                
    ELSE                                                                        
       DO;                                                                      
          IF B01.PENSJONSTYPE3(SØKER_IND) = 'A' THEN                            
             DO;                                                                
                                                                                
                DO I = 1 TO HBOUND(B02.UFØRHIST,2);                             
                   IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = 0 THEN                
                      DO;                                                       
                         B02.UFØRHIST.UFKRITERIER(SØKER_IND,I-1)= 0;            
                         B00.UFØRHIST(SØKER_IND,I-1) =                          
                                 B01.UFØRHIST(SØKER_IND,I-1);                   
                         B01.UFØRHIST(SØKER_IND,I-1) = '';                      
                         K = I - 1;                                             
                         I = 8;            /*0697 HL*/                          
                      END;                                                      
                END;                                                            
             END;                                                               
                                                                                
          IF B02.PENSJONSTYPE1(SØKER_IND) = 'U' !                               
             B02.PENSJONSTYPE1(SØKER_IND) = 'Y' THEN                            
             B02.PENSJONSTYPE3(SØKER_IND) = ' ';                                
       END;                                                                     
 /* ***************************************************************** */        
 /* TIDLIGERE REGISTERT SOM ETTERLATT EKTEFELLE                       */        
 /* ***************************************************************** */        
                                                                                
    IF B01.PENSJONSTYPE1(SØKER_IND) = 'E' THEN                                  
       B02.PENSJONSTYPE2(SØKER_IND) = 'E';                                      
                                                                                
 /* ***************************************************************** */        
 /* NYE FORS-TILL BARN SKAL IKKE REGISTRERES,BRUK F7-BL  (JD 7.91)    */        
 /* ***************************************************************** */        
                                                                                
 /* ***************************************************************** */        
 /* HVIS SØKER HAR EKTEFELLE I TRANS                                  */        
 /* ***************************************************************** */        
    /* MARTIN 030403 HVORFOR SÅ KOMPLEKST ?? */                                 
    IF (U3S.FNR_EK > 0) THEN                                                    
       IF (VERIFY(U3S.SIVILSTAND,'APWVG') = 0) THEN                             
          DO;                                                                   
             B02.SIVILSTAND(SØKER_IND) = U3S.SIVILSTAND;                        
             B02.SIVILSTAND(EKTEF_IND) = U3S.SIVILSTAND;                        
                                                                                
                                                                                
          B02.EK_INNT_OVER_2G(SØKER_IND) = U3S.EK_INNT_OVER_2G;                 
                                                                                
 /* ***************************************************************** */        
 /* HVIS FORSØRGINGSTILLEGG EKTEFELLE                             */            
 /* PENSJONSTYPE1 FOR EKTEFELLEN OG PENSJONSTYPE2 FOR PENSJONISTEN    */        
 /* BLE GALT FOR YRKESKADEPENSJONER.  ENDRET 11.1.1990, ERIK.         */        
 /* ***************************************************************** */        
                                                                                
                                                                                
          IF U3S.TILL_EK = 'J' & HJ_VIRK_DATO_ÅMD > 19910400 &                  
             B01.PENSJONSTYPE2(SØKER_IND) ^= 'F' THEN                           
             U3S.TILL_EK = ' ' ; /* JD 7.91*/                                   
          IF U3S.TILL_EK = 'J' ! B01.UFØRPENS.ET(SØKER_IND) > 0                 
               ! B01.GARANTITILLEGG_EK(SØKER_IND) > 0           THEN            
             DO;                                                                
                B02.PENSJONSTYPE2(SØKER_IND)   = 'F';                           
              IF   U3S.UFG < 50    &                                            
                   HJ_VIRK_DATO_ÅMD < 19970500     THEN  /*9705 HL*/            
                 DO;                                                            
                    B02.PENSJONSTYPE2(SØKER_IND)   = 'P';                       
                    B02.PENSJONSTYPE1(EKTEF_IND)   = 'G';                       
                    B02.PENSJONSTYPE2(EKTEF_IND)   = ' ';                       
                 END;                                                           
               ELSE                                                             
                 B02.PENSJONSTYPE1(EKTEF_IND)   = 'F';                          
                 B02.PENSJONSTYPE2(EKTEF_IND)   = ' ';                          
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                                                                                
 /* ***************************************************************** */        
 /* HVIS EKTEFELLEN HAR EGEN PENSJON                                  */        
 /* ***************************************************************** */        
                                                                                
                IF  B01.PENSJONSTYPE1(EKTEF_IND)    = 'A' !                     
                    B01.PENSJONSTYPE1(EKTEF_IND)    = 'Y' !                     
                    B01.PENSJONSTYPE1(EKTEF_IND)    = 'K' !                     
                    B01.PENSJONSTYPE1(EKTEF_IND)    = 'U' THEN                  
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR AVTALEFESTET PENSJON SOM IKKE UTBETALES            */        
 /* ***************************************************************** */        
                                                                                
                    IF B01.PENSJONSTYPE1(EKTEF_IND)    = 'K'  &                 
                       B01.PENSJONSTYPE2(EKTEF_IND)    = 'N'  THEN              
                       DO;                                                      
                          B02.PENSJONSTYPE2(SØKER_IND)    = 'P';                
                          B02.PENSJONSTYPE2(EKTEF_IND)    = 'N';                
                       END;                                                     
                    ELSE                                                        
                       IF  U3S.SIVILSTAND               = 'A'  !                
                           U3S.SIVILSTAND               = 'V' THEN              
                          DO;                                                   
                             B02.PENSJONSTYPE2(SØKER_IND)   = 'P';              
                             B02.PENSJONSTYPE2(EKTEF_IND)   = 'P';              
                          END;                                                  
                       ELSE                                                     
                          DO;                                                   
                             IF U3Y.KAP_11_7_UTLØST = 'J'  THEN                 
                                                                                
                               DO;                                              
                                B02.PENSJONSTYPE2(SØKER_IND) = ' ';             
                                B02.PENSJONSTYPE2(EKTEF_IND) = 'P';             
                               END;                                             
                             ELSE                                               
                               DO;                                              
                             B02.PENSJONSTYPE2(SØKER_IND)   = 'S';              
                             B02.PENSJONSTYPE2(EKTEF_IND)   = 'S';              
                               END;                                             
                          END;                                                  
                ELSE                                                            
                   DO;                                                          
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR IKKE PENSJON                                       */        
 /* ***************************************************************** */        
                                                                                
                       IF U3Y.KAP_11_7_UTLØST = 'J'  THEN                       
                          B02.PENSJONSTYPE2(SØKER_IND) = ' ';                   
                       ELSE                                                     
                          B02.PENSJONSTYPE2(SØKER_IND)   = 'P';                 
                      B02.PENSJONSTYPE1(EKTEF_IND)   = 'G';                     
                   END;                                                         
            END;                                                                
            B02.NAVN(EKTEF_IND)            = U3S.NAVN_EK;                       
            B02.SPRÅK(EKTEF_IND)           = U3S.SPRÅK;                         
                                                                                
 /* ***************************************************************** */        
 /* TILKN-KODE TIL EKTEFELLENE OPPDATERES MED RESPEKTIVE NYE STATUSER.*/        
 /* ***************************************************************** */        
                                                                                
            DO I = 1 TO HBOUND(B02.TILKN,2);                                    
               IF (B02.FNR_TILKN(SØKER_IND,I)=                                  
                                        B02.FNR(EKTEF_IND))THEN                 
                  DO;                                                           
                     B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I)                    
                                  =  B02.PENSJONSTYPE1(EKTEF_IND);              
                     I=13;                                                      
                  END;                                                          
            END;                                                                
            DO I = 1 TO HBOUND(B02.TILKN,2);                                    
               IF (B02.FNR_TILKN(EKTEF_IND,I)=                                  
                                        B02.FNR(SØKER_IND))THEN                 
                  DO;                                                           
                     B02.TILKNYTNINGSKODE(EKTEF_IND,I)                          
                            =  B02.PENSJONSTYPE1(SØKER_IND);                    
                     B02.FT_FØR_91(EKTEF_IND,I) = ' ';                          
                     I=13;                                                      
                  END;                                                          
            END;                                                                
       END;                                                                     
    ELSE                                                                        
                                                                                
 /* **************************************************************** */         
 /* SØKER HAR IKKE EKTEFELLE                                         */         
 /* **************************************************************** */         
                                                                                
       IF ^(B01.PENSJONSTYPE1(SØKER_IND) = 'N' !                                
            B01.PENSJONSTYPE1(SØKER_IND) = 'E' !                                
            B01.PENSJONSTYPE1(SØKER_IND) = 'B')    &                            
          B01.PENSJONSTYPE2(SØKER_IND)  ^= 'E'         THEN                     
                                                                                
                       IF U3Y.KAP_11_7_UTLØST = 'J'  THEN                       
                          B02.PENSJONSTYPE2(SØKER_IND) = ' ';                   
                       ELSE                                                     
          B02.PENSJONSTYPE2(SØKER_IND) = 'P';                                   
                                                                                
    IF B02.PENSJON_FØR_9802(SØKER_IND) ^= 'J'   THEN                            
       B02.RED_GP_3_2_5(SØKER_IND) = U3S.RED_GP_3_2_5 ;                         
                                                                                
 /* ***************************************************************** */        
 /* UFØREPENSJON                                                      */        
 /* ***************************************************************** */        
                                                                                
    IF (U3S.UFG = B01.UFØRPENS.GARANTIGRAD(SØKER_IND) &                         
        B01.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) = 'J'   &                         
        U3S.LØNNSTILSKUDD                     = 'X'   ) THEN                    
       /* TD 96 */                                                              
       U3S.FRIINNTEKT_DATO_ÅMD = HJ_VIRK_DATO_ÅMD + 1;                          
                                                                                
                                                                                
    IF (U3S.UFG <= B02.UFØRPENS.GARANTIGRAD(SØKER_IND) &                        
       U3S.LØNNSTILSKUDD ^= 'S'                        &                        
       B01.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) ^= 'J'    &                        
        U3S.FRIINNTEKT_DATO_ÅMD = 0                    ) THEN                   
       /* ----------------------------------------------------------- */        
       /* OPPDRAG 03190 INNTEKTSTAK PARAGRAF 12-12 M.M.               */        
       /*   2.2.1 UNNTAK 1                                            */        
       /*     NÅR UFØREGRADEN SETTES OPP INNENFOR EN FRYSPERIODE MED  */        
       /*     HVILENDE PENSJONSRETT TIL EN GRAD LIK ELLER LAVERE ENN  */        
       /*     GARANTIGRADEN, REGISTRERES FRIINNTEKTFOM = VIRKDATO     */        
       /*     FOR BLANKETTEN                                          */        
       /* ----------------------------------------------------------- */        
       IF HJ_VIRK_DATO_ÅMD > 20040000  THEN   /*20050509 HL*/                   
          U3S.FRIINNTEKT_DATO_ÅMD = HJ_VIRK_DATO_ÅMD + 1;                       
                                                                                
    IF (U3S.FRIINNTEKT_DATO_ÅMD          > 0) &                                 
       (MOD(U3S.FRIINNTEKT_DATO_ÅMD,100) = 0) THEN                              
       U3S.FRIINNTEKT_DATO_ÅMD = U3S.FRIINNTEKT_DATO_ÅMD + 1;                   
                                                                                
    IF U3S.UFG >= B02.UFØRPENS.GARANTIGRAD(SØKER_IND)    &                      
       U3S.LØNNSTILSKUDD ^= 'S'                        THEN                     
       DO;                                                                      
          B02.UFØRPENS.GARANTIGRAD(SØKER_IND)  = 0;                             
          B02.FRYSDATO_ÅMD(SØKER_IND)          = 0;                             
          B02.FRYSKODE    (SØKER_IND)          = ' ';                           
       END;                                                                     
                                                                                
    B02.UFØRPENS.UFG(SØKER_IND)           = U3S.UFG;                            
    B02.UFØRPENS.VILKÅR_8_4_3A(SØKER_IND) = U3S.VILKÅR_8_4_3A;                  
                                                                                
    /* INNTEKT-FØR-UP BLE BORTE VED NY BLANKETT . TRUDE 200395*/                
    IF U3S.INNTEKT_FØR_UP > 0 THEN                                              
       IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1) > 0 &                               
          (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1) ^=                                 
                     ((U3S.UFT_ÅMD))         ) &    /*9712 MH*/                 
          B01.PENSJONSTYPE3(SØKER_IND) ^= 'A'  THEN                             
 L370:                                                                          
          DO;  /* HAR UFØRE FRA FØR, SKAL BRUKE ENDRINGSBLANKETT */             
             FEIL_VED_LABEL = '370';                                            
             FEIL_MELD_NR   = 448;                                              
             GO TO RETUR;                                                       
          END; /* HAR UFØRE FRA FØR, SKAL BRUKE ENDRINGSBLANKETT */             
       ELSE                                                                     
          DO;  /* FØRSTE UFØRETIDSPUNKT - OK */                                 
             IF (U3S.ATT_UF = 'U') THEN                                         
                DO;  /* NY TEST IFBM OPPRETTING IFU */                          
                   B02.INNTEKT_FØR_UP(SØKER_IND) =                              
                      U3S.INNTEKT_FØR_UP / 100;                                 
                   B02.INNT_DATO_ÅMD(SØKER_IND) = (U3S.UFT_ÅMD);                
                END;                                                            
                                                                                
          END; /* FØRSTE UFØRETIDSPUNKT - OK */                                 
    ELSE                                                                        
       DO;  /* INNTEKT FØR UP IKKE UTFYLT */                                    
          IF B01.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND) > 0 THEN                    
             DO;  /* HAR REGISTRERT INNTEKTSNIVÅ */                             
                B02.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND)                          
                   = B01.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND);                    
                IF B01.INNT_DATO_ÅMD(SØKER_IND) > 0 THEN                        
                   B02.INNT_DATO_ÅMD(SØKER_IND)                                 
                      = B01.INNT_DATO_ÅMD(SØKER_IND);                           
                ELSE                                                            
                   B02.INNT_DATO_ÅMD(SØKER_IND)                                 
                      = B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1);                      
             END; /* HAR REGISTRERT INNTEKTSNIVÅ */                             
      END; /* INNTEKT FØR UP IKKE UTFYLT */                                     
                                                                                
 L111:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.11 YNGSTE BARNS FØDSELSÅR, IKKE KONTROLL MOT STATUS          */        
    /* -------------------------------------------------------------- */        
    B02.UFØRPENS.YNGSTE_BARN_FÅR (SØKER_IND) = U3S.YNGSTE_BARN_FÅR;             
                                                                                
 L113:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.13 YRKESMESSIG ATTFØRING FORSØKT, IKKE KONTROLL MOT STATUS   */        
    /* -------------------------------------------------------------- */        
    B02.UFØRPENS.YRKESM_ATTF(SØKER_IND)   = U3S.YRKESM_ATTF;                    
                                                                                
 L114:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.14 UTDANNINGSKODE, IKKE KONTROLL MOT STATUS                  */        
    /* -------------------------------------------------------------- */        
    B02.UFØRPENS.UTDANNING(SØKER_IND)     = U3S.UTDANNING;                      
                                                                                
 L118:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.18 GARANTERT TILLEGGSPENSJON PARAGRAF 3-21 FØRSTE LEDD       */        
    /* -------------------------------------------------------------- */        
    IF (ALDER_UF > 2600) THEN                                                   
       U3S.GARANTERT_TP = ' ';                                                  
    ELSE                                                                        
    IF (FNR13_Å < 1941) THEN   /* KONS RF */                                    
       U3S.GARANTERT_TP = ' ';                                                  
    ELSE                                                                        
    IF (B01.PENSJONSTYPE1(SØKER_IND)  = 'U' !                                   
        B01.PENSJONSTYPE1(SØKER_IND)  = 'Y' ) THEN                              
        DO;                                                                     
          IF (U3S.GARANTERT_TP = 'J'   &                                        
              B01.GARANTERT_TP(SØKER_IND)  = 'N' )     !                        
             (U3S.GARANTERT_TP = 'N'   &                                        
              (B01.GARANTERT_TP(SØKER_IND)  = 'J' !                             
               B01.GARANTERT_TP(SØKER_IND)  = ' ' ))       THEN                 
             DO;                                                                
                FEIL_VED_LABEL = '118';                                         
                FEIL_MELD_NR   = 1552;                                          
                GO TO RETUR;                                                    
             END;                                                               
       END;                                                                     
    ELSE                                                                        
    IF U3S.GARANTERT_TP = ' '      THEN                                         
       DO;                                                                      
          FEIL_VED_LABEL = '118';                                               
          FEIL_MELD_NR   = 1544;                                                
          GO TO RETUR;                                                          
       END;                                                                     
    ELSE                                                                        
       B02.GARANTERT_TP (SØKER_IND) = U3S.GARANTERT_TP;                         
                                                                                
 L122:                                                                          
    /* -------------------------------------------------------------- */        
    /* 1.22 REAKTIVISERING                                            */        
    /* -------------------------------------------------------------- */        
    IF (U3S.REAKTIVISERING                      = 'X' &                         
        B01.UFØRPENS.REAKTIVISERING(SØKER_IND) ^= 'J') THEN                     
       DO;                                                                      
          FEIL_MELD_NR   = 430;                                                 
          FEIL_VED_LABEL = '122';                                               
       END;                                                                     
                                                                                
  /*OPPDRAG 05070:*/                                                            
                                                                                
    IF U3S.REAKTIVISERING             = 'S'         &                           
       B01.VIRK_UFØRHIST_ÅMD(SØKER_IND,1) > 0    THEN                           
       IF HJ_VIRK_DATO_ÅMD <                                                    
             (B01.VIRK_UFØRHIST_ÅMD(SØKER_IND,1) + 10000) THEN                  
  L123:   /*MINDRE ENN ETT ÅR SIDEN FØRSTE VIRK*/                               
       DO;                                                                      
          FEIL_MELD_NR   = 647;                                                 
          FEIL_VED_LABEL = '123';                                               
       END;                                                                     
                                                                                
    IF U3S.ATT_UF = 'A'       &                                                 
      (U3S.FRYSP_5ÅR_ARB ^= ' '   !                                             
       U3S.FRYSP_TIDSB   ^= ' '    )     THEN                                   
  L124:    /*FELTNUMMER*/                                                       
       DO;                                                                      
          FEIL_VED_LABEL = '124';                                               
          FEIL_MELD_NR   = 1546;                                                
          GO TO RETUR;                                                          
       END;                                                                     
                                                                                
    IF U3S.FRYSP_5ÅR_ARB = 'S' THEN                                             
       DO;  /* START FRYS 3 ÅR */                                               
          IF (U3S.FRYSP_TIDSB   ^= 'X' &                                        
              U3S.LØNNSTILSKUDD ^= 'S' ) THEN                                   
             DO;  /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
                FEIL_VED_LABEL = '124';                                         
                FEIL_MELD_NR   = 1547;                                          
                GO TO RETUR;                                                    
             END; /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
          ELSE                                                                  
          IF (B02.FRYSKODE(SØKER_IND) = ' ' &                                   
              U3S.LØNNSTILSKUDD      ^= 'S' ) THEN                              
             DO;  /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
                FEIL_VED_LABEL = '124';                                         
                FEIL_MELD_NR   = 1548;                                          
                GO TO RETUR;                                                    
             END; /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
          ELSE                                                                  
             DO;                                                                
                B02.FRYSKODE(SØKER_IND) = '1';                                  
                B02.FRYSDATO_ÅMD(SØKER_IND) = HJ_VIRK_DATO_ÅMD;                 
  /*VED LØNNSTILSKUDD SETTES GARANTIGRAD:  */                                   
                IF B01.GARANTIGRAD(SØKER_IND) <                                 
                   B02.UFØRPENS.UFG(SØKER_IND)          THEN                    
                   B02.GARANTIGRAD(SØKER_IND) =                                 
                   B02.UFØRPENS.UFG(SØKER_IND);                                 
             END;                                                               
       END; /* START FRYS 3 ÅR */                                               
    ELSE                                                                        
    IF U3S.FRYSP_TIDSB   = 'S' THEN                                             
       DO;  /* START TIDSBEGRENSET FRYS */                                      
          IF (U3S.FRYSP_5ÅR_ARB ^= 'X' &                                        
              U3S.LØNNSTILSKUDD ^= 'S' ) THEN                                   
             DO;  /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
                FEIL_VED_LABEL = '124';                                         
                FEIL_MELD_NR   = 1547;                                          
                GO TO RETUR;                                                    
             END; /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
          ELSE                                                                  
          IF (B02.FRYSKODE(SØKER_IND) = ' ' &                                   
              U3S.LØNNSTILSKUDD      ^= 'S' ) THEN                              
             DO; /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */                
                FEIL_VED_LABEL = '124';                                         
                FEIL_MELD_NR   = 1548;                                          
                GO TO RETUR;                                                    
             END; /* TD 71 OGSÅ UNNTAK VED START LØNNSTILSKUDD */               
          ELSE                                                                  
             DO;                                                                
                B02.FRYSKODE(SØKER_IND) = '2';                                  
                B02.FRYSDATO_ÅMD(SØKER_IND) = HJ_VIRK_DATO_ÅMD;                 
  /*VED LØNNSTILSKUDD SETTES GARANTIGRAD:  */                                   
                IF B01.GARANTIGRAD(SØKER_IND) <                                 
                   B02.UFØRPENS.UFG(SØKER_IND)          THEN                    
                   B02.GARANTIGRAD(SØKER_IND) =                                 
                   B02.UFØRPENS.UFG(SØKER_IND);                                 
             END;                                                               
       END; /* START TIDSBEGRENSET FRYS */                                      
    ELSE                                                                        
    IF U3S.FRYSP_5ÅR_ARB = 'X'    THEN                                          
       DO;                                                                      
          FEIL_VED_LABEL = '124';                                               
          FEIL_MELD_NR   = 1549;                                                
          GO TO RETUR;                                                          
       END;                                                                     
    ELSE                                                                        
    IF U3S.FRYSP_TIDSB   = 'X' THEN                                             
       DO;                                                                      
          IF B02.FRYSKODE(SØKER_IND) ^= '2'      THEN                           
             DO;                                                                
                FEIL_VED_LABEL = '124';                                         
                FEIL_MELD_NR   = 0435;                                          
                GO TO RETUR;                                                    
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                B02.FRYSKODE(SØKER_IND) = ' ';                                  
                B02.FRYSDATO_ÅMD(SØKER_IND) = 0;                                
                B02.UFØRPENS.GARANTIGRAD(SØKER_IND) = 0;                        
             END;                                                               
       END;                                                                     
                                                                                
    IF U3S.UFG >= B01.UFØRPENS.GARANTIGRAD(SØKER_IND)  &                        
      (B01.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) = 'J'  &                           
       U3S.LØNNSTILSKUDD  = ' '                       )  THEN                   
  L125:                                                                         
             DO;                                                                
                FEIL_VED_LABEL = '125';                                         
                FEIL_MELD_NR   = 677;                                           
             END;                                                               
                                                                                
    IF U3S.LØNNSTILSKUDD = 'S'        THEN                                      
       IF B01.UFØRPENS.REAKTIVISERING(SØKER_IND) = 'J'   &                      
          U3S.REAKTIVISERING ^= 'X'                 THEN                        
  L126:                                                                         
             DO;                                                                
                FEIL_VED_LABEL = '126';                                         
                FEIL_MELD_NR   = 673;                                           
             END;                                                               
       ELSE                                                                     
       IF B01.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) = 'J' THEN                      
  L127:                                                                         
             DO;                                                                
                FEIL_VED_LABEL = '127';                                         
                FEIL_MELD_NR   = 675;                                           
             END;                                                               
       ELSE                                                                     
       IF U3S.FRIINNTEKT_DATO_ÅMD > 0                  THEN                     
  L128:                                                                         
             DO;                                                                
                FEIL_VED_LABEL = '128';                                         
                FEIL_MELD_NR   = 679;                                           
             END;                                                               
       ELSE                                                                     
       IF B01.FRYSKODE(SØKER_IND) = '1'      THEN                               
          /*HAR FRYS 3 ÅR FRA FØR*/                                             
          DO;                                                                   
             IF ^(U3S.FRYSP_5ÅR_ARB = 'X'  &                                    
                  U3S.FRYSP_TIDSB   = 'S'    )  THEN                            
                DO;                                                             
  L129:                                                                         
                   FEIL_VED_LABEL = '129';                                      
                   FEIL_MELD_NR   = 686;                                        
                END;                                                            
             ELSE                                                               
                B02.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) = 'J';                    
          END;                                                                  
       ELSE                                                                     
       IF U3S.FRYSP_5ÅR_ARB ^= 'S'      THEN                                    
                                                                                
  L130:                                                                         
          DO;                                                                   
                FEIL_VED_LABEL = '130';                                         
                FEIL_MELD_NR   = 674;                                           
          END;                                                                  
       ELSE                                                                     
          B02.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) = 'J';                          
                                                                                
    IF U3S.LØNNSTILSKUDD = 'X'        THEN                                      
       B02.UFØRPENS.LØNNSTILSKUDD(SØKER_IND) = ' ';                             
                                                                                
    IF U3S.ATT_UF = 'X'    THEN                                                 
       B02.PENSJONSTYPE2(SØKER_IND) = 'A';                                      
                                                                                
 /* ***************************************************************** */        
 /* TRYGDETID  (FELTENE TT_FRA1937 ER OPPDATERT I 603 FOR NORSK_BOSATT*/        
 /*             DE INNEHOLDER FAKTISK TRYGDETID)                      */        
 /* ***************************************************************** */        
                                                                                
    HJ_UFT_ÅMD     = U3S.UFT_ÅMD;                                               
                                                                                
    IF U3SP.STI_ÅMD_3B        > 0        THEN                                   
       HJ_ÅMD = U3SP.STI_ÅMD_3B;                                                
  /* ************                                                               
    ELSE                                                                        
    IF U3SP.STI_ÅMD_3C        > 0        THEN                                   
       HJ_ÅMD = U3SP.STI_ÅMD_3C;          ************* */                      
    ELSE                                                                        
       HJ_ÅMD = U3S.UFT_ÅMD;                                                    
                                                                                
    HJ_ÅMD =           (HJ_ÅMD);                                                
    HJ_ÅMD_FIX = HJ_ÅMD;                                                        
 /* B02.TT_16_66(SØKER_IND) = U3SP.TT_FRA1937_ÅR * 12 +                         
                                    U3SP.TT_FRA1937_MND;    */                  
                                                                                
                                                                                
   IF U3S.NORSK_BOSATT ^= 'N'  THEN                                             
     DO;                                                                        
      IF  HJ_VIRK_DATO_ÅMD > 19910000  THEN                                     
       B02.TT_16_66(SØKER_IND) = (HJ_UFT_Å -(FNR13_Å + 16)) * 12                
                               + HJ_UFT_M - FNR13_M; /*HL 120994*/              
      ELSE                                                                      
       DO;                                                                      
         B02.TT_16_66(SØKER_IND) = U3SP.TT_FRA1937_ÅR * 12 +                    
                                 U3SP.TT_FRA1937_MND;/*TRUDE 131094  */         
                                                                                
         B02.TT_FØR_1967  (SØKER_IND) = U3SP.TT_F67;                            
         B02.TT_ETTER_1966(SØKER_IND) = U3SP.TT_E66_Å * 12 +                    
                                        U3SP.TT_E66_M;                          
       END;                                                                     
    END;     /* BOSATT */                                                       
                                                                                
    IF B02.TT_16_66(SØKER_IND) > 480     THEN                                   
       B02.TT_16_66(SØKER_IND) = 480;   /*HL 080694*/                           
                                                                                
 /*BLANKES FOR SIKKERHETS SKYLD : */                                            
    B02.TT_NORDISK_FAKT_MND (SØKER_IND) = 0;                                    
    B02.PÅ_NORDISK_FAKT    (SØKER_IND) = 0;                                     
                                                                                
 /* ***************************************************************** */        
 /* PENSJONSGIVENDE INNTEKT                                           */        
 /* ***************************************************************** */        
                                                                                
    ÅR_FØR_UFØRHET = HJ_UFT_Å - 1;                                              
                                                                                
 /* ***************************************************************** */        
 /* HER MÅ  VI TESTE PÅ EN KODE FOR Å SE OM VI HAR FÅTT RAPP. INNTEKT */        
 /* ***************************************************************** */        
                                                                                
    IF ÅR_FØR_UFØRHET            > 1966     THEN                                
       IF B01.PINNTEKT.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = ' ' !                
          B01.PINNTEKT.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F' THEN             
          DO;                                                                   
             IF U3S.PI > 0 THEN                                                 
                DO;                                                             
                   B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F';                 
                   B02.PI(SØKER_IND,ÅR_FØR_UFØRHET)      =                      
                                         U3S.PI;                                
                END;                                                            
          END;                                                                  
                                                                                
                                                                                
  IF (ÅR_FØR_UFØRHET  > 1966 )  &                                               
     (U3S.PI > 0             )          THEN                                    
       DO;                                                                      
          IF B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = ' ' !                      
             B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F' THEN                   
             DO;                                                                
                B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F';                    
                B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) = U3S.PI;                      
             END;                                                               
          ELSE /*KODE M = OMSORG + FORELØPIG INNT */                            
          IF B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'M'   THEN                 
             DO;                                                                
                B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'M';                    
                B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) = U3S.PI;                      
             END;                                                               
          ELSE                                                                  
          IF (B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'J'  !                    
              B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'K'  !                    
              B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'L'  )  &                 
               B01.PI(SØKER_IND,ÅR_FØR_UFØRHET) = 0       THEN                  
             DO;                                                                
                B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'M';                    
                B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) = U3S.PI;                      
             END;                                                               
       END;                                                                     
                                                                                
 /* ***************************************************************** */        
 /* UFØREHISTORIKK                                                    */        
 /* ***************************************************************** */        
    B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) =                                 
       U3S.FRIINNTEKT_DATO_ÅMD;                                                 
    DO I = 1 TO HBOUND(B02.UFØRHIST,2);                                         
       SELECT;                                                                  
         WHEN(B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = (U3S.UFT_ÅMD))                
                                                                                
 /* ***************************************************************** */        
 /* D.V.S VI HAR EN PERIODE FRA FØR MED SAMME UFTIDSPUNKT             */        
 /* ***************************************************************** */        
                                                                                
         DO;  /* VI HAR EN PERIODE MED SAMME UFT FRA FØR */                     
            DO J = 1 TO HBOUND(B02.UFØRGRAD,3);  /* 13.4.04 JFA */              
              IF B02.UFG_DATO_ÅMD(SØKER_IND,I,J) > 0 THEN                       
                 DO;                                                            
                    B02.UFG_ØVRIGE(SØKER_IND,I,J) = 0;                          
 /* JFA */          B02.UFØRGRAD.YNGSTE_BARN_FÅR_GRAD                           
 /* JFA */                             (SØKER_IND,I,J) = 0;                     
 /* 22.5.02 */                                                                  
                B02.UFØRGRAD.FRIINNTEKT_FRA_GRAD_ÅMD(SØKER_IND,I,J) = 0;        
                    B02.VIRK_UFØRGRAD_ÅMD(SØKER_IND,I,J)  = 0;                  
                    B02.UFG_DATO_ÅMD(SØKER_IND,I,J) = 0;                        
                 END;                                                           
              ELSE                                                              
                 J = HBOUND(B02.UFØRGRAD,3);  /*13.4.04 JFA */                  
            END;                                                                
            DIV_PARAM_OMR.REGN_1291 = ' ';    /*HL*/                            
                                                                                
            UF_IND = I;                                                         
            B02.UFØRHIST.UFG(SØKER_IND,I) = U3S.UFG;                            
            B02.UFØRHIST.YNGSTE_BARN_FÅR_HIST (SØKER_IND,I) =                   
                                    U3S.YNGSTE_BARN_FÅR;                        
                                                                                
            IF HJ_VIRK_DATO_ÅMD > 20040000          THEN                        
               /* REMEDY 962 NYTT IF STMT *//*FJERNET 200510 HL*/               
     /*        IF (B02.VIRK_UFØRHIST_ÅMD(SØKER_IND,I)>0) THEN */                
               DO;                                                              
                 B02.VIRK_UFØRHIST_ÅMD(SØKER_IND,I)                             
                                          = HJ_VIRK_DATO_ÅMD;                   
                 B02.UFØRHIST.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I) =            
                 U3S.FRIINNTEKT_DATO_ÅMD;                                       
               END;                                                             
       SISTE_IND = 0;                                                           
       IF (B02.VIRK_UFØRHIST_ÅMD(SØKER_IND,1) > 0 &                             
           B02.VIRK_UFØRHIST_ÅMD(SØKER_IND,1) < 20040000) THEN                  
          DO;                                                                   
             DO K = 1 TO HBOUND(B02.UFØRHIST,2)                                 
                      WHILE(SISTE_IND = 0);                                     
               IF B02.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,K) = 0 THEN            
                  SISTE_IND = I;                                                
             END;                                                               
          END;                                                                  
                                                                                
       IF SISTE_IND > 0 THEN /* UFØR-PERIODE FRA FØR */                         
          DO;  /* VI KONTROLLERER MOT FORRIGE PERIODE */                        
  L632:                                                                         
            IF HJ_FRIINNTEKT_DATO_ÅMD > 0                        &              
               HJ_FRIINNTEKT_DATO_ÅMD < (HJ_VIRK_DATO_ÅMD + 10000) THEN         
               /* ETT ÅR ETTER VIRK */                                          
               DO;                                                              
                  FEIL_VED_LABEL = '632';                                       
                  FEIL_MELD_NR   = 643;   /* REMEDY 848 */                      
              /*  FEIL_MELD_NR   = 632;   */                                    
                  GO TO RETUR;                                                  
               END;                                                             
        /*  ELSE */                                                             
            IF B01.UFØRPENS.REAKTIVISERING(SØKER_IND) = 'J' THEN                
               IF U3S.FRIINNTEKT_DATO_ÅMD  > 0  &                               
                  U3S.REAKTIVISERING      ^= 'X' THEN                           
                  DO;                                                           
                     FEIL_VED_LABEL = '635';                                    
                     FEIL_MELD_NR   = 635;                                      
                     GO TO RETUR;                                               
                  END;                                                          
        /*  ELSE */                                                             
            IF B01.FRYSKODE(SØKER_IND) = '1' THEN                               
               /* 3 ÅR FRYS MED PENSJONSRETT */                                 
              IF U3S.UFG <= B01.UFØRPENS.GARANTIGRAD(SØKER_IND) THEN            
                 DO;                                                            
                    FEIL_VED_LABEL = '637';                                     
                    FEIL_MELD_NR   = 637;                                       
                    GO TO RETUR;                                                
                 END;                                                           
          /*ELSE */                                                             
            IF B01.UFØRPENS.UNNTAK_VENTETID(SØKER_IND) = 'J' THEN               
               IF U3S.FRIINNTEKT_DATO_ÅMD > 0 THEN                              
                  DO;                                                           
                     FEIL_VED_LABEL = '636';                                    
                     FEIL_MELD_NR   = 636;                                      
                     GO TO RETUR;                                               
                  END;                                                          
         /* ELSE */                                                             
         /*    DO;  /* OK - FRIINNTEKT LEGGES I B02 */                          
            /* REMEDY 962 NYTT IF STMT *//*FJERNET 200510 HL*/                  
        /*  IF (B01.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I)>0) THEN*/              
              B02.UFØRHIST.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I) =               
                 U3S.FRIINNTEKT_DATO_ÅMD;                                       
            /* REMEDY 962 NYTT IF STMT */                                       
            IF (B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND)>0) THEN               
               B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) =                      
                  U3S.FRIINNTEKT_DATO_ÅMD;                                      
         /*    END; /* OK - FRIINNTEKT LEGGES I B02 */                          
          END; /* VI KONTROLLERER MOT FORRIGE PERIODE */                        
                                                                                
 /*HL : UFKRIT BLE ALLTID SATT > 0 FOR YRKESSKADDE - RETTET 2.4.91*/            
                                                                                
                                                                                
            IF U3S.VILKÅR_8_4_3A = 'J' THEN                                     
               IF U3S.YSKADE_TILLEGG = 'J' THEN                                 
                  IF U3Y.KAP_11_7_UTLØST = 'J'    THEN                          
                     B02.UFKRITERIER(SØKER_IND,I) = 5;                          
                  ELSE                                                          
                     B02.UFKRITERIER(SØKER_IND,I) = 4;                          
               ELSE                                                             
                  B02.UFKRITERIER(SØKER_IND,I) = 2;                             
            ELSE                                                                
               B02.UFKRITERIER(SØKER_IND,I) = 0;                                
            /* REMEDY 204 ...                                                   
            IF B01.BUP_GAR_KODE(SØKER_IND,I) = 'A' THEN                         
            ... REMEDY 204 */                                                   
            IF (B01.BUP_GAR_KODE(SØKER_IND,I) = 'A' !                           
                U3S.GARANTERT_TP = 'J'              ) THEN                      
               DO;                                                              
                  IF HJ_VIRK_DATO_ÅMD >= TJUEÅRSDATO_ÅMD THEN                   
                     DO;                                                        
                        B02.BUP_GAR_KODE(SØKER_IND,I) = 'B';                    
                        CALL UNGE_UFØRE;                /*U623*/                
                     END;                                                       
                  ELSE                                                          
                     B02.BUP_GAR_KODE(SØKER_IND,I) = 'A';                       
               END;                                                             
            B02.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,I) = 0;                      
            B02.UFØRHIST.OPPHØRSKODE   (SØKER_IND,I) = ' ';                     
            I = HBOUND(B02.UFØRHIST,2); /*0405 MH */                            
         END; /* VI HAR EN PERIODE MED SAMME UFT FRA FØR */                     
                                                                                
         WHEN (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = 0)                           
         DO;  /* OPPDATER UFØRHIST - SEGMENTET */                               
                                                                                
 /* ***************************************************************** */        
 /* D.V.S. DETTE ER FØRSTE LEDIGE PLASS.                              */        
 /* ***************************************************************** */        
                                                                                
            UF_IND = I;                                                         
            B02.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = (U3S.UFT_ÅMD);                  
            B02.UFØRHIST.UFG(SØKER_IND,I)    = U3S.UFG;                         
                                                                                
 /* JFA */  B02.UFØRHIST.YNGSTE_BARN_FÅR_HIST(SØKER_IND,I) =                    
 /* 22.5.02 */                               U3S.YNGSTE_BARN_FÅR;               
                                                                                
            IF HJ_VIRK_DATO_ÅMD > 20040000          THEN                        
               B02.VIRK_UFØRHIST_ÅMD(SØKER_IND,I)                               
                                          = HJ_VIRK_DATO_ÅMD;                   
                                                                                
               /*200508/200509 HL */                                            
            IF (B01.UFØRPENS.GARANTIGRAD(SØKER_IND)  >  0  &                    
                B01.UFØRPENS.GARANTIGRAD(SØKER_IND) >= U3S.UFG) THEN            
                                                                                
               DO;  /* HER SKAL FRIINNTEKTSDATO SETTES LIK NYTT VIRK */         
                  B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) =                   
                                      HJ_VIRK_DATO_ÅMD + 1;                     
                  U3S.FRIINNTEKT_DATO_ÅMD =                                     
                                      HJ_VIRK_DATO_ÅMD + 1;                     
               END;                                                             
                                                                                
            B02.UFØRHIST.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I) =                 
                                   U3S.FRIINNTEKT_DATO_ÅMD;                     
                                                                                
            IF U3S.VILKÅR_8_4_3A = 'J' THEN                                     
               B02.UFKRITERIER(SØKER_IND,I) = 2;                                
                                                                                
 /*DETTE ER FØRSTE PERIODE - 9708 HL :                   */                     
                                                                                
            IF (UF_IND = 1                                    !                 
                B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) ^= ' ' ) THEN            
               /* --------------------------------------------------- */        
               /* ENDRET 040100: UNGE UFØRE SOM LÅ PÅ "VENT" NÅR DEI  */        
               /*                OPPHØRTE FIKK ALDRI BUP_GARANTI      */        
               /* --------------------------------------------------- */        
               CALL UNGE_UFØRE; /*U623*/                                        
            IF UF_IND > 1 THEN                                                  
               DO;  /* OPPDATER FORRIGE UFØRHIST SEGMENT */                     
                  IF B01.OPPHØRSDATO_ÅMD(SØKER_IND,(I-1)) = 0 THEN              
                     DO;  /* OPPHØRSDATO FORRIGE VAR BLANK */                   
                        B02.OPPHØRSDATO_ÅMD(SØKER_IND,(I-1))/* KONS RF*/        
                           = OPPH_ÅR*10000 + OPPH_MN * 100 + OPPH_DAG;          
                        B02.OPPHØRSKODE(SØKER_IND,(I-1)) = 'J';                 
  /*13.4.04 JFA */      DO J = 1 TO HBOUND(B02.UFØRGRAD,3)                      
  /* FRA 7 TIL 12 */            WHILE (B02.UFG_DATO_ÅMD(SØKER_IND,              
                                      (I-1), J) > 0);                           
                           IF B02.UFG_DATO_ÅMD(SØKER_IND,(I-1),J) =             
                              B02.UFØRHIST.UFT_ÅMD(SØKER_IND,I) THEN            
                                                                                
                                       /* DET NYE UFØRETIDSPT ER LIK */         
                                       /* TIDSPT TIL SISTE UFØREGRAD */         
                                       /* I FORRIGE PERIODE OG MÅ    */         
                                       /* SLETTES                    */         
                              DO;                                               
                                B02.UFG_ØVRIGE(SØKER_IND,(I-1),J) = 0;          
 /*JFA 22.5.02*/  B02.YNGSTE_BARN_FÅR_GRAD(SØKER_IND,(I-1),J) = 0;              
                                B02.UFG_DATO_ÅMD(SØKER_IND,(I-1),J) = 0;        
                                B01.UFG_ØVRIGE(SØKER_IND,(I-1),J) = 0;          
 /*JFA 22.5.02*/  B01.YNGSTE_BARN_FÅR_GRAD(SØKER_IND,(I-1),J) = 0;              
                                B01.UFG_DATO_ÅMD(SØKER_IND,(I-1),J) = 0;        
                  B01.VIRK_UFØRGRAD_ÅMD(SØKER_IND,(I-1),J) = 0;                 
                  B02.VIRK_UFØRGRAD_ÅMD(SØKER_IND,(I-1),J) = 0;                 
            B01.UFØRGRAD.FRIINNTEKT_FRA_GRAD_ÅMD(SØKER_IND,(I-1),J) = 0;        
            B02.UFØRGRAD.FRIINNTEKT_FRA_GRAD_ÅMD(SØKER_IND,(I-1),J) = 0;        
                                                                                
                              END;                                              
                           ELSE                                                 
                           IF B02.UFG_DATO_ÅMD(SØKER_IND,(I-1),J) >             
                              B02.UFØRHIST.UFT_ÅMD(SØKER_IND,I) THEN            
                              DO;                                               
 /* ***************************************************************** */        
 /* FEIL, UFØREDATO I FORRIGE PERIODE ER ETTER DET NYE UFØRETIDSPUNKT */        
 /* ***************************************************************** */        
                                                                                
  L278:                                                                         
                                   FEIL_VED_LABEL = '278';                      
                                   FEIL_MELD_NR   = 1711;                       
                                   GO TO RETUR;                                 
                              END;                                              
                        END;  /* DO J = 1 TO 12*/                               
                                                                                
                     END; /* OPPHØRSDATO FORRIGE VAR BLANK */                   
                                                                                
                  ELSE        /*TILLEGG 0195 HL : */                            
                  IF B01.OPPHØRSDATO_ÅMD(SØKER_IND,(I-1)) >                     
                                            (U3S.UFT_ÅMD)   THEN                
                     DO;                                                        
                        B02.OPPHØRSDATO_ÅMD(SØKER_IND,(I-1))                    
                           = OPPH_ÅR*10000 + OPPH_MN * 100 + OPPH_DAG;          
                        B02.OPPHØRSKODE(SØKER_IND,(I-1)) = 'J';                 
                     END;                                                       
                                                                                
 /* ***************************************************************** */        
 /* HER OVERFØRES BUP-GARANTI OG KODE FRA FORRIGE PERIODE             */        
 /* ***************************************************************** */        
                                                                                
                  B02.BUP_GARANTI(SØKER_IND,I) =                                
                                    B02.BUP_GARANTI(SØKER_IND,(I-1));           
                  B02.BUP_GAR_KODE(SØKER_IND,I) =                               
                                   B02.BUP_GAR_KODE(SØKER_IND,(I-1));           
                  IF (B02.BUP_GAR_KODE(SØKER_IND,I) = 'A') THEN                 
                     DO;  /* UNG UFØR SOM VENTER PÅ RETT TIL 3.5 */             
                        IF HJ_VIRK_DATO_ÅMD >= TJUEÅRSDATO_ÅMD THEN             
                           DO;         /*9811*/                                 
                              B02.BUP_GAR_KODE(SØKER_IND,I) = 'B';              
                              IF HJ_VIRK_DATO_ÅMD > 19880400  THEN              
                                 IF HJ_VIRK_DATO_ÅMD < 19910500  THEN           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.00;        
                                 ELSE                                           
                                 IF HJ_VIRK_DATO_ÅMD < 20080500  THEN           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.30;        
                                 ELSE                                           
                                 IF FNR13_Å > 1940               THEN           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.50;        
                                 ELSE                                           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.30;        
                              ELSE                                              
                              IF HJ_VIRK_DATO_ÅMD > 19870400  THEN              
                                 B02.BUP_GARANTI(SØKER_IND,I) = 2.50;           
                              ELSE                                              
                                 B02.BUP_GARANTI(SØKER_IND,I) = 2.00;           
                                                                                
                           END;                                                 
                     END; /* UNG UFØR SOM VENTER PÅ RETT TIL 3.5 */             
                                                                                
               END; /* OPPDATER FORRIGE UFØRHIST SEGMENT */                     
                                                                                
                                                                                
                         I = 7;                                                 
                   END;                                                         
                OTHERWISE                                                       
                   DO;                                                          
                                                                                
                      DIV_PARAM_OMR.REGN_1291 = ' ';    /*HL*/                  
 /* ***************************************************************** */        
 /* ALLE UFØREPERIODENE ER UTFYLT                                     */        
 /* ***************************************************************** */        
                                                                                
                      IF I = 7 THEN              /*0697 HL*/                    
                         DO;                                                    
                                                                                
 /* ***************************************************************** */        
 /* FEIL, ALLE UFØREPERIODENE ER UTFYLT, IKKE PLASS TIL EN TIL        */        
 /* ***************************************************************** */        
                                                                                
  L279:                                                                         
                            FEIL_VED_LABEL = '279';                             
                            FEIL_MELD_NR   = 1715;                              
                            GO TO RETUR;                                        
                         END;                                                   
                 END;                                                           
               END;                                                             
          END;                                                                  
                                                                                
            IF (U3S.REAKTIVISERING = 'X') THEN                                  
               B02.UFØRPENS.REAKTIVISERING(SØKER_IND) = ' ';                    
            IF (U3S.REAKTIVISERING = 'S') THEN                                  
               B02.UFØRPENS.REAKTIVISERING(SØKER_IND) = 'J';                    
                                                                                
 /* ***************************************************************** */        
 /* HVIS SPESIELLE OPPLYSNINGER - FLYTTET ETTER OPPDAT AV UFHIST 9904 */        
 /* ***************************************************************** */        
                                                                                
    B02.SPESOPPL(SØKER_IND) = '';                                               
    B02.EØSINFO (SØKER_IND) = '';                                               
                                                                                
    IF (U3S.NORSK_BOSATT = 'N') THEN                                            
       DO;  /* IKKE NORSK BOSATT */                                             
          IF U3SP.TT_F67           = 0         &                                
             U3SP.TT_E66_Å         = 0         &                                
             U3SP.TT_E66_M         = 0         &                                
             U3SP.TT_KONVENSJON_ÅR = 0         &                                
             U3SP.TT_FRA1937_ÅR    = 0         &                                
             U3SP.TT_FRA1937_MND   = 0        THEN                              
             DO;                                                                
 /* ***************************************************************** */        
 /* KARI SANNESS 27.1.94 : HVIS DET IKKE ER FYLT UT NOE OM TRYGDETID, */        
 /*                        SÅ SKAL GAMMEL TT BRUKES                   */        
 /* ***************************************************************** */        
                                                                                
                IF B02.TT_16_66(SØKER_IND) = 0         THEN                     
 /*TT_16_66 REGNES BARE UT DERSOM DEN IKKE FINNES FRA FØR -9904*/               
                B02.TT_16_66(SØKER_IND) = B02.TT_ANV(SØKER_IND) * 12            
                                        - B02.TT_FRAMT(SØKER_IND);              
                B02.TT_FØR_1967(SØKER_IND) = 0;                                 
                B02.TT_ETTER_1966(SØKER_IND) = 0;                               
                B02.TT_67_TIL_70 (SØKER_IND) = 0;                               
 /* REDUSERT ANTALL FREMTIDIGE BUP-ÅR MÅ OGSÅ AJOURFØRES-9904*/                 
                IF UF_IND > 1       THEN                                        
                   IF B02.REDUSERT_ANT_BUP_ÅR                                   
                               (SØKER_IND,(UF_IND - 1)) > 0 THEN                
                DO;                                                             
     /* TEST ***************************************** */                       
                   DCL REDUSERT_FØR      FIXED DEC (7);                         
                   DCL REDUSERT_ETTER    FIXED DEC (7);                         
                   DCL GAMMELT_UFÅR      FIXED DEC (5);                         
                   DCL SISTE_UFÅR        FIXED DEC (5);                         
                   REDUSERT_FØR =                                               
                   B02.REDUSERT_ANT_BUP_ÅR(SØKER_IND,(UF_IND-1));               
                   GAMMELT_UFÅR   =                                             
                     B02.UFT_ÅMD(SØKER_IND,(UF_IND - 1)) /10000;                
                   SISTE_UFÅR     =                                             
                     B02.UFT_ÅMD(SØKER_IND,UF_IND) / 10000;                     
                                                                                
                   REDUSERT_ETTER =                                             
                   B02.REDUSERT_ANT_BUP_ÅR(SØKER_IND,(UF_IND-1)) +              
                       GAMMELT_UFÅR                              -              
                       SISTE_UFÅR;                                              
                                                                                
                   B02.REDUSERT_ANT_BUP_ÅR(SØKER_IND,UF_IND) =                  
                      REDUSERT_ETTER;                                           
    /*TEST HIT ****************************************** */                    
                END;                                                            
             END;                                                               
          ELSE /*TRYGDETID ER DA FYLT UT : */                                   
             DO;                                                                
                IF (B01.TT_ANV(SØKER_IND) = 40)         &                       
                   (U3SP.TT_ENDRES ^= 'J')              THEN                    
                   DO;                                                          
  L280:  /*NY TEST 200308 HL */                                                 
                       FEIL_VED_LABEL = '280';                                  
                       FEIL_MELD_NR   = 1829;                                   
                       GO TO RETUR;                                             
                    END;                                                        
                B02.TT_16_66(SØKER_IND)                                         
                   = U3SP.TT_FRA1937_ÅR * 12 + U3SP.TT_FRA1937_MND;             
                B02.TT_FØR_1967(SØKER_IND) = U3SP.TT_F67;                       
                B02.TT_ETTER_1966(SØKER_IND)                                    
                   = U3SP.TT_E66_Å * 12 + U3SP.TT_E66_M;                        
                B02.TT_GARANTI (SØKER_IND) = 0;        /*17.1.94HL */           
                IF (U3SP.TT_KONVENSJON_ÅR > 0) THEN                             
                   B02.TT_16_66(SØKER_IND)                                      
                      = U3SP.TT_KONVENSJON_ÅR * 12;                             
                ELSE                                                            
             /*REGN TT_FRAMT*/                                                  
                                                                                
 /* FJERNET NESTE TEST 0994 HL : */                                             
                                                                                
  /*      IF B02.TT_16_66(SØKER_IND) = 0          THEN                          
             B02.TT_FRAMT(SØKER_IND) =                                          
                    (ALDER_67.ÅR * 12) - (HJ_Å * 12 + HJ_M -1);                 
          ELSE    */                                                            
                   DO;/*FRAVIK FLYKT GAV RED ANT BUP ÅR. TRUDE 100992*/         
                      IF  U3SP.FRAVIK_FLYKT = 'J'      !                        
                          (B02.TT_16_66(SØKER_IND) =  0  &                      
                           B02.UFØRPENS.STI_ÅMD(SØKER_IND) = 0 ) THEN           
                         IF B02.PENSJONSRETT_FØR_91(SØKER_IND)='J' THEN         
                            B02.STATUS.TT_FRAMT(SØKER_IND)                      
                               = (ALDER_67.ÅR * 12 + ALDER_67.MND)              
                               - (HJ_Å * 12 + HJ_M);                            
                         ELSE                                                   
                            B02.STATUS.TT_FRAMT(SØKER_IND)                      
                               = (ALDER_67.ÅR * 12)                             
                               - (HJ_Å * 12 + HJ_M);                            
                      ELSE                                                      
                         B02.STATUS.TT_FRAMT(SØKER_IND)                         
                            = F_BEREGN_TT_FRAMT_UTLAND                          
                                 ((B02.FNR(SØKER_IND)),                         
                                  (HJ_ÅMD_FIX),                                 
                                   SØKER_IND);                                  
                   END;                                                         
                                                                                
             END;                                                               
          IF B02.TT_16_66(SØKER_IND) > 480     THEN                             
             B02.TT_16_66(SØKER_IND) = 480;                                     
                                                                                
          /* TILLEGGSTEST 210994 HL : */                                        
                                                                                
          IF U3SP.TT_F67_EK > 0       THEN                                      
             B02.TT_FØR_1967  (EKTEF_IND) = U3SP.TT_F67_EK;                     
                                                                                
          IF U3SP.TT_E66_Å_EK > 0     THEN                                      
             B02.TT_ETTER_1966(EKTEF_IND) = U3SP.TT_E66_Å_EK * 12 +             
                                            U3SP.TT_E66_M_EK;                   
                                                                                
          B02.SPESOPPL.STATSBORGER(SØKER_IND)   = U3SP.STATSBORGER;             
          B02.SPESOPPL.BOSATT(SØKER_IND)        = U3SP.BOSATT;                  
       B02.SPESOPPL.PENSJONSTRYGDET(SØKER_IND) = U3SP.PENSJONSTRYGDET;          
          B02.SPESOPPL.MINST_20ÅR_BOTID(SØKER_IND) = U3SP.MINST_20_ÅR;          
          B02.SPESOPPL.FRAVIK_BOSATT_KONVENSJON(SØKER_IND) =                    
                                                     U3SP.KONVENSJON;           
          B02.SPESOPPL.FRAVIK_FLYKTN(SØKER_IND) = U3SP.FRAVIK_FLYKT;            
          IF U3SP.OVERKOMP_UTL = 'J'             THEN                           
             B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = 'J';                       
          ELSE                                                                  
             B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = 'N';                       
          B02.SPESOPPL.IKKE_GP      (SØKER_IND) = U3SP.IKKE_GP;                 
          B02.SPESOPPL.KONVENSJON(SØKER_IND) =  U3SP.BEREGNING_KONV;            
    /*NY U3 9802 HL : */                                                        
                                                                                
          IF U3SP.UNNTAK_12_2   = 'J'           THEN                            
             B02.SPESOPPL.UNNTAK_12_2(SØKER_IND)  =  'J';                       
                                                                                
          IF U3SP.STI_ÅMD_3B > 0         THEN                                   
             B02.UFØRPENS.STI_ÅMD(SØKER_IND) =    (U3SP.STI_ÅMD_3B);            
                                                                                
          B02.SPESOPPL.FRAVIK_8_1(SØKER_IND) = U3SP.FRAVIK_8_1;                 
          IF U3SP.TT_PÅ     = 'J'    !                                          
             U3SP.TT_LIK_PÅ = 'J'          THEN                                 
             DO;                                                                
                B02.SPESOPPL.TT_PÅ     (SØKER_IND) = 'J';                       
             END;                                                               
          B02.SPESOPPL.TT_FRAMTIDIG (SØKER_IND) = U3SP.TT_FRAMTIDIG;            
          B02.SPESOPPL.TT_FAKTISK   (SØKER_IND) = U3SP.TT_FAKTISK;              
  /*      B02.SPESOPPL.FRAVIK_5_1(SØKER_IND) = U3SP.FRAVIK_5_1;  */             
          B02.SPESOPPL.UNG_UFØR  (SØKER_IND) = U3SP.UNG_UFØR;                   
                                                                                
 /*TILLEGG 0196 HL : */                                                         
                                                                                
          B02.TT_NORDISK_FAKT_MND (SØKER_IND)                                   
             = ((U3EØS.TT_FAKTISK_NORDISK_ÅR * 12)                              
             + U3EØS.TT_FAKTISK_NORDISK_MND);                                   
          B02.PÅ_NORDISK_FAKT(SØKER_IND)                                        
             = U3EØS.PÅ_FAKTISK_NORDISK;                                        
          IF ( B02.TT_NORDISK_FAKT_MND(SØKER_IND)                               
              +B02.PÅ_NORDISK_FAKT(SØKER_IND)    > 0 ) THEN                     
             B02.NORDISK_KONVENSJON(SØKER_IND) = 'J';                           
                                                                                
          /* TILLEGG 181000 MARTIN (DENNE VAR GLEMT ) */                        
          B02.SPESOPPL.FRAVIK_19_3(SØKER_IND) = U3SP.FRAVIK_19_3;               
                                                                                
          /* FJERNET APRIL 2004 - MARTIN - FRA HER */                           
       /* B02.GP_ART13_VIRKDATO_ÅMD(SØKER_IND)                                  
             = U3SP.GP_VIRK_NORDISK_ÅMD                                         
                                                                                
           B02.TP_ART15_VIRKDATO_ÅMD(SØKER_IND)                                 
             = U3SP.TP_VIRK_NORDISK_ÅMD                                         
          /* FJERNET APRIL 2004 - MARTIN - TIL HIT */                           
  /*EØS : */                                                                    
          B02.KONVENSJON_LAND(SØKER_IND) = U3SP.KONVENSJON_LAND;                
          B02.FRAVIK_BOSATT_EØS(SØKER_IND) = U3SP.FRAVIK_BOSATT_EØS;            
          B02.TP_NORDISK       (SØKER_IND) = U3SP.TP_NORDISK;                   
          B02.TP_NORDISK_LAND  (SØKER_IND) = U3SP.TP_NORDISK_LAND;              
          B02.TT_KONVENSJON_ÅR  (SØKER_IND) = U3SP.TT_KONVENSJON_ÅR;            
  /*EØSINFO : */                                                                
          /* -------------------------------------------------------- */        
          IF (B02.PENSJONSTYPE2(SØKER_IND) = 'A') THEN                          
             DO;                                                                
                B02.BEREGN_FOLKETRYGD(SØKER_IND) = 'J';                         
                B02.EØS_8_4_3A(SØKER_IND)        = U3S.VILKÅR_8_4_3A;           
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                B02.BEREGN_FOLKETRYGD(SØKER_IND)                                
                   = U3EØS.BEREGN_FOLKETRYGD;                                   
                B02.EØS_8_4_3A(SØKER_IND)                                       
                   = U3EØS.EØS_8_4_3A;                                          
             END;                                                               
          /* 3.18 */                                                            
          B02.TT_PRO_RATA_MND(SØKER_IND)                                        
             = U3EØS.TT_PRORATA_EØS_MND                                         
             + (U3EØS.TT_PRORATA_EØS_ÅR * 12);                                  
                                                                                
          /* 3.17 */                                                            
          B02.TT_TEORETISK_EØS_MND(SØKER_IND) =                                 
                    U3EØS.TT_TEORETISK_EØS_MND                                  
                 + (U3EØS.TT_TEORETISK_EØS_ÅR * 12);                            
                                                                                
          IF ( B02.TT_PRO_RATA_MND(SØKER_IND)                                   
              +B02.TT_TEORETISK_EØS_MND(SØKER_IND)>0) THEN                      
             B02.PRO_RATA_BEREGNING(SØKER_IND) = 'J';                           
          /* 3. 19 */                                                           
          B02.PENSJON_EØS (SØKER_IND)  = U3EØS.PENSJON_EØS;                     
                                                                                
          /* -------------------------------------------------------- */        
          /* 3.16 POENGÅR I EØSOMRÅDET                                */        
          /* -------------------------------------------------------- */        
          DO I = LBOUND(B02.INNTEKTSÅR_EØS,2) TO                                
                 HBOUND(B02.INNTEKTSÅR_EØS,2);                                  
             B02.INNTEKTSÅR_EØS(SØKER_IND,I) = '0'B;                            
          END;                                                                  
          DO I = 1 TO HBOUND(U3EØS.TAB_EØS);                                    
             IF (U3EØS.EØS_ÅR(I)>0) THEN                                        
                B02.INNTEKTSÅR_EØS(SØKER_IND,U3EØS.EØS_ÅR(I)) = '1'B;           
          END;                                                                  
                                                                                
          /* -------------------------------------------------------- */        
          /* 3.17 POENGÅR IKKE PRO RATA                               */        
          /* -------------------------------------------------------- */        
          DO I = LBOUND(B02.EØS_ÅR_IKKE_PRO_RATA,2) TO                          
                 HBOUND(B02.EØS_ÅR_IKKE_PRO_RATA,2);                            
             B02.EØS_ÅR_IKKE_PRO_RATA(SØKER_IND,I) = '0'B;                      
          END;                                                                  
          DO I = 1 TO HBOUND(U3EØS.IKKE_PRO_TAB);                               
             IF (U3EØS.EØS_ÅR_IKKE_PRO_RATA(I) > 0) THEN                        
                B02.EØS_ÅR_IKKE_PRO_RATA                                        
                   (SØKER_IND,U3EØS.EØS_ÅR_IKKE_PRO_RATA(I)) = '1'B;            
          END;                                                                  
       END;                                                                     
                                                                                
    ELSE                                                                        
       B02.STATUS.TT_FRAMT(SØKER_IND) =                                         
           (ALDER_67.ÅR * 12) - (HJ_Å * 12 + HJ_M);                             
                                                                                
    IF B02.STATUS.TT_FRAMT(SØKER_IND) < 0           THEN                        
       B02.STATUS.TT_FRAMT(SØKER_IND) = 0;                                      
    IF B02.STATUS.TT_FRAMT(SØKER_IND) > 480         THEN                        
       B02.STATUS.TT_FRAMT(SØKER_IND) = 480;   /*HL 0196*/                      
                                                                                
              /* NY 93 */                                                       
    IF B02.BOSATT(SØKER_IND)         > 0 &                      /*93*/          
       B02.VIRK_DATO_ÅMD(SØKER_IND)  > 19921200 &               /*93*/          
       B02.PENSJONSTRYGDET(SØKER_IND)         ^= 'J' THEN       /*93*/          
         DO;                                                    /*93*/          
           IF (B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) = 'B' !   /*93*/          
               B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) = 'E' ) & /*93*/          
               B02.SPESOPPL.UNG_UFØR    (SØKER_IND)  ^= 'J' THEN                
            DO;                                                                 
               DO M = 1 TO HBOUND(B02.UFØRHIST,2);                              
                  B02.BUP_GAR_KODE(SØKER_IND,M) = ' ';                          
                  B02.BUP_GARANTI(SØKER_IND,M) = 0;                             
               END;                                                             
               DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = 'J';                           
            END;                                                /*93*/          
            B01.GT_LOV92(SØKER_IND)  = 0;                       /*93*/          
            B02.GT_LOV92(SØKER_IND)  = 0;                       /*93*/          
                                                                                
      /*    IF B01.UFØRPENS.STI_ÅMD(SØKER_IND) > 0  !                           
               B02.UFØRPENS.STI_ÅMD(SØKER_IND) > 0  THEN MHA7339*/              
            /* NY TEST EØS-REGLER ?? */                                         
            IF (B01.UFØRPENS.STI_ÅMD(SØKER_IND) > 0  !                          
                B02.UFØRPENS.STI_ÅMD(SØKER_IND) > 0  ) &                        
               ^(B02.MINST_20ÅR_BOTID(SØKER_IND)         = 'J' !                
                 B02.FRAVIK_BOSATT_EØS(SØKER_IND)        = 'J' !                
                 B02.FRAVIK_5_1(SØKER_IND)               = 'J' !                
                 B02.FRAVIK_BOSATT_KONVENSJON(SØKER_IND) = 'J' !                
                 B02.FRAVIK_8_1(SØKER_IND)               = 'J' ) THEN           
             DO;                                                                
               B02.SUM_YTELSE(SØKER_IND)     = 0;                               
               CALL UFØREPENSJON_OPPHØRER;             /*R0019940*/             
        /*                                                                      
               CALL P900_NOR_DATA((B01.FNR(SØKER_IND)),                         
                                  (B01.TKNR(SØKER_IND)));                       
        */                                                                      
             END;                                                               
         END;                                                   /*93*/          
         /* 93 */                                                               
                                                                                
    IF B01.PENSJONSTYPE3(SØKER_IND) = 'A' THEN                                  
       B01.UFØRHIST(SØKER_IND,K) =                                              
                                   B00.UFØRHIST(SØKER_IND,K);                   
                                                                                
 /* ***************************************************************** */        
 /* SØKEREN HAR ATTFØRING FRA FØR.SS = NS OG NS BLIR FJERNET.         */        
 /* ***************************************************************** */        
                                                                                
    IF U3S.ATT_UF = 'A' THEN                                                    
       IF (STATUS_TYPE = 'B' &                                                  
          TRANS_LISTE_INDEX > 1)  THEN                                          
          IF( B01.PENSJONSTYPE1(SØKER_IND)  = 'U' !                             
              B01.PENSJONSTYPE1(SØKER_IND)  = 'Y'   ) &   /*200003*/            
             B01.PENSJONSTYPE3(SØKER_IND) ^= 'A' THEN                           
             DO;                                                                
                B02                         = B01                  ;            
                B01 = '';                                                       
                B00 = '';                                                       
             END;                                                               
                                                                                
 /* ***************************************************************** */        
 /* VERNEPLIKTOPPLYSNINGER                                            */        
 /* ***************************************************************** */        
                                                                                
    DO I = 1 TO HBOUND(U3S.VP_TAB) WHILE (U3S.VP_ÅR(I) > 0);                    
       B02.VERNEPLIKTÅR(SØKER_IND,I) = U3S.VP_ÅR(I);                            
    END;                                                                        
                                                                                
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /* YRKESSKADEOPPLYSNINGER.  ERIK 2.7.87.                             */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
    B02.GARANTI_YRKEGRAD(SØKER_IND) = 0;  /*9904*/                              
                                                                                
   IF U3S.YSKADE_TILLEGG = 'J' THEN                                             
                                                                                
 /*   ENDRET 20.7.89 HL - BARE KAP.8 - GRAD ER ENDRET */                        
                                                                                
      IF B01.YRKEPENS.YUG(SØKER_IND) = U3Y.YUG     &                            
         B01.UFØRPENS.UFG(SØKER_IND)^= U3S.UFG     THEN ;                       
      ELSE                                                                      
                                                                                
 /*TILLEGG 13.3.90 HL */                                                        
                                                                                
    IF B01.YRKEPENS.YUG(SØKER_IND) > U3Y.YUG     THEN                           
       DO;                                                                      
 L281:                                                                          
          FEIL_VED_LABEL = '281';                                               
          FEIL_MELD_NR   =  1737;                                               
          GO TO RETUR;                                                          
       END;                                                                     
    ELSE                                                                        
                                                                                
 /*HIT 13.3.90 HL*/                                                             
                                                                                
 DO I = 1 TO HBOUND(B02.YRKEHIST,2);                                            
    YUF_IND = I;                                                                
 SELECT;                                                                        
    WHEN (B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) =                                  
                           (U3S.UFT_ÅMD))                                       
       DO;                                                                      
          B02.YRKEHIST.YUG(SØKER_IND,I)    = U3Y.YUG;                           
  /*0496 HL - ET EVT. OPPHØR ÅMD SLETTES : */                                   
          B02.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,I) = 0;                          
          B02.YRKEHIST.OPPH_KODE(SØKER_IND,I) = ' ';                            
          I = 7;                                                                
       END;                                                                     
    WHEN (B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) = 0)                               
       DO;                                                                      
          B02.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) =                                  
                                (U3S.UFT_ÅMD);                                  
          B02.YRKEHIST.YUG(SØKER_IND,I)    = U3Y.YUG;                           
                                                                                
          IF (I > 1)  & (B01.YRKEHIST.OPPH_DATO_ÅMD                             
                   (SØKER_IND,(I-1)) = 0 ) THEN                                 
             DO;                                                                
                                                                                
                B02.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,(I-1)) =                   
                             OPPH_ÅR*10000 + OPPH_MN * 100 + OPPH_DAG;          
                B02.YRKEHIST.OPPH_KODE(SØKER_IND,(I-1)) = 'J';                  
                                                                                
                DO J = 1 TO HBOUND(B02.YRKEGRAD,3) WHILE                        
                   (B02.YUG_ØVRIGE(SØKER_IND,(I-1),J) > 0);                     
                                                                                
                   IF B02.YUG_DATO_ÅMD(SØKER_IND,(I-1),J) =                     
                      B02.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) THEN                   
                      DO;                                                       
                         B02.YUG_ØVRIGE(SØKER_IND,(I-1),J) = 0;                 
                         B02.YUG_DATO_ÅMD(SØKER_IND,(I-1),J)= 0;                
                         B01.YUG_ØVRIGE(SØKER_IND,(I-1),J) = 0;                 
                         B01.YUG_DATO_ÅMD(SØKER_IND,(I-1),J)= 0;                
                      END;                                                      
                   IF B02.YUG_DATO_ÅMD(SØKER_IND,(I-1),J) >                     
                      B02.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) THEN                   
                      DO;                                                       
  /*  ********************************************* */                          
  /*  Y-UFØRETIDSPUNKT LIGGER FØR OPPHØRSTI_ÅMDDSPUNKT */                       
  /*  ********************************************* */                          
                                                                                
                                                                                
        L282:                                                                   
                         FEIL_VED_LABEL = '282';                                
                         FEIL_MELD_NR   =  1711;                                
                         GO TO RETUR;                                           
                      END;                                                      
                END;                                                            
        /*   I = 5    TRUDE */                                                  
          END;                                                                  
             I = HBOUND(B01.YRKEHIST,2);                                        
       END;                                                                     
    OTHERWISE                                                                   
       DO;                                                                      
          IF I = HBOUND(B01.YRKEHIST,2) THEN                                    
                                                                                
  /*  ********************************************* */                          
  /*  ALLE PERIODENE UTFYLT.  IKKE MER PLASS.       */                          
  /*  ********************************************* */                          
                                                                                
 L283:                                                                          
             DO;                                                                
                FEIL_VED_LABEL = '283';                                         
                FEIL_MELD_NR   =  1810;                                         
                GO TO RETUR;                                                    
             END;                                                               
       END;                                                                     
 END; /*SELECT*/                                                                
 END;    /*DO I= 1 TO 5*/                                                       
                                                                                
  IF U3S.YSKADE_TILLEGG = 'J' THEN                                              
                                                                                
 /*YS ENDRET 20.7.89 HL - BARE KAP.8 - GRAD ER ENDRET */                        
                                                                                
    IF B01.YRKEPENS.YUG(SØKER_IND) = U3Y.YUG     &                              
       B01.UFØRPENS.UFG(SØKER_IND)^= U3S.UFG     THEN ;                         
    ELSE                                                                        
    DO;                                                                         
       B02.YRKEPENS.YUG(SØKER_IND) = U3Y.YUG;                                   
       B02.YRKEHIST.YST_ÅMD(SØKER_IND,YUF_IND) =                                
                                          (U3Y.YST_ÅMD);                        
       B02.YRKEHIST.AÅI(SØKER_IND,YUF_IND) = U3Y.AÅI;                           
       B02.YRKEHIST.YRKE11(SØKER_IND,YUF_IND) = U3Y.YRKE11;                     
       B02.YRKEHIST.VILKÅR_1_2_2(SØKER_IND,YUF_IND)=                            
                          U3Y.VILKÅR_1_2_2A !! U3Y.VILKÅR_1_2_2B;               
       B02.YRKEHIST.KAP_11_7_UTLØST(SØKER_IND,YUF_IND) =                        
                                             U3Y.KAP_11_7_UTLØST;               
       B02.YRKEPENS.YSYKDOM(SØKER_IND) = U3Y.YSYKDOM   ;                        
       DIV_PARAM_OMR.YSYKDOM        = U3Y.YSYKDOM        ;                      
 /* ***************************************************************** */        
 /*YS - VI SKAL AVVISE :  1) NY YRKESSKADE FOR EN SOM HAR Y FRA FØR   */        
 /*YS                     2) ENGANGSUTLØSNING FOR EN SOM HAR UFØRHIST */        
 /*YS                                                                 */        
 /* ***************************************************************** */        
                                                                                
                                                                                
   /*  IF B01.PENSJONSTYPE1(SØKER_IND) = 'Y'      &                             
          YUF_IND                      > 1        &                             
          B02.YRKEHIST.YST_ÅMD(SØKER_IND,YUF_IND) ^=                            
          B02.YRKEHIST.YST_ÅMD(SØKER_IND,YUF_IND-1) THEN                        
                                                                                
          DO;                                                                   
 L284:                                                                          
             FEIL_VED_LABEL = '284';                                            
             FEIL_MELD_NR   = 1728;                                             
             GO TO RETUR;                                                       
          END;    */                                                            
                                                                                
                                                                                
       IF (B01.PENSJONSTYPE1(SØKER_IND) = 'Y'      !                            
           B01.PENSJONSTYPE1(SØKER_IND) = 'U'  )   &                            
          U3Y.KAP_11_7_UTLØST ^= ' '             THEN                           
                                                                                
          DO;                                                                   
 L285:                                                                          
             FEIL_VED_LABEL = '285';                                            
             FEIL_MELD_NR   = 1729;                                             
             GO TO RETUR;                                                       
          END;                                                                  
    END;                                                                        
                                                                                
  /*RULLERING AV INNTEKTER - 9802 HL : */                                       
    IF B02.FORVENTET(SØKER_IND) > 0          THEN                               
       CALL RULL_FORVENTET(B02.G_DATO_ÅMD(SØKER_IND),                           
                           B02.VIRK_DATO_ÅMD(SØKER_IND),                        
                           B02.FORVENTET(SØKER_IND));                           
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT(SØKER_IND) > 0  THEN                           
       B02.FORSI.PENSJONSINNTEKT(SØKER_IND) =                                   
           F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                              
                 B02.VIRK_DATO_ÅMD(SØKER_IND),                                  
                 B02.FORSI.PENSJONSINNTEKT(SØKER_IND));                         
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) > 0  THEN                            
       B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) =                                    
           F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                              
                 B02.VIRK_DATO_ÅMD(SØKER_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT(SØKER_IND));                          
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) > 0  THEN                        
       B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) =                                
           F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                              
                  B02.VIRK_DATO_ÅMD(SØKER_IND),                                 
                  B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND));                     
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) > 0  THEN                         
       B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) =                                 
           F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                              
                 B02.VIRK_DATO_ÅMD(SØKER_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND));                       
                                                                                
 /* RULLERING AV EKTEFELLES INNTEKTER - 9802 HL */                              
 IF EKTEF_IND > 0   THEN                                                        
  DO;                                                                           
    IF B02.ALDERSP.FAI(EKTEF_IND) > 0   THEN                                    
       CALL RULL_FAI(B02.G_DATO_ÅMD(EKTEF_IND),                                 
                     B02.VIRK_DATO_ÅMD(EKTEF_IND),                              
                     B02.ALDERSP.FAI(EKTEF_IND));                               
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) > 0  THEN                           
       B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) =                                   
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.PENSJONSINNTEKT(EKTEF_IND));                         
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) > 0  THEN                            
       B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) =                                    
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND));                          
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) > 0  THEN                        
       B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) =                                
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                  B02.VIRK_DATO_ÅMD(EKTEF_IND),                                 
                  B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND));                     
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) > 0  THEN                         
       B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) =                                 
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND));                       
 END;                                                                           
                                                                                
                                                                                
  RETUR:                                                                        
   END AJOURFØR_B02_MED_U3TRANS;                                                
