 /*   SIST ENDRET PÅ PROD   2005.06.24 12.44.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.09.03 12.27.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.08.02 10.06.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.05.14 13.45.37 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.04.22 11.32.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.09  8.57.11 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.09.13 11.56.39 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.02.09  8.52.32 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.07 13.00.14 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.05.25  8.44.34 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.05.24 12.58.52 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.17 12.07.15 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.10 14.33.22 AV   JDA7339          */        
 /*       SIST ENDRET 18/03-99 09.16.18 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.13.18 AV   JDA7339                  */        
 /*       SIST ENDRET 23/02-99 13.39.33 AV   JDA7339                  */        
 /*       SIST ENDRET 23/02-99 13.38.23 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.40.56 AV   JDA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014135 - TIDLIGERE_ARBEIDSINNTEKT - INTERN PROC I PLI.       */        
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */        
 /*    ENDRET JULI 82 AV KARIN                                        */        
 /*    ENDRET AUGUST 1988 AV TRUDE PGA AFP                            */        
 /*    ENDRET NOVEMBER 1988 AV TRUDE PGA  ENDRING I REGLER FRA 0189.  */        
 /*                         TIDLIGERE ARBEIDSINNTEKT SKAL REGNES FRA  */        
 /*                         59.ÅRET FOR DE SOM HAR UTTAKSDATO         */        
 /*                         >= 8901.                                  */        
 /*    ENDRET 9.1.88 HL :   NY REGEL GJELDER BARE PERSONER FøDT       */        
 /*                         I 1922 ELLER SENERE                       */        
 /*    ENDRET  260796 TS:   BRUKE POREKKE FOR Å FINNE RIKTIG BUP      */        
 /*                         DERSOM TIDLIGERE UFØR.                    */        
 /*HENSIKT:                                                           */        
 /*    PROGRAMMET BEREGNER TIDLIGERE ARBEIDSINNTEKT PÅ GRUNNLAG AV    */        
 /*    PI I B02, GV-TAB OG G.                                         */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR INKLUDERT I FØLGENDE MODULER :                 */        
 /*      4001 (4010)                                                  */        
 /*      4101 (4126)                                                  */        
 /*      4201                                                         */        
 /*      4251                                                         */        
 /*      4270                                                         */        
 /*      7001 LAGXSB                                                  */        
 /*BRUK:                                                              */        
 /*    CALL TIDLIGERE_ARBEIDSINNTEKT(W_TAI,W_BRP)                     */        
 /* ***************************************************************** */        
 TIDLIGERE_ARBEIDSINNTEKT: PROC(W_TAI,W_BRP);                                   
    /* PARAMETERE INN */                                                        
    DCL W_TAI              FIXED DEC(7),                                        
        W_BRP              FIXED DEC(7,2);                                      
    /* INTERNE VARIABLER */                                                     
    %INCLUDE P0019980; /* FØDSELSNUMMER DEFINISJONER */                         
    DCL                                                                         
        AFP_BUP(56:63)     FIXED DEC (5,2) INIT ((*)0),                         
        BUP_TIL_BRP(56:63) FIXED DEC (5,2) INIT ((*)0),                         
        BRP(56:65)         FIXED DEC (5,2) INIT ((*)0),                         
        BRP_92(3)          FIXED DEC (5,2) INIT ((*)0),                         
        HJ_TAB(5)          FIXED DEC (5,2) INIT ((*)0),                         
        TOLV               FIXED DEC (3  ) INIT (12),                           
        FIRE_G             FIXED DEC (3  ) INIT (4),                            
        EN                 FIXED DEC (3  ) INIT (0),                            
        TO                 FIXED DEC (3  ) INIT (0),                            
        TRE                FIXED DEC (3  ) INIT (0),                            
        FIRE               FIXED DEC (3  ) INIT (0),                            
        FEM                FIXED DEC (3  ) INIT (0),                            
        DIVISOR            FIXED DEC (3  ) INIT (0),                            
        START              FIXED DEC (5  ) INIT (0),                            
        I                  FIXED BIN (15 ) INIT (0),                            
        I_Å                FIXED BIN (15 ) INIT (0),                            
        J                  FIXED DEC ( 5 ) INIT (0),                            
        K                  FIXED DEC ( 5 ) INIT (0);                            
                                                                                
    DCL UTTAKSDATO_ÅMD_PIC  PIC '(8)9';                                         
    DCL 1 UTTAKSDATO DEF UTTAKSDATO_ÅMD_PIC,                                    
          2 ÅR       PIC '(4)9',                                                
          2 MND      PIC '(2)9',                                                
          2 DAG      PIC '(2)9';                                                
                                                                                
    DCL                                                                         
       (LBOUND,                                                                 
        HBOUND) BUILTIN;                                                        
                                                                                
    /* NULLSTILLING AV ALLE VARIABLER HER =========================== */        
                                                                                
    W_BRP = 0;                                                                  
    W_TAI = 0;                                                                  
    DO I=LBOUND(BUP_TIL_BRP,1) TO HBOUND(BUP_TIL_BRP,1);                        
       BUP_TIL_BRP(I) = 0;                                                      
    END;                                                                        
    DO I=LBOUND(BRP,1) TO HBOUND(BRP,1);                                        
       BRP(I) = 0;                                                              
    END;                                                                        
    DO I=LBOUND(BRP_92,1) TO HBOUND(BRP_92,1);                                  
       BRP_92(I) = 0;                                                           
    END;                                                                        
    DO I=LBOUND(HJ_TAB,1) TO HBOUND(HJ_TAB,1);                                  
       HJ_TAB(I) = 0;                                                           
    END;                                                                        
    TOLV = 12;                                                                  
    FIRE_G = 4;                                                                 
    EN = 0;                                                                     
    TO = 0;                                                                     
    TRE = 0;                                                                    
    FIRE = 0;                                                                   
    FEM = 0;                                                                    
    DIVISOR = 0;                                                                
    START = 0;                                                                  
    I = 0;                                                                      
    I_Å = 0;                                                                    
    J = 0;                                                                      
    K = 0;                                                                      
    W_FNR = B02.FNR(BER_SØ_IND);                                                
    W_FNR_13    = KONV_FNR11_FNR13(W_FNR);                                      
    /* -------------------------------------------------------------- */        
    /* BENYTTES FOR Å FASTSLÅ TIDLIGERE ERVERVSINNTEKT FOR AFP        */        
    /* -------------------------------------------------------------- */        
    IF (W_FNR_R13.ÅR > 1921) THEN                                               
       EN = 59;                                                                 
    ELSE                                                                        
       EN = 61;                                                                 
                                                                                
    UTTAKSDATO_ÅMD_PIC = B02.ALDERSP.UTTAKSDATO_ÅMD(BER_SØ_IND);                
    IF (B02.PENSJONSTYPE1(BER_SØ_IND) = 'K'       !                             
        B02.ALDERSP.KONV_P_KODE(BER_SØ_IND) = 'K' ) THEN                        
       IF (B02.ALDERSP.UTTAKSDATO_ÅMD(BER_SØ_IND) >= 20000800) THEN             
          EN = UTTAKSDATO.ÅR - 6 - W_FNR_R13.ÅR;                                
       ELSE                                                                     
       IF (B02.ALDERSP.UTTAKSDATO_ÅMD(BER_SØ_IND) >= 19971000) THEN             
          EN = 56;                                                              
                                                                                
    TO   =   EN + 1;                                                            
    TRE  =   TO + 1;                                                            
    FIRE =   TRE + 1;                                                           
    FEM  =   FIRE + 1;                                                          
                                                                                
    IF (W_FNR_R13.ÅR > 1902) THEN                                               
       DO;  /* BEREGN BRP */                                                    
          SELECT;                                                               
             WHEN(W_FNR_R13.ÅR > 1905) START = EN;                              
             WHEN(W_FNR_R13.ÅR = 1905) START = TO;                              
             WHEN(W_FNR_R13.ÅR = 1904) START = TRE;                             
             WHEN(W_FNR_R13.ÅR = 1903) START = FIRE;                            
             OTHER;                                                             
          END; /* SELECT */                                                     
       /* IF (B02.ALDERSP.UTTAKSDATO_ÅMD(BER_SØ_IND) >= 20000800) THEN          
             START = TRE; */                                                    
          DO I = START TO FEM;                                                  
             I_Å = I + W_FNR_R13.ÅR;                                            
             /*                                                                 
             BRP(I) = B02.PI(BER_SØ_IND,I_Å)  / G_V(I_Å) + 0.005;               
             REMEDY 501 */      /*200504: */                                    
             IF ((B02.PI(BER_SØ_IND,I_Å)/G_V(I_Å)+0.005)>TOLV) THEN             
                BRP(I)=TOLV;                                                    
             ELSE                                                               
                BRP(I)=B02.PI(BER_SØ_IND,I_Å)/G_V(I_Å)+0.005;                   
                                                                                
  /*LAGT INN ENDRET TOLKING AV FORSKRIFTER : */                                 
             IF (B02.PI_KODE(BER_SØ_IND,I_Å) = 'J' !                            
                 B02.PI_KODE(BER_SØ_IND,I_Å) = 'K' !                            
                 B02.PI_KODE(BER_SØ_IND,I_Å) = 'L' !                            
                 B02.PI_KODE(BER_SØ_IND,I_Å) = 'M' )  THEN                      
                 DO;                                                            
                    IF UTTAKSDATO_ÅMD_PIC  < 20000800   &                       
                      (B02.PENSJONSTYPE1(BER_SØ_IND) = 'K') THEN                
                       BRP(I) = BRP(I) + FIRE_G;                                
                    ELSE                                                        
                    IF BRP(I) < FIRE_G    THEN                                  
                       BRP(I) = FIRE_G;                                         
                 END;                                                           
             ELSE;                                                              
             IF (BRP(I) > TOLV) THEN                                            
                BRP(I) = TOLV;                                                  
  /* HIT 1.2.2001  HL */                                                        
             W_BRP = W_BRP + BRP(I);                                            
          END; /* DO I = START TO FEM */                                        
          DIVISOR = FEM-START+1;                                                
          W_BRP = W_BRP / DIVISOR;                                              
       /* W_BRP = W_BRP / (FEM-START+1); */                                     
          IF (START < TO &                                                      
             (BRP(TRE) + BRP(FIRE) + BRP(FEM))/3 + 0.005 > W_BRP) THEN          
             W_BRP = (BRP(TRE) + BRP(FIRE) + BRP(FEM))/3 + 0.005;               
       END; /* BEREGN BRP */                                                    
                                                                                
    /* NYE REGLER FRA 0192 GJENNOMSNITT AV 3 BESTE    */                        
    /* SKAL OGSÅ TA HENSYN TIL BUP:  TS 1091          */                        
                                                                                
    IF (W_FNR_R13.ÅR > 1925      &       /* 13.03.00        */                  
        B02.KONV_P_KODE(BER_SØ_IND) ^= 'K')  !         /*NY92*/                 
       (B02.KONV_P_KODE(BER_SØ_IND)  = 'K'  &         /*NY92*/                  
        B02.UTTAKSDATO_ÅMD(BER_SØ_IND)  > 19920000) ! /*2000*/                  
       (B02.PENSJONSTYPE1(BER_SØ_IND)  = 'K'  &         /*NY92*/                
        B02.UTTAKSDATO_ÅMD(BER_SØ_IND)  > 19920000) THEN   /*2000*/             
       DO;  /* TA HENSYN TIL EVT. BUP */                                        
          DO K = 56 TO 63;                                                      
             BUP_TIL_BRP(K) = 0;                                                
          END;                                                                  
          CALL KLARGJØR_TAB; /* 4151 */                                         
          CALL LEGG_UFØREHIST_I_TAB(BER_SØ_IND,W_FNR_R13.ÅR); /* 4161 */        
                                                                                
          DO K = EN TO FEM;                                                     
             I_Å = K + W_FNR_R13.ÅR;                                            
             IF (POREKKE.UFG(BER_SØ_IND,I_Å) > 0) THEN                          
                DO;  /* POREKKE UFØREGRAD STØRRE ENN 0 */                       
                   BUP_TIL_BRP(K) = POREKKE.BUP_FPP(BER_SØ_IND,I_Å);            
                   IF (TAB.UFØR_GRAD(I_Å) > 0) THEN                             
                      DO;  /* TAB UFØREGRAD STØRRE ENN 0 */                     
                         IF (B02.BUP_GARANTI(BER_SØ_IND,1) >                    
                             BUP_TIL_BRP(K)                ) THEN               
                            BUP_TIL_BRP(K) =                                    
                               B02.BUP_GARANTI(BER_SØ_IND,1);                   
                                                                                
                         IF (B02.YRKEHIST.PAÅ(BER_SØ_IND,1) >                   
                             BUP_TIL_BRP(K)                 ) THEN              
                            BUP_TIL_BRP(K) =                                    
                               B02.YRKEHIST.PAÅ(BER_SØ_IND,1);                  
                                                                                
                         IF (I_Å > 1991) THEN                                   
                            IF (BUP_TIL_BRP(K) > 5) THEN                        
                               BUP_TIL_BRP(K) = 5 + 1 +                         
                                            ((BUP_TIL_BRP(K) - 5) * 3);         
                            ELSE                                                
                               BUP_TIL_BRP(K) = BUP_TIL_BRP(K) + 1;             
                         ELSE                                                   
                            IF (BUP_TIL_BRP(K) > 7) THEN                        
                               BUP_TIL_BRP(K) = 7 + 1 +                         
                                            ((BUP_TIL_BRP(K) - 7) * 3);         
                            ELSE                                                
                               BUP_TIL_BRP(K) = BUP_TIL_BRP(K) + 1;             
                                                                                
      /* OPPDRAG 04064: 20040421 HL :  */                                       
                         IF BUP_TIL_BRP(K) > BRP(K)    THEN                     
                            AFP_BUP(K) = BUP_TIL_BRP(K);                        
                         ELSE                                                   
                            AFP_BUP(K) = BRP(K);                                
      /* HIT */                                                                 
                         IF BUP_TIL_BRP(K) > 0 THEN                             
                            BUP_TIL_BRP(K)     =  (BUP_TIL_BRP(K) *             
                                 TAB.UFØR_GRAD(I_Å) / 100) + 0.005;             
                      END; /* TAB UFØREGRAD STØRRE ENN 0 */                     
                END; /* POREKKE UFØREGRAD STØRRE ENN 0 */                       
             IF (BUP_TIL_BRP(K) > 0)   THEN                                     
                DO;  /* BUP_TIL_BRP > 0 */                                      
                   IF (TAB.UFØR_GRAD(I_Å) > 0        &                          
                      (TAB.UFØR_PERIODE(I_Å) = 'S' !                            
                       TAB.UFØR_PERIODE(I_Å) = 'J' ) ) THEN                     
                      DO;                                                       
                   /*   IF BRP(K) < BUP_TIL_BRP(I) * 100 /                      
                               TAB.UFØR_GRAD(I_Å)  THEN                         
                           BRP(K) = BUP_TIL_BRP(I) * 100 /                      
                                   TAB.UFØR_GRAD(I_Å); */                       
                        IF UTTAKSDATO_ÅMD_PIC  > 20000700   &                   
                          (B02.PENSJONSTYPE1(BER_SØ_IND) = 'K') THEN            
                          DO;                                                   
                             IF AFP_BUP(K) > BRP(K)    THEN                     
                                BRP(K)    = AFP_BUP(K);                         
                          END;                                                  
                        ELSE                                                    
                        IF BRP(K) < BUP_TIL_BRP(K) * 100 /                      
                               TAB.UFØR_GRAD(I_Å)  THEN                         
                           BRP(K) = BUP_TIL_BRP(K) * 100 /                      
                                   TAB.UFØR_GRAD(I_Å);                          
                      END;                                                      
                   ELSE                                                         
                     DO;                                                        
                        IF UTTAKSDATO_ÅMD_PIC  > 20000700   &                   
                          (B02.PENSJONSTYPE1(BER_SØ_IND) = 'K') THEN            
                              BRP(K)    = AFP_BUP(K);                           
                        ELSE                                                    
                          BRP(K) = BRP(K) + BUP_TIL_BRP(K);                     
                     END;                                                       
                   IF (BRP(K) > 12) THEN                                        
                      BRP(K) = 12;                                              
                END; /* BUP_TIL_BRP > 0 */                                      
             HJ_TAB(K-EN+1) = BRP(K);                                           
          END; /* DO K = EN TO FEM */                                           
                                                                                
           K = 0;                                                               
           DO I = 1 TO 3;                                                       
              DO J = 1 TO 5;                                                    
                 IF HJ_TAB(J)  >  BRP_92(I)  THEN                               
                    DO;                                                         
                       BRP_92(I) = HJ_TAB(J);                                   
                       K         =  J;                                          
                    END;                                                        
              END;                                                              
              IF K > 0 THEN                                                     
                 HJ_TAB(K) = 0;                                                 
           END;                                                                 
           W_BRP  = 0;                                                          
           W_BRP = (BRP_92(1) + BRP_92(2) + BRP_92(3))/3+0.005;                 
           /* MÅ FINNE EVENTUELL BUP FOR DET 59. TOM. 63. ÅRET   */             
       END; /* TA HENSYN TIL EVT. BUP */                                        
    W_TAI = (W_BRP * G + 999) / 1000;                                           
                                                                                
    B02.AP_TEI_FAKTOR(BER_SØ_IND) = W_BRP;                                      
                                                                                
    DIV_PARAM_OMR.TAI(BER_SØ_IND)  = W_TAI * 1000;             /*NY92*/         
                                                                                
 /* W_TAI SKAL RUNDES OPP TIL NÆRMESTE HELE 1000 KR */                          
                                                                                
 END TIDLIGERE_ARBEIDSINNTEKT;                                                  
