 /*       SIST ENDRET 04/05-98 12.40.40 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/02-98 09.48.38 AV   RFA9991                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014124 - BEREGN_APD_OVERGANG_FRA_KAP10 - INTERN PROC I PLI.  */00000040
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */00000050
 /*    ENDRET AV KARIN I JULI                                         */00000060
 /*HENSIKT:                                                           */00000070
 /*    PROGRAMMET BEREGNER APD VED OVERGANP FRA KAP 10.             . */00000080
 /*PROGRAMTILKNYTNING:                                                */00000090
 /*    PROGRAMMET BLIR INKLUDERT I R0014101 - BEREGN_ETTERLATT_AP.    */00000100
 /*BRUK:                                                              */00000110
 /*    CALL BEREGN_APD_OVERGANG_FRA_KAP10;                            */00000120
 /*                                                                   */00000130
 /*ENDRET: 12.1.84. AV HERMAN.                                        */00000140
 /*        DENNE RUTINEN BRUKES BARE VED 67-ÅRSGRENSEN, OG DET ER     */00000150
 /*        DA IKKE NØDVENDIG (ELLER MULIG) Å SAMMENLIGNE MED NOEN     */00000160
 /*        TIDLIGERE ALDERSP.APD.                                     */00000170
 /*ENDRET: 14.2.84  AV HERMAN.                                        */00000180
 /*        LOVENDRING PR 1.4.84 - PROGRAMMET ER RETTET TILBAKE TIL    */00000190
 /*           OPPRINNELIG FORM + AT P67_KODE ALLTID SKAL SETTES.      */00000200
 /*ENDRET: 15.10.85 AV HERMAN.                                        */00000210
 /*        KT SKAL REGNES SOM HEL ELLER HALV I FORMELEN - IKKE SOM    */00000220
 /*        75 ELLER 25 PROSENT.                                       */00000230
 /* ***************************************************************** */00000240
 BEREGN_APD_OVERGANG_FRA_KAP10: PROC;                                   00000250
                                                                        00000260
  DCL                                                                   00000270
    W_APD_EP             FIXED DEC(3),                                  00000280
    ALDERSPENSJON        FIXED DEC(5),                                  00000290
    AP75                 FIXED DEC(5),                                  00000300
    AP50                 FIXED DEC(5),                                  00000310
    AP25                 FIXED DEC(5),                                  00000320
    ETTERLATTEPENSJON    FIXED DEC(5);                                  00000330
                                                                        00000340
    ALDERSPENSJON     = B02.ALDERSP.GP     (SØKER_IND)                  00000350
                      + B02.ALDERSP.ST     (SØKER_IND)                  00000360
                      + B02.ALDERSP.TP     (SØKER_IND)                  00000380
                      + B02.TP_BRUTTO      (SØKER_IND);                 00000390
                                                                        00000400
    AP75 = ALDERSPENSJON * 0.75                                         00000410
                      + B02.ALDERSP.KT     (SØKER_IND);                 00000420
                                                                        00000430
    ETTERLATTEPENSJON = B01.GP_NETTO    (SØKER_IND)                     00000440
                      + B01.TP_NETTO    (SØKER_IND)                     00000450
                      + B01.ETTEPENS.ST (SØKER_IND)                     00000460
                      + B01.ETTEPENS.KT (SØKER_IND)                     00000470
                                                                        00000480
                      + B01.YRKEPENS.GP  (SØKER_IND)                    00000490
                      + B01.YRKEPENS.TP  (SØKER_IND)                    00000500
                                                                        00000510
                                                                        00000530
                      + B01.UFØRPENS.GP  (SØKER_IND)                    00000540
                      + B01.UFØRPENS.ST  (SØKER_IND)                    00000550
                      + B01.UFØRPENS.ÅFT (SØKER_IND)                    00000560
                      + B01.UFØRPENS.KT  (SØKER_IND)                    00000570
                      + B01.UFØRPENS.TP  (SØKER_IND);                   00000580
                                                                        00000600
    IF AP75 < ETTERLATTEPENSJON THEN                                    00000610
      W_APD_EP = 100;                                                   00000620
                                                                        00000630
    ELSE                                                                00000640
                                                                        00000650
      DO;                                                               00000660
        AP50 = ALDERSPENSJON * 0.5                                      00000670
                      + (B02.ALDERSP.KT (SØKER_IND)) * 0.5;             00000680
                                                                        00000690
        IF AP50 < ETTERLATTEPENSJON THEN                                00000700
          W_APD_EP = 75;                                                00000710
                                                                        00000720
        ELSE                                                            00000730
                                                                        00000740
          DO;                                                           00000750
            AP25 = ALDERSPENSJON * 0.25                                 00000760
                      + (B02.ALDERSP.KT (SØKER_IND)) * 0.5;             00000770
                                                                        00000780
            IF AP25 < ETTERLATTEPENSJON THEN                            00000790
              W_APD_EP = 50;                                            00000800
                                                                        00000810
            ELSE IF ETTERLATTEPENSJON > 0 THEN                          00000820
              W_APD_EP = 25;                                            00000830
                                                                        00000840
            ELSE                                                        00000850
              W_APD_EP = 0;                                             00000860
          END;                                                          00000870
      END;                                                              00000880
                                                                        00000890
                                                                        00000910
  B02.ALDERSP.P67_KODE  (SØKER_IND) = '2';    /* KONVERTERING *//**/    00000920
                                                                        00000930
  IF B02.ALDERSP.APD(SØKER_IND) < W_APD_EP         THEN         /**/    00000940
                                                                        00000950
    DO;                                                                 00000960
                                                                        00000970
       B02.ALDERSP.APD       (SØKER_IND) = W_APD_EP;                    00000980
       B02.ALDERSP.KONV_GRAD (SØKER_IND) = W_APD_EP;                    00000990
       B02.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) =               /*2000*/   00001000
                  B02.STATUS.VIRK_DATO_ÅMD(SØKER_IND);       /*2000*/   00001010
       B02.ALDERSP.UTTAKS_APD(SØKER_IND) = W_APD_EP;                    00001020
                                                                        00001030
    END;                                                                00001040
                                                                        00001050
  ELSE                                                         /**/     00001060
    IF B02.ALDERSP.KONV_GRAD (SØKER_IND) < W_APD_EP      THEN  /**/     00001070
       B02.ALDERSP.KONV_GRAD (SØKER_IND) = W_APD_EP;           /**/     00001080
                                                                        00001090
                                                                        00001110
 END BEREGN_APD_OVERGANG_FRA_KAP10;                                     00001120
