 /*       SIST ENDRET 26/11-97 12.53.53 AV   SPA7339                  */00000000
 /* ***************************************************************  */ 00000010
 /* PROC FOR KONVERTERING AV DATO   ÅR                               */ 00000020
 /* ***************************************************************  */ 00000030
  KONV_ÅR_HÅ: PROC(IN_DATO) RETURNS(DEC FIXED(5));                      00000040
  DCL IN_DATO     PIC '(2)9';                                           00000050
  DCL UT_DATO     DEC FIXED (5);                                        00000060
  DCL 1 H_DATO,                                                         00000070
        02 ÅÅ     PIC '99'  INIT (00),                                  00000080
      1 H_DATO_IN DEF H_DATO PIC '99';                                  00000090
                                                                        00000100
  DCL 1 H_DATO_UT,                                                      00000110
        02 HH     PIC '99'  INIT (00),                                  00000120
        02 ÅÅ     PIC '99'  INIT (00),                                  00000130
      1 H_DATO_UT_PK  DEF H_DATO_UT  PIC '9999';                        00000140
                                                                        00000150
  IF IN_DATO > 0 THEN                                                   00000160
     H_DATO_IN = IN_DATO;                                               00000170
  ELSE                                                                  00000180
     H_DATO_IN = 0      ;                                               00000190
                                                                        00000200
     H_DATO_UT = H_DATO, BY NAME;                                       00000210
     IF H_DATO_IN > 40  THEN                                            00000220
            H_DATO_UT.HH = 19;                                          00000230
     ELSE                                                               00000240
            H_DATO_UT.HH = 20;                                          00000250
                                                                        00000260
     UT_DATO = H_DATO_UT_PK;                                            00000270
                                                                                
     RETURN (UT_DATO);                                                  00000320
  END KONV_ÅR_HÅ;                                                       00000330
                                                                        00000340
