 /*   SIST ENDRET PÅ PROD   2004.06.21 11.20.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.06.18 12.23.30 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.05.03 12.31.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.06.26  8.33.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.14 10.49.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.36.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.09.13 13.19.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.06.05  9.52.30 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.15.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.02.08 12.13.34 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.03  9.01.08 AV   JDA7339          */        
 /*       SIST ENDRET 20/07-98 10.03.38 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 08.58.30 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014132 - BEREGN_GP_ETTERLATT_AP - INTERN PROC I PLI.         */        
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982.                          */        
 /*    ENDRET AV KARIN I AUGUST 82                                    */        
 /*HENSIKT:                                                           */        
 /*    PROGRAMMET BEREGNER GRUNNPENSJON ALDER VED ETTERLATT.          */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR INKLUDERT I R0014121 - BEREGN_ETTERLATT_AP_DEL1*/        
 /*BRUK:                                                              */        
 /*    CALL BEREGN_GP_ETTERLATT_AP                                    */        
 /* ***************************************************************** */        
 BEREGN_GP_ETTERLATT_AP: PROC;                                                  
                                                                                
 DCL                                                                            
    GP_FAKTOR             FIXED DEC(5,4),      /*200402 HL*/                    
    TT_EGEN               FIXED DEC(3),                                         
    TT_AVDØD              FIXED DEC(3),                                         
    ALDER_DØD_Å           PIC'999',                                             
    PIC_8_ÅMD             PIC'99999999';                                        
                                                                                
  /* SAMBOERE - 200010 : */                                                     
                                                                                
  IF B02.PENSJON_FØR_9802(BER_SØ_IND) ^= 'J'   &                                
     B02.RED_GP_3_2_5(BER_SØ_IND)      = 'J'    THEN                            
     DO;                                                                        
        GP_FAKTOR =  GP_PROSENT;                                                
        DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'X';                         
        B02.GP_REDUKSJON_KODE(BER_SØ_IND)        = 'X';                         
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        GP_FAKTOR = 1;                                                          
        B02.GP_REDUKSJON_KODE(BER_SØ_IND)        = ' ';                         
     END;                                                                       
                                                                                
  TT_EGEN  = 0;                                                                 
  TT_AVDØD = 0;                                                                 
                                                                                
  PIC_8_ÅMD= B02.STATUS.VIRK_DATO_ÅMD(BER_SØ_IND);                              
                                                                                
  IF F_ALDER(W_FNR,PIC_8_ÅMD) >= 7000 THEN                                      
     CALL REGN_TT_67_TIL_70;                                                    
  ELSE                                                                          
     B02.STATUS.TT_67_TIL_70(BER_SØ_IND) = 0;   /*200209 HL */                  
                                                                                
                                                                                
     ALDER_DØD_Å = B02.DØDSDATO_ÅMD(BER_EK_IND) / 10000 -                       
                                                                                
                                               FNR_EK_R13.ÅR_EK;                
  IF ALDER_DØD_Å > 66 THEN                                                      
     CALL REGN_TT_67_TIL_70_DØD;          /*200209 HL */                        
  ELSE                                                                          
     B02.STATUS.TT_67_TIL_70(BER_EK_IND) = 0;   /*200209 HL */                  
                                                                                
  TT_EGEN = B02.STATUS.TT_FØR_1967 (BER_SØ_IND) +                               
           ((B02.STATUS.TT_ETTER_1966(BER_SØ_IND) + 11) / 12) +                 
            B02.STATUS.TT_67_TIL_70(BER_SØ_IND);                                
                                                                                
  TT_AVDØD = B02.TT_FØR_1967 (BER_EK_IND)                                       
                +(B02.TT_ETTER_1966 (BER_EK_IND)                                
                + B02.TT_FRAMT(BER_EK_IND) + 11) / 12                           
                + B02.TT_67_TIL_70(BER_EK_IND);                                 
                                                                                
     /*TRUDE 27.11.98*/                                                         
  IF B01.TT_16_66(BER_SØ_IND) > 0 &                                             
     B02.TT_16_66(BER_SØ_IND) = 0 THEN                                          
     B02.TT_16_66(BER_SØ_IND) =   B01.TT_16_66(BER_SØ_IND);                     
                                                                                
                                                                                
  IF B02.TT_16_66(BER_SØ_IND) > 0 THEN                       /*NY0191*/         
         TT_EGEN = ((B02.TT_16_66(BER_SØ_IND) + 6) / 12 ) +  /*NY0191*/         
                    B02.TT_67_TIL_70(BER_SØ_IND);                               
                                                                                
  IF B02.TT_16_66(BER_EK_IND) > 0 THEN                       /*NY0191*/         
         TT_AVDØD = ((B02.TT_16_66(BER_EK_IND)               /*NY0191*/         
                    + B02.TT_FRAMT(BER_EK_IND) + 6) / 12)                       
                    + B02.TT_67_TIL_70(BER_EK_IND);                             
                                                                                
  IF TT_AVDØD < B01.TT_ANV(BER_EK_IND)  THEN                 /*NY0191*/         
     TT_AVDØD = B01.TT_ANV(BER_EK_IND);                                         
                                                                                
  IF B02.FRAVIK_FLYKTN(BER_SØ_IND)  = 'J' THEN                                  
     TT_EGEN     = 40;                                                          
                                                                                
  IF B02.TT_PÅ(BER_EK_IND) = 'J'             THEN     /*200206*/                
     TT_AVDØD    = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);                             
                                                                                
  IF TT_AVDØD > 39 THEN                                                         
     TT_AVDØD = 40;                                                             
                                                                                
   IF TT_EGEN > 39 THEN                                                         
      B02.STATUS.TT_ANV(BER_SØ_IND) = 40;                                       
   ELSE                                                                         
      DO;                                                                       
         IF TT_EGEN > TT_AVDØD THEN                                             
            B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                                   
         ELSE                                                                   
            B02.TT_ANV(BER_SØ_IND) = TT_AVDØD;                                  
                                                                                
      END;                                                                      
                                                                                
  B02.TT_ANV(BER_EK_IND) = TT_AVDØD;                                            
                                                                                
  IF B02.TT_GARANTI(BER_SØ_IND) >                                               
                  B02.TT_ANV(BER_SØ_IND)  THEN                                  
     B02.TT_ANV(BER_SØ_IND) = B02.TT_GARANTI(BER_SØ_IND);                       
                                                                                
  /*DENNE LÅ IKKE INNE HER. TRUDE 240393*/                                      
  IF W_TT_KONVENSJON > 0 THEN                                                   
    DO;                                                                         
       IF W_TT_KONVENSJON > 39 THEN                                             
          W_TT_KONVENSJON = 40;                                                 
                                                                                
          B02.TT_ANV(BER_SØ_IND)  = W_TT_KONVENSJON;                            
    END;                                                                        
                                                                                
  B02.ALDERSP.GP(BER_SØ_IND) = G * B02.TT_ANV(BER_SØ_IND)* GP_FAKTOR            
                                                  / (40 * 12) + 0.5;            
 /* *********************************************************** */              
 /* YS - BEREGNING                                              */              
 /* *********************************************************** */              
                                                                                
        DCL KAP11_GP     FIXED DEC (5);                                         
        DCL VANLIG_GP    FIXED DEC (5);                                         
                                                                                
                                                                                
        IF B02.YRKEPENS.YUG(BER_EK_IND) > 0      THEN                           
           DO;                                                                  
              KAP11_GP = G*B02.YRKEPENS.YUG(BER_EK_IND) * GP_FAKTOR             
                                   /(100*12)+ 0.5;                              
              IF B02.YRKEPENS.YUG(BER_EK_IND) = 100    THEN                     
                 B02.ALDERSP.GP(BER_SØ_IND) = KAP11_GP;                         
              ELSE                                                              
                 DO;                                                            
                    VANLIG_GP = B02.ALDERSP.GP(BER_SØ_IND) *                    
                                B02.YRKEPENS.YUG(BER_EK_IND)/100 + 0.5;         
                    IF KAP11_GP > VANLIG_GP THEN                                
                       B02.ALDERSP.GP(BER_SØ_IND) =                             
                                      B02.ALDERSP.GP(BER_SØ_IND) +              
                                      KAP11_GP - VANLIG_GP;                     
                 END;                                                           
           END;                                                                 
                                                                                
  IF B02.IKKE_GP(BER_SØ_IND)     = 'J'  THEN     /* TRUDE, 2704091 */           
     B02.ALDERSP.GP(BER_SØ_IND)  = 0;                                           
                                                                                
                                                                                
                                                                                
 END BEREGN_GP_ETTERLATT_AP;                                                    
