 /*       SIST ENDRET 07/09-98 15.15.14 AV   TSB7339                  */00000000
 /*       SIST ENDRET 11/05-83 08.24.18 AV   LUNDEBY                  */00000010
 /*       SIST ENDRET 04/05-83 14.39.53 AV   LUNDEBY                  */00000020
                                                                        00000030
                                                                        00000040
  /* **************************************************************** */00000050
  /*IDENTIFIKASJON:                                                   */00000060
  /*    R0015101 - HOVEDPROGRAM I PLI                                 */00000070
  /*                                                                  */00000080
  /*    PROGRAMMERER: S. LUNDEBY , SFK , DESEMBER 1982                */00000090
  /*                                                                  */00000100
  /*HENSIKT:                                                          */00000110
  /*    FJERNER / REPLACER   ROT - SEGM. AVHENGIG AV OM DET FANTES I  */00000120
  /*    RF-DB FRA FØR. SPERRE-KODEN I RF0PERSN VISER DET .            */00000130
  /*                                                                  */00000140
  /*                                  SPERRE-KODE                     */00000150
  /*                                                                  */00000160
  /*    ROT_SEGM. FINNES FRA  FØR      :   J   SPERRE-KODEN BLANKES   */00000170
  /*                                                                  */00000180
  /*    ROT_SEGM. FINNES IKKE FRA FØR  :   D   DUMMY-SEGM.  FJERNES   */00000190
  /*                                                                  */00000200
  /*PROGRAMTILKNYTNING:                                               */00000210
  /*                                                                  */00000220
  /*BRUKER                                                            */00000230
  /*                                                                  */00000240
  /*                                                                  */00000250
  /* **************************************************************** */00000260
                                                                        00000270
  R001510 :                                                             00000280
    PROC            (COMMAREA_PEKER)                                    00000290
           OPTIONS  (MAIN);                                             00000300
                                                                        00000310
    %PAGE;                                                              00000320
    %INCLUDE P0019908;                              /* KOM_OMR        */00000330
                                                                        00000340
    %PAGE;                                                              00000350
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000360
                                                                        00000370
    %PAGE;                                                              00000380
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000390
                                                                        00000400
    %PAGE;                                                              00000410
       DCL 1 B01              BASED (B01_PEKER),                        00000420
    %INCLUDE P0019921;                              /* B01            */00000430
                                                                        00000440
    %PAGE;                                                              00000450
    /* ************************************************************** */00000460
    /*                                                                */00000470
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000480
    /*                                                                */00000490
    /* ************************************************************** */00000500
                                                                        00000510
       DCL                                                              00000520
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                 00000530
       DCL                                                              00000540
         PLITDLI ENTRY;                                                 00000550
                                                                        00000560
    /* ************************************************************** */00000570
    /*                                                                */00000580
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000590
    /*                                                                */00000600
    /* ************************************************************** */00000610
                                                                        00000620
    %INCLUDE DLIUIB;                                                    00000630
                                                                        00000640
       DCL                                                              00000650
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000660
       DCL                                                              00000670
           COMMAREA_PEKER            POINTER;                           00000680
       DCL                                                              00000690
           W01_HJELPE_PTR            POINTER;                           00000700
                                                                        00000710
    /* ************************************************************** */00000720
    /*                                                                */00000730
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000740
    /*                                                                */00000750
    /* ************************************************************** */00000760
                                                                        00000770
       DCL 1  W01_OMR                   UNALIGNED,                      00000780
              2   B                            CHAR (1)      INIT (' ');00000790
                                                                        00000800
                                                                        00000810
    /* ************************************************************** */00000820
    /*                                                                */00000830
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000840
    /*                                                                */00000850
    /* ************************************************************** */00000860
                                                                        00000870
       DCL 1  W01_DLI_PARAM,                                            00000880
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00000890
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00000900
              2   W02_DLET                CHAR (4)   INIT ('DLET'),     00000910
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00000920
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00000930
                                                                        00000940
           1  W01_RF0PERSN,                                             00000950
              2   FILLER_1                CHAR (38)  INIT (''),         00000960
              2   SPERRE                  CHAR ( 1)  INIT (''),         00000970
              2   FILLER_2                CHAR (61)  INIT ('');         00000980
                                                                        00000990
    /* ************************************************************** */00001000
    /*                                                                */00001010
    /*   DL1 SSA-OMRÅDER FOR ROT                                      */00001020
    /*                                                                */00001030
    /* ************************************************************** */00001040
                                                                        00001050
       DCL    SSA_UQUAL              STATIC     CHAR (9)  INIT ((9)' ');00001060
                                                                        00001070
       DCL 1  SSA1_RF0PERSN          STATIC,                            00001080
              2    HDEL                         CHAR (17) INIT          00001090
                   ('RF0PERSN(FNR     '),                               00001100
              2    REL_OP                       CHAR (2)  INIT (' ='),  00001110
              2    PKEY               FIXED     DEC  (11) INIT ( 0  ),  00001120
              2    HP                           CHAR (1)  INIT (')' );  00001130
                                                                        00001140
    /* ************************************************************** */00001150
    /*                                                                */00001160
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001170
    /*                                                                */00001180
    /* ************************************************************** */00001190
                                                                        00001200
    %PAGE;                                                              00001210
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001220
                                                                        00001230
    %PAGE;                                                              00001240
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00001250
    %INCLUDE P0012003;                         /* PCB                 */00001260
                                                                        00001270
    /* ************************************************************** */00001280
    /*                                                                */00001290
    /*                                                                */00001300
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001310
    /*     ---------------------------------------------------        */00001320
    /*                                                                */00001330
    /*                                                                */00001340
    /*                                                                */00001350
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001360
    /*                                                                */00001370
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001380
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001390
    /*                                                                */00001400
    /* ************************************************************** */00001410
                                                                        00001420
    DB_STATUS_KODE                          =   '  ';                   00001430
    PROGRAM_ID                              =   'R0015101';             00001440
    UIBPTR                                  =    UIB_PEKER;             00001450
                                                                        00001460
    /* ********************************************************** */    00001470
    /*        SJEKKER ROT-SEGM FINNES FRA FØR.                    */    00001480
    /* ********************************************************** */    00001490
                                                                        00001500
                                                                        00001510
    SSA1_RF0PERSN.PKEY                      =    SEARCH_FNR;            00001520
    CALL P05_LES_ROT_GHU;                                               00001530
                                                                        00001540
    IF DLIUIB.UIBFCTR                      ^=    UIB_RC_OK        THEN  00001550
       DO;                                                              00001560
          /* ********************************************** */          00001570
          /* UIB'S RETURCODE ER UAKSEPTABEL                 */          00001580
          /* ********************************************** */          00001590
  L100:                                                                 00001600
          FEIL_MELD_NR                      =    500;                   00001610
          FEIL_VED_LABEL                    =   '100';                  00001620
          GO TO L999;                                                   00001630
       END;                                                             00001640
                                                                        00001650
                                                                        00001660
    SELECT    ( RF1.STATUS_KODE);                                       00001670
       WHEN   ('  ')                                                    00001680
          /* ****************************************************** */  00001690
          /*                                                        */  00001700
          /*   UNDERSØKER SPERRE-KODEN                              */  00001710
          /*     PERSONEN FORUTSETTES SPERRET .                     */  00001720
          /*                                                        */  00001730
          /*                                                        */  00001740
          /*   SPERRE =  J                                          */  00001750
          /*   -----------                                          */  00001760
          /*     PERSONEN FANTES FRA FØR :  SPERRE-KODEN BLANKES    */  00001770
          /*                                                        */  00001780
          /*                                                        */  00001790
          /*   SPERRE =  D                                          */  00001800
          /*   -----------                                          */  00001810
          /*     DUMMY SEGM. OPPRETTET UNDER INNLESING .            */  00001820
          /*     SEGMENTET FJERNES .                                */  00001830
          /*                                                        */  00001840
          /*   SPERRE =                                             */  00001850
          /*   -----------                                          */  00001860
          /*     ROT-SEGM. IKKE SPERRET .                           */  00001870
          /*                                                        */  00001880
          /* ****************************************************** */  00001890
                                                                        00001900
          DO;                                                           00001910
                                                                        00001920
             SELECT   ( W01_RF0PERSN.SPERRE );                          00001930
                                                                        00001940
                WHEN  ( 'J' )                                           00001950
                   /* ******************************************** */   00001960
                   /* RF0PERSN EKS. FRA FØR.    SPERRE = ' '       */   00001970
                   /* ******************************************** */   00001980
                   DO;                                                  00001990
                      W01_RF0PERSN.SPERRE              = ' ';           00002000
                      CALL P10_REPL_ROT;                                00002010
                   END;                                                 00002020
                                                                        00002030
                WHEN  ( 'D' )                                           00002040
                   /* ******************************************** */   00002050
                   /* RF0PERSN EKS. IKKE FRA FØR. RF0PERSN FJERNES */   00002060
                   /* ******************************************** */   00002070
                   DO;                                                  00002080
                      CALL P20_FJERN_DUMMY_ROT;                         00002090
                   END;                                                 00002100
                                                                        00002110
                WHEN  ( ' ' );                                          00002120
                   /* ******************************************** */   00002130
                   /* PERSONEN ER IKKE SPERRET . INGEN BEHANDLING  */   00002140
                   /* ******************************************** */   00002150
                                                                        00002160
                OTHERWISE                                               00002170
                   /* ******************************************** */   00002180
                   /* FEIL I SPERRE-KODE . BEHANDLING STOPPER      */   00002190
                   /* ******************************************** */   00002200
                   DO;                                                  00002210
  L110:                                                                 00002220
                      FEIL_MELD_NR                 =   500;             00002230
                      FEIL_VED_LABEL               =  '110';            00002240
                   END;                                                 00002250
                                                                        00002260
             END;  /*  SELECT ( W01_RF0PERSN.SPERRE            )   */   00002270
          END;     /*  DO                                          */   00002280
                                                                        00002290
       WHEN ('GE')                                                      00002300
          /* ****************************************************** */  00002310
          /* PERSONEN FINNES IKKE I DB. SKULLE EKSISTERT. FEIL      */  00002320
          /* ****************************************************** */  00002330
                                                                        00002340
          IF FUNKSJONSKODE      ^=  'E'              THEN               00002350
             DO;                                                        00002360
  L130:                                                                 00002370
                DB_STATUS_KODE   =   RF1.STATUS_KODE ;                  00002380
                FEIL_MELD_NR     =   501             ;                  00002390
                FEIL_VED_LABEL   =  '130'            ;                  00002400
             END;                                                       00002410
                                                                        00002420
       OTHERWISE                                                        00002430
          /* ************************************************ */        00002440
          /*    UGYLDIG STATUSKODE FRA DLI                    */        00002450
          /* ************************************************ */        00002460
          DO;                                                           00002470
  L140:                                                                 00002480
              FEIL_MELD_NR    =  500;                                   00002490
              FEIL_VED_LABEL  = '140';                                  00002500
              DB_STATUS_KODE  =  RF1.STATUS_KODE;                       00002510
          END;                                                          00002520
     END;     /*   SELECT : STATUS-KODE ETTER KALL MOT ROT  */          00002530
                                                                        00002540
                                                                        00002550
                                                                        00002560
                                                                        00002570
    /* ************************************************************** */00002580
    /* ************************************************************** */00002590
    /* ************                                    ************** */00002600
    /* ************     INTERNE   PROCEDURER           ************** */00002610
    /* ************                                    ************** */00002620
    /* ************************************************************** */00002630
    /* ************************************************************** */00002640
                                                                        00002650
                                                                        00002660
                                                                        00002670
    %PAGE;                                                              00002680
    /* ************************************************************** */00002690
    /*                                                                */00002700
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00002710
    /*                                                                */00002720
    /* ************************************************************** */00002730
                                                                        00002740
    P05_LES_ROT_GHU:                                                    00002750
      PROC;                                                             00002760
                                                                        00002770
      CALL PLITDLI                              (W02_PARM_CT_4,         00002780
                                                 W02_GHU,               00002790
                                                 RF1,                   00002800
                                                 W01_RF0PERSN,          00002810
                                                 SSA1_RF0PERSN);        00002820
    END P05_LES_ROT_GHU;                                                00002830
                                                                        00002840
                                                                        00002850
                                                                        00002860
    %PAGE;                                                              00002870
    /* ************************************************************** */00002880
    /*                                                                */00002890
    /* PROCEDURE FOR REPL ROT-SEGM                                    */00002900
    /*                                                                */00002910
    /* ************************************************************** */00002920
                                                                        00002930
    P10_REPL_ROT:                                                       00002940
      PROC;                                                             00002950
                                                                        00002960
      CALL PLITDLI                    (W02_PARM_CT_3,                   00002970
                                       W02_REPL,                        00002980
                                       RF1,                             00002990
                                       W01_RF0PERSN);                   00003000
                                                                        00003010
      IF RF1.STATUS_KODE           ^=  '  '                             00003020
       ! DLIUIB.UIBFCTR            ^=  UIB_RC_OK         THEN           00003030
         DO;                                                            00003040
            /* ********************************************** */        00003050
            /* UIB'S RETURCODE ER UAKSEPTABEL                 */        00003060
            /* ********************************************** */        00003070
  L150:                                                                 00003080
            FEIL_MELD_NR            =   500              ;              00003090
            FEIL_VED_LABEL          =  '150'             ;              00003100
            DB_STATUS_KODE          =   RF1.STATUS_KODE  ;              00003110
         END;                                                           00003120
                                                                        00003130
    END P10_REPL_ROT;                                                   00003140
                                                                        00003150
                                                                        00003160
                                                                        00003170
    %PAGE;                                                              00003180
    /* ************************************************************** */00003190
    /*                                                                */00003200
    /* PROCEDURE FOR FJERN ROT-SEGM                                   */00003210
    /*                                                                */00003220
    /* ************************************************************** */00003230
                                                                        00003240
    P20_FJERN_DUMMY_ROT:                                                00003250
      PROC;                                                             00003260
                                                                        00003270
      CALL PLITDLI                         (W02_PARM_CT_3,              00003280
                                            W02_DLET,                   00003290
                                            RF1,                        00003300
                                            W01_RF0PERSN);              00003310
                                                                        00003320
      IF RF1.STATUS_KODE               ^=    '  '                       00003330
       ! DLIUIB.UIBFCTR                ^=    UIB_RC_OK         THEN     00003340
         DO;                                                            00003350
            /* ********************************************** */        00003360
            /* UIB'S RETURCODE ER UAKSEPTABEL                 */        00003370
            /* ********************************************** */        00003380
  L160:                                                                 00003390
            FEIL_MELD_NR              =   500             ;             00003400
            FEIL_VED_LABEL            =  '160'            ;             00003410
            DB_STATUS_KODE            =   RF1.STATUS_KODE ;             00003420
         END;                                                           00003430
                                                                        00003440
    END P20_FJERN_DUMMY_ROT;                                            00003450
                                                                        00003460
                                                                        00003470
                                                                        00003480
                                                                        00003490
                                                                        00003500
  L999:                                                                 00003510
                                                                        00003520
    EXEC CICS RETURN;                                                   00003530
  END    R001510;                                                       00003540
