 /*       SIST ENDRET 28/08-98 14.32.42 AV   SPA7339                  */00000000
 /*       SIST ENDRET 14/01-98 15.26.53 AV   SPA7339                  */00000010
 /* ***************************************************************** */00000020
 /* IDENTIFIKASJON                                                    */00000030
 /*     R0010422 - PROGRAM SOM FORETAR  OPPDATERING AV TRYGDEKONTOR - */00000040
 /*                TABELLEN UNDER ADMINISTRASJONSDELEN AV SYSTEMET.   */00000050
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000060
 /*     PROGRAMMERER: JAN - H. KRISTENSEN AUGUST 1983.                */00000070
 /* HENSIKT                                                           */00000080
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */00000090
 /*     VELGE KODE FOR DET EN ØNSKER UTFØRT.                          */00000100
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */00000110
 /*     KAN GI KONTROLL TIL DEN AKTUELLE PROGRAMDELEN SOM UTFØRER     */00000120
 /*     AKSJONEN.                                                     */00000130
 /* PROGRAMTILKNYTNING                                                */00000140
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */00000150
 /*     UNDER ADMINISTRASJONSDELEN.                                   */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
                                                                        00000190
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000200
                                                                        00000210
    %INCLUDE P0019908;            /* KOM_OMR                          */00000220
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000230
    %INCLUDE P0019910;            /* STYRINGS_OMR                     */00000240
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000250
    %INCLUDE S001A2;              /* MAP TIL TKNR ENDRING FOR         */00000260
                                  /* ADMINISTRASJON.                  */00000270
    %INCLUDE DFHBMSCA;            /* HJELPE STRUKTUR FOR ATTRIBUTTER  */00000280
                                                                        00000290
    DCL                                                                 00000300
      1 ADM_OMR                  BASED(B01_PEKER), /* DETTE SIDEN B01 */00000310
        2 FORRIGE_AKSJON         CHAR(2),          /* IKKE BRUKES HER */00000320
                                                                        00000330
      1 TKNR_REC                 BASED(TKNR_PEKER),                     00000340
        2 TKNR                   PIC '(4)9',                            00000350
        2 NAVN                   CHAR (25),                             00000360
        2 ADRESSE1               CHAR (35),                             00000370
        2 ADRESSE2               CHAR (30),                             00000380
        2 SORT_KRIT              CHAR (1),                              00000390
        2 SPRÅKKODE              CHAR (1),                              00000400
        2 DATA_SENTRAL           CHAR (3),                              00000410
        2 EDB_SYSTEM             CHAR (1),                              00000420
                                                                        00000430
      CSTG                       BUILTIN,                               00000440
      ADDR                       BUILTIN,                               00000450
      LENGTH                     BUILTIN,                               00000460
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),             00000470
      KEY_PEKER                  POINTER,                               00000480
      TKNR_PEKER                 POINTER,                               00000490
      BMSMAPBR                   POINTER,                               00000500
      COMMAREA_PEKER             POINTER;                               00000510
                                                                        00000520
                                                                        00000530
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);               00000540
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);             00000550
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000560
    TRANSKODE               = 'RA22';        /* DETTE PROGRAM  */       00000570
                                                                        00000580
                                                                        00000590
    IF PROGRAM_ID = 'R0010420' THEN         /* KOMMER IN FØRSTE GANG */ 00000600
                                                                        00000610
       DO;                                                              00000620
          EXEC CICS SEND MAP('S001A2') MAPSET('S001A23') MAPONLY ERASE; 00000630
                                                                        00000640
       END;                                                             00000650
                                                                        00000660
                                                                        00000670
    ELSE IF PROGRAM_ID = 'R0010422' THEN       /*   DETTE PROGRAM   */  00000680
                                                                        00000690
       DO;                                                              00000700
          EXEC CICS RECEIVE MAP('S001A2')MAPSET('S001A23')              00000710
                                         SET  (BMSMAPBR);               00000720
          S001A2O.MELDINGO  = ' ';                                      00000730
          KEY_PEKER         = ADDR(S001A2I.TKNRI);                      00000740
                                                                        00000750
 /* ENDRET 13.02.86   AL                                       */       00000760
                                                                        00000770
          IF S001A2I.FUNKSJONSKODEL > 0 &                               00000780
             VERIFY(S001A2I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN          00000790
                                                                        00000800
 /* HIT    13.02.86   AL                                       */       00000810
                                                                        00000820
             DO;                                                        00000830
                FUNKSJONSKODE = S001A2I.FUNKSJONSKODEI;                 00000840
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00000850
             END;                                                       00000860
                                                                        00000870
          IF S001A2I.STYRE_KODEL > 0 &                                  00000880
             S001A2I.STYRE_KODEI ^= 'TB' THEN                           00000890
             DO;                                                        00000900
                STYREKODE  = S001A2I.STYRE_KODEI;                       00000910
                EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA (KOM_OMR); 00000920
             END;                                                       00000930
   EXEC CICS ENTER TRACEID(01) FROM (S001A2I.AKSJONI);                  00000940
          SELECT(S001A2I.AKSJONI);                                      00000950
             WHEN('VT')                                                 00000960
                DO;                                                     00000970
                   CALL BLANK_TEKST;                                    00000980
                   CALL TEKST_PROT;                                     00000990
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VT);        00001000
                   EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)   00001010
                                                    SET(TKNR_PEKER);    00001020
                   CALL OVERFØR_TIL_MAP;                                00001030
                   FORRIGE_AKSJON = 'VT';                               00001040
                                                                        00001050
                END;                                                    00001060
             WHEN('VN')                                                 00001070
                DO;                                                     00001080
                   CALL BLANK_TEKST;                                    00001090
                   CALL TEKST_PROT;                                     00001100
                   S001A2O.TKNRO = S001A2O.TKNRO + 1;                   00001110
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VN);        00001120
                   EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)   00001130
                                            GTEQ    SET(TKNR_PEKER);    00001140
                   CALL OVERFØR_TIL_MAP;                                00001150
                   FORRIGE_AKSJON = 'VN';                               00001160
                                                                        00001170
                END;                                                    00001180
             WHEN('VF')                                                 00001190
                DO;                                                     00001200
                   CALL BLANK_TEKST;                                    00001210
                   CALL TEKST_PROT;                                     00001220
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VT);        00001230
                   EXEC CICS STARTBR DATASET ('TKNRTAB') EQUAL          00001240
                                        RIDFLD(KEY_BIT);                00001250
                   EXEC CICS HANDLE CONDITION ENDFILE(NOTFND_VN);       00001260
                   EXEC CICS READPREV DATASET ('TKNRTAB')RIDFLD(KEY_BIT)00001270
                                                    SET(TKNR_PEKER);    00001280
                   EXEC CICS READPREV DATASET ('TKNRTAB')RIDFLD(KEY_BIT)00001290
                                                    SET(TKNR_PEKER);    00001300
                   CALL OVERFØR_TIL_MAP;                                00001310
                   FORRIGE_AKSJON = 'VF';                               00001320
                                                                        00001330
                END;                                                    00001340
             WHEN('XX')                                                 00001350
                DO;                                                     00001360
                   PROGRAM_ID = 'R0010301';    /* LITT JUKS !!!!     */ 00001370
                   EXEC CICS XCTL PROGRAM ('R0010420')                  00001380
                                  COMMAREA (KOM_OMR);                   00001390
                END;                                                    00001400
             OTHERWISE                                                  00001410
                DO;                                                     00001420
                   S001A2O.MELDINGO = 'UGYLDIG KODE';                   00001430
                   CALL TEKST_PROT;                                     00001440
                   S001A2I.AKSJONL = -1;     /* CURSOR */               00001450
                   S001A2I.TKNRL   = 0;                                 00001460
                END;                                                    00001470
                                                                        00001480
                                                                        00001490
          END;      /* SELECT  */                                       00001500
                                                                        00001510
          CALL SEND_MAP;                                                00001520
                                                                        00001530
                                                                        00001540
       END;                                                             00001550
                                                                        00001560
                                                                        00001570
  UT:                                                                   00001580
    PROGRAM_ID = 'R0010422';                                            00001590
    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);              00001600
                                                                        00001610
                                                                        00001620
  NOTFND_VT:                                                            00001630
    S001A2O.MELDINGO =                                                  00001640
           'DETTE TRYGDEKONTORNUMMER FINNES IKKE I SYSTEMET';           00001650
    CALL SEND_MAP;                                                      00001660
    GOTO UT;                                                            00001670
                                                                        00001680
                                                                        00001690
  NOTFND_VN:                                                            00001700
    S001A2O.MELDINGO =                                                  00001710
           'INGEN FLERE TRYGDEKONTORNUMMER I DENNE RETNING';            00001720
    CALL SEND_MAP;                                                      00001730
    GOTO UT;                                                            00001740
                                                                        00001750
                                                                        00001760
                                                                        00001770
                                                                        00001780
  SEND_MAP: PROC;                                                       00001790
     EXEC CICS SEND MAP ('S001A2') MAPSET ('S001A23')                   00001800
                                 CURSOR     DATAONLY ;                  00001810
  END SEND_MAP;                                                         00001820
                                                                        00001830
                                                                        00001840
  BLANK_TEKST: PROC;                                                    00001850
     S001A2O.NAVNO          = ' ';                                      00001860
     S001A2O.ADRESSE1O      = ' ';                                      00001870
     S001A2O.ADRESSE2O      = ' ';                                      00001880
     S001A2O.SORT_KRITO     = ' ';                                      00001890
     S001A2O.SPRÅKKODEO     = ' ';                                      00001900
     S001A2O.DATA_SENTRALO  = ' ';                                      00001910
     S001A2O.SYSTEMO        = ' ';                                      00001920
  END BLANK_TEKST;                                                      00001930
                                                                        00001940
                                                                        00001950
  TEKST_UNP: PROC;                                                      00001960
     S001A2I.NAVNL          = -1;   /* CURSOR   */                      00001970
     S001A2I.TKNRL          = 0;                                        00001980
     S001A2O.TKNRA          = '9';  /* ASKIP + BRIGHT + MDT */          00001990
     S001A2O.NAVNA          = 'I';  /* UNP + BRI + MDT      */          00002000
     S001A2O.ADRESSE1A      = 'I';  /* UNP + BRI + MDT      */          00002010
     S001A2O.ADRESSE2A      = 'I';  /* UNP + BRI + MDT      */          00002020
     S001A2O.SORT_KRITA     = 'I';                                      00002030
     S001A2O.SPRÅKKODEA     = 'I';                                      00002040
     S001A2O.DATA_SENTRALA  = 'I';                                      00002050
     S001A2O.SYSTEMA        = 'I';                                      00002060
  END TEKST_UNP;                                                        00002070
                                                                        00002080
                                                                        00002090
  TEKST_PROT: PROC;                                                     00002100
     S001A2I.NAVNL          = 0;                                        00002110
     S001A2I.TKNRL          = -1;  /* CURSOR   */                       00002120
     S001A2O.TKNRA          = 'P'; /* BRIGHT + NUM + UNP + MDT */       00002130
     S001A2O.NAVNA          = DFHBMASB;                                 00002140
     S001A2O.ADRESSE1A      = DFHBMASB;                                 00002150
     S001A2O.ADRESSE2A      = DFHBMASB;                                 00002160
     S001A2O.SORT_KRITA     = DFHBMASB;                                 00002170
     S001A2O.SPRÅKKODEA     = DFHBMASB;                                 00002180
     S001A2O.DATA_SENTRALA  = DFHBMASB;                                 00002190
     S001A2O.SYSTEMA        = DFHBMASB;                                 00002200
  END TEKST_PROT;                                                       00002210
                                                                        00002220
                                                                        00002230
  OVERFØR_TIL_MAP: PROC;                                                00002240
     S001A2O.TKNRO          = TKNR_REC.TKNR;                            00002250
     S001A2O.NAVNO          = TKNR_REC.NAVN;                            00002260
     S001A2O.ADRESSE1O      = TKNR_REC.ADRESSE1;                        00002270
     S001A2O.ADRESSE2O      = TKNR_REC.ADRESSE2;                        00002280
     S001A2O.SORT_KRITO     = TKNR_REC.SORT_KRIT;                       00002290
     S001A2O.SPRÅKKODEO     = TKNR_REC.SPRÅKKODE;                       00002300
     S001A2O.DATA_SENTRALO  = TKNR_REC.DATA_SENTRAL;                    00002310
     IF TKNR_REC.EDB_SYSTEM = 'I' THEN                                  00002320
        S001A2O.SYSTEMO     = 'INFOTRYGD';                              00002330
     ELSE                                                               00002340
        S001A2O.SYSTEMO     = 'NORTRYGD ';                              00002350
  END OVERFØR_TIL_MAP;                                                  00002360
                                                                        00002370
                                                                        00002380
  OVERFØR_FRA_MAP: PROC;                                                00002390
                                                                        00002400
     ALLOCATE TKNR_REC;                                                 00002410
     TKNR_REC                 = '';                                     00002420
     TKNR_REC.TKNR            = S001A2O.TKNRO;                          00002430
     IF S001A2I.NAVNL         > 0 THEN                                  00002440
        TKNR_REC.NAVN         = S001A2I.NAVNI;                          00002450
     IF S001A2I.ADRESSE1L     > 0 THEN                                  00002460
        TKNR_REC.ADRESSE1     = S001A2I.ADRESSE1I;                      00002470
     IF S001A2I.ADRESSE2L     > 0 THEN                                  00002480
        TKNR_REC.ADRESSE2     = S001A2I.ADRESSE2I;                      00002490
     IF S001A2I.SORT_KRITL    > 0 THEN                                  00002500
        TKNR_REC.SORT_KRIT    = S001A2I.SORT_KRITI;                     00002510
     IF S001A2I.SPRÅKKODEL    > 0 THEN                                  00002520
        TKNR_REC.SPRÅKKODE    = S001A2I.SPRÅKKODEI;                     00002530
     IF S001A2I.DATA_SENTRALL > 0 THEN                                  00002540
        TKNR_REC.DATA_SENTRAL = S001A2I.DATA_SENTRALI;                  00002550
     IF S001A2I.SYSTEML       > 0 THEN                                  00002560
        TKNR_REC.EDB_SYSTEM   = S001A2I.SYSTEMI;                        00002570
                                                                        00002580
  END OVERFØR_FRA_MAP;                                                  00002590
                                                                        00002600
                                                                        00002610
                                                                        00002620
                                                                        00002630
  KONTROLL_AV_INPUT:  PROC;                                             00002640
                                                                        00002650
     IF TKNR_REC. NAVN = ' ' THEN                                       00002660
        DO;                                                             00002670
           S001A2O.MELDINGO = 'NAVN ER IKKE UTFYLLT';                   00002680
           S001A2I.NAVNL     = -1;      /* CURSOR      */               00002690
        END;                                                            00002700
                                                                        00002710
     ELSE IF TKNR_REC.ADRESSE1  = ' ' &                                 00002720
             TKNR_REC.ADRESSE2  = ' ' THEN                              00002730
        DO;                                                             00002740
           S001A2O.MELDINGO  = 'INGEN ADRESSER ER UTFYLLT';             00002750
           S001A2I.ADRESSE1L = -1;      /* CURSOR      */               00002760
        END;                                                            00002770
                                                                        00002780
     ELSE IF ^ (TKNR_REC.SORT_KRIT  = 'A' !                             00002790
                TKNR_REC.SORT_KRIT  = 'F') THEN                         00002800
        DO;                                                             00002810
           S001A2O.MELDINGO   = 'URIKTIGE SORTERINGS - KRITERIER';      00002820
           S001A2I.SORT_KRITL = -1;      /* CURSOR      */              00002830
        END;                                                            00002840
                                                                        00002850
     ELSE IF ^ (TKNR_REC.SPRÅKKODE = 'B' !                              00002860
                TKNR_REC.SPRÅKKODE = 'N') THEN                          00002870
        DO;                                                             00002880
           S001A2O.MELDINGO   = 'URIKTIG SPRÅKKODE';                    00002890
           S001A2I.SPRÅKKODEL = -1;      /* CURSOR      */              00002900
        END;                                                            00002910
                                                                        00002920
     ELSE IF ^ (TKNR_REC.DATA_SENTRAL = 'KDØ' !                         00002930
                TKNR_REC.DATA_SENTRAL = 'VES' !                         00002940
                TKNR_REC.DATA_SENTRAL = 'RTV' !                         00002950
                TKNR_REC.DATA_SENTRAL = 'ADS' !                         00002960
                TKNR_REC.DATA_SENTRAL = 'RDS' !                         00002970
                TKNR_REC.DATA_SENTRAL = 'KDV' !                         00002980
                TKNR_REC.DATA_SENTRAL = 'KDM' !                         00002990
                TKNR_REC.DATA_SENTRAL = 'NDS' !                         00003000
                TKNR_REC.DATA_SENTRAL = 'KDN') THEN                     00003010
        DO;                                                             00003020
           S001A2O.MELDINGO   = 'URIKTIG KODE FOR DATASENTRAL, KDØ '    00003030
                              !!'VES RTV ADS RDS KDV KDM NDS KND';      00003040
           S001A2I.DATA_SENTRALL = -1;      /* CURSOR      */           00003050
        END;                                                            00003060
                                                                        00003070
     ELSE IF ^ (TKNR_REC.EDB_SYSTEM = 'I' !                             00003080
                TKNR_REC.EDB_SYSTEM = ' ') THEN                         00003090
        DO;                                                             00003100
           S001A2O.MELDINGO   = 'URIKTIG KODE FOR EDB-SYSTEM';          00003110
           S001A2I.SYSTEML    = -1;      /* CURSOR      */              00003120
        END;                                                            00003130
     ELSE                                                               00003140
        RETURN;            /*  RETURNERER UTEN Å HA FUNNET FEIL  */     00003150
                                                                        00003160
                                                                        00003170
    /* HIT KOMMER EN BARE DERSOM DET ER FEIL, DA BLIR DET EN    */      00003180
    /* ANNEN UTGANG                                             */      00003190
                                                                        00003200
    CALL SEND_MAP;                                                      00003210
    GOTO UT;                                                            00003220
                                                                        00003230
                                                                        00003240
  END KONTROLL_AV_INPUT;                                                00003250
                                                                        00003260
                                                                        00003270
 END R001B1;                                                            00003280
