 /*   SIST ENDRET PÅ PROD   2004.12.17 15.34.09 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.27.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.08.27    48.56 AV   SPA2970          */        
 /*       SIST ENDRET 29/03-99 13.39.06 AV   JDA7339                  */        
 /*       SIST ENDRET 29/03-99 13.37.25 AV   JDA7339                  */        
 /*       SIST ENDRET 16/11-98 09.13.57 AV   JDA7339                  */        
 /*       SIST ENDRET 11/11-98 08.49.24 AV   JDA7339                  */        
 /*       SIST ENDRET 05/05-98 14.31.58 AV   JDA7339                  */        
 /*       SIST ENDRET 09/03-98 10.20.45 AV   SPA7339                  */        
  /* **************************************************************** */        
  /*IDENTIFIKASJON:                                                   */        
  /*    R0015401 - HOVEDPROGRAM I PLI                                 */        
  /*    PROGRAMMERER: LUNDEBY FEBRUAR  1982                           */        
  /*                                                                  */        
  /*HENSIKT:                                                          */        
  /*    SKRIVE INNTEKT, PENSJONSHISTORIKK                             */        
  /*    OG STATUS RECORD TIL DATABASEN                                */        
  /*                                                                  */        
  /*PROGRAMTILKNYTNING:                                               */        
  /*    R005430  -->  SKRIVER       SISTE STATUS                      */        
  /*    R005470  -->  SKRIVER  NEST SISTE STATUS                      */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*                                                                  */        
  /* **************************************************************** */        
  R001540:PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                   
                                                                                
    %INCLUDE P0019908;                            /* KOM_OMR        */          
    %INCLUDE P0019910;                            /* STYRINGS_OMR   */          
    %INCLUDE P0019912;                            /* DIV_PARAM_OMR  */          
       DCL 1  B00              BASED (B00_PEKER),                               
    %INCLUDE P0019921;                            /* B00            */          
                                                                                
       DCL 1  B02              BASED (B02_PEKER),                               
    %INCLUDE P0019921;                            /* B02            */          
                                                                                
     DCL 1  W01_PINT               UNALIGNED,                                   
     %INCLUDE   P0019928                    ;  /* INTEKTS-SEGM      */          
                                                                                
                                                                                
    /* ************************************************************ */          
    /* TILKNYTTNINGS-SEGM .  BRUKES I 1. RF-PCB.   (RF1)            */          
    /* ************************************************************ */          
                                                                                
     DCL 1  W01_TILKN1             UNALIGNED,                                   
     %INCLUDE   P0019931                    ;  /* TILKN-SEGM        */          
                                                                                
    /* ************************************************************ */          
    /* TILKNYTTNINGS-SEGM .  BRUKES I 2. RF-PCB.  (RF2)             */          
    /* ************************************************************ */          
                                                                                
     DCL 1  W01_TILKN2             UNALIGNED,                                   
     %INCLUDE   P0019931                    ;  /* TILKN-SEGM        */          
                                                                                
                                                                                
    /* ************************************************************ */          
    /*     INNEBYGDE PLI-FUNKSJONER                                 */          
    /* ************************************************************ */          
                                                                                
     DCL                                                                        
        ( ADDR , LOW , CSTG , SUBSTR , HBOUND ) BUILTIN;                        
     DCL                                                                        
          PLITDLI ENTRY;                                                        
     DCL                                                                        
         COMMAREA_PEKER            POINTER;                                     
     DCL                                                                        
         W01_HJELPE_PTR            POINTER;                                     
                                                                                
    /* ************************************************************ */          
    /* HJELPE-OMR. FOR BUILTIN-FUNC.     :    DATO_2000             */          
    /* ************************************************************ */          
                                                                                
     DCL    W01_DATO_2000                    PIC'(8)9' INIT (0);                
                                                                                
     DCL    W01_ÅR  DEF     W01_DATO_2000    PIC '9999' ;                       
                                                                                
    /* ************************************************************ */          
    /* OPPTELINGS- OG LOOP-PARAMETRE M.M                            */          
    /* ************************************************************ */          
                                                                                
     DCL 1  W01_OPPTELL_OMR,                                                    
            2   W02_I              FIXED    BIN   (15)   INIT ( 0 ),            
            2   W02_ÅR             FIXED    BIN   (15)   INIT ( 0 ),            
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),            
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),            
            2   B                           CHAR  (1)    INIT (' ');            
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /* DLI CALL-PARAMETRE                                           */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
     DCL 1  W01_DLI_PARAM,                                                      
            2   W02_DLI_FUNC       CHAR (4)       INIT ('    '),                
            2   W02_GN             CHAR (4)       INIT ('GN  '),                
            2   W02_GU             CHAR (4)       INIT ('GU  '),                
            2   W02_GNP            CHAR (4)       INIT ('GNP '),                
            2   W02_GHU            CHAR (4)       INIT ('GHU '),                
            2   W02_DLET           CHAR (4)       INIT ('DLET'),                
            2   W02_REPL           CHAR (4)       INIT ('REPL'),                
            2   W02_ISRT           CHAR (4)       INIT ('ISRT'),                
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT (3),                     
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT (4),                     
            2   W02_PARM_CT_5      FIXED BIN(31)  INIT (5),                     
            2   W02_PARM_CT_6      FIXED BIN(31)  INIT (6),                     
            2   W02_PARM_CT_7      FIXED BIN(31)  INIT (7),                     
            2   W02_OUT_FELT       PIC '(11)9'    INIT (''),                    
            2   W02_DATO           PIC '(4)9'     INIT (''),                    
            2   W02_ST_OK          BIT (1)        INIT (''),                    
            2   NEI                BIT (1)        INIT ('0'B),                  
            2   PERSON_IKKE_DØD    BIT (1)        INIT ('0'B),                  
            2   W02_OUT2           CHAR (20)      INIT ('');                    
                                                                                
     DCL    W01_IO                 CHAR (340)    INIT  ('');                    
     DCL    W01_HJELPE_IO          CHAR (340)    BASED (W01_HJELPE_PTR);        
   DCL BUFF_X         CHAR(8);                                                  
      DCL DGNR_X        DEF BUFF_X PIC '(7)9',                                  
          TESTB_X       DEF BUFF_X POS(8) CHAR(1),                              
          ÅRDATO_ÅMD    DEF BUFF_X PIC '(8)9',                                  
          DGNR_X_PAK   FIXED DEC(7);                                            
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /* DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
     DCL    SSA_UQUAL                            CHAR (9) INIT ((9)' ');        
                                                                                
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('RF0PERSN(FNR     '),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
     DCL 1  SSA2_RF0PERSN          UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('RF0PERSN(FNR     '),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
     DCL 1  SSA3_RF0PERSN          UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('RF0PERSN(FNR     '),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
     DCL 1  SSA1_PINNTEKT          UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('PINNTEKT(INNTÅRTY'),                                         
            2    REL_OP1                         CHAR (2)   INIT (' ='),        
  /*2000*/  2    ÅR1                FIXED        DEC  (5)   INIT ( 0 ) ,        
            2    TYPE1                           CHAR (1)   INIT (' '),         
            2    HP                              CHAR (1)   INIT (')') ;        
                                                                                
     DCL 1  SSA2_PINNTEKT          UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('PINNTEKT(INNTÅR  '),                                         
            2    REL_OP1                         CHAR (2)   INIT (' ='),        
  /*2000*/  2    ÅR                 FIXED        DEC  (5)   INIT ( 0 ) ,        
            2    HP                              CHAR (1)   INIT (')') ;        
                                                                                
     DCL 1  SSA1_UFØRHIST          UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('UFØRHIST(UFT     '),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
  /*2000*/  2    UFT_ÅMD              FIXED      DEC  (8)   INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
       DCL 1  SSA1_YRKEHIST          UNALIGNED,                                 
            2    HDEL                            CHAR (17)  INIT                
                 ('YRKEHIST(YUFT    '),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
 /*2000*/   2    YUFT_ÅMD             FIXED      DEC  (8)   INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
     DCL 1  SSA1_STATUS            UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('STATUS  (STATKODE'),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
            2    KODE                            CHAR (1)   INIT (' '),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
     DCL 1  SSA1_TILKN             UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('TILKN   (FNRANDRE'),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
            2    PKEY            FIXED           DEC  (11)  INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
     DCL 1  SSA2_TILKN             UNALIGNED,                                   
            2    HDEL                            CHAR (17)  INIT                
                 ('TILKN   (FNRANDRE'),                                         
            2    REL_OP                          CHAR (2)   INIT (' ='),        
            2    PKEY            FIXED           DEC  (11)  INIT ( 0 ),         
            2    HP                              CHAR (1)   INIT (')');         
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /* ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
     DCL                                                                        
         UIB_RC_OK                 BIT (8)       INIT( 0 );                     
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /* PCB- OG UIB-OMR .                                          */            
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
     %INCLUDE   P0012002;                /* PCB_UIB_PEKER_OMR BASED */          
                                                                                
     DCL 1  RF1                     BASED (RF1_PCB_PEKER),                      
     %INCLUDE   P0012003;                /*    PCB                 */           
                                                                                
     DCL 1  RF2                     BASED (RF2_PCB_PEKER),                      
     %INCLUDE   P0012003;                /*    PCB                 */           
                                                                                
     DCL 1  RF3                     BASED (RF3_PCB_PEKER),                      
     %INCLUDE   P0012003;                /*    PCB                 */           
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .     */          
    /*       ---------------------------------------------------    */          
    /*                                                              */          
    /*                                                              */          
    /*        INITIERER FORSKJELLIGE PARAMETRE .                    */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
    /* ============================================================== */        
    W01_DATO_2000                        =       DATO_2000        ;             
    ÅRDATO_ÅMD                           =       W01_DATO_2000;                 
    BUFF_X = R0019947(BUFF_X);                                                  
    DGNR_X_PAK = DGNR_X;                                                        
    IF FEIL_MELD_NR = 0 THEN /* AB 01.08.16 */                                  
       PROGRAM_ID  =      'R0015401'  ;                                         
       UIBPTR      =       UIB_PEKER  ;                                         
       W01_PINT    =       ''         ;                                         
                                                                                
                                                                                
    IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4) = 'HELP'  THEN                       
         GO TO L999;        /* 'US' BLANKETTYPE BERØRER IKKE STATUS  */         
                                                                                
                                                                                
    DO   W02_I  =  1  TO  14;                                                   
                                                                                
      IF B02.PENSJONSTYPE2(W02_I) = 'A'    !     /*DAGPENGER*/                  
         B00.PENSJONSTYPE2(W02_I) = 'A'    THEN  /*1198*/                       
         GO TO L999;                                                            
                                                                                
      IF  B00.FNR        (W02_I)     >    0              THEN                   
        DO;                                                                     
          /* **************************************************** */            
          /*  GÅR IGJENNOM FNR TIL  M F  FOR Å RYDDE OPP I        */            
          /*  DEM OG DERES TILKNYTTINGERS :  NEST SISTE STATUS    */            
          /* **************************************************** */            
                                                                                
          IF B00.STATUS.PENSJONSTYPE1 (W02_I)  =   'D'      THEN                
             PERSON_IKKE_DØD                   =   '0'B           ;             
          ELSE                                                                  
             PERSON_IKKE_DØD                   =   '1'B           ;             
                                                                                
          SSA1_STATUS.KODE                     =   'N'            ;             
          SSA1_RF0PERSN.PKEY                   =    B00.FNR(W02_I);             
          CALL P_LEST_TILKN_FJERNET_STATUS;                                     
                                                                                
          IF FEIL_MELD_NR                      >    0         THEN              
             GO TO L999;                                                        
        END;                                                                    
                                                                                
                                                                                
      IF B02.FNR  (W02_I)           >    0              THEN                    
        DO;                                                                     
          /* **************************************************** */            
          /*  GÅR IGJENNOM FNR TIL  M F  FOR Å RYDDE OPP I        */            
          /*  DEM OG DERES TILKNYTTINGERS :       SISTE STATUS    */            
          /* **************************************************** */            
                                                                                
          IF B02.STATUS.PENSJONSTYPE1 (W02_I)  =   'D'      THEN                
             PERSON_IKKE_DØD                   =   '0'B           ;             
          ELSE                                                                  
             PERSON_IKKE_DØD                   =   '1'B           ;             
                                                                                
          SSA1_STATUS.KODE                     =   'S'            ;             
          SSA1_RF0PERSN.PKEY                   =    B02.FNR(W02_I);             
          CALL P_LEST_TILKN_FJERNET_STATUS;                                     
                                                                                
          IF FEIL_MELD_NR                      >    0         THEN              
             GO TO L999;                                                        
        END;                                                                    
    END;                                                                        
                                                                                
    /* ************************************************************* */         
    /* OPPRYDDING AV TILKNYTTINGER FERDIG .                          */         
    /* ************************************************************* */         
                                                                                
                                                                                
    DO   W02_I  =  1  TO  14;                                                   
                                                                                
      IF B02.FNR  (W02_I)             >    0                       THEN         
         DO;                                                                    
         /*    ENDRET AV SATISH 09022001  ANGONE KJØRINGS_TYPE = 'S'            
               OG ALDERSKONVERTERING ELLER OMEEGNING ETTER INN.OPP              
            IF DIV_PARAM_OMR.KJØRINGS_TYPE  ^=   'S'      &                     
               STYRINGS_OMR .FUNKSJONSKODE  ^=   'E'               THEN         
      */                                                                        
            IF STYRINGS_OMR .FUNKSJONSKODE  ^=   'E'               THEN         
               /* ************************************************** */         
               /*  NYE OPPL. INN I :  RF0PERSN  PINNTEKT  TILBERPO   */         
               /*  HVIS IKKE       : 'SATVIS KJØRING' ELLER FJERNING */         
               /* ************************************************** */         
               DO;                                                              
                  SSA1_RF0PERSN.PKEY  =  B02.FNR(W02_I);                        
                                                                                
                  CALL PLITDLI          (W02_PARM_CT_4,                         
                                         W02_GHU,                               
                                         RF1,                                   
                                         W01_IO,                                
                                         SSA1_RF0PERSN);                        
                                                                                
                  IF UIBFCTR        ^=   UIB_RC_OK         THEN                 
                     DO;                                                        
                        /* *************************************** */           
                        /*   UAKSEPTABEL KODE FRA :    UIB         */           
                        /* *************************************** */           
  L100:                                                                         
                        FEIL_MELD_NR   =   500;                                 
                        FEIL_VED_LABEL =  '100';                                
                        GO TO    L999;                                          
                     END;                                                       
                                                                                
                                                                                
                  W01_HJELPE_PTR    =   ADDR (B02.RF0PERSN (W02_I)) ;           
                  W01_IO            =   W01_HJELPE_IO               ;           
                                                                                
                                                                                
                  SELECT  (RF1.STATUS_KODE);                                    
                                                                                
                     WHEN ('  ')                                                
                        DO;                                                     
                           CALL PLITDLI           (W02_PARM_CT_3,               
                                                   W02_REPL,                    
                                                   RF1,                         
                                                   W01_IO);                     
                                                                                
                           IF UIBFCTR          ^=  UIB_RC_OK     !              
                              RF1.STATUS_KODE  ^=  '  '             THEN        
                              DO;                                               
                                 /* ********************************* */        
                                 /* UAKSEPTABEL KODE FRA :  UIB       */        
                                 /*                 RF1.STATUS_KODE   */        
                                 /* ********************************* */        
  L110:                                                                         
                                 FEIL_MELD_NR   =   500;                        
                                 FEIL_VED_LABEL =  '110';                       
                                 DB_STATUS_KODE =   RF1.STATUS_KODE;            
                                 GO TO     L999;                                
                              END;                                              
                        END;                                                    
                                                                                
                     WHEN ('GE')                                                
                        DO;                                                     
                           /* ************************************** */         
                           /* DUMMY-ROT SKULLE VERT LAGET I R0013110 */         
                           /* ************************************** */         
  L120:                                                                         
                           FEIL_MELD_NR         =    501;                       
                           FEIL_VED_LABEL       =   '120';                      
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;           
                           GO TO     L999;                                      
                        END;                                                    
                                                                                
                     OTHERWISE                                                  
                        DO;                                                     
                           /* ************************************* */          
                           /*  UGYLDIG STATUSKODE FRA DLI           */          
                           /* ************************************* */          
  L130:                                                                         
                           FEIL_MELD_NR         =    500;                       
                           FEIL_VED_LABEL       =   '130';                      
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;           
                           GO TO     L999;                                      
                        END;                                                    
                  END;     /*     SELECT  :   RF1.STATUS_KODE     */            
                                                                                
                                                                                
                  /* ********************************************* */           
                  /* PINNTEKT SKRIVES                              */           
                  /* ********************************************* */           
                                                                                
                  SSA_UQUAL             =  'PINNTEKT ';                         
                                                                                
                  DO W02_ÅR = 1967 TO 2010  WHILE(W02_ÅR  <=  W01_ÅR );         
                                                                                
 /*PI_KODE = M BETYR AT DET ER BÅDE OMSORGSPOENG OG FORELØPIG INNT*/            
                                                                                
                     IF B02.PI_KODE     (W02_I,W02_ÅR)  =  'F' !                
                        B02.PI_KODE     (W02_I,W02_ÅR)  =  'M'  THEN            
                        DO;                                                     
                           SSA1_PINNTEKT.TYPE1          =  'A'     ;            
                           SSA1_PINNTEKT.ÅR1            =   W02_ÅR ;            
                           SSA2_PINNTEKT.ÅR             =   W02_ÅR ;            
                           CALL  P_SJEKK_INNTEKT;                               
                                                                                
                                                                                
                           IF FEIL_MELD_NR  >  0                THEN            
                              GO TO L999;                                       
                                                                                
                                 W02_PI_ÅR    =   W02_ÅR;                       
                                 W02_PI       =   B02.PI (W02_I,W02_ÅR);        
                                                                                
                                 W02_PI_TYPE  =   'A'                  ;        
                                 W02_PI_RAPPDATO = DGNR_X_PAK;                  
                                 CALL  P_SKRIV_INNTEKT_TIL_BASEN       ;        
                                                                                
                                 IF FEIL_MELD_NR   >   0        THEN            
                                    GO TO L999;                                 
                                                                                
                        END;  /*    IF B02.PI_TYPE    = 'F'           */        
                                                                                
                  END;        /*    BEHANDLING AV INNTEKTENE          */        
                                                                                
                                                                                
                  /* ************************************************ */        
                  /* TILLEGGS-OPPLYSNINGENE FOR POENGBEREGNINGEN      */        
                  /* ************************************************ */        
                                                                                
                  IF B02 (W02_I).TILBERPO.VERNEPLIKTÅR (1) >  0   !             
                     B02 (W02_I).TILBERPO.VERNEPLIKTÅR (2) >  0   !             
                     B02 (W02_I).TILBERPO.VERNEPLIKTÅR (3) >  0   !             
                     B02 (W02_I).TILBERPO.VERNEPLIKTÅR (4) >  0   !             
                     B02 (W02_I).TILBERPO.AI63             >  0   !             
                     B02 (W02_I).TILBERPO.AI64             >  0   !             
                     B02 (W02_I).TILBERPO.AI65             >  0   !             
                     B02 (W02_I).TILBERPO.AI66             >  0   !             
                     B02 (W02_I).TILBERPO.PI66             >  0     THEN        
                                                                                
                     DO;                                                        
                        W01_HJELPE_PTR  =  ADDR ( B02.TILBERPO (W02_I));        
                        CALL  P_SKRIV_TILBERPO;                                 
                                                                                
                        IF FEIL_MELD_NR       >   0                 THEN        
                        GO TO L999;                                             
                     END;                                                       
                                                                                
               END;  /*IF KJØRINGS_TYPE ^= 'S' & FUNKSJONSKODE ^= 'E'*/         
                                                                                
                                                                                
            /* **************************************************** */          
            /*  SKRIVER BARE NEST SISTE STATUS HVIS :               */          
            /*          STATUS_KODE_HIST   ^=  O                    */          
            /* **************************************************** */          
                                                                                
            IF B00.FNR                (W02_I)  >    0  /* &                     
               B00.STATUS_KODE_HIST   (W02_I) ^=   'O' */  THEN                 
               DO;                                                              
                  SSA1_RF0PERSN.PKEY           =    B00.FNR (W02_I);            
                  SSA1_STATUS.KODE             =   'N';                         
                  B00.STATUS_KODE     (W02_I)  =   'N';                         
                                                                                
                  IF B00.VIRK_DATO_ÅMD (W02_I) >    0              THEN         
                     DO;                                                        
                        CALL P_SKRIV_NEST_SISTE_STATUS;                         
                                                                                
                        IF FEIL_MELD_NR        >    0              THEN         
                           GO TO L999;                                          
                     END;                                                       
               END;      /*  BEHANDLING AV NEST SISTE STATUS    */              
                                                                                
                                                                                
            /* ************************************************ */              
            /* SKRIVER UT :    S I S T E   S T A T U S          */              
            /* **************************************************/              
                                                                                
            SSA1_RF0PERSN.PKEY                =    B02.FNR (W02_I);             
            SSA1_STATUS.KODE                  =   'S';                          
            B02.STATUS_KODE     (W02_I)       =   'S';                          
                                                                                
            IF B02.VIRK_DATO_ÅMD (W02_I)       >    0          THEN             
               DO;                                                              
                  CALL   P_SKRIV_SISTE_STATUS;                                  
                                                                                
                  IF FEIL_MELD_NR             >    0          THEN              
                     GO TO L999;                                                
               END;                                                             
                                                                                
         END;     /*    IF B02.FNR  (W02_I)   >    0                  */        
                                                                                
    END;          /*    DO W02_I = 1  TO   14                         */        
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /* ************************************************************** */        
    /* ********                                      **************** */        
    /* ********     INTERNE    PROCEDURER            **************** */        
    /* ********                                      **************** */        
    /* ************************************************************** */        
    /* ************************************************************** */        
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_SKRIV_BARN_AV_ROT :                                                       
      PROC;                                                                     
                                                                                
      W01_IO                                =    W01_HJELPE_IO;                 
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_ISRT,                      
                                                 RF1,                           
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF RF1.STATUS_KODE                   ^=    '  '                           
        ! UIBFCTR                          ^=    UIB_RC_OK  THEN                
        DO;                                                                     
          /* ******************************************************** */        
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */        
          /*                            RF1.STATUS_KODE               */        
          /* ******************************************************** */        
  L160:                                                                         
          FEIL_MELD_NR              =   500;                                    
          FEIL_VED_LABEL            =  '160';                                   
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                        
        END;                                                                    
    END P_SKRIV_BARN_AV_ROT;                                                    
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å FJERNE   PINNTEKT                              */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_SJEKK_INNTEKT:                                                            
      PROC;                                                                     
                                                                                
      CALL PLITDLI                         (W02_PARM_CT_5,                      
                                            W02_GHU,                            
                                            RF1,                                
                                            W01_PINT,                           
                                            SSA1_RF0PERSN,                      
                                            SSA1_PINNTEKT);                     
                                                                                
      IF UIBFCTR                     ^=     UIB_RC_OK        THEN               
         DO;                                                                    
  L170:                                                                         
            FEIL_MELD_NR              =     500;                                
            FEIL_VED_LABEL            =    '170';                               
            DB_STATUS_KODE            =     RF1.STATUS_KODE;                    
            GO TO RETUR;                                                        
         END;                                                                   
                                                                                
      IF RF1.STATUS_KODE              =    '  '              THEN               
         DO;                                                                    
            CALL PLITDLI                   (W02_PARM_CT_3,                      
                                            W02_DLET,                           
                                            RF1,                                
                                            W01_PINT);                          
                                                                                
            IF RF1.STATUS_KODE       ^=     '  '        !                       
               UIBFCTR               ^=     UIB_RC_OK        THEN               
               DO;                                                              
  L180:                                                                         
                  FEIL_MELD_NR        =     500;                                
                  FEIL_VED_LABEL      =    '180';                               
                  DB_STATUS_KODE      =     RF1.STATUS_KODE;                    
                  GO TO RETUR;                                                  
               END;                                                             
         END;                                                                   
      ELSE                                                                      
         IF RF1.STATUS_KODE          ^=    'GE'              THEN               
            DO;                                                                 
  L190:                                                                         
               FEIL_MELD_NR           =     500;                                
               FEIL_VED_LABEL         =    '190';                               
               DB_STATUS_KODE         =     RF1.STATUS_KODE;                    
               GO TO RETUR;                                                     
            END;                                                                
                                                                                
      /*------------------------------------------------------------- */        
      /* SJEKKER OM DET LIGGER EN ORDINÆR INNTEKT PÅ DET SAMME ÅRET   */        
      /* SOM DEN FÅRELØPIGE. HVIS SÅ ER TILFELLET, ER BEH. I BEREGNING*/        
      /* UTFØRT MED FEIL INNTEKT. BLANKETTEN FORKASTES MED MELDING.   */        
      /* ------------------------------------------------------------ */        
                                                                                
   /* SSA1_PINNTEKT.TYPE1 = 'O';       SATISH 042000     */                     
      CALL PLITDLI                         (W02_PARM_CT_5,                      
                                            W02_GU,                             
                                            RF1,                                
                                            W01_PINT,                           
                                            SSA1_RF0PERSN,                      
                                            SSA2_PINNTEKT);                     
           /* SATISH 042000                 SSA1_PINNTEKT);   9903*/            
                                                                                
      IF UIBFCTR                     ^=     UIB_RC_OK        THEN               
         DO;                                                                    
  L192:                                                                         
            FEIL_MELD_NR              =     500;                                
            FEIL_VED_LABEL            =    '192';                               
            DB_STATUS_KODE            =     RF1.STATUS_KODE;                    
            GO TO RETUR;                                                        
         END;                                                                   
                                                                                
      IF RF1.STATUS_KODE              =    '  '              THEN               
         DO;                                                                    
                                                                                
  L194:                                                                         
                                                                                
          IF W02_PI_TYPE     = 'J' !                                            
             W02_PI_TYPE     = 'K' !                                            
             W02_PI_TYPE     = 'L'      THEN                                    
            GO TO RETUR;                                                        
                                                                                
          IF W02_PI_TYPE     = 'B' !                                            
             W02_PI_TYPE     = 'C' !                                            
             W02_PI_TYPE     = 'D'      THEN                                    
             DO;                                                                
                 B02.PI(W02_I,W02_ÅR)  =  0 ;                                   
                 GO TO RETUR;                                                   
             END;                                                               
                                                                                
                                                                                
            FEIL_MELD_NR              =     506;                                
            FEIL_VED_LABEL            =    '194';                               
            DB_STATUS_KODE            =     RF1.STATUS_KODE;                    
            GO TO RETUR;                                                        
         END;                                                                   
      ELSE                                                                      
         IF RF1.STATUS_KODE          ^=     'GE'             THEN               
            DO;                                                                 
  L196:                                                                         
               FEIL_MELD_NR           =      500;                               
               FEIL_VED_LABEL         =     '196';                              
               DB_STATUS_KODE         =      RF1.STATUS_KODE;                   
               GO TO RETUR;                                                     
            END;                                                                
                                                                                
                                                                                
   RETUR:                                                                       
    END P_SJEKK_INNTEKT;                                                        
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LEGGE INN INNTEKTS-SEGMENTENE.                 */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_SKRIV_INNTEKT_TIL_BASEN :                                                 
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_ISRT,                      
                                                 RF1,                           
                                                 W01_PINT,                      
                                                 SSA1_RF0PERSN,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF RF1.STATUS_KODE                    ^=   '  '                           
        ! UIBFCTR                           ^=   UIB_RC_OK  THEN                
        DO;                                                                     
          /* ******************************************************** */        
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */        
          /*                            RF1.STATUS_KODE               */        
          /* ******************************************************** */        
  L200:                                                                         
          FEIL_MELD_NR              =   500;                                    
          FEIL_VED_LABEL            =  '200';                                   
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                        
        END;                                                                    
    END P_SKRIV_INNTEKT_TIL_BASEN;                                              
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å INSERTE /  REPLACE  :  TILBERPO                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_SKRIV_TILBERPO:                                                           
      PROC;                                                                     
                                                                                
      SSA_UQUAL                             =   'TILBERPO ';                    
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_GHU,                       
                                                 RF1,                           
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF  UIBFCTR                          ^=   UIB_RC_OK  THEN                 
        DO;                                                                     
          /* ******************************************************** */        
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */        
          /* ******************************************************** */        
  L210:                                                                         
          FEIL_MELD_NR                      =   500;                            
          FEIL_VED_LABEL                    =  '210';                           
          GO   TO  RETUR;                                                       
        END;                                                                    
                                                                                
      W01_IO                                =    W01_HJELPE_IO;                 
                                                                                
      IF RF1.STATUS_KODE                    =    '  '             THEN          
        DO;                                                                     
          CALL PLITDLI                          (W02_PARM_CT_3,                 
                                                 W02_REPL,                      
                                                 RF1,                           
                                                 W01_IO);                       
                                                                                
          IF  RF1.STATUS_KODE              ^=    '  '                           
            ! UIBFCTR                      ^=   UIB_RC_OK  THEN                 
            DO;                                                                 
            /* **************************************************** */          
            /*  UAKSEPTABEL KODE FRA  :   UIB                       */          
            /*                            RF1.STATUS_KODE           */          
            /* **************************************************** */          
  L220:                                                                         
            FEIL_MELD_NR              =   500;                                  
            FEIL_VED_LABEL            =  '220';                                 
            DB_STATUS_KODE            =   RF1.STATUS_KODE;                      
            GO TO     RETUR;                                                    
            END;                                                                
        END;                                                                    
      ELSE                                                                      
        IF RF1.STATUS_KODE            =    'GE'             THEN                
          DO;                                                                   
            /* **************************************************** */          
            /*  TILBERPO LÅ IKKE INNE FRA FØR .                     */          
            /* **************************************************** */          
                                                                                
            CALL P_SKRIV_BARN_AV_ROT;                                           
                                                                                
            IF   FEIL_MELD_NR         >   0                  THEN               
                 GO   TO   RETUR;                                               
          END;                                                                  
        ELSE                                                                    
          DO;                                                                   
            /* **************************************************** */          
            /*  FEIL KODE VED GHU PÅ TILBERPO                       */          
            /* **************************************************** */          
  L230:                                                                         
            FEIL_MELD_NR              =   500;                                  
            FEIL_VED_LABEL            =  '230';                                 
            DB_STATUS_KODE            =   RF1.STATUS_KODE;                      
            GO TO     RETUR;                                                    
          END;                                                                  
                                                                                
  RETUR:                                                                        
    END P_SKRIV_TILBERPO;                                                       
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å FJERNE    :   STATUS                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_FJERN_STATUS:                                                             
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_GHU,                       
                                                 RF3,                           
                                                 W01_IO,                        
                                                 SSA3_RF0PERSN,                 
                                                 SSA1_STATUS);                  
                                                                                
      IF  UIBFCTR                          ^=   UIB_RC_OK  THEN                 
        DO;                                                                     
          /* ******************************************************** */        
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */        
          /* ******************************************************** */        
  L240:                                                                         
          FEIL_MELD_NR                      =   500;                            
          FEIL_VED_LABEL                    =  '240';                           
          GO   TO  RETUR;                                                       
        END;                                                                    
                                                                                
      IF RF3.STATUS_KODE                    =    '  '             THEN          
        DO;                                                                     
          CALL PLITDLI                          (W02_PARM_CT_3,                 
                                                 W02_DLET,                      
                                                 RF3,                           
                                                 W01_IO);                       
                                                                                
          IF  RF3.STATUS_KODE              ^=    '  '                           
            ! UIBFCTR                      ^=   UIB_RC_OK  THEN                 
            DO;                                                                 
            /* **************************************************** */          
            /*  UAKSEPTABEL KODE FRA  :   UIB                       */          
            /*                            RF3.STATUS_KODE           */          
            /* **************************************************** */          
  L250:                                                                         
            FEIL_MELD_NR              =   500;                                  
            FEIL_VED_LABEL            =  '250';                                 
            DB_STATUS_KODE            =   RF3.STATUS_KODE;                      
            GO TO     RETUR;                                                    
            END;                                                                
        END;                                                                    
                                                                                
      ELSE                                                                      
        IF RF3.STATUS_KODE                 ^=    'GE'             THEN          
          DO;                                                                   
            /* **************************************************** */          
            /*  UAKSEPTABEL KODE FRA  :   RF3.STATUS_KODE           */          
            /* **************************************************** */          
  L260:                                                                         
            FEIL_MELD_NR              =   500;                                  
            FEIL_VED_LABEL            =  '260';                                 
            DB_STATUS_KODE            =   RF3.STATUS_KODE;                      
            GO TO     RETUR;                                                    
          END;                                                                  
                                                                                
  RETUR:                                                                        
    END P_FJERN_STATUS;                                                         
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å FJERNE    SISTE / NEST SISTE   STATUS FOR :    */        
    /*                                                                */        
    /*       SØKER                                                    */        
    /*       SØKERS TILKNYTTNINGER                                    */        
    /*       TILKNYTTNINGENE  TIL SØKERS TILKNYTTNINGER               */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_LEST_TILKN_FJERNET_STATUS :                                               
      PROC;                                                                     
                                                                                
      W02_DLI_FUNC                    =   'GU  '     ;                          
      SSA_UQUAL                       =   'TILKN    ';                          
                                                                                
      /************************************************************** */        
      /*  LESER TILKNYTTNINGENE TIL AKT. PERSON HVIS HAN IKKE ER DØD  */        
      /************************************************************** */        
                                                                                
      IF PERSON_IKKE_DØD                                      THEN              
                                                                                
         DO WHILE   ( P_LEST_TILKN_PCB1 );                                      
                                                                                
            SSA2_RF0PERSN.PKEY           =    W01_TILKN1.FNR_TILKN;             
            W02_DLI_FUNC                 =   'GU  '         ;                   
                                                                                
            /* *************************************************** */           
            /* LESER TILKNYTTNINGENE TIL SØKER'S TILKNYTTNINGER.   */           
            /* FJERNER DERES STATUS_SEGM. HVIS DE ER FORSKJELLIG   */           
            /* FRA SØKER.                                          */           
            /* *************************************************** */           
                                                                                
            IF W01_TILKN1.TILKNYTNINGSKODE  ^=  'D'       THEN                  
                                                                                
               DO WHILE   ( P_LEST_TILKN_PCB2 );                                
                                                                                
                  IF W01_TILKN2.FNR_TILKN ^=  SSA1_RF0PERSN.PKEY THEN           
                     DO;                                                        
                        SSA3_RF0PERSN.PKEY =  W01_TILKN2.FNR_TILKN;             
                        CALL P_FJERN_STATUS;                                    
                                                                                
                        IF FEIL_MELD_NR    >  0                  THEN           
                           GO TO  RETUR;                                        
                     END;                                                       
                                                                                
                  W02_DLI_FUNC           =   'GN  ';                            
                                                                                
               END;  /*    DO WHILE  (  P_LEST_TILKN_PCB2 )     */              
                                                                                
                                                                                
            IF FEIL_MELD_NR          >  0      THEN                             
               DO;                                                              
                  /* ****************************************** */              
                  /* FEIL VED LESING AV    :      TILKN         */              
                  /* ****************************************** */              
                                                                                
                  GO TO  RETUR;                                                 
               END;                                                             
                                                                                
            SSA3_RF0PERSN.PKEY          =  W01_TILKN1.FNR_TILKN;                
            CALL P_FJERN_STATUS;                                                
                                                                                
            IF FEIL_MELD_NR             >  0         THEN                       
               GO TO  RETUR;                                                    
                                                                                
            W02_DLI_FUNC           =   'GN  ';                                  
                                                                                
         END;       /*   DO  WHILE          ( P_LEST_TILKN_PCB1 ) */            
                                                                                
                                                                                
      IF FEIL_MELD_NR          >  0      THEN                                   
         DO;                                                                    
            /* ****************************************** */                    
            /* FEIL VED LESING AV    :      TILKN         */                    
            /* ****************************************** */                    
                                                                                
            GO TO  RETUR;                                                       
         END;                                                                   
                                                                                
      SSA3_RF0PERSN.PKEY       =     SSA1_RF0PERSN.PKEY;                        
      CALL P_FJERN_STATUS;                                                      
                                                                                
      IF FEIL_MELD_NR          >     0         THEN                             
         GO TO  RETUR;                                                          
                                                                                
  RETUR:                                                                        
    END P_LEST_TILKN_FJERNET_STATUS;                                            
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE TILKNYTTNINGENE TIL STATUS-SEGM.          */        
    /*                                                                */        
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_LEST_TILKN_PCB1 :                                                         
      PROC           RETURNS (BIT(1));                                          
                                                                                
      DCL   W01_RETUR                            BIT   (1) INIT ('0'B);         
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_6,                 
                                                 W02_DLI_FUNC,                  
                                                 RF1,                           
                                                 W01_TILKN1,                    
                                                 SSA1_RF0PERSN,                 
                                                 SSA1_STATUS,                   
                                                 SSA_UQUAL);                    
                                                                                
      IF UIBFCTR                           ^=    UIB_RC_OK        THEN          
         DO;                                                                    
            /* ************************************************** */            
            /* UAKSEPTABEL KODE FRA   :      UIB                  */            
            /* ************************************************** */            
  L270:                                                                         
            FEIL_MELD_NR                     =     500;                         
            FEIL_VED_LABEL                   =    '270';                        
         END;                                                                   
                                                                                
      SELECT  ( RF1.STATUS_KODE   );                                            
                                                                                
         WHEN ('  ' , 'GA' , 'GK' )                                             
            DO;                                                                 
             /* ************************************************ */             
             /* LEST INN EN   :   TILKN                          */             
            /* ************************************************* */             
                                                                                
            W01_RETUR                        =    '1'B;                         
         END;                                                                   
                                                                                
         WHEN ('GE' , 'GB')                                                     
            DO;                                                                 
              /* ********************************************* */               
              /* LOVLIG KODE MEN IKKE FUNNET NOEN   : TILKN    */               
              /* ********************************************* */               
                                                                                
              W01_RETUR                        =    '0'B;                       
         END;                                                                   
                                                                                
         OTHERWISE                                                              
            DO;                                                                 
               /* ************************************************* */          
               /* LEST INN EN   :   TILKN                           */          
               /* ************************************************* */          
                                                                                
  L280:                                                                         
               FEIL_MELD_NR                     =     500;                      
               FEIL_VED_LABEL                   =    '280';                     
               DB_STATUS_KODE                   =     RF1.STATUS_KODE;          
               W01_RETUR                        =     '0'B;                     
            END;                                                                
      END;     /*   SELECT (RF1.STATUS_KODE )                   */              
                                                                                
  RETUR:                                                                        
      RETURN (W01_RETUR);                                                       
    END P_LEST_TILKN_PCB1;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE TILKNYTTNINGENE TIL STATUS-SEGM.          */        
    /*                                                                */        
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_LEST_TILKN_PCB2 :                                                         
      PROC           RETURNS (BIT(1));                                          
                                                                                
      DCL   W01_RETUR                            BIT   (1) INIT ('0'B);         
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_6,                 
                                                 W02_DLI_FUNC,                  
                                                 RF2,                           
                                                 W01_TILKN2,                    
                                                 SSA2_RF0PERSN,                 
                                                 SSA1_STATUS,                   
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR                         ^=    UIB_RC_OK        THEN          
        DO;                                                                     
           /* ******************************************************* */        
           /* UAKSEPTABEL KODE FRA   :      UIB                       */        
           /* ******************************************************* */        
  L320:                                                                         
           FEIL_MELD_NR                     =     500;                          
           FEIL_VED_LABEL                   =    '320';                         
        END;                                                                    
                                                                                
      SELECT   ( RF2.STATUS_KODE );                                             
         WHEN  ( '  ' , 'GA' , 'GK' )                                           
            DO;                                                                 
               /* ************************************************** */         
               /* LEST INN EN  :    TILKN                            */         
               /* ************************************************** */         
                                                                                
               W01_RETUR                        =    '1'B;                      
            END;                                                                
                                                                                
         WHEN  ( 'GE' , 'GB' )                                                  
            DO;                                                                 
               /* ************************************************** */         
               /* FINNES IKKE  :    TILKN                            */         
               /* ************************************************** */         
                                                                                
               W01_RETUR                        =    '0'B;                      
            END;                                                                
                                                                                
         OTHERWISE                                                              
            DO;                                                                 
               /* ************************************************* */          
               /* UAKSEPTABEL KODE FRA   :      RF1.STATUS_KODE     */          
               /* ************************************************* */          
  L330:                                                                         
               FEIL_MELD_NR                     =     500;                      
               FEIL_VED_LABEL                   =    '330';                     
               DB_STATUS_KODE                   =     RF2.STATUS_KODE;          
               W01_RETUR                        =     '0'B;                     
            END;                                                                
      END;                                                                      
                                                                                
  RETUR:                                                                        
      RETURN (W01_RETUR);                                                       
    END P_LEST_TILKN_PCB2;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /* PROCEDURE FOR A SKRIVE UNDERLIGGENDE SEGMENTER TIL           */          
    /*                                                              */          
    /* STATUS-SEGM.                                                 */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
    P_SKRIV_BARN_AV_STATUS :                                                    
      PROC;                                                                     
                                                                                
      W01_IO                           =    W01_HJELPE_IO;                      
      CALL PLITDLI                         (W02_PARM_CT_6,                      
                                            W02_ISRT,                           
                                            RF1,                                
                                            W01_IO,                             
                                            SSA1_RF0PERSN,                      
                                            SSA1_STATUS,                        
                                            SSA_UQUAL);                         
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                           
        !  RF1.STATUS_KODE            ^=   '  '    THEN                         
        DO;                                                                     
           /* ******************************************************* */        
           /* UAKSEPTABEL KODE FRA   :      UIB                       */        
           /*                               RF1.STATUS_KODE           */        
           /* ******************************************************* */        
  L340:                                                                         
           FEIL_MELD_NR                     =     500;                          
           FEIL_VED_LABEL                   =    '340';                         
           DB_STATUS_KODE                   =     RF1.STATUS_KODE;              
        END;                                                                    
    END P_SKRIV_BARN_AV_STATUS;                                                 
                                                                                
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /* PROCEDURE FOR A SKRIVE UNDERLIGGENDE SEGMENTER TIL           */          
    /*                                                              */          
    /* STATUS-SEGM. FOR UFØRE-HISTORIKKEN.                          */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
    P_SKRIV_BARN_AV_UFØRHIST:                                                   
      PROC;                                                                     
                                                                                
      W01_IO                           =    W01_HJELPE_IO;                      
      CALL PLITDLI                         (W02_PARM_CT_7,                      
                                            W02_ISRT,                           
                                            RF1,                                
                                            W01_IO,                             
                                            SSA1_RF0PERSN,                      
                                            SSA1_STATUS,                        
                                            SSA1_UFØRHIST,                      
                                            SSA_UQUAL);                         
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                           
        !  RF1.STATUS_KODE            ^=    '  '    THEN                        
        DO;                                                                     
          /* ******************************************************** */        
          /*  UAKSEPTABEL KODE FRA  :   UIB                           */        
          /*                            RF1.STATUS_KODE               */        
          /* ******************************************************** */        
  L350:                                                                         
          FEIL_MELD_NR              =   500;                                    
          FEIL_VED_LABEL            =  '350';                                   
          DB_STATUS_KODE            =   RF1.STATUS_KODE;                        
        END;                                                                    
    END P_SKRIV_BARN_AV_UFØRHIST;                                               
                                                                                
                                                                                
     P_SKRIV_BARN_AV_YRKEHIST:                                                  
           PROC;                                                                
                                                                                
           W01_IO                      =    W01_HJELPE_IO;                      
           CALL PLITDLI                    (W02_PARM_CT_7,                      
                                                 W02_ISRT,                      
                                                 RF1,                           
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN,                 
                                                 SSA1_STATUS,                   
                                                 SSA1_YRKEHIST,                 
                                                 SSA_UQUAL);                    
                                                                                
           IF DLIUIB.UIBRCODE.UIBFCTR ^=    UIB_RC_OK                           
             ! RF1.STATUS_KODE        ^=    '  '    THEN                        
             DO;                                                                
               /* *************************************************** */        
               /* UAKSEPTABEL KODE FRA : UIB                          */        
               /*                       RF1.STATUS_KODE               */        
               /* *************************************************** */        
       L360:                                                                    
               FEIL_MELD_NR         =   500;                                    
               FEIL_VED_LABEL       =  '360';                                   
               DB_STATUS_KODE       =   RF1.STATUS_KODE;                        
             END;                                                               
         END P_SKRIV_BARN_AV_YRKEHIST;                                          
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE SJEKKE OM DET FINNES SPESIALOPPLYSNINGER             */        
    /*                                                                */        
    /* PROCEDUREN RETURNERER MED VERDIEN SANN (1) / USANN (0) .       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P_SPESIALOPPLYSNINGER :                                                     
      PROC                   (SPESOPPL)                                         
                     RETURNS (BIT(1));                                          
                                                                                
      DCL   W01_RETUR                         BIT   (1) INIT ('0'B);            
                                                                                
      /* ************************************************************ */        
      /*   OMRÅDET FOR  :    SPESIALOPPLYSNINGER                      */        
      /* ************************************************************ */        
                                                                                
      DCL 1 SPESOPPL,                                                           
      %INCLUDE P0019939;               /* SPESOPPL                   */         
                                                                                
      /* ************************************************************ */        
      /*    FERDIG MED DEKLARASJONENE .                               */        
      /*                                                              */        
      /*    EKSEKVERINGEN STARTER.                                    */        
      /* ************************************************************ */        
                                                                                
      SELECT;                                                                   
        WHEN (SPESOPPL.STATSBORGER              ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_FLYKTN            ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.OVERKOMP_UTL             ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.BOSATT                   ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_BOSATT            ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_TRYGDET_3ÅR       ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_19_3              ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_8_1               ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_10_1              ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.KONVENSJON               ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.IKKE_GP                  ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TRYGDET_DØD              ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TRYGDET_3ÅR_DØD          ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.UFØR_UNDER_BOTID         ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_FRAMT_UFT             ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_FRAMT_VED_FRAVIK_8_1  ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_FRAMT_DØD             ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_FRAMT_VED_FRAVIK_10_1 ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_VENT_UTL              ^= 0 )                          
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.IKKE_TT_FRAMT_DØD        ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.PENSJONSTRYGDET          ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.MINST_20ÅR_BOTID         ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_BOSATT_KONVENSJON ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.KONVENSJON_LAND          ^= 0   )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_BOSATT_EØS        ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TP_NORDISK               ^= 0   )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TP_NORDISK_LAND          ^= 0   )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_KONVENSJON_ÅR         ^= 0   )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.UNNTAK_12_2              ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_PÅ                    ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_FRAMTIDIG             ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.TT_FAKTISK               ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.FRAVIK_5_1               ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        WHEN (SPESOPPL.UNG_UFØR                 ^= ' ' )                        
              W01_RETUR            = '1'B;                                      
        OTHERWISE                                                               
              W01_RETUR            = '0'B;                                      
      END;                                                                      
      RETURN (W01_RETUR);                                                       
    END P_SPESIALOPPLYSNINGER;                                                  
                                                                                
                                                                                
                                                                                
    %INCLUDE R0015430; /* PROC. FOR Å SKRIVE :        SISTE STATUS   */         
    %INCLUDE R0015470; /* PROC. FOR Å SKRIVE :   NEST SISTE STATUS   */         
    %INCLUDE R0019947; /* ÅRDAGNR = R0019947(DATO)                   */         
                                                                                
  L999:                                                                         
                                                                                
                                                                                
    DIV_PERIODE = '';                                                           
                                                                                
                                                                                
    EXEC CICS RETURN;                                                           
  END  R001540;                                                                 
