 /*   SIST ENDRET PÅ PROD   2006.10.27 13.34.34 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.09.26  9.29.34 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.09.25  8.50.43 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.09.22 13.04.53 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.09.22 13.02.08 AV   SPA2990          */        
 R001XX:                                                                        
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                          
  /* TEST PROGRAM                                        */                     
  /* TEST PROGRAM                                        */                     
  /* TEST PROGRAM                                        */                     
  /* TEST PROGRAM                                        */                     
  /* TEST PROGRAM                                        */                     
  /* TEST PROGRAM                                        */                     
                                                                                
 /* ***************************************************************** */        
 %PAGE;                                                                         
                                                                                
   DCL                                                                          
      (COMMAREA_PEKER,BMSMAPBR)              PTR;                               
   DCL                                                                          
      (CSTG , STG, ADDR , UNSPEC , NULL , SUBSTR )       BUILTIN;               
      %INCLUDE S00118;  /*  PENSJON BREV          */                            
 %SKIP(2);                                                                      
      %INCLUDE P0019908;               /*  KOM_OMR         (BASED)  */          
 %SKIP;                                                                         
      %INCLUDE P0019906;               /*  TRANS_OPPL_OMR  (BASED)  */          
 %PAGE;                                                                         
      %INCLUDE P0019910;               /*  STYRINGS_OMR    (BASED)  */          
 %PAGE;                                                                         
      %INCLUDE P0019912;               /*  DIV_PARAM_OMR   (BASED)  */          
 %PAGE;                                                                         
      %INCLUDE P0019924;               /* G_V_TAB                   */          
 %PAGE;                                                                         
      %INCLUDE P0019925;               /* G_TAB                     */          
    /*                                                                          
    */                                                                          
    DCL SYSPRINT           EXTERNAL FILE;                                       
    /* ************************************************************** */        
    /*                                                                */        
    /*   DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTNINGS-    */        
    /*   KALL                                                         */        
    /*                                                                */        
    /**************************************************************** */        
       DCL                                                                      
         PLITDLI                     ENTRY;                                     
                                                                                
       DCL                                                                      
         1 W001_DLI                  UNALIGNED,                                 
                                                                                
           2  W01_PSB_R001           CHAR (8)       INIT('        '),           
           2  W01_PSB_NAVN           CHAR (8)       INIT('        '),           
           2  W01_PCB_FUNCTION       CHAR (4)       INIT('PCB '),               
           2  W01_TERM_FUNCTION      CHAR (4)       INIT('TERM'),               
           2  S_MELDNR               PIC '9'        INIT( 0 ),                  
           2  W01_PARM_CT_1          FIXED BIN(31)  INIT(1),                    
           2  W01_PARM_CT_3          FIXED BIN(31)  INIT(3);                    
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
       DCL                                                                      
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );           
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   PCB- OG UIB-OMR.                                             */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE  P0012002;                  /* PCB-UIB-PEKER OMR  BASED  */        
    %INCLUDE  P0014009;                  /* POTALL_OPPL   BASED  */             
                                                                                
                                                                                
 DCL 01 BRUKERINFO_REC,                                                         
        02 FNR                  PIC '(11)9',                                    
        02 BLANKET_TYPE         CHAR (2)   ,                                    
        02 TERMINAL_NR          CHAR (4)   ,                                    
        02 BRUKER_ID            CHAR (8)   ,                                    
        02 F1                   CHAR (5)   ,                                    
        02 DATO                 PIC '(8)9' ,                                    
        02 TID                  PIC '(7)9' ,      /* HHHMMSS  */                
        02 KJORINGS_TYPE        CHAR (1)   ,                                    
        02 FIL1                 CHAR (06)  ;                                    
                                                                                
  DCL  HJELP_TID         FIXED DEC(7,0);                                        
                                                                                
   DCL BRUK_LOGG     POINTER;                                                   
   DCL ANT_FEIL_SKREVET        FIXED DEC (3)  INIT (0);                         
    /* ************************************************************** */        
    /*   FEILMELDINGS-LINJE .                                         */        
    /* ************************************************************** */        
                                                                                
    DCL   W01_UTLINJE           CHAR (78)     INIT ( (78)' ' );                 
                                                                                
                                                                                
    DCL GRUNN_OMR1         CHAR      (1330);                                    
    DCL GRUNN_OMR2         CHAR      (1330);                                    
    DCL GRUNN_IDENT        CHAR      ( 8);                                      
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    ALLOCATE                    POTALL_OPPL  ;                                  
    ALLOCATE                    GV_TAB_RE    ;                                  
    ALLOCATE                    G_TAB_RE     ;                                  
    KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1 ) ;                             
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2 ) ;                             
    POTALL_OPPL              =  ''           ;                                  
    GV_TAB_RE                =  ''           ;                                  
    G_TAB_RE                 =  ''           ;                                  
                                                                                
       W01_PSB_NAVN     =  DIV_PARAM_OMR.PSB_NAVN;                              
                                                                                
                                                                                
                                                                                
                                                                                
    GRUNN_IDENT                     = 'P0019924';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                              
                                                                                
                                                                                
    GRUNN_IDENT                     = 'P0019925';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                              
                                                                                
                                                                                
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */                      
                                                                                
 %INCLUDE R0019944;          /*     SKRIV_FEIL          */                      
                                                                                
   END R001XX;                                                                  
