 /*   SIST ENDRET PÅ PROD   2007.02.21 14.40.53 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2007.02.06 12.50.08 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.10.16 14.46.09 AV   JDA2990          */        
 /*   SIST ENDRET PÅ QASS   2006.06.21 12.27.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.06.21 12.25.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.05.12 10.16.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.48.11 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.43 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.46 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.21 11.44.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.11.11 14.37.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.11.03 12.11.09 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.11.03 12.10.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.44.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 13.58.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.47.37 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.12 14.24.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.02 13.04.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.10.20 11.43.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.17 14.43.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.10.16  9.42.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.16  9.31.08 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.08.20  8.49.38 AV   HLA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.15 12.01.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.05.23 12.28.29 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.12  9.15.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.04.25  8.02.31 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.25 12.11.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.24  9.58.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.01.02 10.40.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.03.04  8.56.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.02.21 11.38.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.02.18 12.03.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.09.26 12.12.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.14 14.50.13 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.02.16 12.06.31 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.15 12.57.25 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.15 11.48.20 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.14 14.49.36 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.18 14.48.25 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.04 12.08.39 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.02 13.24.50 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.15 11.51.39 AV   JDA7339          */        
 /*       SIST ENDRET 20/05-99 12.33.02 AV   JDA7339                  */        
 /*       SIST ENDRET 20/05-99 12.32.13 AV   JDA7339                  */        
 /*       SIST ENDRET 16/04-99 10.55.29 AV   JDA7339                  */        
 /*       SIST ENDRET 16/04-99 10.54.19 AV   JDA7339                  */        
 /*       SIST ENDRET 03/03-99 14.13.08 AV   JDA7339                  */        
 /*       SIST ENDRET 03/03-99 14.11.07 AV   JDA7339                  */        
 /*       SIST ENDRET 02/11-98 15.35.20 AV   TSB7339                  */        
 /*       SIST ENDRET 02/11-98 15.34.29 AV   TSB7339                  */        
 /*       SIST ENDRET 20/07-98 10.03.42 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.41.43 AV   JDA7339                  */        
 /*-------------------------------------------------------------------*/        
 /*       SIST ENDRET 04/01-90          AV   TUYEN                    */        
 /* ENDRINGER GJELDER FOR DE PERSONNER SOM HAR AVTJENT VERNEPLIKT     */        
 /* I 2 ÅR (ELLER MER) I REKKEFØLGE.                                  */        
 /* FOR DISSE PERSONNER ER GARANTI I VERNEPLIKTSÅR STØRST AV:         */        
 /*       -  2 POENG (VERNEPLIKTSPOENGGARANTI)                        */        
 /*       -  STØRST AV INNT_POENG FØR VERNEPL_ÅR OG                   */        
 /*                 VERNEPL_POENG FØR VERNEPL_ÅR                      */        
 /*       -  INNT_POENG I VERNEPL_ÅR                                  */        
 /*-------------------------------------------------------------------*/        
 /*                                                                   */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014152 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN STYRER BEHANDLINGEN FOR UTVELGING AV POENG FOR HVERT   */        
 /*    ENKELT ÅR SOM SKAL VÆRE GRUNNLAG FOR BEREGNING AV SPT, OPT     */        
 /*    OG PÅ.                                                         */        
 /*                                                                   */        
 /*    OPPDATERER UFØRHIST.BUP  (FRA TAB.BUP_FPP(UFØR_ÅR))            */        
 /* ENDRET I OKTOBER 92 - HL : NY POENGBEREGNING                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BEREGN_POENGREKKE: PROC(IND,W_FNR13);                    /*2000*/              
    DCL                                                                         
      (I,                                                                       
       X,                                                                       
       UFØR_ÅR,                                                                 
       FØRST_REG,                                                               
       HJ_YNGSTE_BARN_FÅR,    /* JFA 29.5.02 */                                 
       SIST_REG,                                                                
       IND,                                                                     
       IND_EK                                                                   
      )             FIXED BIN(15),                                              
       MAX          BUILTIN      ;                                              
                                                                                
    DCL W_FNR13          PIC'(13)9';            /*2000*/                        
    DCL 1 W_FNR_R13 DEF W_FNR13,/*2000*/                                        
          2 DAG         PIC'99',                                                
          2 MND         PIC'99',                                                
          2 ÅR          PIC'9999',   /*2000*/                                   
          2 ÅRHUNDRE    PIC'9',                                                 
          2 RESTEN      PIC'9999';                                              
                                                                                
    DCL                                                                         
       UTTAKSDATO_Å  FIXED DEC(5) INIT(0),     /*2000*/                         
       TILLEGGS_ÅR  FIXED DEC(5) INIT(0),      /*2000*/                         
       STOPP_ÅR     FIXED DEC(5) INIT(0),      /*2000*/                         
       SLUTT_ÅR     FIXED DEC(5) INIT(0),      /*2000*/                         
       FYLLER_66_ÅR FIXED DEC(5) INIT(0),      /*200204*/                       
       FYLLER_67_ÅR FIXED DEC(5) INIT(0),      /*2000*/                         
       FYLLER_69_ÅR FIXED DEC(5) INIT(0),      /*2000*/                         
       W_PI         FIXED DEC(9) INIT(0),                                       
       VERNEPL_ÅR   FIXED DEC(5) INIT(0),       /*2000*/                        
       ALDER_PÅ_VIRK_DATO                         PIC'(5)9' INIT(0),            
       ALDER_ÅR DEF ALDER_PÅ_VIRK_DATO POS(1)     PIC'(3)9';                    
     DCL ALDER_VED_DØD          PIC       'S99999';                             
     DCL ALDER_UF               PIC       'S99999';                             
     DCL FØDT_ÅR_MND            PIC      'S999999';                             
     DCL UFØR_DATO_ÅMD          PIC     '99999999'   INIT(0);/*2000*/           
     DCL FIXED_DEC5             FIXED DEC  (5)     INIT(0);                     
     DCL GARANTI_FOR_DØD        FIXED DEC (3,2)    INIT(0);                     
                                                                                
     DCL SØTTI                  FIXED DEC  (5)     INIT(7000);                  
     DCL BUP_MAX                FIXED DEC  (5)     INIT(0);  /*TSY2K*/          
     DCL START_UFPERIODE        FIXED DEC  (5)     INIT(0);  /*HL*/             
     DCL SUM                    FIXED DEC (7,4)    INIT(0);                     
     DCL SUM92                  FIXED DEC (7,4)    INIT(0);                     
     DCL ANTALL                 FIXED DEC (3)      INIT(0);                     
     DCL GARANTI_KODE           CHAR (1) INIT (' ');  /*9708 HL*/               
     DCL POENG_66               FIXED DEC (3,2)    INIT(0);  /*JFA*/            
     DCL MAX_INNT         FIXED DEC (3,2) INIT (0);                             
     DCL W_UFG            FIXED DEC (3)   INIT(0);                              
                                                                                
    /* ========== START EKSEKVERING UNDERMODUL R0014152 ============ */         
                                                                                
    FØRST_REG = 1;                                                              
    SIST_REG  = 1;                                                              
                                                                                
                                                                                
    FIXED_DEC5 = F_ALDER(W_FNR11,(B02.VIRK_DATO_ÅMD(IND))); /*2000*/            
    ALDER_PÅ_VIRK_DATO = FIXED_DEC5;                                            
      FYLLER_66_ÅR = W_FNR_R13.ÅR + 66;        /*200204*/                       
      FYLLER_69_ÅR = W_FNR_R13.ÅR + 69;        /*200510*/                       
                                                                                
    IF B02.VIRK_DATO_ÅMD(IND) > 19910000       THEN     /*2000*/                
       SØTTI = 7001;  /*ENDRET ALDERSGRENSE - HL */                             
                                                                                
    DO I = 1 TO 7  WHILE(B02.UFT_ÅMD(IND,I) > 0);  /*2000*/                     
       SIST_REG = I;                                                            
    END;                                                                        
                                                                                
    IF B02.UFT_ÅMD(IND,FØRST_REG) > 0 THEN         /*2000*/                     
       CALL LEGG_UFØREHIST_I_TAB(IND,W_FNR_R13.ÅR);  /* 4161 */                 
                                                                                
    IF B02.YRKEHIST.YUFT_ÅMD(IND,1) > 0 THEN          /*2000*/                  
       CALL LEGG_YRKEHIST_I_TAB(IND,W_FNR_R13.ÅR);   /* YS* 4166  */            
                                                                                
    IF (B02.PENSJONSTYPE1(IND) = 'K' !                                          
        B02.KONV_P_KODE  (IND) = 'K' !                                          
       (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &                          
        W_FNR_R13.ÅR > 1924                            )  !                     
        B02.KONV_P_KODE  (IND) = 'O' ) THEN                                     
       DO;                                                                      
          FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;        /*2000*/                     
          FØDT_ÅR_MND  = W_FNR_R13.ÅR * 100 + W_FNR_R13.MND;                    
          UTTAKSDATO_Å = B02.UTTAKSDATO_ÅMD(IND) / 10000;  /*2000*/             
          CALL LEGG_AFPHIST_I_TAB(IND,W_FNR_R13.ÅR);  /*4168-AFP*/              
       END;                                                                     
                                                                                
          /* --------------------------------------------------------*/         
          /* TAB SKAL OPPDATERES MED OMSORGSKODE, REGEL FRA 92       */         
          /* 'J' FOR BARN 'K', 'L' FOR ANDRE . TRUDE 010394          */         
          /* --------------------------------------------------------*/         
                                                                                
    DO I = 1992 TO (DAGENS_DATO.ÅR - 1);                                        
 /*  IF  B01.PI_KODE(IND,I) ^= ' '  THEN   9903*/                               
       IF (B01.PI_KODE(IND,I)  = 'J' !                                          
           B01.PI_KODE(IND,I)  = 'K' !                                          
           B01.PI_KODE(IND,I)  = 'L' !                                          
           B01.PI_KODE(IND,I)  = 'M' ) THEN   /*OMSORG + FORELØPIG*/            
          TAB.OMSORG_KODE(I)       = 'J';                                       
    END; /* OMSORGSKODE HIT */                                                  
                                                                                
    /* JFA 18.12.00 - NY LOV FOR AP FRA 1.2.2001 */                             
    IF  B02.PENSJONSTYPE1(IND)  = 'A'   &                                       
       (B02.UTTAKSDATO_ÅMD(IND) > 20010101  !                                   
        FØDT_ÅR_MND             > 193400      )  &                              
        ALDER_PÅ_VIRK_DATO      < SØTTI     THEN                                
       DO;                                                                      
         FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;                                      
         DO I = 2000 TO (DAGENS_DATO.ÅR);                                       
           IF (I = (FYLLER_67_ÅR - 1))     &                                    
   /*HVIS DET IKKE ER REGISTRERT ORDINÆR INNTEKT SETTES KODEN 'J' */            
   /*KODEN SETTES IKKE HVIS DET ER MELDT EN ORDINÆR 0-INNTEKT     */            
   /*O = ORDINÆR INNTEKT, F = FORELØPIG INNTEKT, M = FORELØPIG    */            
   /*    INNTEKT OG OMSORGSPOENG                                  */            
                                                                                
              (B01.PI(IND,I)       =  0   &                                     
               B01.PI_KODE(IND,I) ^= 'O'    )    !                              
               B01.PI_KODE(IND,I)  = 'F'         !                              
               B01.PI_KODE(IND,I)  = 'M'               THEN                     
              DO;                                                               
                B02.PI_66_65(IND)   = 'J'; /* SETT MERKE I ROT */               
                I = DAGENS_DATO.ÅR;                                             
              END;                                                              
         END;                                                                   
       END;                                                                     
                                                                                
                                                                                
    IF (B02.DØDSDATO_ÅMD(IND) > 0    &                                          
        B02.PENSJONSTYPE1(IND) = 'D' ) THEN                                     
       DO;  /* DØD OG PENSJONSTYPE1 = D */                                      
          FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;                                     
          FYLLER_69_ÅR = W_FNR_R13.ÅR + 69;                                     
          IF (DØDSDATO.ÅR  < 1973 !                                             
              W_FNR_R13.ÅR < 1903 ) THEN                                        
             STOPP_ÅR = FYLLER_69_ÅR;                                           
          ELSE                                                                  
          IF (W_FNR_R13.ÅR < 1906) THEN                                         
             STOPP_ÅR = 1972;                                                   
          ELSE                                                                  
             STOPP_ÅR = FYLLER_67_ÅR - 1;                                       
          IF (DØDSDATO.ÅR <= STOPP_ÅR)THEN                                      
          /*  DØDSDATO.ÅR > 1990      ) THEN */                                 
             DO;  /* DØDSÅR MINDRE ELLER LIK STOPP_ÅR */                        
                TAB.UFØR_START_MND(DØDSDATO.ÅR) = DØDSDATO.MND;                 
                TAB.UFØR_PERIODE(DØDSDATO.ÅR)   = 'D';                          
                IF B02.STATUS.VILKÅR_8_4_3A(IND) = 'J'      THEN                
                   TAB.UFØR_KRIT(DØDSDATO.ÅR)   = 3;                            
                IF DØDSDATO.ÅR > 1990      &                                    
                   B02.TT_FRAMT(IND) > 0   &  /*200007 HL*/                     
                   (B02.TT_FRAMT(IND) <                                         
                   F_BEREGN_TT_FRAMT(B02.FNR(IND),DØDSTPKT)) THEN               
                   DO;  /* ER REDUSERT ETTER 4/5 DELS REGELEN */                
              /*      BUP_MAX = DØDSDATO.ÅR +                                   
                         ((B02.TT_FRAMT(IND) + 6) / 12); */                     
                      BUP_MAX = DØDSDATO.ÅR - 1 +                               
                         ((B02.TT_FRAMT(IND) + 6) / 12);                        
                      /* 140900 FIKK DØDSÅRET "GRATIS" - MH */                  
                   /* IF (BUP_MAX <  FYLLER_67_ÅR - 1) THEN                     
                          BUP_MAX = BUP_MAX - 1; */                             
                   END; /* ER REDUSERT ETTER 4/5 DELS REGELEN */                
                ELSE                                                            
                   BUP_MAX = STOPP_ÅR;                                          
                TAB.SISTE_BUP_ÅR(BUP_MAX) = 'J';                                
                IF (BUP_MAX < STOPP_ÅR) THEN      /*0395 HL*/                   
                   STOPP_ÅR = BUP_MAX;                                          
             END; /* DØDSÅR MINDRE ELLER LIK STOPP_ÅR */                        
          ELSE                                                                  
             TAB.UFØR_PERIODE(STOPP_ÅR + 1)   = 'A';                            
                                                                                
        IF DØDSDATO.ÅR < STOPP_ÅR THEN                                          
           DO I = DØDSDATO.ÅR + 1 TO STOPP_ÅR;                                  
              TAB.UFØR_PERIODE(I) = 'F';                                        
           END;                                                                 
                                                                                
                                                                                
  IF B02.BUP_GAR_KODE(IND,1) = 'D'  THEN /*VENTER PÅ RETT*/                     
     DO;                                                                        
        FIXED_DEC5   = F_ALDER(W_FNR11,(B02.UFØRHIST.UFT_ÅMD(IND,1)));          
        ALDER_UF     = FIXED_DEC5;                                              
        CALL UNGE_DØDE_B_E(VIRK_LOV92_ÅM,W_FNR_R13.ÅR,ALDER_UF,                 
                      GARANTI_FOR_DØD,GARANTI_KODE); /*4159*/                   
        IF GARANTI_KODE ^= ' '           THEN                                   
           DO K = 1 TO 7 WHILE(B02.UFØRHIST.UFT_ÅMD(IND,K) > 0);/*2000*/        
              B02.BUP_GAR_KODE(IND,K) = GARANTI_KODE;                           
           END;                                                                 
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        FIXED_DEC5    = F_ALDER(W_FNR11,(B02.DØDSDATO_ÅMD(IND)));               
        ALDER_VED_DØD = FIXED_DEC5;                                             
                                                                                
        IF ALDER_VED_DØD < 2601         THEN                                    
           CALL UNGE_DØDE_B_E(VIRK_LOV92_ÅM,W_FNR_R13.ÅR,ALDER_VED_DØD,         
                      GARANTI_FOR_DØD,GARANTI_KODE); /*4159*/                   
     END;                                                                       
                                                                                
        IF B02.BOSATT(IND)  > 0 &                                               
           B02.STATSBORGER(IND) > 0 THEN                                        
           DO;                                                                  
              GARANTI_FOR_DØD  = 0;                                             
              GARANTI_KODE = ' ';                                               
           END;                                                                 
                                                                                
        IF GARANTI_FOR_DØD > 0               THEN                               
              DO I = DØDSDATO.ÅR TO STOPP_ÅR;                                   
                 TAB.POENGGARANTI(I)      = GARANTI_FOR_DØD;                    
                 TAB.POENGGARANTI_KODE(I) = 'B';                                
              END;                                                              
        IF GARANTI_KODE = 'E'                  THEN                             
           B02.TP_GAR_KODE(IND)        = 'E';                                   
                                                                                
                                                                                
     END;  /*END PT1 = 'D' */                                                   
                                                                                
 /*                                                                   */        
 /*  INNTEKTER I ÅRENE FØR 1967 ER BARE AKTUELLE NÅR UFØRETIDSPUNKTET */        
 /*  ELLER DØDSTIDSPUNKTET ER FØR 1971.                               */        
 /*                                                                   */        
                                                                                
                                                                                
  IF W_FNR_R13.ÅR            <  1904       !     /*2000*/                       
     (B02.UFT_ÅMD(IND,SIST_REG) >  0     &      /*2000*/                        
      B02.UFT_ÅMD(IND,SIST_REG) <  19730100)    !   /*2000*/                    
     (B02.DØDSDATO_ÅMD(IND)    >  0     &                                       
     B02.DØDSDATO_ÅMD(IND)     <  19730101)        THEN  /*2000*/               
                                                                                
     SLUTT_ÅR = W_FNR_R13.ÅR + 69;                                              
                                                                                
  ELSE                                                                          
                                                                                
     IF W_FNR_R13.ÅR = 1904 THEN              /*2000*/                          
        SLUTT_ÅR = W_FNR_R13.ÅR + 68;                                           
                                                                                
     ELSE                                                                       
                                                                                
        IF W_FNR_R13.ÅR = 1905 THEN          /*2000*/                           
           SLUTT_ÅR = W_FNR_R13.ÅR + 67;                                        
        ELSE                                                                    
           SLUTT_ÅR = W_FNR_R13.ÅR + 66;                                        
                                                                                
                                                                                
                                                                                
  DO I = 1967 TO (DAGENS_DATO.ÅR - 1);         /*2000*/                         
                                                                                
     IF B02.PI(IND,I) > 0                &                                      
        ^(TAB.UFØR_PERIODE(I) = 'L' ! TAB.UFØR_PERIODE(I) = 'F') THEN           
                                                                                
  /* 'L' = LØPENDE UFØREÅR.  'F' = FREMTIDIG PENSJONSPOENG      */              
                                                                                
        DO;                                                                     
           W_PI              = B02.PI(IND,I);   /*200504*/                      
                                                                                
  /*HVIS FELTET NY_3_19 = 'J', SÅ SKAL DET REGNES UTEN UFØRGRAD  */             
             IF TAB.UFØR_PERIODE(I) = 'M'       &                               
                TAB.NY_3_19     (I) = ' '         THEN                          
                                                                                
    /* 'M' = MELLOMLIGGENDE UFØREÅR                               */            
                                                                                
                DO;                                                             
    /*JFA26.6.03   IF B02.KONV_P_KODE (IND) = 'O' THEN REMEDY 369*/             
                   IF B02.KONV_P_KODE (IND) = 'O'  &                            
 /*    (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &                          
        W_FNR_R13.ÅR > 1924                    ))    THEN  */                   
        /* REMEDY 369 OG 374 JFA 18.2.04 */                                     
                      TAB.UFØR_KRIT(I)  = 6  THEN  /*AFP */                     
                      DO;                                                       
                        W_UFG = TAB.UFØR_GRAD(I);                               
                        TAB.UFØR_GRAD(I) = 0;                                   
                      END;                                                      
                                                                                
                   TAB.INNT_POENG(I) =                                          
   /* 4163 */                    F_INNTEKT_POENG(W_PI,I,GV(I),                  
                                                 TAB.UFØR_GRAD(I));             
                   TAB.INNT_POENG_LOV92(I) =                                    
   /* 4172 */                    F_INNTEKT_POENG_LOV92(W_PI,I,GV(I),            
                                                 TAB.UFØR_GRAD(I));             
                                                                                
    /*JFA26.6.03   IF B02.KONV_P_KODE (IND) = 'O'  THEN */                      
                   IF  B02.KONV_P_KODE (IND) = 'O'  &                           
 /*    (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &                          
        W_FNR_R13.ÅR > 1924                ))    THEN      */                   
                    TAB.UFØR_KRIT(I)  = 6  THEN  /*AFP */                       
                    TAB.UFØR_GRAD(I) = W_UFG;                                   
                                                                                
                 IF TAB.INNT_POENG(I) > 0 &                                     
                                      TAB.UFØR_GRAD(I) > 0 THEN                 
 /*                                                                   */        
 /*       (VED UTREGNING AV POENGET ER DET TATT HENSYN TIL UFØREGRAD) */        
 /*                                                                   */        
                       IF TAB.UFØR_KRIT(I)  = 6          THEN                   
             /*           TAB.POENG_KODE(I) = 'U57';       KODE 'D' */          
                          TAB.POENG_KODE(I) = 'U44';     /*KODE 'N' */          
                       ELSE                                                     
                          TAB.POENG_KODE(I) = 'U59';       /*'F'*/              
                                                                                
              END;                                                              
                                                                                
           ELSE                                                                 
                                                                                
              DO;                                                               
                 TAB.INNT_POENG(I) =                                            
 /* 4163 */                       F_INNTEKT_POENG(W_PI,I,GV(I),0);              
                 TAB.INNT_POENG_LOV92(I) =                                      
 /* 4172 */                    F_INNTEKT_POENG_LOV92(W_PI,I,GV(I),0);           
              END;                                                              
        END;                                                                    
                                                                                
  END;  /* I = 1967 TO (DAGENS_DATO.ÅR - 1); */                                 
                                                                                
                                                                                
                                                                                
  IF B02.PENSJONSTYPE1(IND) = 'K'    !                                          
    (B02.KONV_P_KODE  (IND) = 'K' &                                             
     B02.PENSJONSTYPE1(IND) ^= 'D' &          /*290396 HL*/                     
    ALDER_PÅ_VIRK_DATO     < SØTTI )   THEN                                     
                                                                                
    DO;                                                                         
 /*AFP  FAKTISK INNTEKT SKAL BARE NYTTES TOM ÅRET FØR UTTAK AV AFP*/            
 /*TESTEN ENDRET 200510 HL : */                                                 
      DO I = UTTAKSDATO_Å TO FYLLER_69_ÅR;                                      
         TAB.INNT_POENG(I)       = 0;                                           
         TAB.INNT_POENG_LOV92(I) = 0;                                           
      END;                                                                      
  /*   TAB.INNT_POENG(UTTAKSDATO_Å) = 0;                                        
       TAB.INNT_POENG_LOV92(UTTAKSDATO_Å) = 0;                                  
       TAB.INNT_POENG(UTTAKSDATO_Å + 1) = 0;                                    
       TAB.INNT_POENG_LOV92(UTTAKSDATO_Å + 1) = 0;  */                          
                                                                                
 /*AFP  FAKTISK INNTEKT MÅ LEGGES INN FOR ÅRET FØR UTTAKSÅRET */                
                                                                                
       IF DAGENS_DATO.ÅR < UTTAKSDATO_Å    THEN                                 
                                                                                
          DO;                                                                   
             I = DAGENS_DATO.ÅR;                                                
             IF TAB.INNT_POENG(I)        = 0    THEN                            
                                                                                
             DO;                                                                
                W_PI           = B02.PI(IND,I);   /*200504*/                    
                TAB.INNT_POENG(I) = F_INNTEKT_POENG(W_PI,I,GV(I),               
  /*4163*/                                       TAB.UFØR_GRAD(I));             
                TAB.INNT_POENG_LOV92(I) =                                       
                            F_INNTEKT_POENG_LOV92(W_PI,I,GV(I),                 
  /*4172*/                                       TAB.UFØR_GRAD(I));             
       /*       TAB.POENG_KODE(I) = 'U57';       */                             
                TAB.POENG_KODE(I) = 'U57';                                      
             END;                                                               
          END;                                                                  
       ELSE  /*TRUDE 0893*/                                                     
   /*------------PROBLEMER MED KODE FOR FORELØPIG INNTEKT PÅ SB. */             
       IF TAB.INNT_POENG(UTTAKSDATO_Å - 1) > 0 &                                
         (B02.PINNTEKT.PI_KODE(IND,UTTAKSDATO_Å - 1) = 'F'  !                   
          B02.PINNTEKT.PI_KODE(IND,UTTAKSDATO_Å - 1) = 'M'  ) THEN              
          TAB.POENG_KODE(UTTAKSDATO_Å -1)  = 'U57';                             
    /*---------HIT TRUDE -------------*/                                        
    END;                                                                        
                                                                                
                                                                                
 /* EØS-BEREGNING : */                                                          
                                                                                
  IF DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J'    THEN                             
  DO;                                                                           
     DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(IND) = 0;                                   
     DIV_PARAM_OMR.PÅ_EØS_FAKTISK  (IND) = 0;                                   
                                                                                
     DO I = 1967 TO (DAGENS_DATO.ÅR - 1);       /*2000*/                        
        IF TAB.INNT_POENG(I) > 0        &                                       
           TAB.UFØR_GRAD (I) = 0  THEN                                          
           DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(IND) =                                
           DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(IND) + 1;                             
        IF B02.INNTEKTSÅR_EØS(IND,I) &                                          
           TAB.INNT_POENG(I) = 0         THEN                                   
           DO;                                                                  
              TAB.POENG_KODE(I) = 'U02';                                        
              DIV_PARAM_OMR.PÅ_EØS_FAKTISK(IND) =                               
              DIV_PARAM_OMR.PÅ_EØS_FAKTISK(IND) + 1;                            
           END;                                                                 
     END;                                                                       
                                                                                
  END; /*END EØS-BEREGNING*/                                                    
                                                                                
                                                                                
  IF B02.EØS_GARANTI(IND) = 'A'   !                                             
     B02.EØS_GARANTI(IND) = 'C'        THEN                                     
     DO I = 1967 TO (DAGENS_DATO.ÅR - 1);                                       
        IF B02.INNTEKTSÅR_EØS(IND,I)     THEN                                   
           TAB.POENG_KODE(I) = 'U02';                                           
     END;                                                                       
                                                                                
 /*EØS HIT */                                                                   
                                                                                
  /* (B02.VERNEPLIKTÅR(IND,FØRST_REG) > 0 &                                     
      IND = 2                             ) THEN  */                            
   IF (B02.VERNEPLIKTÅR(IND,FØRST_REG) > 0)       &                             
     (IND = 2  ! VIRK_LOV92_ÅM > 200006) THEN /*KVINNER FRA JULI 2000*/         
     DO I = 1 TO 4;                                                             
                                                                                
        IF B02.VERNEPLIKTÅR(IND,I) > 0 THEN                                     
                                                                                
           DO;                                                                  
              VERNEPL_ÅR = B02.VERNEPLIKTÅR(IND,I);                             
                                                                                
                                                                                
              TAB.VERNEPL_POENG(VERNEPL_ÅR) =                                   
                    MAX(2,                                                      
                        (TAB.INNT_POENG(VERNEPL_ÅR - 1) + 0.005),               
                        TAB.VERNEPL_POENG(VERNEPL_ÅR - 1),                      
                        (TAB.INNT_POENG(VERNEPL_ÅR) + 0.005)) ;                 
                                                                                
              TAB.VERNEPL_POENG_LOV92(VERNEPL_ÅR) =                             
                    MAX(2,                                                      
                        (TAB.INNT_POENG_LOV92(VERNEPL_ÅR - 1) + 0.005),         
                        TAB.VERNEPL_POENG_LOV92(VERNEPL_ÅR - 1),                
                        (TAB.INNT_POENG_LOV92(VERNEPL_ÅR) + 0.005)) ;           
               DCL VPO  FIXED DEC (3,2) INIT (0);                               
               VPO =   TAB.VERNEPL_POENG_LOV92(VERNEPL_ÅR);                     
           END;                                                                 
                                                                                
        ELSE                                                                    
                                                                                
           I = 4;                                                               
                                                                                
     END;                                                                       
                                                                                
                                                                                
 IF B02.UFT_ÅMD(IND,FØRST_REG) > 0          !           /*2000*/                
    B02.PENSJONSTYPE1(IND)    = 'K'        !                                    
    B02.KONV_P_KODE  (IND)    = 'K'        !                  /*KONSTS*/        
   (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &                              
    W_FNR_R13.ÅR > 1924                            )  !                         
    B02.KONV_P_KODE  (IND)    = 'O'       THEN                                  
 /*                                                                   */        
 /*     UTREGNING AV BUP FOR EN UFØREPENSJONIST                       */        
 /*     UTREGNING AV FPP FOR EN AFP  PENSJONIST                       */        
 /*     TRUDE 0492: VED OVERGANG TIL 70 ÅR, SKAL TP OMREGNES          */        
    DO;                                                                         
                                                                                
 /*UTLAND*/                                                                     
                                                                                
       IF B02.SPESOPPL.BOSATT(IND) = 0       !                                  
          B02.UFT_ÅMD(IND,FØRST_REG) > 19910000   !   /*REMEDY 446*/            
          B02.UFØRHIST.UFKRITERIER(IND,1) > 1      !  /*200205*/                
          B02.UFØRPENS.VILKÅR_8_4_3A(IND) = 'J'    !                            
          B02.STATUS.VILKÅR_8_4_3A(IND) = 'J'      !                            
          ((DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J') &                           
           (B02.EØS_8_4_3A(IND) = 'J')           )  !                           
          ( B02.BOSATT(IND) > 0              &                                  
           (B02.PENSJONSTYPE1(IND)    = 'K'  !                                  
            B02.KONV_P_KODE  (IND)    = 'K'  !              /*KONSTS*/          
            /* REMEDY 369 */                                                    
            (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &                     
             W_FNR_R13.ÅR > 1924                            )  !                
            B02.KONV_P_KODE  (IND)    = 'O'   ))  THEN                          
                                                                                
 /*UTLAND HIT*/                                                                 
                                                                                
             CALL BEREGN_BUP_FPP(W_FNR_R13.ÅR,IND); /* 4164 */                  
                                                                                
       ELSE                                                                     
          DO;                                                                   
             DO I = (DAGENS_DATO.ÅR + 1) TO 1963 BY - 1;   /*2000*/             
                IF TAB.UFØR_PERIODE(I) = 'S' !                                  
                   TAB.UFØR_PERIODE(I) = 'D' !                                  
                   TAB.UFØR_PERIODE(I) = 'A'         THEN                       
                   DO;                                                          
                      START_UFPERIODE = I - 1;                                  
                      I               = 1963;             /*2000*/              
                   END;                                                         
             END;                                                               
             IF START_UFPERIODE = 0     THEN                                    
                START_UFPERIODE = SLUTT_ÅR;                                     
             DO I = 1967 TO START_UFPERIODE;                /*2000*/            
                TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;               
                TAB.POENG_ANVENDT_LOV92(I) =                                    
                                    TAB.INNT_POENG_LOV92(I) + 0.005;            
             END;                                                               
          END;                                                                  
                                                                                
       IF B02.DØDSDATO_ÅMD(IND)  >  0       &                                   
          B02.PENSJONSTYPE1(IND) = 'D'      &                                   
          DØDSDATO.ÅR            > STOPP_ÅR    THEN                             
                                                                                
          DO;                                                                   
                                                                                
             IF DØDSDATO.ÅR <= FYLLER_69_ÅR    THEN                             
                TILLEGGS_ÅR = DØDSDATO.ÅR - 1;                                  
                                                                                
             ELSE                                                               
                                                                                
                TILLEGGS_ÅR = FYLLER_69_ÅR;                                     
                                                                                
             DO I = (STOPP_ÅR + 1) TO TILLEGGS_ÅR;                              
                                                                                
                TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;               
                TAB.POENG_ANVENDT_LOV92(I) =                                    
                              TAB.INNT_POENG_LOV92(I) + 0.005;                  
                                                                                
             END;                                                               
                                                                                
          END;                                                                  
                                                                                
     END;                                                                       
                                                                                
  ELSE                                                                          
                                                                                
     IF B02.DØDSDATO_ÅMD(IND) > 0 &                                             
        B02.PENSJONSTYPE1(IND) = 'D' THEN                                       
                                                                                
        DO;                                                                     
 /*                                                                   */        
 /*     UTREGNING AV BUP/FPP FOR AVDØD                                */        
 /*                                                                   */        
                                                                                
           IF DØDSDATO.ÅR <= STOPP_ÅR &                                         
                                                                                
  /*UTLAND */                                                                   
                                                                                
                                                                                
              (B02.SPESOPPL.BOSATT(IND) = 0     !                               
               B02.DØDSDATO_ÅMD(IND) > 19910000 !      /*REMEDY 446*/           
               B02.STATUS.VILKÅR_8_4_3A(IND) = 'J')  THEN                       
                                                                                
 /*UTLAND HIT*/                                                                 
                DO;                                                             
                   CALL BEREGN_BUP_FPP(W_FNR_R13.ÅR,IND); /* 4164 */            
                                                                                
                   IF GARANTI_FOR_DØD > 0 THEN   /* JF 12.8.02 */               
                      DO I = 1967 TO STOPP_ÅR;                                  
                        IF I = (DØDSDATO.ÅR+1) THEN                             
                           TAB.POENG_KODE(I) = 'U64';  /*'K'*/                  
                  END;                                                          
                END;                                                            
           ELSE                                                                 
                                                                                
              DO;                                                               
                 IF DØDSDATO.ÅR <= FYLLER_69_ÅR    THEN                         
                    STOPP_ÅR = DØDSDATO.ÅR - 1;                                 
                                                                                
                ELSE                                                            
                                                                                
                    STOPP_ÅR = FYLLER_69_ÅR;                                    
                                                                                
                 DO I = 1967 TO STOPP_ÅR;                /*2000*/               
                                                                                
                    TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;           
                    TAB.POENG_ANVENDT_LOV92(I) =                                
                                   TAB.INNT_POENG_LOV92(I) + 0.005;             
                                                                                
                END;                                                            
                                                                                
             END;                                                               
                                                                                
        END;                                                                    
                                                                                
     ELSE                                                                       
                                                                                
        DO I = 1967 TO SLUTT_ÅR;                 /*2000*/                       
                                                                                
           TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;                    
           TAB.POENG_ANVENDT_LOV92(I) = TAB.INNT_POENG_LOV92(I) + 0.005;        
                                                                                
        END;                                                                    
                                                                                
  IF B02.PENSJONSTYPE1(IND) = 'A'            !                                  
     (  B02.PENSJONSTYPE1(IND)  = 'D'   &                                       
   /*   B02.KONV_P_KODE(IND) = 'K'      !           KONSTS                      
        B02.KONV_P_KODE(IND) = 'O'        )   THEN        */                    
        B02.KONV_P_KODE(IND) = 'K'       )    THEN                              
                                                                                
      /*AFP ENDRES IKKE FØR VED P70 : */                                        
     IF ALDER_PÅ_VIRK_DATO < SØTTI      &                                       
        B02.PENSJONSTYPE1(IND) ^= 'D'   &                                       
   /*   B02.KONV_P_KODE(IND) = 'K'      !           KONSTS                      
        B02.KONV_P_KODE(IND) = 'O'            THEN         */                   
        B02.KONV_P_KODE(IND) = 'K'            THEN                              
     ;                                                                          
     ELSE                                                                       
                                                                                
     IF (TAB.INNT_POENG(SLUTT_ÅR)                = 0    &                       
                                                                                
                    B02.PI_KODE(IND,SLUTT_ÅR)    = ' ') &                       
                    TAB.INNT_POENG(SLUTT_ÅR - 1) > 0 THEN                       
        DO;                                                                     
                                                                                
 /*          ALDERSPENSJONISTER SOM IKKE HAR FÅTT RAPPORTERT SIN      */        
 /*      PENSJONSGIVENDE INNTEKT I ÅRET FØR RETT TIL ALDERSPENSJON,   */        
 /*      FÅR BENYTTET SIN INNTEKT I DET 65. ÅRET OGSÅ I DET 66. ÅRET  */        
                                                                                
                                                                                
 /* 7.11.89 HL : TESTEN NEDENFOR ER KOMMENTERT BORT ETTER */                    
 /*              KONFERANSE MED SLETNER                   */                    
 /* 25.1.90 HL : TATT INN IGJEN MED ET TILLEGG            */                    
                                                                                
            IF TAB.POENG_ANVENDT(SLUTT_ÅR - 1) >=                               
               TAB.BUP_FPP      (SLUTT_ÅR)           THEN                       
                                                                                
               DO;                                                              
                                                                                
                                                                                
                   IF SLUTT_ÅR           = 1989          &  /*2000*/            
                      TAB.UFØR_GRAD(1989)  >  0     THEN    /*2000*/            
                      CALL BEGRENSET_OPPTJENING_89;                             
                                                                                
                   ELSE                                                         
                   IF SLUTT_ÅR = 1992         &            /*2000*/             
                      VIRK_LOV92_ÅM > 199200         THEN  /*2000*/             
                      DO;                                                       
                                                                                
                         IF  TAB.POENG_ANVENDT_LOV92(SLUTT_ÅR - 1)>=            
                             TAB.BUP_FPP      (SLUTT_ÅR)      THEN              
                                                                                
                         DO;                                                    
                            TAB.POENG_ANVENDT(SLUTT_ÅR) =                       
                            TAB.POENG_ANVENDT_LOV92(SLUTT_ÅR - 1);              
                            TAB.POENG_KODE(SLUTT_ÅR) = 'U58';                   
                         END;                                                   
                         ELSE                                                   
                         DO;                                                    
                            TAB.POENG_ANVENDT(SLUTT_ÅR) =                       
                            TAB.BUP_FPP(SLUTT_ÅR);                              
                            TAB.POENG_KODE(SLUTT_ÅR) = 'U57';                   
                         END;                                                   
                      END;                                                      
                   ELSE                                                         
                      DO;                                                       
                                                                                
                         TAB.POENG_ANVENDT(SLUTT_ÅR) =                          
                                       TAB.POENG_ANVENDT(SLUTT_ÅR - 1);         
                         TAB.POENG_KODE(SLUTT_ÅR) = 'U58';                      
                      END;                                                      
                                                                                
               END;                                                             
                                                                                
            ELSE                                                                
               DO;                                                              
                                                                                
                  TAB.POENG_ANVENDT(SLUTT_ÅR) = TAB.BUP_FPP(SLUTT_ÅR);          
                  TAB.POENG_KODE(SLUTT_ÅR) = 'U57';                             
               END;                                                             
        END;                                                                    
                                                                                
 /*JFA11.7.03  GJELDER OVERGANG FRA OFF. AFP TIL AP. HVIS DET                   
 /*    64. ÅRET IKKE ER UTTAKSÅRET SKAL PENSJONSPOENGET REGNES UT               
       UTEN HENSYN TIL UFØREGRAD OG GODSKRIVES MED MAX 0.5. 0.5 +               
       BUP_FPP KAN IKKE OVERSTIGE 4. HVIS BUP > 4, ER MAX POENG                 
       = BUP. */                                                                
                                                                                
 /* IF B02.KONV_P_KODE (IND) = 'O'   THEN                                       
    /* REMEDY 369 */                                                            
    IF  B02.KONV_P_KODE (IND) = 'O'                  !                          
        (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &                         
         B02.PENSJONSTYPE1 (IND) = 'A'                &                         
         B02.KONV_P_KODE (IND) = ' '                  &                         
         W_FNR_R13.ÅR > 1924                           )   THEN                 
       DO;                                                                      
          FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;                                     
          I = FYLLER_67_ÅR - 4;                                                 
          J = I + 1;                                                            
   /*     DO I = 1992 TO (DAGENS_DATO.ÅR - 1);    */                            
   /*       IF (I = (FYLLER_67_ÅR - 3))  THEN         */                        
          DO I = I TO J;                                                        
               DO;                                                              
                  IF (TAB.UFØR_GRAD(I) = 100  &                                 
                      TAB.UFØR_PERIODE(I) ^= 'S') THEN                          
                     DO;                                                        
                        W_PI = B02.PI(IND,I);   /*200504*/                      
                        TAB.INNT_POENG(I) =                                     
 /* 4163 */                 F_INNTEKT_POENG(W_PI,I,GV(I),100);                  
                       MAX_INNT = TAB.INNT_POENG(I) + 0.005;                    
                       IF MAX_INNT > 0.5 THEN                                   
                          MAX_INNT = 0.5;                                       
                                                                                
                          IF TAB.BUP_FPP(I) < 4 THEN                            
                             DO;                                                
                               MAX_INNT = MAX_INNT + TAB.BUP_FPP(I);            
                               IF MAX_INNT > 4 THEN                             
                                  MAX_INNT = 4;                                 
                                  TAB.POENG_ANVENDT(I) = MAX_INNT;              
                             END;                                               
                           ELSE                                                 
                             TAB.POENG_ANVENDT(I) = TAB.BUP_FPP(I);             
                     END;                                                       
               END;                                                             
          END;                                                                  
       END;                                                                     
                                                                                
                                                                                
                                                                                
  /* JFA 19.12.00 NY LOV FOR AP FRA 1.2.2001       */                           
    IF B02.PI_66_65(IND)   = 'J'     THEN                                       
       IF (B02.PENSJONSTYPE1(IND)  = 'A')      &                                
          ( ALDER_PÅ_VIRK_DATO     < SØTTI )   &                                
          (B02.UTTAKSDATO_ÅMD(IND) > 20010101  !                                
           FØDT_ÅR_MND             > 193400      )   THEN                       
          DO;                                                                   
            FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;                                   
            POENG_66 = 0;                                                       
            DO I = 1999 TO (DAGENS_DATO.ÅR);                                    
              IF (I = (FYLLER_67_ÅR - 1))  THEN                                 
                DO;                                                             
                 POENG_66 = TAB.POENG_ANVENDT(I);                               
                 TAB.POENG_ANVENDT(I) = TAB.POENG_ANVENDT(I - 1);               
         /*      TAB.UFØR_PERIODE(I) = 'R';       */                            
                 TAB.POENG_KODE(I)   = 'U91';                                   
                                                                                
                 IF B02.KONV_P_KODE(IND) = 'K'  THEN                            
                  DO;  /* HAR IKKE HATT OFFENTLIG AFP */                        
                   IF (TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I)/100 )                  
                                    > TAB.POENG_ANVENDT(I)  THEN                
                     DO;                                                        
                      TAB.POENG_ANVENDT(I) = (TAB.BUP_FPP(I) *                  
                                         TAB.UFØR_GRAD(I)/100 );                
          /*          TAB.UFØR_PERIODE(I) = 'S';             */                 
                      TAB.POENG_KODE(I)   = 'U92';                              
                     END;                                                       
                   ELSE                                                         
                     DO;                                                        
          /*          TAB.UFØR_PERIODE(I) = 'R';            */                  
                      TAB.POENG_KODE(I)   = 'U91';                              
                     END;                                                       
                  END; /* IKKE HATT OFF. AFP */                                 
                                                                                
                 IF B02.KONV_P_KODE(IND) = 'U'  THEN                            
             DO;  /* HAR HATT UFØREPENSJON */                                   
      /*           IF TAB.BUP_FPP(I) > 0 THEN        */                         
                    IF (TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I)/100)                  
    /*RETTET 200305 HL : */                                                     
     /*                               <= TAB.POENG_ANVENDT(I) THEN*/            
                                      >  TAB.POENG_ANVENDT(I) THEN              
                      DO;                                                       
                       TAB.POENG_ANVENDT(I) = (TAB.BUP_FPP(I) *                 
                                         TAB.UFØR_GRAD(I)/100 + 0.005 );        
         /*            TAB.UFØR_PERIODE(I) = 'R';         */                    
                       TAB.POENG_KODE(I)   = 'U91';                             
                      END;                                                      
                    ELSE                                                        
                      DO;                                                       
                       TAB.UFØR_PERIODE(I) = 'F';                               
                       TAB.POENG_KODE(I)   = 'U59';                             
                      END;                                                      
                                                                                
                  IF ( (TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I)/100+0.005)            
                     < TAB.POENG_ANVENDT(I - 1) ) THEN                          
                    IF ( (TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I)/100)                
                     <= (TAB.BUP_FPP(I-1) * TAB.UFØR_GRAD(I-1)/100) )           
                     THEN                                                       
                     DO; /* GRADERT UP + POENG FOR INNT. ÅRET FØR */            
                      TAB.POENG_ANVENDT(I) = TAB.POENG_ANVENDT(I - 1);          
         /*           TAB.UFØR_PERIODE(I) = 'R';             */                 
                      TAB.POENG_KODE(I)   = 'U91';                              
                      IF (TAB.UFØR_GRAD(I-1) = TAB.UFØR_GRAD(I) &               
                          TAB.UFØR_GRAD(I) = 100) THEN                          
                        IF TAB.POENG_ANVENDT(I) >= 4.00 THEN                    
                          DO;                                                   
                           TAB.UFØR_PERIODE(I) = 'F';                           
                           TAB.POENG_KODE(I)   = 'U59';                         
                          END;                                                  
                     END;                                                       
                                                                                
                  IF ( (TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I)/100)                  
                  > (TAB.BUP_FPP(I-1) * TAB.UFØR_GRAD(I-1)/100) )               
                  & POENG_66 > TAB.POENG_ANVENDT(I - 1)                         
                    THEN                                                        
                     DO; /* HØYERE UFØREGRAD I DET 66. ÅRET ENN 65. */          
                      TAB.POENG_ANVENDT(I) = POENG_66;                          
         /*           TAB.UFØR_PERIODE(I) = 'S';       */                       
                      TAB.POENG_KODE(I)   = 'U92';                              
                     END;                                                       
             END; /* HAR HATT UFØREPENSJON */                                   
                                                                                
                                                                                
             IF B02.KONV_P_KODE(IND) = 'Y'  THEN                                
               DO; /* HAR HATT UFØREPENSJON M/YSK-FORDELER */                   
                 IF (TAB.PAÅ(I) > 0 &                                           
                     TAB.YRKE_GRAD(I) = TAB.UFØR_GRAD(I)) THEN                  
                   IF (TAB.PAÅ(I) > TAB.BUP_FPP(I))        THEN                 
                     IF (TAB.PAÅ(I) * TAB.YRKE_GRAD(I)/100)                     
                                    > TAB.POENG_ANVENDT(I-1) &                  
                              B02.STATUS.VILKÅR_8_4_3A(IND) = 'J' THEN          
                       DO;                                                      
                        TAB.POENG_ANVENDT(I) = (TAB.PAÅ(I) *                    
                                       TAB.YRKE_GRAD(I)/100 + 0.005);           
        /*              TAB.UFØR_PERIODE(I) = 'R';       */                     
                        TAB.POENG_KODE(I)   = 'U91';                            
                       END;                                                     
                     ELSE                                                       
                       DO;                                                      
                        TAB.UFØR_PERIODE(I) = 'F';                              
                        TAB.POENG_KODE(I)   = 'U59';                            
                       END;                                                     
               END;  /* END HAR HATT UFP M/YSK-FORDELER */                      
                                                                                
                                                                                
   /*           IF B02.KONV_P_KODE(IND) = 'O' THEN                              
   /* REMEDY 369 */                                                             
                IF (B02.KONV_P_KODE(IND) = 'O'                   !              
                   (B02.UTTAKSDATO_ÅMD_ØVRIGE (IND,1) > 19920000 &              
                    W_FNR_R13.ÅR > 1924                ))  THEN                 
                   DO;  /* HAR HATT OFFENTLIG AFP */                            
       /*           TAB.UFØR_PERIODE(I) = 'R';      */                          
                    TAB.POENG_KODE(I)   = 'U91';                                
                   END;                                                         
                                                                                
                 I = DAGENS_DATO.ÅR;                                            
                END;                                                            
            END;                                                                
          END;                                                                  
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 BEGRENSET_OPPTJENING_89: PROC;                                                 
    DCL MAX              FIXED DEC (3,2) INIT (0),                              
        BUP_GRAD         FIXED DEC (3,2) INIT (0);                              
                                                                                
    MAX_INNT                 = TAB.INNT_POENG(1988) + 0.005; /*2000*/           
                                                                                
    IF (TAB.UFØR_GRAD(1989)  = 100 &                 /*2000*/                   
        MAX_INNT           > 0.5   ) THEN                                       
       MAX_INNT           = 0.5;                                                
                                                                                
    IF TAB.BUP_FPP(1989)    > 4            THEN           /*2000*/              
       MAX       = TAB.BUP_FPP(1989) + 0.005;            /*2000*/               
    ELSE                                                                        
       MAX       = 4;                                                           
                                                   /*2000 : */                  
    BUP_GRAD = TAB.BUP_FPP(1989) * TAB.UFØR_GRAD(1989) / 100 + 0.005;           
                                                                                
    IF BUP_GRAD              > 4           THEN                                 
       TAB.POENG_ANVENDT(1989) = BUP_GRAD;              /*2000*/                
    ELSE                                                                        
       DO; /* BUP GRAD MINDRE ENN 4 */                                          
          IF BUP_GRAD + MAX_INNT   > MAX         THEN                           
             TAB.POENG_ANVENDT(1989) = MAX;              /*2000*/               
          ELSE                                                                  
             TAB.POENG_ANVENDT(1989) = BUP_GRAD + MAX_INNT; /*2000*/            
                                                                                
          IF BUP_GRAD + TAB.INNT_POENG_LOV92(1988) > MAX THEN /*2000*/          
             TAB.POENG_ANVENDT_LOV92(1989) = MAX;            /*2000*/           
          ELSE                                                                  
             TAB.POENG_ANVENDT_LOV92(1989) = BUP_GRAD +      /*2000*/           
                 TAB.INNT_POENG_LOV92(1988) + 0.005;     /*2000*/               
      END; /* BUP GRAD MINDRE ENN 4 */                                          
 END BEGRENSET_OPPTJENING_89;                                                   
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
  IF (W_FNR_R13.ÅR > 1900) THEN                                                 
     DO;  /* FØDT ETTER 1900 */                                                 
        IF ALDER_PÅ_VIRK_DATO >= SØTTI   &                                      
           B02.PENSJONSTYPE1(IND) ^= 'D'   THEN     /*9802 HL */                
           DO;  /* 70 ELLER ELDRE OG FRAMLEIS I LIVET */                        
              FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;                                 
              IF FYLLER_67_ÅR < 1973      THEN      /*2000*/                    
                 FYLLER_67_ÅR = 1973;               /*2000*/                    
              FYLLER_69_ÅR = W_FNR_R13.ÅR + 69;                                 
                                                                                
              IF TAB.INNT_POENG(FYLLER_69_ÅR)       =  0    &                   
                 B02.PI_KODE(IND,FYLLER_69_ÅR)      = ' '   &                   
                 TAB.INNT_POENG(FYLLER_69_ÅR - 1)   >  0        THEN            
                 DO;                                                            
                                                                                
 /*          ALDERSPENSJONISTER SOM IKKE HAR FÅTT RAPPORTERT SIN      */        
 /*      PENSJONSGIVENDE INNTEKT I ÅRET FØR RETT TIL ALDERSPENSJON,   */        
 /*      FÅR BENYTTET SIN INNTEKT I DET 68. ÅRET OGSÅ I DET 69. ÅRET  */        
                                                                                
                   IF FYLLER_69_ÅR = 1992         &      /*2000*/               
                      VIRK_LOV92_ÅM > 199200        THEN  /*2000*/              
                      DO;                                                       
                         TAB.INNT_POENG(FYLLER_69_ÅR) =                         
                             TAB.INNT_POENG_LOV92(FYLLER_69_ÅR - 1);            
                         TAB.POENG_KODE(FYLLER_69_ÅR) = 'U58';                  
                      END;                                                      
                   ELSE                                                         
                      DO;                                                       
                         TAB.INNT_POENG(FYLLER_69_ÅR) =                         
                             TAB.INNT_POENG(FYLLER_69_ÅR - 1);                  
                         TAB.POENG_KODE(FYLLER_69_ÅR) = 'U58';                  
                      END;                                                      
                 END;                                                           
                                                                                
              DO I = FYLLER_67_ÅR TO FYLLER_69_ÅR;                              
                                                                                
                 TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;              
                                                                                
              END;                                                              
                                                                                
               /*OMSORGSPOENG FOR DENNE GRUPPE VAR GLEMT, TRUDE 0794*/          
                                                                                
               DO I = 1992 TO FYLLER_69_ÅR;       /*2000*/                      
        /*       IF (TAB.OMSORG_KODE(I) = 'J' !                                 
                     TAB.OMSORG_KODE(I) = 'K' !                                 
                     TAB.OMSORG_KODE(I) = 'L' ) &        */                     
                 IF TAB.OMSORG_KODE(I) = 'J' &    /*9903*/                      
                                                                                
 /*OMSORGSPOENG SKAL TAS MED I DET 67. ÅR - SKAL DET OGSÅ */                    
 /*TAS MED I ANDRE UFØREÅR ? 0395 HL : */                                       
                                                                                
                   ( I = FYLLER_67_ÅR !                                         
                     TAB.UFØR_GRAD (I) = 0 )  THEN /* ???*/                     
                                                                                
                    DO;                                                         
                      IF TAB.POENG_ANVENDT(I) < 3 THEN                          
                        DO;  /* POENG ANVENDT VAR LAVERE ENN GARANTI */         
                           TAB.POENG_ANVENDT(I) = 3;                            
                           TAB.POENG_KODE(I) = 'U03';                           
                        END; /* POENG ANVENDT VAR LAVERE ENN GARANTI */         
                    END;                                                        
               END;                                                             
                  /* HIT TRUDE 0794*/                                           
           END;                                                                 
                                                                                
     END;                                                                       
                                                                                
  DO I = 1 TO 7 WHILE (B02.UFT_ÅMD(IND,I) > 0);        /*2000*/                 
     UFØR_ÅR = B02.UFT_ÅMD(IND,I) / 10000;  /*SISTE UFØR_ÅR 2000*/              
     IF UFØR_ÅR < 1966 THEN               /*2000*/                              
        B02.UFØRHIST.BUP(IND,I) = 0;                                            
     ELSE                                                                       
        B02.UFØRHIST.BUP(IND,I) = TAB.BUP_FPP(UFØR_ÅR);                         
  END;                                                                          
                                                                                
  /*OMSORGSPOENG . TRUDE 020394*/                                               
  /*MÅ VI HA MED UFG = 0 ?? */                                                  
  /*ENDRET 090994 AV TRUDE. SKAL IKKE OMREGNES FØR EVNT NYTT UFT,ALDER*/        
  /*ELLER NYTT UFT ETTER -92.                                         */        
                                                                                
   DO  I = 1992 TO SLUTT_ÅR;                   /*2000*/                         
     IF  TAB.OMSORG_KODE(I)      = 'J'    &     /*9903*/                        
      (((TAB.UFØR_PERIODE(I)     = 'M' !                                        
         TAB.UFØR_PERIODE(I)     = 'J' ) !   /* TS 021296 */                    
         (TAB.UFØR_PERIODE(I)    = 'S' &                                        
          I                      > 1992  &       /*2000*/                       
  /*      TAB.UFØR_PERIODE(I-1)  = 'M'))  !               */                    
         (TAB.UFØR_PERIODE(I+1)  = 'S'    !      /*9905*/                       
          TAB.UFØR_PERIODE(I+1)  = 'M'))) !      /*9904*/                       
         ALDER_PÅ_VIRK_DATO      > 6700   !      /*9903*/                       
         TAB.UFØR_GRAD (I)       =  0   ) THEN                                  
                                                                                
        DO;  /*RETTING AV REMEDY 77 : */                                        
          IF (B02.PENSJONSTYPE1(IND) = 'A' &                                    
              I > FYLLER_66_ÅR             &                                    
              ALDER_PÅ_VIRK_DATO < 7001    ) THEN;                              
          ELSE                                                                  
          IF  TAB.POENG_ANVENDT(I) < 3 THEN                                     
            DO;                                                                 
               TAB.POENG_ANVENDT(I) = 3;                                        
               /* MÅ STOPPE POENGREKKEN PÅ PENSJONSBREVET. TS 190894*/          
               IF  TAB.POENG_KODE(I)    = 'U54'   THEN                          
                   TAB.POENG_KODE(I+1)  = 'U54';                                
                                                                                
               TAB.POENG_KODE(I)    = 'U03';                                    
            END;                                                                
                                                                                
        END;                                                                    
   END;                                                                         
          /*OMSORGSKODE HIT */                                                  
  /*NB! FØRSTE ÅRET MED OMSORGSPOENG ER 92. TRUDE 020394           */           
                                                                                
                                                                                
  /* JF 22.8.02 - GJELDER OMSORGSPOENG FOR DØDE 67 TIL 70 ÅR */                 
  /* DØR MELLOM 67 OG 70 ÅR. SKAL HA MEDREGNET POENG FØR DØDSÅRET */            
  IF (W_FNR_R13.ÅR > 1922) & (B02.PENSJONSTYPE1(IND)) = 'D' THEN                
     DO;  /* 70 ÅR I 1993 ELLER SENERE */                                       
        FYLLER_67_ÅR = W_FNR_R13.ÅR + 67;                                       
        FYLLER_69_ÅR = W_FNR_R13.ÅR + 69;                                       
        IF DØDSDATO.ÅR > FYLLER_69_ÅR THEN                                      
           /* DØR I 69. ÅRET, DET ÅRET HAN FYLLER 70 */                         
           DO I = FYLLER_67_ÅR TO (FYLLER_69_ÅR);                               
              IF I >= 1992 & TAB.OMSORG_KODE(I) = 'J' THEN                      
                 IF TAB.POENG_ANVENDT(I) < 3 THEN                               
                    DO;                                                         
                      TAB.POENG_ANVENDT(I) = 3;                                 
                      TAB.POENG_KODE(I)    = 'U03';                             
                    END;                                                        
           END;                                                                 
        ELSE                                                                    
           IF DØDSDATO.ÅR = FYLLER_69_ÅR THEN                                   
              /* DØR DET ÅRET HAN FYLLER 69 */                                  
             DO I = FYLLER_67_ÅR TO (FYLLER_69_ÅR - 1);                         
                IF I >= 1992 & TAB.OMSORG_KODE(I) = 'J' THEN                    
                   IF TAB.POENG_ANVENDT(I) < 3 THEN                             
                      DO;                                                       
                        TAB.POENG_ANVENDT(I) = 3;                               
                        TAB.POENG_KODE(I)    = 'U03';                           
                      END;                                                      
             END;                                                               
        ELSE                                                                    
           IF DØDSDATO.ÅR = (FYLLER_67_ÅR + 1) THEN                             
              /* DØR DET ÅRET HAN FYLLER 68 */                                  
              IF (FYLLER_67_ÅR >= 1992 &                                        
                 TAB.OMSORG_KODE(FYLLER_67_ÅR) = 'J') THEN                      
                 IF TAB.POENG_ANVENDT(FYLLER_67_ÅR) < 3 THEN                    
                   DO;                                                          
                      TAB.POENG_ANVENDT(FYLLER_67_ÅR) = 3;                      
                      TAB.POENG_KODE(I)    = 'U03';                             
                   END;                                                         
      END;                                                                      
  /* HIT JF 22.8.2002 */                                                        
                                                                                
                                                                                
                                                                                
  /* JFA 29.5.02  + HL 200303*/                                                 
  DO J = 1 TO 7 WHILE(B02.UFØRHIST.UFT_ÅMD(IND,J) > 0);                         
     UFØR_ÅR = B02.UFT_ÅMD(IND,J) / 10000;                                      
                                                                                
  /* HJ_YNGSTE_BARN_FÅR =                                                       
            B02.UFØRPENS.YNGSTE_BARN_FÅR(IND);    */                            
                                                                                
                                                                                
     HJ_YNGSTE_BARN_FÅR =                                                       
            B02.UFØRHIST.YNGSTE_BARN_FÅR_HIST(IND,J);                           
     IF HJ_YNGSTE_BARN_FÅR = 0        THEN                                      
        HJ_YNGSTE_BARN_FÅR =                                                    
            B02.UFØRPENS.YNGSTE_BARN_FÅR(IND);                                  
                                                                                
   IF HJ_YNGSTE_BARN_FÅR > 0    THEN                                            
     DO I = HJ_YNGSTE_BARN_FÅR TO                                               
            HJ_YNGSTE_BARN_FÅR + 6;                                             
        IF  I > 1991 THEN                                                       
          DO;                                                                   
           IF  I >= UFØR_ÅR & I <=  SEKSTISEKSÅR  &                             
               TAB.POENG_ANVENDT(I) < 3             THEN                        
                 DO;                                                            
                    TAB.POENG_ANVENDT(I) = 3;                                   
                    TAB.POENG_KODE(I)    = 'U03';                               
                 END;                                                           
                                                                                
           IF  I  = (B02.YNGSTE_BARN_FÅR(IND) + 6) &         /*9404TS*/         
               TAB.POENG_KODE(I)    = 'U03'       THEN                          
               TAB.POENG_KODE(I+1)  = 'U54';                                    
                                                                                
           IF  B02.REDUSERT_ANT_BUP_ÅR(IND,1) > 0 THEN       /*9404TS*/         
             DO;                                             /*9404TS*/         
                                                                                
               IF  I + 1  =  UFØR_ÅR + B02.REDUSERT_ANT_BUP_ÅR(IND,1)           
                                                   THEN                         
                   TAB.POENG_KODE(I+1)  = '   ';                                
             END;                                                               
          END;                                                                  
     END;                                                                       
  END;                                                                          
  RETUR:                                                                        
                                                                                
  END BEREGN_POENGREKKE;                                                        
