 /*       SIST ENDRET 04/05-98 13.15.15 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/03-98 12.12.01 AV   JDA7339                  */00000010
 /*       SIST ENDRET 10/02-83 12.48.59 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/12-82 15.00.26 AV   OLSEN                    */00000030
 /*       SIST ENDRET 23/08-82 09.58.29 AV   OLAV                     */00000040
  /* *************************************************************** */ 00000050
  /* IDENTIFIKASJON:  R0017025                                       */ 00000060
  /* PROGRAMMERER:    HELEN ,JULI  1982                              */ 00000070
  /* HENSIKT:                                                        */ 00000080
  /*         OPPRETTER EN MIDLERTIDIG OMRÅDE FOR                     */ 00000090
  /*         OPPBEVARING AV FNR. OG ROT INFORMASJON                  */ 00000100
  /*         SOM BRUKES I JUSTER_SB_ROT_SEGMENT (R0017101)           */ 00000110
  /* PROGRAM-TILKNYTNING:                                            */ 00000120
  /*         INKLUDES I LAG_STØNADSBREV_TRANSER (R0017001)           */ 00000130
  /*                                                                 */ 00000140
  /* *************************************************************** */ 00000150
 LAG_FNR_TAB:                                                           00000160
     PROC(PER_IND) ;                                                    00000170
 DCL   PER_IND               FIXED BIN(15);                             00000180
 DCL   F_IND                 FIXED BIN(15);                             00000190
                                                                        00000200
  /* *************************************************************** */ 00000210
  /* PROGRAMMET BEGYNNER HER. VI FINNER FNR. I FNR_TABELL ELLER      */ 00000220
  /* FØRSTE LEDIGE PLASS I FNR_TABELL.                               */ 00000230
  /* *************************************************************** */ 00000240
                                                                        00000250
    DO I = 1 TO 14 ;                                                    00000260
                                                                        00000270
  /* *************************************************************** */ 00000280
  /* FNR. FINNES I TABELLEN FRA FØR.                                 */ 00000290
  /* *************************************************************** */ 00000300
                                                                        00000310
       IF FNR_TABELL.FNR(I) = B02.PERSON.RF0PERSN.FNR(PER_IND)  THEN    00000320
          DO;                                                           00000330
             F_IND = I;                                                 00000340
             I = 14;                                                    00000350
          END;                                                          00000360
       ELSE                                                             00000370
                                                                        00000380
  /* *************************************************************** */ 00000390
  /* FNR. FINNES IKKE I TABELLEN.                                    */ 00000400
  /* *************************************************************** */ 00000410
                                                                        00000420
          IF FNR_TABELL.FNR(I) = 0   THEN                               00000430
             DO;                                                        00000440
                F_IND = I;                                              00000450
                FNR_TABELL.FNR(F_IND) =                                 00000460
                            B02.PERSON.RF0PERSN.FNR(PER_IND);           00000470
                I = 14;                                                 00000480
             END;                                                       00000490
          ELSE                                                          00000500
                                                                        00000510
  /* *************************************************************** */ 00000520
  /* FNR_TABELLEN HAR IKKE LEDIGE PLASSER.                           */ 00000530
  /* *************************************************************** */ 00000540
                                                                        00000550
             IF I = 14  THEN                                            00000560
             DO;                                                        00000570
 L120:          FEIL_MELD_NR = 1903;                                    00000580
                FEIL_VED_LABEL = 'L120';                                00000590
                GO TO L999;                                             00000600
             END;                                                       00000610
    END;                                                                00000620
    FNR_TABELL.PENSJTYP(F_IND)                                          00000630
                          = B02.PERSON.STATUS.PENSJONSTYPE1(PER_IND);   00000640
    FNR_TABELL.NAVN(F_IND)  = B02.PERSON.RF0PERSN.NAVN(PER_IND);        00000650
    FNR_TABELL.TKNR(F_IND)  = B02.PERSON.RF0PERSN.TKNR(PER_IND);        00000660
    FNR_TABELL.SPRÅK(F_IND) =  B02.PERSON.RF0PERSN.SPRÅK(PER_IND);      00000670
 END LAG_FNR_TAB;                                                       00000680
