 /*   SIST ENDRET PÅ PROD   2005.08.12 11.55.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.08.11  8.39.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.24  8.02.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.16 15.09.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.10.23 13.58.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.29.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.04.10 11.33.12 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.03.05  8.17.47 AV   HLA7339          */        
 /*       SIST ENDRET 04/05-98 13.31.58 AV   JDA7339                  */        
 /*       SIST ENDRET 23/01-98 09.57.43 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*     R0019966 - UNDERPROGRAM I PLI                                 */        
 /*     PROGRAMMERER: HERMAN - DESEMBER 88                            */        
 /* HENSIKT:                                                          */        
 /*     DENNE RUTINEN OPPHØRER AFP-NULLPENSJON                        */        
 /*     DERSOM SØKER HAR EKTEFELLE SKJER FØLGENDE:                    */        
 /*     A) EKTEFELLEN HAR EN OPPHØRT UFØREPENSJON                     */        
 /*          (STATUS_KODE_HIST = X)                                   */        
 /*      SøKERS STATUS SLETTES                                        */        
 /*      EKTEFELLEN FÅR PENSJONSTYPE1 = U OG PT2 = ' '                */        
 /*     B) EKTEFELLEN HAR IKKE PENSJON, OG HELLER IKKE UFØREHISTORIKK */        
 /*      SØKERS OG EKTEFELLENS STATUS SLETTES.                        */        
 /*     C) EKTEFELLEN HAR EGEN PENSJON:                               */        
 /*      SØKER BEHOLDER STATUS SEGMENT MED NYE PENSJONSKODER,         */        
 /*      MEN MED 0 I TRYGDETID.                                       */        
 /*      EKTEFELLEN FÅR NY PENSJONSKODE2 OG NY TILKNYTNINGSKODE.      */        
 /*     DERSOM SØKER IKKE HAR EKTEFELLE:                              */        
 /*     A) UTTAK FØR 1097 ELLER FØDT FØR 1933                         */        
 /*        SØKERS STATUS SLETTES.                                     */        
 /*     B) UTTAK TIDLIGST 1097 OG FØDT TIDLIGST 1933 OG UNDER 65 ÅR   */        
 /*        KONV_P_KODE BLIR 'O', OG UTTAKSDATO SPARES                 */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*      KALLES OPP AV PROGRAM R0014901 - OG IKKE AV ANDRE PROGRAM    */        
 /* BRUK:                                                             */        
 /*      AFP_NULL_OPPHØRER                                            */        
 /* ***************************************************************** */        
 AFP_NULL_OPPHØRER:PROC (I,I_EK);                                               
   DCL                                                                          
      I         FIXED BIN(15),                                                  
      I_EK      FIXED BIN(15),                                                  
      IND       FIXED BIN(15),                                                  
      J         FIXED BIN(15);                                                  
   DCL SPARE_DATO   FIXED DEC (9);                                              
   DCL UTTAKS_ÅR PIC '9999';                                                    
                                                                                
   DCL X_FNR11                    PIC '(11)9';                                  
   DCL X_FNR13                    PIC '(13)9';                                  
   DCL 1 FNR_X DEF X_FNR13,                                                     
       2 DAG       PIC '99',                                                    
       2 MND       PIC '99',                                                    
       2 ÅR        PIC '9999',                                                  
       2 ÅRHUNDRE  PIC '9',                                                     
       2 FILLER    PIC '(4)9';                                                  
                                                                                
    /* ============================================================== */        
    X_FNR11= B01.RF0PERSN.FNR(I);                                               
    X_FNR13= KONV_FNR11_FNR13(X_FNR11);                                         
    UTTAKS_ÅR = B01.UTTAKSDATO_ÅMD(I) / 10000;                                  
                                                                                
                    B02.TT_FØR_1967(I)   = 0;                                   
                    B02.TT_ETTER_1966(I) = 0;                                   
                    B02.TT_FRAMT     (I) = 0;                                   
                    B02.TT_ANV(I)        = 0;                                   
                    B02.SUM_YTELSE(I)    = 0;                                   
  /*        B02.PENSJON_FØR_9802(I)     = ' ';    200102 HL */                  
            B02.EK_INNT_OVER_2G  (I)     = ' '; /*9710  HL*/                    
            B02.GP_REDUKSJON_KODE(I)     = ' '; /*200204 HL*/                   
                                                                                
 /* ***************************************************************** */        
 /* B02.SPESOPPL-SEGMENTET SLETTES                                 */           
 /* ***************************************************************** */        
                                                                                
                    B02.SPESOPPL (I) = '';                                      
                                                                                
 /* ***************************************************************** */        
 /* B02.ALDERSP -SEGMENTET SLETTES (VED UTTAK FØR 1097   -200103-  */           
 /* ***************************************************************** */        
    /* TAR VARE PÅ AFPHIST SEGMENTET OG LEGGER INN NULLELEMENT                  
    /* ENDRET FRA HER - MARTIN OKTOBER 2002 */                                  
    IF (B01.AFPDATO_ÅMD(I,1) > 0) THEN                                          
       DO;  /* HAR HATT AFP ETTER REGLENE FRA 08.2000 */                        
          B02.ALDERSP(I)        = '';                                           
          B02.KONV_P_KODE(I)    = 'O';                                          
          B02.UTTAKSDATO_ÅMD(I) = B01.UTTAKSDATO_ÅMD(I);                        
           /* ENDRET 20->30 SP 18.07.05 */                                      
          DO K = 1 TO 30 WHILE(B01.AFPDATO_ÅMD(I,K)>0 &                         
                               B01.AFPDATO_ÅMD(I,K)<                            
                               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD);               
             B02.AFPHIST(I,K) = B01.AFPHIST(I,K);                               
          END;                                                                  
          B02.AFPHIST.AFPDATO_ÅMD(I,K) =                                        
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                                  
          B02.AFPHIST.TEI_FAKTOR(I,K) =                                         
             B02.AFPHIST.TEI_FAKTOR(I,K-1);                                     
          B02.FEI_I_100KR(I,K) = 0;                                             
          B02.GRAD_UTBET(I,K)  = 0;                                             
          B02.FULL_AFP(I,K)    = 0;                                             
          B02.RED_AFP(I,K)     = 0;                                             
          B02.ET_REG(I,K)      = ' ';                                           
          B02.AFP_BUP(I) = B01.AFP_BUP(I);                                      
       END; /* HAR HATT AFP ETTER REGLENE FRA 08.2000 */                        
    /* ENDRET TIL HIT - MARTIN OKTOBER 2002 */                                  
                                                                                
    /* ENDRING HL */                                                            
          DO J = 1 TO 5;                                                        
             B02.VENTØVR(I,J) = B01.VENTØVR(I,J);                               
          END;                                                                  
    /*    ENDRING HL TIL HIT */                                                 
                                                                                
            IF FNR_X.ÅR              > 1932       &                             
               UTTAKS_ÅR             < (FNR_X.ÅR + 65)  &                       
               B01.UTTAKSDATO_ÅMD(I) > 19970900   THEN                          
               DO;                                                              
                    SPARE_DATO             = B01.UTTAKSDATO_ÅMD(I);             
                    B02.ALDERSP  (I)       = '';                                
                    B02.UTTAKSDATO_ÅMD(I)  = SPARE_DATO;                        
                    B02.KONV_P_KODE(I)     = 'O';                               
     /*MAIL 10.7. FRA GH : */                                                   
                    B02.AFP_BUP(I)         = B01.AFP_BUP(I);                    
     /*FOR Å SPARE INFO ETTER OPPHØR VED O2 : */                                
                    DO J = 1 TO 5;                                              
                       B02.VENTØVR(I,J)       = B01.VENTØVR(I,J);               
                    END;                                                        
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  B02.ALDERSP  (I)            = '';                             
                  B02.PENSJON_FØR_9802(I)     = ' '; /* 200103 HL */            
               END;                                                             
 /* ***************************************************************** */        
 /* DERSOM SØKER ER UGIFT, SKILT ELLER ETTERLATT                      */        
 /* ***************************************************************** */        
                                                                                
       IF B02.SIVILSTAND(I) = 'U' !                                             
          B02.SIVILSTAND(I) = 'E' !                                             
   /*200411 HL :*/                                                              
          B02.STATUS_KODE_HIST(I_EK) = 'D' !                                    
          B02.SIVILSTAND(I) = 'S' THEN                                          
          DO;                                                                   
             B02.VIRK_DATO_ÅMD(I)     = AUTODATO_ÅM*100; /*2000*/               
                                                                                
  /* HISTORIKK MÅ SPARES : 200102                */                             
            B02.STATUS_KODE_HIST(I) = 'X';                                      
  /* HISTORIKK MÅ SPARES : 200102                                               
             IF B01.UFT_ÅMD(I,1) > 0           THEN                             
                B02.STATUS_KODE_HIST(I) = 'X';                                  
             ELSE                                                               
                B02.STATUS_KODE_HIST(I) = 'O';                                  
   ************************************************* */                         
                                                                                
             TRANS_OPPL_OMR.TRANSTYPE              = 73;                        
                                                                                
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* DERSOM SØKER HAR EKTEFELLE,EKTEFELLEN HAR IKKE EGEN YTELSE        */        
 /* ***************************************************************** */        
                                                                                
             IF B02.PENSJONSTYPE1(I_EK) = 'G' !                                 
                B02.PENSJONSTYPE1(I_EK) = 'F' !                                 
                B02.PENSJONSTYPE1(I_EK) = ' ' THEN                              
                DO;                                                             
                                                                                
 /* ***************************************************************** */        
 /* B02.STATUS OG UNDERLIGGENDE SEGMENTER SLETTES                     */        
 /* ***************************************************************** */        
                                                                                
                   B02.VIRK_DATO_ÅMD(I)  = AUTODATO_ÅM*100; /*2000*/            
                                                                                
  /* HISTORIKK MÅ SPARES : 200102                */                             
            B02.STATUS_KODE_HIST(I) = 'X';                                      
                                                                                
  /* HISTORIKK MÅ SPARES : 200102                                               
                   IF B01.UFT_ÅMD(I,1) > 0           THEN                       
                         B02.STATUS_KODE_HIST(I) = 'X';                         
                   ELSE                                                         
                      B02.STATUS_KODE_HIST(I) = 'O';                            
   ***************************************************** */                     
                                                                                
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100; /*2000*/          
                                                                                
                   IF B01.UFT_ÅMD(I_EK,1) > 0           THEN                    
                                                                                
                      DO;                                                       
                         B02.STATUS_KODE_HIST(I_EK) = 'X';                      
                         B02.PENSJONSTYPE1(I_EK) = 'U';                         
                         B02.PENSJONSTYPE2(I_EK) = ' ';                         
                      END;                                                      
                                                                                
                   ELSE                                                         
                      DO;                                                       
                         B02.STATUS_KODE_HIST(I_EK) = 'O';                      
                                                                                
                      END;                                                      
                                                                                
                   TRANS_OPPL_OMR.TRANSTYPE              = 73;                  
                                                                                
                                                                                
                   CALL OPPHØR_KOBLING_TO_PERSONER(I,I_EK);                     
                                                                                
                END;                                                            
                                                                                
             ELSE                                                               
                DO;                                                             
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR EGEN PENSJON                                       */        
 /* ***************************************************************** */        
                                                                                
                    DO IND = 1 TO 13 WHILE                                      
                               (B01.FNR_TILKN(I,IND) > 0);                      
                IF B01.TILKN.TILKNYTNINGSKODE(I,IND) = 'L'  !                   
                   B01.TILKN.TILKNYTNINGSKODE(I,IND) = 'V'  !                   
                   B01.TILKN.TILKNYTNINGSKODE(I,IND) = 'W'   THEN               
                                                                                
                       DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);                   
                                                                                
                         CALL OPPHØR_KOBLING_TO_PERSONER(I,J);                  
                                                                                
    /*2000*/             B02.VIRK_DATO_ÅMD(J) = AUTODATO_ÅM*100;                
                         B02.STATUS_KODE_HIST(J)      = 'O';                    
                       END;                                                     
                    END;                                                        
                    B02.PENSJONSTYPE1(I) = 'G';                                 
                    B02.PENSJONSTYPE2(I) = ' ';                                 
                    B02.PENSJONSTYPE3(I) = ' '; /*200309 HL */                  
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR PENSJON                                            */        
 /* ***************************************************************** */        
                                                                                
                    IF B02.PENSJONSTYPE2(I_EK) ^= 'N'    THEN                   
                       B02.PENSJONSTYPE2(I_EK) = 'P';                           
                                                                                
 /* ***************************************************************** */        
 /* FINNER SØKERS FNR I EKTEFELLENS TILKNYTNINGSSEGMENT               */        
 /* ***************************************************************** */        
                                                                                
                    DO IND = 1 TO 13 WHILE (                                    
                                       B02.FNR_TILKN(I_EK,IND) > 0);            
                       IF B02.FNR_TILKN(I_EK,IND) =                             
                                              B02.FNR(I) THEN                   
                          DO;                                                   
                             B02.TILKN.TILKNYTNINGSKODE(                        
                                                   I_EK,IND) = 'G';             
                             TRANS_OPPL_OMR.TRANSTYPE = 73;                     
                          END;                                                  
                    END;                                                        
              END;                                                              
         END;                                                                   
  END AFP_NULL_OPPHØRER;                                                        
