 /*   SIST ENDRET PÅ PROD   2007.11.08  8.20.11 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.10.17  8.07.52 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.05.19  9.17.32 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.06.30 13.02.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.13 14.18.04 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.11.07 10.08.07 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.11.06 14.00.56 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2001.06.18 13.28.33 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.03.02  8.56.28 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.02.07 12.57.40 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.12.14 10.32.55 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.15 12.57.29 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.15 11.48.29 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.23  9.39.29 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.15 11.51.47 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.11.26  8.34.13 AV   JDA7339          */        
 /*       SIST ENDRET 11/08-99 10.36.36 AV   JDA7339                  */        
 /*       SIST ENDRET 11/08-99 10.35.05 AV   JDA7339                  */        
 /*       SIST ENDRET 30/07-99 09.26.16 AV   JDA7339                  */        
 /*       SIST ENDRET 30/07-99 09.25.35 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 14.56.27 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 14.56.07 AV   JDA7339                  */        
 /*       SIST ENDRET 16/02-99 12.16.06 AV   JDA7339                  */        
 /*       SIST ENDRET 16/02-99 12.15.37 AV   JDA7339                  */        
 /*       SIST ENDRET 05/02-99 08.36.35 AV   JDA7339                  */        
 /*       SIST ENDRET 05/02-99 08.36.12 AV   JDA7339                  */        
 /*       SIST ENDRET 20/07-98 10.04.12 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 14.47.49 AV   JDA7339                  */        
 /*  NB:  MÅ ENDERS R001B003 OGSÅ                                    */         
 /*  NB:  MÅ ENDERS R001B003 OGSÅ                                    */         
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014141 - HOVEDPROG I PLI                                     */        
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN PLUKKER UT POENGREKKEN SOM SPT, OPT OG PÅ ER REGNET UT */        
 /*    ETTER. I TILFELLER HVOR PENSJONISTEN HADDE UFØREPENSJON FRA FØR*/        
 /*    1973 OG NÅ DØR ELLER BLIR ALDERSPENSJONIST, UNDERSØKER RUTINEN */        
 /*    OM TILLEGGSPENSJONEN SOM UFØR VAR STØRRE ENN VI NÅ HAR KOMMET  */        
 /*    FRAM TIL. I DISSE TILFELLENE FÅR PENSJONISTEN POENGREKKE, SPT, */        
 /*    OPT OG PÅ ETTER UFØREALTERNATIVET.                             */        
 /*ENDRING:                                                           */        
 /*    DET MÅ TAS HENSYN TIL DEN SISTE UFØREGRADEN VED                */        
 /*    SAMMENLIGNINGEN AV ALTERNATIVENE UNDER GARANTIBESTEMMELSEN OG  */        
 /*    AT GARANTIEN IKKE GJELDER PERSONER FØDT FØR 1904.              */        
 /*                                                                   */        
 /*    17.10.84                                                       */        
 /*       DET SKAL IKKE TAS HENSYN TIL SISTE UFØREGRAD SOM            */        
 /*       NEVNT OVENFOR    REF. SLETNER P1.                           */        
 /*                                                                   */        
 /*ENDRING PGA NY LOV FRA 1992 - HL.     VVV                          */        
 /*                                                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
  BESPT:PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                     
      %INCLUDE P0019906; /* TRANS_OPPL_OMR                            */        
      %INCLUDE P0019908; /* KOM_OMR                                   */        
      %INCLUDE P0019910; /* STYRINGS_OMR                              */        
      %INCLUDE P0019912; /* DIV_PARAM_OMR                             */        
      %INCLUDE P0019924; /* GV_TAB_RE                                 */        
                                                                                
      %INCLUDE P0012002; /* PCB_UIB_PEKER_OMR & PCB_PEKER_OMR         */        
   DCL 1 RF1 BASED(RF1_PCB_PEKER),                                              
      %INCLUDE P0012003;                                                        
      %INCLUDE DLIUIB;                                                          
                                                                                
      %INCLUDE P0014002; /* W_POREKKE                                 */        
      %INCLUDE P0014003; /* TAB                                       */        
      %INCLUDE P0014009; /* POREKKE (14)                              */        
   DCL 1 B02 BASED(B01_B02_PEKER), %INCLUDE P0019921;                           
   DCL 1 B01 BASED(B01_PEKER),     %INCLUDE P0019921;  /* TRUDE*/               
    DCL                                                                         
       COMMAREA_PEKER   PTR,                                                    
       B01_B02_PEKER    PTR,                                                    
       W_PEKER          PTR,                                                    
       ADDR             BUILTIN,                                                
       VERIFY           BUILTIN,                                                
       PLITDLI          ENTRY,                                                  
       W_FNR11          PIC'(11)9',        /*2000*/                             
       W_FNR13          PIC'(13)9',        /*2000*/                             
       I                FIXED BIN (15),                                         
       J                FIXED BIN (15),                                         
       K                FIXED BIN (15),                                         
       SIST_REG         FIXED BIN (15),                                         
       DØDSTPKT         PIC'(8)9',         /*2000*/                             
       DATO             PIC'(8)9',         /*2000*/                             
       ÅRMND               PIC'999999',  /*2000*/                               
       ÅR_FØR_AP           PIC'9999',     /*2000*/                              
       SEKSTINIÅR          PIC'9999',     /*2000*/                              
       SEKSTISEKSÅR        PIC'9999';   /*2000*/                                
    DCL                                                                         
       FAST_G           FIXED DEC(5);                                           
    DCL                                                                         
       1 W_FNR_R13      DEF W_FNR13,          /*2000*/                          
         2 DAG          PIC'(2)9',                                              
         2 MND          PIC'(2)9',                                              
         2 ÅR           PIC'(4)9',                                              
         2 ÅRHUNDRE     PIC'9',                                                 
         2 FILLER       PIC'(4)9';                                              
    DCL                                                                         
       1 DØDSDATO       DEF DØDSTPKT,                                           
         2 ÅR           PIC'(4)9',        /*2000*/                              
         2 MND          PIC'(2)9',                                              
         2 DAG          PIC'(2)9';                                              
    DCL                                                                         
       1 ÅRMND_DEF      DEF ÅRMND,                                              
         2 ÅR           PIC'(4)9',       /*2000*/                               
         2 MND          PIC'(2)9';                                              
    DCL                                                                         
       1 DAGENS_DATO    DEF DATO,                                               
         2 ÅR           PIC'(4)9',       /*2000*/                               
         2 MND          PIC'(2)9',                                              
         2 DAG          PIC'(2)9';                                              
    DCL                                                                         
       W_TP_VT          FIXED DEC(5)   INIT(0),                                 
       W_TP             FIXED DEC(5)   INIT(0),                                 
       W_TP_ALT         FIXED DEC(5)   INIT(0);                                 
    DCL                                                                         
       SISTE_UFØR_START FIXED DEC(4)   INIT(0);      /*2000*/                   
    DCL TELLER          FIXED DEC(5)   INIT(0);                                 
    DCL BUP_FPP92(1963:2060)   FIXED DEC(3,2) INIT(0);    /*KONSTS*/            
    DCL BUP92_UFØR      FIXED DEC(3,2) INIT(0);              /*HL*/             
    DCL FLYTTE_POENG    FIXED DEC(3,2) INIT(0);              /*HL*/             
    DCL FRA_ÅR          FIXED BIN(15);                       /*HL*/             
    DCL POENG_E91       CHAR (1)       INIT (' ');           /*TS*/             
                                                                                
        DCL PÅE    PIC '99';                                                    
        DCL PÅE1   PIC '99';                                                    
    DCL VIRK_LOV92_ÅM   PIC   '(6)9'   INIT(0);         /*2000*/                
    DCL UNG_UFØR_START_ÅR  PIC'9999' INIT(0);             /*KONSTS*/            
    DCL ALDER_PÅ_VIRK_DATO    PIC'(4)9' INIT(0);                                
    DCL FIXED_DEC5             FIXED DEC  (5)     INIT(0);                      
                                                                                
    /* PGA PROBLEMER NÅR CICS STARTER SAMME PGM FLERE GANGER -                  
       NULLSTILLES ALLE VARIABLER HER - 101299 MARTIN           */              
       W_FNR11            = 0;                                                  
       W_FNR13            = 0;                                                  
       I                  = 0;                                                  
       K                  = 0;                                                  
       SIST_REG           = 0;                                                  
       DØDSTPKT           = 0;                                                  
       DATO               = 0;                                                  
       ÅRMND              = 0;                                                  
       ÅR_FØR_AP          = 0;                                                  
       SEKSTINIÅR         = 0;                                                  
       SEKSTISEKSÅR       = 0;                                                  
       FAST_G             = 0;                                                  
       W_TP_VT            = 0;                                                  
       W_TP               = 0;                                                  
       W_TP_ALT           = 0;                                                  
       SISTE_UFØR_START   = 0;                                                  
       TELLER             = 0;                                                  
       BUP_FPP92(*)       = 0;                                                  
       BUP92_UFØR         = 0;                                                  
       FLYTTE_POENG       = 0;                                                  
       FRA_ÅR             = 0;                                                  
       PÅE                = 0;                                                  
       PÅE1               = 0;                                                  
       VIRK_LOV92_ÅM      = 0;                                                  
       UNG_UFØR_START_ÅR  = 0;                                                  
                                                                                
    /* === HER STARTER PROGRAMBEHANDLINGEN 4141 ===================== */        
                                                                                
    UIBPTR                  = UIB_PEKER;                                        
    W_PEKER                 = WORK_TRANS_LISTE_PEKER;                           
    WORK_TRANS_LISTE_PEKER  = ADDR(TAB);                                        
    VIRK_LOV92_ÅM           = VIRKNINGSDATO_ÅMD/100;   /*2000*/                 
    POREKKE(IND)            = '';                  /*9908*/                     
    W_POREKKE               = '';                  /*9911*/                     
                                                                                
    IF B01_B02_IND          = 1 THEN                                            
       B01_B02_PEKER        = B01_PEKER;                                        
    ELSE                                                                        
       B01_B02_PEKER        = B02_PEKER;                                        
                                                                                
    DATO                    = DATO_2000;              /*2000*/                  
    DØDSTPKT                = B02.DØDSDATO_ÅMD(IND);                            
    W_FNR11                 = B02.FNR(IND);                 /*2000*/            
    W_FNR13                 = KONV_FNR11_FNR13(W_FNR11);                        
    FIXED_DEC5 = F_ALDER(W_FNR11,(B02.VIRK_DATO_ÅMD(IND)));                     
    ALDER_PÅ_VIRK_DATO = FIXED_DEC5;                                            
                                                                                
    IF W_FNR_R13.ÅR < 1898 THEN                    /*2000*/                     
       GO TO L999;                                                              
                                                                                
    FAST_G                  = 2000;                                             
                                                                                
    ÅR_FØR_AP               = W_FNR_R13.ÅR + 66;                                
       IF W_FNR_R13.ÅR < 1904    THEN               /*2000*/                    
          ÅR_FØR_AP         = ÅR_FØR_AP + 3;                                    
       ELSE                                                                     
          IF W_FNR_R13.ÅR > 1903 & W_FNR_R13.ÅR < 1906 THEN/*2000*/             
          ÅR_FØR_AP         = 1972;           /*2000*/                          
                                                                                
    SEKSTINIÅR              = W_FNR_R13.ÅR + 69;                                
    SEKSTISEKSÅR            = SEKSTINIÅR - 3;                                   
                                                                                
                                                                                
    CALL KLARGJØR_TAB;             /*4151    ENDERET SATISH 21.4.91 */          
                                                                                
                                                                                
    CALL BEREGN_POENGREKKE(IND,W_FNR13);  /*4152*/    /*2000*/                  
                                                                                
                                                                                
    IF FEIL_MELD_NR > 0  THEN                                                   
       GO TO L999;                                                              
    ELSE                                                                        
       PROGRAM_ID = 'R0014141';                                                 
                                                                                
    POREKKE.TYPE(IND) = 'O';                                                    
 /*                                                                   */        
 /*    'O' STÅR FOR ORDINÆR POENGREKKE                                */        
 /*                                                                   */        
                                                                                
    DO I = 1963 TO SEKSTINIÅR;       /*2000*/                                   
 /*   IF B02.VERNEPLIKTÅR(1,1) > 0 THEN       */                                
      IF (B02.VERNEPLIKTÅR(IND,1) > 0)    &                                     
         ( IND = 2   !                                                          
           VIRK_LOV92_ÅM > 200006)  /*KVINNER FRA JULI 2000*/                   
        THEN DO;                                                                
         /*DET ER REGISTRERT VERNEPLIKTSÅR FOR VEDKOMMENDE */                   
         IF TAB.POENG_ANVENDT(I)  = TAB.VERNEPL_POENG(I) &                      
            TAB.VERNEPL_POENG(I) > 0                     THEN                   
 /*       VERNEPLIKTSPOENG SKAL IKKE VÆRE MED VED                     */        
 /*       BEREGNING AV SLUTTPOENGTALL..                               */        
          POREKKE.POENG(IND,I)   = TAB.INNT_POENG(I) + 0.005;                   
         ELSE                                                                   
          POREKKE.POENG(IND,I)   = TAB.POENG_ANVENDT(I);                        
         END;  /*VP FOR KVINNER*/                                               
      ELSE                                                                      
         POREKKE.POENG(IND,I)   = TAB.POENG_ANVENDT(I);                         
       POREKKE.KODE(IND,I)       = TAB.POENG_KODE(I);                           
       POREKKE.UFG(IND,I)        = TAB.UFØR_GRAD(I);                            
       POREKKE.BUP_FPP(IND,I)    = TAB.BUP_FPP(I);                              
 /* TESTEN NEDENFOR STO  I TIDEN 16-26 FEBRUAR */                               
 /* DEN GA POENG FOR FREMTIDIGE OMSORGSPOENG   */                               
 /*RETTING MÅ GJØRES PÅ EN ANNEN MÅTE 9902 HL */                                
 /*         IF TAB.OMSORG_KODE(I) = 'J'   !                                     
               TAB.OMSORG_KODE(I) = 'K'   !                                     
               TAB.OMSORG_KODE(I) = 'L'         THEN                            
              DO                                                                
               IF POREKKE.POENG(IND,I) < 3.00    THEN                           
                  POREKKE.POENG(IND,I) = 3.00                                   
              END                                    */                         
       IF TAB.POENG_KODE(I)      = 'U54'      !                                 
          TAB.POENG_KODE(I)      = 'U60'      !                                 
          TAB.POENG_KODE(I)      = 'U64'      THEN /*JF 13.8.02*/               
          DO;                                                                   
            IF B02.PENSJONSTYPE1(IND)  = 'K'  THEN                              
             B02.ALDERSP.AFP_BUP(IND)  = POREKKE.BUP_FPP(IND,I);/*0897*/        
                                                                                
                                                                                
             IF I < 1973                            THEN /*2000*/               
                TELLER  = W_FNR_R13.ÅR + 70 - I;                                
             ELSE                                                               
                TELLER  = W_FNR_R13.ÅR + 67 - I;                                
             TELLER = TELLER - 1;                                               
             DO K = 0 TO TELLER WHILE                                           
                   (TAB.SISTE_BUP_ÅR(I + K) ^= 'J');                            
             END;                                                               
             IF K > TELLER THEN                                                 
                POREKKE.BUP_FPP_ÅR(IND)  = K;                                   
             ELSE                                                               
                POREKKE.BUP_FPP_ÅR(IND)  = K + 1;                               
          END;                                                                  
                                                                                
    END;                                                                        
                                        /*2000 : */                             
    CALL BEREGN_SPT_OPT_PÅ(IND,POREKKE(IND),W_FNR13);    /*4153*/               
                                                                                
    POREKKE_P67(IND) = POREKKE(IND);                                            
    POREKKE_PT (IND) = POREKKE(IND);                                            
                                                                                
    CALL SETT_TP_VT_GRUNNLAG;                           /*4144*/                
    CALL BEREGN_SPT_OPT_PÅ(IND,POREKKE_P67(IND),W_FNR13); /*2000*/              
                                                                                
    SIST_REG = 1;                                                               
    DO I = 1 TO 7 WHILE(B02.UFT_ÅMD(IND,I) > 0);       /*2000*/                 
       SIST_REG = I;                                                            
    END;                                                                        
                                                                                
    IF (B02.UFT_ÅMD    (IND,SIST_REG) > 0     &         /*2000*/                
        B02.UFT_ÅMD    (IND,SIST_REG) < 19730100) &     /*2000*/                
        B02.OPPHØRSKODE(IND,SIST_REG) ^= 'J'    THEN                            
       DO;                                                                      
 /*                                                                   */        
 /*    UFØR FØR 1973, UNDERSØKER OM DET FINNES BEDRE ALT. TIL TP..... */        
 /*                                                                   */        
                                                                                
          SISTE_UFØR_START = 0;                                                 
          DO I = SEKSTINIÅR TO 1967 BY -1;    /*2000*/                          
             IF TAB.UFØR_PERIODE(I) = 'S' THEN                                  
                DO;                                                             
                   SISTE_UFØR_START = I;                                        
                   I = 1967;      /*2000*/                                      
                END;                                                            
          END;                                                                  
          IF SISTE_UFØR_START > 1966 & SISTE_UFØR_START < 1973 THEN             
             DO;                                                                
                                                                                
                IF  (B02.PENSJONSTYPE1(IND) = 'D'          !                    
                     B02.PENSJONSTYPE1(IND) = 'A'  )       &                    
      /*             W_FNR_R13.ÅRHUNDRE     <  5           &  */                
                     W_FNR_R13.ÅR           >  1902   THEN /*2000*/             
                                                                                
                   DO;                                                          
 /*HL 200106*/  IF  (B02.PENSJONSTYPE1(IND) = 'D'    &                          
                    (DØDSDATO.ÅR > 1991 ) )     THEN                            
 /*4148*/             W_TP    = F_TP92  (W_FNR_R13.ÅR,G,                        
                                               POREKKE.SPT(IND),                
                                               POREKKE.OPT(IND),                
                                               POREKKE.PÅ (IND),                
                                    POREKKE.PÅ_ETTER91 (IND),                   
                                               100,100,'J');                    
                ELSE                                                            
 /*4142*/             W_TP    = F_TILLEGGSPENSJON(W_FNR_R13.ÅR,G,               
                                         POREKKE.SPT(IND),                      
                                         POREKKE.OPT(IND),                      
                                         POREKKE.PÅ (IND),                      
                                         100,100,'J');                          
                                                                                
 /*4142      W_TP_VT = F_TILLEGGSPENSJON(W_FNR_R13.ÅR,G,   */                   
 /*4148*/             W_TP_VT = F_TP92  (W_FNR_R13.ÅR,G,                        
                                               POREKKE_P67.SPT(IND),            
                                               POREKKE_P67.OPT(IND),            
                                               POREKKE_P67.PÅ (IND),            
                                       POREKKE_P67.PÅ_ETTER91 (IND),            
                                               100,100,'J');                    
                                                                                
                      IF B02.PENSJONSTYPE1(IND) = 'A' THEN                      
                         W_POREKKE.TYPE = 'U';                                  
                      ELSE                                                      
                         W_POREKKE.TYPE = 'D';                                  
                                                                                
  /* ************************************************************** */          
  /* ERIK, MAI 1990                                                 */          
  /* ************************************************************** */          
                                                                                
                                                                                
 /*UTLAND*/                                                                     
                                                                                
 /*FJERNET 11.7.90  IF B02.SPESOPPL.BOSATT(IND) = 0    &    */                  
                    IF B02.SPESOPPL.BOSATT(IND) = 0    !                        
                       B02.STATUS.VILKÅR_8_4_3A(IND) = 'J' THEN                 
                                                                                
 /*UTLAND HIT*/                                                                 
                                                   /*2000 : */                  
 /*4154*/             CALL BEREGN_BUP_FPP_ALTERNATIV(IND,W_FNR13);              
                                                                                
                      DO I = 1963 TO 2060; /*2000*/                             
                       IF B02.VERNEPLIKTÅR(IND,1) > 0 THEN                      
                         IF TAB.POENG_ANVENDT(I) =                              
                                          TAB.VERNEPL_POENG(I) &                
                             TAB.VERNEPL_POENG(I) > 0          THEN             
                             W_POREKKE.POENG(I) = TAB.INNT_POENG(I) +           
                                                               0.005;           
                                                                                
 /*                                                                   */        
 /*                      VERNEPLIKTSPOENG SKAL IKKE VÆRE MED VED      */        
 /*                      BEREGNING AV SLUTTPOENGTALL..                */        
 /*                                                                   */        
                                                                                
                         ELSE                                                   
                            W_POREKKE.POENG(I)  =                               
                                          TAB.POENG_ALTERNATIV(I);              
                        ELSE                                                    
                            W_POREKKE.POENG(I)  =                               
                                          TAB.POENG_ALTERNATIV(I);              
                         W_POREKKE.KODE(I)      =                               
                                          TAB.POENG_ALTERNATIV_KODE(I);         
                         W_POREKKE.UFG(I)       = TAB.UFØR_GRAD(I);             
                         W_POREKKE.BUP_FPP(I)   = TAB.BUP_FPP(I);               
                                                      /*2000:*/                 
                         IF I > (SEKSTINIÅR - 3) & I > 1972       THEN          
                            W_POREKKE.UFG(I)    =                               
                                                TAB.UFØR_GRAD(I - 1);           
                                                                                
                         IF TAB.POENG_ALTERNATIV_KODE  (I)                      
                                                  = 'U54'    &                  
                                                                                
 /* ENDRET 1.4.86  HL  - DET SKAL OGSÅ TESTES PÅ 'D'           */               
                                                                                
                            (TAB.UFØR_PERIODE(I)   = 'S'   !                    
                             TAB.UFØR_PERIODE(I)   = 'D'     )  THEN            
                                                                                
 /* HIT 1.4.86 HL                                              */               
                                                                                
 /*ENDRET 10.5.91 HL : BEGRENSET ANTALL FREMTIDIGE POENGÅR*/                    
                                                                                
                         DO;                                                    
 /*                         W_POREKKE.BUP_FPP_ÅR        =                       
                                                W_FNR_R13.ÅR + 70 - I           
                            IF W_FNR_R13.ÅRHUNDRE > 4       THEN                
                               W_POREKKE.BUP_FPP_ÅR     =                       
                                    W_POREKKE.BUP_FPP_ÅR - 100                  
 */                                                                             
                                                                                
                             TELLER  = W_FNR_R13.ÅR + 70 - I;                   
  /*2000                 IF W_FNR_R13.ÅRHUNDRE > 4             THEN             
                            TELLER  = POREKKE.BUP_FPP_ÅR(IND) - 100 */          
                             TELLER = TELLER - 1;                               
                             DO K = 0 TO TELLER WHILE                           
                                   (TAB.SISTE_BUP_ÅR(I + K) ^= 'J');            
                             END;                                               
                             IF K ^> TELLER THEN                                
                                K  = K + 1;                                     
  /*3.5.96 HL                POREKKE.BUP_FPP_ÅR(IND)  = K     */                
                             W_POREKKE.BUP_FPP_ÅR     = K;                      
                                                                                
 /*HIT 10.5.91 HL */                                                            
                         END;                                                   
                      END;                                                      
                                                                                
                      CALL BEREGN_SPT_OPT_PÅ_ALT(IND,W_POREKKE,                 
                             W_FNR13);   /*R0014156*/    /*2000*/               
                                                                                
                      IF B02.PENSJONSTYPE1(IND) = 'A' THEN                      
                                                                                
 /*4142*/                W_TP_ALT = F_TILLEGGSPENSJON(W_FNR_R13.ÅR,G,           
                                                   W_POREKKE.SPT,               
                                                   W_POREKKE.OPT,               
                                                   W_POREKKE.PÅ,                
                                                   100,100,'J');                
                                                                                
                      ELSE                                                      
                                                                                
 /*4142*/                W_TP_ALT = F_TILLEGGSPENSJON(W_FNR_R13.ÅR,G,           
                                                   W_POREKKE.SPT,               
                                                   W_POREKKE.OPT,               
                                                   W_POREKKE.PÅ,                
                                                   100,100,'J');                
                                                                                
                      IF POREKKE_PT.PÅ (IND) < W_POREKKE.PÅ  THEN               
                                                                                
                         POREKKE_PT (IND) = W_POREKKE;                          
                                                                                
                      IF W_TP_ALT >= W_TP    THEN                               
                                                                                
                         DO;                                                    
                            POREKKE    (IND) = W_POREKKE;                       
                            POREKKE.BUP_FPP_ÅR(IND)  = K;                       
                            POREKKE.PÅ_ETTER91(IND)  = 0;  /*HL*/               
                         END;                                                   
                                                                                
                      IF W_TP_ALT >= W_TP_VT THEN                               
                         DO;                                                    
                            POREKKE_P67(IND) = W_POREKKE;                       
                            POREKKE_P67.PÅ_ETTER91(IND) = 0;  /*HL*/            
                         END;                                                   
 /*28.11.86 HL - FRAPP 270 - VI SAVER I OMRÅDE 12 ELLER 13 */                   
                                                                                
                      POREKKE(IND + 11)     = W_POREKKE;                        
                                                                                
                      POREKKE_P67(IND + 11) = W_POREKKE;                        
 /* HIT 28.11.86 HL ************************************   */                   
                                                                                
                   END;                                                         
             END;                                                               
       END;                                                                     
    ELSE                                                                        
                                                                                
       IF B02.UFT_ÅMD    (IND,SIST_REG) >= 19730100  &   /*2000*/               
         ( B02.OPPHØRSKODE(IND,SIST_REG)  ^= 'J'  &                             
           B02.PENSJONSTYPE1(IND)          = 'D' )   THEN                       
                                                                                
                                                                                
          /* GIR 100 PROSEN UP-TP MER ENN EP-TP               */                
                                                                                
          DO;                                                                   
                                                                                
            PÅE   =    POREKKE.PÅ_ETTER91(IND);                                 
             IF ^ (DØDSDATO.ÅR > 1991    &             /*2000*/                 
                   W_FNR_R13.ÅR > 1925 )  THEN         /*2000*/                 
     /*            W_FNR_R13.ÅRHUNDRE < 5 )    THEN      2000*/                 
                DO;                                                             
                  IF POREKKE.PÅ_ETTER91(IND)   >  0 &                           
                     SEKSTINIÅR                > 1991 &  /*2000*/               
                    (POREKKE.POENG(IND,(SEKSTISEKSÅR + 1)) +                    
                     POREKKE.POENG(IND,(SEKSTISEKSÅR + 2)) +                    
                     POREKKE.POENG(IND,(SEKSTISEKSÅR + 3)) > 0)  THEN           
                      POENG_E91   = 'J' ;                                       
                  ELSE                                                          
                     POREKKE.PÅ_ETTER91(IND) = 0;                               
                END;                                                            
    /*       ELSE                                                               
             IF PÅE > 0      THEN                                               
                POENG_E91   = 'J' ;      */                                     
                                                                                
            PÅE1  =    POREKKE.PÅ_ETTER91(IND);                                 
             W_TP    = F_TP92  (W_FNR_R13.ÅR,G,         /*4148*/                
                                         POREKKE.SPT(IND),                      
                                         POREKKE.OPT(IND),                      
                                         POREKKE.PÅ (IND),                      
                                    POREKKE.PÅ_ETTER91 (IND),                   
                                         100,100,'J');                          
                                                                                
             W_POREKKE = POREKKE(IND);                                          
     /*9712 HL : */                                                             
             W_POREKKE.POENG(SEKSTISEKSÅR + 1) = 0;                             
             W_POREKKE.POENG(SEKSTISEKSÅR + 2) = 0;                             
             W_POREKKE.POENG(SEKSTISEKSÅR + 3) = 0;                             
     /*HIT*/                                                                    
             ÅRMND     = B02.UFT_ÅMD(IND,SIST_REG)/100;  /*2000*/               
             FRA_ÅR    = ÅRMND_DEF.ÅR;                                          
                                                                                
             FLYTTE_POENG = W_POREKKE.BUP_FPP(ÅRMND_DEF.ÅR);                    
                                                                                
         /*  DO I = ÅRMND_DEF.ÅR TO SEKSTISEKSÅR  ** ENDRET: SE WHILE*/         
         /*  ENDRET PGA REDUSERT FREMTIDIG BUP ÅR. TRUDE 120995      */         
    /*REMEDY 2973 - RETTET 200709 HL : */                                       
       IF B02.REDUSERT_ANT_BUP_ÅR (IND,SIST_REG) = 0     THEN                   
           TAB.SISTE_BUP_ÅR(*) = ' ';                                           
 /*        TAB.SISTE_BUP_ÅR(SEKSTISEKSÅR - 1) = ' ';     */                     
             DO I = ÅRMND_DEF.ÅR TO SEKSTISEKSÅR WHILE                          
        /*                     (TAB.SISTE_BUP_ÅR(I) ^= 'J')  */                 
                  (TAB.SISTE_BUP_ÅR(I-1) ^= 'J'); /*200008*/                    
                IF VIRK_LOV92_ÅM    > 199200        &      /*2000*/             
                   I                = 1992         THEN    /*2000*/             
                   DO;                                                          
                      FLYTTE_POENG     = BUP92_UFØR;                            
                      FRA_ÅR           = 1992;             /*2000*/             
                   END;                                                         
 /*             W_POREKKE.POENG(I)  = W_POREKKE.BUP_FPP(ÅRMND_DEF.ÅR)*/         
                IF B02.OPPHØRSKODE(IND,SIST_REG)  = 'D'    THEN                 
                   W_POREKKE.POENG(I)  = FLYTTE_POENG;                          
 /*             W_POREKKE.KODE (I)  = '   '                  */                 
                                                                                
             END;                                                               
                                                                                
             W_POREKKE.KODE(FRA_ÅR) = 'U54';                                    
                                                                                
 /*ENDRET 10.5.91 HL : BEGRENSET ANTALL FREMTIDIGE POENGÅR*/                    
                                                                                
  /*    W_POREKKE.BUP_FPP_ÅR  = SEKSTISEKSÅR - ÅRMND_DEF.ÅR + 1  */             
                                                                                
             TELLER = SEKSTISEKSÅR - ÅRMND_DEF.ÅR;                              
             IF SEKSTISEKSÅR > 1991       THEN     /*2000*/                     
                IF ÅRMND_DEF.ÅR > 1991    THEN     /*2000*/                     
                   I = ÅRMND_DEF.ÅR;                                            
                ELSE                                                            
                   DO;                                                          
                      I = 1992;                    /*2000*/                     
                      TELLER = SEKSTISEKSÅR - 1992;  /*2000*/                   
                   END;                                                         
             ELSE                                                               
                I = ÅRMND_DEF.ÅR;                                               
             DO K = 0 TO TELLER WHILE                                           
                         (TAB.SISTE_BUP_ÅR(I + K) ^= 'J');                      
             END;                                                               
 /* HER HAR VÆRT FEIL LENGE - HL 200008 : */                                    
             IF K ^> TELLER THEN                                                
                K  = K + 1;                                                     
             W_POREKKE.BUP_FPP_ÅR  = K;                                         
                                                                                
 /*HIT 10.5.91 HL */                                                            
                                                                                
             CALL BEREGN_SPT_OPT_PÅ(IND,W_POREKKE,W_FNR13); /*2000*/            
                                                     /*R0014153*/               
      /*     IF ^ (DØDSDATO.ÅR > 91    &                                        
                   W_FNR_R13.ÅR > 25   &                                        
                   W_FNR_R13.ÅRHUNDRE < 5 )    THEN                             
                 W_POREKKE.PÅ_ETTER91   = 0            */                       
                                                                                
             IF  POENG_E91   = ' '  &          /*TS0895*/                       
                 ÅRMND       < 199200    THEN         /*2000*/                  
                   W_POREKKE.PÅ_ETTER91  = 0;                                   
                                                                                
                                                                                
 /*4148*/    W_TP_ALT = F_TP92(W_FNR_R13.ÅR,G,                                  
                                          W_POREKKE.SPT,                        
                                          W_POREKKE.OPT,                        
                                          W_POREKKE.PÅ,                         
                                    W_POREKKE.PÅ_ETTER91,                       
                                          100,100,'J');                         
                                                                                
             IF W_TP_ALT >  W_TP    THEN                                        
                                                                                
                POREKKE    (IND) = W_POREKKE;                                   
                                                                                
          END;                                                                  
                                                                                
 /*RUTINER FOR Å GI TT TIL DEN SOM HAR FÅTT REDUSERT TT_FRAMT */                
 /*ETTER 4/5-DELS REGELEN, OG SOM HAR HATT INNTEKT I SLIKE ÅR */                
                                                                                
    IF TRANSTYPE = 24      &                                                    
       ALDER_PÅ_VIRK_DATO = 6701   &                                            
       B02.TT_16_66(IND) < 480     &                                            
       B02.REDUSERT_ANT_BUP_ÅR(IND,1) > 0      THEN                             
    DO;                                                                         
       TELLER = B02.REDUSERT_ANT_BUP_ÅR(IND,1);                                 
       I = W_FNR_R13.ÅR + 66;                                                   
       J = B02.UFT_ÅMD(IND,1) / 10000;                                          
       TELLER = I - (J + B02.REDUSERT_ANT_BUP_ÅR(IND,1)) + 1;                   
       DO WHILE (TELLER > 0);                                                   
          IF TAB.INNT_POENG(I) > 0   THEN                                       
             B02.TT_16_66(IND) =                                                
             B02.TT_16_66(IND) + 12;                                            
             I = I - 1;                                                         
             TELLER = TELLER - 1;                                               
       END;                                                                     
       IF B02.TT_16_66(IND) > 480      THEN                                     
          B02.TT_16_66(IND) = 480;                                              
    END;                                                                        
                                                                                
                                                                                
                                                                                
 %INCLUDE R0014142; /* F_TILLEGGSPENSJON                      */                
 %INCLUDE R0014144; /* SET_TP_VT_GRUNNLAG                     */                
 %INCLUDE R0014148; /* F_TP92                                 */                
 %INCLUDE R0014151; /* KLARGJØR_TABELLEN                      */                
 %INCLUDE R0014152; /* BEREGN_POENGREKKE                      */                
 %INCLUDE R0014153; /* BEREGN_SPT_OPT_PÅ                      */                
 %INCLUDE R0014154; /* BEREGN_BUP_FPP_ALT.                    */                
 %INCLUDE R0014156; /* BEREGN_SPT_OPT_PÅ_ALT.                 */                
 %INCLUDE R0014159; /* UNGE_DØDE_B_E                          */                
 %INCLUDE R0014161; /* LEGG_UFØREHIST_I_TAB                   */                
 %INCLUDE R0014162; /* LEGG_INNT_FØR_67_I_TAB                 */                
 %INCLUDE R0014163; /* F_INNTEKT_POENG                        */                
 %INCLUDE R0014164; /* BEREGN_BUP_FPP                         */                
  /*  %INCLUDE R0014165     PLUKK_UT_BESTE_POENG             */                 
 %INCLUDE R0014166; /* LEGG_YRKEHIST_I_TAB                    */                
 %INCLUDE R0014168; /* LEGG_AFPHIST_I_TAB                     */                
 %INCLUDE R0014171; /* REGN_BUP_FPP                           */                
 %INCLUDE R0014172; /* F_INNTEKT_POENG_LOV92                  */                
 %INCLUDE R0019902; /* F_KJØNN BUKES I 9949                   */                
 %INCLUDE R0019905; /* F_ALDER                                */                
  /*%INCLUDE R0019913     F_SNU_DATO       - 2000             */                
  %INCLUDE R0019949; /* BEREGNER TT_FRAMT (FULL FRAMTIDIG TT)  */               
 %INCLUDE R0019995; /* KONV_FNR11_FNR13(FNR11)                */                
                                                                                
 L999:                                                                          
                                                                                
    WORK_TRANS_LISTE_PEKER = W_PEKER;                                           
    EXEC CICS RETURN;                                                           
                                                                                
                                                                                
 END BESPT;                                                                     
