 /*       SIST ENDRET 30/07-98 09.25.52 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/07-98 14.22.57 AV   RFA9991                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0011709                                                       */00000040
 /*    PROGRAMMERER: GEIR, SEPTEMBER 81                               */00000050
 /*HENSIKT:                                                           */00000060
 /*    R0011709 INNEHOLDER:                                           */00000070
 /*      PROSEDYRE FOR BLANKING AV O2_MAP.                            */00000080
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000090
 /*           O2_TRANS_OMR.                                           */00000100
 /*      PROSEDYRENE ER SKILT UT FRA R0011702.   070587  BRITT        */00000110
 /*PROGRAMTILKNYTNING:                                                */00000120
 /*    PROSEDYRENE INCLUDES I ALDERSBEHANDLINGA TIL DET MASKINELLE    */00000130
 /*    FOLKETRYGDSYSTEMET.                                            */00000140
 /*    ARBEIDSOMRÅDE: P0011701  (LIGGER I R001.TEST.COPYLIB)          */00000150
 /*BRUK:                                                              */00000160
 /*    %INCLUDE R0011709;                                             */00000170
 /*    BLANK_O2_MAP:              SETTER LOW VALUES I MAPEN OG        */00000180
 /*                               BLANKER MELDINGSFELTENE.            */00000190
 /*    OVERFØR_O2_OPPHØR:         OVERFØRER OPPHØRSBL.MAP->ARBEIDSO M */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /* ***************************************************************** */00000230
 /*                                                                   */00000240
 /*   PROSEDYRE FOR Å SETTE LOW VALUES I MAPEN, SAMT OG BLANKE        */00000250
 /*   MELDINGSFELTENE.                                                */00000260
 /*                                                                   */00000270
 /* ***************************************************************** */00000280
 %SKIP;                                                                 00000290
   BLANK_O2_MAP:                                                        00000300
      PROC;                                                             00000310
   DCL                                                                  00000320
     LOW BUILTIN;                                                       00000330
     FNR_BARN1O  = LOW(11);                                             00000340
     FNR_BARN2O  = LOW(11);                                             00000350
     FNR_BARN3O  = LOW(11);                                             00000360
     FNR_BARN4O  = LOW(11);                                             00000370
     FNR_BARN5O  = LOW(11);                                             00000380
     MELDING1O   = (78)' ';                                             00000390
     MELDING2O   = (78)' ';                                             00000400
     MELDING3O   = (78)' ';                                             00000410
     MELDING4O   = (78)' ';                                             00000420
     MELDING5O   = (78)' ';                                             00000430
     MELDING6O   = (78)' ';                                             00000440
   END BLANK_O2_MAP;                                                    00000450
 %PAGE;         /*  */                                                  00000460
 /* ***************************************************************** */00000470
 /*                                                                   */00000480
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT, EVENTUELT          */00000490
 /*   ENDRA PÅ SKJERMBILDET TIL O2.TRANS_OMR I KOM_OMR FOR            */00000500
 /*   OPPHØRSBLANKETT 2.                                              */00000510
 /*         MAPSET:  S001073    MAP:  S001071                         */00000520
 /*                                                                   */00000530
 /* ***************************************************************** */00000540
 %SKIP(2);                                                              00000550
  OVERFØR_O2_OPPHØR:                                                    00000560
    PROC;                                                               00000570
       IF REGDATOL           > 0 THEN                                   00000580
          O2.REGDATO_ÅMD     = KONV_ÅMD_HÅMD  (REGDATOI);               00000590
       IF TERMIDL            > 0 THEN                                   00000600
          O2.TERMID          = TERMIDI;                                 00000610
       IF FNRL               > 0 THEN                                   00000620
          O2.FNR             = F_FELT_CHAR_PIC11 (FNRI);                00000630
       IF TKNRL              > 0 THEN                                   00000640
          O2.TKNR            = F_FELT_CHAR_PIC4 (TKNRI);                00000650
       IF VIRK_DATO_MÅL      > 0 THEN                                   00000660
          O2.VIRK_DATO_ÅMD   = KONV_MÅ_HÅMD (VIRK_DATO_MÅI);            00000670
       IF EK_TILLL           > 0 THEN                                   00000680
          O2.EK_TILL         = EK_TILLI;                                00000690
       IF FNR_BARN1L         > 0 THEN                                   00000700
          O2.FNR_BARN(1)     = F_FELT_CHAR_PIC11 (FNR_BARN1I);          00000710
       IF FNR_BARN2L         > 0 THEN                                   00000720
          O2.FNR_BARN(2)     = F_FELT_CHAR_PIC11 (FNR_BARN2I);          00000730
       IF FNR_BARN3L         > 0 THEN                                   00000740
          O2.FNR_BARN(3)     = F_FELT_CHAR_PIC11 (FNR_BARN3I);          00000750
       IF FNR_BARN4L         > 0 THEN                                   00000760
          O2.FNR_BARN(4)     = F_FELT_CHAR_PIC11 (FNR_BARN4I);          00000770
       IF FNR_BARN5L         > 0 THEN                                   00000780
          O2.FNR_BARN(5)     = F_FELT_CHAR_PIC11 (FNR_BARN5I);          00000790
       IF OPPHØRS_KODEL      > 0 THEN                                   00000800
          O2.OPPHØR_KODE     = OPPHØRS_KODEI;                           00000810
  END OVERFØR_O2_OPPHØR;                                                00000820
