 /*   SIST ENDRET PÅ PROD   2000.02.18 13.02.58 AV   JDA7339          */        
 /*       SIST ENDRET 10/12-98 13.30.46 AV   JDA7339                  */        
 /*       SIST ENDRET 10/12-98 13.28.06 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.40.19 AV   JDA7339                  */        
 /*       SIST ENDRET 16/01-98 12.21.27 AV   SPA7339                  */        
 %SKIP;                                /*  */                                   
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  PROGRAMMET INCLUDES I R0012001 -                                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
  SKRIV_BRUKER_ID: PROC;                                                        
 DCL 01 BRUKERINFO_REC,                                                         
        02 FNR                  PIC '(11)9',                                    
        02 BLANKET_TYPE         CHAR (2)   ,                                    
        02 TERMINAL_NR          CHAR (4)   ,                                    
        02 BRUKER_ID            CHAR (8)   ,                                    
        02 FILLER               CHAR (5)   ,                                    
        02 DATO                 PIC '(8)9' ,                                    
        02 TID                  PIC '(7)9' ,      /* HHHMMSS  */                
        02 KJORINGS_TYPE        CHAR (1)   ,                                    
        02 FIL1                 CHAR (04)  ;                                    
                                                                                
  DCL  HJELP_TID         FIXED DEC(7,0);                                        
                                                                                
   DCL BRUK_LOGG     POINTER;                                                   
                                                                                
        BRUKERINFO_REC.FNR           = DIV_PARAM_OMR.SEARCH_FNR;                
        BRUKERINFO_REC.BLANKET_TYPE  = STYRINGS_OMR.STYREKODE;                  
        BRUKERINFO_REC.BRUKER_ID     = DIV_PARAM_OMR.BRUKER_ID;                 
        BRUKERINFO_REC.DATO          = DATO_2000;                               
                                                                                
        HJELP_TID                    = EIBTIME;                                 
        BRUKERINFO_REC.TID           = HJELP_TID;                               
        BRUKERINFO_REC.KJORINGS_TYPE = STYRINGS_OMR.FUNKSJONSKODE   ;           
        BRUKERINFO_REC.TERMINAL_NR   = DIV_PARAM_OMR.TERMINAL_NR;               
     /* BRUKERINFO_REC.BRUKER_NAVN   = DIV_PARAM_OMR.BRUKER_PASS; */            
                                                                                
        IF BRUKERINFO_REC.BLANKET_TYPE  ^= 'US' THEN                            
           EXEC CICS WRITE DATASET('BRUKINFO')                                  
                    FROM (BRUKERINFO_REC)                                       
                    RIDFLD(BRUK_LOGG) RBA;                                      
  END SKRIV_BRUKER_ID;                                                          
