 /*   SIST ENDRET PÅ PROD   2008.11.05 16.25.15 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2008.02.27 11.06.03 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2007.12.21 12.20.50 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2007.07.30  8.24.12 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 12.01.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.46.32 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.21  7.58.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.21  7.57.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.45.01 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.01.05  8.53.44 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.38.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.30  7.52.26 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.11.29 13.51.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.08.30  8.54.47 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2005.08.11  8.51.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.06.17 12.05.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.08 12.05.13 AV   TSB2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.23  8.51.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.33.08 AV   JDA2970          */        
 /*KOPIERT FRA QASS 17.12.2004 FORDI DET LAGES PENSJONSBREV  VED FRIIN*/        
 /*KOPIERT FRA QASS 17.12.2004 DET SKAL IKKE LAGES BREV               */        
 /*                                                                   */        
 /*   SIST ENDRET PÅ QASS   2004.12.06 13.22.48 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.06 13.20.39 AV   TSB2970          */        
 /*   SIST ENDRET PÅ QASS   2004.12.01 12.29.20 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.29 13.38.35 AV   TSB2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.04  9.10.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.08.04  9.06.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.06.24  8.53.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.05.03 12.35.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.11.19  9.12.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.19  9.09.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.04.30 12.20.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.04.30 12.07.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.14 10.50.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.40.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.11.05  9.21.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.14 14.41.55 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.29 11.50.14 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.26 10.37.48 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.24 12.44.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.45.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.07.11 10.06.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.05  8.18.57 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.02.27 10.38.56 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.02.16 12.06.59 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.27.55 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.08  7.42.53 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.07 13.06.40 AV   JDA7339          */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014901 - AUTOHENDELSE_BEREGNING - HOVEDPROGRAM I CICS/PLI    */        
 /*    PROGRAMMERER: KRISTENSEN, SEPTEMBER 1982                       */        
 /*HENSIKT:                                                           */        
 /*    PROGRAMMET FINNER UT OM NOEN I FAMILIEN PASSERER BESTEMTE      */        
 /*    ALDERSGRENSER. DERSOM DETTE ER TILFELLE BLIR BEREGNINGER KALT, */        
 /*    EVENTUELLE STØNADSBREV SKREVET UT, SAMT KALT  PÅ RUTINER SOM   */        
 /*    DANNER STATISTIKK - TRANSER.                                   */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR LINKET FRA 3001. D.V.S. ON-LINE KJØRING        */        
 /*    PROGRAMMET BLIR LINKET FRA ALDERSKONVERTER D.V.S. BATCH-KJØRING*/        
 /*      DET FORETAS LINK TIL 4001 - BEREGNING                        */        
 /*      DET FORETAS LINK TIL 6001 - STATISTIKK                       */        
 /*      DET FORETAS LINK TIL 7001 - STØNADSBREV                      */        
 /*                                                                   */        
 /*      INTERNE RUTINER :                                            */        
 /*                                                                   */        
 /*         R001490                    HOVEDPROGRAMMET                */        
 /*           REGN_ALDER_FOR_FAMILIE                                  */        
 /*           ADDER_EN_MÅNED_TIL_ALDER_FAMILIE                        */        
 /*           AUTO_ONLINE              TESTER KONVERTERINGSGRENSER    */        
 /*             FINNES_SØKER                                          */        
 /*               SETT_VIRKDATO_BARN                                  */        
 /*             P67_TIL_P70                                           */        
 /*             OVERGANG_TIL_P67                                      */        
 /*             ER_EK_65_67_70                                        */        
 /*             FJERN_EKTEFELLE_TILLEGG                               */        
 /*             UNG_UFØR                                              */        
 /*             FØDT_UFØR                                             */        
 /*             FØDT_UFØR_BARN                                        */        
 /*             FJERN_BARNEPENSJON                                    */        
 /*             UFØR_BARN                                             */        
 /*             FJERN_BARNETILLEGG                                    */        
 /*             BARN_18ÅR                                             */        
 /*             BARNS_TILKNYTNINGSKODE_ENDRES                         */        
 /*             YRKESSKADE_ELEV                                       */        
 /*             SATSENDRING                                           */        
 /*             FINNE_SISTE_UFT_ÅM                                    */        
 /*                                                                   */        
 /*                                                                   */        
 /*                                                                   */        
 /*BRUK:                                                              */        
 /*    EXEC CICS LINK PROGRAM('R0014901') COMMAREA(KOM_OMR)           */        
 /*ENDRET : 15.2.84 - HERMAN.                                         */        
 /*         LOVENDRING PR 1.4.84 GÅR UT PÅ AT 'FORVENTET' I EP        */        
 /*         SKAL NYTTES SOM 'FAI' VED OVERGANG TIL AP - DERSOM        */        
 /*         SLIK BEREGNING ER GUNSTIGST.                              */        
 /*ENDRET : 26.6.84 OG 2.7.84 - HERMAN                                */        
 /*         EKTEFELLER SOM BLE KONVERTERT FRA UP TIL AP I SAMME MåNED:*/        
 /*         MANNEN FIKK 758 % VENTETILLEGG.                           */        
 /*ENDRET : 4/10.84 - KARIN.                                          */        
 /*         ETTERLATT EKTEFELLE MED OVERGANGSSTØNAD OG FRAMLEGGSDATO  */        
 /*         OG OPPHØRSDATO BLIR REGNET FRAM TIL DAGENS DATO.          */        
 /*         ENDRET TIL Å AUTOBEREGNES FRAM TIL FRAMLEGGSDATO.         */        
 /*ENDRET : 29.7.85 - HERMAN                                          */        
 /*         ENDRINGEN SOM ER BESKREVET OVENFOR VEDR. ETTERLATT ER     */        
 /*         FLYTTET OG BRUKER NÅ CALL TIL 9938.                       */        
 /*ENDRET : 21.10.85 - HERMAN                                         */        
 /*         FORELDRELØSE BARN SKAL HA STOPP I PENSJON FRA MÅNEDEN     */        
 /*         ETTER AT DE FYLLER 20 ÅR - FEILRAPPORT 259.               */        
 /*ENDRET : 8.10.86 - ERIK                                            */        
 /*         LAGT INN CALL TIL 4901 I 9951, SLIK AT INNTEKTSSTØNADS-   */        
 /*         BREVER FÅR VIRK.DATO TILBAKE TIL DET TIDSPUNKT ENDRINGEN  */        
 /*         GJELDER FRA, OG SLIK AT ETTER.BET. PERIODENE VISES PÅ     */        
 /*         STØNADSBREVET.                                            */        
 /*ENDRET : 13.2.87 - HERMAN                                          */        
 /*         UNGE UFøRE FåR ENDRET BUP_GARANTI TIL 2.50 POENG          */        
 /*         FRA 1.5.87.                                               */        
 /*ENDRET : 16.2.88 - HERMAN                                          */        
 /*         UNGE UFØRE FÅR ENDRET BUP_GARANTI TIL 3.00 POENG          */        
 /*         FRA 1.5.88                                                */        
 /*ENDRET : 23.12.88 - HERMAN                                         */        
 /*         UNGE UFØRE FÅR ENDRET ALDERSGRENSEN TIL 22 ÅR FRA 01895   */        
 /*ENDRET : 24.10.90 - TRUDE                                          */        
 /*         UNGE UFØRE FØR 1967 ENDRET GARANTI FRA 1.6 TIL 2.00       */        
 /*ENDRET : 13.5.91 - TRUDE                                           */        
 /*         UNGE UFØRE FÅR ENDRET BUP_GARANTI TIL 3.30 POENG          */        
 /*         FRA 1.5.91                                                */        
 /*ENDRET : 24.4.92 - TRUDE                                           */        
 /*         RULLERING AV ALDERSP.FAI OG FORSI-INNTEKTER               */        
 /*         REGELENDRINGER FRA 0591 OG 0192                           */        
 /*ENDRET : 06.08.92- TRUDE                                           */        
 /*         RETTIGHETER ETTER UFØR FØR 22 ÅR FØDT FØR 1944            */        
 /*                                                                   */        
 /* ***************************************************************** */        
 R001490: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                  
                                                                                
    %INCLUDE P0014003;  /* TAB                                  */              
    %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED)            */              
    %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)                   */              
    %INCLUDE P0019910;  /* STYRINGS-OMRÅDE (BASED)              */              
    %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE (BASED)             */              
    %INCLUDE P0019925;  /* GRUNNBELØP OG SÆRTILLEGG-TABELL      */              
                                                                                
    DCL 1 B00 BASED(B00_PEKER), %INCLUDE P0019921;                              
    DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                              
    DCL 1 B01_HJELP, %INCLUDE P0019921;                                         
    DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                              
    DCL 1 B02_HJELP, %INCLUDE P0019921;                                         
                                                                                
 DCL                                                                            
   1 TRANS_LISTE_OMR UNAL BASED (TRANS_LISTE_PEKER),                            
     3 TRANS_LISTE_LINJE (5),                                                   
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                         
 DCL                                                                            
   1 WORK_TRANS_LISTE UNAL BASED (WORK_TRANS_LISTE_PEKER),                      
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                         
                                                                                
 DCL                                                                            
   1 ALDERSOMRÅDE UNAL,                                                         
     2 ALDER_PERSON (14),                                                       
       3 ÅR PIC 'S999',                                                         
       3 MN PIC '99';                                                           
                                                                                
 DCL                                                                            
   1 ALDERSOMRÅDE_DEF DEF ALDERSOMRÅDE UNAL,                                    
     2 ALDER_PERSON_ÅM (14)  PIC 'S99999';                                      
                                                                                
 DCL                                                                            
   (                                                                            
    ADDR,                                                                       
    CSTG,                                                                       
    MOD,                                                                        
    VERIFY,                                                                     
    SUBSTR                                                                      
   )                            BUILTIN;                                        
 DCL                                                                            
   COMMAREA_PEKER PTR;                                                          
 DCL                                                                            
   START_TRANS_OPPL_PEKER       POINTER;                                        
 DCL                                                                            
   (I,J,K) FIXED BIN(15);                                                       
 DCL                                                                            
   ALDER_VED_DØD                PIC 'S99999',                                   
   AUTODATO_ÅM                  PIC'999999',                                    
   AUTODATO_Å                  PIC'9999' DEF AUTODATO_ÅM POS(1),                
   AUTODATO_M                   PIC'99' DEF AUTODATO_ÅM POS(5),                 
   AVDØD_IND                    FIXED BIN(15),                                  
   BUP_IND                      FIXED BIN(15),                                  
   BUP_SISTE                    FIXED BIN(15),                                  
   DØDSDATO_ÅMD                 PIC'(8)9',                                      
   UFTIDSPKT_ÅMD                PIC'(8)9',                                      
   FIXED_DEC5                   FIXED DEC(5) INIT (0),                          
   FIXED_DEC7                   FIXED DEC(7) INIT (0),                          
   FIXED_DEC9                   FIXED DEC(9),                                   
   FRA_DATO                     PIC '999999' INIT (0),                          
   FRYSVIRK                     PIC '999999' INIT (0),                          
   FRIINNTEKT_ÅM                PIC '999999' INIT (0),                          
   FRA_ÅR DEF FRYSVIRK POS(1)   PIC '9999' ,                                    
   FRA_MND DEF FRYSVIRK POS(5)   PIC '99' ,                                     
   GARANTI_BUP                  FIXED DEC (3,2) INIT (0),                       
   G_FØR                        FIXED DEC(5) INIT(0),                           
   G_NÅ                         FIXED DEC(5) INIT(0),                           
   HENDELSE_IND                 BIT (1),                                        
   HJ_VIRK_DATO_ÅMD             PIC '(9)9',                                     
   INDEX                        FIXED BIN(15),                                  
   JA                           BIT (1) INIT('1'B),                             
   MAX_BARN                     FIXED BIN(15),                                  
   NEI                          BIT (1) INIT('0'B),                             
   PIC6                         PIC'999999',                                    
   PIC11                        PIC'(11)9',                                     
   PIC13                        PIC'(13)9',                                     
   SATSENDRING_DENNE_MÅNED      BIT (1) INIT('0'B),                             
   SPARE_TT_16_66               FIXED DEC (3)    INIT (0), /*9907*/             
   START_SØKER_IND              FIXED BIN(15),                                  
   STILLEGG_2                   FIXED DEC(7),                                   
   ST_PROSENT                   FIXED DEC(4,2),                                 
   TRANSTYPE2                   PIC'99' INIT (0),                               
   UF_IND                       FIXED BIN(15),                                  
   UFØR_BARN_IND                FIXED BIN(15),                                  
   UTVIDET_TT_16_66             FIXED DEC (5)    INIT (0), /*0404*/             
   VIRK_LOV92_ÅM                PIC '(6)9'     INIT (0),                        
   W01_FØRSTE_GANG              BIT (1) INIT('1'B),                             
   WS_B01_VIRK_DATO_MÅ          PIC'(6)9',                                      
   WS_TRANS_OPPL_VIRK_DATO_ÅMD  PIC'(9)9',                                      
   ÅR                           PIC'9999' DEF PIC13 POS (5),                    
        ETT_POENG               FIXED DEC (3,2) INIT (1.0),                     
        ETT_KOMMA_FEM_POENG     FIXED DEC (3,2) INIT (1.5),                     
        TO_POENG                FIXED DEC (3,2) INIT (2.0);                     
   DCL I_EK                     FIXED BIN(15);                                  
                                                                                
 DCL FNR_EK                     PIC '(11)9';                                    
 DCL FNR_ÅR_EK DEF FNR_EK POS(5)   PIC '99';                                    
 DCL W_FNR11                    PIC '(11)9';                                    
 DCL W_FNR13                    PIC '(13)9';                                    
 DCL 1 FNR_R DEF W_FNR13,                                                       
     2 DAG       PIC '99',                                                      
     2 MND       PIC '99',                                                      
     2 ÅR        PIC '9999',                                                    
     2 FILLER    PIC '(5)9';                                                    
                                                                                
 DCL FRI_ÅR  DEF FRIINNTEKT_ÅM POS (1) PIC '9999',                              
     FRI_MND DEF FRIINNTEKT_ÅM POS (5) PIC '99';                                
 DCL FRI_SUM                           PIC '999999';                            
 DCL AUTO_SUM                          PIC '999999';                            
 DCL W_FNR_ÅM    PIC '(6)9';                                                    
 DCL FELLES_BARN CHAR (1) INIT(' ');                                            
 DCL   ALDER_UF_DØD                PIC 'S99999';                                
 DCL OPPH_ÅM                       PIC '(6)9';   /*9807*/  /*KONS*/             
 DCL OPPH_ÅR  DEF OPPH_ÅM POS(1)   PIC '(4)9';                                  
 DCL OPPH_MN  DEF OPPH_ÅM POS(5)   PIC '(2)9';                                  
 DCL DAGENS_DATO_ÅM                PIC '(6)9';                                  
 DCL W_6001                        PIC '(6)9';                                  
                                                                                
    /* ============================================================== */        
                                                                                
    HENDELSE_IND = NEI;                                                         
    START_SØKER_IND          = SØKER_IND;                                       
                                                                                
    START_TRANS_OPPL_PEKER   = KOM_OMR.TRANS_OPPL_PEKER;                        
    KOM_OMR.TRANS_OPPL_PEKER = KOM_OMR.WORK_TRANS_LISTE_PEKER;                  
                                                                                
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO';                                   
    TRANS_OPPL_OMR.FØDSNUMMER       = 0;                                        
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' ';                                      
    TRANS_OPPL_OMR.BLANKETTYPE      = '  ';                                     
    TRANS_OPPL_OMR.TRANS_RETURKODE  = (4)' ';                                   
    DAGENS_DATO_ÅM = DIV_PARAM_OMR.DATO_2000 / 100;                             
                                                                                
                                                                                
    ALDERSOMRÅDE_DEF = '';                                                      
    SELECT (KJØRINGS_TYPE);                                                     
       WHEN ('S')                                                               
          DO;  /* SATSVIS KJØRING (ALDERSKONVERTERING M.V.) */                  
             AUTODATO_ÅM = NESTE_HENDELSE_DATO_ÅMD/100;                         
          END; /* SATSVIS KJØRING (ALDERSKONVERTERING M.V.) */                  
       WHEN ('Q')                                                               
          DO;  /* OMREGNING ETTER INNTEKTSOPPDATERING */                        
             AUTODATO_ÅM = B02.VIRK_DATO_ÅMD(SØKER_IND)/100;                    
             AUTODATO_ÅM = AUTODATO_ÅM + 1;                                     
             IF AUTODATO_M = 13 THEN                                            
                DO;                                                             
                   AUTODATO_M = 1;                                              
                   AUTODATO_Å = AUTODATO_Å + 1;                                 
                END;                                                            
          END; /* OMREGNING ETTER INNTEKTSOPPDATERING */                        
       OTHERWISE                                                                
          DO;                                                                   
             DO I=1 TO 14 UNTIL(B01.STATUS.VIRK_DATO_ÅMD (I) > 0 &              
                                B01.STATUS.PENSJONSTYPE1(I) ^='D' );            
                AUTODATO_ÅM = B01.STATUS.VIRK_DATO_ÅMD(I)/100 + 1;              
             END;                                                               
             IF AUTODATO_M = 13 THEN                                            
                DO;                                                             
                   AUTODATO_M = 1;                                              
                   AUTODATO_Å = AUTODATO_Å + 1;                                 
                END;                                                            
          END;                                                                  
    END; /* SELECT KJØRINGS_TYPE */                                             
                                                                                
 UFØR_BARN_IND = 0;                                                             
                                                                                
 IF KJØRINGS_TYPE = 'A'    THEN                  /*KOMMER FRA 1820-AU*/         
    DO;                                                                         
       FIXED_DEC9 = (AUTODATO_ÅM -1) *100;                                      
       IF B01.G_DATO_ÅMD(SØKER_IND) > FIXED_DEC9       THEN                     
          CALL SKAL_INNTEKTER_RULLERES(FIXED_DEC9);                             
                         /* KJØRINGS_TYPE = 'O';           = ORDINÆR */         
    END;                                                                        
 ELSE                                                                           
 IF B01.G_DATO_ÅMD(SØKER_IND) > AUTODATO_ÅM*100  THEN                           
    CALL SKAL_INNTEKTER_RULLERES(AUTODATO_ÅM * 100);                            
                                                                                
 CALL REGN_ALDER_FOR_FAMILIE;                                                   
                                                                                
 DO WHILE (AUTODATO_ÅM <= NESTE_HENDELSE_DATO_ÅMD/100);                         
                                                                                
   /*ETTER 1998 SKAL UP IKKE HA OPPHØR I JANUAR - ENDRES TIL DESEMBER*/         
   OPPH_ÅM = AUTODATO_ÅM;                                                       
   IF AUTODATO_Å > 1998  &                                                      
      AUTODATO_M =  1   THEN                                                    
      DO;                                                                       
         OPPH_ÅR = OPPH_ÅR - 1;                                                 
         OPPH_MN = 12;                                                          
      END;                                                                      
                                                                                
   TRANS_OPPL_OMR.TRANSTYPE  = 0;                                               
                                                                                
                                                                                
                 /** FINNER UT OM DET ER SATSENDRINGER DENNE MÅNED  **/         
                                                                                
   DO J = 1 TO 65 UNTIL(PERIODE_START_ÅMD(J)/100 >=AUTODATO_ÅM);                
   END;                                                                         
                                                                                
                                                                                
   PIC6 = PERIODE_START_ÅMD(J)/100;                                             
   G    = G_TAB_PERIODE.GRUNNBELØP(J);                                          
                                                                                
   /* --------------------------------------------------------------- */        
   /* HER ER DET LAGT INN NY VERSJON FOR AT VI SKAL UNNGÅ AT JOBBEN   */        
   /* GÅR I ABEND NÅR VIRKNINGSDATO ER 01.01.1967 ELLER FØR           */        
   /* --------------------------------------------------------------- */        
   /* NY VERSJON FRA HER - MARTIN SEP 2000 - SE NEDENFOR              */        
   /* --------------------------------------------------------------- */        
       IF (J>1) THEN                                                            
          DO;  /* AUTODATO ER MINST LIK JANUAR 1967 */                          
             IF (PIC6 = AUTODATO_ÅM) THEN                                       
                DO; /* SATSENDRING_DENNE_MÅNED */                               
                   SATSENDRING_DENNE_MÅNED = JA;                                
                   G = G_TAB_PERIODE.GRUNNBELØP(J);                             
                   G_FØR = G_TAB_PERIODE.GRUNNBELØP(J - 1);                     
                   G_NÅ  = G_TAB_PERIODE.GRUNNBELØP(J    );                     
                   ST_PROSENT  = G_TAB_PERIODE.ST_PROSENT_E(J);                 
                   STILLEGG_2 = ST_PROSENT * 2 * G /1200;                       
                   CALL SATSENDRING;                                            
                END; /* SATSENDRING DENNE MÅNED */                              
             ELSE                                                               
                DO;  /* IKKE SATSENDRING DENNE MÅNED */                         
                   SATSENDRING_DENNE_MÅNED = NEI;                               
                   G = G_TAB_PERIODE.GRUNNBELØP(J-1);                           
                   G_FØR = 0;                                                   
                   G_NÅ  = 0;                                                   
                   ST_PROSENT  = G_TAB_PERIODE.ST_PROSENT_E(J-1);               
                   STILLEGG_2 = ST_PROSENT * 2 * G /1200;                       
                END; /* IKKE SATSENDRING DENNE MÅNED */                         
          END; /* AUTODATO ER MINST LIK JANUAR 1967 */                          
       ELSE                                                                     
          DO;  /* AUTODATO JANUAR 1967 ELLER FØR */                             
             SATSENDRING_DENNE_MÅNED = NEI;                                     
             G = G_TAB_PERIODE.GRUNNBELØP(1);                                   
             G_FØR = 0;                                                         
             G_NÅ  = 0;                                                         
             ST_PROSENT = 0;                                                    
             STILLEGG_2 = 0;                                                    
          END; /* AUTODATO JANUAR 1967 ELLER FØR */                             
   /* --------------------------------------------------------------- */        
   /* NY VERSJON TIL HER - MARTIN SEP 2000                            */        
   /* --------------------------------------------------------------- */        
   CALL AUTO_ONLINE;                                                            
                                                                                
   DO WHILE (HENDELSE_IND = JA);                                                
                                                                                
                                /** DET ER LAGET TRANS DENNE MÅNED  **/         
                                                                                
                                                                                
     IF TRANS_OPPL_OMR.TRANSTYPE = 0 THEN /** DET ER BARE ENDRING **/           
       DO;                                /** PÅ UFØRT BARN       **/           
         TRANS_OPPL_OMR.TRANSTYPE = TRANSTYPE2;                                 
         TRANSTYPE2               = 0;                                          
         TRANS_OPPL_OMR.FØDSNUMMER= B02.RF0PERSN.FNR(UFØR_BARN_IND);            
         TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                     
                           AUTODATO_ÅM * 100;                                   
         SØKER_IND                = UFØR_BARN_IND;                              
         HENDELSE_IND             = NEI;                                        
                                                                                
       END;                                                                     
     ELSE                                                                       
     IF (TRANS_OPPL_OMR.TRANSTYPE > 0  &                                        
        TRANS_OPPL_OMR.TRANSTYPE < 50   )   !                                   
  /* MARTIN 2004 */                                                             
        TRANS_OPPL_OMR.TRANSTYPE = 89       ! /* IKKE RED. FØR 68 ÅR*/          
        TRANS_OPPL_OMR.TRANSTYPE = 90       ! /* NY LOVLIG INNTEKT  */          
        TRANS_OPPL_OMR.TRANSTYPE = 92       ! /* NYE SATSER FOR GP  */          
        TRANS_OPPL_OMR.TRANSTYPE = 93       ! /* BT ØKER            */          
        TRANS_OPPL_OMR.TRANSTYPE = 94       ! /* STOPP REHAB F 2002 */          
        TRANS_OPPL_OMR.TRANSTYPE = 95       ! /* AP FRA 2002      */            
        TRANS_OPPL_OMR.TRANSTYPE = 96       ! /* AFP M FAI MH 0010*/            
        TRANS_OPPL_OMR.TRANSTYPE = 97       !            /*HL 0003*/            
        TRANS_OPPL_OMR.TRANSTYPE = 98       !                                   
        TRANS_OPPL_OMR.TRANSTYPE = 99   THEN                                    
       DO;  /* 50 > TRANSTYPE > 0 ! 99 >TRANSTYPE > 93 */                       
                                                                                
         IF SØKER_IND    = 1         THEN                                       
            EKTEF_IND    = 2;                                                   
         ELSE                                                                   
            IF SØKER_IND = 2         THEN                                       
               EKTEF_IND = 1;                                                   
                                                                                
         IF TRANS_OPPL_OMR.TRANSTYPE ^= 27 THEN                                 
            DO;                                                                 
               DO I = 1 TO 14;                                                  
                  B02.GAMMEL_FT_KODE(I) = ' ';                                  
               END;                                                             
            END;                                                                
   /*20030203 - HL : */                                                         
         IF TRANS_OPPL_OMR.TRANSTYPE = 92      THEN                             
            DO;                                                                 
               TRANS_OPPL_OMR.TRANSTYPE = 27;                                   
               EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);            
               IF (B02.GP_REDUKSJON_KODE(SØKER_IND) ^= ' ')  THEN               
                     TRANS_OPPL_OMR.TRANSTYPE = 92;                             
               ELSE                                                             
               IF SATSENDRING_DENNE_MÅNED = NEI   THEN                          
                  GOTO IKKE_SKRIV_BREV;                                         
            END;                                                                
         ELSE                                                                   
         IF TRANS_OPPL_OMR.TRANSTYPE = 93      THEN                             
            DO;                                                                 
               TRANS_OPPL_OMR.TRANSTYPE = 27;                                   
               EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);            
               IF B02.BT_SÆRBARN(SØKER_IND)   > 0        !                      
                  B02.UFØRPENS.BT(SØKER_IND)  > 0        !                      
                  B02.YRKEPENS.BT(SØKER_IND)  > 0        !                      
                  B02.ALDERSP.BT(SØKER_IND)   > 0             THEN              
                     TRANS_OPPL_OMR.TRANSTYPE = 93;                             
            END;                                                                
         ELSE                                                                   
            EXEC CICS LINK PROGRAM('R0014001') COMMAREA(KOM_OMR);               
                          /** BEREGNING **/                                     
         IF FEIL_MELD_NR > 0 THEN                                               
           GOTO AVSLUTNING;                                                     
                                                                                
         B01_HJELP            = B01           ;                                 
         B02_HJELP            = B02           ;                                 
                                                                                
         IF TRANS_OPPL_OMR.TRANSTYPE = 90   THEN   /* TRUDE 17.12.04*/          
           DO;                                                                  
              IF SATSENDRING_DENNE_MÅNED THEN                                   
                 TRANS_OPPL_OMR.TRANSTYPE = 27;                                 
              ELSE                                                              
                 GOTO IKKE_SKRIV_BREV;                                          
           END;                                                                 
                                                                                
         IF TRANS_OPPL_OMR.TRANSTYPE = 99   &                                   
              B02.BT_SÆRBARN(SØKER_IND)    ^>                                   
              B01.BT_SÆRBARN(SØKER_IND)     THEN                                
              TRANS_OPPL_OMR.TRANSTYPE = 27;                                    
                                                                                
         IF (TRANS_OPPL_OMR.TRANSTYPE = 98)                &                    
            (                                                                   
                (B01.ANTALL_BARN(1)   = B02.ANTALL_BARN(1)          ) &         
                (B01.ANTALL_BARN(2)   = B02.ANTALL_BARN(2)          ) &         
                (B01.SUM_YTELSE(1) = B02.SUM_YTELSE(1)              ) &         
                (B01.GARANTITILLEGG_EK(1) = B02.GARANTITILLEGG_EK(1)) &         
                (B01.GARANTITILLEGG_EK(2) = B02.GARANTITILLEGG_EK(2)) &         
                (B01.GARANTITILLEGG_BARN(1) =                                   
                                     B02.GARANTITILLEGG_BARN(1)     ) &         
                (B01.GARANTITILLEGG_BARN(2) =                                   
                                     B02.GARANTITILLEGG_BARN(2)     ) &         
                (B01.SUM_YTELSE(2) = B02.SUM_YTELSE(2)              ) !         
           (B01.G_DATO_ÅMD(SØKER_IND) > B02.G_DATO_ÅMD(SØKER_IND))) THEN        
               B02 = B01;                                                       
         ELSE                                                                   
             /*VERNEPLIKTÅR FOR KVINNER FRA 200007 :  */                        
         IF (TRANS_OPPL_OMR.TRANSTYPE = 97)           &                         
            (B01.ALDERSP.TP(1) = B02.ALDERSP.TP(1) )  &                         
            (B01.UFØRPENS.TP(1) = B02.UFØRPENS.TP(1) )    THEN;                 
                                                                                
         ELSE                                                                   
         IF STØNADSBREV_ØNSKET_IND = JA THEN                                    
              DO;  /* STØNADSBREV ØNSKET */                                     
                 IF TRANS_OPPL_OMR.TRANSTYPE = 98   THEN                        
                    TRANS_OPPL_OMR.TRANSTYPE = 10;                              
                                                                                
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);          
                                       /*LAG_STØNADSBREV_TRANSER*/              
                 IF FEIL_MELD_NR > 0 THEN                                       
                    GOTO AVSLUTNING;                                            
                 IF TRANS_OPPL_OMR.TRANSTYPE = 99   THEN                        
                    TRANS_OPPL_OMR.TRANSTYPE = 27;                              
                                                                                
              END;  /* STØNADSBREV ØNSKET */                                    
                                                                                
   IKKE_SKRIV_BREV:                                                             
                                                                                
       END; /* 50 > TRANSTYPE > 0 ! 99 >TRANSTYPE > 93 */                       
     ELSE                                                                       
  /* MARTIN */                                                                  
     IF (TRANS_OPPL_OMR.TRANSTYPE = 96) THEN                                    
        DO;                                                                     
           IF STØNADSBREV_ØNSKET_IND = JA THEN                                  
              DO;                                                               
                 IF TRANS_OPPL_OMR.TRANSTYPE = 98   THEN                        
                    TRANS_OPPL_OMR.TRANSTYPE = 10;                              
                                                                                
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);          
                 IF FEIL_MELD_NR > 0 THEN                                       
                    GOTO AVSLUTNING;                                            
              END;                                                              
        END;                                                                    
                                                                                
  /* MARTIN                                                                     
 /* VED OPPHØR MÅ STØNADSBREV-RUTINA KALLES FOR Å UNDERSØKE      */             
 /* OM DET FINNES TRANSAKSJONER PÅ PERSONEN FRA FØR :            */             
                                                                                
     ELSE    /* TRANSTYPE ER DA > 49 */                                         
                                                                                
        IF TRANS_OPPL_OMR.TRANSTYPE = 54  !                                     
                                                                                
             /*54 = PENSJONIST ER DØD, EKTEFELLEN HAR IKKE PENSJON*/            
                                                                                
           TRANS_OPPL_OMR.TRANSTYPE = 55          THEN                          
                                                                                
             /*55 = PENSJON OPPHØRER, EKTEFELLEN HAR IKKE PENSJON*/             
                                                                                
           IF STØNADSBREV_ØNSKET_IND = JA THEN                                  
                                                                                
              DO;                                                               
                 EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);          
                                                                                
                                     /*LAG_STØNADSBREV_TRANSER*/                
                 STØNADSBREV_ØNSKET_IND = NEI;/*HL 1194*/                       
                 IF FEIL_MELD_NR > 0 THEN                                       
                    GOTO AVSLUTNING;                                            
              END;                                                              
                                                                                
        IF FUNKSJONSKODE = 'E' THEN                                             
           IF W01_FØRSTE_GANG  THEN                                             
              DO;                                                               
                 WS_TRANS_OPPL_VIRK_DATO_ÅMD =                                  
                                   TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                         TRANS_LISTE_OMR.VIRKNINGSDATO_ÅMD(1);                  
                                                                                
                 DO I = 1 TO 14;                                                
                    B01.PERSON(I)   = ''  ;                                     
                 END;                                                           
                                                                                
                 W01_FØRSTE_GANG = '0'B;                                        
                                                                                
             /*LAG_DYNAMISK_STAT_TRANS*/                                        
               /*AB 22.12 .00 KUN SENDES BARE PE2 ^= ' A' */                    
          IF B02.PENSJONSTYPE2(SØKER_IND) ^= 'A' THEN                           
                 EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);          
                                                                                
                                                                                
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                          WS_TRANS_OPPL_VIRK_DATO_ÅMD;                          
                                                                                
                 B01 = B02;                                                     
              END;                                                              
                                                                                
     IF B02.PENSJONSTYPE2(SØKER_IND) ^= 'A'    THEN                             
        EXEC CICS LINK PROGRAM('R0016001') COMMAREA(KOM_OMR);                   
                                                                                
     IF FEIL_MELD_NR > 0 THEN                                                   
        GOTO AVSLUTNING;                                                        
                                                                                
     IF TRANSTYPE2 > 0 THEN    /** BARNEKULLET ER OPPDATERT, NÅ   **/           
       DO;                     /** SKAL DET UFØRE BARN OPPDATERES **/           
         SØKER_IND = UFØR_BARN_IND;                                             
         TRANS_OPPL_OMR.TRANSTYPE  = TRANSTYPE2;                                
         TRANSTYPE2                = 0;                                         
         TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(SØKER_IND);               
       END;                                                                     
     ELSE                                                                       
       HENDELSE_IND = NEI;                                                      
                                                                                
     B01 = B02;                                                                 
                                                                                
   END;   /** DO WHILE (HENDELSE_IND = JA)  **/                                 
                                                                                
   AUTODATO_ÅM = AUTODATO_ÅM + 1;                                               
   IF AUTODATO_M = 13 THEN                                                      
     DO;                                                                        
       AUTODATO_M = 1;                                                          
       AUTODATO_Å = AUTODATO_Å + 1;                                             
     END;                                                                       
                                                                                
   CALL  ADDER_EN_MND_TIL_ALDER_FAMILIE;                                        
                                                                                
 END;  /** DO WHILE (AUTODATO_ÅM <= NESTE_HENDELSE_DATO_ÅM) **/                 
                                                                                
 IF UFØR_BARN_IND > 0 THEN                                                      
   FAMILIE_SPLITTET_IND = JA;                                                   
                                                                                
 AVSLUTNING:                                                                    
                                                                                
 SØKER_IND                = START_SØKER_IND;                                    
                                                                                
                                                                                
    KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER;                          
                                                                                
 EXEC CICS RETURN;                                                              
                                                                                
 /*****  HER SLUTTER HOVEDSTYRINGEN  *****/                                     
                                                                                
                                                                                
 AUTO_ONLINE:                                                                   
   PROC;                                                                        
                                                                                
                                                                                
     DCL        FINNES_SØKER_TIL_DØD BIT(1) INIT('0'B);                         
 /*****  FOR Å FÅ SATT STYRING FOR TILLEGGSPENSJON FRA DØDE *****/              
                                                                                
   DO I = 1 TO 2;                                                               
     IF B01.STATUS.DØDSDATO_ÅMD    (I) > 0 &                                    
        ALDER_PERSON_ÅM(I) > 1912          &                                    
        B01.STATUS.STATUS_KODE_HIST(I) = 'X' THEN                               
       DO;                                                                      
          AVDØD_IND = I;                                                        
          W_FNR11= B01.RF0PERSN.FNR(I);                                         
          W_FNR13= KONV_FNR11_FNR13(W_FNR11);                                   
          DØDSDATO_ÅMD = B01.DØDSDATO_ÅMD(I);                                   
          PIC11 = B01.RF0PERSN.FNR(I);                                          
          PIC13  = KONV_FNR11_FNR13(PIC11);                                     
          ALDER_VED_DØD = F_ALDER (PIC11,DØDSDATO_ÅMD);                         
                                                                                
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR HIST PERSON**/               
                                                                                
       /*0697 HL*/                                                              
          DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE                   
                                      (I,J) ^= ' ');                            
             BUP_SISTE = J;                                                     
          END;                                                                  
                                                                                
          IF (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE) = 'A' &                    
                            /* UNG UFØR SOM VENTER*/                            
              AUTODATO_ÅM > 198104 )         THEN                               
             DO;                                                                
                TRANS_OPPL_OMR.TRANSTYPE     = 31;                              
 /*31 = FØDT UFØR FYLLER 20, ELLER ER 20 OG DATOEN ER 8105*/                    
                FINNES_SØKER_TIL_DØD = '1'B;                                    
                B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B';                            
             END;                                                               
           ELSE                                                                 
           IF  (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)='C' &                    
                AUTODATO_ÅM = 198401)       THEN                                
                                                                                
             DO;                                                                
                TRANS_OPPL_OMR.TRANSTYPE     = 31;  /*9811*/                    
  /*31 = FØDT UFØR FYLLER 21 ÅR, ELLER ER 21 OG DATOEN ER 8401*/                
                FINNES_SØKER_TIL_DØD = '1'B;                                    
                B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B';                            
             END;                                                               
                                                                                
           ELSE                                                                 
           IF  B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)= 'E'  THEN                
              DO;                    /*2000 : */                                
                 IF AUTODATO_ÅM = 198907           !                            
                    AUTODATO_ÅM = 199101           !                            
                    AUTODATO_ÅM = 199201           !                            
                    AUTODATO_ÅM = 199205           !                            
                    AUTODATO_ÅM = 199707           THEN                         
                    DO;                                                         
                       TRANS_OPPL_OMR.TRANSTYPE    = 31; /*9811*/               
                       FINNES_SØKER_TIL_DØD = '1'B;                             
                    END;                                                        
              END;                                                              
                                                                                
           ELSE /*9707 HL : */                                                  
           IF  (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)= 'D') THEN               
              DO;                             /* UNG UFØR SOM VENTER*/          
                                              /* PÅ LOVENDRING*/                
                 UFTIDSPKT_ÅMD = B01.UFØRHIST.UFT_ÅMD(I,1);                     
                 ALDER_UF_DØD = F_ALDER                                         
                        (PIC11,UFTIDSPKT_ÅMD);                                  
                 CALL UNG_DØD_D(I,BUP_SISTE,ALDER_UF_DØD);                      
                 IF  (B02.BUP_GAR_KODE(I,BUP_SISTE) ^= 'D') THEN                
                   DO;                                                          
                      DO K = 1 TO BUP_SISTE;                                    
                         B02.UFØRHIST.BUP_GAR_KODE(I,K) =                       
                         B02.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE);                
                         B02.UFØRHIST.BUP_GARANTI(I,K) =                        
                         B02.UFØRHIST.BUP_GARANTI(I,BUP_SISTE);                 
                      END;                                                      
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;  /*9811*/              
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
              END;                                                              
                                                                                
                                                                                
           ELSE                                                                 
           IF  (B01.UFØRHIST.BUP_GAR_KODE(I,BUP_SISTE)= 'B' &                   
                AUTODATO_ÅM = 199105)  THEN                                     
             DO;                                                                
                TRANS_OPPL_OMR.TRANSTYPE     = 31;   /*9811*/                   
                FINNES_SØKER_TIL_DØD = '1'B;                                    
             END;                                                               
                                                                                
                                                                                
 /* ****************************                                                
                                                                                
           ELSE                                                                 
           IF ALDER_VED_DØD < 2001         THEN                                 
                                                                                
             DO;                                                                
                IF AUTODATO_ÅM = 9105        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 8805        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 8705        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 8105        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
             END;                                                               
          ELSE                                                                  
          IF ALDER_VED_DØD < 2101         THEN                                  
                                                                                
             DO;                                                                
                IF AUTODATO_ÅM = 9105        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 8805        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 8705        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 8405        THEN                               
                   DO;                                                          
                      TRANS_OPPL_OMR.TRANSTYPE     = 31;                        
                      FINNES_SØKER_TIL_DØD = '1'B;                              
                   END;                                                         
             END;                                                               
          ELSE                                                                  
          IF ALDER_VED_DØD < 2201         THEN                                  
            DO;                                                                 
             IF AUTODATO_ÅM = 8901        THEN                                  
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                           
                   FINNES_SØKER_TIL_DØD = '1'B;                                 
                END;                                                            
             IF AUTODATO_ÅM = 9105        THEN                                  
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                           
                   FINNES_SØKER_TIL_DØD = '1'B;                                 
                END;                                                            
            END;                                                                
          ELSE                                                                  
          IF ALDER_VED_DØD < 2401         THEN                                  
            DO;                                                                 
             IF AUTODATO_ÅM = 9205     !                                        
                AUTODATO_ÅM = 9705        THEN                                  
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                           
                   FINNES_SØKER_TIL_DØD = '1'B;                                 
                END;                                                            
            END;                                                                
          ELSE                                                                  
          IF ALDER_VED_DØD < 2601         THEN                                  
            DO;                                                                 
             IF AUTODATO_ÅM = 9707        THEN                                  
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                           
                   FINNES_SØKER_TIL_DØD = '1'B;                                 
                END;                                                            
            END;                                                                
                                                                                
   ****************************************************** */                    
          ELSE                                                                  
          IF ALDER_VED_DØD < 2601         THEN                                  
             IF AUTODATO_ÅM = 199707        THEN                                
                DO;                                                             
                   IF (FNR_R.ÅR > 1930     &                                    
                       ALDER_VED_DØD > 2400)       !                            
                       FNR_R.ÅR = 1941               !                          
                       FNR_R.ÅR = 1942            THEN                          
                      DO;                                                       
                         TRANS_OPPL_OMR.TRANSTYPE     = 31;  /*9811*/           
                         FINNES_SØKER_TIL_DØD = '1'B;                           
                      END;                                                      
                END;                                                            
             ELSE                                                               
             IF ALDER_VED_DØD < 2401         THEN                               
                IF AUTODATO_ÅM = 199705  THEN                                   
                   DO;                                                          
                      IF FNR_R.ÅR > 1930     &                                  
                         FNR_R.ÅR < 1943        THEN                            
                         DO;                                                    
                            TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/         
                            FINNES_SØKER_TIL_DØD = '1'B;                        
                         END;                                                   
                   END;                                                         
                ELSE                                                            
                IF AUTODATO_ÅM = 199205        THEN                             
                   DO;                                                          
                      IF FNR_R.ÅR > 1925          THEN                          
                         DO;                                                    
                            TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/         
                            FINNES_SØKER_TIL_DØD = '1'B;                        
                         END;                                                   
                   END;                                                         
                ELSE                                                            
                IF ALDER_VED_DØD < 2201                 THEN                    
                   IF AUTODATO_ÅM = 199201        THEN                          
                      DO;                                                       
                          IF FNR_R.ÅR > 1925   &                                
                             FNR_R.ÅR < 1945       THEN                         
                             DO;                       /*9811*/                 
                                TRANS_OPPL_OMR.TRANSTYPE     = 31;              
                                FINNES_SØKER_TIL_DØD = '1'B;                    
                             END;                                               
                      END;                                                      
                   ELSE                                                         
                   IF AUTODATO_ÅM = 199105        THEN                          
                      DO;                                                       
                         IF FNR_R.ÅR > 1944         THEN                        
                            DO;                      /*9811*/                   
                               TRANS_OPPL_OMR.TRANSTYPE     = 31;               
                               FINNES_SØKER_TIL_DØD = '1'B;                     
                            END;                                                
                      END;                                                      
                   ELSE                                                         
                   IF AUTODATO_ÅM = 199101        THEN                          
                      DO;                                                       
                          IF FNR_R.ÅR > 1924   &                                
                             FNR_R.ÅR < 1945       THEN                         
                             DO;                      /*9811*/                  
                                TRANS_OPPL_OMR.TRANSTYPE     = 31;              
                                FINNES_SØKER_TIL_DØD = '1'B;                    
                             END;                                               
                      END;                                                      
                   ELSE                                                         
                   IF AUTODATO_ÅM = 198907        THEN                          
                      DO;                                                       
                         IF FNR_R.ÅR > 1922   &                                 
                            FNR_R.ÅR < 1945     THEN                            
                            DO;                         /*9811*/                
                               TRANS_OPPL_OMR.TRANSTYPE     = 31;               
                               FINNES_SØKER_TIL_DØD = '1'B;                     
                            END;                                                
                      END;                                                      
                   ELSE                                                         
                   IF AUTODATO_ÅM = 198901        THEN                          
                      DO;                                                       
                         IF FNR_R.ÅR > 1944        THEN                         
                            DO;                        /*9811*/                 
                               TRANS_OPPL_OMR.TRANSTYPE     = 31;               
                               FINNES_SØKER_TIL_DØD = '1'B;                     
                            END;                                                
                      END;                                                      
                   ELSE                                                         
                   IF ALDER_VED_DØD < 2101              THEN                    
                      IF AUTODATO_ÅM = 198805        THEN                       
                         DO;                                                    
                            IF FNR_R.ÅR > 1945     THEN                         
                               DO;                          /*9811*/            
                                  TRANS_OPPL_OMR.TRANSTYPE     = 31;            
                                  FINNES_SØKER_TIL_DØD = '1'B;                  
                               END;                                             
                         END;                                                   
                      ELSE                                                      
                      IF AUTODATO_ÅM = 198705     !                             
                         AUTODATO_ÅM = 198401        THEN                       
                         DO;                                                    
                            IF FNR_R.ÅR > 1945       THEN                       
                               DO;                        /*9811*/              
                                  TRANS_OPPL_OMR.TRANSTYPE     = 31;            
                                  FINNES_SØKER_TIL_DØD = '1'B;                  
                               END;                                             
                         END;                                                   
                      ELSE                                                      
                      IF ALDER_VED_DØD < 2001   &                               
                         AUTODATO_ÅM = 198401        THEN                       
                         DO;                                                    
                            IF FNR_R.ÅR > 1946       THEN                       
                               DO;                         /*9811*/             
                                  TRANS_OPPL_OMR.TRANSTYPE     = 31;            
                                  FINNES_SØKER_TIL_DØD = '1'B;                  
                               END;                                             
                         END;                                                   
                                                                                
       END;                                                                     
                                                                                
   END;                                                                         
                                                                                
 IF AUTODATO_ÅM = 199201       THEN                                             
 DO I = 1 TO 3;                                                                 
     IF B01.STATUS.VIRK_DATO_ÅMD   (I) > 0   &                                  
        B01.GT_LOV92               (I) = 0   &                                  
        B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                               
     DO;                                                                        
     SELECT (B01.PENSJONSTYPE1(I));                                             
                                                                                
        WHEN('A')                                                               
           DO;                                                                  
              IF B01.TP_BRUTTO(I)     > 0          &                            
                 ALDER_PERSON_ÅM(3-I) < 6600     THEN                           
                 DO;                                                            
                                                                                
              B02.GT_LOV92(I) = B01.ETTEPENS.TP_BRUTTO(I)                       
                              + B01.ALDERSP.TP(I);                              
              B02.ALDERSP.SPT_1291(I) = B01.ALDERSP.SPT(I);                     
              B02.ALDERSP.OPT_1291(I) = B01.ALDERSP.OPT(I);                     
              B02.ALDERSP.PÅ_1291 (I) = B01.ALDERSP.PÅ (I);                     
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);               
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);               
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);                
              HENDELSE_IND = JA;                                                
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                 
              TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                
                                     AUTODATO_ÅM*100;                           
              SØKER_IND = I;                                                    
              EKTEF_IND = 3 - I;                                                
                 END;                                                           
           END;                                                                 
                                                                                
        WHEN('K')                                                               
           DO;                                                                  
              B02.GT_LOV92(I) = B01.ALDERSP.TP(I);                              
              B02.ALDERSP.SPT_1291(I) = B01.ALDERSP.SPT(I);                     
              B02.ALDERSP.OPT_1291(I) = B01.ALDERSP.OPT(I);                     
              B02.ALDERSP.PÅ_1291 (I) = B01.ALDERSP.PÅ (I);                     
              HENDELSE_IND = JA;                                                
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                 
              TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                
                                     AUTODATO_ÅM*100;                           
              SØKER_IND = I;                                                    
              EKTEF_IND = 3 - I;                                                
           END;                                                                 
        WHEN('U', 'Y')                                                          
           DO;                                                                  
            IF ALDER_PERSON_ÅM(I) < 6600     THEN                               
              DO;                                                               
                 B02.GT_LOV92(I) = B01.UFØRPENS.TP(I) +                         
                                   B01.YRKEPENS.TP(I) +                         
                                   B01.ETTEPENS.TP_BRUTTO(I);                   
                 DCL W_SISTE_UFT   FIXED BIN(15);                               
                 W_SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                           
                 IF B02.UFØRHIST.BUP(I,W_SISTE_UFT) > 5 THEN                    
                 DO;                                                            
                    B02.UFØRPENS.SPT_1291(I) = B01.UFØRPENS.SPT(I);             
                    B02.UFØRPENS.OPT_1291(I) = B01.UFØRPENS.OPT(I);             
                    B02.UFØRPENS.PÅ_1291 (I) = B01.UFØRPENS.PÅ (I);             
                    B02.YRKE_POENG_1291(I)   = B01.YRKEPENS.YPT(I);             
                 END;                                                           
                 HENDELSE_IND = JA;                                             
                 TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */              
              TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                
                                     AUTODATO_ÅM*100;                           
                 SØKER_IND = I;                                                 
                 EKTEF_IND = 3 - I;                                             
              END;                                                              
              IF B01.TP_BRUTTO(I)     > 0          &                            
                 ALDER_PERSON_ÅM(3-I) < 6600     THEN                           
                 DO;                                                            
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);               
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);               
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);                
              HENDELSE_IND = JA;                                                
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                 
              TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                
                                     AUTODATO_ÅM*100;                           
              SØKER_IND = I;                                                    
              EKTEF_IND = 3 - I;                                                
                 END;                                                           
           END;                                                                 
                                                                                
        WHEN('E')                                                               
           DO;                                                                  
              IF ALDER_PERSON_ÅM(3-I) < 6600     THEN                           
                 DO;                                                            
              B02.GT_LOV92(I) = B01.ETTEPENS.TP_BRUTTO(I);                      
              B02.ETTEPENS.SPT_1291(I) = B01.ETTEPENS.SPT_AVD(I);               
              B02.ETTEPENS.OPT_1291(I) = B01.ETTEPENS.OPT_AVD(I);               
              B02.ETTEPENS.PÅ_1291(I)  = B01.ETTEPENS.PÅ_AVD(I);                
              HENDELSE_IND = JA;                                                
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                 
              TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                
                                     AUTODATO_ÅM*100;                           
              SØKER_IND = I;                                                    
              EKTEF_IND = 3 - I;                                                
                 END;                                                           
           END;                                                                 
                                                                                
        WHEN('B')                                                               
           DO;                                                                  
              B02.GT_LOV92(I) = B01.ETTEBARN.TP(I);                             
              B02.SPT_1291_MOR(I) = B01.SPT_MOR(I);                             
              B02.OPT_1291_MOR(I) = B01.OPT_MOR(I);                             
              B02.PÅ_1291_MOR(I) = B01.PÅ_MOR(I);                               
              B02.SPT_1291_FAR(I) = B01.SPT_FAR(I);                             
              B02.OPT_1291_FAR(I) = B01.OPT_FAR(I);                             
              B02.PÅ_1291_FAR(I) = B01.PÅ_FAR(I);                               
              HENDELSE_IND = JA;                                                
              TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                 
              TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                
                                     AUTODATO_ÅM*100;                           
              SØKER_IND = I;                                                    
           END;                                                                 
                                                                                
        OTHERWISE;                                                              
     END;  /*OF SELECT*/                                                        
     END;                                                                       
 END;  /*DO I = 1 TO 3 */                                                       
                                                                                
   I = 1;                                                                       
   TRANSTYPE2 = 0;                                                              
                                                                                
  DCL B00_VIRK   PIC '(8)9' INIT (0),                                           
      B01_VIRK   PIC '(8)9' INIT (0),                                           
      B02_VIRK   PIC '(8)9' INIT (0);                                           
  IF AUTODATO_ÅM = 200302 THEN                                                  
     DO;                                                                        
     END;                                                                       
      B00_VIRK = B00.VIRK_DATO_ÅMD(I);                                          
      B01_VIRK = B01.VIRK_DATO_ÅMD(I);                                          
      B02_VIRK = B02.VIRK_DATO_ÅMD(I);                                          
                                                                                
   DO WHILE (I < 3);                                                            
     IF B01.STATUS.VIRK_DATO_ÅMD   (I) > 0 &                                    
        B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                               
       DO;                                                                      
          PIC11 = B01.RF0PERSN.FNR(I);                                          
          PIC13  = KONV_FNR11_FNR13(PIC11);                                     
                                                                                
  /* RUTINE FOR Å AVSLUTTE EN FRYSPERIODE : */                                  
                                                                                
          IF B01.FRYSKODE(I) = '1'          THEN                                
             DO;  /* HAR FRYS I INNTIL  5 ÅR */                                 
                FRA_DATO = B01.FRYSDATO_ÅMD(I) / 100;                           
                FRYSVIRK = AUTODATO_ÅM;                                         
  /* TILLEGG 27.2.2008 HL : */                                                  
          W_FNR11= B01.RF0PERSN.FNR(I);                                         
          W_FNR13= KONV_FNR11_FNR13(W_FNR11);                                   
                W_6001 = (FNR_R.ÅR * 100) + 6001 + FNR_R.MND;                   
                IF (FRA_DATO < 200302   &                                       
                   (FRYSVIRK - FRA_DATO)  > 299 )        !                      
                     /*GAMMEL REGEL, NY REGEL*/                                 
                  (FRA_DATO < W_6001                   &                        
                   (FRYSVIRK - FRA_DATO)  > 499        &                        
                    FRYSVIRK ^> DAGENS_DATO_ÅM   )     THEN                     
                   DO;  /* OPPHØR FRYS */                                       
                      B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                   
                      IF I       = 1 THEN                                       
                         I_EK    = 2;                                           
                      ELSE                                                      
                         I_EK    = 1;                                           
                      IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                   
                         B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                
                         B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;             
                      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                        
                                     AUTODATO_ÅM*100;                           
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                      SØKER_IND = I;                                            
                      HJ_VIRK_DATO_ÅMD = FRYSVIRK * 100;                        
                      HENDELSE_IND = JA;                                        
                      /* REMEDY 205: - MÅ GI NEST SISTE STATUS */               
                      B00 = B01;                                                
                      B00.STATUS_KODE_HIST = ' ';                               
                      TRANS_OPPL_OMR.TRANSTYPE  = 91;                           
                      IF B01.UFØRPENS.UFG(I) = 0     THEN                       
                         DO; /*200310 HL : */                                   
                            CALL UFØREPENSJON_OPPHØRER;                         
                            I = I + 1;                                          
                         END;                                                   
                      ELSE                                                      
                         DO;                                                    
                            B02.FRYSKODE(I) = ' ';                              
                            B02.FRYSDATO_ÅMD(I) = 0;                            
                            B02.GARANTIGRAD(I)  = 0;                            
                         END;                                                   
                   END; /* OPPHØR FRYS */                                       
             END; /* HAR FRYS I INNTIL  5 ÅR */                                 
                                                                                
         /* --------------------------------------------------------- */        
         /* NYTT BRUDD MARTIN OKTOBER 2004                            */        
         /* --------------------------------------------------------- */        
         IF (B01.STATUS.FRIINNTEKT_DATO_ÅMD(I) > 0) &                           
             ALDER_PERSON_ÅM(I) < 6700     THEN   /* HL 300505   */             
            DO;  /* HAR FRINNTEKSTSDATO */                                      
               FRIINNTEKT_ÅM = B01.STATUS.FRIINNTEKT_DATO_ÅMD(I)/100;           
               IF  FRIINNTEKT_ÅM = AUTODATO_ÅM   &                              
                   FRIINNTEKT_ÅM ^> DAGENS_DATO_ÅM    THEN                      
                  DO;  /* VI SKAL NÅ REGNE NY INNTEKTSGRENSE UP */              
                     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                         
                                             AUTODATO_ÅM*100;                   
                                                                                
                     SØKER_IND = I;                                             
                     IF I       = 1 THEN                                        
                        I_EK    = 2;                                            
                     ELSE                                                       
                        I_EK    = 1;                                            
              /*     B02.VIRK_DATO_ÅMD(I_EK)   = AUTODATO_ÅM*100;               
                     B02.VIRK_DATO_ÅMD(I)      = AUTODATO_ÅM*100; */            
                                                                                
                     HENDELSE_IND = JA;                                         
                     TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);           
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE  = 90;                            
                     /* REMEDY 717 DANNE NY NEST SISTE STATUS */                
              /*     B00 = B01;                                                 
                     B02.FØRSTE_GANG_REG(I) = 'N';       */                     
                                                                                
                     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                      
                        CALL BARN_18ÅR(I);                                      
                     IF B01.STATUS.ANTALL_BARN(I_EK)  > 0 THEN                  
                        CALL BARN_18ÅR(I_EK);                                   
     /*              I = I + 1;       200705 HL */                              
                                                                                
                  END; /* VI SKAL NÅ REGNE NY INNTEKTSGRENSE UP */              
            END; /* HAR FRINNTEKSTSDATO */                                      
         /* --------------------------------------------------------- */        
                                                                                
         /** FINNE SISTE UTFYLTE BUP_GAR_KODE FOR SØKER   **/                   
                                                                                
     /*0697 HL:*/                                                               
         DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE                    
                                      (I,J) ^= ' ');                            
           BUP_SISTE = J;                                                       
         END;                                                                   
                                                                                
         IF (ALDER_PERSON_ÅM(I) = 7000            &                             
             AUTODATO_ÅM        < 199100            &                           
             B01.STATUS.PENSJONSTYPE1(I) = 'A' )  !                             
            (ALDER_PERSON_ÅM(I) = 7001            &                             
             AUTODATO_ÅM        > 199101            &                           
             B01.TKNR(I)        ^= 0              &   /*0796 HL*/               
             B01.STATUS.PENSJONSTYPE1(I) = 'A') THEN                            
                                                                                
            DO;                                                                 
               CALL P67_TIL_P70(FAMILIE_IND);                                   
               HENDELSE_IND = JA;                                               
               SØKER_IND = I;                                                   
               I = I + 1;                                                       
            END;                                                                
                                    /*2000 : */                                 
         ELSE IF (ALDER_PERSON_ÅM(I)  = 6700      &                             
                  (AUTODATO_ÅM         < 199100   &                             
                   AUTODATO_ÅM         > 197212)) !                             
                  (ALDER_PERSON_ÅM(I)  = 6701   &                               
                   AUTODATO_ÅM         > 199101)  !                             
                 (ALDER_PERSON_ÅM(I) >= 6700    &                               
                  ALDER_PERSON_ÅM(I) <  7000    &                               
                  AUTODATO_ÅM         = 197301)            !                    
                 (ALDER_PERSON_ÅM(I)  = 7000    &                               
                   AUTODATO_ÅM         < 199100   &                             
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'A')   !                      
                  (ALDER_PERSON_ÅM(I)  = 7001   &                               
                   AUTODATO_ÅM         > 199101   &                             
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'F' &                         
                   B01.STATUS.PENSJONSTYPE1(I) ^= 'A')            THEN          
                                                                                
                 DO;                                                            
                                                                                
 /* ENDRET FOR OVERGANGSSTØNAD 250894 HL */                                     
                                                                                
                   IF (B01.STATUS.PENSJONSTYPE1(I) = 'E' &                      
                       B01.STATUS.PENSJONSTYPE2(I) ^= 'O' )  !                  
                      B01.STATUS.PENSJONSTYPE1(I) = 'J' !                       
                      B01.STATUS.PENSJONSTYPE1(I) = 'K' !                       
                      B01.STATUS.PENSJONSTYPE1(I) = 'Y' !                       
                      B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                    
                                                                                
                      DO;                                                       
                         CALL OVERGANG_TIL_P67(FAMILIE_IND);                    
                         HENDELSE_IND = JA;                                     
                         SØKER_IND = I;                                         
                         I = I + 1;                                             
                      END;                                                      
                                                                                
                   ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'F' THEN               
                                                                                
                      DO;                                                       
                         CALL FJERN_EKTEFELLE_TILLEGG(I);                       
                         HENDELSE_IND = JA;                                     
                         FAMILIE_IND = I;                                       
                         I = I + 1;                                             
                      END;                                                      
                                                                                
                   ELSE IF (B01.STATUS.PENSJONSTYPE1(I) = 'E' &                 
                            B01.STATUS.PENSJONSTYPE2(I) = 'O')  THEN            
              DO;                                                               
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                                          AUTODATO_ÅM*100;                      
                 B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                 
   /* BRUKES */    HJ_VIRK_DATO_ÅMD = AUTODATO_ÅM*100;                          
   /* I 9938 */    SØKER_IND = I;                                               
                 CALL ETTERLATTEPENSJON_OPPHØRER;  /* R0019938 */               
                 HENDELSE_IND = JA;                                             
                 I = I + 1;                                                     
              END;                                                              
                                                                                
                 END;    /** IF ALDER_PERSON_ÅM(I) = 6700 **/                   
                                                                                
                 /* AFP-FRA STAT OVER TIL AFP-NULLPENSJON . TRUDE */            
         ELSE IF  ALDER_PERSON_ÅM(I) = 6501      THEN                           
            DO;                                                                 
               IF B01.PENSJONSTYPE1(I) = 'K'    &                               
                  B01.PENSJONSTYPE3(I) = 'S'    &                               
                 (B01.UTTAKSDATO_ÅMD(I) / 100) < AUTODATO_ÅM &                  
                  AUTODATO_ÅM          > 199310  THEN                           
                   DO;                                                          
                     CALL AFP_STAT_TIL_NULL(FAMILIE_IND);                       
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                   END;                                                         
                ELSE                                                            
                IF B01.PENSJONSTYPE3(I) = 'K'    &                              
                  (B01.PENSJONSTYPE2(3-I) = 'P'   !                             
                   B01.PENSJONSTYPE2(3-I) = 'N')  &                             
                 (B01.UTTAKSDATO_ÅMD(I) / 100) < AUTODATO_ÅM &                  
                   AUTODATO_ÅM        > 199801         THEN                     
                   DO;                                                          
                      CALL AFP_KOM_6501(FAMILIE_IND);                           
                      HENDELSE_IND = JA;                                        
                      SØKER_IND = I;                                            
                      I = I + 1;                                                
                   END;                                                         
            END;                                                                
                                                                                
         ELSE IF (ALDER_PERSON_ÅM(I) = 1800    &                                
                  AUTODATO_ÅM        < 199100    &                              
                 B01.PENSJONSTYPE1(I) = 'Y'    )        !                       
                 (ALDER_PERSON_ÅM(I) = 1801    &                                
                  AUTODATO_ÅM        > 199101    &                              
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                           
                 CALL YRKESSKADE_ELEV(ETT_POENG);                               
                                                                                
         ELSE IF (ALDER_PERSON_ÅM(I) = 1900    &                                
                  AUTODATO_ÅM        < 199100    &                              
                 B01.PENSJONSTYPE1(I) = 'Y'    )     !                          
                 (ALDER_PERSON_ÅM(I) = 1901    &                                
                  AUTODATO_ÅM        > 199101    &                              
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                           
                 CALL YRKESSKADE_ELEV(ETT_KOMMA_FEM_POENG);                     
                                                                                
         ELSE IF (ALDER_PERSON_ÅM(I) = 2000    &                                
                  AUTODATO_ÅM        < 199100    &                              
                 B01.PENSJONSTYPE1(I) = 'Y'    )   !                            
                 (ALDER_PERSON_ÅM(I) = 2001    &                                
                  AUTODATO_ÅM        > 199101    &                              
                 B01.PENSJONSTYPE1(I) = 'Y'    ) THEN                           
                 CALL YRKESSKADE_ELEV(TO_POENG);                                
                                                                                
 /*TILLEGG 2.3.89 HL */                                                         
                                                                                
         ELSE IF AUTODATO_ÅM          = 198904        &                         
                 ALDER_PERSON_ÅM(I)  >= 6000        &                           
                 B01.PENSJONSTYPE1(I) = 'F'        THEN                         
                 DO;                                                            
                    CALL FORSØRGET_EK_BLIR_60ÅR(I);                             
                    HENDELSE_IND = JA;                                          
                    FAMILIE_IND = I;                                            
                    I = I + 1;                                                  
                 END;                                                           
                                                                                
         ELSE IF (AUTODATO_ÅM          > 198904       &                         
                  ALDER_PERSON_ÅM(I)   = 6000   &                               
                  AUTODATO_ÅM          < 199100   &                             
                  B01.PENSJONSTYPE1(I) = 'F'     )    !                         
                 (AUTODATO_ÅM          > 199101       &                         
                  ALDER_PERSON_ÅM(I)   = 6001   &                               
                  B01.PENSJONSTYPE1(I) = 'F'     )  &                           
 /*180396 HL : */                                                               
                 (B01.UFØRPENS.TP(3-I) +                                        
                  B01.YRKEPENS.TP(3-I) + /* MARTIN 110701 */                    
                  B01.ALDERSP.TP (3-I)   )  <                                   
                  STILLEGG_2                       THEN                         
                       DO;                                                      
                          CALL FORSØRGET_EK_BLIR_60ÅR(I);                       
                          HENDELSE_IND = JA;                                    
                          FAMILIE_IND = I;                                      
                          I = I + 1;                                            
                       END;                                                     
         ELSE                                                                   
         IF AUTODATO_ÅM = 198705       &                                        
                                                                                
                  B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B'  THEN                     
                                                                                
                  DO;                                                           
                     DO BUP_IND = 1 TO BUP_SISTE;                               
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';                      
                        B02.BUP_GARANTI(I,BUP_IND) = 2.50;                      
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 30;                         
  /*30 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.87 (2.50 POENG)     */          
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
                                                                                
   /*          ELSE;     B02.BUP_GAR_KODE(I,1) = 'B' */                         
         ELSE                                                                   
         IF AUTODATO_ÅM = 198805       &                                        
               B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B'   THEN                       
                                                                                
                  DO;                                                           
                     DO BUP_IND = 1 TO BUP_SISTE;                               
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';                      
                        B02.BUP_GARANTI(I,BUP_IND) = 3.00;                      
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                         
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)     */          
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
   /*          ELSE;     B02.BUP_GAR_KODE(I,1) = 'B' */                         
         ELSE                                                                   
         IF AUTODATO_ÅM = 199105       &                                        
                                                                                
               B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B'   THEN                       
                  DO;                                                           
                     DO BUP_IND = 1 TO BUP_SISTE;                               
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';                      
                        B02.BUP_GARANTI(I,BUP_IND) = 3.30;                      
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                         
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)   ??*/          
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                  END;                                                          
                                                                                
   /*          ELSE   /* B02.BUP_GAR_KODE(I,1) = 'B' */                         
         ELSE                                                                   
         IF AUTODATO_ÅM = 200805       &                                        
             ÅR > 1940               &                                          
               B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B'   THEN                       
                  DO;                                                           
                     DO BUP_IND = 1 TO BUP_SISTE;                               
                        B02.BUP_GAR_KODE(I,BUP_IND) = 'B';                      
                        B02.BUP_GARANTI(I,BUP_IND) = 3.50;                      
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 39;                         
  /*39 = FØDT UFØR FÅR OMREGNET PENSJON PR. 1.5.88 (3.00 POENG)   ??*/          
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                  END;                                                          
                                                                                
   /*          ELSE   /* B02.BUP_GAR_KODE(I,1) = 'B' */                         
         ELSE                                                                   
         IF AUTODATO_ÅM          = 199101        &                              
            B02.BUP_GAR_KODE(I,1) = 'E'         &                               
            ÅR                    >  1924       THEN                            
              DO;                                                               
                 IF I  = 1 THEN                                                 
                    I_EK = 2;                                                   
                 ELSE                                                           
                    I_EK = 1;                                                   
                                                                                
                 IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                        
                    B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                     
                    DO;                                                         
                       B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;               
                       IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                 
                          CALL BARN_18ÅR(I_EK);                                 
                    END;                                                        
                 B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                 
 /*0897 HL       DO UF_IND = 1 TO BUP_SISTE;                                    
                    B02.BUP_GARANTI(I,UF_IND)    = 2;                           
                 END;                                     */                    
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD   =                           
                                           AUTODATO_ÅM*100;                     
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                              
                 HENDELSE_IND = JA;                                             
                 FAMILIE_IND = I;                                               
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                          
                    CALL BARN_18ÅR(I);                                          
                                                                                
              END;                                                              
                                                                                
  /*TILLEGG, 20.01.92  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */               
         ELSE IF AUTODATO_ÅM          = 199201        &                         
                B02.BUP_GAR_KODE(I,1) = 'E'         &                           
                ÅR                    >  1925    THEN                           
                DO;                                                             
                                                                                
                   IF I  = 1 THEN                                               
                      I_EK = 2;                                                 
                   ELSE                                                         
                      I_EK = 1;                                                 
                                                                                
                 IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                        
                    B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                     
                    DO;                                                         
                       B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;               
                       IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                 
                          CALL BARN_18ÅR(I_EK);                                 
                    END;                                                        
                 B02.STATUS.VIRK_DATO_ÅMD(I) =AUTODATO_ÅM*100;                  
 /*0897 HL       DO UF_IND = 1 TO BUP_SISTE;                                    
                    B02.BUP_GARANTI(I,UF_IND)    = 2.5;                         
                 END;                                   */                      
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD   =                           
                                          AUTODATO_ÅM*100;                      
                 B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                 
                 IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN                 
                    DO;                                                         
                       SØKER_IND = I;                                           
                       EKTEF_IND = 3 - I;                                       
                    END;                                                        
                 ELSE                                                           
                    FAMILIE_IND = I;                                            
                 HENDELSE_IND = JA;                                             
                 TRANS_OPPL_OMR.TRANSTYPE     = 7;                              
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                          
                    CALL BARN_18ÅR(I);                                          
                                                                                
                END;                                                            
   /*TIL HIT, TRUDE  */                                                         
   /*ØKER TIL 3 , 0592 TRUDE  */                                                
   /* NB!!! MÅ TAS BORT FØR PGM SKAL BRUKES VED G-END*/                         
  /*TILLEGG, 20.01.92  TRUDE  KAN VI BRUKE SAMME TRANSTYPE ??  */               
  /*     ELSE IF AUTODATO_ÅM          = 9205        &      */                   
                                                                                
   ELSE IF AUTODATO_ÅM          = 199205        THEN                            
      DO;                                                                       
        IF B02.BUP_GAR_KODE(I,1) = 'E'         &                                
           ÅR                    >  1925         THEN                           
          DO;                                                                   
             IF I  = 1 THEN                                                     
                I_EK = 2;                                                       
             ELSE                                                               
                I_EK = 1;                                                       
                            /* DISSE ÅRSKULL KOMMER NÅ INN UNDER*/              
                            /* VANLIGE UNGE UFØRE. TP_GAR_KODEN  */             
                            /* BLANKES */                                       
             IF ÅR   = 1944 !                                                   
                ÅR   = 1943  THEN                                               
                  DO;                                                           
                     B02.BUP_GAR_KODE(I,1)  = 'D';                              
                     B02.TP_GAR_KODE(I)  = ' ';                                 
                     CALL UNG_UFØR;                                             
                  END;                                                          
                                                                                
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                            
                B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                         
                DO;                                                             
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                     
                      CALL BARN_18ÅR(I_EK);                                     
                END;                                                            
             B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                     
  /*0897 HL  DO UF_IND = 1 TO BUP_SISTE;                                        
                B02.BUP_GARANTI(I,UF_IND)    = 3;                               
             END;                                        */                     
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                 
                                         AUTODATO_ÅM*100;                       
             B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                            
             IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN                     
                DO;                                                             
                   SØKER_IND = I;                                               
                   EKTEF_IND = 3 - I;                                           
                END;                                                            
             ELSE                                                               
                FAMILIE_IND = I;                                                
             HENDELSE_IND = JA;                                                 
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                                  
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
                CALL BARN_18ÅR(I);                                              
                                                                                
          END;                                                                  
                                                                                
       ELSE /*BUP_GAR_KODE ER IKKE 'E' : */                                     
          DO;                                                                   
             DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);               
                 IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'     THEN              
                    DO;                                                         
                       HENDELSE_IND= JA;                                        
                       TRANS_OPPL_OMR.TRANSTYPE     = 99;                       
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;            
                       CALL BARN_18ÅR(I);                                       
                       SØKER_IND = I;                                           
                                                                                
                       /*VIRK_DATO_ÅM BLE IKKE OPPDATERT PÅ EKTEFELLE*/         
                       /*TRUDE, 170293.                              */         
                       IF I     = 1 THEN                                        
                          I_EK  = 2;                                            
                       ELSE                                                     
                          I_EK  = 1;               /*2000 : */                  
                       B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;               
                       B02.VIRK_DATO_ÅMD(I)    = AUTODATO_ÅM*100;               
                    END;                                                        
             END;                                                               
          END;                                                                  
    END;                                                                        
        /*-----------------------------------------------------*/               
        /* HER KOMMER DET ET TILLEGG . NY POSEDURE FOR Å     --*/               
        /* OPPDATERE UF DØDE.  TRUDE  050892                 --*/               
        /* DETTE ER EN TEST    TRUDE  050892                 --*/               
    /*-------------------------------------------------*/                       
    ELSE;  /*TRUDE 0892*/                                                       
                                                                                
         IF AUTODATO_ÅM          = 198907        THEN                           
               DO;                                                              
                  IF  I   = 1 THEN                                              
                      I_EK = 2 ;                                                
                  ELSE                                                          
                      I_EK  = 1;                                                
                 IF B01.PENSJONSTYPE1(I_EK)  = 'D' &                            
                   (B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' !                  
                    B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'D')  THEN             
                        CALL UF_DØD(I_EK);                                      
               END;                                                             
          IF AUTODATO_ÅM          = 199101        THEN                          
               DO;                                                              
                  IF  I   = 1 THEN                                              
                      I_EK = 2 ;                                                
                  ELSE                                                          
                      I_EK  = 1;                                                
                 IF B01.PENSJONSTYPE1(I_EK)  = 'D' &                            
                    B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN               
                        CALL UF_DØD(I_EK);                                      
               END;                                                             
                                                                                
          IF AUTODATO_ÅM          = 199201        THEN                          
               DO;                                                              
                  IF  I   = 1 THEN                                              
                      I_EK = 2 ;                                                
                  ELSE                                                          
                      I_EK  = 1;                                                
                 IF B01.PENSJONSTYPE1(I_EK)  = 'D' &                            
                    B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN               
                        CALL UF_DØD(I_EK);                                      
               END;                                                             
          IF AUTODATO_ÅM          = 199205        THEN                          
               DO;                                                              
                  IF  I   = 1 THEN                                              
                     I_EK = 2 ;                                                 
                  ELSE                                                          
                    I_EK  = 1;                                                  
                 IF B02.PENSJONSTYPE1(I_EK)  = 'D' &  /*ELLER B01*/             
 /*9708 HL */       B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN               
 /*                 B02.TP_GAR_KODE(I_EK)    = 'E' THEN    */                   
                        CALL UF_DØD(I_EK);                                      
               END;                                                             
                                                                                
     /*0397 HL:*/                                                               
          IF AUTODATO_ÅM          = 199705        THEN                          
               DO;                                                              
                  IF  I   = 1 THEN                                              
                     I_EK = 2 ;                                                 
                  ELSE                                                          
                    I_EK  = 1;                                                  
                 IF B02.PENSJONSTYPE1(I_EK)  = 'D' &  /*ELLER B01*/             
 /*9708 HL */       B01.UFØRHIST.BUP_GAR_KODE(I_EK,1)  = 'E' THEN               
 /*                 B02.TP_GAR_KODE(I_EK)    = 'E' THEN   */                    
                        CALL UF_DØD(I_EK);                                      
               END;                                                             
                                                                                
                                                                                
     /*0897 HL: */                                                              
          IF AUTODATO_ÅM          = 199707        THEN                          
               DO;                                                              
                  IF  I   = 1 THEN                                              
                     I_EK = 2 ;                                                 
                  ELSE                                                          
                    I_EK  = 1;                                                  
                 IF B02.PENSJONSTYPE1(I_EK)  = 'D' &                            
                    B02.BUP_GAR_KODE(I_EK,1)    = 'E' THEN                      
                        CALL UF_DØD(I_EK);                                      
               END;                                                             
                                                                                
      /*-----------AFP TILLEGG FRA 0192   TRUDE--------  */                     
  /*HLELSE*/ IF AUTODATO_ÅM         =  199210   &                               
               B02.STATUS.VIRK_DATO_ÅMD(I) < 19921000 &                         
               B02.PENSJONSTYPE1(I) = 'K'    THEN                               
                DO;                                                             
                   /*PROBLEMER MED Å SETTE VIRK-DATO */                         
                  IF I = 1 THEN                                                 
                    I_EK = 2;                                                   
                  ELSE                                                          
                    I_EK = 1;                                                   
                 B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                 
                 B02.STATUS.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;              
                                                                                
       /*  NY LOVE ENDERING SP 05.10.93          */                             
                                                                                
                 IF B02.PENSJONSTYPE3 (I)   =  'N' THEN                         
                     B02.AFP_TILLEGG(I)     =    0;                             
                 ELSE                                                           
                     B02.AFP_TILLEGG(I)     =  950;                             
       /*      *************************************           */               
                                                                                
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                                         AUTODATO_ÅM* 100;                      
                 TRANS_OPPL_OMR.TRANSTYPE     = 10;  /*40??*/                   
                 HENDELSE_IND = JA;                                             
                 FAMILIE_IND = I;                                               
        /*       I = I + 1;  */                                                 
                END;                                                            
                      /* TIL HIT AFP-TILLEGG*/                                  
      /*-----------AFP TILLEGG FRA 1093   TRUDE--------  */                     
      /*-----------ØKER OGSÅ FOR DE MED PT2 = N -------  */                     
      /*-----------TRUDE, 081293                -------  */                     
         ELSE IF AUTODATO_ÅM         =  199310   &                              
               B02.STATUS.VIRK_DATO_ÅMD(I) < 19931000 &                         
               B02.PENSJONSTYPE1(I) = 'K'    &                                  
               B02.PENSJONSTYPE2(I) = 'N'    THEN                               
                DO;                                                             
                   /*PROBLEMER MED Å SETTE VIRK-DATO */                         
                  IF I = 1 THEN                                                 
                    I_EK = 2;                                                   
                  ELSE                                                          
                    I_EK = 1;                                                   
                 B02.STATUS.VIRK_DATO_ÅMD  (I) = AUTODATO_ÅM*100;               
                 B02.STATUS.VIRK_DATO_ÅMD  (I_EK) = AUTODATO_ÅM*100;            
                                                                                
       /*  NY LOVE ENDERING SP 05.10.93          */                             
                                                                                
                 IF B02.PENSJONSTYPE3 (I)   =  'N' THEN                         
                     B02.AFP_TILLEGG(I)     =    0;                             
                 ELSE                                                           
                     B02.AFP_TILLEGG(I)     =  950;                             
                                                                                
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                                             AUTODATO_ÅM*100;                   
                 TRANS_OPPL_OMR.TRANSTYPE     = 10;  /*40??*/                   
                 HENDELSE_IND = JA;                                             
                 FAMILIE_IND = I;                                               
        /*       I = I + 1;  */                                                 
                END;                                                            
    /* TIL HIT AFP-TILLEGG FRA 10.93 TRUDE 7.12.93*/                            
                                                                                
   /* GARANTERT SÆTILEGG FRA 0194. TRUDE 01.1294 */                             
                                                                                
         ELSE IF AUTODATO_ÅM      =   199401   &                                
              ^(B02.PENSJONSTYPE3(I)  = 'A'  !                                  
                B02.PENSJONSTYPE2(I)  = 'P'  )  THEN                            
            DO;                                                                 
             DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);               
                  IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W' THEN                 
                     FELLES_BARN = 'J';                                         
             END;                                                               
                                                                                
             IF I = 1 THEN                                                      
                I_EK = 2;                                                       
             ELSE                                                               
                I_EK = 1;                                                       
                                                                                
              IF  B02.STATUS.VIRK_DATO_ÅMD(I) < 19940100 &                      
                  (B02.PENSJONSTYPE2(I) = 'S'  !                                
                   B02.PENSJONSTYPE2(I) = 'F'  !                                
                   FELLES_BARN          = 'J') THEN                             
                /*NB!! FELLES BARN  */                                          
                DO;                                                             
                   /*PROBLEMER MED Å SETTE VIRK-DATO */                         
    /*FJERNET 200410 HL : */                                                    
    /*           B02.STATUS.VIRK_DATO_ÅMD  (I) = AUTODATO_ÅM*100;               
                 B02.STATUS.VIRK_DATO_ÅMD  (I_EK) = AUTODATO_ÅM*100;            
   ********** */                                                                
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                                            AUTODATO_ÅM*100;                    
      /*         IF   TRANS_OPPL_OMR.TRANSTYPE  ^= 10 THEN                      
                      TRANS_OPPL_OMR.TRANSTYPE     = 10;    */                  
  /*TRANSTYPEN ENDRES TIL 10 SENERE - 0994 HL */                                
                                                                                
                      TRANS_OPPL_OMR.TRANSTYPE     = 98;                        
                 HENDELSE_IND = JA;                                             
                 FAMILIE_IND = I;                                               
                                                                                
               /* TESTEN BARN 18ÅR GLEMT. TRUDE 3.2.94 */                       
                IF B01.STATUS_KODE_HIST (I_EK)     = ' '  &                     
                   B01.VIRK_DATO_ÅMD   (I_EK) > 0    THEN                       
                   DO;                                                          
                     IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                   
                       DO;                                                      
                        CALL BARN_18ÅR(I_EK);                                   
                        B02.STATUS.VIRK_DATO_ÅMD(I_EK) =AUTODATO_ÅM*100;        
                       END;                                                     
                   END;                                                         
                 IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                          
                    CALL BARN_18ÅR(I);                                          
                                                                                
        /*       I = I + 1;  */                                                 
                END;                                                            
            END;                                                                
   /* GARANTERT SÆTILEGG TIL HIT . TRUDE 01.1294 */                             
                                                                                
                                                                                
   /* ENDRING I REDUKSJONSREGLER FOR AP - HL JAN 97 : */                        
                                                                                
         ELSE IF AUTODATO_ÅM         =  199701   &                              
                 (B02.PENSJONSTYPE1(I) = 'A') &                                 
                 (B02.KONV_P_KODE  (I) ^= 'K') &                                
                 (B02.KONV_P_KODE  (I) ^= 'O') &        /*200102*/              
                 (B02.AP_GP_NETTO(I) < B02.ALDERSP.GP(I))  THEN                 
                DO;                                                             
       /*        B02.STATUS.VIRK_DATO_ÅM   (I) = AUTODATO_ÅM;  */               
                  /* TILLEGG 12.02.1997 TRUDE*/                                 
                  IF I  = 1  THEN                                               
                     I_EK  = 2;                                                 
                  ELSE                                                          
                     I_EK  =1;                                                  
                                                                                
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 IF B02.VIRK_DATO_ÅMD(I) > AUTODATO_ÅM*100 THEN                 
                                                                                
                    TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                          
                                   B02.VIRK_DATO_ÅMD(I);                        
                 ELSE                                                           
                    DO;                                                         
                        TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                      
                                                AUTODATO_ÅM*100;                
                       B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;           
                         /* EKTEFELLE MÅ FÅ LIK VIRK DATO.TRUDE 120297*/        
  /*9809 HL */        IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                   
  /*9809 HL */           B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                
                       B02.STATUS.VIRK_DATO_ÅMD(I_EK) =AUTODATO_ÅM*100;         
                    END;                                                        
                                                                                
                 TRANS_OPPL_OMR.TRANSTYPE     = 10;                             
                 HENDELSE_IND = JA;                                             
                 FAMILIE_IND = I;                                               
                 I = I + 1;                                                     
                END;                                                            
   /*      END;                    */                                           
                                                                                
   /*HL 0297 : GARANTIEN ØKES TIL 3.3 */                                        
                                                                                
   ELSE IF AUTODATO_ÅM          = 199705        &                               
           B02.BUP_GAR_KODE(I,1) = 'E'         &                                
 /*0897 HL B02.BUP_GARANTI(I,1)       ^= 3.3   &              */                
           ÅR                    >  1930      THEN                              
          DO;                                                                   
             IF I  = 1 THEN                                                     
                I_EK = 2;                                                       
             ELSE                                                               
                I_EK = 1;                                                       
                                                                                
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                            
                B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                         
                DO;                                                             
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                     
                      CALL BARN_18ÅR(I_EK);                                     
                END;                                                            
            ELSE                                                                
                DO;                                                             
                   SØKER_IND = I;                                               
                END;                                                            
                                                                                
             B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                     
  /*0897 HL  DO UF_IND = 1 TO BUP_SISTE;                                        
                B02.BUP_GARANTI(I,UF_IND)    = 3.3;                             
             END;                                          */                   
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                 
                                       AUTODATO_ÅM*100;                         
             B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                            
             IF TRANS_OPPL_OMR.TRANSTYPE     = 27      THEN                     
                DO;                                                             
                   SØKER_IND = I;                                               
                   EKTEF_IND = 3 - I;                                           
                END;                                                            
             ELSE                                                               
                FAMILIE_IND = I;                                                
             HENDELSE_IND = JA;                                                 
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                                  
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
                CALL BARN_18ÅR(I);                                              
                                                                                
          END;                                                                  
                                                                                
                                                                                
   ELSE IF (AUTODATO_ÅM          = 199707     !                                 
            AUTODATO_ÅM          = 200805 )      &                              
           B02.BUP_GAR_KODE(I,1) = 'E'         &                                
                                                     /*0897 HL*/                
           (ÅR                   =  1941      !                                 
            ÅR                   =  1942       ) THEN                           
          DO;                                                                   
             IF I  = 1 THEN                                                     
                I_EK = 2;                                                       
             ELSE                                                               
                I_EK = 1;                                                       
                                                                                
             IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                            
                B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                         
                DO;                                                             
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                     
                      CALL BARN_18ÅR(I_EK);                                     
                END;                                                            
            ELSE                                                                
                DO;                                                             
                   SØKER_IND = I;                                               
                END;                                                            
                                                                                
             B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                     
             B02.TP_GAR_KODE(I)               = ' ';                            
             DO UF_IND = 1 TO BUP_SISTE;                                        
                B02.BUP_GAR_KODE(I,UF_IND)    = 'B';                            
                IF  AUTODATO_ÅM          = 199707     THEN                      
                    B02.BUP_GARANTI(I,UF_IND)    = 3.3;                         
                ELSE                                                            
                    B02.BUP_GARANTI(I,UF_IND)    = 3.5;                         
             END;                                                               
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                 
                                         AUTODATO_ÅM*100;                       
             B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                            
             FAMILIE_IND = I;                                                   
             HENDELSE_IND = JA;                                                 
             TRANS_OPPL_OMR.TRANSTYPE     = 7;                                  
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
                CALL BARN_18ÅR(I);                                              
                                                                                
          END;                                                                  
                                                                                
         ELSE    /*VERNEPLIKT FOR KVINNER : */                                  
         IF    AUTODATO_ÅM          = 200007     &                              
               I = 1                             &                              
               B02.VERNEPLIKTÅR(I,1) > 0             THEN                       
            DO;                                                                 
               I_EK  = 2;                                                       
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                               
                                                AUTODATO_ÅM*100;                
               B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                   
                                                                                
               IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                          
                  B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                       
                  B02.STATUS.VIRK_DATO_ÅMD(I_EK) =AUTODATO_ÅM*100;              
                                                                                
               TRANS_OPPL_OMR.TRANSTYPE     = 97;                               
               HENDELSE_IND = JA;                                               
               FAMILIE_IND = I;                                                 
               I = I + 1;                                                       
                                                                                
            END;                                                                
         ELSE  /* NY REDUKSJON FOR AFP'ERE MED FAI > G OG ALDER */              
         IF    AUTODATO_ÅM          = 200101   &                                
               B02.FAI(I)           > 490      &                                
               B02.PENSJONSTYPE1(I) = 'A'      &                                
               (B02.KONV_P_KODE(I)  = 'K' !                                     
                B02.KONV_P_KODE(I)  = 'O' ) THEN                                
            DO;  /* NY BEREGNING FRADRAG FOR FAI ! */                           
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;              
               B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                   
                                                                                
               IF I  = 1 THEN                                                   
                  I_EK = 2;                                                     
               ELSE                                                             
                  I_EK = 1;                                                     
                                                                                
               IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                          
                  B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                       
                  B02.STATUS.VIRK_DATO_ÅMD(I_EK) =AUTODATO_ÅM*100;              
                                                                                
               TRANS_OPPL_OMR.TRANSTYPE = 96;                                   
               HENDELSE_IND = JA;                                               
               FAMILIE_IND = I;                                                 
               I = I + 1;                                                       
                                                                                
            END; /* NY BEREGNING FRADRAG FOR FAI ! */                           
                                                                                
         ELSE  /* FRIBELØPET ENDRES TIL 2G                      */              
         IF    AUTODATO_ÅM          = 200201   &                                
               (B02.FAI(I) * 100)   > G        &                                
               B02.PENSJONSTYPE1(I) = 'A'      &                                
               ALDER_PERSON_ÅM(I) < 7001     THEN                               
            DO;                                                                 
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;              
         /*    B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                   
                                                                                
                  IF I  = 1 THEN                                                
                     I_EK = 2;                                                  
                  ELSE                                                          
                     I_EK = 1;                                                  
                                                                                
               IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                          
                  B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                       
                  B02.STATUS.VIRK_DATO_ÅMD(I_EK) =AUTODATO_ÅM*100;*/            
                                                                                
               TRANS_OPPL_OMR.TRANSTYPE = 95;                                   
               HENDELSE_IND = JA;                                               
               FAMILIE_IND = I;                                                 
               I = I + 1;                                                       
                                                                                
            END; /* NY BEREGNING FRADRAG FOR FAI ! */                           
         ELSE  /* IKKE FRADRAG FØR ETTER FYLTE 68 ÅR - HL 200711*/              
         IF    AUTODATO_ÅM          = 200801   &                                
               (B02.FAI(I) * 100)   > (G * 2)  &                                
               B02.PENSJONSTYPE1(I) = 'A'      &                                
               ALDER_PERSON_ÅM(I) < 6801     THEN                               
            DO;                                                                 
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;              
               B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                   
                                                                                
                  IF I  = 1 THEN                                                
                     I_EK = 2;                                                  
                  ELSE                                                          
                     I_EK = 1;                                                  
                                                                                
               IF B01.STATUS_KODE_HIST (I_EK) = ' '  &                          
                  B01.VIRK_DATO_ÅMD    (I_EK) > 0    THEN                       
                  B02.STATUS.VIRK_DATO_ÅMD(I_EK) =AUTODATO_ÅM*100;              
                                                                                
               TRANS_OPPL_OMR.TRANSTYPE = 89;                                   
               HENDELSE_IND = JA;                                               
               FAMILIE_IND = I;                                                 
               I = I + 1;                                                       
                                                                                
            END; /* NY BEREGNING FRADRAG FOR FAI ! */                           
         ELSE   /*BARNETILLEGGET ØKER   ********* */                            
         IF    AUTODATO_ÅM          = 200205   &                                
               B02.ANTALL_BARN(I)  > 0            THEN                          
            DO;                                                                 
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;              
               TRANS_OPPL_OMR.TRANSTYPE = 93;                                   
               HENDELSE_IND = JA;                                               
               FAMILIE_IND = I;                                                 
               I = I + 1;                                                       
                                                                                
            END; /* BARNETILLEGGET ØKER            */                           
         ELSE   /*NYE SATSER FOR GP-200302 HL     */                            
     /*  IF    AUTODATO_ÅM          = 200305 THEN      */                       
         IF    AUTODATO_ÅM          = 200305 !                                  
               AUTODATO_ÅM          = 200405 !                                  
               AUTODATO_ÅM          = 200505      THEN                          
            DO; /* NYE SATSER GP PENSJONISTEKTEPAR */                           
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;              
               TRANS_OPPL_OMR.TRANSTYPE = 92;                                   
               HENDELSE_IND = JA;                                               
               FAMILIE_IND = I;                                                 
  /*           I = I + 1;           */                                          
                                                                                
            END; /* NYE SATSER FOR GP              */                           
         ELSE                                                                   
         /* MARTIN 122001*/                                                     
         IF (AUTODATO_ÅM          = 200201 &                                    
             B02.PENSJONSTYPE2(I) = 'A'    ) THEN                               
            DO;  /* NY BEREGNING FOR DAGPENGER (REHAB & ATTFØRING) */           
               TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);              
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;              
               B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                   
               TRANS_OPPL_OMR.TRANSTYPE = 68;                                   
               HENDELSE_IND = JA;                                               
               B02 = '';                                                        
               FAMILIE_IND = I;                                                 
               I = I + 1;                                                       
               EXEC CICS LINK PROGRAM('R0017001') COMMAREA(KOM_OMR);            
               IF FEIL_MELD_NR > 0 THEN                                         
                  GOTO AVSLUTNING;                                              
            END; /* NY BEREGNING FOR DAGPENGER (REHAB & ATTFØRING) */           
  /*TILLEGG 4.12.89  OG 9.1.90  HL*/                                            
         ELSE IF AUTODATO_ÅM          = 199001        &                         
               (B02.PENSJONSTYPE1(I)  = 'E'    !                                
 /**/           B02.PENSJONSTYPE1(I)  = 'J'    !                                
                B02.PENSJONSTYPE2(I)  = 'E'     )   &                           
 /**/           B02.FORVENTET    (I)  > 160       &                             
 /**/           B02.FORVENTET    (I)  < 1443      &                             
 /* 1 */           ((B02.TP_BRUTTO(I) + B02.UFØRPENS.TP(I)                      
                     + B02.YRKEPENS.TP(I) < 1553)     !                         
 /* 2 */            (B02.ETTEPENS.ST(I) + B02.UFØRPENS.ST(I) > 0 ))             
                           THEN                                                 
                                                                                
 /*8.2.HL : I TIDEN 4.12.89 - 9.1.90 STO BARE TEST NR 1 I PROGRAMMET */         
 /*         I TIDEN 9.1.90  - 8.2.90 STO BARE TEST NR 2 I PROGRAMMET */         
                                                                                
                DO;                                                             
                 B02.STATUS.VIRK_DATO_ÅMD(I) =AUTODATO_ÅM*100;                  
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                                               AUTODATO_ÅM*100;                 
                 TRANS_OPPL_OMR.TRANSTYPE     = 11;                             
                 HENDELSE_IND = JA;                                             
                 FAMILIE_IND = I;                                               
                 I = I + 1;                                                     
                END;                                                            
  /*HIT 4.12.89 HL */                                                           
                                                                                
         IF (B02.BUP_GAR_KODE(I,1) = 'A'  !                                     
                  B02.BUP_GAR_KODE(I,1) = 'D'  )  &                             
 /*24.10.89*/     (B02.PENSJONSTYPE1(I) = 'U' !                                 
 /* HL */          B02.PENSJONSTYPE1(I) = 'Y')      THEN                        
              CALL UNG_UFØR;                                                    
                                                                                
 /*  OPPHØR  AV OVERGANGSSTØNAD     */                                          
                                                                                
         ELSE                                                                   
           IF B02.FRAMLEGGSDATO_ÅMD(I)/100 = AUTODATO_ÅM   &                    
              B02.PENSJONSTYPE2    (I) = 'O' THEN  /*S250803*/                  
          /*  B02.FRAMLEGGSKODE    (I) = 'O' THEN   TS250803*/                  
                                                                                
              DO;                                                               
                 TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);            
                 TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                             
                                             AUTODATO_ÅM*100;                   
                 B02.STATUS.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                 
   /* BRUKES */ HJ_VIRK_DATO_ÅMD  = B02.FRAMLEGGSDATO_ÅMD(I);                   
   /* I 9938 */    SØKER_IND = I;                                               
                 CALL ETTERLATTEPENSJON_OPPHØRER;  /* R0019938 */               
                 HENDELSE_IND = JA;                                             
                 I = I + 1;                                                     
              END;                                                              
                                                                                
       END;                                                                     
     I = I + 1;                                                                 
   END;      /**  DO WHILE (I < 3)   **/                                        
                                                                                
 /*FLYTTET HIT 9709 HL:        */                                               
                                                                                
       IF FINNES_SØKER_TIL_DØD                  THEN                            
          IF FINNES_SØKER                       THEN                            
             HENDELSE_IND = JA;                                                 
                                                                                
   IF HENDELSE_IND = NEI !                                                      
      TRANS_OPPL_OMR.TRANSTYPE = 93 ! /* REMEDY 103 */                          
      TRANS_OPPL_OMR.TRANSTYPE = 92 ! /* REMEDY 250 */                          
      TRANS_OPPL_OMR.TRANSTYPE = 27     THEN  /*TS*/                            
                                                                                
     DO;   /** DERSOM DER ER HENDELSER PÅ FORELDRE, SÅ BLIR BARNA **/           
           /** GJENNOMGÅTT I DEN FORBINDELSE                      **/           
       I = 3;                                                                   
           /** VI UNDERSØKER NÅ OM PERSONEN PÅ BARNEPLASS FYLLER ÅR  **/        
                                                                                
                                                                                
       DO WHILE (I < MAX_BARN);                                                 
                                                                                
         IF B01.STATUS.VIRK_DATO_ÅMD   (I) > 0 &                                
            B01.STATUS.STATUS_KODE_HIST(I) = ' ' THEN                           
           DO;                                                                  
                                                                                
             /** FINNE SISTE UTFYLLTE BUP_GAR_KODE  **/                         
                                                                                
        /*0697 HL:*/                                                            
             DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE                
                                          (I,J) ^= ' ');                        
               BUP_SISTE = J;                                                   
             END;                                                               
                                                                                
 /* ENDRET 21.10.85 HL - DET HAR STÅTT '2000' NEDENFOR, FEILRAPP 259*/          
                                                                                
             IF ALDER_PERSON_ÅM(I) = 2001 THEN  /** 20 ÅR FORRIGE MD*/          
               DO;                                                              
                 IF B01.STATUS.PENSJONSTYPE1(I) = 'B'   &                       
                    B01.STATUS.DØD_AV_YRKESSKADE (I) ^= 'E'  THEN               
                                                                                
                   DO;                                                          
                     CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);                    
                     HENDELSE_IND = JA;                                         
                                                                                
                     IF B01.UFØRHIST.BUP_GAR_KODE(I,                            
                        BUP_SISTE)= 'A' THEN                                    
                                                                                
                        B02.UFØRHIST.BUP_GAR_KODE(I,                            
                        BUP_SISTE)= 'B';                                        
                                                                                
                                                                                
                                                                                
                     IF B01.UFØRHIST.BUP_GARANTI(I,                             
                        BUP_SISTE) > 0                      THEN                
                                                                                
                        IF AUTODATO_ÅM > 198804    THEN                         
                           IF AUTODATO_ÅM < 199105     THEN                     
                                                                                
                             B02.UFØRHIST.BUP_GARANTI(I,                        
                             BUP_SISTE)= 3.00;                                  
                           ELSE                                                 
                           IF AUTODATO_ÅM < 200805     THEN                     
                             B02.UFØRHIST.BUP_GARANTI(I,                        
                               BUP_SISTE)= 3.30;                                
                           ELSE                                                 
                             B02.UFØRHIST.BUP_GARANTI(I,                        
                               BUP_SISTE)= 3.50;                                
                        ELSE                                                    
                                                                                
                           IF AUTODATO_ÅM > 198704   THEN                       
                                                                                
                              B02.UFØRHIST.BUP_GARANTI(I,                       
                              BUP_SISTE)= 2.50;                                 
                                                                                
                   END;                                                         
                                                                                
               END;                                                             
                                                                                
             ELSE IF ALDER_PERSON_ÅM(I) = 1801 THEN/**18 ÅR FORR. MND**/        
               DO;                                                              
                 IF B01.STATUS.PENSJONSTYPE1(I) = 'N'   &                       
                    B01.STATUS.DØD_AV_YRKESSKADE (I) ^= 'E'  THEN               
                                                                                
                   DO;                                                          
                     CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);                    
                     HENDELSE_IND = JA;                                         
                   END;                                                         
                                                                                
                 ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'L' THEN                 
                   DO;                                                          
                     CALL FJERN_BARNETILLEGG(I,SØKER_IND,                       
                                                   FAMILIE_IND);                
                     HENDELSE_IND = JA;                                         
                     I = MAX_BARN;  /** VI FINNER ALLE BARNA I   **/            
                                        /** BARN_18_ÅR               **/        
                   END;                                                         
                                                                                
               END;   /** ELSE IF ALDER_PERSON_ÅM(I) = 1801  **/                
                                                                                
                                                                                
             ELSE IF ALDER_PERSON_ÅM(I) = 2101  &  /**21 ÅR FORR. MND**/        
                    (B01.PENSJONSTYPE1(I) = 'N' !                               
                     B01.PENSJONSTYPE1(I) = 'B') THEN                           
                                                                                
         /*VI FORUTSETTER DA AT DETTE ER EN YRKESSKADESAK */                    
                                                                                
                DO;                                                             
                   CALL FJERN_BARNEPENSJON(I,FAMILIE_IND);                      
                   HENDELSE_IND = JA;                                           
                END;                                                            
                                                                                
           END;        /** IF VIRK_DATO_ÅM > 0 &    **/                         
                                                                                
         I = I + 1;                                                             
                                                                                
       END;  /** DO WHILE (I < MAX_BARN)  **/                                   
                                                                                
       IF TRANS_OPPL_OMR.TRANSTYPE = 0 &  /*DET ER IKKE LAGET TRANS*/           
          SATSENDRING_DENNE_MÅNED    THEN                                       
           DO;                                                                  
             CALL SATSENDRING;                                                  
                                                                                
             IF TRANS_OPPL_OMR.TRANSTYPE ^= 0 THEN                              
                HENDELSE_IND = JA;                                              
           END;                                                                 
                                                                                
     END;    /** DO FOR IF HENDELSE_IND = NEI  **/                              
                                                                                
                                                                                
 FINNES_SØKER: PROC RETURNS (BIT(1));                                           
                                                                                
       DCL RETUR BIT (1) INIT('0'B);                                            
                                                                                
 /*ENDRET 6.3.90 HL : AVDØD_IND ISTEDET FOR 'I' */                              
                                                                                
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
       IF AVDØD_IND = 1                         &                               
          B01.STATUS.VIRK_DATO_ÅMD    (2) >  0  &                               
          B01.STATUS.STATUS_KODE_HIST (2) = ' ' THEN                            
          DO;                                                                   
             SØKER_IND = 2;                                                     
             RETUR     = '1'B;                                                  
             B02.STATUS.VIRK_DATO_ÅMD (2) = AUTODATO_ÅM*100;                    
             CALL SETT_VIRKDATO_BARN;                                           
          END;                                                                  
       ELSE IF                                                                  
          B01.STATUS.VIRK_DATO_ÅMD    (1) >  0  &                               
          B01.STATUS.STATUS_KODE_HIST (1) = ' ' THEN                            
          DO;                                                                   
             SØKER_IND = 1;                                                     
             RETUR     = '1'B;                                                  
             B02.STATUS.VIRK_DATO_ÅMD(1) =AUTODATO_ÅM*100;                      
             CALL SETT_VIRKDATO_BARN;                                           
          END;                                                                  
                                                                                
       IF                                                                       
          B01.STATUS.VIRK_DATO_ÅMD    (3) >  0  &                               
          B01.STATUS.STATUS_KODE_HIST (3) = ' ' &                               
          B01.STATUS.PENSJONSTYPE1    (3) = 'B' THEN                            
          DO;                                                                   
             SØKER_IND = 3;                                                     
             RETUR     = '1'B;                                                  
             CALL SETT_VIRKDATO_BARN;                                           
          END;                                                                  
                                                                                
       RETURN (RETUR);                                                          
                                                                                
       SETT_VIRKDATO_BARN: PROC;                                                
                                                                                
          DO J = 3 TO 14 ;                                                      
            IF                                                                  
              B01.STATUS.VIRK_DATO_ÅMD    (J) >  0  &                           
              B01.STATUS.STATUS_KODE_HIST (J) = ' ' THEN                        
                                                                                
                B02.STATUS.VIRK_DATO_ÅMD(J) = AUTODATO_ÅM*100;                  
          END;                                                                  
                                                                                
       END SETT_VIRKDATO_BARN;                                                  
                                                                                
     END FINNES_SØKER;                                                          
                                                                                
                                                                                
 END AUTO_ONLINE;                                                               
                                                                                
                                                                                
 REGN_ALDER_FOR_FAMILIE:                                                        
   PROC;                                                                        
                                                                                
   DO J = 1 TO 14;                                                              
     IF B01.STATUS.VIRK_DATO_ÅMD(J) > 0 &                                       
        B01.RF0PERSN.FNR       (J) > 0 THEN                                     
       DO;                                                                      
         PIC11 = B01.RF0PERSN.FNR(J);                                           
         FIXED_DEC5  = F_ALDER(PIC11,(AUTODATO_ÅM*100));                        
         ALDER_PERSON_ÅM(J) = FIXED_DEC5;                                       
         MAX_BARN = J + 1;                                                      
       END;                                                                     
    END;      /**   DO J = 1 TO 14   **/                                        
                                                                                
    IF MAX_BARN < 3 THEN                                                        
      MAX_BARN = 3;                /**   D.V.S INGEN BARN   **/                 
                                                                                
 END REGN_ALDER_FOR_FAMILIE;                                                    
                                                                                
                                                                                
 ADDER_EN_MND_TIL_ALDER_FAMILIE:                                                
   PROC;                                                                        
                                                                                
   DO J = 1 TO 14;                                                              
     IF B01.STATUS.VIRK_DATO_ÅMD(J) > 0 &                                       
        B01.RF0PERSN.FNR       (J) > 0 THEN                                     
       DO;                                                                      
         ALDER_PERSON_ÅM(J) = ALDER_PERSON_ÅM(J) + 1;                           
         IF ALDER_PERSON_ÅM(J) < 0 & ALDER_PERSON.MN(J) = 99 THEN               
           ALDER_PERSON.MN(J) = 11;                                             
         ELSE IF ALDER_PERSON.MN(J) = 12 THEN                                   
           DO;                                                                  
             ALDER_PERSON.MN(J) = 0;                                            
             ALDER_PERSON.ÅR(J) = ALDER_PERSON.ÅR(J) + 1;                       
           END;                                                                 
       END;                                                                     
    END;      /**   DO J = 1 TO 14   **/                                        
                                                                                
                                                                                
 END ADDER_EN_MND_TIL_ALDER_FAMILIE;                                            
                                                                                
                                                                                
 P67_TIL_P70:                                                                   
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     I_EK       FIXED BIN(15),                                                  
     SISTE_UFT  FIXED BIN(15),                                                  
            SISTE_YUFT FIXED BIN(15);                                           
                                                                                
     IF I  = 1 THEN                                                             
       I_EK = 2;                                                                
     ELSE                                                                       
       I_EK = 1;                                                                
                                                                                
     B02.STATUS.VIRK_DATO_ÅMD  (I) = AUTODATO_ÅM*100;                           
     B02.FAI                   (I) = 0;                                         
     B02.FAI_DATO_ÅMD          (I) = 0;                                         
     B02.P67_KODE              (I) = ' ';                                       
                                                                                
 /*OGSÅ 'K' 180196 HL : */                                                      
                                                                                
     IF B01.ALDERSP.KONV_P_KODE(I) = 'F'   THEN                                 
 /*     B01.ALDERSP.KONV_P_KODE(I) = 'K' THEN  */ /*FJERNET 1302*/              
        B02.ALDERSP.KONV_P_KODE(I) = ' ';                                       
                                                                                
        IF B01.STATUS.STATUS_KODE_HIST(I_EK) = ' ' THEN                         
           CALL ER_EK_65_67_70 (I_EK);                                          
                                                                                
                                                                                
     /**  EGNE FORSØRGEDE BARN  **/                                             
                                                                                
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                                      
        CALL BARN_18ÅR(I);                                                      
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
     TRANS_OPPL_OMR.TRANSTYPE     = 26;                                         
                                                                                
 END P67_TIL_P70;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
 OVERGANG_TIL_P67:                                                              
   PROC(I_EK);                                                                  
     DCL START_ÅR         FIXED DEC (5);                                        
     DCL SLUTT_ÅR         FIXED DEC (5);                                        
     DCL I1               FIXED DEC (5);                                        
     DCL FAKTOR           FIXED DEC (3)  INIT (0);                              
     DCL GRAD             FIXED DEC (5)  INIT (0);                              
     DCL ANTALL           FIXED DEC (3)  INIT (0);                              
                                                                                
   DCL                                                                          
     I_EK        FIXED BIN(15),                                                 
     SISTE_UFT   FIXED BIN(15),                                                 
     SISTE_YUFT  FIXED BIN(15);                                                 
                                                                                
     IF I  = 1 THEN                                                             
       I_EK = 2;                                                                
     ELSE                                                                       
       I_EK = 1;                                                                
  /* B00 = B02 ;    SATISH TESTING ALDERS-KONVERTERING Må                       
                    GENERE NY STATUS    31.01.2002   */                         
                                                                                
     /* MARTIN 231101                                                           
     B02.TT_FAKTISK_NORSK_MND(I)          = 0;  /*9907*/                        
     TRANS_OPPL_OMR.FØDSNUMMER     = B02.RF0PERSN.FNR(I);                       
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
     B02.STATUS.VIRK_DATO_ÅMD  (I) = AUTODATO_ÅM*100;                           
                                                                                
     IF B02.ALDERSP.UTTAKSDATO_ÅMD(I) = 0      THEN     /*27.2.01*/             
        B02.ALDERSP.UTTAKSDATO_ÅMD(I) = AUTODATO_ÅM * 100; /* JFA */            
     IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'           THEN  /* 5.1.00 */        
        B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                                    
                                                                                
     B02.AFP_TILLEGG(I) = 0;    /* TRUDE 1092*/                                 
                                                                                
 /*NY LOV 1.1.91 : HL : */                                                      
     SPARE_TT_16_66 = B02.TT_16_66(I);       /*9907*/                           
 /*NY PL1 DUMPER FORDI TT_16_66 BLIR MER ENN TRE SIFFER : */                    
     IF B02.TT_16_66(I) > 0             THEN                                    
        DO;                                                                     
           IF B01.PENSJONSTYPE1(I)  = 'K'   THEN                                
              UTVIDET_TT_16_66 = B02.TT_16_66(I);                               
           ELSE                                                                 
              UTVIDET_TT_16_66 = B02.TT_16_66(I) + B02.TT_FRAMT(I);             
        END;                                                                    
     ELSE                                                                       
       B02.TT_ETTER_1966(I) = B02.TT_ETTER_1966(I) + B02.TT_FRAMT(I);           
     IF UTVIDET_TT_16_66 > 480           THEN                                   
        B02.TT_16_66(I) = 480;                                                  
     ELSE                                                                       
        B02.TT_16_66(I) = UTVIDET_TT_16_66;                                     
                                                                                
     UTVIDET_TT_16_66 = 0;                                                      
     B02.TT_FRAMT     (I) = 0;                                                  
                                                                                
     IF SATSENDRING_DENNE_MÅNED = JA          &                                 
   /*MÅ ALLTID RULLERES OM DEN KOMMER FRA 'AUTO' - 9905 */                      
       (B01.GT_TILLEGG_LOV92(I) = 0   !                                         
        KJØRINGS_TYPE           = 'A'   )    THEN                               
        FIXED_DEC5 = B01.FORVENTET (I) * G_NÅ/G_FØR;                            
     ELSE                                                                       
        FIXED_DEC5 = B01.FORVENTET (I);                                         
                                                                                
     IF B01.STATUS.PENSJONSTYPE1(I) = 'E' THEN                                  
       DO;                                                                      
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                    
         B02.ALDERSP.KONV_P_KODE (I)  = 'E';                                    
         B02.ETTEPENS.GP_BRUTTO  (I) = 0;                                       
         B02.ETTEPENS.GP_NETTO   (I) = 0;                                       
         B02.ETTEPENS.ST         (I) = 0;                                       
         B02.ETTEPENS.KT         (I) = 0;                                       
         B02.ETTEPENS.TP_BRUTTO  (I) = 0;                                       
         B02.ETTEPENS.TP_NETTO   (I) = 0;                                       
         B02.ETTEPENS.FORVENTET  (I) = 0;                                       
         B02.TILKN.TILKNYTNINGSKODE(I_EK,1) = 'A';                              
                                                                                
         IF B01.STATUS.PENSJONSTYPE2(I) = 'O' THEN                              
           DO;                              /**  OVERGANGSTØNAD     **/         
             TRANS_OPPL_OMR.TRANSTYPE = 69; /**  IKKE KONVERTERING  **/         
             B02.STATUS.PENSJONSTYPE2(I)  = 'P';                                
             B02.STATUS.SUM_YTELSE   (I)  = 0;                                  
           END;                                                                 
         ELSE                                                                   
           DO;                                                                  
             TRANS_OPPL_OMR.TRANSTYPE = 25; /* FRA EP TIL P67 */                
             B02.STATUS.PENSJONSTYPE2(I)  = 'E';                                
                                                                                
             IF AUTODATO_ÅM > 198403          THEN                              
                /* LOVENDRING: FORVENTET I EP KAN NYTTES SOM FAI */             
                DO;                                                             
                   B02.FAI  (I)                 = FIXED_DEC5;                   
                   B02.FAI_DATO_ÅMD(I) = AUTODATO_ÅM*100;                       
                END;                                                            
                                                                                
           END;                                                                 
                                                                                
                                                                                
       END;   /**  IF B01.STATUS.PENSJONSTYPE1(I) = 'E' **/                     
                                                                                
     ELSE IF B01.STATUS.PENSJONSTYPE1(I) = 'J' THEN                             
       DO;                                                                      
                                                                                
  /*FJERNET 13.3.96 HL : */                                                     
  /*     IF B01.STATUS.PENSJONSTYPE2(I) = 'P' THEN    */                        
                                                                                
             IF AUTODATO_ÅM > 198403      THEN                                  
                                                                                
                DO;                                                             
                   B02.FAI  (I)                 = FIXED_DEC5;                   
                   B02.FAI_DATO_ÅMD(I)  = AUTODATO_ÅM*100;                      
                END;                                                            
                                                                                
         TRANS_OPPL_OMR.TRANSTYPE = 33;  /* FRA 'J' TIL P67 */                  
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                    
         B02.STATUS.PENSJONSTYPE2(I)  = 'P';                                    
         B02.ALDERSP.KONV_P_KODE (I)  = 'J';                                    
         B02.ETTEPENS.GP_BRUTTO  (I) = 0;                                       
         B02.ETTEPENS.GP_NETTO   (I) = 0;                                       
         B02.ETTEPENS.ST         (I) = 0;                                       
         B02.ETTEPENS.KT         (I) = 0;                                       
         B02.ETTEPENS.TP_BRUTTO  (I) = 0;                                       
         B02.ETTEPENS.TP_NETTO   (I) = 0;                                       
         B02.ETTEPENS.FORVENTET  (I) = 0;                                       
                                                                                
       END;                                                                     
                                                                                
     ELSE          /**  TIDLIGERE UP     ELLER AFP        **/                   
     IF B01.PENSJONSTYPE2(I) = 'N'        !                                     
        B01.PENSJONSTYPE3(I) = 'S'        !                                     
        B01.PENSJONSTYPE3(I) = 'K'          THEN                                
  /*REMEDY 1954*/                                                               
        DO;                                                                     
           CALL AFP_NULL_OPPHØRER (I,I_EK);                                     
           TRANS_OPPL_OMR.TRANSTYPE = 73;                                       
           IF B01.PENSJONSTYPE1 (I_EK) = 'A'       !                            
              B01.PENSJONSTYPE1 (I_EK) = 'K'       !                            
              B01.PENSJONSTYPE1 (I_EK) = 'U'      THEN                          
                 CALL ER_EK_65_67_70 (I_EK);                                    
        END;                                                                    
     ELSE                                                                       
     IF B01.PENSJONSTYPE2(I) = 'A' THEN           /*DAGPENGER*/                 
        DO;                                                                     
           B02.STATUS_KODE_HIST(I) = 'O';                                       
           B02.UFØRPENS(I)         = '';                                        
           B02.PENSJONSTYPE2(I)    = 'A';                                       
           TRANS_OPPL_OMR.TRANSTYPE = 75;                                       
        END;                                                                    
     ELSE                                                                       
       DO;                                                                      
         IF B01.PENSJONSTYPE1(I) = 'U'    !                                     
            B01.PENSJONSTYPE1(I) = 'Y'           THEN                           
           DO;                                                                  
              SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                                
              B02.FRYSKODE(I) = ' ';                                            
              B02.FRYSDATO_ÅMD(I) = 0;                                          
              IF B01.GARANTI_YRKEGRAD(I) > B01.YRKEPENS.YUG(I) THEN             
                 B02.YRKEPENS.YUG(I) = B01.GARANTI_YRKEGRAD(I);                 
              B02.GARANTIGRAD(I)  = 0;                                          
              B02.STATUS.FRIINNTEKT_DATO_ÅMD(I) = 0;                            
                                                                                
             IF AUTODATO_ÅM > 199201           &                                
                AUTODATO_ÅM < 200801           &     /*HL 200712*/              
                B02.PENSJONSTYPE2(I) ^= 'E'  &                                  
                ^ (B02.GUNSTIGSTE_ALTERNATIV(I) = '2'    &                      
                   SISTE_UFT = 1                    )   &                       
  /*TILLEGG 18.9.01 HL*/                                                        
                ^ (B02.GUNSTIGSTE_ALTERNATIV(I) = ' '    &                      
                   B02.PRO_RATA_BEREGNING   (I) ^= ' '   &                      
                   SISTE_UFT = 1                    )   &                       
                B02.UFØRPENS.UFG (I)  < 100     THEN                            
                                                                                
                DO;                                                             
                   B02.P67_KODE(I)    = '5';                                    
                   B02.SUM_YTELSE(I)  = 0;                                      
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */            
                END;                                                            
             ELSE                                                               
          DO;                                                                   
             TRANS_OPPL_OMR.TRANSTYPE = 24;  /* FRA UP TIL P67 */               
                                                                                
             IF B01.UFØRPENS.SPT_1291(I) > 0       &                            
                B01.GT_TILLEGG_LOV92 (I) > 0       &    /*9906*/                
                AUTODATO_ÅM > 199300              THEN                          
                DO;                                                             
                   B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I);          
                   B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I);          
                   B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I);          
                END;                                                            
                                                                                
      /**/   ELSE                                                               
             IF AUTODATO_ÅM > 199200           THEN                             
                DO;                                                             
                                                                                
    B02.ALDERSP.PÅ_ETTER91(I) = B01.UFØRPENS.PÅ_ETTER91(I);                     
      /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT(I);                
                  B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT(I);                
                  B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ (I); */             
                END;                                                            
                                                                                
    /**/                                                                        
                                                                                
         END;                                                                   
         B02.STATUS.VILKÅR_8_4_3A(I) = B02.UFØRPENS.VILKÅR_8_4_3A(I);           
 /*TILLEGG 9906 - EØS :                                        */               
         IF B02.BEREGN_FOLKETRYGD(I) = 'N'   !                                  
            B02.BEREGN_FOLKETRYGD(I) = 'U'     THEN                             
            DO;                                                                 
               B02.TT_ANV(I) = (SPARE_TT_16_66 + 6) / 12;                       
               B02.TT_16_66(I) = SPARE_TT_16_66;                                
               B02.BEREGN_FOLKETRYGD(I) = 'U';        /*0001*/                  
               B02.TT_FAKTISK_NORSK_MND(I) = SPARE_TT_16_66;                    
            END;                                                                
                                                                                
         /* REGN UT OG OPPBEVAR GJENNOMSNITTLIG UFG*/                           
         IF (B02.GUNSTIGSTE_ALTERNATIV(I) = '2'    &                            
             SISTE_UFT = 1                     )  !                             
  /*TILLEGG 18.9.01 HL*/                                                        
            (B02.GUNSTIGSTE_ALTERNATIV(I) = ' '    &                            
             B02.PRO_RATA_BEREGNING   (I) ^= ' '   &                            
             SISTE_UFT = 1                    )        THEN                     
           DO;                                                                  
              B02.PÅ_EØS(I)  =  B02.UFØRPENS.PÅ(I);                             
              B02.TT_FAKTISK_NORSK_MND(I)   = SPARE_TT_16_66;                   
              W_FNR11= B01.RF0PERSN.FNR(I);                                     
              W_FNR13= KONV_FNR11_FNR13(W_FNR11);                               
              TAB(*)   = '';                                                    
              START_ÅR = B02.UFT_ÅMD(I,1) / 10000;                              
              SLUTT_ÅR = AUTODATO_ÅM / 100 - 1;                                 
              IF AUTODATO_M = 1  THEN                                           
                 SLUTT_ÅR = SLUTT_ÅR - 1;                                       
              TAB.UFØR_GRAD(START_ÅR) = B02.UFØRHIST.UFG(I,1);                  
              CALL LEGG_UFØREHIST_I_TAB(I,FNR_R.ÅR);                            
              DO I1 = START_ÅR TO SLUTT_ÅR;                                     
                 GRAD = GRAD +  TAB.UFØR_GRAD(I1);                              
                 ANTALL = ANTALL + 1;                                           
              END;                                                              
              FAKTOR = GRAD / ANTALL  + 0.5;                                    
              B02.BUP_GRAD_EØS(I) = B02.UFØRPENS.SPT(I) * FAKTOR                
                                            / 100 + 0.005;                      
              B02.SPT_EØS(I)     = B02.UFØRPENS.SPT(I);                         
              B02.OPT_EØS(I)     = B02.UFØRPENS.OPT(I);                         
           END;                                                                 
         ELSE                                                                   
            B02.BUP_GRAD_EØS(I) = 0;                                            
         B02.UFØRPENS            (I) = '';                                      
         B02.OPPHØRSDATO_ÅMD(I,SISTE_UFT) =  OPPH_ÅM *100;                      
         B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                                 
                                                                                
         IF B01.STATUS.PENSJONSTYPE2 (I) = 'E' THEN                             
            DO;                                                                 
                                                                                
               IF AUTODATO_ÅM > 198403    THEN                                  
                                                                                
                 DO;                                                            
                    B02.FAI  (I)                 = FIXED_DEC5;                  
                    B02.FAI_DATO_ÅMD(I) = AUTODATO_ÅM*100;                      
                 END;                                                           
                                                                                
 /*LINJEN NEDENFOR ER LAGT INN 21.2.89 - HL        */                           
                                                                                
                   B02.TILKN.TILKNYTNINGSKODE(I_EK,1) = 'A';                    
                                                                                
               B02.ETTEPENS.FORVENTET  (I) = 0;                                 
               TRANS_OPPL_OMR.TRANSTYPE = 41; /* FRA UE TIL AE */               
            END;                                                                
        IF B01.STATUS.PENSJONSTYPE1(I) = 'Y'   THEN                             
                                                                                
           DO;                                                                  
                                                                                
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */                      
              B02.YRKEPENS.GP         (I) = 0;                                  
              B02.YRKEPENS.BT         (I) = 0;                                  
              B02.YRKEPENS.TP         (I) = 0;                                  
  /*HL        B02.YRKEPENS.SPT        (I) = 0         */                        
              B02.YRKEPENS.YPT_KODE   (I) = '';                                 
              SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                              
              B02.OPPH_DATO_ÅMD(I,SISTE_YUFT) = AUTODATO_ÅM*100;                
              B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                             
           END;                                                                 
                                                                                
       END;  /*PT1 = U/Y */                                                     
     ELSE    /*PT1 = K */                                                       
       DO;                                                                      
          B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);                           
          B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);                           
          B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);                           
          TRANS_OPPL_OMR.TRANSTYPE  = 49;/*FRA AFP TIL P67*/                    
          /* ENDRING MARTIN 311002 - OPPHøR INN I AFPHIST */                    
       IF (B01.AFPDATO_ÅMD(I,1) > 0 &                                           
           B01.PENSJONSTYPE1(I) = 'K' ) THEN                                    
          DO; /* SETT INN NULLELEMENT I AFPHIST SEGMENTET */                    
                                                                                
             /* FØRST BLANKER VI AFPHIST MED SENERE DATO : */                   
             DO J = 1 TO 30; /* ENDRET 20->30 SP 18.07.05 */                    
                IF (TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD <=                         
                    B02.AFPDATO_ÅMD(I,J)) THEN                                  
                   B02.AFPHIST(I,J) = '';                                       
             END; /* DO I = 1 TO 20 */                                          
                                                                                
             /* SÅ FINNER VI INDEX FOR NYTT NULLELEMENT */                      
             /* ENDRET 20->30 SP 18.07.05 */                                    
             DO J = 1 TO 30 UNTIL (B02.AFPDATO_ÅMD(I,J) = 0);                   
             END;                                                               
                                                                                
             IF (J > 1) THEN                                                    
                DO; /* VI DANNER NULLELEMENT BARE DERSOM TIDL AFP */            
                   B02.AFPHIST.TEI_FAKTOR(I,J) =                                
                      B02.AFPHIST.TEI_FAKTOR(I,J-1);                            
                   B02.AFPDATO_ÅMD(I,J)=                                        
                      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                         
                   B02.FEI_I_100KR(I,J) = 0;                                    
                   B02.GRAD_UTBET(I,J)  = 0;                                    
                   B02.FULL_AFP(I,J)    = 0;                                    
                   B02.RED_AFP(I,J)     = 0;                                    
                   B02.ET_REG(I,J)      = ' ';                                  
                END; /* VI DANNER NULLELEMENT BARE DERSOM TIDL AFP */           
          END; /* SETT INN NULLELEMENT I AFPHIST SEGMENTET */                   
       END;                                                                     
                                                                                
 /*DET FØLGENDE GJELDER BÅDE TIDLIGERE PT1 = U/Y OG PT1 = K :  */               
                                                                                
         B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                    
   /*KODE LIK 'O' - 200008 HL */                                                
         IF B01.PENSJONSTYPE1(I)  = 'K'     &                                   
            (B01.STATUS.PENSJONSTYPE3(I)  = 'K'  !                              
             B01.STATUS.PENSJONSTYPE3(I)  = 'S'  )    THEN                      
            B02.KONV_P_KODE(I) = 'O';                                           
         ELSE                                                                   
            B02.KONV_P_KODE(I) = B01.PENSJONSTYPE1(I);                          
                                                                                
                                                                                
         B02.STATUS.PENSJONSTYPE3(I)  = '';                                     
                                                                                
         IF B01.VIRK_DATO_ÅMD(I_EK) > 0           THEN                          
            DO;                                                                 
               DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                 
                 IF B01.TILKN.FNR_TILKN(I_EK,J) =                               
                    B01.RF0PERSN.FNR   (I         ) THEN                        
                      DO;                                                       
                        B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';               
                        B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';               
                        J = 13;                                                 
                      END;                                                      
               END;                                                             
                                                                                
 /*LINJENE NEDENFOR ER FJERNET 21.2.89 - HL- FORDI PROGRAMMENE FOR*/            
 /*BEREGNING FORUTSETTER AT OPPRINNELIG VIRKDATO BEHOLDES         */            
                                                                                
 /*            IF B01.STATUS.PENSJONSTYPE2 (I) = 'E' THEN         */            
 /*               B02.VIRK_DATO_ÅM (I_EK) = AUTODATO_ÅM           */            
 /*            ELSE                                               */            
                                                                                
 /*8.2.89*/    IF B01.STATUS_KODE_HIST (I_EK) = ' '   THEN                      
 /*AFP*/          CALL ER_EK_65_67_70(I_EK);                                    
            END;                                                                
                                                                                
         IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                                  
           CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                               
                                                                                
 /**/ END;  /**   DO FOR ELSE VED TIDLIGERE UP/ATV/AFP     **/                  
                                                                                
 END OVERGANG_TIL_P67;                                                          
                                                                                
  /*AFP1093 FRA HIT------------------------------------------------*/           
  /*AFP STATSP OVERGANG TIL AFP-NULLPENSJONIST    */                            
                                                                                
 AFP_STAT_TIL_NULL:                                                             
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     I_EK        FIXED BIN(15);                                                 
                                                                                
     IF I  = 1 THEN                                                             
       I_EK = 2;                                                                
     ELSE                                                                       
       I_EK = 1;                                                                
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER     = B02.RF0PERSN.FNR(I);                       
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
     B02.STATUS.VIRK_DATO_ÅMD  (I)    = AUTODATO_ÅM*100;                        
     IF B02.FNR (I_EK) > 0            THEN   /*200311 HL*/                      
        B02.STATUS.VIRK_DATO_ÅMD (I_EK)    = AUTODATO_ÅM*100;                   
                                                                                
         TRANS_OPPL_OMR.TRANSTYPE = 40;  /*AFP */                               
         B02.STATUS.PENSJONSTYPE1(I)  = 'K';                                    
         B02.STATUS.PENSJONSTYPE2(I)  = 'N';                                    
         B02.STATUS.PENSJONSTYPE3(I)  = 'S';                                    
     IF  B02.STATUS.PENSJONSTYPE2(I_EK)  = 'S'          THEN                    
         B02.STATUS.PENSJONSTYPE2(I_EK)  = 'P';     /*9811*/                    
                                                                                
         /* HVA MED SATSENDEING PÅ FAI + EVNT ANDRE INNT ??*/                   
                                                                                
   /*TO NEDENF. STM GJORDE AT SAMMENSTØTSBEREGNING BLE FEIL. TS 060995*/        
                                                                                
   /*IF B01.STATUS.VIRK_DATO_ÅM   (I_EK) > 0   THEN         TS 030895*/         
   /*   B02.STATUS.VIRK_DATO_ÅM   (I_EK) = AUTODATO_ÅM;     TS 030895*/         
                                                                                
   /* 'Y' VAR GLEMT NEDENFOR - DESSUTEN ER DET EN BETINGELSE AT      */         
   /*  PENSJON IKKE ER FØR 9802                                      */         
       IF B01.PENSJONSTYPE1 (I_EK) = 'A'       !                                
          B01.PENSJONSTYPE1 (I_EK) = 'K'       !                                
          B01.PENSJONSTYPE1 (I_EK) = 'U'       !                                
          B01.PENSJONSTYPE1 (I_EK) = 'Y'      THEN          /*HL*/              
          DO;                                                                   
             IF (B01.PENSJON_FØR_9802(I_EK) ^= 'J') THEN    /*HL*/              
                 B02.EK_INNT_OVER_2G(I_EK) = 'J';                               
             CALL ER_EK_65_67_70 (I_EK);                                        
          END;                                                                  
                                                                                
 END AFP_STAT_TIL_NULL;                                                         
                                                                                
 AFP_KOM_6501:                                                                  
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     I_EK      FIXED BIN(15);                                                   
                                                                                
     IF I = 1  THEN                                                             
        I_EK = 2;                                                               
     ELSE                                                                       
        I_EK = 1;                                                               
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     IF (B01.AFPDATO_ÅMD(I,1) <= (AUTODATO_ÅM*100) !                            
         B01.AFPDATO_ÅMD(I,1)  = 0                 ) THEN                       
        DO;  /* VI REGNER IKKE OM FØR UTTAK! - REMEDY 252 */                    
           TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM * 100;                
           B02.VIRK_DATO_ÅMD (I)            = AUTODATO_ÅM * 100;                
           TRANS_OPPL_OMR.TRANSTYPE = 40;                                       
           /* REMEDY 142 - SKAL IKKE REDUSERES DERSOM UTTAK FØR 9802 */         
           IF (B01.PENSJON_FØR_9802(I_EK) ^= 'J') THEN                          
              B02.EK_INNT_OVER_2G(I_EK) = 'J';                                  
                                                                                
              CALL ER_EK_65_67_70 (I_EK);                                       
        END; /* VI REGNER IKKE OM FØR UTTAK! - REMEDY 252 */                    
                                                                                
 END AFP_KOM_6501;                                                              
                                                                                
 ER_EK_65_67_70 :                                                               
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     I_EK        FIXED BIN(15),                                                 
     SISTE_UFT   FIXED BIN(15),                                                 
     SISTE_YUFT FIXED BIN(15);                                                  
                                                                                
       B02.STATUS.VIRK_DATO_ÅMD  (I_EK) = AUTODATO_ÅM*100;                      
                                                                                
       PIC11 = B01.RF0PERSN.FNR(I_EK);                                          
       PIC13  = KONV_FNR11_FNR13(PIC11);                                        
       IF  (ALDER_PERSON_ÅM(I_EK)  = 6700 &                                     
              AUTODATO_ÅM         < 199100) !                                   
           (ALDER_PERSON_ÅM(I_EK)  = 6701 &                                     
            AUTODATO_ÅM            > 199101) !                                  
           (ALDER_PERSON_ÅM(I_EK) >= 6700 &                                     
            ALDER_PERSON_ÅM(I_EK) <  7000 &                                     
            AUTODATO_ÅM         = 197301)         !                             
           (ALDER_PERSON_ÅM(I_EK)  = 7000 &                                     
            AUTODATO_ÅM         < 199100    &                                   
            B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'A')     !                        
           (ALDER_PERSON_ÅM(I_EK)  = 7001 &                                     
            AUTODATO_ÅM         > 199101    &                                   
 /*HL*/     B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'F' &                             
            B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'A')             THEN             
           IF B01.PENSJONSTYPE2(I_EK) = 'N'       THEN                          
              CALL AFP_NULL_OPPHØRER (I_EK,I);                                  
           ELSE                                                                 
           DO;                                                                  
                                                                                
               IF B02.UFØRPENS.VILKÅR_8_4_3A(I_EK) = 'J'        THEN            
                  B02.STATUS.VILKÅR_8_4_3A(I_EK)   = 'J';                       
                                                                                
               B02.ALDERSP.APD          (I_EK) = 100;                           
                                                                                
               IF B02.TT_16_66(I_EK) > 0        THEN                            
                  B02.TT_16_66(I_EK) = B02.TT_16_66(I_EK)                       
                             + B02.STATUS.TT_FRAMT     (I_EK);                  
               ELSE                                                             
                  B02.TT_ETTER_1966(I_EK)                                       
                             = B02.TT_ETTER_1966(I_EK)                          
                             + B02.TT_FRAMT     (I_EK);                         
               B02.TT_FRAMT     (I_EK) = 0;                                     
                                                                                
                                                                                
               DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I, J) > 0);                   
                  IF B01.TILKN.FNR_TILKN(I,J) =                                 
                     B01.RF0PERSN.FNR   (I_EK       ) THEN                      
                        DO;                                                     
                          B02.TILKN.TILKNYTNINGSKODE(I,J)='A';                  
                          B02.TILKN.FT_FØR_91       (I,J)=' ';                  
                          J = 13;                                               
                        END;                                                    
               END;                                                             
                                                                                
               IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'F' THEN                     
                  DO;                       /* FORSØRGET EKTEFELLE */           
                    B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';                      
                    B02.STATUS.PENSJONSTYPE2(I_EK)  = 'S';                      
                    B02.RF0PERSN.TKNR       (I_EK)  =                           
                                             B01.RF0PERSN.TKNR (I);             
                    B02.STATUS.PENSJONSTYPE2(I) = 'S';                          
                    B02.ALDERSP.KONV_P_KODE (I_EK)  = 'F';                      
                    B02.P67_KODE            (I_EK)  = '5';                      
                  END;                                                          
                                                                                
                ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'K' THEN               
                   DO;                                                          
                     IF B01.PENSJONSTYPE3(I_EK) = 'S'    !                      
                        B01.PENSJONSTYPE3(I_EK) = 'K'      THEN                 
                        B02.ALDERSP.KONV_P_KODE (I_EK)  = 'O';                  
                     ELSE                                                       
                        B02.ALDERSP.KONV_P_KODE (I_EK)  = 'K';                  
                                                                                
            /*   JFA 24.3.04 NESTE 4 LINJER */                                  
                     IF B01.STATUS.PENSJONSTYPE1(I_EK) =  'K' &                 
                        (B01.STATUS.PENSJONSTYPE3(I_EK) ^= 'S' &                
                         B01.STATUS.PENSJONSTYPE3(I_EK) ^= 'K' ) THEN           
                      DO;                                                       
                         B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';                 
                         B02.STATUS.PENSJONSTYPE3(I_EK)  = ' ';                 
                      B02.ALDERSP.VT_SPT(I_EK) = B02.ALDERSP.SPT(I_EK);         
                      B02.ALDERSP.VT_OPT(I_EK) = B02.ALDERSP.OPT(I_EK);         
                      B02.ALDERSP.VT_PÅ (I_EK) = B02.ALDERSP.PÅ (I_EK);         
                  TRANS_OPPL_OMR.BLANKETTYPE = '49';/*FRA AFP TIL P67*/         
  /*200511 HL : */                                                              
                                                                                
       IF B01.AFPDATO_ÅMD(I_EK,1) > 0   THEN                                    
          DO; /* SETT INN NULLELEMENT I AFPHIST SEGMENTET */                    
                                                                                
             /* FØRST BLANKER VI AFPHIST MED SENERE DATO : */                   
             DO J = 1 TO 30; /* ENDRET 20->30 SP 18.07.05 */                    
                IF (TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD <=                         
                    B02.AFPDATO_ÅMD(I_EK,J)) THEN                               
                   B02.AFPHIST(I_EK,J) = '';                                    
             END; /* DO I = 1 TO 20 */                                          
                                                                                
             /* SÅ FINNER VI INDEX FOR NYTT NULLELEMENT */                      
             /* ENDRET 20->30 SP 18.07.05 */                                    
             DO J = 1 TO 30 UNTIL (B02.AFPDATO_ÅMD(I_EK,J) = 0);                
             END;                                                               
                                                                                
             IF (J > 1) THEN                                                    
                DO; /* VI DANNER NULLELEMENT BARE DERSOM TIDL AFP */            
                   B02.AFPHIST.TEI_FAKTOR(I_EK,J) =                             
                      B02.AFPHIST.TEI_FAKTOR(I_EK,J-1);                         
                   B02.AFPDATO_ÅMD(I_EK,J)=                                     
                      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                         
                   B02.FEI_I_100KR(I_EK,J) = 0;                                 
                   B02.GRAD_UTBET(I_EK,J)  = 0;                                 
                   B02.FULL_AFP(I_EK,J)    = 0;                                 
                   B02.RED_AFP(I_EK,J)     = 0;                                 
                   B02.ET_REG(I_EK,J)      = ' ';                               
                END; /* VI DANNER NULLELEMENT BARE DERSOM TIDL AFP */           
          END; /* SETT INN NULLELEMENT I AFPHIST SEGMENTET */                   
   /*200511 HL  HIT */                                                          
                                                                                
               /**/       END;                                                  
                                                                                
                   END;                                                         
                                                                                
                 ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'U' THEN              
                   DO;                                                          
 /*      B02.ALDERSP.SPT_1291(I_EK) = B01.UFØRPENS.SPT_1291(I_EK); */           
 /*      B02.ALDERSP.OPT_1291(I_EK) = B01.UFØRPENS.OPT_1291(I_EK); */           
 /*      B02.ALDERSP.PÅ_1291 (I_EK) = B01.UFØRPENS.PÅ_1291 (I_EK); */           
                     B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';                     
                     B02.ALDERSP.KONV_P_KODE (I_EK)  = 'U';                     
                     IF B02.UFØRPENS.UFG(I_EK)      < 100     THEN              
                        B02.P67_KODE (I_EK)  = '5';                             
                     B02.SUM_YTELSE(I_EK)  = 0;                                 
                  B02.ALDERSP.UTTAKSDATO_ÅMD(I_EK)= AUTODATO_ÅM*100;            
                     B02.UFØRPENS            (I_EK)  = '';                      
                     TRANS_OPPL_OMR.BLANKETTYPE      = '24';/*UP=>P67*/         
                     SISTE_UFT = FINNE_SISTE_UFT_ÅM(I_EK);                      
                  B02.OPPHØRSDATO_ÅMD(I_EK,SISTE_UFT) = OPPH_ÅM   *100;         
                     B02.OPPHØRSKODE   (I_EK,SISTE_UFT) = 'A';                  
                                                                                
                     IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                   
                       CALL BARNS_TILKNYTNINGSKODE_ENDRES(I_EK);                
                                                                                
                   END;                                                         
                                                                                
             ELSE IF B01.STATUS.PENSJONSTYPE1(I_EK) = 'Y' THEN                  
               DO;                                                              
 /*      B02.ALDERSP.SPT_1291(I_EK) = B01.UFØRPENS.SPT_1291(I_EK); */           
 /*      B02.ALDERSP.OPT_1291(I_EK) = B01.UFØRPENS.OPT_1291(I_EK); */           
 /*      B02.ALDERSP.PÅ_1291 (I_EK) = B01.UFØRPENS.PÅ_1291 (I_EK); */           
                 B02.ALDERSP.KONV_P_KODE (I_EK)  = 'Y';                         
                     IF B02.UFØRPENS.UFG(I_EK)      < 100     THEN              
                        B02.P67_KODE (I_EK)  = '5';                             
                     B02.SUM_YTELSE(I_EK)  = 0;                                 
                 B02.STATUS.PENSJONSTYPE1(I_EK)  = 'A';                         
                 B02.ALDERSP.UTTAKSDATO_ÅMD(I_EK)= AUTODATO_ÅM*100;             
                 SISTE_UFT = FINNE_SISTE_UFT_ÅM(I_EK);                          
               B02.OPPHØRSDATO_ÅMD(I_EK,SISTE_UFT)= OPPH_ÅM    *100;            
                 B02.OPPHØRSKODE   (I_EK,SISTE_UFT) = 'A';                      
                 SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I_EK);                        
               B02.OPPH_DATO_ÅMD(I_EK,SISTE_YUFT) = OPPH_ÅM    *100;            
                 B02.OPPH_KODE   (I_EK,SISTE_YUFT) = 'A';                       
                 B02.UFØRPENS            (I_EK) = '';                           
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */                      
                 B02.YRKEPENS.GP         (I_EK) = 0;                            
                 B02.YRKEPENS.BT         (I_EK) = 0;                            
                 B02.YRKEPENS.TP         (I_EK) = 0;                            
 /* HL           B02.YRKEPENS.SPT        (I_EK) = 0       */                    
                 B02.YRKEPENS.YPT_KODE   (I_EK) = '';                           
                 TRANS_OPPL_OMR.BLANKETTYPE    = '24';/*FRA UP TIL P67*/        
                 IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                       
                   CALL BARNS_TILKNYTNINGSKODE_ENDRES(I_EK);                    
                                                                                
               END;                                                             
                                                                                
           END;  /** IF ALDER_PERSON_ÅM(I_EK) = 6700   **/                      
                                                                                
       ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/                  
                                                                                
         DO;                                                                    
            IF (ALDER_PERSON_ÅM(I_EK) = 7000  &                                 
                AUTODATO_ÅM           < 199100 )  !                             
               (ALDER_PERSON_ÅM(I_EK) = 7001  &                                 
               B01.STATUS.PENSJONSTYPE1(I_EK) ^= 'F' &                          
                AUTODATO_ÅM   > 199101 )     THEN                               
               DO;                                                              
                  TRANS_OPPL_OMR.BLANKETTYPE  = '26';/*P67=>P70*/               
                  IF B01.ALDERSP.KONV_P_KODE(I_EK) = 'F' THEN                   
                     B02.ALDERSP.KONV_P_KODE(I_EK) = ' ';                       
               END;                                                             
            ELSE                                                                
            IF  ALDER_PERSON_ÅM(I_EK) = 6501      THEN                          
              DO;                                                               
                IF B01.PENSJONSTYPE1(I_EK) = 'K'    &                           
                   B01.PENSJONSTYPE3(I_EK) = 'S'    &                           
                  (B01.UTTAKSDATO_ÅMD(I_EK) / 100) < AUTODATO_ÅM &              
                      AUTODATO_ÅM          > 199310  THEN                       
                   DO;                                                          
                      B02.STATUS.PENSJONSTYPE1(I_EK)  = 'K';                    
                      B02.STATUS.PENSJONSTYPE2(I_EK)  = 'N';                    
                      B02.STATUS.PENSJONSTYPE3(I_EK)  = 'S';                    
                      IF  B02.STATUS.PENSJONSTYPE2(I)  = 'S'   THEN             
                          B02.STATUS.PENSJONSTYPE2(I)  = 'P';                   
                      IF (B01.PENSJON_FØR_9802(I) ^= 'J') THEN                  
                          B02.EK_INNT_OVER_2G(I) = 'J';                         
                   END;                                                         
                ELSE                                                            
                IF B01.PENSJONSTYPE3(I_EK) = 'K'    &                           
                  (B01.PENSJONSTYPE2(I) = 'P'   !                               
                   B01.PENSJONSTYPE2(I) = 'N')  &                               
                   (B01.UTTAKSDATO_ÅMD(I_EK) / 100) < AUTODATO_ÅM &             
                     AUTODATO_ÅM        > 199801         THEN                   
                   DO;                                                          
                     IF (B01.PENSJON_FØR_9802(I) ^= 'J') THEN                   
                         B02.EK_INNT_OVER_2G(I) = 'J';                          
                   END;                                                         
              END;                                                              
                                                                                
            IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                            
               CALL BARN_18ÅR(I_EK);                                            
                                                                                
         END;                                                                   
                                                                                
 END ER_EK_65_67_70;                                                            
                                                                                
                                                                                
 FJERN_EKTEFELLE_TILLEGG:                                                       
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     SISTE_UFT  FIXED BIN(15),                                                  
     SISTE_YUFT FIXED BIN(15),                                                  
     I_EK       FIXED BIN(15),                                                  
     I          FIXED BIN(15);                                                  
                                                                                
     IF I_EK = 1 THEN                                                           
       DO;                                                                      
         SØKER_IND = 2;                                                         
         I         = 2;                                                         
       END;                                                                     
     ELSE                                                                       
       DO;                                                                      
         SØKER_IND = 1;                                                         
         I         = 1;                                                         
       END;                                                                     
                                                                                
     B02.STATUS.VIRK_DATO_ÅMD  (I)    = AUTODATO_ÅM*100;                        
                                                                                
     /* 240895 NÅR FORSØRGET EKTEFELLE OG AFP-NULLPENSJONIST */                 
     /* FYLLER 67 ÅR SAMME MND, MÅ DETTE GJØRES:             */                 
                                                                                
     IF  ALDER_PERSON_ÅM(I)  = 6701 &                                           
         AUTODATO_ÅM         > 199101 &                                         
         B01.STATUS.PENSJONSTYPE1(I)  ^= 'A' &                                  
         B01.STATUS.PENSJONSTYPE2(I)   = 'N' THEN                               
        DO;                                                                     
           CALL AFP_NULL_OPPHØRER (I,I_EK);                                     
           GOTO L100;                                                           
        END;                                                                    
     /*TRUDE 240895  */                                                         
                                                                                
                                                                                
                                                                                
     B02.STATUS.PENSJONSTYPE2(I   )   = 'S';                                    
                                                                                
     B02.STATUS.PENSJONSTYPE2(I_EK)   = 'S';                                    
     B02.RF0PERSN.TKNR       (I_EK)  =                                          
                              B01.RF0PERSN.TKNR (I);                            
     B02.STATUS.PENSJONSTYPE1(I_EK)   = 'A';                                    
     B02.STATUS.VIRK_DATO_ÅMD(I_EK)   =  AUTODATO_ÅM*100;                       
     B02.ALDERSP.KONV_P_KODE (I_EK)   = 'F';                                    
     B02.P67_KODE            (I_EK)   = '5';                                    
                                                                                
                                                                                
     DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I,J) > 0);                              
       IF B01.TILKN.FNR_TILKN(I,J) =                                            
          B01.RF0PERSN.FNR   (I_EK      ) THEN                                  
            DO;                                                                 
              B02.TILKN.TILKNYTNINGSKODE(I, J) = 'A';                           
              B02.TILKN.FT_FØR_91       (I,J)=' ';                              
              J = 13;                                                           
            END;                                                                
     END;                                                                       
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
     TRANS_OPPL_OMR.TRANSTYPE     = 28; /* FT UTGÅR */                          
                                                                                
     PIC11 = B01.RF0PERSN.FNR(I);                                               
     PIC13  = KONV_FNR11_FNR13(PIC11);                                          
                                                                                
       IF  (ALDER_PERSON_ÅM(I)  = 6700 &                                        
               AUTODATO_ÅM      < 199100 ) !                                    
           (ALDER_PERSON_ÅM(I)  = 6701 &                                        
            AUTODATO_ÅM         > 199101 ) !                                    
           (ALDER_PERSON_ÅM(I) >= 6700 &                                        
            ALDER_PERSON_ÅM(I) <  7000 &                                        
            AUTODATO_ÅM         = 197301)       !                               
           (ALDER_PERSON_ÅM(I)  = 7000 &                                        
            AUTODATO_ÅM         < 199100 &                                      
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')     !                           
           (ALDER_PERSON_ÅM(I)  = 7001 &                                        
            AUTODATO_ÅM         > 199101 &                                      
 /*HL*/     B01.STATUS.PENSJONSTYPE1(I) ^= 'F'  &                               
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')             THEN                
       DO;                                                                      
          IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'        THEN                    
             B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                               
                                                                                
  /*     B02.ALDERSP.APD          (I) = 100     23.1.90 HL */                   
            IF B02.TT_16_66(I) > 0           THEN                               
               B02.TT_16_66(I) = B02.TT_16_66(I)                                
                           + B02.TT_FRAMT     (I);                              
            ELSE                                                                
               B02.TT_ETTER_1966(I)                                             
                           = B02.TT_ETTER_1966(I)                               
                           + B02.TT_FRAMT     (I);                              
            B02.TT_FRAMT     (I) = 0;                                           
                                                                                
         IF B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                              
           DO;                                                                  
  /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */            
  /*          B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */            
  /*          B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */            
             IF AUTODATO_ÅM > 199201           &                                
                B02.PENSJONSTYPE2(I) ^= 'E'  &                                  
                B02.UFØRPENS.UFG (I)  < 100     THEN                            
                                                                                
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */            
                   B02.P67_KODE(I)       = '5';                                 
                   B02.SUM_YTELSE(I)     = 0;                                   
                END;                                                            
             ELSE                                                               
                TRANS_OPPL_OMR.TRANSTYPE     = 24; /* FRA UP TIL P67 */         
             B02.ALDERSP.KONV_P_KODE (I)  = 'U';                                
             B02.ALDERSP.UTTAKSDATO_ÅMD(I) = AUTODATO_ÅM*100;                   
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                
             SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                                 
             B02.OPPHØRSDATO_ÅMD(I,SISTE_UFT) = OPPH_ÅM    *100;                
             B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                             
             B02.UFØRPENS            (I) = '';                                  
                                                                                
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                   
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                                 
                  B01.RF0PERSN.FNR   (I         ) THEN                          
                    DO;                                                         
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';                 
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';                 
                      J = 13;                                                   
                    END;                                                        
             END;                                                               
                                                                                
             /**  FORSØRGEDE BARN   **/                                         
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                           
                                                                                
           END;                                                                 
                                                                                
         ELSE                                                                   
         IF B01.STATUS.PENSJONSTYPE1(I) = 'K' THEN                              
           DO;                                                                  
             TRANS_OPPL_OMR.TRANSTYPE     = 49; /*FRA AFP TIL P67 */            
             /*200102 : */                                                      
                     IF B01.PENSJONSTYPE3(I) = 'S'    !                         
                        B01.PENSJONSTYPE3(I) = 'K'      THEN                    
                        B02.ALDERSP.KONV_P_KODE (I)  = 'O';                     
                     ELSE                                                       
                        B02.ALDERSP.KONV_P_KODE (I)  = 'K';                     
 /*HL        B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM   */                    
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                
              B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);                       
              B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);                       
              B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);                       
                                                                                
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                   
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                                 
                  B01.RF0PERSN.FNR   (I         ) THEN                          
                    DO;                                                         
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';                 
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';                 
                      J = 13;                                                   
                    END;                                                        
             END;                                                               
           END;                                                                 
                                                                                
         ELSE IF B01.PENSJONSTYPE1(I) = 'Y' THEN                                
          DO;                                                                   
             IF AUTODATO_ÅM > 199201           &                                
                B02.PENSJONSTYPE2(I) ^= 'E'  &                                  
                B02.UFØRPENS.UFG (I)  < 100     THEN                            
                                                                                
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */            
                   B02.P67_KODE(I)       = '5';                                 
                   B02.SUM_YTELSE(I)     = 0;                                   
                END;                                                            
             ELSE                                                               
                TRANS_OPPL_OMR.BLANKETTYPE= '24';/*FRA UP TIL P67*/             
 /*         B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */              
 /*         B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */              
 /*         B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */              
            B02.ALDERSP.KONV_P_KODE (I)  = 'Y';                                 
            B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                 
            B02.ALDERSP.UTTAKSDATO_ÅMD(I)= AUTODATO_ÅM*100;                     
            SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                                  
            B02.OPPHØRSDATO_ÅMD(I,SISTE_UFT) = OPPH_ÅM    *100;                 
            B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                              
            SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                                
            B02.OPPH_DATO_ÅMD(I,SISTE_YUFT) = OPPH_ÅM    *100;                  
            B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                               
            B02.UFØRPENS            (I) = '';                                   
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */                      
            B02.YRKEPENS.GP         (I) = 0;                                    
            B02.YRKEPENS.BT         (I) = 0;                                    
            B02.YRKEPENS.TP         (I) = 0;                                    
 /*  HL     B02.YRKEPENS.SPT        (I) = 0          */                         
            B02.YRKEPENS.YPT_KODE   (I) = '';                                   
                                                                                
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                   
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                                 
                  B01.RF0PERSN.FNR   (I         ) THEN                          
                    DO;                                                         
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';                 
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';                 
                      J = 13;                                                   
                    END;                                                        
             END;                                                               
                                                                                
             /**  FORSØRGEDE BARN   **/                                         
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                           
                                                                                
           END;                                                                 
                                                                                
       END;  /** IF ALDER_PERSON_ÅM(I) = 6700   **/                             
                                                                                
     ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/                    
     DO;                                                                        
       IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                                    
          CALL BARN_18ÅR(I);                                                    
  /*   IF B01.PENSJONSTYPE1(I) = 'K'  &                                         
          B01.PENSJONSTYPE3(I) = 'K'     THEN                                   
       TRANS_OPPL_OMR.TRANSTYPE     = 80;           */                          
     END;                                                                       
  L100:                                                                         
                                                                                
 END FJERN_EKTEFELLE_TILLEGG;                                                   
                                                                                
                                                                                
 FORSØRGET_EK_BLIR_60ÅR :                                                       
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     SISTE_UFT  FIXED BIN(15),                                                  
     SISTE_YUFT  FIXED BIN(15),                                                 
     I_EK       FIXED BIN(15),                                                  
     I          FIXED BIN(15);                                                  
                                                                                
     IF I_EK = 1 THEN                                                           
       DO;                                                                      
         SØKER_IND = 2;                                                         
         I         = 2;                                                         
       END;                                                                     
     ELSE                                                                       
       DO;                                                                      
         SØKER_IND = 1;                                                         
         I         = 1;                                                         
       END;                                                                     
                                                                                
     B02.STATUS.VIRK_DATO_ÅMD  (I)  = AUTODATO_ÅM*100;                          
     B02.STATUS.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                          
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
     TRANS_OPPL_OMR.TRANSTYPE     = 6;                                          
                                                                                
     PIC11 = B01.RF0PERSN.FNR(I);                                               
     PIC13  = KONV_FNR11_FNR13(PIC11);                                          
                                                                                
       IF  (ALDER_PERSON_ÅM(I)  = 6700 &                                        
               AUTODATO_ÅM      < 199100  )  !                                  
           (ALDER_PERSON_ÅM(I)  = 6701 &                                        
            AUTODATO_ÅM         > 199101 ) !                                    
           (ALDER_PERSON_ÅM(I) >= 6700 &                                        
            ALDER_PERSON_ÅM(I) <  7000 &                                        
            AUTODATO_ÅM         = 197301 )     !                                
           (ALDER_PERSON_ÅM(I)  = 7000 &                                        
            AUTODATO_ÅM         < 199100 &                                      
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')      !                          
           (ALDER_PERSON_ÅM(I)  = 7001 &                                        
            AUTODATO_ÅM         > 199101 &                                      
            B01.STATUS.PENSJONSTYPE1(I) ^= 'F' &                                
            B01.STATUS.PENSJONSTYPE1(I) ^= 'A')             THEN                
       DO;                                                                      
          IF B02.UFØRPENS.VILKÅR_8_4_3A(I) = 'J'        THEN                    
             B02.STATUS.VILKÅR_8_4_3A(I)   = 'J';                               
                                                                                
 /*      B02.ALDERSP.APD          (I) = 100     - 23.1.90 HL */                 
                                                                                
 /*LOVENDRING 1.1.91 HL : */                                                    
                                                                                
         IF B02.TT_16_66(I) > 0                 THEN                            
            B02.TT_16_66(I) = B02.TT_16_66(I)                                   
                           + B02.TT_FRAMT     (I);                              
         ELSE                                                                   
            B02.TT_ETTER_1966(I) = B02.TT_ETTER_1966(I)                         
                           + B02.TT_FRAMT     (I);                              
         B02.TT_FRAMT     (I) = 0;                                              
                                                                                
         IF B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                              
           DO;                                                                  
             IF AUTODATO_ÅM > 199201           &                                
                B02.PENSJONSTYPE2(I) ^= 'E'  &                                  
                B02.UFØRPENS.UFG (I)  < 100     THEN                            
                                                                                
                DO;                                                             
                   B02.P67_KODE(I)      = '5';                                  
                   B02.SUM_YTELSE(I)     = 0;                                   
                   TRANS_OPPL_OMR.TRANSTYPE = 74;  /* NULLPENSJON */            
                END;                                                            
             ELSE                                                               
                TRANS_OPPL_OMR.TRANSTYPE     = 24; /* FRA UP TIL P67 */         
 /*          B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */             
 /*          B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */             
 /*          B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */             
             B02.ALDERSP.KONV_P_KODE (I)  = 'U';                                
             B02.ALDERSP.UTTAKSDATO_ÅMD(I) = AUTODATO_ÅM*100;                   
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                
             SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                                 
             B02.OPPHØRSDATO_ÅMD(I,SISTE_UFT) =OPPH_ÅM    *100;                 
             B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                             
             B02.UFØRPENS            (I) = '';                                  
                                                                                
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                   
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                                 
                  B01.RF0PERSN.FNR   (I         ) THEN                          
                    DO;                                                         
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';                 
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';                 
                      J = 13;                                                   
                    END;                                                        
             END;                                                               
                                                                                
             /**  FORSØRGEDE BARN   **/                                         
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                           
                                                                                
           END;                                                                 
                                                                                
   ELSE                                                                         
         IF B01.STATUS.PENSJONSTYPE1(I) = 'K' THEN                              
           DO;                                                                  
             TRANS_OPPL_OMR.TRANSTYPE     = 49; /*FRA AFP TIL P67 */            
             /*200102 : */                                                      
                     IF B01.PENSJONSTYPE3(I) = 'S'    !                         
                        B01.PENSJONSTYPE3(I) = 'K'      THEN                    
                        B02.ALDERSP.KONV_P_KODE (I)  = 'O';                     
                     ELSE                                                       
                        B02.ALDERSP.KONV_P_KODE (I)  = 'K';                     
 /*HL        B02.ALDERSP.UTTAKSDATO_ÅM(I) = AUTODATO_ÅM  */                     
             B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                
              B02.ALDERSP.VT_SPT(I) = B02.ALDERSP.SPT(I);                       
              B02.ALDERSP.VT_OPT(I) = B02.ALDERSP.OPT(I);                       
              B02.ALDERSP.VT_PÅ (I) = B02.ALDERSP.PÅ (I);                       
                                                                                
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                   
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                                 
                  B01.RF0PERSN.FNR   (I         ) THEN                          
                    DO;                                                         
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';                 
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';                 
                      J = 13;                                                   
                    END;                                                        
             END;                                                               
           END;                                                                 
                                                                                
         ELSE IF B01.PENSJONSTYPE1(I) = 'Y' THEN                                
          DO;                                                                   
 /*         B02.ALDERSP.SPT_1291(I) = B01.UFØRPENS.SPT_1291(I); */              
 /*         B02.ALDERSP.OPT_1291(I) = B01.UFØRPENS.OPT_1291(I); */              
 /*         B02.ALDERSP.PÅ_1291 (I) = B01.UFØRPENS.PÅ_1291 (I); */              
            IF B02.UFØRPENS.UFG(I)      < 100          THEN                     
               B02.P67_KODE(I)         = '5';                                   
            B02.SUM_YTELSE(I)     = 0;                                          
            B02.ALDERSP.KONV_P_KODE (I)  = 'Y';                                 
            B02.STATUS.PENSJONSTYPE1(I)  = 'A';                                 
            B02.ALDERSP.UTTAKSDATO_ÅMD(I)= AUTODATO_ÅM*100;                     
            SISTE_UFT = FINNE_SISTE_UFT_ÅM(I);                                  
            B02.OPPHØRSDATO_ÅMD(I,SISTE_UFT) = OPPH_ÅM    *100;                 
            B02.OPPHØRSKODE   (I,SISTE_UFT) = 'A';                              
            SISTE_YUFT = FINNE_SISTE_YUFT_ÅM(I);                                
            B02.OPPH_DATO_ÅMD(I,SISTE_YUFT) = OPPH_ÅM    *100;                  
            B02.OPPH_KODE   (I,SISTE_YUFT) = 'A';                               
            B02.UFØRPENS            (I) = '';                                   
 /*YS  VI SKAL BEHOLDE YRKEPENS.YUG OG YPT              */                      
            B02.YRKEPENS.GP         (I) = 0;                                    
            B02.YRKEPENS.BT         (I) = 0;                                    
            B02.YRKEPENS.TP         (I) = 0;                                    
 /* HL      B02.YRKEPENS.SPT        (I) = 0                */                   
            B02.YRKEPENS.YPT_KODE   (I) = '';                                   
            TRANS_OPPL_OMR.BLANKETTYPE= '24';/*FRA UP TIL P67*/                 
                                                                                
             DO J = 1 TO 13 WHILE(B01.FNR_TILKN(I_EK,J) > 0);                   
               IF B01.TILKN.FNR_TILKN(I_EK,J) =                                 
                  B01.RF0PERSN.FNR   (I         ) THEN                          
                    DO;                                                         
                      B02.TILKN.TILKNYTNINGSKODE(I_EK,J) = 'A';                 
                      B02.TILKN.FT_FØR_91       (I_EK,J) = ' ';                 
                      J = 13;                                                   
                    END;                                                        
             END;                                                               
                                                                                
             /**  FORSØRGEDE BARN   **/                                         
             IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                              
               CALL BARNS_TILKNYTNINGSKODE_ENDRES(I);                           
                                                                                
           END;                                                                 
                                                                                
                                                                                
       END;  /** IF ALDER_PERSON_ÅM(I) = 6700   **/                             
                                                                                
     ELSE  /** EKTEFELLEN FYLLER IKKE 67 ÅR DENNE MÅNED  **/                    
       IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                                    
          CALL BARN_18ÅR(I);                                                    
                                                                                
                                                                                
 END FORSØRGET_EK_BLIR_60ÅR;                                                    
                                                                                
                                                                                
 UNG_UFØR :                                                                     
    PROC;                                                                       
                                                                                
 /* MAN KOMMER HIT MED BUP_GAR_KODE = 'A' ELLER 'D';   */                       
 /* 'A' ER EN SOM FÅR TP VED FYLTE 20 ÅR               */                       
 /* 'D' ER EN SOM VENTER PÅ Å FÅ EN ELLER ANNEN GARANTI*/                       
                                                                                
 DCL   ALDER_UF                    PIC 'S99999';                                
                                                                                
        W_FNR11        = B02.RF0PERSN.FNR(I);                                   
        W_FNR13        = KONV_FNR11_FNR13(W_FNR11);                             
        W_FNR_ÅM       = FNR_R.ÅR*100+FNR_R.MND;                                
        ALDER_UF       = B02.UFT_ÅMD(I,1)/100 - W_FNR_ÅM;                       
                                                                                
         IF (ALDER_PERSON_ÅM(I) = 2000  &                                       
             AUTODATO_ÅM        < 199100  &                                     
             B01.PENSJONSTYPE1(I) = 'Y' )     !                                 
            (ALDER_PERSON_ÅM(I) = 2001  &                                       
             AUTODATO_ÅM        > 199101  &                                     
             B01.PENSJONSTYPE1(I) = 'Y' )    THEN                               
                                                                                
                DO;                                                             
                                                                                
     /** FINNE SISTE UTFYLTE YRKEHIST-SEGMENT **/                               
                                                                                
                   DO J = 1 TO 10 UNTIL                                         
                     (B01.YRKEHIST.OPPH_DATO_ÅMD(I,J) = 0);                     
                   END;                                                         
                                                                                
                   IF B02.YRKE11(I,J)        = 'V'        THEN                  
                      B02.PAÅ(I,J)           = 2;                               
                                                                                
                END;                                                            
                                                                                
         ELSE;                                                                  
                                                                                
                                                                                
         IF B02.BUP_GAR_KODE(I,1) = 'A'        THEN                             
            IF (ALDER_PERSON_ÅM(I) = 2000   &                                   
                 AUTODATO_ÅM > 198104         )    !                            
               (ALDER_PERSON_ÅM(I) > 2000   &           /*9709 HL*/             
                 AUTODATO_ÅM = 198105         )    THEN                         
                                                                                
                DO;                                                             
                   IF AUTODATO_ÅM > 198804    THEN                              
                     IF AUTODATO_ÅM < 199105    THEN                            
                        GARANTI_BUP = 3.00;                                     
                     ELSE                                                       
                     IF AUTODATO_ÅM < 200805    THEN                            
                        GARANTI_BUP = 3.30;                                     
                     ELSE                                                       
                        GARANTI_BUP = 3.50;                                     
                   ELSE                                                         
                   IF AUTODATO_ÅM > 198704    THEN                              
                        GARANTI_BUP = 2.50;                                     
                   ELSE                                                         
                        GARANTI_BUP = 2.00;                                     
                   K = 1;                                                       
                   DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                     
                      B02.BUP_GAR_KODE(I,K) = 'B';                              
                      B02.BUP_GARANTI(I,K) = GARANTI_BUP;                       
                      K = K + 1;                                                
                   END;                                                         
                                                                                
                   CALL FØDT_UFØR(FAMILIE_IND);                                 
                                                                                
                   TRANS_OPPL_OMR.TRANSTYPE     = 31;                           
  /*31 = FØDT UFØR FYLLER 20 ÅR, ELLER ER 20 OG PASSERER DATOEN 8105*/          
                   HENDELSE_IND = JA;                                           
                   SØKER_IND = I;                                               
                   I = I + 1;                                                   
                                                                                
                END;                                                            
                                                                                
              ELSE; /* ALDER = 20       */                                      
                                                                                
         ELSE                                                                   
         IF AUTODATO_ÅM = 198105       THEN                                     
            DO;                                                                 
               IF FNR_R.ÅR > 1946  &                                            
                  ALDER_UF < 2001             THEN                              
                  DO;                                                           
                     K = 1;                                                     
                     DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                   
                        B02.BUP_GAR_KODE(I,K) = 'B';                            
                        B02.BUP_GARANTI(I,K) = 2.00;                            
                        K = K + 1;                                              
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 31;                         
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
                                                                                
            END;                                                                
         ELSE                                                                   
         IF AUTODATO_ÅM = 198401       THEN                                     
            DO;                                                                 
               IF FNR_R.ÅR > 1945  &                                            
                  ALDER_UF < 2101             THEN                              
                  DO;                                                           
                     K = 1;                                                     
                     DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                   
                        B02.BUP_GAR_KODE(I,K) = 'B';                            
                        B02.BUP_GARANTI(I,K) = 2.00;                            
                        K = K + 1;                                              
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/                
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
                                                                                
            END;                                                                
         ELSE                                                                   
         IF AUTODATO_ÅM = 198901       THEN                                     
            DO;                                                                 
               IF FNR_R.ÅR > 1944  &                                            
                  ALDER_UF < 2201             THEN                              
                  DO;                                                           
                     K = 1;                                                     
                     DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                   
                        B02.BUP_GAR_KODE(I,K) = 'B';                            
                        B02.BUP_GARANTI(I,K) = 3.00;                            
                        K = K + 1;                                              
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/                
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
                                                                                
            END;                                                                
         ELSE                                                                   
         IF AUTODATO_ÅM = 198907       THEN                                     
            DO;                                                                 
               IF FNR_R.ÅR > 1922  &                                            
                  FNR_R.ÅR < 1945  &                                            
                  ALDER_UF < 2201             THEN                              
                  DO;                                                           
                     K = 1;                                                     
                     DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                   
                        B02.BUP_GAR_KODE(I,K) = 'E';                            
                        K = K + 1;                                              
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                                                                                
                     TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/                
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
                                                                                
            END;                                                                
         ELSE                                                                   
         IF AUTODATO_ÅM = 199205       THEN                                     
            DO;                                                                 
               IF FNR_R.ÅR > 1925     &                                         
                  FNR_R.ÅR < 1943     &                                         
                  ALDER_UF < 2401                THEN                           
                                                                                
                  DO;                                                           
                     K = 1;                                                     
                     DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                   
                        B02.BUP_GAR_KODE(I,K) = 'E';                            
                        K = K + 1;                                              
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                     TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/                
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     I = I + 1;                                                 
                                                                                
                  END;                                                          
               ELSE          /*9708 HL*/                                        
               IF FNR_R.ÅR > 1942     &                                         
                  ALDER_UF < 2401                THEN                           
                  DO;                                                           
                     K = 1;                                                     
                     DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);                   
                        B02.BUP_GAR_KODE(I,K) = 'B';                            
                        B02.BUP_GARANTI(I,K) = 3.30;                            
                        K = K + 1;                                              
                     END;                                                       
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                     TRANS_OPPL_OMR.TRANSTYPE     = 31; /*FRA 7*/               
                     DIV_PARAM_OMR.INTENDR_ÅR = 1992;  /*200205*/               
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     IF B02.BUP_GAR_KODE((3-I),1) ^= 'D'  THEN                  
                        I = I + 1;                                              
                  END;                                                          
            END;                                                                
         ELSE                                                                   
 /*9708 HL*/                                                                    
         IF (AUTODATO_ÅM = 199707     !                                         
             AUTODATO_ÅM = 200805  )    THEN                                    
            DO;                                                                 
               IF ALDER_UF < 2601         THEN                                  
                                                                                
                  DO;                                                           
                     IF ÅR > 1940             THEN                              
                        DO;                                                     
                           K = 1;                                               
                           DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);             
                              B02.BUP_GAR_KODE(I,K) = 'B';                      
                              IF  AUTODATO_ÅM = 199707   THEN                   
                                  B02.BUP_GARANTI(I,K) = 3.30;                  
                              ELSE                                              
                                  B02.BUP_GARANTI(I,K) = 3.50;                  
                              K = K + 1;                                        
                           END;                                                 
                           B02.STATUS.TP_GAR_KODE(I) = ' ';                     
                        END;                                                    
                     ELSE                                                       
                        DO;                                                     
                           K = 1;                                               
                           DO WHILE(B02.UFØRHIST.UFT_ÅMD(I,K) > 0);             
                              B02.BUP_GAR_KODE(I,K) = 'E';                      
                              K = K + 1;                                        
                           END;                                                 
                        END;                                                    
                     CALL FØDT_UFØR(FAMILIE_IND);                               
                     TRANS_OPPL_OMR.TRANSTYPE     = 31; /*9811*/                
                     DIV_PARAM_OMR.INTENDR_ÅR = 1992;  /*200205*/               
                     HENDELSE_IND = JA;                                         
                     SØKER_IND = I;                                             
                     IF B02.BUP_GAR_KODE((3-I),1) ^= 'D'  THEN                  
                        I = I + 1;                                              
                  END;                                                          
            END;                                                                
                                                                                
 END UNG_UFØR;                                                                  
                                                                                
                                                                                
 FØDT_UFØR:                                                                     
   PROC(I_EK);                                                                  
                                                                                
   DCL                                                                          
     I_EK           FIXED BIN(15),                                              
     SISTE_BUP_EK   FIXED BIN(15);                                              
                                                                                
     IF I = 1 THEN                                                              
       I_EK = 2;                                                                
     ELSE                                                                       
       I_EK = 1;                                                                
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
  /* IKKE NY STATUS NÅR SAKEN ER REGISTRERT UNDER 'IKKE'  */                    
  /* DETTE ER EN HJELP UNDER REKONSTRUKSJON AV SAKER - SOM*/                    
  /* ELLERS IKKE LAR SEG REKONSTRUERE. HL 200305          */                    
     IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2,1) = 'I'  THEN;                         
     ELSE                                                                       
        B02.STATUS.VIRK_DATO_ÅMD (I)    = AUTODATO_ÅM*100;                      
     B02.FØRSTE_GANG_REG      (I)    = 'N';                                     
                                                                                
     IF B01.RF0PERSN.FNR(I_EK) > 0 THEN                                         
       DO;                                                                      
         FNR_EK = B01.RF0PERSN.FNR(I_EK);                                       
         IF B02.PENSJONSTYPE1(I_EK) ^= 'D'         THEN /*0300*/                
         B02.STATUS.VIRK_DATO_ÅMD(I_EK) =                                       
                B02.STATUS.VIRK_DATO_ÅMD(I);                                    
                                                                                
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR EK   **/                     
                                                                                
    /*0697 HL:*/                                                                
         DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE                    
                                      (I_EK,J) ^= ' ');                         
           SISTE_BUP_EK = J;                                                    
         END;                                                                   
                                                                                
         IF B01.STATUS.PENSJONSTYPE1(I_EK)  = 'U'    !                          
            B01.STATUS.PENSJONSTYPE1(I_EK)  = 'Y' THEN                          
           DO;                                                                  
                                                                                
             IF AUTODATO_ÅM > 198804   &                                        
                                                                                
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) > 0 THEN            
                                                                                
               IF AUTODATO_ÅM < 199105   THEN                                   
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.00;            
               ELSE                                                             
               IF AUTODATO_ÅM < 200805   THEN                                   
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.30;            
               ELSE                                                             
               IF FNR_ÅR_EK > 40   THEN                                         
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.50;            
               ELSE                                                             
                 B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.30;            
                                                                                
             ELSE IF AUTODATO_ÅM > 198704   &                                   
                                                                                
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) > 0 THEN            
                                                                                
                B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.50;             
                                                                                
 /*HIT 16.2.88 HL  */                                                           
                                                                                
                                                                                
             IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                           
               CALL BARN_18ÅR(I_EK);                                            
                                                                                
                                                                                
           END;                                                                 
                                                                                
       END;                                                                     
                                                                                
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                                      
        CALL BARN_18ÅR(I);                                                      
                                                                                
 END FØDT_UFØR;                                                                 
                                                                                
                                                                                
 FØDT_UFØR_BARN:                                                                
   PROC;                                                                        
                                                                                
     TRANSTYPE2 = 31;                                                           
     B02.STATUS.VIRK_DATO_ÅMD  (I)    = AUTODATO_ÅM*100;                        
     B02.BUP_GAR_KODE(I,BUP_SISTE) = 'B';                                       
     UFØR_BARN_IND = I;                                                         
                                                                                
 END FØDT_UFØR_BARN;                                                            
                                                                                
                                                                                
 FJERN_BARNEPENSJON:                                                            
   PROC(BARN_IND,MF_IND);                                                       
                                                                                
     /** RUTINEN SKILLER IKKE PÅ FJERNING VED 20 OG 18 ÅR           **/         
        /** HELLER IKKE PÅ FJERNING VED 21 ÅR                       **/         
     /** BARN_IND ER INDEKSEN PÅ DET BARN DET ER OPPHØR FOR.        **/         
     /** SØKER_IND ER INDEKSEN FOR DEN TRANSEN DET GJELDER.         **/         
     /** MF_IND ER INDEKSEN FOR AVDØD MOR ELLER FAR.                **/         
     /** UFØR_BARN_IND SETTES BARE VED SPLITTING AV FAMILIE, SLIK   **/         
     /** AT BEREGNING KAN KALLES OPP TO GANGER FRA STYRINGSRUTINEN. **/         
                                                                                
   DCL                                                                          
     BARN_IND     FIXED BIN(15),                                                
     IND          FIXED BIN(15),                                                
     MF_IND       FIXED BIN(15);                                                
                                                                                
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = AUTODATO_ÅM*100;                        
                                                                                
     B02.ETTEBARN         (BARN_IND)   = '';                                    
     B02.STATUS.SUM_YTELSE(BARN_IND)   = 0;                                     
                                                                                
     DO IND = 1 TO 14 UNTIL(B01.FNR(IND) =                                      
                            B01.TILKN.FNR_TILKN(BARN_IND,1));                   
     END;                                                                       
                                                                                
         DO J = 3 TO 14 UNTIL(B01.STATUS.PENSJONSTYPE2(J) = 'P');               
                                                                                
              /*   P ANGIR AT DETTE ER YNGSTE BARN I KULLET */                  
                                                                                
         END;                                                                   
                                                                                
         SØKER_IND = J;                                                         
                                                                                
     IF B01.STATUS.ANTALL_BARN(SØKER_IND) = 1 THEN /*IKKE FLERE BARN*/          
       DO;                                                                      
         TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(BARN_IND);             
                                                                                
         /** TILKN - SEGMENT FOR BARNET FJERNES HOS TILKNYTTEDE     **/         
         /** FORELDRE                                               **/         
                                                                                
                                                                                
         IF B01.RF0PERSN.FNR (1) > 0 THEN                                       
            CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,1);                        
                                                                                
         IF B01.RF0PERSN.FNR (2) > 0 THEN                                       
            CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,2);                        
                                                                                
         IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN                      
           DO;                                                                  
             CALL UFØR_BARN(BARN_IND);                                          
             TRANSTYPE2 = 0;                                                    
             TRANS_OPPL_OMR.TRANSTYPE = 42; /* UFØR BARN FYLLER 18/20*/         
           END;                                                                 
         ELSE                                                                   
           DO;                                                                  
             B02.STATUS.STATUS_KODE_HIST(BARN_IND)   = 'O';                     
          B02.STATUS.VIRK_DATO_ÅMD(BARN_IND) = AUTODATO_ÅM*100;                 
             TRANS_OPPL_OMR.TRANSTYPE = 58;/*BP UTEN SØSKEN FYLLER ÅR*/         
           END;                                                                 
                                                                                
       END;   /**    IF B01.STATUS.ANTALL_BARN(BARN_IND) = 1  **/               
                                                                                
     ELSE     /** FLERE ENN ETT BARN   **/                                      
                                                                                
       DO;                                                                      
         IF B01.STATUS.PENSJONSTYPE2(BARN_IND)  = 'P'  THEN                     
                                                                                
                     /** YNGSTE BARN OPPHØRER    **/                            
           DO;                                                                  
             TRANS_OPPL_OMR.TRANSTYPE = 58;/*BP UTEN SØSKEN OPPHØRER*/          
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.                          
                                         FNR(SØKER_IND);                        
                                                                                
             /** TILKN - SEGMENT FOR BARNET FJERNES HOS TILKNYTTEDE  **/        
             /** FORELDRE                                            **/        
                                                                                
             IF B01.RF0PERSN.FNR (1) > 0 THEN                                   
                CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,1);                    
                                                                                
             IF B01.RF0PERSN.FNR (2) > 0 THEN                                   
                CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,2);                    
                                                                                
        B02.STATUS.VIRK_DATO_ÅMD(BARN_IND) =AUTODATO_ÅM*100;                    
                                                                                
             IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN                  
               DO;           /** SPLITTING AV FAMILIE  **/                      
                 TRANS_OPPL_OMR.TRANSTYPE = 0;                                  
                 UFØR_BARN_IND = BARN_IND;                                      
                 CALL UFØR_BARN(BARN_IND);                                      
               END;                                                             
             ELSE                                                               
               B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';                     
                                                                                
             DO J = BARN_IND  + 1 TO  MAX_BARN - 1;                             
                IF B01.STATUS.PENSJONSTYPE2(J)  = 'Ø' THEN                      
                   /* 'Ø' = BARNET ER IKKE YNGSTE BARN */                       
                   DO;                                                          
                      CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,J);              
                      B02.ETTEBARN            (J) = '';                         
                      B02.STATUS.SUM_YTELSE   (J) = 0;                          
                      B02.STATUS.VIRK_DATO_ÅMD(J) =AUTODATO_ÅM*100;             
                                                                                
                      IF B01.STATUS.PENSJONSTYPE3(J)  = 'U' THEN                
                         DO;           /** SPLITTING AV FAMILIE  **/            
                            UFØR_BARN_IND = J;                                  
                            CALL UFØR_BARN(J);   /**  (J       )   **/          
                         END;                                                   
                      ELSE                                                      
                         B02.STATUS.STATUS_KODE_HIST(J) = 'O';                  
                   END;                                                         
                                                                                
             END;                                                               
                                                                                
             I = MAX_BARN; /*** NB! NB! FOR å IKKE BEHANDLE BARNA **/           
                           /*** PåNYTT FRA HOVEDLOOP              **/           
                                                                                
           END;   /** IF B01.STATUS.PENSJONSTYPE2(BARN_IND)  = P   */           
                                                                                
         ELSE   /** BARN SOM UTGÅR ER IKKE YNGSTE BARN   **/                    
                                                                                
           DO;                                                                  
             B02.STATUS.ANTALL_BARN(SØKER_IND) =                                
                           B02.STATUS.ANTALL_BARN(SØKER_IND) - 1;               
                                             /*2000: */                         
             B02.STATUS.VIRK_DATO_ÅMD(SØKER_IND) = AUTODATO_ÅM*100;             
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR                       
                                                   (SØKER_IND);                 
             TRANS_OPPL_OMR.TRANSTYPE = 29;                                     
               /* 29 = BP OPPHØRER, DET ER SØSKEN TILBAKE */                    
                                                                                
           LOOP:                                                                
             DO J = 1 TO 13;                                                    
    /* FEIL VED TVILLINGER - 20080519 - HL : */                                 
    /*         IF B01.TILKN.FNR_TILKN(SØKER_IND,J) =  */                        
               IF B02.TILKN.FNR_TILKN(SØKER_IND,J) =                            
                               B01.RF0PERSN.FNR(BARN_IND) THEN                  
                 DO;                                                            
                   DO K = J TO 12;                                              
                     B02.TILKN (SØKER_IND,K) =                                  
                            B02.TILKN (SØKER_IND,K + 1);                        
                   END;                                                         
                   B02.TILKN (SØKER_IND,13) = '';                               
                   LEAVE LOOP;                                                  
                 END;                                                           
                                                                                
             END;    /**  DO J = 1 TO 13  **/                                   
                                                                                
                                                                                
             DO J = 1 TO 13 UNTIL(B02.TILKN.                                    
                        TILKNYTNINGSKODE(SØKER_IND,J) = 'D');                   
                                                                                
               IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,J) = 'D' THEN            
                 DO;                                                            
                   PIC11 = B01.TILKN.FNR_TILKN(SØKER_IND,J);                    
                   IF F_KJØNN(PIC11) = 'K' THEN                                 
                     MF_IND = 1;                                                
                   ELSE                                                         
                     MF_IND = 2;                                                
                 END;                                                           
                                                                                
             END;    /**  DO J = 1 TO 13 UNTIL(B02.TILKN **/                    
                                                                                
             IF B01.STATUS.PENSJONSTYPE3(BARN_IND)  = 'U' THEN                  
               DO;           /** SPLITTING AV FAMILIE  **/                      
                 UFØR_BARN_IND = BARN_IND;                                      
                 TRANS_OPPL_OMR.TRANSTYPE = 0;                                  
                 CALL UFØR_BARN(BARN_IND);   /**  (BARN_IND)   **/              
               END;                                                             
             ELSE                                                               
               DO;                                                              
                  DO J = 1 TO 13;                                               
                     B02.TILKN(BARN_IND,J)             = '';                    
                  END;                                                          
                  B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';                  
                  B02.STATUS.VIRK_DATO_ÅMD   (BARN_IND) =                       
                                          AUTODATO_ÅM*100;                      
               END;                                                             
                                                                                
             DO J = 3 TO MAX_BARN - 1;        /*2000: */                        
                B02.STATUS.VIRK_DATO_ÅMD  (J) = AUTODATO_ÅM*100;                
             END;                                                               
                                                                                
           END;  /** DO FOR ELSE  BARN SOM UTGÅR ER IKKE YNGSTE BARN **/        
                                                                                
       END;   /**  DO FOR ELSE FLERE ENN ETT BARN   **/                         
                                                                                
                                                                                
 END FJERN_BARNEPENSJON;                                                        
                                                                                
                                                                                
 UFØR_BARN:                                                                     
   PROC(BARN_IND);                                                              
                                                                                
     /** UFØR BARN ENDRES TIL REN UFØR                      **/                 
     /** TRANS DANNES IKKE HER, MEN I OVERLIGGENDE RUTINE   **/                 
                                                                                
   DCL                                                                          
     BARN_IND     FIXED BIN(15);                                                
                                                                                
     B02.STATUS.PENSJONSTYPE1  (BARN_IND) = 'U';                                
     B02.STATUS.PENSJONSTYPE2  (BARN_IND) = 'P';                                
     B02.STATUS.PENSJONSTYPE3  (BARN_IND) = ' ';                                
     B02.STATUS.ANTALL_BARN    (BARN_IND) =  0;                                 
                                                                                
     DO J = 1 TO 13;                                                            
       B02.TILKN.FNR_TILKN       (BARN_IND,J) = 0;                              
       B02.TILKN.TILKNYTNINGSKODE(BARN_IND,J) = ' ';                            
     END;                                                                       
                                                                                
     TRANSTYPE2 = 42; /* UFØR BARN FYLLER 18/20 ÅR */                           
                                                                                
 END UFØR_BARN;                                                                 
                                                                                
                                                                                
 FJERN_BARNETILLEGG:                                                            
   PROC(BARN_IND,I,I_EK);                                                       
                                                                                
   DCL                                                                          
     BARN_IND       FIXED BIN(15),                                              
     I              FIXED BIN(15),                                              
     I_EK           FIXED BIN(15);                                              
                                                                                
     IF B01.RF0PERSN.FNR(1) = B01.TILKN.FNR_TILKN(BARN_IND,1) THEN              
       DO;                                                                      
         I    = 1;                                                              
         I_EK = 2;                                                              
       END;                                                                     
     ELSE                                                                       
       DO;                                                                      
         I    = 2;                                                              
         I_EK = 1;                                                              
       END;                                                                     
  /* IKKE NY STATUS NÅR SAKEN ER REGISTRERT UNDER 'IKKE'  */                    
  /* DETTE ER EN HJELP UNDER REKONSTRUKSJON AV SAKER - SOM*/                    
  /* ELLERS IKKE LAR SEG REKONSTRUERE. HL 200305          */                    
     IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2,1) = 'I'  THEN;                         
     ELSE                                                                       
        B02.STATUS.VIRK_DATO_ÅMD  (I) = AUTODATO_ÅM*100;                        
     IF B01.STATUS.PENSJONSTYPE1(I_EK)  ^= ' ' THEN                             
       DO;                                                                      
         IF B01.STATUS_KODE_HIST(I_EK)  = ' ' THEN                              
                                                                                
 /*      B02.STATUS.VIRK_DATO_ÅMD  (I_EK) = AUTODATO_ÅM*100;  */                
         B02.STATUS.VIRK_DATO_ÅMD  (I_EK) =                                     
             B02.STATUS.VIRK_DATO_ÅMD  (I);                                     
       END;                                                                     
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD  =                                        
                                 AUTODATO_ÅM*100;                               
     IF B01.GARANTITILLEGG_BARN   (I)  = 0               &                      
        B01.GARANTITILLEGG_SÆRBARN(I)  = 0               &                      
        B01.BT_SÆRBARN            (I)  = 0               &                      
        B01.ALDERSP.BT            (I)  = 0               &                      
        B01.UFØRPENS.BT           (I)  = 0               &                      
        B01.YRKEPENS.BT           (I)  = 0            THEN                      
                                                                                
        DO;                                                                     
             IF  TRANS_OPPL_OMR.TRANSTYPE  = 0 THEN                             
                 TRANS_OPPL_OMR.TRANSTYPE = 70; /* IKKE BREV   */               
        END;                                                                    
     ELSE                                                                       
        TRANS_OPPL_OMR.TRANSTYPE = 28; /* FT OPPHØRER */                        
                                                                                
     IF B01.STATUS.ANTALL_BARN(I)  > 0 THEN                                     
        CALL BARN_18ÅR(I);                                                      
                                                                                
     IF B01.STATUS.ANTALL_BARN(I_EK)  > 0 THEN                                  
        CALL BARN_18ÅR(I_EK);                                                   
                                                                                
 END FJERN_BARNETILLEGG;                                                        
                                                                                
                                                                                
 BARN_18ÅR:                                                                     
   PROC(I);                                                                     
   DCL                                                                          
     BARN_IND       FIXED BIN(15),                                              
     I              FIXED BIN(15);                                              
                                                                                
     DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);                       
       IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'L'     !                           
  /*HL*/  B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'     !                           
          B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W'    THEN                         
         DO;                                                                    
           DO BARN_IND = 3 TO 14 UNTIL(B01.RF0PERSN.FNR(BARN_IND) =             
                                    B01.TILKN.FNR_TILKN(I,J));                  
           END;                                                                 
                                                                                
           IF ALDER_PERSON_ÅM(BARN_IND) = 1801 THEN                             
             DO;                                                                
               B02.STATUS.STATUS_KODE_HIST(BARN_IND)   = 'O';                   
  /*VIRK SKAL BARE ENDRES HVIS FORSØRGER ENDRER VIRK - 200305 HL : */           
               B02.STATUS.VIRK_DATO_ÅMD   (BARN_IND)   =                        
                   B02.STATUS.VIRK_DATO_ÅMD   (I);                              
    /*                                    AUTODATO_ÅM*100;   */                 
               CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,I);                     
                                                                                
               B02.STATUS.ANTALL_BARN(I) =                                      
                            B02.STATUS.ANTALL_BARN(I) - 1;                      
                                                                                
             END;                                                               
           ELSE                                                                 
             B02.STATUS.VIRK_DATO_ÅMD  (BARN_IND) =                             
                   B02.STATUS.VIRK_DATO_ÅMD   (I);                              
  /*VIRK SKAL BARE ENDRES HVIS FORSØRGER ENDRER VIRK - 200305 HL   */           
    /*                                    AUTODATO_ÅM*100;   */                 
         END;                                                                   
     END;        /**    DO J = 1 TO 13      **/                                 
                                                                                
 END BARN_18ÅR;                                                                 
                                                                                
                                                                                
 BARNS_TILKNYTNINGSKODE_ENDRES:                                                 
   PROC(I);                                                                     
   DCL                                                                          
     BARN_IND       FIXED BIN(15),                                              
     I              FIXED BIN(15);                                              
                                                                                
     DO J = 1 TO 13 WHILE (B01.TILKN.FNR_TILKN(I,J) > 0);                       
       IF B01.TILKN.TILKNYTNINGSKODE(I,J) = 'L'    !                            
 /*HL*/   B01.TILKN.TILKNYTNINGSKODE(I,J) = 'V'    !                            
          B01.TILKN.TILKNYTNINGSKODE(I,J) = 'W'   THEN                          
         DO;                                                                    
           DO BARN_IND = 3 TO 14 UNTIL(B01.RF0PERSN.FNR(BARN_IND) =             
                                    B01.TILKN.FNR_TILKN(I,J));                  
           END;                                                                 
                                                                                
           IF ALDER_PERSON_ÅM(BARN_IND) = 1801 THEN                             
             DO;                                                                
               B02.STATUS.STATUS_KODE_HIST(BARN_IND) = 'O';                     
  /*VIRK SKAL BARE ENDRES HVIS FORSØRGER ENDRER VIRK - 200305 HL : */           
               B02.STATUS.VIRK_DATO_ÅMD   (BARN_IND) =                          
                  B02.STATUS.VIRK_DATO_ÅMD (I);                                 
      /*                                     AUTODATO_ÅM*100;  */               
               B02.STATUS.ANTALL_BARN(I) =                                      
                            B02.STATUS.ANTALL_BARN(I) - 1;                      
               CALL OPPHØR_KOBLING_TO_PERSONER(BARN_IND,I);                     
             END;                                                               
           ELSE                                                                 
             DO;                                                                
               B02.TILKN.TILKNYTNINGSKODE(BARN_IND,1) = 'A';                    
  /*VIRK SKAL BARE ENDRES HVIS FORSØRGER ENDRER VIRK - 200305 HL : */           
               B02.STATUS.VIRK_DATO_ÅMD  (BARN_IND) =                           
                  B02.STATUS.VIRK_DATO_ÅMD (I);                                 
      /*                                     AUTODATO_ÅM*100;  */               
             END;                                                               
         END;                                                                   
     END;        /**    DO J = 1 TO 13      **/                                 
                                                                                
 END BARNS_TILKNYTNINGSKODE_ENDRES;                                             
                                                                                
                                                                                
 YRKESSKADE_ELEV:                                                               
         PROC(W_PAÅ);                                                           
                                                                                
            DCL I_EK     FIXED BIN (15);                                        
            DCL W_IND    FIXED BIN (15);                                        
            DCL W_PAÅ    FIXED DEC (3,2);                                       
                                                                                
     /** FINNE SISTE UTFYLTE YRKEHIST-SEGMENT **/                               
                                                   /*2000: */                   
         DO J = 1 TO 10 UNTIL(B01.YRKEHIST.OPPH_DATO_ÅMD(I,J) = 0);             
         END;                                                                   
                                                                                
         IF B02.YRKE11(I,J)        = 'V'      &                                 
            B02.PAÅ   (I,J)        < W_PAÅ          THEN                        
                                                                                
           DO;                                                                  
             B02.PAÅ(I,J)                 = W_PAÅ;                              
             B02.STATUS.VIRK_DATO_ÅMD(I)  = AUTODATO_ÅM*100;                    
             IF W_PAÅ > B02.YRKEPENS.YPT(I) THEN                                
                DO;                                                             
                   TRANS_OPPL_OMR.TRANSTYPE     = 38;                           
                   B02.YRKEPENS.YPT(I) = W_PAÅ;                                 
                   B02.YRKEPENS.YPT_KODE(I) = 'Y';                              
                END;                                                            
                                                                                
             ELSE                                                               
                TRANS_OPPL_OMR.TRANSTYPE     = 72;                              
                                                                                
             TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                 
                                       AUTODATO_ÅM*100;                         
             HENDELSE_IND                 = JA;                                 
             SØKER_IND                    = I;                                  
             I                            = I + 1;                              
                                                                                
             IF I = 1 THEN                                                      
                I_EK = 2;                                                       
             ELSE                                                               
                I_EK = 1;                                                       
                                                                                
             IF B01.STATUS.VIRK_DATO_ÅMD(I_EK) > 0  &                           
                B01.STATUS_KODE_HIST    (I_EK) = ' '   THEN                     
                                                                                
                B02.STATUS.VIRK_DATO_ÅMD(I_EK) =                                
                                           AUTODATO_ÅM*100;                     
                                                                                
             DO W_IND = 3 TO 13;                                                
                                                                                
                IF B01.STATUS.VIRK_DATO_ÅMD(W_IND) > 0  THEN                    
                   B02.STATUS.VIRK_DATO_ÅMD(W_IND) =                            
                                             AUTODATO_ÅM*100;                   
                ELSE                                                            
                   W_IND = 13;                                                  
                                                                                
             END;                                                               
                                                                                
           END;                                                                 
                                                                                
                                                                                
 END YRKESSKADE_ELEV;                                                           
                                                                                
                                                                                
 SATSENDRING:                                                                   
   PROC;                                                                        
                                                                                
   /** DERSOM VI TIDLIGERE I AUTOHENDELSE-BEREGNINGEN HAR SPLITTET  **/         
   /** EN FAMILIE - UFØRT BARN FYLTE  18 ÅR - SÅ MÅ VI HER KUNNE    **/         
   /** FORBEREDE NY BEREGNING FOR BÅDE BARNEKULLET OG DEN UFØRE.    **/         
                                                                                
   DCL                                                                          
     I      FIXED BIN(15);                                                      
                                                                                
   /* DETTE LÅ TIL SLUTT I DENNE RUTINEN. G-ENDRINGER ER IKKE */                
   /* KOMMET MED PÅ FAI FOR DENNE ALDERSGRUPPEN. TRUDE, 040193 */               
                                                                                
   DO I = 1 TO 2; /* HL 0395 - X 2,SAMT AT SØKER_IND ER ENDRET TIL I */         
   W_FNR11   = B02.RF0PERSN.FNR(I);                                             
   W_FNR13   = KONV_FNR11_FNR13(W_FNR11);                                       
   W_FNR_ÅM               = FNR_R.ÅR*100+FNR_R.MND;                             
   IF (W_FNR_ÅM                > 192500   &                                     
       B01.KONV_P_KODE(I) ^= 'K' ) !                                            
                                                                                
      (B01.KONV_P_KODE(I)            = 'K'  !                                   
       B01.PENSJONSTYPE1(I)          = 'K'  &                                   
       B01.UTTAKSDATO_ÅMD(I) > 19920000 )   THEN                                
        DO;                                                                     
          IF (B01.ALDERSP.FAI(I) > 0)         THEN                              
           DO;                                                                  
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);                   
             TRANS_OPPL_OMR.TRANSTYPE          = 27; /* SATSENDRING */          
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                 
                                    AUTODATO_ÅM*100;                            
                                                                                
             HENDELSE_IND = JA;                                                 
             FIXED_DEC5 = (B02.ALDERSP.FAI(I)                                   
                                         * G_NÅ/G_FØR);                         
             B02.ALDERSP.FAI(I) = FIXED_DEC5;                                   
           END;                                                                 
        END;                                                                    
      /* TRUDE TIL HIT 040193 */                                                
     END; /* DO I = 1 TO 2 HL 0395 */                                           
                                                                                
     DO I = 1 TO 2;                                                             
       IF B01.STATUS.PENSJONSTYPE1(I) = 'A' !                                   
          B01.STATUS.PENSJONSTYPE1(I) = 'E' !                                   
          B01.STATUS.PENSJONSTYPE1(I) = 'J' !                                   
          B01.STATUS.PENSJONSTYPE1(I) = 'K' !                                   
          B01.STATUS.PENSJONSTYPE1(I) = 'Y' !                                   
          B01.STATUS.PENSJONSTYPE1(I) = 'U' THEN                                
         DO;                                                                    
           TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(I);                     
           TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                    
           TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                   
                                 AUTODATO_ÅM*100;                               
           HENDELSE_IND = JA;                                                   
                                                                                
           IF I = 1 THEN                                                        
             DO;                                                                
               SØKER_IND   = 1;                                                 
               FAMILIE_IND = 2;                                                 
             END;                                                               
           ELSE                                                                 
             DO;                                                                
               SØKER_IND   = 2;                                                 
               FAMILIE_IND = 1;                                                 
             END;                                                               
           IF B01.ETTEPENS.FORVENTET(I) > 0        &                            
   /*MÅ ALLTID RULLERES OM DEN KOMMER FRA 'AUTO' - 9905 */                      
              (B01.GT_TILLEGG_LOV92(I) = 0   !                                  
               KJØRINGS_TYPE           = 'A'   )    THEN                        
             DO;                                                                
               FIXED_DEC5 = (B02.ETTEPENS.FORVENTET(I) * G_NÅ/G_FØR);           
                                                                                
               B02.ETTEPENS.FORVENTET(I) = FIXED_DEC5;                          
             END;                                                               
                                                                                
             /*---------------------------------------------------- */          
             /*VI MÅ RULLERE FORSI-INNTEKTER OG ALDERSP.FAI         */          
             /*REGELENDRINGER 0591 OG 0192 . TRUDE 240492           */          
             /*---------------------------------------------------- */          
                                                                                
           IF B01.FORSI.ARBEIDSINNTEKT(I) > 0 THEN                              
             DO;                                                                
               FIXED_DEC5 = (B02.FORSI.ARBEIDSINNTEKT(I) * G_NÅ/G_FØR);         
               B02.FORSI.ARBEIDSINNTEKT(I) = FIXED_DEC5;                        
             END;                                                               
                                                                                
           IF B01.FORSI.PENSJONSINNTEKT(I) > 0 THEN                             
             DO;                                                                
               FIXED_DEC5 = (B02.FORSI.PENSJONSINNTEKT(I) * G_NÅ/G_FØR);        
               B02.FORSI.PENSJONSINNTEKT(I) = FIXED_DEC5;                       
             END;                                                               
                                                                                
           IF B01.FORSI.ARBEIDSINNTEKT_EK(I) > 0 THEN                           
             DO;                                                                
              FIXED_DEC5 = (B02.FORSI.ARBEIDSINNTEKT_EK(I)                      
                                   * G_NÅ/G_FØR);                               
              B02.FORSI.ARBEIDSINNTEKT_EK(I) = FIXED_DEC5;                      
             END;                                                               
                                                                                
           IF B01.FORSI.PENSJONSINNTEKT_EK(I) > 0 THEN                          
             DO;                                                                
               FIXED_DEC5 = (B02.FORSI.PENSJONSINNTEKT_EK(I)                    
                                  * G_NÅ/G_FØR);                                
               B02.FORSI.PENSJONSINNTEKT_EK(I) = FIXED_DEC5;                    
             END;                                                               
                                                                                
             /*---------------------------------------------------- */          
             /*VI MÅ RULLERE UFØRPENS.INNTEKT_FØR_UP                */          
             /*NYTT FELT FRA JULI 94. TRUDE 060794                  */          
             /*---------------------------------------------------- */          
      /*   IF B01.INNTEKT_FØR_UP(I) > 0 THEN                                    
             DO;                                                                
               FIXED_DEC5 = (B02.INNTEKT_FØR_UP(I) * G_NÅ/G_FØR);               
               B02.INNTEKT_FØR_UP(I) = FIXED_DEC5;                              
             END;                                                               
         *** */                                                                 
             /* G_RULLERING VEDR. FAI FLYTTES FØRST I RUTINEN*/                 
             /* TRUDE, 040193                                */                 
                                                                                
   /*      I = 2;         */                                                    
         END;                                                                   
     END;      /** DO I = 1 TO 2  **/                                           
                                                                                
     IF TRANS_OPPL_OMR.TRANSTYPE = 0 THEN                                       
       DO;                                                                      
                                                                                
         /*  FINNE YNGSTE BARN      */                                          
         DO J = 3 TO 14 UNTIL(B01.STATUS.PENSJONSTYPE2(J) = 'P');               
                                                                                
         END;                                                                   
                                                                                
         IF B01.STATUS.PENSJONSTYPE2(J) = 'P'   THEN                            
                                                                                
           DO;                                                                  
             TRANS_OPPL_OMR.FØDSNUMMER = B02.RF0PERSN.FNR(J);                   
             TRANS_OPPL_OMR.TRANSTYPE  = 27; /* SATSENDRING */                  
             TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                 
                                      AUTODATO_ÅM*100;                          
             HENDELSE_IND = JA;  /*TRUDE 190692 ????? */                        
             SØKER_IND = J;                                                     
                                                                                
          LOOP2:                                                                
             DO K = 1 TO 13 WHILE(B01.FNR_TILKN(1,K) > 0);                      
               IF B01.TILKN.TILKNYTNINGSKODE(1,K) = 'D' THEN                    
                 DO;                                                            
                   PIC11 =  B01.TILKN.FNR_TILKN(1,K);                           
                   IF F_KJØNN(PIC11) = 'K' THEN                                 
                     FAMILIE_IND = 1;                                           
                   ELSE                                                         
                     FAMILIE_IND = 2;                                           
                   LEAVE LOOP2;                                                 
                 END;                                                           
             END;                                                               
                                                                                
           END;   /** DO IF B01.STATUS.PENSJONSTYPE2(J) = P   **/               
                                                                                
         IF UFØR_BARN_IND > 0 & TRANSTYPE2 = 0 THEN                             
            DO;                                                                 
                                                                                
                                                                                
           TRANSTYPE2 = 27;                                                     
                                                                                
                                                                                
           END;                                                                 
                                                                                
       END;   /** DO IF TRANS_OPPL_OMR.TRANSTYPE = 0  **/                       
                                                                                
 END SATSENDRING;                                                               
                                                                                
                                                                                
 FINNE_SISTE_UFT_ÅM:                                                            
   PROC(IND) RETURNS(FIXED BIN(15));                                            
   DCL                                                                          
     IND    FIXED BIN(15),                                                      
     SISTE  FIXED BIN(15);                                                      
                                                                                
     /** FINNE SISTE UTFYLLTE UFT_ÅM   **/                                      
   /*0697 HL:*/                                                                 
     DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.UFT_ÅMD                             
                                  (IND,J) > 0);                                 
       SISTE = J;                                                               
     END;                                                                       
                                                                                
     RETURN(SISTE);                                                             
                                                                                
 END FINNE_SISTE_UFT_ÅM;                                                        
                                                                                
                                                                                
 FINNE_SISTE_YUFT_ÅM:                                                           
          PROC(IND) RETURNS(FIXED BIN(15));                                     
          DCL                                                                   
            IND    FIXED BIN(15),                                               
            SISTE  FIXED BIN(15);                                               
                                                                                
            /** FINNE SISTE UTFYLTE YUFT_ÅM   **/                               
            DO J = 10 TO 1 BY -1 UNTIL(B01.YRKEHIST.YUFT_ÅMD                    
                                         (IND,J) > 0);                          
              SISTE = J;                                                        
            END;                                                                
                                                                                
            RETURN(SISTE);                                                      
                                                                                
 END FINNE_SISTE_YUFT_ÅM;                                                       
                                                                                
        /*NY PROC 0892 TRUDE PGA DØDE UFØRE FØR 24 ÅR FØDT < 43 */              
  UF_DØD:                                                                       
    PROC(I_EK);                                                                 
                                                                                
   DCL                                                                          
     I_EK           FIXED BIN(15),                                              
     SISTE_BUP_EK   FIXED BIN(15);                                              
                                                                                
   DCL HJ_FNR11  PIC  '(11)9';                                                  
   DCL HJ_FNR13  PIC  '(13)9';                                                  
   DCL  1 R_FNR DEF HJ_FNR13,                                                   
          2  R_FNR_DAG         PIC '99',                                        
          2  R_FNR_MND         PIC '99',                                        
          2  R_FNR_ÅR          PIC '9999',                                      
          2  R_FNR_REST  PIC '(5)9';                                            
                                                                                
     IF I = 1 THEN                                                              
       I_EK = 2;                                                                
     ELSE                                                                       
       I_EK = 1;                                                                
                                                                                
     HJ_FNR11  = B02.FNR(I_EK);                                                 
     HJ_FNR13  = KONV_FNR11_FNR13(HJ_FNR11);                                    
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER    = B02.RF0PERSN.FNR(I);                        
     B02.STATUS.VIRK_DATO_ÅMD(I)  = AUTODATO_ÅM*100;                            
                                                                                
     IF B01.RF0PERSN.FNR(I_EK) > 0 THEN                                         
       DO;                                                                      
         B02.STATUS.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                      
         TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD =                                     
                                AUTODATO_ÅM*100;                                
                                                                                
         /** FINNE SISTE UTFYLLTE BUP_GAR_KODE FOR EK   **/                     
                                                                                
     /*0697 HL:*/                                                               
         DO J = 7 TO 1 BY -1 UNTIL(B01.UFØRHIST.BUP_GAR_KODE                    
                                      (I_EK,J) ^= ' ');                         
           SISTE_BUP_EK = J;                                                    
         END;                                                                   
                                                                                
        IF  B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'E'  !               
            B01.UFØRHIST.BUP_GAR_KODE(I_EK,SISTE_BUP_EK) = 'D' THEN             
          DO;                                                                   
                                                                                
          IF AUTODATO_ÅM = 198907   THEN                                        
            DO;                                                                 
  /*9708      B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 1.6;*/              
              DO K = 1 TO SISTE_BUP_EK;                                         
                 B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';                       
              END;                                                              
              B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                        
              B02.VIRK_DATO_ÅMD(I)  = AUTODATO_ÅM*100;                          
              HENDELSE_IND     = JA;                                            
              FAMILIE_IND      = I;                                             
              IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                             
                 CALL BARN_18ÅR(I);                                             
              IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN                           
                DO;                                                             
                  SØKER_IND  =  I;                                              
                  EKTEF_IND  = 3 - I;                                           
                END;                                                            
              ELSE                                                              
                      DO;                                                       
                        FAMILIE_IND   = I;                                      
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                          
                      END;                                                      
            END;                                                                
                                                                                
  /*TRUD*/   IF AUTODATO_ÅM = 199101   &                                        
                R_FNR_ÅR    >  1924    THEN                                     
                 DO;                                                            
 /* 9708          B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.00;*/         
                   DO K = 1 TO SISTE_BUP_EK;                                    
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';                  
                   END;                                                         
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   B02.VIRK_DATO_ÅMD(I)  = AUTODATO_ÅM*100;                     
                   HENDELSE_IND     = JA;                                       
                   FAMILIE_IND      = I;                                        
                   TRANS_OPPL_OMR.TRANSTYPE  = 7;                               
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                        
                     CALL BARN_18ÅR(I);                                         
                 END;                                                           
                                                                                
  /*TRUD*/  ELSE IF AUTODATO_ÅM = 199201   &                                    
              R_FNR_ÅR   >  1925    THEN                                        
               DO;                                                              
 /* 9708         B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 2.50;*/          
                   DO K = 1 TO SISTE_BUP_EK;                                    
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';                  
                   END;                                                         
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   B02.VIRK_DATO_ÅMD(I)  = AUTODATO_ÅM*100;                     
                   HENDELSE_IND     = JA;                                       
                   FAMILIE_IND      = I;                                        
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                        
                     CALL BARN_18ÅR(I);                                         
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN                      
                     DO;                                                        
                       SØKER_IND  =  I;                                         
                       EKTEF_IND  = 3 - I;                                      
                     END;                                                       
                   ELSE                                                         
                      DO;                                                       
                        FAMILIE_IND   = I;                                      
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                          
                      END;                                                      
                 END;                                                           
                                                                                
             ELSE IF AUTODATO_ÅM = 199205   &                                   
                  R_FNR_ÅR       > 1925     THEN                                
               DO;                                                              
 /*9708         B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.0;*/            
                   DO K = 1 TO SISTE_BUP_EK;                                    
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';                  
                   END;                                                         
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                      
                   HENDELSE_IND     = JA;                                       
                   FAMILIE_IND      = I;                                        
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                        
                     CALL BARN_18ÅR(I);                                         
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN                      
                     DO;                                                        
                       SØKER_IND  =  I;                                         
                       EKTEF_IND  = 3 - I;                                      
                     END;                                                       
                   ELSE                                                         
                      DO;                                                       
                        FAMILIE_IND   = I;                                      
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                          
                      END;                                                      
                 END;                                                           
                                                                                
             ELSE IF AUTODATO_ÅM = 199705   &                                   
                  R_FNR_ÅR       > 1930          THEN                           
 /*9708  B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) ^= 3.3 THEN */             
               DO;                                                              
 /*9708         B02.UFØRHIST.BUP_GARANTI(I_EK,SISTE_BUP_EK) = 3.3;*/            
                   DO K = 1 TO SISTE_BUP_EK;                                    
                      B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';                  
                   END;                                                         
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                      
                   HENDELSE_IND     = JA;                                       
                   FAMILIE_IND      = I;                                        
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                        
                     CALL BARN_18ÅR(I);                                         
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN                      
                     DO;                                                        
                       SØKER_IND  =  I;                                         
                       EKTEF_IND  = 3 - I;                                      
                     END;                                                       
                   ELSE                                                         
                      DO;                                                       
                        FAMILIE_IND   = I;                                      
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                          
                      END;                                                      
                 END;                                                           
                                                                                
             ELSE IF (AUTODATO_ÅM = 199707    !                                 
                      AUTODATO_ÅM = 200805    )       &                         
                  R_FNR_ÅR       > 1930     THEN                                
               DO;                                                              
                 IF R_FNR_ÅR = 1941   !                                         
                    R_FNR_ÅR = 1942             THEN                            
                    DO;                                                         
                       B02.TP_GAR_KODE (I_EK) = ' ';                            
                       DO K = 1 TO SISTE_BUP_EK;                                
                          B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'B';              
                          IF AUTODATO_ÅM = 199707    THEN                       
                            B02.UFØRHIST.BUP_GARANTI (I_EK,K) = 3.30;           
                          ELSE                                                  
                            B02.UFØRHIST.BUP_GARANTI (I_EK,K) = 3.50;           
                       END;                                                     
                    END;                                                        
                 ELSE                                                           
                    DO K = 1 TO SISTE_BUP_EK;                                   
                       B02.UFØRHIST.BUP_GAR_KODE(I_EK,K) = 'E';                 
                    END;                                                        
                   B02.VIRK_DATO_ÅMD(I_EK) = AUTODATO_ÅM*100;                   
                   B02.VIRK_DATO_ÅMD(I) = AUTODATO_ÅM*100;                      
                   HENDELSE_IND     = JA;                                       
                   FAMILIE_IND      = I;                                        
                   IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                        
                     CALL BARN_18ÅR(I);                                         
                   IF TRANS_OPPL_OMR.TRANSTYPE  = 27  THEN                      
                     DO;                                                        
                       SØKER_IND  =  I;                                         
                       EKTEF_IND  = 3 - I;                                      
                     END;                                                       
                   ELSE                                                         
                      DO;                                                       
                        FAMILIE_IND   = I;                                      
                        TRANS_OPPL_OMR.TRANSTYPE  = 7;                          
                      END;                                                      
                 END;                                                           
                                                                                
             IF B01.STATUS.ANTALL_BARN(I_EK) > 0 THEN                           
               CALL BARN_18ÅR(I_EK);                                            
                                                                                
           END;                                                                 
       END;                                                                     
                                                                                
     IF B01.STATUS.ANTALL_BARN(I) > 0 THEN                                      
        CALL BARN_18ÅR(I);                                                      
                                                                                
 END UF_DØD;                                                                    
  /*9708 HL : */                                                                
    /* -------------------------------------------------------------- */        
    /* RUTINA NEDENFOR BLIR FORELØPIG IKKE CALLED-------------------- */        
    /* DEN SKAL EVT ERSTATTE UNG_DØD_D------------------------------- */        
    UNG_DØD_D1:PROC(I,SISTE,ALDER_UF_DØD);                                      
       /* DØDE MED BUP_GAR_KODE = 'D' - VENTER PÅ RETT */                       
       DCL I             FIXED BIN (15);                                        
       DCL SISTE         FIXED BIN (15);                                        
       DCL ALDER_UF_DØD  PIC 'S99999';                                          
       SELECT(AUTODATO_ÅM);                                                     
          WHEN(198105)                                                          
             IF (ALDER_UF_DØD < 2001 &                                          
                 FNR_R.ÅR     > 1946 ) THEN                                     
                DO;                                                             
                   B02.BUP_GAR_KODE(I,SISTE) = 'B';                             
                   B02.BUP_GARANTI (I,SISTE) = 2.00;                            
                END;                                                            
          WHEN(198401)                                                          
             IF (ALDER_UF_DØD < 2101 &                                          
                 FNR_R.ÅR     > 1944 ) THEN                                     
                DO;                                                             
                   B02.BUP_GAR_KODE(I,SISTE) = 'B';                             
                   B02.BUP_GARANTI (I,SISTE) = 2.00;                            
                END;                                                            
          WHEN(198901)                                                          
             IF (ALDER_UF_DØD < 2201 &                                          
                 FNR_R.ÅR     > 1944 ) THEN                                     
                DO;                                                             
                   B02.BUP_GAR_KODE(I,SISTE) = 'B';                             
                   B02.BUP_GARANTI (I,SISTE) = 3.00;                            
                END;                                                            
          WHEN(198907)                                                          
             IF (ALDER_UF_DØD < 2201 &                                          
                 FNR_R.ÅR     > 1922 &                                          
                 FNR_R.ÅR     < 1945 ) THEN                                     
                B02.BUP_GAR_KODE(I,SISTE) = 'E';                                
          WHEN(199205)                                                          
             IF (ALDER_UF_DØD < 2401 ) THEN                                     
                IF (FNR_R.ÅR  > 1942 ) THEN                                     
                   DO;                                                          
                      B02.BUP_GAR_KODE(I,SISTE) = 'B';                          
                      B02.BUP_GARANTI (I,SISTE) = 3.30;                         
                   END;                                                         
                ELSE                                                            
                IF (FNR_R.ÅR > 1925  )      THEN                                
                  B02.BUP_GAR_KODE(I,SISTE) = 'E';                              
          WHEN(199707)                                                          
             IF (ALDER_UF_DØD < 2601 ) THEN                                     
                IF (FNR_R.ÅR  > 1940 ) THEN                                     
                   DO;                                                          
                      B02.BUP_GAR_KODE(I,SISTE) = 'B';                          
                      B02.BUP_GARANTI (I,SISTE) = 3.30;                         
                      B02.TP_GAR_KODE (I)       = ' ';                          
                   END;                                                         
                ELSE                                                            
                IF (FNR_R.ÅR > 1930  )      THEN                                
                  B02.BUP_GAR_KODE(I,SISTE) = 'E';                              
          WHEN(200805)                                                          
             IF (ALDER_UF_DØD < 2601 ) THEN                                     
                IF (FNR_R.ÅR  > 1940 ) THEN                                     
                   DO;                                                          
                      B02.BUP_GAR_KODE(I,SISTE) = 'B';                          
                      B02.BUP_GARANTI (I,SISTE) = 3.50;                         
                      B02.TP_GAR_KODE (I)       = ' ';                          
                   END;                                                         
                ELSE                                                            
                IF (FNR_R.ÅR > 1930  )      THEN                                
                  B02.BUP_GAR_KODE(I,SISTE) = 'E';                              
          OTHER;                                                                
       END; /* SELECT AUTODATO_ÅM (BRUKES SOM LOVDATO) */                       
    END UNG_DØD_D1;                                                             
    /* -------------------------------------------------------------- */        
 UNG_DØD_D:                                                                     
   PROC(I,SISTE,ALDER_UF_DØD);                                                  
    DCL I         FIXED BIN (15);                                               
    DCL SISTE     FIXED BIN (15);                                               
    DCL ALDER_UF_DØD             PIC 'S99999';                                  
                                                                                
 /*DØDE MED BUP_GAR_KODE = 'D' - VENTER På RETT */                              
                                                                                
   IF AUTODATO_ÅM = 198105         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2001             THEN                                
            DO;                                                                 
               IF FNR_R.ÅR > 1946             THEN                              
                  DO;                                                           
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                           
                     B02.BUP_GARANTI (I,SISTE) = 2.00;                          
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE                                                                         
   IF AUTODATO_ÅM = 198401         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2101                    THEN                         
            DO;                                                                 
               IF FNR_R.ÅR > 1945        THEN                                   
                  DO;                                                           
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                           
                     B02.BUP_GARANTI (I,SISTE) = 2.00;                          
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE                                                                         
   IF AUTODATO_ÅM = 198901         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2201                    THEN                         
            DO;                                                                 
               IF FNR_R.ÅR > 1944      THEN                                     
                  DO;                                                           
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                           
                     B02.BUP_GARANTI (I,SISTE) = 3.00;                          
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE                                                                         
   IF AUTODATO_ÅM = 198907         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2201                     THEN                        
            DO;                                                                 
               IF FNR_R.ÅR > 1922   &                                           
                  FNR_R.ÅR < 1945     THEN                                      
                  DO;                                                           
                     B02.BUP_GAR_KODE(I,SISTE) = 'E';                           
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE                                                                         
   IF AUTODATO_ÅM = 199205         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2401                  THEN                           
            DO;                                                                 
               IF FNR_R.ÅR > 1942        THEN                                   
                  DO;                                                           
                     B02.BUP_GAR_KODE(I,SISTE) = 'B';                           
                     B02.BUP_GARANTI (I,SISTE) = 3.30;                          
                  END;                                                          
               ELSE                                                             
               IF FNR_R.ÅR > 1925         THEN                                  
                  B02.BUP_GAR_KODE(I,SISTE) = 'E';                              
            END;                                                                
      END;                                                                      
   ELSE                                                                         
   IF AUTODATO_ÅM = 199707         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2601                 THEN                            
            IF FNR_R.ÅR > 1940         THEN                                     
               DO;                                                              
                  B02.BUP_GAR_KODE(I,SISTE) = 'B';                              
                  B02.BUP_GARANTI (I,SISTE) = 3.30;                             
                  B02.TP_GAR_KODE (I)       = ' ';                              
               END;                                                             
            ELSE                                                                
            IF FNR_R.ÅR > 1930         THEN                                     
               B02.BUP_GAR_KODE(I,SISTE) = 'E';                                 
      END;                                                                      
   ELSE                                                                         
   IF AUTODATO_ÅM = 200805         THEN                                         
      DO;                                                                       
         IF ALDER_UF_DØD < 2601                 THEN                            
            IF FNR_R.ÅR > 1940         THEN                                     
               DO;                                                              
                  B02.BUP_GAR_KODE(I,SISTE) = 'B';                              
                  B02.BUP_GARANTI (I,SISTE) = 3.50;                             
                  B02.TP_GAR_KODE (I)       = ' ';                              
               END;                                                             
            ELSE                                                                
            IF FNR_R.ÅR > 1930         THEN                                     
               B02.BUP_GAR_KODE(I,SISTE) = 'E';                                 
      END;                                                                      
 END UNG_DØD_D;                                                                 
                                                                                
                                                                                
 /*KONSOLIDERING AV DSF*/                                                       
 /*FEIL 5 OG FEIL 1 - FEIL I RULLERING - 9802 HL :  */                          
                                                                                
 SKAL_INNTEKTER_RULLERES:                                                       
 PROC(FIXED_DEC9);                                                              
                                                                                
 DCL FIXED_DEC9 FIXED DEC(9);                                                   
                                                                                
 DO I = 1 TO 2;                                                                 
    IF B02.ETTEPENS.FORVENTET(I) > 0   THEN                                     
       CALL RULL_FORVENTET(B01.G_DATO_ÅMD(SØKER_IND),                           
                             (FIXED_DEC9),                                      
                             B02.ETTEPENS.FORVENTET(I));                        
                                                                                
    IF B02.ALDERSP.FAI(I) > 0   THEN                                            
       CALL RULL_FAI(B01.G_DATO_ÅMD(SØKER_IND),                                 
                     (FIXED_DEC9),                                              
                     B02.ALDERSP.FAI(I));                                       
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT(I) > 0  THEN                                   
       B02.FORSI.PENSJONSINNTEKT(I) =                                           
           F_RULL_FORSI(B01.G_DATO_ÅMD(SØKER_IND),                              
                 (FIXED_DEC9),                                                  
                 B02.FORSI.PENSJONSINNTEKT(I));                                 
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT(I) > 0  THEN                                    
       B02.FORSI.ARBEIDSINNTEKT(I) =                                            
           F_RULL_FORSI(B01.G_DATO_ÅMD(SØKER_IND),                              
                 (FIXED_DEC9),                                                  
                 B02.FORSI.ARBEIDSINNTEKT(I));                                  
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT_EK(I) > 0  THEN                                
       B02.FORSI.PENSJONSINNTEKT_EK(I) =                                        
           F_RULL_FORSI(B01.G_DATO_ÅMD(SØKER_IND),                              
                  (FIXED_DEC9),                                                 
                  B02.FORSI.PENSJONSINNTEKT_EK(I));                             
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT_EK(I) > 0  THEN                                 
       B02.FORSI.ARBEIDSINNTEKT_EK(I) =                                         
           F_RULL_FORSI(B01.G_DATO_ÅMD(SØKER_IND),                              
                 (FIXED_DEC9),                                                  
                 B02.FORSI.ARBEIDSINNTEKT_EK(I));                               
                                                                                
  END;                                                                          
  END SKAL_INNTEKTER_RULLERES;                                                  
                                                                                
 %INCLUDE R0019902;   /*    FINNE KJØNN                  */                     
                 /*  DENNE LÅ MED R00199H5 SOM IKKE FINNES?? TRUDE  */          
 %INCLUDE R0019905;   /*    FINNE ALDER                  */                     
 %INCLUDE R0019934;   /*    OPPHØR_KOBLING_TO_PERSONER   */                     
 %INCLUDE R0019938;   /*    ETTERLATTEPENSJON_OPPHØRER   */                     
 %INCLUDE R0019940;   /*    UFØREPENSJON_OPPHØRER        */                     
 %INCLUDE R0019966;   /*    AFP_NULL_OPPHØRER            */                     
 %INCLUDE R0019954;   /*    RULL_FORVENTET               */                     
 %INCLUDE R0019967;   /*    RULL_FAI                     */                     
 %INCLUDE R0019968;   /*    F_RULL_FORSI                 */                     
 %INCLUDE R0019995;   /*    KONV_FNR11_FNR13             */                     
 %INCLUDE R0014161;   /*    LEGG_UFØREHIST_I_TAB         */                     
                                                                                
 END R001490;                                                                   
