 /*       SIST ENDRET 28/08-98 14.33.00 AV   SPA7339                  */00000000
 /*       SIST ENDRET 14/01-98 15.27.09 AV   SPA7339                  */00000010
 /* ***************************************************************** */00000020
 /* IDENTIFIKASJON                                                    */00000030
 /*     R0010424 - PROGRAM SOM FORETAR  OPPDATERING AV STATSBORGER    */00000040
 /*                TABELLEN UNDER ADMINISTRASJONSDELEN AV SYSTEMET.   */00000050
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000060
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SETTEMBER 1983.             */00000070
 /* HENSIKT                                                           */00000080
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */00000090
 /*     VELGE KODE FOR DET EN ØNSKER UTFØRT.                          */00000100
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */00000110
 /*     KAN GI KONTROLL TIL DEN AKTUELLE PROGRAMDELEN SOM UTFØRER     */00000120
 /*     AKSJONEN.                                                     */00000130
 /* PROGRAMTILKNYTNING                                                */00000140
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */00000150
 /*     UNDER ADMINISTRASJONSDELEN.                                   */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
                                                                        00000190
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000200
                                                                        00000210
    %INCLUDE P0019908;            /* KOM_OMR                          */00000220
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000230
    %INCLUDE P0019910;            /* STYRINGS_OMR                     */00000240
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000250
    %INCLUDE S001A4;              /* MAP TIL LKNR ENDRING FOR         */00000260
                                  /* ADMINISTRASJON.                  */00000270
    %INCLUDE DFHBMSCA;            /* HJELPE STRUKTUR FOR ATTRIBUTTER  */00000280
                                                                        00000290
    DCL                                                                 00000300
      1 ADM_OMR                  BASED(B01_PEKER), /* DETTE SIDEN B01 */00000310
        2 FORRIGE_AKSJON         CHAR(2),          /* IKKE BRUKES HER */00000320
                                                                        00000330
      1 STATSBRNR_REC            BASED(STATSBRNR_PEKER),                00000340
        2 STATSBORGER            PIC '(3)9',                            00000350
        2 FILLER                 CHAR (2),                              00000360
        2 NAVN                   CHAR (25),                             00000370
                                                                        00000380
      CSTG                       BUILTIN,                               00000390
      ADDR                       BUILTIN,                               00000400
      LENGTH                     BUILTIN,                               00000410
      KEY_BIT                    BIT(24) BASED (KEY_PEKER),             00000420
      KEY_PEKER                  POINTER,                               00000430
      STATSBRNR_PEKER            POINTER,                               00000440
      BMSMAPBR                   POINTER,                               00000450
      COMMAREA_PEKER             POINTER;                               00000460
                                                                        00000470
                                                                        00000480
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);               00000490
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);             00000500
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000510
    TRANSKODE               = 'RA24';        /* DETTE PROGRAM  */       00000520
                                                                        00000530
                                                                        00000540
    IF PROGRAM_ID = 'R0010420' THEN         /* KOMMER IN FØRSTE GANG */ 00000550
                                                                        00000560
       DO;                                                              00000570
          EXEC CICS SEND MAP('S001A4') MAPSET('S001A43') MAPONLY ERASE; 00000580
                                                                        00000590
       END;                                                             00000600
                                                                        00000610
                                                                        00000620
    ELSE IF PROGRAM_ID = 'R0010424' THEN       /*   DETTE PROGRAM   */  00000630
                                                                        00000640
       DO;                                                              00000650
          EXEC CICS RECEIVE MAP('S001A4')MAPSET('S001A43')              00000660
                                         SET  (BMSMAPBR);               00000670
          S001A4O.MELDINGO  = ' ';                                      00000680
          KEY_PEKER         = ADDR(S001A4I.STATSBORGERI);               00000690
                                                                        00000700
                                                                        00000710
 /* ENDRET 18.02.86   AL                                       */       00000720
                                                                        00000730
          IF S001A4I.FUNKSJONSKODEL > 0 &                               00000740
             VERIFY(S001A4I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN          00000750
                                                                        00000760
 /* HIT    18.02.86   AL                                       */       00000770
                                                                        00000780
             DO;                                                        00000790
                FUNKSJONSKODE = S001A4I.FUNKSJONSKODEI;                 00000800
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00000810
             END;                                                       00000820
                                                                        00000830
          IF S001A4I.STYRE_KODEL > 0 &                                  00000840
             S001A4I.STYRE_KODEI ^= 'NB' THEN                           00000850
             DO;                                                        00000860
                STYREKODE  = S001A4I.STYRE_KODEI;                       00000870
                EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA (KOM_OMR); 00000880
             END;                                                       00000890
                                                                        00000900
          SELECT(S001A4I.AKSJONI);                                      00000910
             WHEN('VS')                                                 00000920
                DO;                                                     00000930
                   CALL BLANK_TEKST;                                    00000940
                   CALL TEKST_PROT;                                     00000950
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00000960
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00000970
                                               SET(STATSBRNR_PEKER);    00000980
                   CALL OVERFØR_TIL_MAP;                                00000990
                   FORRIGE_AKSJON = 'VS';                               00001000
                                                                        00001010
                END;                                                    00001020
             WHEN('VN')                                                 00001030
                DO;                                                     00001040
                   CALL BLANK_TEKST;                                    00001050
                   CALL TEKST_PROT;                                     00001060
                   S001A4O.STATSBORGERO = S001A4O.STATSBORGERO + 1;     00001070
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VN);        00001080
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001090
                                            GTEQ  SET(STATSBRNR_PEKER); 00001100
                   CALL OVERFØR_TIL_MAP;                                00001110
                   FORRIGE_AKSJON = 'VN';                               00001120
                                                                        00001130
                END;                                                    00001140
             WHEN('VF')                                                 00001150
                DO;                                                     00001160
                   CALL BLANK_TEKST;                                    00001170
                   CALL TEKST_PROT;                                     00001180
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00001190
                   EXEC CICS STARTBR DATASET ('STATTAB') EQUAL          00001200
                                        RIDFLD(KEY_BIT);                00001210
                   EXEC CICS HANDLE CONDITION ENDFILE(NOTFND_VN);       00001220
                   EXEC CICS READPREV DATASET ('STATTAB')RIDFLD(KEY_BIT)00001230
                                                 SET(STATSBRNR_PEKER);  00001240
                   EXEC CICS READPREV DATASET ('STATTAB')RIDFLD(KEY_BIT)00001250
                                                 SET(STATSBRNR_PEKER);  00001260
                   CALL OVERFØR_TIL_MAP;                                00001270
                   FORRIGE_AKSJON = 'VF';                               00001280
                                                                        00001290
                END;                                                    00001300
         /*  WHEN('RS')                                                 00001310
                DO;                                                     00001320
                   CALL BLANK_TEKST;                                    00001330
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_RS);        00001340
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001350
                                                 SET(STATSBRNR_PEKER);  00001360
                   S001A4O.MELDINGO =                                   00001370
                       'DETTE STATSBOREGERNUMMER FINNES FRA FØR';       00001380
                   CALL TEKST_PROT;                                     00001390
                   CALL SEND_MAP;                                       00001400
                                                                        00001410
                END;                                                    00001420
             WHEN('ES')                                                 00001430
                DO;                                                     00001440
                   CALL BLANK_TEKST;                                    00001450
                   CALL TEKST_PROT;                                     00001460
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00001470
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001480
                                                 SET(STATSBRNR_PEKER);  00001490
                   CALL TEKST_UNP;                                      00001500
                   CALL OVERFØR_TIL_MAP;                                00001510
                   FORRIGE_AKSJON = 'ES';                               00001520
                                                                        00001530
                END;                                                    00001540
             WHEN('SS')                                                 00001550
                DO;                                                     00001560
                                                                        00001570
                   SELECT (FORRIGE_AKSJON);                             00001580
                      WHEN('RS')                                        00001590
                         DO;                                            00001600
                            CALL OVERFØR_FRA_MAP;                       00001610
                            CALL KONTROLL_AV_INPUT;                     00001620
                            EXEC CICS WRITE DATASET ('STATTAB')         00001630
                                FROM (STATSBRNR_REC)  RIDFLD(KEY_BIT);  00001640
                            S001A4O.MELDINGO =                          00001650
                            'TEKSTEN TIL DETTE STATSBORGERNUMMER ER NÅ' 00001660
                            !! ' SKREVET TIL SYSTEMET';                 00001670
                         END;                                           00001680
                      WHEN('ES')                                        00001690
                         DO;                                            00001700
                            EXEC CICS READ DATASET ('STATTAB') UPDATE   00001710
                                 RIDFLD(KEY_BIT) SET(STATSBRNR_PEKER);  00001720
                            CALL OVERFØR_FRA_MAP;                       00001730
                            CALL KONTROLL_AV_INPUT;                     00001740
                            EXEC CICS REWRITE DATASET ('STATTAB')       00001750
                                                  FROM (STATSBRNR_REC); 00001760
                            S001A4O.MELDINGO =                          00001770
                            'TEKSTEN TIL DETTE STATSBORGERNUMMER ER'    00001780
                            !! ' NÅ ENDRET';                            00001790
                         END;                                           00001800
                      OTHERWISE                                         00001810
                         DO;                                            00001820
                            S001A4O.MELDINGO =                          00001830
                            'GAL KODE FØR SS, BARE RS ELLER ES TILLATT';00001840
                         END;                                           00001850
                                                                        00001860
                   END;                                                 00001870
                                                                        00001880
                   CALL TEKST_PROT;                                     00001890
                   FORRIGE_AKSJON = 'SS';                               00001900
                END;                                                    00001910
             WHEN('FS')                                                 00001920
                DO;                                                     00001930
                   CALL BLANK_TEKST;                                    00001940
                   CALL TEKST_PROT;                                     00001950
                   EXEC CICS HANDLE CONDITION NOTFND(NOTFND_VS);        00001960
                   EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT)   00001970
                                                 SET(STATSBRNR_PEKER);  00001980
                   EXEC CICS DELETE DATASET ('STATTAB') RIDFLD(KEY_BIT);00001990
                   S001A4O.MELDINGO ='DETTE STATSBORGERNUMMER OG NAVN ' 00002000
                                   !!'ER FJERNET';                      00002010
                   CALL OVERFØR_TIL_MAP;                                00002020
                   FORRIGE_AKSJON = 'FS';                               00002030
                                                                        00002040
                END; */                                                 00002050
             WHEN('XX')                                                 00002060
                DO;                                                     00002070
                   PROGRAM_ID = 'R0010301';    /* LITT JUKS !!!!     */ 00002080
                   EXEC CICS XCTL PROGRAM ('R0010420')                  00002090
                                  COMMAREA (KOM_OMR);                   00002100
                END;                                                    00002110
             OTHERWISE                                                  00002120
                DO;                                                     00002130
                   S001A4O.MELDINGO = 'UGYLDIG KODE';                   00002140
                   CALL TEKST_PROT;                                     00002150
                   S001A4I.AKSJONL = -1;     /* CURSOR */               00002160
                   S001A4I.STATSBORGERL   = 0;                          00002170
                END;                                                    00002180
                                                                        00002190
                                                                        00002200
          END;      /* SELECT  */                                       00002210
                                                                        00002220
          CALL SEND_MAP;                                                00002230
                                                                        00002240
                                                                        00002250
       END;                                                             00002260
                                                                        00002270
                                                                        00002280
  UT:                                                                   00002290
    PROGRAM_ID = 'R0010424';                                            00002300
    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);              00002310
                                                                        00002320
                                                                        00002330
  NOTFND_VS:                                                            00002340
    S001A4O.MELDINGO =                                                  00002350
           'DETTE STATSBORGERNUMMER FINNES IKKE I SYSTEMET';            00002360
    CALL SEND_MAP;                                                      00002370
    GOTO UT;                                                            00002380
                                                                        00002390
                                                                        00002400
  NOTFND_VN:                                                            00002410
    S001A4O.MELDINGO =                                                  00002420
           'INGEN FLERE STATSBORGERNUMMER I DENNE RETNING';             00002430
    CALL SEND_MAP;                                                      00002440
    GOTO UT;                                                            00002450
                                                                        00002460
                                                                        00002470
  NOTFND_RS:                                                            00002480
    CALL TEKST_UNP;                                                     00002490
    FORRIGE_AKSJON = 'RS';                                              00002500
    CALL SEND_MAP;                                                      00002510
    GOTO UT;                                                            00002520
                                                                        00002530
                                                                        00002540
  SEND_MAP: PROC;                                                       00002550
     EXEC CICS SEND MAP ('S001A4') MAPSET ('S001A43')                   00002560
                                 CURSOR     DATAONLY ;                  00002570
  END SEND_MAP;                                                         00002580
                                                                        00002590
                                                                        00002600
  BLANK_TEKST: PROC;                                                    00002610
     S001A4O.NAVNO          = ' ';                                      00002620
  END BLANK_TEKST;                                                      00002630
                                                                        00002640
                                                                        00002650
  TEKST_UNP: PROC;                                                      00002660
     S001A4I.NAVNL          = -1;   /* CURSOR   */                      00002670
     S001A4I.STATSBORGERL   = 0;                                        00002680
     S001A4O.STATSBORGERA   = '9';  /* ASKIP + BRIGHT + MDT */          00002690
     S001A4O.NAVNA          = 'I';  /* UNP + BRI + MDT      */          00002700
  END TEKST_UNP;                                                        00002710
                                                                        00002720
                                                                        00002730
  TEKST_PROT: PROC;                                                     00002740
     S001A4I.NAVNL          = 0;                                        00002750
     S001A4I.STATSBORGERL   = -1;  /* CURSOR   */                       00002760
     S001A4O.STATSBORGERA   = 'P'; /* BRIGHT + NUM + UNP + MDT */       00002770
     S001A4O.NAVNA          = DFHBMASB;                                 00002780
  END TEKST_PROT;                                                       00002790
                                                                        00002800
                                                                        00002810
  OVERFØR_TIL_MAP: PROC;                                                00002820
     S001A4O.STATSBORGERO   = STATSBRNR_REC.STATSBORGER;                00002830
     S001A4O.NAVNO          = STATSBRNR_REC.NAVN;                       00002840
  END OVERFØR_TIL_MAP;                                                  00002850
                                                                        00002860
                                                                        00002870
  OVERFØR_FRA_MAP: PROC;                                                00002880
                                                                        00002890
     ALLOCATE STATSBRNR_REC;                                            00002900
     STATSBRNR_REC                 = '';                                00002910
     STATSBRNR_REC.STATSBORGER     = S001A4O.STATSBORGERO;              00002920
     IF S001A4I.NAVNL         > 0 THEN                                  00002930
        STATSBRNR_REC.NAVN         = S001A4I.NAVNI;                     00002940
                                                                        00002950
  END OVERFØR_FRA_MAP;                                                  00002960
                                                                        00002970
                                                                        00002980
                                                                        00002990
                                                                        00003000
  KONTROLL_AV_INPUT:  PROC;                                             00003010
                                                                        00003020
     IF STATSBRNR_REC. NAVN = ' ' THEN                                  00003030
        DO;                                                             00003040
           S001A4O.MELDINGO = 'NAVN ER IKKE UTFYLLT';                   00003050
           S001A4I.NAVNL     = -1;      /* CURSOR      */               00003060
        END;                                                            00003070
                                                                        00003080
     ELSE                                                               00003090
        RETURN;            /*  RETURNERER UTEN Å HA FUNNET FEIL  */     00003100
                                                                        00003110
                                                                        00003120
    /* HIT KOMMER EN BARE DERSOM DET ER FEIL, DA BLIR DET EN    */      00003130
    /* ANNEN UTGANG                                             */      00003140
                                                                        00003150
    CALL SEND_MAP;                                                      00003160
    GOTO UT;                                                            00003170
                                                                        00003180
                                                                        00003190
  END KONTROLL_AV_INPUT;                                                00003200
                                                                        00003210
                                                                        00003220
 END R001B1;                                                            00003230
