 /*   SIST ENDRET PÅ PROD   2002.04.19 12.28.00 AV   JDA2970          */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0014475 - EØS-REGLER -SPT-GARANTI  -UNDERPROG                */        
 /*     PROGRAMMERER: HERMAN LARSSEN                                  */        
 /* HENSIKT                                                           */        
 /*     BEREGNE SPT-GARANTI ETTER GAMLE REGLER                        */        
 /*     GJELDER PERSONER SOM ER MERKET I ROT.EØS_GARANTI MED A/C      */        
 /*     DISSE BLE REGISTRERT FØR 12.10.95 - DA ENDREDE REGLER BLE     */        
 /*     LAGT INN I PROGRAMMENE.                                       */        
 /* PROGRAMTILKNYTNING.                                               */        
 /*     PROSEDYREN BLIR CALLET FRA  R0014470                          */        
 /* ***************************************************************** */        
 SPT_GAR: PROC;                                                                 
    %INCLUDE P0014002;   /* W_POREKKE                                 */        
                                                                                
     /* ------------------------------------------------------------ */         
     /*  DEKLARERER VARIABLER SOM KUN BENYTTES I DENNE PROCEDURE     */         
     /* ------------------------------------------------------------ */         
     DCL SUM BUILTIN;                                                           
     DCL FREMTIDIG_POENG       FIXED DEC (03,2) INIT(0    ) ,                   
         SNITT                 FIXED DEC (03,2) INIT(0    ) ,                   
         SUM_POENG             FIXED DEC (07,3) INIT (0   ) ,                   
         DELT_PÅ               FIXED DEC (03  ) INIT (0   ) ,                   
         I                     FIXED BIN (15  ) INIT(0    ) ,                   
         J                     FIXED DEC ( 5  ) INIT(0    ) ,                   
         K                     FIXED BIN (15  ) INIT(1967 ) ,                   
         L                     FIXED BIN (15  ) INIT(0    ) ,                   
         M                     FIXED BIN (15  ) INIT(0    ) ,                   
         HALVPARTEN            PIC       '(3)9' INIT(1    ) ,                   
         POENG_SISTE_3ÅR       FIXED DEC (05,3) INIT(0    ) ,                   
         RUNDING               FIXED DEC (05,3) INIT(0.005) ,                   
         SORTERTE_POENG(50)    FIXED DEC (05,3)             ,                   
         SUM_OPT               FIXED DEC (07,3) INIT (0   ) ,                   
         SUM_POENGTALL         FIXED DEC (07,3) INIT (0   ) ,                   
         SUM_POENGÅR           FIXED DEC (03  ) INIT (0   ) ,                   
         ANTALL_ÅR             FIXED DEC (03  ) INIT (0   ) ;                   
    DCL                                                                         
       POENG_TAB(1963:2050)        FIXED DEC(5,2);                              
    DCL                                                                         
       POENG_92 (1963:2050)        FIXED DEC(5,2);                              
    DCL                                                                         
       POENG_AKT(1963:2050)        FIXED DEC(5,2);                              
    DCL                                                                         
       STØRSTE_POENG(20)        FIXED DEC(5,2);                                 
    DCL                                                                         
       POENG_HALVPARTEN         FIXED DEC(5,2) INIT(0);                         
                                                                                
     /* ------------------------------------------------------------ */         
    SORTERTE_POENG(*) = 0;                                                      
    POENG_TAB(*) = 0;                                                           
    POENG_AKT(*) = 0;                                                           
    POENG_92 (*) = 0;                                                           
    W_POREKKE = POREKKE(BER_SØ_IND);                                            
     /* DANNING AV POENG ETTER LOV92 :                               */         
     DO I = FM_PÅ TO SM_PÅ;                                                     
        IF I < 1992 THEN                                                        
           IF W_POREKKE.POENG(I) > 5.00 THEN                                    
              IF W_POREKKE.POENG(I) > 7.00 THEN                                 
                 POENG_92(I) =                                                  
                    W_POREKKE.POENG(I) - 7 + 5 +2/3 + RUNDING;                  
              ELSE                                                              
                 POENG_92(I) =                                                  
                    + 5                                                         
                    + (W_POREKKE.POENG(I)-5) * 1/3 + RUNDING;                   
           ELSE                                                                 
              POENG_92(I) = W_POREKKE.POENG(I);                                 
        ELSE                                                                    
           POENG_92(I) = W_POREKKE.POENG(I);                                    
        W_POREKKE.POENG(K) = 0;                                                 
     END; /*DO I=1 ANTALL MULIGE POENGÅR */                                     
    W_POREKKE = POREKKE(BER_SØ_IND);                                            
                                                                                
  /* BEREGN OG OPPDATER MED EØS_POENG  -  GAMMEL LOV : */                       
                                                                                
    DO I = FM_PÅ TO SM_PÅ;                                                      
       IF W_POREKKE.POENG (I) > 0         &                                     
          ^(B02.INNTEKTSÅR_EØS(BER_SØ_IND,I))      THEN                         
          DO;                                                                   
             SUM_POENG = SUM_POENG + W_POREKKE.POENG(I);                        
             DELT_PÅ = DELT_PÅ + 1;                                             
          END;                                                                  
    END;                                                                        
                                                                                
    SNITT = SUM_POENG / DELT_PÅ + 0.005;                                        
                                                                                
    DO I = FM_PÅ TO SM_PÅ;                                                      
       IF B02.INNTEKTSÅR_EØS(BER_SØ_IND,I)         THEN                         
          IF W_POREKKE.POENG(I) < SNITT    THEN                                 
             DO;                                                                
                W_POREKKE.POENG(I) = SNITT;                                     
                POREKKE.POENG(BER_SØ_IND,I) = SNITT;                            
             END;                                                               
       IF W_POREKKE.POENG(I) > 0     THEN                                       
          ANTALL_ÅR = ANTALL_ÅR + 1;                                            
    END;                                                                        
                                                                                
  /* BEREGN OG OPPDATER MED EØS_POENG  -  LOV92      : */                       
                                                                                
    SUM_POENG = 0;                                                              
    DELT_PÅ   = 0;                                                              
                                                                                
    DO I = FM_PÅ TO SM_PÅ;                                                      
       IF POENG_92 (I) > 0            &                                         
          ^(B02.INNTEKTSÅR_EØS(BER_SØ_IND,I))      THEN                         
          DO;                                                                   
             SUM_POENG = SUM_POENG + POENG_92(I);                               
             DELT_PÅ = DELT_PÅ + 1;                                             
          END;                                                                  
    END;                                                                        
                                                                                
    SNITT = SUM_POENG / DELT_PÅ + 0.005;                                        
                                                                                
    DO I = FM_PÅ TO SM_PÅ;                                                      
       IF B02.INNTEKTSÅR_EØS(BER_SØ_IND,I)         THEN                         
          IF POENG_92(I) < SNITT    THEN                                        
             POENG_92(I) = SNITT;                                               
    END;                                                                        
                                                                                
    IF B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,UF_IND) < 19920000    THEN               
       DO;                                                                      
          DO I = FM_PÅ TO SM_PÅ;                                                
             POENG_AKT(I) = W_POREKKE.POENG(I);                                 
          END;                                                                  
          CALL REGN_BUP;                                                        
          IF FREMTIDIG_POENG > 5         THEN                                   
             DO;                                                                
                DO I = FM_PÅ TO SM_PÅ;                                          
                   POENG_AKT(I) = POENG_92(I);                                  
                END;                                                            
                CALL REGN_BUP;                                                  
                IF FREMTIDIG_POENG < 5          THEN                            
                   FREMTIDIG_POENG = 5;                                         
             END;                                                               
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          DO I = FM_PÅ TO SM_PÅ;                                                
             POENG_AKT(I) = POENG_92(I);                                        
          END;                                                                  
          CALL REGN_BUP;                                                        
                                                                                
       END;                                                                     
     /* ------------------------------------------------------------ */         
                                                                                
     B02.BUP(BER_SØ_IND,UF_IND) = FREMTIDIG_POENG;                              
     IF B02.EØS_8_4_3A(BER_SØ_IND) = 'J'       !                                
        B02.UFØRPENS.VILKÅR_8_4_3A(BER_SØ_IND) = 'J'   THEN                     
        DO;                                                                     
           I = SM_PÅ + 1;                                                       
           POREKKE.BUP_FPP_ÅR(BER_SØ_IND) = SM_BUP_ÅR - SM_PÅ;                  
           POREKKE.KODE(BER_SØ_IND,I) = 'U54';                                  
           DO I = (SM_PÅ + 1) TO SM_BUP_ÅR;                                     
              W_POREKKE.POENG(I)         = FREMTIDIG_POENG;                     
              POREKKE.POENG(BER_SØ_IND,I) = FREMTIDIG_POENG;                    
              ANTALL_ÅR = ANTALL_ÅR + 1;                                        
           END;                                                                 
        END;                                                                    
                                                                                
     /* ------------------------------------------------------------ */         
     /*  BEREGNING AV SLUTTPOENGTALLET                               */         
     /*  SORTERER ALLE POENGÅR SLIK AT ELEMENT 1 INNEHOLDER HØYESTE  */         
     /* ------------------------------------------------------------ */         
     DO I = 1 TO 50;                                                            
        DO J = FM_PÅ TO SM_BUP_ÅR;                                              
           IF W_POREKKE.POENG(J) > SORTERTE_POENG(I) THEN                       
              DO;                                                               
                 SORTERTE_POENG(I) = W_POREKKE.POENG(J);                        
                 K = J;                                                         
              END;                                                              
        END;                                                                    
        W_POREKKE.POENG(K) = 0;                                                 
     END; /*DO I=1 ANTALL MULIGE POENGÅR */                                     
     /* ------------------------------------------------------------- */        
           SUM_POENGÅR = MIN(ANTALL_ÅR,20);                                     
           SUM_POENGTALL,                                                       
           SUM_OPT       = 0;                                                   
           IF (SUM_POENGÅR > 0) THEN                                            
              DO;                                                               
                 SUM_POENGTALL = 0;                                             
                 DO I = 1 TO SUM_POENGÅR;                                       
                    SUM_POENGTALL = SUM_POENGTALL + SORTERTE_POENG(I);          
                    IF SORTERTE_POENG(I) > 4 THEN                               
                       SUM_OPT = SUM_OPT + 4;                                   
                    ELSE                                                        
                       SUM_OPT = SUM_OPT + SORTERTE_POENG(I);                   
                 END;                                                           
                 IF B02.SPESOPPL.OVERKOMP_UTL(BER_SØ_IND) = 'J' THEN            
                    W_OPT(2) = SUM_OPT/SUM_POENGÅR + RUNDING;                   
                 W_SPT(2) = SUM_POENGTALL/SUM_POENGÅR + RUNDING;                
              END;                                                              
                                                                                
  REGN_BUP: PROC;                                                               
     POENG_SISTE_3ÅR =                                                          
        + (POENG_AKT(SM_PÅ - 2)                                                 
        +  POENG_AKT(SM_PÅ - 1)                                                 
        +  POENG_AKT(SM_PÅ    )   ) / 3 + RUNDING;                              
                                                                                
    HALVPARTEN = ((SM_PÅ - FM_PÅ + 1) / 2) + 0.5;                               
    IF HALVPARTEN > 20 THEN                                                     
       HALVPARTEN = 20;                                                         
    DO I = FM_PÅ TO SM_PÅ;                                                      
       POENG_TAB(I) = POENG_AKT(I);                                             
    END;                                                                        
    STØRSTE_POENG = 0;                                                          
    DO I = 1 TO HALVPARTEN;                                                     
       /* PLUKKER UT HALVPARTEN AV DE BESTE POENGENE */                         
       DO J = FM_PÅ TO SM_PÅ;                                                   
          IF POENG_TAB(J) > STØRSTE_POENG(I) THEN                               
             DO;                                                                
                STØRSTE_POENG(I) = POENG_TAB(J);                                
                K = J;                                                          
             END;                                                               
       END;                                                                     
       IF K > 0           THEN    /*0007 - HL*/                                 
          POENG_TAB(K) = 0;                                                     
    END;                                                                        
                                                                                
    IF HALVPARTEN > 0      THEN          /*9905*/                               
       POENG_HALVPARTEN = SUM(STØRSTE_POENG) / HALVPARTEN + RUNDING;            
                                                                                
                                                                                
     IF POENG_SISTE_3ÅR > POENG_HALVPARTEN           THEN                       
        FREMTIDIG_POENG = POENG_SISTE_3ÅR;                                      
     ELSE                                                                       
        FREMTIDIG_POENG = POENG_HALVPARTEN;                                     
                                                                                
  END REGN_BUP;                                                                 
  /* ************************************************************ */            
  END SPT_GAR;                                                                  
