 /*   SIST ENDRET PÅ PROD   2006.04.07  9.57.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.37.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.08 13.18.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.34.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.58.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.15 13.56.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.14.46 AV   JDA2970          */        
 /*       SIST ENDRET 26/03-99 13.24.54 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.12.56 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 12.41.28 AV   JDA7339                  */        
 /*       SIST ENDRET 15/06-98 08.00.22 AV   RFA9991                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R001UE09  -                                                    */        
 /*    PROGRAMMERER:                                                  */        
 /*HENSIKT:                                                           */        
 /*    R001UE09 INNHOLDER:                                            */        
 /*      PROSEDYRE FOR BLANKING AV EN_MAP.                            */        
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */        
 /*           EN_TRANS_OMR.                                           */        
 /*ENDRING:                                                           */        
 /*    PROSEDYRENE ER SKILT UT FRA R001UE02.     070587  BRITT        */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV ENDRINGSBLANKETTER TIL   */        
 /*    DET MASKINELLE FOLKETRYGDSYSTEMET.                             */        
 /*    ARBEIDSOMRÅDE: P001UE01  (LIGGER I R001.TEST.COPYLIB)          */        
 /*BRUK:                                                              */        
 /*    %INCLUDE R001UE09;                                             */        
 /*    BLANK_EN_MAP:      SETTE LOW VALUES TIL MAPEN OG               */        
 /*                       BLANKER MELDINGSFELTENE.                    */        
 /*    OVERFØR_EN_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */        
 /*    OVERFØR_EN_KAP7:   OVERFØRER KAPITTEL 7 MAP->ARBEIDSOMRÅDE     */        
 /*    OVERFØR_EN_KAP8:   OVERFØRER KAPITTEL 8 MAP->ARBEIDSOMRÅDE     */        
 /*    OVERFØR_EN_KAP10:  OVERFØRER KAPITTEL 10 MAP-> ARBEIDSOMRÅDE   */        
 /*    OVERFØR_EN_KAP11:  OVERFØRER KAPITTEL 11 MAP-> ARBEIDSOMRÅDE */          
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR Å SETTE LOW VALUES TIL MAP, SAMT                  */        
 /*   BLANKE MELDINGSFELTENE.                                         */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BLANK_EN_MAP:PROC;                                                             
   DCL                                                                          
     LOW BUILTIN;                                                               
                                                                                
       NAVN_NYTTO      = LOW(25);                                               
       NAVN_NYTT_EKO   = LOW(25);                                               
       FNR_EKO         = LOW(11);                                               
       NAVN_EKO        = LOW(25);                                               
       SKILSMISSEO     = LOW(1);                                                
       SIVILSTANDO     = LOW(1);                                                
       FLYTTET_FRAO    = LOW(1);                                                
       FLYTTET_SAMMENO = LOW(1);                                                
       OPPHØR_SAMBOO   = LOW(1);                                                
       EK_INNT_OVER_2GO = LOW(1);                                               
       RED_GP_3_2_5O = LOW(1);                                                  
       OVER4GO        = LOW(1);                                                 
  /*   FAIO            = LOW(7);    */                                          
                                                                                
       FAIO            = 0;                                                     
       FORVENTET_INNTO = 0;                                                     
       INNTEKT_FØR_UPO = 0;                                                     
       PI_SØKERO       = 0;                                                     
       AI_SØKERO       = 0;                                                     
       PI_EKO          = 0;                                                     
       AI_EKO          = 0;                                                     
       NORDISK_TPO     = 0;                                                     
       EØS_PENSJONO    = 0;                                                     
                                                                                
                                                                                
       INNT_DATO_MÅO   = LOW(4);                                                
       UFGO            = LOW(3);                                                
       REAKTIVISERINGO = LOW(1);                                                
       UNNTAK_VENTETIDO= LOW(1);                                                
       FRYSP_5ÅR_ARBO  = LOW(1);                                                
       FRYSP_TIDSBO    = LOW(1);                                                
       LØNNSTILSKO     = LOW(1);                                                
       LØNNSTILSKO     = LOW(1);                                                
       YUGO            = LOW(3);                                                
       O_TIL_PENSJONO  = LOW(1);                                                
       FRADRAG_2GO     = LOW(1);                                                
       FRAML_DATO_MÅO  = LOW(4);                                                
       OPPHØR_EOO      = LOW(1);                                                
                                                                                
       OVER4GO         = LOW(1);                                                
                                                                                
       STATSBORGERO    = '000';                                                 
       BOSTEDO         = '000';                                                 
       NORDISK_LANDO   = LOW(3);                                                
       INNT_PRØVET_EØS_PENSO = ' ';                                             
       TT_EØS_ANT_ÅRO   = LOW(2);                                               
       TT_EØS_ANT_MNDO  = LOW(2);                                               
       MELDING1O       = (78)' ';                                               
       MELDING2O       = (78)' ';                                               
       MELDING3O       = (78)' ';                                               
       MELDING4O       = (78)' ';                                               
       MELDING5O       = (78)' ';                                               
       MELDING6O       = (78)' ';                                               
   END BLANK_EN_MAP;                                                            
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */        
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL EN_TRANS_OMR I              */        
 /*   KOM_OMR FOR EN_SØKER.                                           */        
 /*           MAPSET:  S001UE3   MAP S001UE1                          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERFØR_EN_SØKER:                                                              
   PROC;                                                                        
      IF REGDATOL           > 0 THEN                                            
         ENS.REGDATO_ÅMD    = KONV_ÅMD_HÅMD((REGDATOI));                        
      IF TERMIDL            > 0 THEN                                            
         ENS.TERMID         = TERMIDI;                                          
      IF FNRL               > 0 THEN                                            
         ENS.FNR            = F_FELT_CHAR_PIC11((FNRI));                        
      IF TKNRL              > 0 THEN                                            
         ENS.TKNR           = F_FELT_CHAR_PIC4 (TKNRI);                         
      IF SPRÅKL             > 0 THEN                                            
         ENS.SPRÅK          = SPRÅKI;                                           
      IF VIRK_DATO_MÅL      > 0 THEN                                            
         ENS.VIRK_DATO_ÅMD  = KONV_MÅ_HÅMD((VIRK_DATO_MÅI));                    
      IF NAVN_NYTTL         > 0 THEN                                            
         ENS.NAVN_NYTT      = NAVN_NYTTI;                                       
      IF NAVN_NYTT_EKL      > 0 THEN                                            
         ENS.NAVN_NYTT_EK   = NAVN_NYTT_EKI;                                    
      IF FNR_EKL            > 0 THEN                                            
         DO;                                                                    
            ENS.FNR_EK         = F_FELT_CHAR_PIC11((FNR_EKI));                  
 /* ********                                                                    
            IF SIVILSTANDL        > 0 THEN                                      
               IF SIVILSTANDI    = 'P'      !                                   
                  SIVILSTANDI    = 'W'      THEN                                
                  ENS.FLYTTET_SAMMEN = 'X';                                     
  *************** 0797 HL ************************** */                         
         END;                                                                   
      IF NAVN_EKL           > 0 THEN                                            
         ENS.NAVN_EK        = NAVN_EKI;                                         
      IF SKILSMISSEL        > 0           THEN                                  
         ENS.SKILSMISSE     = SKILSMISSEI;                                      
      IF FLYTTET_FRAL       > 0 THEN                                            
         ENS.FLYTTET_FRA    = FLYTTET_FRAI;                                     
      IF FLYTTET_SAMMENL    > 0 THEN                                            
         ENS.FLYTTET_SAMMEN = FLYTTET_SAMMENI;                                  
                                                                                
      IF OPPHØR_SAMBOL      > 0      THEN                                       
         ENS.OPPHØR_SAMBO   = OPPHØR_SAMBOI;                                    
                                                                                
      IF EK_INNT_OVER_2GL > 0 THEN                                              
         ENS.EK_INNT_OVER_2G = EK_INNT_OVER_2GI;                                
                                                                                
      IF RED_GP_3_2_5L > 0 THEN                                                 
         ENS.RED_GP_3_2_5 = RED_GP_3_2_5I;                                      
                                                                                
      IF SIVILSTANDL        > 0      THEN       /*0797 HL*/                     
         ENS.SIVILSTAND     = SIVILSTANDI;                                      
                                                                                
   END OVERFØR_EN_SØKER;                                                        
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                       */        
 /*   SKJERMBILDET TIL EN_TRANS_OMR I KOM_OMR FOR EN_KAPITTEL 7       */        
 /*                 MAPSET S001UE3   MAP S001UE1                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERFØR_EN_KAP7:                                                               
   PROC;                                                                        
      IF FAIL         > 0 THEN                                                  
         ENK7.FAI     = F_FELT_CHAR_PIC7((FAII));                               
   END OVERFØR_EN_KAP7;                                                         
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                       */        
 /*   SKJERMBILDET TIL EN_TRANS_OMR I KOM_OMR FOR EN_KAPITTEL 8       */        
 /*                 MAPSET S001UE3   MAP S001UE1                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERFØR_EN_KAP8:                                                               
   PROC;                                                                        
      IF INNTEKT_FØR_UPL > 0 THEN                                               
         ENK8.INNTEKT_FØR_UP = F_FELT_CHAR_PIC7((INNTEKT_FØR_UPI));             
                                                                                
      IF INNT_DATO_MÅL > 0 THEN                                                 
         ENK8.INNT_DATO_ÅMD = KONV_MÅ_HÅMD((INNT_DATO_MÅI));                    
                                                                                
      IF UFGL     > 0 THEN                                                      
         ENK8.UFG = F_FELT_CHAR_PIC3((UFGI));                                   
                                                                                
      IF FRYSP_TIDSBL > 0 THEN                                                  
         ENK8.FRYSP_TIDSB = FRYSP_TIDSBI ;                                      
      IF LØNNSTILSKL > 0 THEN                                                   
         ENK8.LØNNSTILSKUDD = LØNNSTILSKI ;                                     
      IF FRYSP_5ÅR_ARBL > 0 THEN                                                
         ENK8.FRYSP_5ÅR_ARB = FRYSP_5ÅR_ARBI ;                                  
      IF UNNTAK_VENTETIDL > 0 THEN                                              
         ENK8.UNNTAK_VENTETID = UNNTAK_VENTETIDI ;                              
      IF REAKTIVISERINGL > 0 THEN                                               
         ENK8.REAKTIVISERING = REAKTIVISERINGI ;                                
   END OVERFØR_EN_KAP8;                                                         
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                       */        
 /*   SKJERMBILDET TIL EN_TRANS_OMR I KOM_OMR FOR EN_KAPITTEL 10      */        
 /*                 MAPSET S001UE3   MAP S001UE1                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERFØR_EN_KAP10:                                                              
   PROC;                                                                        
      IF FORVENTET_INNTL     > 0 THEN                                           
         ENK10.FORVENTET_INNT = F_FELT_CHAR_PIC7((FORVENTET_INNTI));            
      IF O_TIL_PENSJONL      > 0 THEN                                           
         ENK10.O_TIL_PENSJON = O_TIL_PENSJONI;                                  
      IF FRADRAG_2GL         > 0 THEN                                           
         ENK10.FRADRAG_2G    = (FRADRAG_2GI);                                   
      IF FRAML_DATO_MÅL      > 0 THEN                                           
         ENK10.FRAML_DATO_ÅMD = KONV_MÅ_HÅMD((FRAML_DATO_MÅI));                 
      IF OPPHØR_EOL          > 0 THEN                                           
         ENK10.OPPHØR_EO     = OPPHØR_EOI;                                      
                                                                                
   END OVERFØR_EN_KAP10;                                                        
 /* *********************************************************** */              
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                 */              
 /*   SKJERMBILDET TIL EN_TRANS_OMR I KOM_OMR FOR EN_KAPITTEL 11*/              
 /*                 MAPSET S001UE3   MAP S001UE1                */              
 /*                                                             */              
 /* *********************************************************** */              
 OVERFØR_EN_KAP11:PROC;                                                         
      IF YUGL     > 0 THEN                                                      
         ENK11.YUG = F_FELT_CHAR_PIC3((YUGI));                                  
 END OVERFØR_EN_KAP11;                                                          
 /* *********************************************************** */              
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                 */              
 /*   SKJERMBILDET TIL EN_TRANS_OMR I KOM_OMR FOR EN_INNTEKT    */              
 /*                 MAPSET S001UE3   MAP S001UE1                */              
 /*                                                             */              
 /* *********************************************************** */              
 OVERFØR_EN_INNTEKT:                                                            
   PROC;                                                                        
      IF PI_SØKERL          > 0 THEN                                            
         EN_INNTEKT.PENSJONSINNT_SØKER = F_FELT_CHAR_PIC6((PI_SØKERI));         
      IF PI_EKL             > 0 THEN                                            
         EN_INNTEKT.PENSJONSINNT_EK = F_FELT_CHAR_PIC6((PI_EKI));               
      IF AI_SØKERL           > 0 THEN                                           
         EN_INNTEKT.ARBEIDSINNT_SØKER = F_FELT_CHAR_PIC7((AI_SØKERI));          
      IF AI_EKL             > 0 THEN                                            
         EN_INNTEKT.ARBEIDSINNT_EK = F_FELT_CHAR_PIC7((AI_EKI));                
                                                                                
      IF OVER4GL           > 0 THEN                                             
         EN_INNTEKT.MINST_4G  = OVER4GI;                                        
                                                                                
                                                                                
   END OVERFØR_EN_INNTEKT;                                                      
 /* *********************************************************** */              
 /*   PROSEDYRE FOR Å OVERFØRE OPPLYSNINGER FRA                 */              
 /*   SKJERMBILDET TIL EN_TRANS_OMR I KOM_OMR FOR EN_SPES       */              
 /*                 MAPSET S001UE3   MAP S001UE1                */              
 /*                                                             */              
 /* *********************************************************** */              
 OVERFØR_EN_SPES:                                                               
   PROC;                                                                        
                                                                                
      IF STATSBORGERL       > 0  THEN                                           
         EN_SPES.STATSBORGER =  STATSBORGERI;                                   
      IF BOSTEDL            > 0  THEN                                           
         EN_SPES.BOSTED      = BOSTEDI;                                         
      IF NORDISK_TPL        > 0  THEN                                           
         EN_SPES.TP_NORDISK  =  F_FELT_CHAR_PIC7(NORDISK_TPI);                  
      IF NORDISK_LANDL      > 0  THEN                                           
         EN_SPES.TP_NORDISK_LAND  = NORDISK_LANDI;                              
      IF EØS_PENSJONL       > 0  THEN                                           
         EN_SPES.PENSJON_EØS   = F_FELT_CHAR_PIC7(EØS_PENSJONI);                
      IF INNT_PRØVET_EØS_PENSL > 0 THEN                                         
         EN_SPES.INNT_PRØVET_EØS_PENS =   INNT_PRØVET_EØS_PENSI ;               
      IF TT_EØS_ANT_ÅRL > 0 THEN                                                
         EN_SPES.TT_EØS_ANT_ÅR = TT_EØS_ANT_ÅRI;                                
      IF TT_EØS_ANT_MNDL > 0 THEN                                               
         EN_SPES.TT_EØS_ANT_MND = TT_EØS_ANT_MNDI;                              
                                                                                
   END OVERFØR_EN_SPES;                                                         
