 /*       SIST ENDRET 09/06-98 08.30.59 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 13.59.01 AV   HLA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R001UC04 - PROGRAM I PLI                                       */00000030
 /*    PROGRAMMERT AV HERMAN NOV 93                                   */00000040
 /*HENSIKT:                                                           */00000050
 /*    PROGRAMMET BEHANDLER BARNEDELEN.                               */00000060
 /*BRUK:                                                              */00000070
 /*    KONTROLL_FO_BARN                                               */00000080
 /*       (FEIL_UC04)                                                 */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 %SKIP(2);                                                              00000120
 KONTROLL_FO_BARN:                                                      00000130
   PROC (FEIL_UC04);                                                    00000140
 %SKIP;                                                                 00000150
   DCL                                                                  00000160
      FEIL_UC04 BIT (1);                                                00000170
   DCL                                                                  00000180
      1 FNR_REG,                                                        00000190
        2 FNR1         FIXED DEC(11),                                   00000200
        2 FNR2         FIXED DEC(11),                                   00000210
        2 BRUKERID     CHAR     ( 4);                                   00000220
    DCL   FELLES_BARN_J  CHAR     ( 1),                                 00000230
          FELLES_BARN_N  CHAR     ( 1);                                 00000240
   DCL                                                                  00000250
      (FEIL19,                                                          00000260
      FEIL20,                                                           00000270
      FEIL21,                                                           00000280
      FEIL22) BIT (1);                                                  00000290
      FEIL19 = '0'B;                                                    00000300
      FEIL20 = '0'B;                                                    00000310
      FEIL21 = '0'B;                                                    00000320
      FEIL22 = '0'B;                                                    00000330
   DCL                                                                  00000340
      TELL                        FIXED BIN(15),                        00000350
      TELL_BARN                   FIXED BIN(15),                        00000360
      ANT_BARN                    FIXED BIN(15);                        00000370
   DCL                                                                  00000380
      ALDER FIXED(5);                                                   00000390
   DCL HJ_VIRK_DATO_ÅM            PIC '(6)9';     /*2000*/              00000400
   DCL FELLES_FØR                 CHAR (1)  INIT (' ');                 00000410
                                                                        00000420
 /*PROGRAMMET BEGYNNER HER:*/                                           00000430
                                                                        00000440
      HJ_VIRK_DATO_ÅM = FOS.VIRK_DATO_ÅMD / 100; /*2000 TS201098*/      00000450
      TELL_BARN = 0;                                                    00000460
      FELLES_BARN_N = ' ';                                              00000470
      FELLES_BARN_J = ' ';                                              00000480
      FNR_REG.BRUKERID =    DIV_PARAM_OMR.CICS_IND;                     00000490
                                                                        00000500
      CALL BLANK_FO_BARN_REST;                                          00000510
                                                                        00000520
      DO ANT_BARN = 1 TO FOS.BT_ANT;                                    00000530
         IF F_FELT_PIC_CHAR11(FOB.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN   00000540
            DO;                                                         00000550
               IF ^F_NUMERISK(F_FELT_PIC_CHAR11(FOB.FNR_BARN(ANT_BARN)))00000560
               THEN                                                     00000570
                  DO;                                                   00000580
                     IF ^FEIL19 THEN                                    00000590
                        DO;                                             00000600
                           FEIL19 = '1'B;                               00000610
                           FOB.FNR_BARNNR(ANT_BARN) = 200;              00000620
                        END;                                            00000630
                     ELSE                                               00000640
                        FOB.FNR_BARNNR(ANT_BARN) = 200;                 00000650
                  END;                                                  00000660
               ELSE                                                     00000670
               IF ^ F_GYLDIG_FNR(FOB.FNR_BARN(ANT_BARN)) THEN           00000680
                  DO;                                                   00000690
                     IF ^FEIL20 THEN                                    00000700
                        DO;                                             00000710
                           FEIL20 = '1'B;                               00000720
                           FOB.FNR_BARNNR(ANT_BARN) = 20;               00000730
                        END;                                            00000740
                     ELSE                                               00000750
                        FOB.FNR_BARNNR(ANT_BARN) = 999;                 00000760
                  END;                                                  00000770
               ELSE                                                     00000780
                  DO;                                                   00000790
                    FNR_REG.FNR1 = FOB.FNR_BARN(ANT_BARN);              00000800
                    EXEC CICS LINK PROGRAM('R0019906')COMMAREA(FNR_REG);00000810
                    IF FNR_REG.FNR2 > 0 THEN                            00000820
                      DO;                                               00000830
                         FOB.FNR_BARNNR(ANT_BARN) = 203;                00000840
                         FOB.FNR_GML_BARN(ANT_BARN) =                   00000850
                         FOB.FNR_BARN(ANT_BARN);                        00000860
                         FOB.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;         00000870
                      END;                                              00000880
                     ALDER =                                            00000890
                     F_ALDER(FOB.FNR_BARN(ANT_BARN),                    00000900
                             FOS.VIRK_DATO_ÅMD);  /*2000*/              00000910
                     IF ALDER > 1800 THEN                               00000920
                        DO;                                             00000930
                           IF ^FEIL21 THEN                              00000940
                              DO;                                       00000950
                                 FEIL21 = '1'B;                         00000960
                                 FOB.FNR_BARNNR(ANT_BARN) = 21;         00000970
                              END;                                      00000980
                           ELSE                                         00000990
                              FOB.FNR_BARNNR(ANT_BARN) = 999;           00001000
                        END;                                            00001010
                     ELSE                                               00001020
                     IF HJ_VIRK_DATO_ÅM > 199100 THEN  /*2000*/         00001030
                       DO;                                              00001040
                        IF ALDER < 1 THEN                               00001050
                           DO;                                          00001060
                              IF ^FEIL22 THEN                           00001070
                                 DO;                                    00001080
                                    FEIL22 = '1'B;                      00001090
                                    FOB.FNR_BARNNR( ANT_BARN) = 22;     00001100
                                 END;                                   00001110
                              ELSE                                      00001120
                                 FOB.FNR_BARNNR( ANT_BARN) = 999;       00001130
                           END;                                         00001140
                       END;                                             00001150
                     ELSE                                               00001160
                        IF ALDER < 0 THEN                               00001170
                           DO;                                          00001180
                              IF ^FEIL22 THEN                           00001190
                                 DO;                                    00001200
                                    FEIL22 = '1'B;                      00001210
                                    FOB.FNR_BARNNR( ANT_BARN) = 22;     00001220
                                 END;                                   00001230
                              ELSE                                      00001240
                                 FOB.FNR_BARNNR( ANT_BARN) = 999;       00001250
                           END;                                         00001260
                  END;                                                  00001270
               IF HJ_VIRK_DATO_ÅM > 199104  THEN  /*2000*/              00001280
                  DO;                                                   00001290
                     IF FOB.FELLES_ETTER0591(ANT_BARN) = 'J' !          00001300
                        FOB.FELLES_ETTER0591(ANT_BARN) = 'N' THEN       00001310
                           FOB.FELLES_FØR0591(ANT_BARN) = ' ';          00001320
                     ELSE                                               00001330
                        DO;                                             00001340
                           FEIL_UC04 = '1'B;                            00001350
                           FOB.FELLES_ETTER0591NR(ANT_BARN) = 272;      00001360
                        END;                                            00001370
                     IF FOB.FELLES_ETTER0591(ANT_BARN) = 'J' THEN       00001380
                        FELLES_BARN_J = 'J';                            00001390
                                                                        00001400
                     IF FOB.FELLES_ETTER0591(ANT_BARN) = 'N' &          00001410
                        ARBEIDSINNTEKT_EK > 0               THEN        00001420
                           FELLES_BARN_N = 'J';                         00001430
                  END;                                                  00001440
               ELSE /*VIRKDATO ER DA FØR 9105*/                         00001450
                  DO;                                                   00001460
                     IF ^ (FELLES_FØR0591(ANT_BARN) = 'J'   !           00001470
                           FELLES_FØR0591(ANT_BARN) = 'N' )   THEN      00001480
                        DO;                                             00001490
                           FEIL_UC04 = '1'B;                            00001500
                           FOB.FELLES_FØR0591NR(ANT_BARN) = 272;        00001510
                        END;                                            00001520
                     ELSE                                               00001530
                        DO;                                             00001540
                           FELLES_FØR = 'J';                            00001550
                           FOB.FELLES_ETTER0591(ANT_BARN) = ' ' ;       00001560
                        END;                                            00001570
                           IF FOS.FNR_EK = 0  THEN                      00001580
                              FELLES_FØR = ' ';                         00001590
                  END;                                                  00001600
                                                                        00001610
               TELL_BARN = TELL_BARN + 1;                               00001620
            END;                                                        00001630
         ELSE                                                           00001640
            LEAVE;                                                      00001650
      END;                                                              00001660
      IF FELLES_BARN_J = ' ' &                                          00001670
         FELLES_BARN_N = 'J' THEN                                       00001680
         DO;                                                            00001690
           FOB.FELLES_ETTER0591NR(1) = 384;                             00001700
           FEIL_UC04 = '1'B;                                            00001710
         END;                                                           00001720
      IF FELLES_FØR = 'J'  &                                            00001730
         MINST_4G = ' '          THEN                                   00001740
           DO;                                                          00001750
              FEIL_UC04 = '1'B;                                         00001760
              MINST_4GNR   = 493;                                       00001770
           END;                                                         00001780
                                                                        00001790
      IF ^ FEIL_UC04 THEN                                               00001800
        IF FOS.BT_ANT ^= TELL_BARN THEN                                 00001810
           DO;                                                          00001820
              FEIL_UC04 = '1'B;                                         00001830
              FOS.BT_ANTNR = 23;                                        00001840
           END;                                                         00001850
                                                                        00001860
      FEIL_UC04 = FEIL_UC04 ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22;        00001870
                                                                        00001880
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00001890
      IF ^FEIL_UC04 THEN                                                00001900
        IF FOS.BT_ANT > 0 THEN                                          00001910
           DO ANT_BARN = 1 TO FOS.BT_ANT;                               00001920
              DO TELL = ANT_BARN TO FOS.BT_ANT;                         00001930
                 IF TELL ^= ANT_BARN THEN                               00001940
                    IF FOB.FNR_BARN(TELL) = FOB.FNR_BARN(ANT_BARN) THEN 00001950
                       DO;                                              00001960
                          FEIL_UC04 = '1'B;                             00001970
                          FOB.FNR_BARNNR(ANT_BARN) = 124;               00001980
                          FOB.FNR_BARNNR(TELL) = 999;                   00001990
                       END;                                             00002000
              END;                                                      00002010
           END;                                                         00002020
                                                                        00002030
   END KONTROLL_FO_BARN;                                                00002040
                                                                        00002050
                                                                        00002060
