 /*   SIST ENDRET PÅ PROD   2008.05.31 11.10.48 AV   SPA2990          */        
 /*       SIST ENDRET 19/11-97 08.13.54 AV   SPA7339                  */        
 /*       SIST ENDRET 09/04-90 13.27.15 AV   DYBVIK                   */        
 /*       SIST ENDRET 05/05-86 13.00.27 AV   DYBVIK                   */        
 /*  NB:  MÅ ENDERS R001B004                                          */        
 /*  NB:  MÅ ENDERS R001B004                                          */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*     R0019956 - P9956_BER_G_CICS - PROSEDYRE I PLI.                */        
 /*     PROGRAMMERER: JAN Y. DYBVIK, JANUAR 1986                      */        
 /* HENSIKT:                                                          */        
 /*     LESE INN GRUNNBELØP OG GRUNNBELØP VEIET I CICSPROGRAMMER      */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*     PROSEDYREN BLIR INKLUDERT I CICSPROGRAMMER SOM BRUKER         */        
 /*     GRUNNBELØPSTABELLEN OG TABELLEN FOR GRUNNBELØP VEIET GRUNN-   */        
 /*     BELØP.                                                        */        
 /* BRUK:                                                             */        
 /*                                                                   */        
 /* ***************************************************************** */        
   P9956_BER_G_CICS:                                                            
      PROC ( W9956_PIDENT,W9956_OMR);                                           
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* DIVERSE DEKLARASJONER                                             */        
 /* ***************************************************************** */        
                                                                                
 /* DCL INNFIL FILE RECORD INPUT                 KEYED ENV (VSAM); */           
                                                                                
      DCL W9956_PIDENT              CHAR    (8),                                
          W9956_OMR                 CHAR    (1440);                             
                                                                                
      DCL W9956_NR                  PIC '999',                                  
          W9956_OMR1                CHAR    (1448),                             
          W9956_OMR2 DEF W9956_OMR1 CHAR    (1440) POS(9),                      
          W9956_MELDING             CHAR    (80);                               
                                                                                
 /* ***************************************************************** */        
 /* HER STARTER PROGRAMMET.                                           */        
 /* ***************************************************************** */        
                                                                                
          ON ERROR SNAP BEGIN;                                                  
                                                                                
                 W9956_NR           = 500;                                      
                 W9956_MELDING      = 'FEIL VED LES';                           
                 GOTO L9956;                                                    
          END;                                                                  
                                                                                
          EXEC CICS HANDLE CONDITION ERROR  (L9910);                            
                                                                                
          EXEC CICS READ DATASET ('INITTAB') INTO (W9956_OMR1)                  
                                           RIDFLD (W9956_PIDENT);               
                                                                                
                                                                                
          W9956_OMR          = W9956_OMR2;                                      
                                                                                
  GO TO L9956;                                                                  
                                                                                
  L9910:                                                                        
          FEIL_MELD_NR       = 507;                                             
          FEIL_VED_LABEL     = '9910';                                          
  L9956:                                                                        
                                                                                
    END P9956_BER_G_CICS;                                                       
