 /*   SIST ENDRET PÅ PROD   2004.12.17 15.34.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.12.05  8.37.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.12.04 16.08.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.01.18 10.35.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.21 10.32.16 AV   JDA7339          */        
 /*       SIST ENDRET 07/05-98 14.15.39 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 14.30.05 AV   JDA7339                  */        
 /*********************************************************************/        
 /*                                                                   */        
 /* IDENTIFIKASJON:                                                   */        
 /*    R0016001 - LAG_DYNAMISK_STATISTIKK_TRANS                       */        
 /*                                                                   */        
 /*    PROGRAMMERER: P. BREIVIK, JULI 1982.                           */        
 /*                                                                   */        
 /* HENSIKT:                                                          */        
 /*    DANNER TRANSAKSJONER (SEGMENTER) TIL STAT-TRANS-BASEN.         */        
 /*                                                                   */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*    HENTER INN UNDERPROGRAMMENE SOM KILDE-TEKST                    */        
 /*    (  R0016021 - DIVERSE HJELPERUTINER.   UTGÅR  BØ9112)          */        
 /*       R0016022 - BEHANDLING AV PERSON 1 OG PERSON 2 (MOR & FAR).  */        
 /*       R0016023 - BEHANDLING AV PERSONENE 3 TIL 14 (BARN).         */        
 /*                - FOM. 9112 MANGE INCLUDE-PGM. - SE NEDERST I PGM. */        
 /*                                                                   */        
 /* O B S :                                                           */        
 /*    VED UTREGNING AV FAKTORER AV G ): SUM-YTELSE * 12 / G , MÅ     */        
 /*                                      --------------------         */        
 /*    FØLGENDE PASSES PÅ: HVIS SUM-YTELSE ER ET REGNESTYKKE MED MER  */        
 /*    ENN 3 FELT, MÅ UTREGNINGEN DELES OPP OG HJELPEFELT BRUKES      */        
 /*    FORDI PL1'S ARBEIDSFELTER IKKE BLIR STORE NOK TIL SÅ MANGE     */        
 /*    REGNEOPERASJONER MED FELT DEFINERT SOM ANGJELDENDE ER.         */        
 /*                                                                   */        
 /*    LANDKODE FOR NORGE = 000 . LIGGER FAST I PROGRAMMET.           */        
 /* ENDRET: B01_TT_EGEN OG B02_TT_EGEN ØKT FRA 3->5. SEA2970 01042004 */        
 /* ENDRET:                                                           */        
 /*********************************************************************/        
                                                                                
 R001600: PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                 
                                                                                
 DCL (COMMAREA_PEKER)        POINTER;                                           
 DCL (X01_PEKER,X02_PEKER)   POINTER;                                           
 %PAGE;                                                                         
 DCL 1 B01 BASED (B01_PEKER), %INCLUDE P0019921;                                
 %PAGE;                                                                         
 DCL 1 B02 BASED (B02_PEKER), %INCLUDE P0019921;                                
                                                                                
 DCL 1 X01 BASED (X01_PEKER) LIKE B01;                                          
 DCL 1 X02 BASED (X02_PEKER) LIKE B02;                                          
 %PAGE;                                                                         
 %INCLUDE P0019906; /* TRANS_OPPL_OMR */                                        
                                                                                
 %INCLUDE P0019908; /* KOM_OMR */                                               
                                                                                
 DCL 1 TRANS_LISTE_OMR UNALIGNED BASED (TRANS_LISTE_PEKER),                     
       3 TRANS_LISTE_LINJE(5),                                                  
 %INCLUDE P0019911; /* TRANS_LISTE FAST/VARIABEL DEL */                         
                                                                                
 %INCLUDE P0019912; /* DIV_PARAM_OMR */                                         
                                                                                
 %PAGE;                                                                         
 %INCLUDE P0014009; /* POREKKE               */                                 
                                                                                
 %PAGE;                                                                         
 %INCLUDE P0016001; /* BOOLSK SEGMENT-TABELL */                                 
                                                                                
 %PAGE;                                                                         
 DCL 1 TR0ROT,                                                                  
 %INCLUDE P0016201; /* ARBEIDSOMRÅDE TR0ROT               */                    
 DCL 1 REGTPKT,                                                                 
 %INCLUDE P0016202; /* ARBEIDSOMRÅDE REGTPKT              */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 PTYPE,                                                                   
 %INCLUDE P0016203; /* ARBEIDSOMRÅDE PTYPE                */                    
 DCL 1 SIVILST,                                                                 
 %INCLUDE P0016204; /* ARBEIDSOMRÅDE SIVILST              */                    
 DCL 1 APOPPL,                                                                  
 %INCLUDE P0016205; /* ARBEIDSOMRÅDE APOPPL               */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 UPPER,                                                                   
 %INCLUDE P0016206; /* ARBEIDSOMRÅDE UPPER                */                    
 DCL 1 PENSJON,                                                                 
 %INCLUDE P0016207; /* ARBEIDSOMRÅDE PENSJON              */                    
 DCL 1 KT,                                                                      
 %INCLUDE P0016208; /* ARBEIDSOMRÅDE KT                   */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 VT,                                                                      
 %INCLUDE P0016209; /* ARBEIDSOMRÅDE VT                   */                    
 DCL 1 ET,                                                                      
 %INCLUDE P0016210; /* ARBEIDSOMRÅDE ET                   */                    
 DCL 1 BT,                                                                      
 %INCLUDE P0016211; /* ARBEIDSOMRÅDE BT                   */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 TILKN,                                                                   
 %INCLUDE P0016214; /* ARBEIDSOMRÅDE TILKN                */                    
 DCL 1 ETTERL,                                                                  
 %INCLUDE P0016215; /* ARBEIDSOMRÅDE ETTERL               */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 DIAGNOSE,                                                                
 %INCLUDE P0016216; /* ARBEIDSOMRÅDE DIAGNOSE             */                    
 DCL 1 YSKADE,                                                                  
 %INCLUDE P0016219; /* ARBEIDSOMRÅDE YSKADE               */                    
 DCL 1 SPESOPPL,                                                                
 %INCLUDE P0016217; /* ARBEIDSOMRÅDE SPESOPPL             */                    
 DCL 1 TR,                                                                      
 %INCLUDE P0016220; /* ARBEIDSOMRÅDE EØSINFO              */                    
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /*   DL/1 PARAMETRE                                                  */        
 /*-------------------------------------------------------------------*/        
 %INCLUDE DLIUIB;                                                               
 DCL PLITDLI                 EXTERNAL ENTRY;                                    
                                                                                
 DCL UIB_RC_OK               BIT (8) INIT(0);    /* KONSTANT */                 
 DCL 1 TR0_PCB_PEKER         BASED (UIBPCBAL),                                  
       2 TR0_PCB_PTR         POINTER;                                           
                                                                                
 DCL INSERT                  CHAR (4) INIT('ISRT');                             
 DCL PARAM_COUNT_3           FIXED BIN (31) INIT(3);                            
 DCL PARAM_COUNT_4           FIXED BIN (31) INIT(4);                            
 DCL PARAM_COUNT_5           FIXED BIN (31) INIT(5);                            
 DCL PARAM_COUNT_6           FIXED BIN (31) INIT(6);                            
 /*-------------------------------------------------------------------*/        
 /*   DEKLARASJON AV SSA                                              */        
 /*-------------------------------------------------------------------*/        
 DCL SSA_UNQUAL              CHAR (9);                                          
                                                                                
 DCL 1 SSA_TR0ROT UNALIGNED,                                                    
       2 HOVEDDEL            CHAR (17) INIT('TR0ROT  (FNR     '),               
       2 REL_OP              CHAR (2)  INIT(' ='),                              
       2 FNR_KEY             FIXED DEC (11),                                    
       2 END_MRK             CHAR (1)  INIT(')');                               
                                                                                
 DCL 1 SSA_REGTPKT UNALIGNED,                                                   
       2 HOVEDDEL            CHAR (17) INIT('REGTPKT (DATOKL  '),               
       2 REL_OP              CHAR (2)  INIT(' ='),                              
       2 DATO_KEY            FIXED DEC (09),                                    
       2 KLOKKE_KEY          FIXED DEC (09),                                    
       2 END_MRK             CHAR (1)  INIT(')');                               
 /*-------------------------------------------------------------------*/        
 /*   PCB-OMRÅDE                                                      */        
 /*-------------------------------------------------------------------*/        
 %INCLUDE P0012002;                                                             
                                                                                
 DCL 1 TR0_PCB               BASED (TR1_PCB_PEKER),                             
 %INCLUDE P0012003; /* PCB-OMRÅDE */                                            
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /*   HJELPEVARIABLE                                                  */        
 /*-------------------------------------------------------------------*/        
 DCL SAVE_B01_B02            FIXED BIN (15) INIT(0);                            
 DCL PENSJALDER              PIC '99' INIT(67);                                 
 DCL LOOPCONST               FIXED BIN (15) INIT(5);                            
 DCL (I,J,K,IX)              FIXED BIN (15);                                    
 DCL (I1,J1,K1)              FIXED BIN (15);                                    
 DCL IND                     FIXED BIN (15);                                    
 DCL TRUE                    BIT (1) INIT('1'B);                                
 DCL FALSE                   BIT (1) INIT('0'B);                                
 DCL (ENDRET,TP_ENDRET,                                                         
      FUNNET,FEIL)           BIT (1);                                           
 DCL (B01_TT_EGEN,                                                              
      B02_TT_EGEN)           FIXED DEC (5); /* ØKT FRA 3->5 SEA2970 */          
 DCL (TT_HELP,                                                                  
      B01_TT_AVD,                                                               
      B02_TT_AVD,                                                               
      B01_PÅ,                                                                   
      B02_PÅ,                                                                   
      B01_PÅ_E91,                                                               
      B02_PÅ_E91,                                                               
      M_PÅ,F_PÅ,                                                                
      FRA,TIL)               FIXED DEC (3);                                     
 DCL NORGE                   FIXED DEC (3) INIT (000); /* LANDSKODE   */        
 DCL (B01_SPT,B02_SPT,                                                          
      B01_OPT,B02_OPT,                                                          
      B01_YPT,B02_YPT,                                                          
      B01_SPT_GML,B02_SPT_GML,                                                  
      M_SPT,F_SPT,                                                              
      M_OPT,F_OPT)           FIXED DEC (3,2) INIT(0);                           
 DCL W_B02_SUM               FIXED DEC (5);  /* JFR. KOMM. ØVERST */            
                                                                                
 DCL (B01_PENSJON,                                                              
      B02_PENSJON)           FIXED DEC (5);                                     
 DCL W_FNR                   DEC FIXED (11);                                    
 DCL W_TRANSKODE             CHAR(4);                                           
 DCL W_KALL_FRA_PROGRAM_ID   CHAR(8);                                           
 DCL W_VIRKD                 PIC '(8)9';                                        
 DCL W_VIRKD_T               PIC '(8)9';                                        
 DCL (B01_STAT_PT1,                                                             
      B02_STAT_PT1)          CHAR (1) ;                                         
 DCL TEST_B02_PT1            CHAR (1) ;                                         
                                                                                
 DCL W_FNR_PIC               PIC '(11)9',                                       
     W_FNR_AAMM              CHAR ( 4)  ,                                       
     W_F_MM                  CHAR ( 2)         DEF W_FNR_PIC POS (3),           
     W_F_AA                  CHAR ( 2)         DEF W_FNR_PIC POS (5),           
     W_F_AA_N                PIC '( 2)9'       DEF W_FNR_PIC POS (5),           
     W_PNR3                  PIC '( 3)9'       DEF W_FNR_PIC POS (7);           
 DCL (B01_TP,B02_TP)         FIXED DEC (5);                                     
 DCL (M_FNR,F_FNR)           FIXED DEC (11);                                    
 DCL HELP_FNR                PIC '(11)9';                                       
 DCL HELP_DATO               PIC '(8)9';                                        
 DCL KODE                    CHAR (8) VARYING;                                  
 DCL PBR_TEXT                CHAR (50);                                         
 DCL W_ABSTIME         FIXED DEC  (15)      INIT (0);                           
 DCL W_ABS                   PIC '(15)9'    INIT (0),                           
     W_ABS_MILLI_SEK         PIC '(4)9' DEF W_ABS       POS(12);                
 /*  2000                                                                       
 DCL DATO_KLOKKE             PIC '(17)9',                                       
     DATO_ÅMD                PIC '(8)9' DEF DATO_KLOKKE,                        
     DATO                    PIC '(8)9' DEF DATO_KLOKKE,                        
     KLOKKE                  PIC '(9)9' DEF DATO_KLOKKE POS( 9),                
     MILLI_SEK               PIC '(4)9' DEF DATO_KLOKKE POS(14);                
     */                                                                         
 DCL DATO                    PIC '(8)9',                       /*2000*/         
     KLOKKE_CH               CHAR (9)  ,                       /*2000*/         
     KLOKKE                  PIC '(9)9' DEF KLOKKE_CH POS(1),  /*2000*/         
     MILLI_SEK               PIC '(4)9' DEF KLOKKE_CH POS(6);  /*2000*/         
 DCL IO_PEK                  POINTER;                                           
 DCL IO_AREA                 CHAR (150);                                        
 DCL IO_HELP_AREA            CHAR (150) BASED (IO_PEK);                         
 DCL (TIME,INDEX,                                                               
      SUBSTR,CSTG,ADDR,                                                         
      MIN,MAX,LENGTH,                                                           
      CHAR,VERIFY,FLOOR)     BUILTIN;                                           
  DCL HJ_TAI                FIXED DEC (7) INIT (0);                             
                                                                                
      HJ_TAI  = DIV_PARAM_OMR.TAI(1);                                           
      HJ_TAI  = DIV_PARAM_OMR.TAI(2);                                           
                                                                                
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /*                        S T A R T                                  */        
 /*                                                                   */        
 /* PROGRAM LAG_DYNAMISK_STATISTIKK_TRANS                             */        
 /*    HVIS NOEN AV FELTENE SOM HAR INTERESSE FOR STATISTIKK,         */        
 /*    ER ENDRET, SKAL DET GENERERES ET SEGMENT TIL STAT-TRANS-BASEN. */        
 /*    SEGMENTENE LEGGES I ARBEIDSFELTET 'STAT_TRANS' INNTIL ALLE     */        
 /*    SEGMENTENE PÅ ET FNR ER KLARE.                                 */        
 /*-------------------------------------------------------------------*/        
                                                                                
    PBR_TEXT = 'R0016001';                                                      
                                                                                
    W_KALL_FRA_PROGRAM_ID    =  DIV_PARAM_OMR.PROGRAM_ID;/*9806 SL OMR*/        
   IF FEIL_MELD_NR    =   0  THEN                                               
       DIV_PARAM_OMR.PROGRAM_ID = 'R0016001';                                   
       UIBPTR = UIB_PEKER;                                                      
       FEIL = TRUE;                                                             
                                                                                
    CALL OPPDAT_MOR_FAR;                                                        
                                                                                
    CALL OPPDAT_BARN;                                                           
                                                                                
    FEIL = FALSE;                                                               
                                                                                
 UTGANG:                                                                        
 /*-------------------------------------------------------------------*/        
 /* PROGRAMKONTROLLEN ENDER HER NÅR ALL OPPDATERING ER FORETATT       */        
 /* ELLER NÅR DET ER DETEKTERT EN FEIL I OPPDATERING AV ET SEGMENT.   */        
 /* VARIABELEN 'FEIL' AVGJØR FEIL-STATUS.                             */        
 /*-------------------------------------------------------------------*/        
                                                                                
    IF FEIL THEN                                                                
    DO;                                                                         
       PBR_TEXT = 'DL/I-RET. = ' !!                                             
                  CHAR(DLIUIB.UIBRCODE.UIBFCTR) !!                              
                  CHAR(DLIUIB.UIBRCODE.UIBDLTR) !!                              
                  '  STATUS-KODE = ' !! TR0_PCB.STATUS_KODE;                    
       PBR_TEXT = 'SEGMENT-NIVÅ = ' !! TR0_PCB.SEGM_NIVAA ;                     
    END;                                                                        
 /* ELSE                                                                        
       PBR_TEXT = 'NORMAL AVSLUTNING På PROGRAM R0016001';                      
 */                                                                             
    EXEC CICS RETURN;                                                           
                                                                                
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /* INCLUDE-MODULER                                                   */        
 /*-------------------------------------------------------------------*/        
 /*  %INCLUDE R0016021;    DIVERSE HJELPERUTINER */                             
 %PAGE;                                                                         
 %INCLUDE R0016022;        /* OPPDAT_MOR_FAR       */                           
 %PAGE;                                                                         
 %INCLUDE R0016023;        /* OPPDAT_BARN          */                           
 %PAGE;                                                                         
 %INCLUDE R0016024;        /* SKRIV_STAT_SEGM      */                           
 %PAGE;                                                                         
 %INCLUDE R0016031;        /* F_KONV_SIVILSTAND    */                           
 %PAGE;                                                                         
 %INCLUDE R0016032;        /* UP_OPPDAT            */                           
 %PAGE;                                                                         
 %INCLUDE R0016033;        /* U2_OPPDAT            */                           
 %PAGE;                                                /*SOB9704*/              
 %INCLUDE R0016039;        /* U3_OPPDAT            */  /*SOB9704*/              
 %PAGE;                                                                         
 %INCLUDE R0016034;        /* FINN_UP_YP_OPPHØR    */                           
 %INCLUDE R0016035;        /* DANN_OPPHØR_GIFT     */                           
 %INCLUDE R0016036;        /* DANN_OPPHØR          */                           
 %INCLUDE R0016037;        /* DANN_TILGANG         */                           
 %INCLUDE R0016038;        /* FASTSETT_AP_BEREGN   */                           
 %PAGE;                                                                         
 /* %INCLUDE R0016051; */  /* ALDER  2000          */                           
 %PAGE;                                                                         
 %INCLUDE R0016052;        /* F_MAGIC              */                           
 %INCLUDE R0016053;        /* F_REGN_APD_B01_B02   */                           
                                                                                
 END; /* OF PROGRAM R0016001 */                                                 
