 /*       SIST ENDRET 05/03-99 13.14.55 AV   JDA7339                  */00000000
 /*       SIST ENDRET 05/03-99 13.14.33 AV   JDA7339                  */00000010
 /*       SIST ENDRET 04/05-98 12.58.03 AV   JDA7339                  */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014154 - SUBRUTINE I PLI                                     */00000040
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */00000050
 /*HENSIKT:                                                           */00000060
 /*    RUTINEN BEREGNER BUP/FPP PÅ GRUNNLAG AV GODSKREVET POENG       */00000070
 /*    FOR ÅR FØR UFØREÅRET.                                          */00000080
 /*BRUK   :                                                           */00000090
 /*    CALL BEREGN_BUP_FPP_ALTERNATIV(   );                           */00000100
 /*ENDRING:                                                           */00000110
 /*    INNLAGT TEST PÅ 19-6 KRITETIER.                                */00000120
 /*                                    17.8.84 OLAV                   */00000130
 /*                                                                   */00000140
 /*ENDRING:                                                           */00000150
 /*    NÅR POENG BLE OVER 9,99 MISTET VI ET SIFFER SLIK AT            */00000160
 /*    POENGET BLE GALT.                                              */00000170
 /*                                    21.1.85 OLAV                   */00000180
 /*                                                                   */00000190
 /*    ENDRING PÅ JUSTERINGEN AV INNTEKT_START_ÅR VED FLERE           */00000200
 /*    PERIODER NÅR FØRSTE PERIODE HAR INNTEKT_START_ÅR FØR 1967      */00000210
 /*                                    27.2.85 OLAV                   */00000220
 /* ***************************************************************** */00000230
 /*ENDRING:                                                           */00000240
 /*    DEN 1.4.86 BLE DET LAGT INN EN TILLEGGSTEST :                  */00000250
 /*        'IF TAB.UFØR_PERIODE(I) = 'D'      '                       */00000260
 /*    FOR Å FINNE SISTE_START_ÅR.                                    */00000270
 /*    FØLGEN BLE AT GJENLEVENDE FIKK BEREGNET NY POENGREKKE FRA      */00000280
 /*    DØDSFALLET, SELV OM DET VILLE LØNNE SEG Å BEHOLDE AVDØDES      */00000290
 /*    GAMLE POENGREKKE.                                              */00000300
 /*    TESTEN BLE FJERNET IGJEN 23.12.86.                             */00000310
 /*                                       HERMAN                      */00000320
 /* ***************************************************************** */00000330
  BEREGN_BUP_FPP_ALTERNATIV:                                            00000340
    PROC(IND,W_FNR);                                                    00000350
 %SKIP(2);                                                              00000360
    DCL                                                                 00000370
       I                   FIXED BIN(15),                               00000380
       J                   FIXED BIN(15),                               00000390
       IND                 FIXED BIN(15);                               00000400
    DCL                                                                 00000410
       W_POENG_ALTERNATIV  FIXED(5,2)         INIT(0),                  00000420
       W_POENG_HJELP       FIXED(5,2)         INIT(0),                  00000430
       TIDLIGSTE_START     PIC'99999' INIT(0),       /*2000*/           00000440
       START_ÅR            PIC'99999' INIT(0),       /*2000*/           00000450
       STOPP_ÅR            PIC'99999' INIT(0),       /*2000*/           00000460
       SEKSTISEKSÅR        PIC'9999' INIT(0),        /*2000*/           00000470
       SISTE_START_ÅR      PIC'9999' INIT(0),        /*2000*/           00000480
       KRIT_19_6           FIXED(1) INIT(0),                            00000490
       OVERFØRT_ÅR         FIXED DEC (5) INIT(0),    /*9903*/           00000500
       INNTEKT_3_AV_4_ÅR   PIC'999' INIT(0);                            00000510
    DCL                                                                 00000520
       1 W_FNR             PIC '(13)9';           /*2000*/              00000530
    DCL                                                                 00000540
       1 W_FNR_R  DEF W_FNR,                                            00000550
         2 DAG             PIC'99',                                     00000560
         2 MND             PIC'99',                                     00000570
         2 ÅR              PIC'9999',             /*2000*/              00000580
         2 REST            PIC'(5)9';                                   00000590
 %PAGE;                                                                 00000600
                                                                        00000610
  DO I = 1967 TO 1970;                         /*2000*/                 00000620
 /*                                                                   */00000630
 /*  HER FINNER VI FRAM TIL TIDLIGSTE STARTÅR UTEN Å TA HENSYN TIL    */00000640
 /*  ALDEREN TIL PERSONEN. TIDLIGSTE STARTÅR ER NORMALT 1967, MEN I   */00000650
 /*  DE TILFELLER HVOR UFØREÅRET/DØDSÅRET ER 1967/70, ER TIDLIGSTE    */00000660
 /*  STARTÅR 4 ÅR FØR UFØREÅRET/DØDSÅRET.                             */00000670
 /*                                                                   */00000680
     IF TAB.UFØR_START_MND(I) > 0 THEN                                  00000690
        DO;                                                             00000700
           TIDLIGSTE_START = I - 4;                                     00000710
           I = 1970;                            /*2000*/                00000720
        END;                                                            00000730
     ELSE                                                               00000740
        TIDLIGSTE_START = 1967;                  /*2000-- TS 161098*/   00000750
  END;                                                                  00000760
                                                                        00000770
  START_ÅR = W_FNR_R.ÅR + 17;                                           00000780
  /* ********************************* 2000 ************       */       00000790
                                                                        00000800
  IF START_ÅR < TIDLIGSTE_START THEN                                    00000810
                                                                        00000820
 /*                                                                   */00000830
 /*  STARTÅR KAN VÆRE DET ÅRET PERSONEN FYLLER 16 ÅR, MEN IKKE        */00000840
 /*  TIDLIGERE ENN TIDLIGSTE STARTÅR.                                 */00000850
 /*                                                                   */00000860
                                                                        00000870
     START_ÅR = TIDLIGSTE_START;                                        00000880
                                                                        00000890
  DO I = 1972 TO 1967 BY -1;                         /*2000*/           00000900
                                                                        00000910
                                                                        00000920
     IF TAB.UFØR_PERIODE(I) = 'S'              THEN                     00000930
        DO;                                                             00000940
           SISTE_START_ÅR = I;                                          00000950
           I              = 1967;             /*2000*/                  00000960
        END;                                                            00000970
  END;                                /*2000 : */                       00000980
                                                                        00000990
    STOPP_ÅR      = W_FNR_R.ÅR + 69;                                    00001000
    SEKSTISEKSÅR  = W_FNR_R.ÅR + 66;                                    00001010
                                                                        00001020
  IF SEKSTISEKSÅR  < 1972       THEN                                    00001030
                                                                        00001040
     SEKSTISEKSÅR  = 1972;                                              00001050
                                                                        00001060
  DO I = START_ÅR TO SISTE_START_ÅR;                                    00001070
                                                                        00001080
 /*                                                                   */00001090
 /*  HER BEHANDLES HVERT ENKELT ÅR FRA STARTÅR TIL SISTE STARTÅR      */00001100
 /*                                                                   */00001110
                                                                        00001120
     IF TAB.UFØR_START_MND(I) > 0 & I > 1966 THEN        /*2000*/       00001130
                                                                        00001140
        DO;                                                             00001150
 /*                                                                   */00001160
 /*        PERIODE STARTET ETTER 1966, BUP/FPP SKAL BEREGNES.         */00001170
 /*                                                                   */00001180
                                                                        00001190
 /* 6.3.86 HL CALL PÅ 4162 TAS HERFRA. FEILRAPP 40/88                 */00001200
                                                                        00001210
           IF I < 1971                   THEN     /*2000*/              00001220
                                                                        00001230
              DO;                                                       00001240
                                                                        00001250
                 OVERFØRT_ÅR = I;                                       00001260
                                                                        00001270
 /*4162*/        CALL LEGG_INNT_FØR_67_I_TAB(IND,OVERFØRT_ÅR);          00001280
                                                                        00001290
              END;                                                      00001300
                                                                        00001310
           KRIT_19_6         = 0;                                       00001320
                                                                        00001330
           DO J = 1967 TO I;                        /*2000*/            00001340
              IF TAB.POENG_ANVENDT(J) > 0             THEN              00001350
                 KRIT_19_6 =1;                                          00001360
           END;                                                         00001370
                                                                        00001380
           INNTEKT_3_AV_4_ÅR = 0;                                       00001390
                                                                        00001400
           IF KRIT_19_6 = 0    THEN                                     00001410
                                                                        00001420
              DO J = (I - 4) TO (I - 1);                                00001430
                 IF TAB.POENG_ANVENDT(J) > 0 & J > 1966 THEN /*2000*/   00001440
                    INNTEKT_3_AV_4_ÅR = INNTEKT_3_AV_4_ÅR + 1;          00001450
              END;                                                      00001460
                                                                        00001470
           ELSE                                                         00001480
                                                                        00001490
              DO J = (I - 4) TO (I - 1);                                00001500
                 IF TAB.POENG_ANVENDT(J) > 0             THEN           00001510
                    INNTEKT_3_AV_4_ÅR = INNTEKT_3_AV_4_ÅR + 1;          00001520
              END;                                                      00001530
                                                                        00001540
           IF START_ÅR       < 1967        THEN         /*2000*/        00001550
              DO;                                                       00001560
                 IF (I - 4)  > 1966        THEN         /*2000*/        00001570
                    START_ÅR = 1967;                    /*2000*/        00001580
              END;                                                      00001590
                                                                        00001600
           IF TAB.UFØR_KRIT(I) > 1 !                                    00001610
              (TAB.POENG_ALTERNATIV(I - 1) > 0 & I > 1967) !            00001620
              INNTEKT_3_AV_4_ÅR > 2 THEN                                00001630
 /*                                                                   */00001640
 /*           BUP BEREGNES HVIS EN AV BETINGELSENE NEDENFOR ER OPPFYLT*/00001650
 /*               - UFØR_KRIT > 0  (DVS. 8-4, NR.3A = JA)             */00001660
 /*               - INNTEKT I ÅRET FØR UFØREÅRET > 0                  */00001670
 /*               - INNTEKT I 3 AV 4 ÅR FØR UFØREÅRET                 */00001680
 /*               - YRKESSKADE                                        */00001690
 /*                                                                   */00001700
              CALL REGN_BUP_FPP(START_ÅR,I);                            00001710
                                                                        00001720
           ELSE                                                         00001730
                                                                        00001740
              TAB.BUP_FPP(I) = 0;                                       00001750
                                                                        00001760
           IF I = SISTE_START_ÅR                              THEN      00001770
                                                                        00001780
              DO;                                                       00001790
                 TAB.POENG_ALTERNATIV(I)      = TAB.BUP_FPP(I);         00001800
                 TAB.POENG_ALTERNATIV_KODE(I) = 'U54';                  00001810
              END;                                                      00001820
                                                                        00001830
           ELSE                                                         00001840
                                                                        00001850
              IF TAB.BUP_FPP(I) > TAB.INNT_POENG(I) THEN                00001860
                                                                        00001870
 /*                                                                   */00001880
 /*           FOR STARTÅRET FÅR EN GODSKREVET DET POENG SOM ER BEST,  */00001890
 /*           BUP ELLER POENG_ANVENDT                                 */00001900
 /*                                                                   */00001910
                                                                        00001920
                 TAB.POENG_ALTERNATIV(I) = TAB.BUP_FPP(I);              00001930
                                                                        00001940
              ELSE                                                      00001950
                                                                        00001960
                 DO;                                                    00001970
                                                                        00001980
 /*                                                                   */00001990
 /*              NÅR BUP ER MINDRE ENN POENG_ANVENDT LEGGES BUP I     */00002000
 /*              NESTE ÅRS POENG_ANVENDT NÅR FLERE PERIODER.          */00002010
 /*                                                                   */00002020
                                                                        00002030
                    TAB.POENG_ALTERNATIV(I + 1) = TAB.BUP_FPP(I);       00002040
                    TAB.POENG_ALTERNATIV(I) = TAB.INNT_POENG(I) + 0.005;00002050
                 END;                                                   00002060
                                                                        00002070
           DO J = (I + 1) TO STOPP_ÅR UNTIL (TAB.UFØR_PERIODE(J) = 'S');00002080
                                                                        00002090
              TAB.BUP_FPP(J)               = TAB.BUP_FPP(I);            00002100
                                                                        00002110
                                                                        00002120
              TAB.POENG_ALTERNATIV(J)      = TAB.BUP_FPP(I);            00002130
                                                                        00002140
           END;                                                         00002150
                                                                        00002160
           IF TAB.UFØR_SLUTT_MND(J) = 01 THEN                           00002170
                                                                        00002180
              DO;                                                       00002190
                 TAB.BUP_FPP(J)            = 0;                         00002200
                 TAB.POENG_ALTERNATIV(J)   = 0;                         00002210
              END;                                                      00002220
        END;                                                            00002230
 %PAGE;                                                                 00002240
     ELSE                                                               00002250
        DO;                                                             00002260
 /*                                                                   */00002270
 /*        BEHANDLING AV HVERT ENKELT ÅR FØR EN PERIODESTART          */00002280
 /*                                                                   */00002290
           IF TAB.VERNEPL_POENG(I) > TAB.INNT_POENG(I) THEN             00002300
                                                                        00002310
              DO;                                                       00002320
 /*                                                                   */00002330
 /*              NÅR VERNEPLIKTSPOENG ER STØRRE ENN INNTEKTSPOENG     */00002340
 /*              BRUKES VERNEPLIKTSPOENGET TIL BEREGNING AV BUP.      */00002350
 /*                                                                   */00002360
                                                                        00002370
                 TAB.POENG_ALTERNATIV(I) = TAB.VERNEPL_POENG(I);        00002380
                                                                        00002390
                 IF TAB.VERNEPL_POENG(I) = 2.00 THEN                    00002400
                                                                        00002410
                    TAB.POENG_ALTERNATIV_KODE(I) = 'U56';               00002420
                                                                        00002430
                 ELSE                                                   00002440
                                                                        00002450
                    TAB.POENG_ALTERNATIV_KODE(I) = 'U55';               00002460
              END;                                                      00002470
                                                                        00002480
           ELSE                                                         00002490
                                                                        00002500
              TAB.POENG_ALTERNATIV(I) = TAB.INNT_POENG(I) + 0.005;      00002510
                                                                        00002520
           IF TAB.UFØR_PERIODE(I) = 'S' ! TAB.UFØR_PERIODE(I) = 'J' THEN00002530
                                                                        00002540
              DO;                                                       00002550
                 IF TAB.POENG_ALTERNATIV(I) < TAB.BUP_FPP(I) THEN       00002560
                                                                        00002570
 /*                                                                   */00002580
 /*                 FOR START OG OPPHØRSÅR FÅR EN GODSKREVET DET      */00002590
 /*                 BESTE AV BUP/FPP ELLER FAKTISK INNTEKTSPOENG.     */00002600
 /*                                                                   */00002610
                                                                        00002620
                    TAB.POENG_ALTERNATIV(I)        = TAB.BUP_FPP(I);    00002630
              END;                                                      00002640
                                                                        00002650
           ELSE                                                         00002660
                                                                        00002670
              IF TAB.UFØR_PERIODE(I) = 'M' THEN                         00002680
                                                                        00002690
                 DO;                                                    00002700
                                                                        00002710
 /*                                                                   */00002720
 /*                 FOR MELLOMLIGGENDE ÅR I EN UFØREPERIODE FÅR EN    */00002730
 /*                 GODSKREVET FAKTISK INNTEKTSPOENG OG EN FORHOLDS-  */00002740
 /*                 MESSIG DEL AV BUP REGNET UT FRA UFØREGRADEN.      */00002750
 /*                                                                   */00002760
                                                                        00002770
 /* ENDRET 26.6.86 HL - JFR FEILRAPP 335                             */ 00002780
                                                                        00002790
                    W_POENG_HJELP  = TAB.INNT_POENG(I)   + 0.005;       00002800
                    W_POENG_ALTERNATIV = W_POENG_HJELP        +         00002810
                      ((TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I)) / 100) +     00002820
                                                              0.005;    00002830
                                                                        00002840
 /* HIT 26.6.86 HL      */                                              00002850
                                                                        00002860
                    IF I > 1970     THEN             /*2000*/           00002870
                       IF W_POENG_ALTERNATIV > 8.33    THEN             00002880
                          W_POENG_ALTERNATIV = 8.33;                    00002890
                       ELSE;                                            00002900
                                                                        00002910
                    ELSE                                                00002920
                                                                        00002930
                       IF W_POENG_ALTERNATIV > 7.00    THEN             00002940
                          W_POENG_ALTERNATIV = 7.00;                    00002950
                       ELSE;                                            00002960
                                                                        00002970
                    TAB.POENG_ALTERNATIV(I) = W_POENG_ALTERNATIV;       00002980
                    IF TAB.UFØR_KRIT(I) = 5          THEN               00002990
                       TAB.POENG_ALTERNATIV_KODE(I) = 'U42';            00003000
                    ELSE                                                00003010
                    IF TAB.UFØR_KRIT(I)     = 6        THEN             00003020
                       TAB.POENG_ALTERNATIV_KODE(I) = 'U57';            00003030
                    ELSE                                                00003040
                       TAB.POENG_ALTERNATIV_KODE(I) = 'U59';            00003050
                 END;                                                   00003060
        END;                                                            00003070
  END;                                                                  00003080
 %SKIP(2);                                                              00003090
  END BEREGN_BUP_FPP_ALTERNATIV;                                        00003100
