 /*       SIST ENDRET 04/05-98 14.30.56 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/03-98 10.36.16 AV   SLA9300                  */00000010
 /*       SIST ENDRET 14/04-89 15.00.48 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 14/12-88 14.33.16 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 23/10-84 13.29.21 AV   FARVIK                   */00000040
 /*       SIST ENDRET 14/04-83 12.57.11 AV   BREIVIK                  */00000050
 /*-------------------------------------------------------------------*/00000060
 /* IDENTIFIKASJON:                                                   */00000070
 /*    R0016401                                                       */00000080
 /*                                                                   */00000090
 /*    PROGRAMMERER: P. BREIVIK, NOV 1982.                            */00000100
 /*                                                                   */00000110
 /* HENSIKT:                                                          */00000120
 /*    HER SLETTES EN PERSON FRA STAT-TRANS-BASEN.                    */00000130
 /*    DETTE SKAL SKJE NÅR DANNING AV STAT-TRANS-SEGMENTER            */00000140
 /*    ALLIKEVEL IKKE KAN GODTAS (FEIL-SITUASJONER).                  */00000150
 /*                                                                   */00000160
 /* PROGRAMTILKNYTNING:                                               */00000170
 /*                                                                   */00000180
 /* BRUK:                                                             */00000190
 /*                                                                   */00000200
 /*-------------------------------------------------------------------*/00000210
                                                                        00000220
 R001640: PROC (COMMAREA_PEKER) OPTIONS (MAIN);                         00000230
                                                                        00000240
 DCL COMMAREA_PEKER          POINTER;                                   00000250
                                                                        00000260
 %INCLUDE P0019906; /* TRANS_OPPL_OMR */                                00000270
                                                                        00000280
 %INCLUDE P0019908; /* KOM_OMR */                                       00000290
                                                                        00000300
 %INCLUDE P0019912; /* DIV_PARAM_OMR */                                 00000310
                                                                        00000320
                                                                        00000330
 /*-------------------------------------------------------------------*/00000340
 /*                                                                   */00000350
 /*    DL/1 PARAMETRE                                                 */00000360
 /*                                                                   */00000370
 /*-------------------------------------------------------------------*/00000380
                                                                        00000390
 %INCLUDE DLIUIB;                                                       00000400
                                                                        00000410
 DCL PLITDLI                 EXTERNAL ENTRY;                            00000420
                                                                        00000430
 DCL UIB_RC_OK               BIT (8) INIT (0);     /* KONSTANT */       00000440
 DCL 1 TR0_PCB_PEKER         BASED (UIBPCBAL),                          00000450
       2 TR0_PCB_PTR         POINTER;                                   00000460
                                                                        00000470
 DCL GET_HOLD_UNIK           CHAR (4) INIT('GHU ');                     00000480
 DCL DELETE                  CHAR (4) INIT('DLET');                     00000490
 DCL TRE                     FIXED BIN (31) INIT(3);                    00000500
 DCL FIRE                    FIXED BIN (31) INIT(4);                    00000510
                                                                        00000520
 /*-------------------------------------------------------------------*/00000530
 /*                                                                   */00000540
 /*   DEKLARASJON AV SSA                                              */00000550
 /*                                                                   */00000560
 /*-------------------------------------------------------------------*/00000570
                                                                        00000580
 DCL 1 SSA_TR0ROT UNALIGNED,                                            00000590
       2 HOVEDDEL            CHAR (17) INIT('TR0ROT  (FNR     '),       00000600
       2 REL_OP              CHAR (2)  INIT(' ='),                      00000610
       2 FNR_KEY             FIXED DEC (11),                            00000620
       2 END_MRK             CHAR (1)  INIT(')');                       00000630
                                                                        00000640
 DCL SSA_UNQUAL              CHAR (9);                                  00000650
                                                                        00000660
 /*-------------------------------------------------------------------*/00000670
 /*                                                                   */00000680
 /*   PCB-OMRÅDE                                                      */00000690
 /*                                                                   */00000700
 /*-------------------------------------------------------------------*/00000710
                                                                        00000720
 %INCLUDE P0012002; /* PCB-PEKER-OMRÅDE */                              00000730
                                                                        00000740
 DCL 1 TR0_PCB               BASED (TR1_PCB_PEKER),                     00000750
 %INCLUDE P0012003; /* PCB-OMRÅDE       */                              00000760
                                                                        00000770
 /*-------------------------------------------------------------------*/00000780
 /*                                                                   */00000790
 /*   HJELPEVARIABLE                                                  */00000800
 /*                                                                   */00000810
 /*-------------------------------------------------------------------*/00000820
                                                                        00000830
 DCL TRUE                    BIT (1) INIT('1'B);                        00000840
 DCL FALSE                   BIT (1) INIT('0'B);                        00000850
 DCL FEIL                    BIT (1);                                   00000860
 DCL IO_AREA                 CHAR (150);                                00000870
 DCL I                       FIXED BIN (15);                            00000880
 DCL PBR_TEXT                CHAR (80);                                 00000890
 DCL (ADDR,CHAR,CSTG)        BUILTIN;                                   00000900
                                                                        00000910
 %PAGE;                                                                 00000920
 /*-------------------------------------------------------------------*/00000930
 /*                                                                   */00000940
 /* START På PROGRAM FJERN SEGMENTER I STAT-TRANS-BASEN.              */00000950
 /*                                                                   */00000960
 /*-------------------------------------------------------------------*/00000970
    IF FEIL_MELD_NR = 0 THEN                                            00000980
       DIV_PARAM_OMR.PROGRAM_ID = 'R0016401';                           00000990
    UIBPTR =UIB_PEKER;                                                  00001000
                                                                        00001010
    SSA_TR0ROT.FNR_KEY = TRANS_OPPL_OMR.FØDSNUMMER;                     00001020
                                                                        00001030
    CALL PLITDLI (FIRE,                                                 00001040
                  GET_HOLD_UNIK,                                        00001050
                  TR0_PCB,                                              00001060
                  IO_AREA,                                              00001070
                  SSA_TR0ROT);                                          00001080
                                                                        00001090
     SELECT(TR0_PCB.STATUS_KODE);                                       00001100
                                                                        00001110
         WHEN ('GE');                                                   00001120
                                                                        00001130
         WHEN ('  ')                                                    00001140
            DO;                                                         00001150
               CALL PLITDLI (TRE,                                       00001160
                             DELETE,                                    00001170
                             TR0_PCB,                                   00001180
                             IO_AREA);                                  00001190
                                                                        00001200
               IF TR0_PCB.STATUS_KODE ^= '  ' THEN                      00001210
                  DO;                                                   00001220
   L100:                                                                00001230
                  /*--------------------------------------*/            00001240
                  /* FEIL VED DELETE-KALLET TIL TR0-BASEN */            00001250
                  /* SEGMENT LOT SEG IKKE SLETTE          */            00001260
                  /*--------------------------------------*/            00001270
                                                                        00001280
                     DIV_PARAM_OMR.FEIL_VED_LABEL = 'L100';             00001290
                     DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                00001300
                     DIV_PARAM_OMR.DB_STATUS_KODE = TR0_PCB.STATUS_KODE;00001310
                  END;                                                  00001320
                                                                        00001330
            END;                                                        00001340
                                                                        00001350
         OTHERWISE                                                      00001360
                                                                        00001370
            DO;                                                         00001380
   L110:                                                                00001390
             /*------------------------------------*/                   00001400
             /* FEIL VED 'HENT PERSON' I TR0-BASEN */                   00001410
             /*------------------------------------*/                   00001420
                                                                        00001430
               DIV_PARAM_OMR.FEIL_VED_LABEL = 'L110';                   00001440
               DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                      00001450
               DIV_PARAM_OMR.DB_STATUS_KODE = TR0_PCB.STATUS_KODE;      00001460
            END;                                                        00001470
                                                                        00001480
      END; /* OF SELECT */                                              00001490
                                                                        00001500
                                                                        00001510
                                                                        00001520
    EXEC CICS RETURN;                                                   00001530
                                                                        00001540
 END;                                                                   00001550
