 /*   SIST ENDRET PÅ PROD   2004.06.18 12.24.11 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.05.03 12.32.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.19 15.34.00 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.36.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.28.01 AV   JDA2970          */        
 /*       SIST ENDRET 09/06-98 08.49.10 AV   SPA7339                  */        
 /*       SIST ENDRET 27/05-98 09.51.52 AV   RFA9991                  */        
 /*       SIST ENDRET 18/10-93 09.46.19 AV   DYBVIK                   */        
 /*       SIST ENDRET 23/10-92 11.02.21 AV   DYBVIK                   */        
 /*       SIST ENDRET 24/09-92 14.15.42 AV   DYBVIK                   */        
 /*       SIST ENDRET 06/08-92 14.59.18 AV   TRUDE                    */        
 /*       SIST ENDRET 20/02-92 11.05.59 AV   TRUDE                    */        
 /*       SIST ENDRET 05/03-91 09.24.19 AV   DYBVIK                   */        
 /*       SIST ENDRET 05/02-91 14.32.40 AV   DYBVIK                   */        
 /*       SIST ENDRET 19/11-90 14.25.22 AV   DYBVIK                   */        
 /*       SIST ENDRET 10/10-90 10.59.04 AV   DYBVIK                   */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*     R0014482 - BEREGN_GP_UP_UTLAND, PROSEDYRE I PL1               */        
 /*     PROGRAMMERER: HERMAN, SEPT 90                                 */        
 /* HENSIKT:                                                          */        
 /*     BEREGNE TT_ANV OG GRUNNPENSJON FOR BOSATTE I UTLANDET         */        
 /*     ETTER LOVGIVNING FØR 1.1.91                                   */        
 /* PROGRAMTILKNYTNING                                                */        
 /*     PROSEDYREN BLIR INKLUDERT I R0014401 - BEREGN_UFØREPENSJON.   */        
 /* ***************************************************************** */        
                                                                                
 BEREGN_GP_UP_UTLAND:                                                           
  PROC;                                                                         
                                                                                
   DCL  GP                        DEC FIXED(11,4) INIT(0);                      
   DCL  TT_DIFF                   DEC FIXED (3) INIT (0);                       
   DCL  TT_PÅ                     DEC FIXED (3) INIT (0);                       
   DCL  TT_FØR_OG_ETTER           DEC FIXED (3) INIT (0);                       
   DCL  TT_ETTER                  DEC FIXED (3) INIT (0);                       
   DCL  TT_ETTER_EK               DEC FIXED (3) INIT (0);                       
   DCL  TT_FREMTIDIG              DEC FIXED (3) INIT (0);                       
   DCL  TT_PLUSS_UFT              DEC FIXED (3) INIT (0);                       
                                                                                
 /* ******************************************************** */                 
 /* HVIS FELT 4.13 - TRYGDETID ETTER UFØRETIDSPUNKTET - ER   */                 
 /* UTFYLT, SÅ VIL DENNE VERDIEN LIGGE BÅDE I B02.TT_FRAMT_UFT */               
 /* OG I B02.TT_FRAMT.                                       */                 
 /*                                                          */                 
 /* HVIS FELT 4.13 IKKE ER UTFYLT, MENS FELT 4.12 ER UTFYLT, */                 
 /* SÅ VIL VERDIEN I 4.12 BLI LAGT INN BÅDE I TT_FRAMT_UFT   */                 
 /* OG TT_FRAMT.                                             */                 
 /*                                                          */                 
 /* HVIS INGEN AV FELTENE 4.13 / 4.12 ER OPPDATERT, SÅ VIL   */                 
 /* B02.TT_FRAMT VÆRE BEREGNET PÅ VANLIG MÅTE. HVIS MAN I    */                 
 /* DETTE PROGRAMMET FINNER AT TT_FRAMT IKKE SKAL NYTTES, SÅ */                 
 /* MÅ ELEMENTET NULLSTILLES.                                */                 
 /* ******************************************************** */                 
                                                                                
   TT_EGEN = B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                               
             ((B02.TT_ETTER_1966(BER_SØ_IND) +                                  
               B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                            
                                                                                
   IF TT_EGEN > 39 THEN                                                         
      TT_EGEN = 40;                                                             
                                                                                
   IF B02.UFØRPENS.TP(BER_SØ_IND) > 0        THEN                               
      TT_PÅ   = B02.UFØRPENS.PÅ(BER_SØ_IND);                                    
                                                                                
   TT_FØR_OG_ETTER =  B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                      
                     ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);               
                                                                                
   TT_PLUSS_UFT    =  B02.STATUS.TT_FØR_1967(BER_SØ_IND) +                      
                     ((B02.TT_ETTER_1966(BER_SØ_IND) +                          
                       B02.TT_FRAMT_UFT (BER_SØ_IND) + 11) / 12);               
                                                                                
   IF TT_FØR_OG_ETTER > 39 THEN                                                 
      TT_FØR_OG_ETTER = 40;                                                     
                                                                                
   IF TT_PLUSS_UFT    > 39 THEN                                                 
      TT_PLUSS_UFT    = 40;                                                     
                                                                                
 /*TILLEGG 19.11.90 HL - KONVENSJONSLAND : */                                   
                                                                                
   IF (B02.BOSATT     (BER_SØ_IND) < 107   &                                    
       B02.STATSBORGER(BER_SØ_IND) < 107   )     !    /*NORDISK*/               
                                                                                
      (B02.BOSATT     (BER_SØ_IND) < 107   &          /*BRITISK*/               
       B02.STATSBORGER(BER_SØ_IND) = 139   )     !                              
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 139   &                                    
       B02.STATSBORGER(BER_SØ_IND) = 139   )     !                              
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 139   &                                    
       B02.STATSBORGER(BER_SØ_IND) = 000   )     !                              
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 684   &                                    
       B02.STATSBORGER(BER_SØ_IND) = 684   )     !      /*USA*/                 
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 125   &          /*JUGOSLAV*/              
       B02.STATSBORGER(BER_SØ_IND) = 125   )     !                              
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 132   &          /*PORTUGAL*/              
       B02.STATSBORGER(BER_SØ_IND) = 132   )     !                              
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 141   &          /*SVEITS*/                
       B02.STATSBORGER(BER_SØ_IND) = 141   )     !                              
                                                                                
      (B02.BOSATT     (BER_SØ_IND) = 143   &          /*TYRKIA*/                
       B02.STATSBORGER(BER_SØ_IND) = 143   )      THEN                          
                                                                                
         B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                                      
                                                                                
   ELSE                                                                         
                                                                                
   IF B02.FRAVIK_TRYGDET_3ÅR(BER_SØ_IND)  = 'J'        THEN                     
      IF B02.FRAVIK_8_1(BER_SØ_IND)  = ' '        THEN   /*1*/                  
         DO;                                                                    
            B02.TT_ANV(BER_SØ_IND)   = TT_PLUSS_UFT;                            
            B02.TT_FRAMT(BER_SØ_IND) =                                          
                       B02.TT_FRAMT_UFT (BER_SØ_IND);                           
         END;                                                                   
      ELSE                                                                      
         IF B02.TT_FRAMT_UFT (BER_SØ_IND) = 0  THEN      /*2*/                  
                                                                                
            B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                                   
                                                                                
         ELSE                                            /*3*/                  
            B02.TT_ANV(BER_SØ_IND) = TT_PLUSS_UFT;                              
                                                                                
   ELSE /*FRAVIK_TRYGDET_3ÅR ER IKKE 'J' */                                     
                                                                                
      IF B02.FRAVIK_8_1(BER_SØ_IND)  = ' '        THEN                          
         IF B02.UFØR_UNDER_BOTID(BER_SØ_IND)  ^= 'N '   THEN                    
            IF TT_PLUSS_UFT > 19 THEN                                           
               IF TT_EGEN > TT_PÅ THEN                                          
                  B02.TT_ANV(BER_SØ_IND) = TT_EGEN;          /*1*/              
               ELSE                                                             
                  B02.TT_ANV(BER_SØ_IND) = TT_PÅ;            /*3*/              
                                                                                
            ELSE                                                                
            DO;                                                                 
               B02.TT_FRAMT(BER_SØ_IND) =                                       
                       B02.TT_FRAMT_UFT (BER_SØ_IND);                           
                                                                                
               IF TT_PLUSS_UFT >  9 THEN                                        
                  IF TT_PLUSS_UFT > TT_PÅ THEN                                  
                     B02.TT_ANV(BER_SØ_IND) = TT_PLUSS_UFT;  /*2*/              
                  ELSE                                                          
                     B02.TT_ANV(BER_SØ_IND) = TT_PÅ;         /*3*/              
               ELSE /*TT_PLUSS_UFT < 10 */                                      
                  B02.TT_ANV(BER_SØ_IND) = TT_PÅ;            /*3*/              
            END;                                                                
         ELSE /*UFØR_UNDER_BOTID ER DA 'N' */                                   
            DO;                                                                 
               B02.TT_FRAMT(BER_SØ_IND) =                                       
                       B02.TT_FRAMT_UFT (BER_SØ_IND);                           
               B02.TT_ANV(BER_SØ_IND) = TT_PLUSS_UFT;        /*4B*/             
            END;                                                                
                                                                                
      ELSE /* FRAVIK_8_1 ER DA 'J' */                                           
                                                                                
         IF B02.TT_FRAMT_UFT (BER_SØ_IND) = 0  THEN          /*5*/              
                                                                                
            B02.TT_ANV(BER_SØ_IND) = TT_EGEN;                                   
                                                                                
         ELSE                                                /*6*/              
            B02.TT_ANV(BER_SØ_IND) = TT_PLUSS_UFT;                              
                                                                                
    /* TEST PÅ 40 ÅR VAR GLEMT . TRUDE 300992 */                                
                                                                                
   /*TRUDE 15.10.93 */                                                          
  IF B02.UFØRPENS.PÅ(BER_SØ_IND) > B02.TT_ANV(BER_SØ_IND) THEN                  
           B02.TT_ANV(BER_SØ_IND) = B02.UFØRPENS.PÅ(BER_SØ_IND);                
                                                                                
   IF B02.TT_ANV(BER_SØ_IND)  > 40  THEN                                        
      B02.TT_ANV(BER_SØ_IND)  = 40;                                             
                                                                                
                                                                                
   IF B02.IKKE_GP(BER_SØ_IND) = 'J'        THEN                                 
     DO;                                                                        
      B02.UFØRPENS.GP(BER_SØ_IND) = 0;                                          
      GO TO L999;                                                               
     END;                                                                       
                                                                                
                                                                                
   IF B02.PENSJONSTYPE2(BER_SØ_IND) ^= 'S'        THEN                          
                                                                                
      DO; /*DO 1*/                                                              
         IF B02.PENSJON_FØR_9802(BER_SØ_IND) ^= 'J'    THEN                     
            DO;   /*DO 2*/                                                      
                                                                                
               IF B02.TT_KONVENSJON_ÅR(BER_SØ_IND) > 0      THEN                
                  B02.TT_ANV(BER_SØ_IND)  =                                     
                  B02.TT_KONVENSJON_ÅR(BER_SØ_IND);                             
                                                                                
               IF   B02.RED_GP_3_2_5(BER_SØ_IND) = 'J'  THEN                    
                  DO;                                                           
      /*             GP = G * B02.TT_ANV(BER_SØ_IND) /40;   */                  
      /*RETTET 20020722 HL */                                                   
                     GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND) / 40;         
                     DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'X';            
                     B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'X';                   
                  END;                                                          
               ELSE                                                             
               IF (B02.SIVILSTAND(BER_SØ_IND) = 'G'  !                          
                   B02.SIVILSTAND(BER_SØ_IND) = 'P'   )      &                  
                                                                                
                   B02.EK_INNT_OVER_2G(BER_SØ_IND) = 'J' THEN                   
                                                                                
                   DO;                                                          
                    GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND)/40;            
                      DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'J';           
                      B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'I';                  
                   END;                                                         
               ELSE                                                             
               IF (B02.SIVILSTAND(BER_SØ_IND) = 'W' )     &                     
                                                                                
                   B02.EK_INNT_OVER_2G(BER_SØ_IND) = 'J' THEN                   
                                                                                
                   DO;                                                          
                     GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND) / 40;         
                                                                                
                      DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'J';           
                      B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Z';                  
                   END;                                                         
               ELSE                                                             
               IF (B02.SIVILSTAND(BER_SØ_IND) = 'V' )   &                       
                                                                                
                   B02.EK_INNT_OVER_2G(BER_SØ_IND) = 'J' THEN                   
                                                                                
                   DO;                                                          
                     GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND) / 40;         
                                                                                
                      DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'J';           
                      B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Z';                  
                   END;                                                         
               ELSE                                                             
               IF  B02.SIVILSTAND(BER_SØ_IND) = 'V'     &                       
                  (B02.PENSJONSTYPE2(BER_EK_IND) = 'P' !                        
                   B02.PENSJONSTYPE2(BER_EK_IND) = 'S' )    THEN                
                   DO;                                                          
                     GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND) / 40;         
                      DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'V';           
                      B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'X';                  
                   END;                                                         
               ELSE                                                             
               IF ^(B02.SIVILSTAND(BER_SØ_IND) = 'V') THEN                      
                DO;  /*DO 3*/                                                   
                                                                                
                  IF B02.PENSJONSTYPE1(BER_EK_IND) = 'K'       &                
                     B02.SUM_YTELSE(BER_EK_IND)    > 0         &                
                     F_ALDER(W_FNR_EK,W_DATO_ÅMD) < 6501   &                    
                     B02.SIVILSTAND  (BER_SØ_IND) ^= 'A'   THEN                 
       DO;  /*DO 4*/                                                            
          IF B02.ALDERSP.UTTAKSDATO_ÅMD(BER_EK_IND) > 19970900   THEN           
             DO;                                                                
                GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND) / 40;              
                DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';                 
                IF (B02.SIVILSTAND(BER_SØ_IND) = 'G'  !                         
                    B02.SIVILSTAND(BER_SØ_IND) = 'P'   )   THEN                 
                    B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'J';                    
                ELSE                                                            
                    B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Y';                    
             END;                                                               
          ELSE                                                                  
          IF B02.PENSJONSTYPE3(BER_EK_IND) = 'S'    THEN                        
             DO;                                                                
                GP = G * GP_PROSENT * B02.TT_ANV(BER_SØ_IND) / 40;              
                DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';                 
                IF (B02.SIVILSTAND(BER_SØ_IND) = 'G'  !                         
                    B02.SIVILSTAND(BER_SØ_IND) = 'P'   )   THEN                 
                    B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'J';                    
                ELSE                                                            
                    B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Y';                    
             END;                                                               
       END; /*END 4*/                                                           
  END; /*END 3*/                                                                
                                                                                
          ELSE                                                                  
                                                                                
             GP = G * B02.TT_ANV(BER_SØ_IND) /40;                               
       END;  /*END 2*/                                                          
    ELSE                                                                        
       DO;                                                                      
           IF B02.TT_KONVENSJON_ÅR(BER_SØ_IND) > 0      THEN  /*9812*/          
              B02.TT_ANV(BER_SØ_IND)  =                                         
              B02.TT_KONVENSJON_ÅR(BER_SØ_IND);                                 
                                                                                
           GP = G * B02.TT_ANV(BER_SØ_IND) / 40;                                
       END;                                                                     
           GP = GP * UFGRAD /(100*12) + 0.5;                                    
                                                                                
     END;  /*END 1*/                                                            
                                                                                
   ELSE                                                                         
                                                                                
 DO; /*DENNE DO-EN GÅR HELE PROGRAMMET UT */                                    
                                                                                
                                                                                
 /* ****************************************************** */                   
 /* OVERFØRING AV TRYGDETID BARE I DISSE TILFELLER :       */                   
 /* (REGLENES PARAGRAF 11 UTEN ANGITT FREMTIDIG TT)        */                   
 /* ****************************************************** */                   
                                                                                
  IF B02.FRAVIK_8_1(BER_SØ_IND)   = 'J'          &                              
     B02.TT_FRAMT_UFT(BER_SØ_IND) = 0        THEN                               
     DO;                                                                        
        IF B02.STATUS.TT_FØR_1967(BER_SØ_IND) = 0 &                             
           B02.STATUS.TT_FØR_1967(BER_EK_IND) = 0 THEN                          
                                                                                
        /* *********************************************** */                   
        /* BEGGE EKTEFELLER HAR BARE TT ETTER 1966         */                   
        /* *********************************************** */                   
                                                                                
           IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) THEN              
              B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);                  
           ELSE;                                                                
        ELSE                                                                    
                                                                                
        /* *********************************************** */                   
        /* EN ELLER BEGGE HAR TT FØR 1967                  */                   
        /* *********************************************** */                   
                                                                                
           DO;                                                                  
              TT_ETTER    = B02.TT_ETTER_1966(BER_SØ_IND) +                     
                            B02.TT_FRAMT(BER_SØ_IND);                           
              TT_ETTER_EK = B02.TT_ETTER_1966(BER_EK_IND) +                     
                            B02.TT_FRAMT(BER_EK_IND);                           
                                                                                
              IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) &              
                 TT_ETTER < TT_ETTER_EK                 THEN                    
                                                                                
                 IF B02.TT_FØR_1967(BER_SØ_IND) >                               
                    B02.TT_FØR_1967(BER_EK_IND)          THEN                   
                                                                                
                    B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);            
                                                                                
                 ELSE                                                           
                    B02.TT_ANV(BER_SØ_IND) =                                    
                             B02.STATUS.TT_FØR_1967(BER_SØ_IND) +               
                            ((TT_ETTER_EK + 11) / 12);                          
           END;                                                                 
                                                                                
     END;                                                                       
                                                                                
  /*--------------------------------------------------------------*/            
  /*FRAVIK FLYKTN TT = 40 GLEMT. TRUDE 240992                     */            
  /*--------------------------------------------------------------*/            
  IF (B02.FRAVIK_FLYKTN(BER_SØ_IND) = 'J') THEN                                 
     B02.TT_ANV(BER_SØ_IND)  = 40;                                              
                                                                                
  IF B02.FRAVIK_19_3(BER_SØ_IND)   = '7' THEN                                   
     DO;                                                                        
       IF B02.TT_ANV(BER_SØ_IND) < B02.TT_ANV(BER_EK_IND) THEN                  
          B02.TT_ANV(BER_SØ_IND) = B02.TT_ANV(BER_EK_IND);                      
     END;                                                                       
                                                                                
  IF B02.UFØRPENS.PÅ(BER_SØ_IND) > B02.TT_ANV(BER_SØ_IND) THEN                  
     B02.TT_ANV(BER_SØ_IND) = B02.UFØRPENS.PÅ(BER_SØ_IND);                      
                                                                                
    /* TEST PÅ 40 ÅR VAR GLEMT . TRUDE 300992 */                                
                                                                                
   IF B02.TT_ANV(BER_SØ_IND)  > 40  THEN                                        
      B02.TT_ANV(BER_SØ_IND)  = 40;                                             
                                                                                
  IF B02.TT_ANV(BER_SØ_IND) > B02.TT_ANV(BER_EK_IND) THEN                       
     DO;                                                                        
        TT_DIFF = B02.TT_ANV(BER_SØ_IND) - B02.TT_ANV(BER_EK_IND);              
        GP = 1 - REST_PROSENT * FAKTOR/100;                                     
        IF GP<GP_PROSENT THEN                                                   
           GP=GP_PROSENT;                                                       
        GP = GP * G * B02.TT_ANV(BER_EK_IND) / 40;                              
        GP = (GP + G * TT_DIFF/40)* UFGRAD / (100 * 12) + 0.5;                  
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        GP = 1 - REST_PROSENT * FAKTOR/100;                                     
        IF GP<GP_PROSENT THEN                                                   
           GP=GP_PROSENT;                                                       
        GP = GP * G * B02.TT_ANV(BER_SØ_IND) / 40;                              
        GP = GP * UFGRAD / 100;                                                 
        GP = GP / 12 + 0.5;                                                     
     END;                                                                       
                                                                                
 END;                                                                           
 IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'    THEN                                 
    DO;                                                                         
         Y_GP         = 1 - REST_PROSENT * FAKTOR/100;                          
        IF Y_GP<GP_PROSENT THEN                                                 
           Y_GP=GP_PROSENT;                                                     
         Y_GP         = Y_GP * G;                                               
         Y_GP         = Y_GP * B02.YRKEPENS.YUG(BER_SØ_IND)/100;                
         IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                            
            DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP = Y_GP + 0.5;                     
         B02.YRKEPENS.GP(BER_SØ_IND) = Y_GP/12 + 0.5;                           
         YP_GP_DEC                   = Y_GP/12;                                 
    END;                                                                        
                                                                                
                                                                                
 B02.UFØRPENS.GP(BER_SØ_IND) = GP;                                              
  L999:                                                                         
 END BEREGN_GP_UP_UTLAND;                                                       
