 /*       SIST ENDRET 23/01-98 09.57.32 AV   SPA7339                  */00000000
 /*       SIST ENDRET 28/07-94 13.10.43 AV   DYBVIK                   */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R0019959   F_2MDR                FUNKSJON        */00000050
 /*  PROGRAM-SPRÅK : PLI                                              */00000060
 /*  PROGRAMMERER  : HERMAN LARSSEN                                   */00000070
 /*  PROGRAMMET BLE LAGET : JULI 94                                   */00000080
 /*                                                                   */00000090
 /* ***************************************************************** */00000100
 /*HENSIKT:                                                           */00000110
 /* **********                                                        */00000120
 /* MOTTAR VIRKNINGSDATO_ÅM                                           */00000130
 /* TESTER PÅ OM DETTE ER 2 MÅNEDER ETTER INNEVÆRENDE MåNED           */00000140
 /* RETURNERER BIT = 1 HVIS JA   -  ELLERS '0'                        */00000150
 /*                                                                   */00000160
 /*   BRUK :                                                          */00000170
 /*     IF ^F_2MDR(VIRKDATO_ÅM)       THEN                            */00000180
 /*        FEIL                                                       */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*PROGRAMTILKNYTTING:                                                */00000220
 /* ********************                                              */00000230
 /*  PROGRAMMET CALLES AV DIVERSE PROGRAM                             */00000240
 /*  PROGRAMMET BRUKER BUILTIN FUNKSJON  'DATE'.                      */00000250
 /*                                                                   */00000260
 /* ***************************************************************** */00000270
 /*ENDRINGER:                                                         */00000280
 /* ***************************************************************** */00000290
 F_2MDR:                                                                00000300
   PROC (VIRKDATO_ÅMD) RETURNS(BIT (1));                                00000310
 %SKIP(2);                                                              00000320
   DCL                                                                  00000330
      DATE BUILTIN;                                                     00000340
   DCL                                                                  00000350
      VIRKDATO_ÅMD           PIC '99999999',                            00000360
      VIRK_ÅR DEF VIRKDATO_ÅMD POS (1) PIC '9999',                      00000370
      VIRK_MD DEF VIRKDATO_ÅMD POS (5) PIC '99';                        00000380
   DCL                                                                  00000390
      DATO_PIC           PIC '99999999',                                00000410
      ÅR DEF DATO_PIC POS(1) PIC '9999',                                00000420
      MD DEF DATO_PIC POS(5) PIC '99';                                  00000430
   DCL                                                                  00000440
      KODE BIT (1) INIT ('1'B);                                         00000450
 %SKIP(2);                                                              00000460
      DATO_PIC = DATO_2000;                                             00000480
      MD = MD + 2;                                                      00000490
      IF MD > 12             THEN                                       00000500
         DO;                                                            00000510
            ÅR = ÅR + 1;                                                00000520
            MD = MD - 12;                                               00000530
         END;                                                           00000540
      IF VIRK_ÅR > ÅR        THEN                                       00000550
         KODE = '0'B;                                                   00000560
      ELSE                                                              00000570
         IF VIRK_ÅR = ÅR     THEN                                       00000580
            IF VIRK_MD > MD  THEN                                       00000590
               KODE = '0'B;                                             00000600
      RETURN(KODE);                                                     00000610
   END F_2MDR;                                                          00000620
