 /*       SIST ENDRET 04/05-98 14.14.46 AV   JDA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R00104F7  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000040
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000050
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000060
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000120
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000130
 /*    FORHÅND.                                                       */00000140
 /*    MAPS HØRER INN UNDER MAPSET 'S001F2'.                         */ 00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*PROGRAMTILKNYTTING:                                                */00000180
 /* ********************                                              */00000190
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000200
 /*                                                                   */00000210
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000220
 /*    BRUK :                                                         */00000230
 /*    EXEC CICS XCTL PROGRAM ('R00104F7') COMMAREA(KOM_OMR);         */00000240
 /*    PROGRAMMET INCLUDER :                                          */00000250
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    F7       */00000260
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       F7       */00000270
 /* ***************************************************************** */00000280
 /*DATASETTOPPLYSNINGER:                                              */00000290
 /* ***********************                                           */00000300
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*FEILMELDINGER:                                                     */00000340
 /* *******************                                               */00000350
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000390
                                                                        00000400
          %INCLUDE P0019906;                                            00000410
          %INCLUDE P0019908;                                            00000420
          %INCLUDE P0019910;                                            00000430
          %INCLUDE P0019912;                                            00000440
          %INCLUDE P0019913;                                            00000450
                                                                        00000460
 DCL                                                                    00000470
      (CSTG, ADDR)                   BUILTIN;                           00000480
 DCL  COMMAREA_PEKER         PTR,                                       00000490
      LOKAL_KOM_PTR          PTR;                                       00000500
                                                                        00000510
                                                                        00000520
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000530
 DCL                                                                    00000540
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000550
    DFHBMUNP             CHAR(1) INIT(' '),                             00000560
    DFHBMBRY             CHAR(1) INIT('H'),                             00000570
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000580
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000590
    MELDING6O            CHAR(10),                                      00000600
    YMELDING6O           CHAR(10);                                      00000610
                                                                        00000620
          %INCLUDE S001F2  ;                                            00000630
          %INCLUDE P001NC01;                                            00000640
                                                                        00000650
                                                                        00000660
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000670
                                                                        00000680
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000690
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000700
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000710
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000720
                                                                        00000730
                                                                        00000740
                                                                        00000750
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000760
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000770
                                                                        00000780
           CALL OVERFØR_F7_SØKER_MAP;               /* R001NC06 */      00000790
           CALL TEKST_SØKER2;                       /* R001NC07 */      00000800
           CALL OVERFØR_F7_SØKER2_MAP;               /* R001NC06 */     00000810
           S001NC1O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000820
           IF TRANS_OMR.F7S.BT_ANT > 0 THEN                             00000830
              DO;                                                       00000840
                 CALL TEKST_BARN;                   /* R0011207 */      00000850
                 CALL OVERFØR_F7_BARN_MAP;    /* R0011206 */            00000860
              END;                                                      00000870
                                                                        00000880
         /*FREE TRANS_OMR,TRANS_OPPL_OMR;   */                          00000890
                                                                        00000900
                                                                        00000910
                                                                        00000920
      EXEC CICS RETURN;                                                 00000930
                                                                        00000940
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000950
      PROC(FIXED_DEC_5);                                                00000960
                                                                        00000970
      DCL                                                               00000980
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00000990
                                                                        00001000
   END SKRIV_FEIL;                                                      00001010
                                                                        00001020
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00001030
                                                                        00001040
           DCL                                                          00001050
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001060
                                                                        00001070
        END SKRIV_FEIL_YP;                                              00001080
                                                                        00001090
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001100
                                                                        00001110
           DCL                                                          00001120
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001130
                                                                        00001140
   END SKRIV_FEIL_SP;                                                   00001150
                                                                        00001160
   %INCLUDE R0019912;                                                   00001170
   %INCLUDE R001NC06;                                                   00001180
   %INCLUDE R001NC07;                                                   00001190
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00001200
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00001210
   %INCLUDE  R0019990;                        /*  KONV_HÅMD_DMÅ       */00001220
                                                                        00001230
 END R001041;                                                           00001240
