 /*   SIST ENDRET PÅ PROD   2008.11.05 16.23.31 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.12.13 13.27.50 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.11.21 13.15.09 AV   JDA2990          */        
 /*   SIST ENDRET PÅ QASS   2006.11.06 12.18.01 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.11.06 12.16.48 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 13.58.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.48.32 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.01.02 10.17.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.12.19 12.37.11 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.11.26 10.23.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.26 10.23.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.10.16 12.58.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.16 12.55.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.05.19 12.54.09 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.09  9.59.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.08.20  9.37.41 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.14 14.50.14 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.03.05  8.18.28 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.12.14 10.32.04 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.10.04 13.36.21 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.29 14.39.49 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.28 12.30.07 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.03.30  8.14.35 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.22 15.22.43 AV   JDA7339          */        
 /*       SIST ENDRET 11/08-99 10.36.33 AV   JDA7339                  */        
 /*       SIST ENDRET 11/08-99 10.35.02 AV   JDA7339                  */        
 /*       SIST ENDRET 12/05-99 14.29.53 AV   JDA7339                  */        
 /*       SIST ENDRET 12/05-99 14.29.12 AV   JDA7339                  */        
 /*       SIST ENDRET 03/05-99 14.01.17 AV   JDA7339                  */        
 /*       SIST ENDRET 03/05-99 14.00.17 AV   JDA7339                  */        
 /*       SIST ENDRET 16/03-99 10.59.37 AV   JDA7339                  */        
 /*       SIST ENDRET 16/03-99 10.59.16 AV   JDA7339                  */        
 /*       SIST ENDRET 02/12-98 10.09.21 AV   JDA7339                  */        
 /*       SIST ENDRET 02/12-98 10.08.40 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.58.40 AV   JDA7339                  */        
 /*       SIST ENDRET 14/05-96 15.14.10 AV   HLB0310                  */        
 /*                                                                   */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014164 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN BEREGNER BUP/FPP PÅ GRUNNLAG AV GODSKREVET POENG FOR   */        
 /*    ÅR FØR UFØREÅRET/DØDSÅRET.                                     */        
 /*ENDRING:                                                           */        
 /*    INNLAGT TEST PÅ 19-6 KRITETIER.                                */        
 /*                                    17.8.84 OLAV                   */        
 /*    INNLAGT ETTERLATTEGARANTI SLIK AT FPP ALDRI KAN BLI            */        
 /*    MINDRE ENN BUP FØR DØDSTIDSPUNKTET.                            */        
 /*                                    30.8.84 OLAV                   */        
 /*    ENDRING PÅ JUSTERINGEN AV INNTEKT_START_ÅR VED FLERE           */        
 /*    PERIODER NÅR FØRSTE PERIODE HAR INNTEKT_START_ÅR FØR 1967      */        
 /*                                    27.2.85 OLAV                   */        
 /*                                                                   */        
 /*ENDRING : GARANTIEN FOR UNGE UFØRE SKAL IKKE FØRE TIL ET POENGTALL */        
 /*          SOM OVERSTIGER GARANTIEN (INNTEKT + BUP * GRAD).         */        
 /*          17.3.87 - HL - FEILRAPP 440.                             */        
 /* OBS : ENDRINGEN OVENFOR ER RETTET TILBAKE, JF BREV FRA UFØRHETS-  */        
 /*       KONTORET, 7.5.87.   UTFØRT 29.6.87.                         */        
 /*                                                                   */        
 /*ENDRING PGA NY LOV FRA 1992 - HL.                                  */        
 /* ***************************************************************** */        
 BEREGN_BUP_FPP:PROC(FØDSELSÅR,IND);                                            
    DCL                                                                         
       I                  FIXED   BIN (15),                                     
       J                  FIXED   BIN (15),                                     
       K                  FIXED   BIN (15),                                     
       L                  FIXED   BIN (15),                                     
       TIDLIGSTE_START    PIC'99999' INIT(0),         /*2000*/                  
       INNTEKT_START_ÅR   PIC'99999' INIT(0),         /*2000*/                  
       INNTEKT_3_AV_4_ÅR  PIC'999' INIT(0),                                     
       STOPP_ÅR           PIC'99999' INIT(0),         /*2000*/                  
       START_ÅR           PIC'99999' INIT(0),         /*2000*/                  
       SISTE_START_ÅR     PIC'99999' INIT(0),         /*2000*/                  
       SISTE_OPPH_ÅR      PIC'99999' INIT(0),         /*2000*/                  
       SISTE_LOOP_ÅR      PIC'99999' INIT(0),         /*2000*/                  
       KRIT_19_6          FIXED(1) INIT(0),                                     
       W_POENG_ANVENDT    DEC FIXED (6,3) INIT (0),                             
       W_POENG_HJELP      DEC FIXED (6,2) INIT (0),                             
       W_BUP_PAÅ          DEC FIXED (6,2) INIT (0),                             
       W_BUP_PAÅ_100      DEC FIXED (6,2) INIT (0),  /*050494 TS?*/             
       W_BUP92            DEC FIXED (6,2) INIT (0),                             
       OVERFØRT_ÅR        FIXED DEC (5)   INIT(0),      /*2000*/                
       IND                FIXED   BIN (15),                                     
       W_BUP92_100        FIXED DEC (3,2) INIT (0),                             
       FØDSELSÅR          PIC'9999';                    /*2000*/                
 DCL   W_POENG_HJELP_LOV92 FIXED DEC (6,2) INIT (0);                            
 DCL   W_POENG_ANVENDT_LOV92 FIXED DEC (6,3) INIT (0);                          
 DCL   UNG_BUP_FPP92      FIXED DEC (3,2) INIT (0);     /*KONSTS*/              
 DCL   IND_U60            FIXED BIN (15) INIT (1967);   /*9811*/                
 DCL   ANT_OMS            FIXED DEC (3) INIT (0);     /*0200*/                  
 DCL   KOPI_ÅR            FIXED DEC (5) INIT (0);                               
 DCL   SIST_REG           FIXED   BIN (15);                                     
                                                                                
    /* === START UNDERMODUL 4164 ==================================== */        
                                                                                
    I = 0;                                                                      
    J = 0;                                                                      
    K = 0;                                                                      
    L = 0;                                                                      
                                                                                
    DO I = 1967 TO 1970;                            /*2000*/                    
 /*    HER FINNER VI FRAM TIL TIDLIGSTE STARTÅR UTEN Å TA HENSYN TIL  */        
 /*    ALDEREN PÅ PERSONEN. TIDLIGSTE STARTÅR ER NORMALT 1967, MEN    */        
 /*    I DE TILFELLER HVOR UFØREÅRET/DØDSÅRET ER 1967 - 1970, ER      */        
 /*    TIDLIGSTE STARTÅR 4 ÅR FØR UFØREÅRET/DØDSÅRET.                 */        
 /*                                                                   */        
     IF TAB.UFØR_START_MND(I) > 0 THEN                                          
        DO;                                                                     
           TIDLIGSTE_START = I - 4;                                             
           I = 1970;                              /*2000*/                      
        END;                                                                    
     ELSE                                                                       
        TIDLIGSTE_START = 1967;                   /*2000*/                      
  END;                                                                          
                                                                                
  START_ÅR            = FØDSELSÅR + 16;                                         
  INNTEKT_START_ÅR    = FØDSELSÅR + 17;                                         
  UNG_UFØR_START_ÅR   = FØDSELSÅR + 20;                                         
                                                                                
  IF START_ÅR < TIDLIGSTE_START THEN                                            
                                                                                
 /*                                                                   */        
 /*    STARTÅR KAN VÆRE DET ÅRET PERSONEN FYLLER 16 ÅR, MEN IKKE      */        
 /*    TIDLIGERE ENN TIDLIGSTE STARTÅR..                              */        
 /*                                                                   */        
                                                                                
     START_ÅR = TIDLIGSTE_START;                                                
                                                                                
                                                                                
  IF INNTEKT_START_ÅR < TIDLIGSTE_START THEN                                    
                                                                                
 /*                                                                   */        
 /*  INNTEKT STARTÅR ER DET ÅRET PERSONEN FYLLER 17 ÅR, MEN IKKE      */        
 /*  TIDLIGERE ENN TIDLIGSTE STARTÅR.                                 */        
 /*                                                                   */        
                                                                                
     INNTEKT_START_ÅR = TIDLIGSTE_START;                                        
                                                                                
                                                                                
  IF UNG_UFØR_START_ÅR < 1967 THEN                                              
     UNG_UFØR_START_ÅR = 1967;                                                  
                                                                                
                                                                                
  DO I = (DAGENS_DATO.ÅR + 1) TO 1963 BY -1;    /*2000*/                        
                                                                                
 /*                                                                   */        
 /*    HER FINNER VI FRAM TIL SISTE STARTPERIODE.                     */        
 /*    UFØREPERIODE, DØDSPERIODE, ALDERSPENSJONSPERIODE               */        
 /*                                                                   */        
                                                                                
     IF TAB.UFØR_PERIODE(I) = 'S' ! TAB.UFØR_PERIODE(I) = 'D' !                 
        TAB.UFØR_PERIODE(I) = 'A'                             THEN              
        DO;                                                                     
           SISTE_START_ÅR   = I;                                                
           I                = 1963;            /*2000*/                         
        END;                                                                    
  END;                                                                          
                                                                                
                                                                                
  IF (SISTE_START_ÅR < 1973) THEN                                               
     STOPP_ÅR = FØDSELSÅR + 69; /* GARANTI GAMLE REGLER */                      
  ELSE                                                                          
     DO;                                                                        
        STOPP_ÅR = FØDSELSÅR + 66;                                              
                                                                                
        IF FØDSELSÅR = 1903 !                    /*2000*/                       
           FØDSELSÅR = 1904 !               /*2000*/                            
           FØDSELSÅR = 1905       THEN      /*2000*/                            
                                                                                
           STOPP_ÅR = 1972;                      /*2000*/                       
                                                                                
        IF FØDSELSÅR = 1900 !              /*2000*/                             
           FØDSELSÅR = 1901 !               /*2000*/                            
           FØDSELSÅR = 1902       THEN     /*2000*/                             
                                                                                
           STOPP_ÅR = FØDSELSÅR + 69;                                           
     END;                                                                       
 /* ****************2000***************************                             
  IF W_FNR_R.ÅRHUNDRE > 4       THEN                                            
     STOPP_ÅR = STOPP_ÅR - 100;         *************** */                      
                                                                                
 /*TILLEGG 180496 HL : */                                                       
                                                                                
 /*DO I = STOPP_ÅR TO 1967 BY -1 ;   ENDRET AV MARTIN   2000*/                  
    DO I = STOPP_ÅR TO START_ÅR BY -1 ;                    /*2000*/             
       IF TAB.SISTE_BUP_ÅR(I) = 'J'   THEN                                      
          DO;                                                                   
             STOPP_ÅR =  I;                                                     
             I        = 1967;                          /*2000*/                 
          END;                                                                  
    END;                                                                        
                                                                                
    IF (B02.PENSJONSTYPE1(IND) = 'A' &                                          
        B02.KONV_P_KODE(IND)  ^= 'K'   )  THEN                                  
  /*    B02.KONV_P_KODE(IND)  ^= 'O' ) THEN    200102*/                         
       SISTE_LOOP_ÅR = STOPP_ÅR + 1;                                            
    ELSE                                                                        
       SISTE_LOOP_ÅR = SISTE_START_ÅR;                                          
                                                                                
  DO I = START_ÅR TO SISTE_LOOP_ÅR;                                             
     IF (TAB.UFØR_START_MND(I) > 0  !                                           
         TAB.POENGGARANTI  (I) > 0  )  &                                        
         I > 1966                      THEN       /*9908*/                      
        DO;  /* PERIODE MED START ETTER 1966, BUP/FPP SKAL BEREGNES*/           
           IF I < 1971                    THEN          /*2000*/                
              DO;  /* START FØR 1971 */                                         
                 OVERFØRT_ÅR = I;                                               
 /*4162*/        CALL LEGG_INNT_FØR_67_I_TAB(IND,OVERFØRT_ÅR);                  
              END; /* START FØR 1971 */                                         
           KRIT_19_6 = 0;                                                       
           DO J = 1967 TO I;                          /*2000*/                  
              IF TAB.POENG_ANVENDT(J) > 0             THEN                      
                 KRIT_19_6 =1; /* OPPDATERER UFØREKRITERER */                   
           END;                                                                 
           INNTEKT_3_AV_4_ÅR = 0;                                               
           IF KRIT_19_6 = 0    THEN                                             
              DO J = (I - 4) TO (I - 1);                                        
                 IF (TAB.POENG_ANVENDT(J) > 0                                   
                      & J > 1966)                  THEN                         
                    INNTEKT_3_AV_4_ÅR = INNTEKT_3_AV_4_ÅR + 1;                  
              END;                                                              
           ELSE                                                                 
              DO J = (I - 4) TO (I - 1);                                        
                 IF TAB.POENG_ANVENDT(J) > 0      THEN                          
                    INNTEKT_3_AV_4_ÅR = INNTEKT_3_AV_4_ÅR + 1;                  
                 ELSE                                                           
                 IF TAB.OMSORG_KODE(J) = 'J'    THEN                            
                    ANT_OMS = ANT_OMS + 1;               /*0200*/               
              END;                                                              
           J = 5;                                                               
           DO WHILE (ANT_OMS > 0);                                              
              IF TAB.POENG_ANVENDT(I - J) > 0       THEN                        
                 DO;                                                            
                    INNTEKT_3_AV_4_ÅR = INNTEKT_3_AV_4_ÅR + 1;                  
                    ANT_OMS = ANT_OMS - 1;                                      
                 END;                                                           
              ELSE                                                              
                 DO;                                                            
                    IF TAB.OMSORG_KODE(I - J) ^= 'J'   THEN                     
                       ANT_OMS = ANT_OMS - 1;                                   
                 END;                                                           
              J = J + 1;                                                        
           END;                                                                 
 /* 200107 HL : */                                                              
           IF TAB.UFØR_KRIT(I) = 0               THEN                           
              DO J = (I - 1) TO 1992 BY (-1)                                    
                           WHILE(TAB.OMSORG_KODE(J) = 'J');                     
                 IF TAB.POENG_ANVENDT(J-1) > 0     THEN                         
                    TAB.UFØR_KRIT(I) = 2;                                       
              END;                                                              
           IF INNTEKT_START_ÅR       < 1967        THEN   /*2000*/              
              DO;                                                               
                 IF (I - 4) > 1966                 THEN   /*2000*/              
                    INNTEKT_START_ÅR = 1967;              /*2000*/              
              END;                                                              
 %PAGE;                                                                         
    IF    ((DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J') &      /*EØS*/              
           (B02.EØS_8_4_3A(IND) = 'J')           )          !                   
              (TAB.UFØR_KRIT(I) > 1 !                                           
              (TAB.POENG_ANVENDT(I - 1) > 0 & (I - 1) > 1966) ! /*2000*/        
              INNTEKT_3_AV_4_ÅR > 2)  &                                         
              INNTEKT_START_ÅR  < I THEN                                        
                                                                                
 /*                                                                   */        
 /*       FPP/BUP BEREGNES HVIS EN AV DISSE BETINGELSENE ER OPPFYLT:  */        
 /*               - UFØR_KRIT > 1   (DVS. 8-4, NR. 3A = JA)           */        
 /*               - INNTEKT I ÅR FØR UFØREÅRET > 0                    */        
 /*               - INNTEKT I 3 AV 4 ÅR FØR UFØREÅRET                 */        
 /*           OG FOR DE OVENNEVNTE BETINGELSER AT INNTEKT STARTÅRET   */        
 /*           LIGGER FØR STARTÅRET FOR PERIODEN                       */        
 /*                                                                   */        
                                                                                
              DO;                                                               
                 CALL REGN_BUP_FPP((INNTEKT_START_ÅR),I); /* 4171 */            
                                                                                
                 IF TAB.UFØR_PERIODE   (I)      = 'D' &                         
                                                                                
                    TAB.SISTE_BUP_ÅR(I-1)  ^= 'J'              &                
                                                                                
                    TAB.UFØR_SLUTT_KODE(I - 1)  = ' '     THEN                  
                    DO;                                                         
                       IF I = 1992 THEN                    /*2000*/             
                         DO;                                                    
                            TAB.POENG_KODE(I) = 'U54';    /*H*/                 
                            IF BUP_FPP92(I) < BUP92_UFØR       THEN             
                               TAB.BUP_FPP(I) = BUP92_UFØR;                     
                            ELSE;                                               
                         END;                                                   
                       ELSE                                                     
                        DO;        /*9807*/                                     
                          IF TAB.BUP_FPP(I)  < TAB.BUP_FPP(I - 1)  THEN         
                             TAB.BUP_FPP(I)  = TAB.BUP_FPP(I - 1);              
                          IF BUP_FPP92(I)  <  BUP_FPP92(I - 1)  THEN            
                             BUP_FPP92(I)  =  BUP_FPP92(I - 1);                 
  /*200012 HL : */        IF TAB.POENG_KODE(I - 1) ^= 'U54'   THEN              
                             TAB.POENG_KODE(I) =                                
                                 TAB.POENG_KODE(I - 1);                         
                        END;                                                    
                    END;                                                        
              END;                                                              
                                                                                
           ELSE                                                                 
              DO;               /*9807*/                                        
                 TAB.BUP_FPP(I)       = 0;                                      
                 BUP_FPP92(I)         = 0;                                      
              END;                                                              
           IF I > STOPP_ÅR               THEN                                   
              DO;              /*9807*/                                         
                 TAB.BUP_FPP(I)       = 0;                                      
                 BUP_FPP92  (I)       = 0;                                      
              END;                                                              
                                                                                
 %PAGE;                                                                         
                                                                                
           IF I                        >= UNG_UFØR_START_ÅR   &                 
                                                                                
                                                                                
              TAB.POENGGARANTI_KODE(I)  ='B'                  &                 
              TAB.SISTE_BUP_ÅR(I-1)  ^= 'J'              &                      
  /*          TAB.POENGGARANTI(I)      >  TAB.BUP_FPP(I)        THEN*/          
              TAB.POENGGARANTI(I)     >=  TAB.BUP_FPP(I) THEN /*9811*/          
                                                                                
              DO;                                                               
 /*                                                                */           
 /*              UNG UFØR ER GARANTERT EN BUP PÅ 2.00 POENG        */           
 /*              FRA 1.5.87 ER GARANTIEN         2.50 POENG        */           
 /*              FRA 1.5.88 ER GARANTIEN         3.00 POENG        */           
 /*              FRA 1.5.92 ER GARANTIEN         3.30 POENG        */           
 /*              FRA 1.5.08 ER GARANTIEN         3.50 POENG        */           
 /*              TAB.POENGGARANTI INNEHOLDER DET GARANTERTE POENGET*/           
 /*                                                                */           
                 TAB.BUP_FPP(I)    = TAB.POENGGARANTI(I);                       
           /*BARE SISTE PERIODE FÅR TEKST U60 - 9809 HL : */                    
                 IF TAB.POENG_KODE(IND_U60) = 'U60'       THEN                  
                    TAB.POENG_KODE(IND_U60) = 'U59';                            
                 IND_U60           = I;                                         
                 TAB.POENG_KODE(I) = 'U60';                                     
                 IF BUP_FPP92(I)   < TAB.POENGGARANTI(I)   THEN                 
                    BUP_FPP92(I)   = TAB.POENGGARANTI(I);                       
              END;                                                              
                                                                                
           IF I                       = SISTE_START_ÅR    &                     
              SISTE_START_ÅR          = SISTE_LOOP_ÅR         THEN              
                                                                                
              DO;                                                               
                 TAB.POENG_ANVENDT(I) = TAB.BUP_FPP(I);                         
                 TAB.POENG_ANVENDT_LOV92(I) = BUP_FPP92(I);                     
                 IF TAB.BUP_FPP(I)  > 0                   &                     
                    TAB.BUP_FPP(I) > TAB.POENGGARANTI(I)    THEN                
                                                                                
                       IF (I > 1991)         !               /*2000*/           
                          (STOPP_ÅR < 1992)            THEN  /*2000*/           
                          IF (B02.KONV_P_KODE(IND) = 'K'  !                     
                              B02.KONV_P_KODE(IND) = 'O'   ) &                  
         /*200408 HL: */                                                        
                              TAB.UFØR_PERIODE(I) ^= 'D'     THEN               
                             TAB.POENG_KODE(I) = 'U44';                         
                          ELSE                                                  
                             TAB.POENG_KODE(I) = 'U54';                         
                       ELSE                                                     
          /*JD 7.92*/  IF B02.PENSJONSTYPE1(IND) = 'K'   THEN                   
     /*                   TAB.POENG_KODE(I) = 'U57';    */                      
                          TAB.POENG_KODE(I) = 'U44';                            
                       ELSE                                                     
                          TAB.POENG_KODE(I) = 'U59';                            
              END;                                                              
                                                                                
           ELSE                                                                 
                                                                                
   /*SÆRSKILT BEREGNING FOR UNGE UFØRE FØR 1967 : (9811) */                     
                                                                                
           IF I = 1967                     &                                    
              TAB.POENGGARANTI(1967) > 0   &                                    
              TAB.UFØR_START_MND(1966) > 0       THEN                           
              DO;              /*9903 : */                                      
      TAB.POENG_ANVENDT(1967) = TAB.INNT_POENG(1967) + 0.005 +                  
                 (TAB.POENGGARANTI(1967) * TAB.UFØR_GRAD(1967) /100);           
                                                                                
                 IF TAB.POENG_ANVENDT(1967) > 7.00        THEN                  
                    TAB.POENG_ANVENDT(1967) = 7.00;   /*200003*/                
                                                                                
                 TAB.POENG_ANVENDT_LOV92(1967) =                                
                                       TAB.POENG_ANVENDT(1967);                 
                                                                                
              END;                                                              
           ELSE                                                                 
   /*HIT 9811 */                                                                
              IF TAB.BUP_FPP(I) > TAB.INNT_POENG(I) THEN                        
 /*                                                                   */        
 /*           FOR STARTÅRET FÅR EN GODSKREVET DET POENG SOM ER BEST,  */        
 /*           BUP ELLER POENG_ANVENDT                                 */        
 /*                                                                   */        
 /*TILLEGG 24.3.87 - HL - FRAPP 268 OG 366 - KODE 'F' MANGLET         */        
 /*                       FOR UFØREÅRET                               */        
                                                                                
                 DO;                                                            
                    TAB.POENG_ANVENDT(I) = TAB.BUP_FPP(I);                      
                    TAB.POENG_ANVENDT_LOV92(I) = BUP_FPP92(I);                  
                                                                                
                    IF TAB.UFØR_PERIODE (I) = 'S'        THEN                   
                                                                                
                       DO;                                                      
                          IF TAB.UFØR_KRIT(I) = 5     THEN                      
                             TAB.POENG_KODE (I) = 'U42';/*KODE 'L'*/            
                          ELSE                                                  
                                                                                
                          IF TAB.UFØR_KRIT(I)  = 6          THEN                
        /*                TAB.POENG_KODE(I) = 'U57';       KODE 'D' */          
                          TAB.POENG_KODE(I) = 'U44';     /*KODE 'N' */          
                          ELSE                                                  
                                                                                
                             TAB.POENG_KODE (I) = 'U59';/*KODE 'F'*/            
                                                                                
                          IF TAB.POENG_ANVENDT(I) < TAB.PAÅ(I) THEN             
                             DO;                                                
                                TAB.POENG_ANVENDT(I) = TAB.PAÅ(I);              
                                TAB.POENG_ANVENDT_LOV92(I) = TAB.PAÅ(I);        
                             END;                                               
                       END;                                                     
                 END;                                                           
              ELSE                                                              
                                                                                
                 DO;                                                            
 /*                                                                   */        
 /*              NÅR BUP ER MINDRE ENN POENG_ANVENDT LEGGES BUP I     */        
 /*              NESTE ÅRS POENG_ANVENDT NÅR FLERE PERIODER.          */        
 /*                                                                   */        
                    IF (I + 1) <= STOPP_ÅR   THEN                               
                       DO;                                                      
                        TAB.POENG_ANVENDT(I + 1) = TAB.BUP_FPP(I);              
                  TAB.POENG_ANVENDT_LOV92(I + 1) = BUP_FPP92(I);                
                       END;                                                     
                                                                                
                    TAB.POENG_ANVENDT(I) = TAB.INNT_POENG(I) + 0.005;           
        TAB.POENG_ANVENDT_LOV92(I) = TAB.INNT_POENG_LOV92(I) + 0.005;           
                                                                                
                    IF TAB.UFØR_PERIODE (I) = 'S'        THEN                   
                       DO;                                                      
                          IF TAB.UFØR_KRIT(I) = 5     THEN                      
                             TAB.POENG_KODE (I) = 'U42';/*KODE 'L'*/            
                          ELSE                                                  
                                                                                
                          IF TAB.UFØR_KRIT(I)  = 6          THEN                
    /*                    TAB.POENG_KODE(I) = 'U57';       KODE 'D' */          
                          TAB.POENG_KODE(I) = 'U44';     /*KODE 'N' */          
                          ELSE                                                  
                                                                                
                             TAB.POENG_KODE (I) = 'U59';/*KODE 'F'*/            
                                                                                
                          IF TAB.POENG_ANVENDT(I) < TAB.PAÅ(I) THEN             
                             DO;                                                
                                TAB.POENG_ANVENDT(I) = TAB.PAÅ(I);              
                                TAB.POENG_ANVENDT_LOV92(I) = TAB.PAÅ(I);        
                             END;                                               
                       END;                                                     
                                                                                
                                                                                
                 END;                                                           
                                                                                
           K = 0;                                                               
                                                                                
           DO J = (I + 1) TO STOPP_ÅR UNTIL (TAB.UFØR_SLUTT_MND(J) > 0);        
                                                                                
                                                                                
             IF TAB.SISTE_BUP_ÅR(J-1)  ^= 'J'         THEN                      
             DO;                                                                
                TAB.BUP_FPP(J) = TAB.BUP_FPP(J - 1);                            
                BUP_FPP92(J)   = BUP_FPP92(J - 1);                              
      /*2000 : */                                                               
                IF J = 1992                    THEN                             
                  DO;                                                           
                    IF TAB.BUP_FPP(1991) > 5         THEN                       
                       IF BUP_FPP92(I) > 5          THEN                        
                          TAB.BUP_FPP(1992) = BUP_FPP92(I);                     
                       ELSE                                                     
                          TAB.BUP_FPP(1992) = 5;                                
                                                                                
                    IF B02.PENSJONSTYPE1(IND) = 'D'  &                          
                       (I < DØDSDATO.ÅR     )        THEN                       
                                                                                
                       BUP92_UFØR      = BUP_FPP92(I);                          
                                                                                
                    IF I   = SISTE_START_ÅR    &                                
                       SISTE_START_ÅR  = SISTE_LOOP_ÅR     &                    
                                                                                
                       TAB.BUP_FPP(I)  > 0                 &                    
                       TAB.BUP_FPP(1992) > TAB.POENGGARANTI(I) THEN             
                                                                                
                       TAB.POENG_KODE(1992) = 'U54';                            
                  END;                                                          
             END;                                                               
                                                                                
              IF J                        >= UNG_UFØR_START_ÅR &                
                                                                                
 /*FJERNET OG LAGT INN LINJEN NEDENFOR 11.3.87 HL - FRAPP 476/488*/             
                                                                                
                 TAB.POENGGARANTI_KODE(I)  ='B'               &                 
              TAB.SISTE_BUP_ÅR(J-1)  ^= 'J'              &                      
      /*         TAB.POENGGARANTI(I)      >  TAB.BUP_FPP(J) THEN 9811*/         
                 TAB.POENGGARANTI(I)     >=  TAB.BUP_FPP(J) THEN                
                  DO;                                                           
 /*                                                                   */        
 /*                 UNG UFØR ER GARANTERT EN BUP PÅ 2.00 POENG        */        
 /*                 FRA 1.5.87 ER GARANTIEN         2.50 POENG        */        
 /*                 FRA 1.5.88 ER GARANTIEN         3.00 POENG        */        
 /*                 FRA 1.5.92 ER GARANTIEN         3.30 POENG        */        
 /*                 FRA 1.5.08 ER GARANTIEN         3.50 POENG        */        
 /*                 TAB.POENGGARANTI INNEHOLDER DET GARANTERTE POENGET*/        
 /*                                                                   */        
                    TAB.BUP_FPP(J)    = TAB.POENGGARANTI(I);                    
                    IF BUP_FPP92(J)   < TAB.POENGGARANTI(I)  THEN               
                       BUP_FPP92(J)   = TAB.POENGGARANTI(I);                    
                                                                                
                    IF K = 0    THEN                                            
                                                                                
                       DO;  /*BARE SISTE ER U60 - 9811*/                        
                          IF TAB.POENG_KODE(IND_U60) = 'U60'  THEN              
                             TAB.POENG_KODE(IND_U60) = 'U59';                   
                          IND_U60           = J;                                
                          TAB.POENG_KODE(J) = 'U60';                            
                          K                 = J;                                
                       END;                                                     
                  END;                                                          
                                                                                
              IF TAB.UFØR_PERIODE(J) = 'F' !                                    
                 TAB.UFØR_PERIODE(J) = 'L' THEN                                 
 /*                                                                   */        
 /*              NÅR UFØREPERIODEN ER EN LØPENDE PERIODE ELLER        */        
 /*              PERIODEN LIGGER MELLOM DØDSTIDSP. OG 66/69 ÅR        */        
 /*              FLYTTES BUP/FPP TIL POENG_ANVENDT..                  */        
 /*                                                                   */        
                 DO;                                                            
                    TAB.POENG_ANVENDT(J) = TAB.BUP_FPP(J);                      
                    TAB.POENG_ANVENDT_LOV92(J) = BUP_FPP92(J);                  
 /* TILLEGG 200008 HL : */                                                      
                    IF B02.PENSJONSTYPE1(IND) = 'D' THEN                        
                       IF (J < 1992  )      &                                   
                          (TAB.POENG_KODE(J - 1) ^= 'U54')   THEN               
                          TAB.POENG_KODE(J) =                                   
                                    TAB.POENG_KODE(J - 1);                      
                 END;                                                           
           END;                                                                 
                                                                                
           IF J < STOPP_ÅR &  TAB.UFØR_PERIODE(J + 1) = 'F'   THEN              
                                                                                
              DO K = (J + 1) TO STOPP_ÅR;                                       
                                                                                
                 IF VIRK_LOV92_ÅM < 199200         THEN    /*2000*/             
                    TAB.POENG_ANVENDT(K) = TAB.POENG_ANVENDT(J);                
                 ELSE                                                           
                 IF K > 1991 THEN                          /*2000*/             
                    DO;                                                         
                    TAB.POENG_ANVENDT(K) = TAB.POENG_ANVENDT_LOV92(J);          
                       IF (K = 1992) & B02.PENSJONSTYPE1(IND) = 'D' THEN        
                          TAB.POENG_KODE(K) = 'U54';                            
                    END;                                                        
                 ELSE                                                           
                    TAB.POENG_ANVENDT(K) = TAB.POENG_ANVENDT(J);                
                 TAB.POENG_ANVENDT_LOV92(K)= TAB.POENG_ANVENDT_LOV92(J);        
              END;                                                              
                                                                                
           IF TAB.UFØR_SLUTT_MND(J) = 01 THEN                                   
              TAB.BUP_FPP(J) = 0;                                               
        END;                                                                    
                                                                                
 %PAGE;                                                                         
                                                                                
     ELSE  /* DA ER IKKE: TAB.UFØR_START_MND(I) > 0 & I > 66 */                 
                                                                                
     IF I >= INNTEKT_START_ÅR      THEN                                         
 /*                                                                   */        
 /*        BEHANDLING AV HVERT ENKELT ÅR FØR EN PERIODESTART.....     */        
 /*                                                                   */        
     DO;                                                                        
        IF I = 1992 THEN                           /*2000*/                     
           TAB.BUP_FPP(I)   = BUP_FPP92(I);                                     
           IF TAB.VERNEPL_POENG(I) > TAB.INNT_POENG(I) THEN                     
              DO;                                                               
 /*                                                                   */        
 /*                 NÅR VERNEPLIKTSPOENG ER STØRRE ENN INNTEKTSPOENG, */        
 /*                 BENYTTES VERNEPLIKTSPOENGET TIL BEREGNING AV      */        
 /*                 BUP/FPP.                                          */        
 /*                                                                   */        
                    W_POENG_ANVENDT = TAB.VERNEPL_POENG(I);                     
                    W_POENG_ANVENDT_LOV92 = TAB.VERNEPL_POENG_LOV92(I);         
                                                                                
                    IF TAB.VERNEPL_POENG(I) = 2.00 THEN                         
                       TAB.POENG_KODE(I) = 'U56';                               
                    ELSE                                                        
                       TAB.POENG_KODE(I) = 'U55';                               
              END;                                                              
                                                                                
           ELSE                                                                 
                                                                                
              DO;                                                               
                    W_POENG_ANVENDT = TAB.INNT_POENG(I)+ 0.005;                 
                    W_POENG_ANVENDT_LOV92 = TAB.INNT_POENG_LOV92(I)             
                                            + 0.005;                            
              END;                                                              
                                                                                
        IF TAB.UFØR_PERIODE(I) = 'D'                                            
                          ! TAB.UFØR_PERIODE(I) = 'J' THEN                      
                                                                                
           DO;                                                                  
              IF W_POENG_ANVENDT < TAB.BUP_FPP(I)   THEN                        
                 DO;                                                            
                    W_POENG_ANVENDT = TAB.BUP_FPP(I);                           
                    IF TAB.UFØR_KRIT(I) = 6       THEN                          
                       TAB.POENG_KODE(I) = 'U44';   /*KODE 'N' */               
                 END;                                                           
              IF W_POENG_ANVENDT_LOV92 < BUP_FPP92(I)     THEN                  
                 W_POENG_ANVENDT_LOV92 = BUP_FPP92(I);                          
           END;                                                                 
                                                                                
        ELSE                                                                    
                                                                                
        IF TAB.UFØR_PERIODE(I) = 'M' THEN                                       
        DO;                                                                     
    /*UP-AFP-UP  REMEDY 2392  - 27.10.2006 : */                                 
                                                                                
                 IF TAB.POENGGARANTI_KODE(I) = 'C'    THEN                      
                    DO;                                                         
                       DO J = 1 TO 7 WHILE(B02.UFT_ÅMD(IND,J) > 0);             
                          SIST_REG = J;                                         
                       END;                                                     
                       KOPI_ÅR = B02.UFT_ÅMD(IND,SIST_REG) / 10000;             
                       TAB.BUP_FPP(I) = TAB.BUP_FPP(KOPI_ÅR);                   
                       TAB.UFØR_GRAD(I) = TAB.UFØR_GRAD(KOPI_ÅR);               
                       BUP_FPP92(I)   = TAB.BUP_FPP(KOPI_ÅR);                   
                    END;                                                        
                 ELSE                                                           
           W_POENG_HJELP   = TAB.INNT_POENG(I)  + 0.005;                        
           W_POENG_HJELP_LOV92 =                                                
                              TAB.INNT_POENG_LOV92(I)  + 0.005;                 
           IF TAB.NY_3_19(I) = 'J'          THEN                                
              CALL SENERE_VIRK;                                                 
           ELSE                                                                 
           IF TAB.BUP_FPP(I) < TAB.PAÅ(I)            THEN                       
              DO;                                                               
                 IF I < 1989 THEN              /*2000*/                         
                    DO;                                                         
                     W_POENG_ANVENDT = W_POENG_HJELP             +              
                       (TAB.BUP_FPP(I) *                                        
                     (TAB.UFØR_GRAD(I) - TAB.YRKE_GRAD(I))/ 100) +              
                      ((TAB.PAÅ(I) * TAB.YRKE_GRAD(I))  / 100)   +              
                                                        0.005;                  
                     W_POENG_ANVENDT_LOV92 = W_POENG_HJELP_LOV92 +              
                       (BUP_FPP92(I) *                                          
                     (TAB.UFØR_GRAD(I) - TAB.YRKE_GRAD(I))/ 100) +              
                       ((TAB.PAÅ(I) * TAB.YRKE_GRAD(I)) / 100)   +              
                                                        0.005;                  
                    END;                                                        
                 ELSE                                                           
                    DO;                                                         
                       W_BUP_PAÅ_100 = TAB.PAÅ(I);                              
                       W_BUP_PAÅ =                                              
                             (TAB.BUP_FPP(I) *                                  
                          (TAB.UFØR_GRAD(I) - TAB.YRKE_GRAD(I))/ 100) +         
                            ((TAB.PAÅ(I) * TAB.YRKE_GRAD(I)) / 100)   +         
                                                        0.005;                  
                                                                                
                             /*LAGT INN TO STM . TRUDE 020994*/                 
                        W_BUP92_100 = TAB.PAÅ(I);                               
                        W_BUP92     = W_BUP_PAÅ;                                
                                                                                
                        CALL BEGRENSET_POENGOPPTJENING;                         
                    END;                                                        
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                 IF I < 1989 THEN             /*2000*/                          
                    DO;                                                         
                       W_POENG_ANVENDT = W_POENG_HJELP       +                  
                       ((TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I))/100) +              
                                                        0.005;                  
                       W_POENG_ANVENDT_LOV92 = W_POENG_HJELP_LOV92 +            
                           ((BUP_FPP92(I) * TAB.UFØR_GRAD(I))/100) +            
                                                        0.005;                  
                    END;                                                        
                 ELSE                                                           
                    DO;                                                         
                       W_BUP_PAÅ_100 = TAB.BUP_FPP(I);                          
                           W_BUP_PAÅ =                                          
                       ((TAB.BUP_FPP(I) * TAB.UFØR_GRAD(I))/100)  +             
                                                        0.005;                  
                           W_BUP92_100 = BUP_FPP92(I);                          
                           W_BUP92   =                                          
                       ((BUP_FPP92(I) * TAB.UFØR_GRAD(I))/100)  +               
                                                        0.005;                  
                        CALL BEGRENSET_POENGOPPTJENING;                         
                    END;                                                        
                                                                                
              END;                                                              
           IF TAB.UFØR_KRIT(I) = 5     THEN                                     
              TAB.POENG_KODE (I) = 'U42';/*KODE 'L'*/                           
           ELSE                                                                 
           IF TAB.UFØR_KRIT(I)  = 6          THEN                               
       /*                 TAB.POENG_KODE(I) = 'U57';       KODE 'D' */          
                          TAB.POENG_KODE(I) = 'U44';     /*KODE 'N' */          
           ELSE                                                                 
           IF TAB.UFØR_GRAD(I) > 0         THEN   /*200312 HL*/                 
              TAB.POENG_KODE(I) = 'U59';                                        
                                                                                
        END;  /*UFØR_PERIODE = 'M' */                                           
                                                                                
        IF W_POENG_ANVENDT_LOV92 > 7.00      THEN                               
            W_POENG_ANVENDT_LOV92 = 7.00;                                       
                                                                                
        IF I > 1970            &                /*2000*/                        
           I < 1992                    THEN     /*2000*/                        
                                                                                
           IF W_POENG_ANVENDT > 8.33 THEN                                       
              W_POENG_ANVENDT  = 8.33;                                          
           ELSE;                                                                
        ELSE                                                                    
        IF W_POENG_ANVENDT > 7.00 THEN                                          
           W_POENG_ANVENDT  = 7.00;                                             
                                                                                
  /* JFA 5.9.03 PAÅ KAN VÆRE > 7 ETTER 1991 NÅR YSK ER FØR 1992 */              
        IF I > 1991 THEN                                                        
         /*       IF B02.YRKEPENS.YUG(IND) > 0 &     */                         
           IF B02.YRKEPENS.YUG(IND) = 100 &                                     
              TAB.PAÅ(I) > 7.00 &                                               
              B02.YRKEHIST(1).YST_ÅMD(IND) < 19920000 THEN                      
                  W_POENG_ANVENDT  = TAB.PAÅ(I);                                
   /* HIT 5.9.93 */                                                             
                                                                                
        IF I <= STOPP_ÅR               THEN                                     
           DO;                                                                  
              TAB.POENG_ANVENDT(I) = W_POENG_ANVENDT;                           
              TAB.POENG_ANVENDT_LOV92(I) = W_POENG_ANVENDT_LOV92;               
           END;                                                                 
     END;                                                                       
                                                                                
  END;                                                                          
                                                                                
                                                                                
   IF SISTE_LOOP_ÅR > 0          THEN                                           
      IF TAB.BUP_FPP(SISTE_LOOP_ÅR) = 0          THEN                           
         DO L = START_ÅR TO SISTE_LOOP_ÅR;                                      
            IF TAB.POENG_KODE(L) = 'U55'    !                                   
               TAB.POENG_KODE(L) = 'U56'            THEN                        
               TAB.POENG_KODE(L) = '   '        ;                               
         END;                                                                   
                                                                                
    /* ******************************************** */                          
                                                                                
 /*ENDRET 0689 HL - NY REGEL FOR BEGRENSNING AV POENGOPPTJENING : */            
 /*GJELDER FOR INNTEKTSÅR 1989 OG SENERE */                                     
    /* -------------------------------------------------------------- */        
    /* INTERN PROSEDYRE I 4164                                        */        
    /* -------------------------------------------------------------- */        
    BEGRENSET_POENGOPPTJENING : PROC;                                           
       DCL MAX       FIXED DEC (3,2) INIT (0);                                  
       DCL MAX_92    FIXED DEC (3,2) INIT (0);                                  
                                                                                
  /*NÅR DET ER FRYSPERIODE MED '0' I GRAD, SÅ GJELDER IKKE  */                  
  /*BEGRENSNINGSREGELEN - 200311 HL :                       */                  
       IF TAB.UFØR_GRAD(I) = 0                THEN                              
          DO;                                                                   
             W_POENG_ANVENDT =  W_POENG_HJELP + 0.005;                          
             W_POENG_ANVENDT_LOV92 = W_POENG_HJELP_LOV92 + 0.005;               
             GOTO SLUTT_BEGRENSET;                                              
          END;                                                                  
                                                                                
       /*DEN SOM ER 100 % UFØR KAN MAX TJENE OPP 0.5 POENG I TILLEGG:*/         
       IF TAB.UFØR_GRAD(I) = 100 THEN                                           
          DO;                                                                   
             IF (W_POENG_HJELP > 0.5) THEN                                      
                W_POENG_HJELP = 0.5;                                            
             IF (W_POENG_HJELP_LOV92 > 0.5) THEN                                
                W_POENG_HJELP_LOV92 = 0.5;                                      
                                                                                
          END;                                                                  
                                                                                
 /*MAN KAN FÅ GODSKREVET INNTIL EN 100 % BUP - LIKEVEL INNTIL 4 : */            
                                                                                
       IF (W_BUP_PAÅ_100 > 4) THEN                                              
          MAX = W_BUP_PAÅ_100 + 0.005;                                          
       ELSE                                                                     
          MAX = 4;                                                              
                                                                                
       IF (W_BUP92_100 > 4) THEN                                                
          MAX_92 = W_BUP92_100 + 0.005;                                         
       ELSE                                                                     
          MAX_92 = 4;                                                           
                                                                                
                                                                                
       IF ((W_BUP_PAÅ + W_POENG_HJELP) > MAX) THEN                              
          W_POENG_ANVENDT = MAX;                                                
       ELSE                                                                     
          W_POENG_ANVENDT = W_BUP_PAÅ + W_POENG_HJELP + 0.005;                  
                                                                                
       IF ((W_BUP92 + W_POENG_HJELP_LOV92) > MAX_92) THEN                       
          W_POENG_ANVENDT_LOV92 = MAX_92;                                       
       ELSE                                                                     
          W_POENG_ANVENDT_LOV92 = W_BUP92+W_POENG_HJELP_LOV92+0.005;            
    SLUTT_BEGRENSET:                                                            
    END BEGRENSET_POENGOPPTJENING;                                              
                                                                                
  /*FRA 2004 GJELDER NY REGEL OM AT NÅR VIRK ER ET SENERE ÅR ENN*/              
  /*UFT, SÅ SKAL REGLER FOR STARTÅRET GJELDE I VIRK-ÅRET :      */              
                                                                                
    SENERE_VIRK: PROC;                                                          
       DCL FULL_BUP      FIXED DEC (3,2) INIT (0);                              
                                                                                
       IF TAB.BUP_FPP(I) < TAB.PAÅ(I)            THEN                           
          FULL_BUP = TAB.PAÅ(I);                                                
       ELSE                                                                     
          FULL_BUP = TAB.BUP_FPP(I);                                            
       IF FULL_BUP < TAB.INNT_POENG(I)      THEN                                
          W_POENG_ANVENDT = TAB.INNT_POENG(I) + 0.005;                          
       ELSE                                                                     
          W_POENG_ANVENDT = FULL_BUP;                                           
                                                                                
       W_POENG_ANVENDT_LOV92 = W_POENG_ANVENDT;                                 
                                                                                
    END SENERE_VIRK;                                                            
                                                                                
 END BEREGN_BUP_FPP;                                                            
