 /*       SIST ENDRET 26/11-97 12.54.17 AV   SPA7339                  */00000000
 /* ***************************************************************  */ 00000010
 /* PROC FOR KONVERTERING AV DATO    ÅR.MND                          */ 00000020
 /* ***************************************************************  */ 00000030
  KONV_HÅMD_ÅM: PROC(IN_DATO) RETURNS(PIC '9999'  );                    00000040
  DCL IN_DATO     PIC '(8)9';                                           00000050
  DCL UT_DATO     PIC '9999'   ;                                        00000060
  DCL 1 H_DATO,                                                         00000070
        02 HH     PIC '99'  INIT (00),                                  00000080
        02 ÅR     PIC '99'  INIT (00),                                  00000090
        02 MM     PIC '99'  INIT (00),                                  00000100
        02 DD     PIC '99'  INIT (00),                                  00000110
      1 H_DATO_IN DEF H_DATO PIC '99999999';                            00000120
                                                                        00000130
  DCL 1 H_DATO_UT,                                                      00000140
        02 ÅR     PIC '99'  INIT (00),                                  00000150
        02 MM     PIC '99'  INIT (00),                                  00000160
      1 H_DATO_UT_PK  DEF H_DATO_UT  PIC '9999';                        00000170
                                                                        00000180
  IF IN_DATO > 0 THEN                                                   00000190
     DO;                                                                00000200
        H_DATO_IN  = IN_DATO;                                           00000210
        H_DATO_UT = H_DATO, BY NAME;                                    00000220
     END;                                                               00000230
  ELSE                                                                  00000240
     H_DATO_UT_PK = 0;                                                  00000250
                                                                        00000260
     UT_DATO = H_DATO_UT_PK;                                            00000270
                                                                        00000280
     RETURN (UT_DATO);                                                  00000290
  END KONV_HÅMD_ÅM;                                                     00000300
                                                                        00000310
