 /*       SIST ENDRET 02/09-98 10.18.01 AV   SPA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R001IA09 - SUBPROGRAM - FLYTTER OO         FRA   */00000040
 /*                                          MAP TIL ARBEIDSOMRÅDE    */00000050
 /*  PROGRAM-SPRÅK : PLI                                              */00000060
 /*  PROGRAMMERER  : PATAHK                                           */00000070
 /*  PROGRAMMET BLE LAGET : FEB 1994                                  */00000080
 /*  PROGRAMMET BLE ENDRET: ÅR2000 - 04.06.1998 - O.GØYTIL.           */00000090
 /*                       : KUN FJERNET 'SIST ENDRET'.                */00000100
 /* **********                                                        */00000110
 /*HENSIKT:                                                           */00000120
 /* **********                                                        */00000130
 /*  OVERFØRER DATA FRA SKJERMBILDE                                   */00000140
 /*  - MAP S001IA1 - TIL OO_TRANS_OMR.                                */00000150
 /*  DATA SOM OVERFØRES ER OO_SØKER OG OO_SPES - MEN IKKE OO_BARN     */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
 /*PROGRAMTILKNYTTING:                                                */00000190
 /* ********************                                              */00000200
 /*  PROGRAMMET INCLUDES AV R001IA01 - KONTROLL_GRUNNBLANKETT_OO      */00000210
 /*  ALLE CICS-KOMMANDOS LIGGER I HOVEDPROG.                          */00000220
 /*  ARBEIDSOMRÅDET - P001IA01 - ER INCLUDET I HOVEDPROG.             */00000230
 /*  DE INTERNE PROSEDYRER ER :                                       */00000240
 /*    BLANK_OO_MAP:      BLANKER MAPEN                               */00000250
 /*    OVERFØR_OO_SØKER:  OVERFØRER OODELEN MAP->ARBEIDSOMRÅDE        */00000260
 /*    OVERFØR_OO_SPES:   OVERFØRER SPESIELL DEL MAP->ARBEIDSOMRÅDE   */00000270
 /*                                                                   */00000280
 /* ***************************************************************** */00000290
 %PAGE;                                                                 00000300
                                                                        00000310
   BLANK_OO_MAP:                                                        00000320
   PROC;                                                                00000330
   DCL                                                                  00000340
      LOW BUILTIN;                                                      00000350
        S001IA1O.FRA_FNRO   = 0;                                        00000360
        S001IA1O.TIL_FNRO   = 0;                                        00000370
        S001IA1O.START_ÅRO   = 0;                                       00000380
        S001IA1O.BARN_ANTTALO = 0;                                      00000390
        DO K = 1 TO 12;                                                 00000400
           S001IA1O.FNR_BARNO(K) =  LOW(11);                            00000410
   /*                                                                   00000420
        S001IA1O.FRA_ÅRO (K)   = LOW(2);                                00000430
        S001IA1O.TYPEO (K) = ' ';                                       00000440
        S001IA1O.INNTEKTO (K) = LOW(9);                                 00000450
   */                                                                   00000460
        END;                                                            00000470
                                                                        00000480
        S001IA1O.MELDING1O = (78)' ';                                   00000490
        S001IA1O.MELDING2O = (78)' ';                                   00000500
        S001IA1O.MELDING3O = (78)' ';                                   00000510
        S001IA1O.MELDING4O = (78)' ';                                   00000520
        S001IA1O.MELDING5O = (78)' ';                                   00000530
        S001IA1O.MELDING6O = (78)' ';                                   00000540
                                                                        00000550
   END BLANK_OO_MAP;                                                    00000560
                                                                        00000570
                                                                        00000580
                                                                        00000590
                                                                        00000600
 %PAGE;                                /*   */                          00000610
 /* ***************************************************************** */00000620
 /*                                                                   */00000630
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000640
 /*   EVENTUELT ENDRET PÅ SKJERMBILDET TIL OO_TRANS_OMR I             */00000650
 /*   KOM_OMR FOR OO_SØKER.                                           */00000660
 /*           MAPSET:  S001UE3   MAP S001IA1                          */00000670
 /*                                                                   */00000680
 /* ***************************************************************** */00000690
 %SKIP;                                                                 00000700
   OVERFØR_OO_SØKER:                                                    00000710
   PROC;                                                                00000720
   DCL LI    FIXED DEC (2);                                             00000730
                                                                        00000740
        IF S001IA1I.FRA_FNRL > 0 THEN                                   00000750
           OOS.FRA_FNR = S001IA1I.FRA_FNRI;                             00000760
                                                                        00000770
        IF S001IA1I.TIL_FNRL > 0 THEN                                   00000780
           OOS.TIL_FNR = S001IA1I.TIL_FNRI;                             00000790
                                                                        00000800
        IF S001IA1I.START_ÅRL > 0 THEN                                  00000810
           OOS.START_ÅR = KONV_ÅR_HÅ(S001IA1I.START_ÅRI);               00000820
                                                                        00000830
        IF S001IA1I.BARN_ANTTALL > 0 THEN                               00000840
           OOS.BARN_ANTTAL  = S001IA1I.BARN_ANTTALI;                    00000850
                                                                        00000860
        DO K = 1 TO 12;                                                 00000870
                                                                        00000880
           IF S001IA1I.FNR_BARNL(K) > 0 THEN                            00000890
              DO;                                                       00000900
                  OOB.FNR_BARN(K) = S001IA1I.FNR_BARNI(K);              00000910
              END;                                                      00000920
        END;                                                            00000930
                                                                        00000940
                                                                        00000950
   END OVERFØR_OO_SØKER;                                                00000960
 %PAGE;                                /*   */                          00000970
 /* ***************************************************************** */00000980
