 /*       SIST ENDRET 12/01-98 14.41.56 AV   SPA7339                  */00000000
        /*  SIST ENDRET 26/5/82  13.05.00 AV HELEN  */                  00000010
        /* ******************************** */                          00000020
        /* IDENTIFIKASJON:                  */                          00000030
        /*      R0019934                    */                          00000040
        /* PROGRAMMERER:                    */                          00000050
        /*      FARVIK/HANSEN OKT -82.      */                          00000060
        /* HENSIKT:                         */                          00000070
        /*     SLETTER KOBLINGER MELLOM     */                          00000080
        /* TO PERSONER.                     */                          00000090
        /* BRUK:                            */                          00000100
        /*     OPPHØR_KOBLING_TO_PERSONER   */                          00000110
        /*            (INDEKS1,INDEKS2)     */                          00000120
        /* ******************************** */                          00000130
 OPPHØR_KOBLING_TO_PERSONER:                                            00000140
 PROC(IND1,IND2);                                                       00000150
 DCL    (I , J )          FIXED BIN(15);                                00000160
 DCL    (IND1,IND2)       FIXED BIN(15);                                00000170
                                                                        00000180
      DO I = 1 TO 13 WHILE (B02.TILKN.FNR_TILKN(IND1,I) > 0);           00000190
         IF B02.FNR_TILKN(IND1,I) = B02.FNR(IND2) THEN                  00000200
            DO;                                                         00000210
                                                                        00000220
                                                                        00000230
               DO J = I TO 12 WHILE (                                   00000240
                                   B02.FNR_TILKN(IND1,J+1) > 0);        00000250
                  B02.TILKN.TILKNYTNINGSKODE(IND1,J) =                  00000260
                      B02.TILKN.TILKNYTNINGSKODE(IND1,J+1);             00000270
                  B02.FT_FØR_91(IND1,J) = B02.FT_FØR_91(IND1,J+1);      00000280
                                                                        00000290
                  B02.FNR_TILKN(IND1,J) =                               00000300
                                         B02.FNR_TILKN(IND1,J+1);       00000310
                  B02.TILKN.TILKNYTNINGSKODE(IND1,J+1) = ' ';           00000320
                  B02.FNR_TILKN(IND1,J+1)              = 0;             00000330
               END;                                                     00000340
               IF I = J THEN                                            00000350
                  DO;                                                   00000360
                     B02.TILKN.TILKNYTNINGSKODE(IND1,J) = ' ';          00000370
                     B02.FT_FØR_91(IND1,J)              = ' ';          00000380
                     B02.FNR_TILKN(IND1,J)              = 0;            00000390
                  END;                                                  00000400
               I = 13;                                                  00000410
            END;                                                        00000420
      END;                                                              00000430
                                                                        00000440
      DO I = 1 TO 13 WHILE (B02.TILKN.FNR_TILKN(IND2,I) > 0);           00000450
         IF B02.FNR_TILKN(IND2,I) = B02.FNR(IND1) THEN                  00000460
            DO;                                                         00000470
                                                                        00000480
                                                                        00000490
               DO J = I TO 12 WHILE (                                   00000500
                                   B02.FNR_TILKN(IND2,J+1) > 0);        00000510
                  B02.TILKN.TILKNYTNINGSKODE(IND2,J) =                  00000520
                      B02.TILKN.TILKNYTNINGSKODE(IND2,J+1);             00000530
                  B02.FT_FØR_91(IND2,J) = B02.FT_FØR_91(IND2,J+1);      00000540
                  B02.FNR_TILKN(IND2,J) =                               00000550
                                         B02.FNR_TILKN(IND2,J+1);       00000560
                  B02.TILKN.TILKNYTNINGSKODE(IND2,J+1) = ' ';           00000570
                  B02.FNR_TILKN(IND2,J+1)              = 0;             00000580
               END;                                                     00000590
               IF I = J THEN                                            00000600
                  DO;                                                   00000610
                     B02.TILKN.TILKNYTNINGSKODE(IND2,J) = ' ';          00000620
                     B02.FT_FØR_91(IND2,J)              = ' ';          00000630
                     B02.FNR_TILKN(IND2,J)              = 0;            00000640
                  END;                                                  00000650
               I = 13;                                                  00000660
            END;                                                        00000670
      END;                                                              00000680
 END OPPHØR_KOBLING_TO_PERSONER;                                        00000690
                                                                        00000700
