 /*       SIST ENDRET 08/05-91 13.22.48 AV   DYBVIK                   */00000000
 /*IDENTIFIKASJON:                                                    */00000010
 /*    PROGRAM-IDENT : R001TK13 - UNDERPROGRAM                        */00000020
 /*    PROGRAMMERER  : TUYEN                                          */00000030
 /*    PROGRAM LAGET : JAN 91                                         */00000040
 /*********************************************************************/00000050
 /*HENSIKT:                                                           */00000060
 /*    - OVERFØRE DATA FRA TRANS_OMR TIL                              */00000070
 /*            SKJERMBILDE (MAP S001016 MAPSET S001TK3).              */00000080
 /*********************************************************************/00000090
 /*BRUK:                                                              */00000100
 /*    - CALL OVERFØR_TK_MAP                                          */00000110
 /*      FRA  R001TK06                                                */00000120
 /* ***************************************************************** */00000130
 %SKIP(2);                                                              00000140
 OVERFØR_TK_MAP: PROC;                                                  00000150
   DCL                                                                  00000160
      NORMAL  CHAR (1) INIT(' '),                                       00000170
      NOR_NUM CHAR (1) INIT('&'),                                       00000180
      BRI_NUM CHAR (1) INIT('Q');                                       00000190
                                                                        00000200
      S001016O.TKNRO          = TK.TKNR;                                00000210
      S001016O.TKNAVNO        = TK.TKNAVN;                              00000220
                                                                        00000230
      IF TKK.POST_KONTO ^= 0 THEN                                       00000240
         S001016O.POST_KONTOO    = TKK.POST_KONTO;                      00000250
      ELSE                                                              00000260
         S001016O.POST_KONTOO    = LOW(11);                             00000270
                                                                        00000280
      IF TKK.POST_KUNDENR ^= 0 THEN                                     00000290
         S001016O.POST_KUNDENRO  = TKK.POST_KUNDENR;                    00000300
      ELSE                                                              00000310
         S001016O.POST_KUNDENRO  = LOW(9);                              00000320
                                                                        00000330
      IF TKK.PKONTO_ENDRET ^= 0 THEN                                    00000340
         S001016O.PKONTO_ENDRETO = TKK.PKONTO_ENDRET;                   00000350
      ELSE                                                              00000360
         S001016O.PKONTO_ENDRETO = LOW(6);                              00000370
                                                                        00000380
      IF TKK.INTERIM_KONTO ^= 0 THEN                                    00000390
         S001016O.INTERIM_KONTOO = TKK.INTERIM_KONTO;                   00000400
      ELSE                                                              00000410
         S001016O.INTERIM_KONTOO = LOW(11);                             00000420
                                                                        00000430
      IF TKK.INTERIM_AVTALEID ^= 0 THEN                                 00000440
         S001016O.INTERIM_AVTIDO = TKK.INTERIM_AVTALEID;                00000450
      ELSE                                                              00000460
         S001016O.INTERIM_AVTIDO = LOW(9);                              00000470
                                                                        00000480
      IF TKK.INTERIM_ENDRET ^= 0 THEN                                   00000490
         S001016O.INTERIM_ENDRETO = TKK.INTERIM_ENDRET;                 00000500
      ELSE                                                              00000510
         S001016O.INTERIM_ENDRETO = LOW(6);                             00000520
                                                                        00000530
      IF TKK.DRIFTSKONTO ^= 0 THEN                                      00000540
         S001016O.DRIFTSKONTOO   = TKK.DRIFTSKONTO;                     00000550
      ELSE                                                              00000560
         S001016O.DRIFTSKONTOO   = LOW(11);                             00000570
                                                                        00000580
      IF TKK.DRIFT_AVTALEID ^= 0 THEN                                   00000590
         S001016O.DRIFT_AVTALEIDO = TKK.DRIFT_AVTALEID;                 00000600
      ELSE                                                              00000610
         S001016O.DRIFT_AVTALEIDO = LOW(9);                             00000620
                                                                        00000630
      IF TKK.DKONTO_ENDRET ^= 0 THEN                                    00000640
         S001016O.DKONTO_ENDRETO = TKK.DKONTO_ENDRET;                   00000650
      ELSE                                                              00000660
         S001016O.DKONTO_ENDRETO = LOW(6);                              00000670
                                                                        00000680
                                                                        00000690
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00000700
                                                                        00000710
      IF TKK.POST_KONTONR = 0 THEN                                      00000720
         S001016O.POST_KONTOA = NOR_NUM;                                00000730
      ELSE                                                              00000740
         DO;                                                            00000750
            S001016O.POST_KONTOA = BRI_NUM;                             00000760
            S001016I.POST_KONTOL = CURSOR_POS;                          00000770
                                                                        00000780
            CALL SKRIV_FEIL(TKK.POST_KONTONR);                          00000790
         END;                                                           00000800
                                                                        00000810
                                                                        00000820
      IF TKK.POST_KUNDENRNR = 0 THEN                                    00000830
         S001016O.POST_KUNDENRA = NOR_NUM;                              00000840
      ELSE                                                              00000850
         DO;                                                            00000860
            S001016O.POST_KUNDENRA = BRI_NUM;                           00000870
            S001016I.POST_KUNDENRL = CURSOR_POS;                        00000880
                                                                        00000890
            CALL SKRIV_FEIL(TKK.POST_KUNDENRNR);                        00000900
         END;                                                           00000910
                                                                        00000920
                                                                        00000930
      IF TKK.INTERIM_KONTONR = 0 THEN                                   00000940
         S001016O.INTERIM_KONTOA = NOR_NUM;                             00000950
      ELSE                                                              00000960
         DO;                                                            00000970
            S001016O.INTERIM_KONTOA = BRI_NUM;                          00000980
            S001016I.INTERIM_KONTOL = CURSOR_POS;                       00000990
                                                                        00001000
            CALL SKRIV_FEIL(TKK.INTERIM_KONTONR);                       00001010
         END;                                                           00001020
                                                                        00001030
                                                                        00001040
      IF TKK.INTERIM_AVTALEIDNR = 0 THEN                                00001050
         S001016O.INTERIM_AVTIDA = NOR_NUM;                             00001060
      ELSE                                                              00001070
         DO;                                                            00001080
            S001016O.INTERIM_AVTIDA = BRI_NUM;                          00001090
            S001016I.INTERIM_AVTIDL = CURSOR_POS;                       00001100
                                                                        00001110
            CALL SKRIV_FEIL(TKK.INTERIM_AVTALEIDNR);                    00001120
         END;                                                           00001130
                                                                        00001140
                                                                        00001150
      IF TKK.DRIFTSKONTONR = 0 THEN                                     00001160
         S001016O.DRIFTSKONTOA = NOR_NUM;                               00001170
      ELSE                                                              00001180
         DO;                                                            00001190
            S001016O.DRIFTSKONTOA = BRI_NUM;                            00001200
            S001016I.DRIFTSKONTOL = CURSOR_POS;                         00001210
                                                                        00001220
            CALL SKRIV_FEIL(TKK.DRIFTSKONTONR);                         00001230
         END;                                                           00001240
                                                                        00001250
                                                                        00001260
      IF TKK.DRIFT_AVTALEIDNR = 0 THEN                                  00001270
         S001016O.DRIFT_AVTALEIDA = NOR_NUM;                            00001280
      ELSE                                                              00001290
         DO;                                                            00001300
            S001016O.DRIFT_AVTALEIDA = BRI_NUM;                         00001310
            S001016I.DRIFT_AVTALEIDL = CURSOR_POS;                      00001320
                                                                        00001330
            CALL SKRIV_FEIL(TKK.DRIFT_AVTALEIDNR);                      00001340
         END;                                                           00001350
 END OVERFØR_TK_MAP;                                                    00001360
