 /*   SIST ENDRET PÅ PROD   2000.07.07 13.00.03 AV   JDA7339          */        
 /*       SIST ENDRET 04/05-98 12.40.30 AV   JDA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014015 - PROSEDYRE I PLI.                                    */        
 /*    PROGRAMMERER: TRUDE NOV 94 VARIASJON AV R0014139               */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN OPPDATERER TP_NETTO,GP_NETTO,SÆRTILLEGG                */        
 /*                                                                   */        
 /*    HERETTER ER ALDERSP.AP_GP_NETTO /-TP-/-ST- NETTO -BELØPENE     */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR INKLUDERT I R0014001,CALL FRA R0014010         */        
 /*BRUK:                                                              */        
 /*    CALL JUSTER_MED_FORVENTET                                      */        
 /* ***************************************************************** */        
                                                                                
 JUSTER_MED_FORVENTET: PROC(W_KT,INDEX);                                        
                                                                                
    DCL                                                                         
       W_KT          DEC FIXED(3),                                              
       INDEX         FIXED BIN(15);                                             
    DCL                                                                         
       I             FIXED BIN(15),                                             
       EP_SUM_YTELSE DEC FIXED(7) INIT (0),                                     
       FRADRAG_F     DEC FIXED(7) INIT (0),                                     
       G_HALVE       DEC FIXED(7) INIT (0),                                     
       HJ_AP         DEC FIXED(7) INIT (0),                                     
       REST_FRADRAG  DEC FIXED(5)  INIT (0),                                    
       TREDEC        DEC FIXED(3) INIT (0),                                     
       W_BRUTTO_AP   DEC FIXED(7) INIT (0),                                     
       W_BRUTTO_GP   DEC FIXED(5) INIT (0),                                     
       W_BRUTTO_TP   DEC FIXED(5) INIT (0),                                     
       W_BRUTTO_TP_EP DEC FIXED(7) INIT (0),                                    
       W_BRUTTO_ST   DEC FIXED(5) INIT (0),                                     
       W_BRUTTO_GT   DEC FIXED(7) INIT (0),                                     
       W_SUM_TP      DEC FIXED(7) INIT (0),                                     
       W_YP_AP       DEC FIXED(7) INIT (0),                                     
       W_YP          DEC FIXED(7) INIT (0),                                     
       W_NETTO_AP    DEC FIXED(7) INIT (0),                                     
       W_FULL_KT     DEC FIXED(5,2) INIT (0),                                   
       W_TEI         DEC FIXED(7)  INIT (0),                                    
       W_TAI         DEC FIXED(7)  INIT (0),                                    
       W_BRP         DEC FIXED(7,2) INIT (0),                                   
       W_TAK         DEC FIXED(7)  INIT (0),                                    
       W_APD_ANVENDT DEC FIXED(3)  INIT (0),                                    
       W_KT_FRADRAG  DEC FIXED(3)  INIT (0),                                    
       W_ST_FRADRAG  DEC FIXED(5)  INIT (0),                                    
       W_GP_FRADRAG  DEC FIXED(5)  INIT (0),                                    
       W_ALDER_ÅM    PIC '9999',                                                
       W_ETTER92     DEC FIXED(7)  INIT (0);                                    
                                                                                
    DCL KODE         CHAR (1) INIT (' ');                                       
    DCL HJ_FAI       FIXED DEC (7);                                             
    DCL W_FNR        PIC  '(11)9';             /*2000*/                         
                                                                                
    DCL ROUND        BUILTIN;                                                   
   W_FNR  = B02.FNR(INDEX);                                                     
                                                                                
   IF (DIV_PARAM_OMR.AP_KODE_AEY(INDEX) ^= 'W' !                                
       DIV_PARAM_OMR.AP_KODE_AEY(INDEX) ^= 'P' ) THEN                           
      DIV_PARAM_OMR.AP_KODE_AEY(INDEX) = 'A';                                   
                                                                                
   W_ALDER_ÅM = F_ALDER((W_FNR),(TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD));            
                                                                                
   IF W_ALDER_ÅM  > 7000  THEN                                                  
     DO;                                                                        
       B02.ALDERSP.FAI(INDEX)             = 0;                                  
       B02.ETTEPENS.FORVENTET(INDEX)       = 0;                                 
     END;                                                                       
                                                                                
   /* VED ETTERLATT ER ALDERSP.TP ER ALEREDE OPPDATERT MED */                   
   /* EGEN YP . TRUDE 0492                                       */             
                                                                                
   IF B02.KONV_P_KODE(INDEX)        = 'Y'  &                                    
      B02.PENSJONSTYPE2(INDEX) ^=        'E'   THEN   /*TS0492*/                
     DO;                                                                        
      B02.ALDERSP.APD(INDEX)       = 100;                                       
     END;                                                                       
                                                                                
                                                                                
   /* GP OG TP BRUTTO ER UTREGNET TIDLIGERE   */                                
                                                                                
 /*   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(INDEX) = 0;   */                           
   W_BRUTTO_ST = DIV_PARAM_OMR.FULLT_SÆRTILLEGG(INDEX); /*HL*/                  
   B02.ALDERSP.ST(INDEX) = W_BRUTTO_ST;                 /*HL*/                  
   W_BRUTTO_GP  = B02.ALDERSP.GP(INDEX);                                        
   W_BRUTTO_TP  = B02.ALDERSP.TP(INDEX);                                        
 /*   W_BRUTTO_ST  = B02.ALDERSP.ST(INDEX); */                                  
   W_BRUTTO_TP_EP = B02.TP_BRUTTO(INDEX);                                       
   W_ETTER92    = W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;                   
                                                                                
   IF B02.GT_LOV92(INDEX)       > W_ETTER92        THEN                         
      W_BRUTTO_GT = B02.GT_LOV92(INDEX) - W_ETTER92;                            
                                                                                
   W_BRUTTO_AP       = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST                  
                       + B02.TP_BRUTTO(INDEX) + W_KT                            
                       + W_BRUTTO_GT;                                           
                                                                                
   W_SUM_TP          = W_BRUTTO_TP                                              
                       + B02.TP_BRUTTO(INDEX);                                  
                                                                                
                                                                                
   W_TEI      = DIV_PARAM_OMR.TAI(INDEX);      /*980529*/                       
                                                                                
   /*TIDLIGERE LAV ARBEIDSINNTEKT:  GJENNOMSNITT SKAL IKKE < 3 G */             
   /*FORHØYES OPP TIL NÆRMESTE HELE TUSEN                        */             
   /*AFP FOM 0197 SKAL IKKE DENNE REGEL GJELDE                   */             
                                                                                
    IF (B02.PENSJONSTYPE1(BER_SØ_IND)   = 'K' &                                 
        B02.UTTAKSDATO_ÅMD(BER_SØ_IND)   > 19970900 ) !    /*2000*/             
       (B02.KONV_P_KODE  (BER_SØ_IND)   = 'K' &                                 
        B02.UTTAKSDATO_ÅMD(BER_SØ_IND)   > 19970900) THEN ;   /*2000*/          
    ELSE                                                                        
     DO;                                                                        
    IF W_TEI < ( 3 * G )   THEN                                                 
      DO;                                                                       
       W_TEI   = 3 * G + 999;  /* ENDRET FRA 500 TIL 999, 5.7.94 TS*/           
       TREDEC  = W_TEI / 1000;                                                  
       W_TEI   = TREDEC * 1000;                                                 
       DIV_PARAM_OMR.TAI(INDEX) = W_TEI; /*TRUDE 020993*/                       
      END;                                                                      
     END;                                                                       
                                                                                
    IF B02.FAI(INDEX) = 0         THEN                                          
      IF B02.KONV_P_KODE(INDEX)        = 'E'  THEN                              
         B02.FAI(INDEX) = B01.FORVENTET(INDEX);                                 
         /* HIT 180992 */                                                       
                                                                                
    G_HALVE   = G / 2;                                                          
    W_FULL_KT = W_KT;                                                           
    HJ_FAI  = B02.FAI(INDEX) * 100;                                             
                                                                                
 IF HJ_FAI  > G THEN                                                            
   DO;                                                                          
    FRADRAG_F = (B02.FAI(INDEX) * 100);                                         
    FRADRAG_F = FRADRAG_F - G;                                                  
                                                                                
    IF FRADRAG_F > 0 THEN                                                       
       FRADRAG_F = ( FRADRAG_F * 0.5 ) / 12;                                    
                                                                                
   IF FRADRAG_F > W_BRUTTO_AP THEN                                              
       DO;                                                                      
        IF B02.KONV_P_KODE(INDEX)       = 'E' !                                 
           B02.PENSJONSTYPE2(INDEX)       = 'E' THEN GOTO L999;                 
                                                                                
      /*   B02.ALDERSP.GP         (INDEX)         = 0;  */                      
           B02.ALDERSP.AP_GP_NETTO(INDEX)         = 0;                          
     /*    B02.ALDERSP.TP         (INDEX)         = 0;   */                     
           B02.ALDERSP.AP_TP_NETTO(INDEX)         = 0;                          
           B02.TP_NETTO           (INDEX)         = 0;                          
           B02.ALDERSP.ST         (INDEX)         = 0;                          
           B02.ALDERSP.KT         (INDEX)         = 0;                          
           W_KT                                   = 0;                          
       END;                                                                     
                                                                                
   ELSE                                                                         
       DO;                                                                      
                                                                                
 /* ***************************************************************** */        
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */        
 /* ***************************************************************** */        
                                                                                
          DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'A';                        
                                                                                
          W_NETTO_AP    = W_BRUTTO_AP - FRADRAG_F;                              
                                                                                
          /*-----------------------------------------------------*/             
          /*SUMMEN AV PENSJON OG FREMTIDIG ARBEIDSINNTEKT KAN    */             
          /*IKKE UTGJØRE MER ENN TIDLIGERER ARBEIDSINNTEKT.      */             
          /*-----------------------------------------------------*/             
                                                                                
          W_TAK =   W_TEI -  (B02.FAI(INDEX) * 100);                            
          IF W_TAK   > 0  THEN                                                  
             W_TAK   = W_TAK / 12;                                              
                                                                                
          IF W_TAK   > 0           &                                            
             W_TAK   < W_NETTO_AP  THEN                                         
            DO;                                                                 
             DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'B';                     
             W_NETTO_AP   =  W_TAK;                                             
             FRADRAG_F    = W_BRUTTO_AP - W_NETTO_AP;                           
            END;                                                                
          ELSE                                                                  
            IF W_TAK <=  0  THEN   /*TS0492*/                                   
              DO;                                                               
               IF B02.KONV_P_KODE(INDEX)       = 'E' THEN GOTO L999;            
                                                                                
          /*     B02.ALDERSP.GP (INDEX)         = 0;       ***0492 TS*/         
                 B02.ALDERSP.AP_GP_NETTO(INDEX)         = 0;  /*0492TS*/        
         /*      B02.ALDERSP.TP (INDEX)         = 0;     **** 0492 TS*/         
                 B02.ALDERSP.AP_TP_NETTO(INDEX)         = 0;  /*0492TS*/        
                 B02.TP_NETTO   (INDEX)         = 0;                            
                 B02.ALDERSP.ST (INDEX)         = 0;                            
                 B02.ALDERSP.KT (INDEX)         = 0;                            
                 GOTO L500;    /*ENDRET FRA L999 TIL L500 220293 TS */          
              END;                                                              
                                                                                
                                                                                
          IF W_YP > W_NETTO_AP   THEN                                           
            DO;                                                                 
               W_NETTO_AP   =  W_YP;                                            
               FRADRAG_F    =  W_BRUTTO_AP - (W_NETTO_AP + W_KT);               
               DIV_PARAM_OMR.AP_KODE_AEY(INDEX)        =  'Y';                  
               IF FRADRAG_F  <=  0 THEN              /*TS < 0  050593*/         
                              /*STM NEDENFOR LAGT INN 060593, TRUDE */          
                  DO;                                                           
        B02.AP_GP_NETTO(INDEX)        = B02.ALDERSP.GP(INDEX);                  
        B02.AP_TP_NETTO(INDEX)        = B02.ALDERSP.TP(INDEX);                  
        B02.TP_NETTO(INDEX)           = B02.TP_BRUTTO (INDEX);                  
        B02.ALDERSP.ST(INDEX)         = B02.ALDERSP.ST(INDEX);                  
        B02.ALDERSP.KT(INDEX)         = W_KT;                                   
        GOTO L500;  /*TS  050593*/                                              
                  END;   /*FRADRAG <= 0 */                                      
            END;                                                                
                                                                                
                                                                                
          B02.AP_GP_NETTO(INDEX) = ROUND(W_BRUTTO_GP *                          
                                      W_NETTO_AP / W_BRUTTO_AP , 0);            
                                                                                
          REST_FRADRAG = FRADRAG_F - W_BRUTTO_GP                                
                                   + B02.AP_GP_NETTO(INDEX);                    
          IF B02.TP_BRUTTO(INDEX) > 0 THEN                                      
            DO;                                                                 
             DCL TRUDE_TP  FIXED DEC (5);                                       
               B02.TP_NETTO(INDEX) =                                            
                                   ROUND(B02.TP_BRUTTO(INDEX)                   
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);            
               TRUDE_TP  = B02.TP_NETTO(INDEX);                                 
               REST_FRADRAG =  REST_FRADRAG -                                   
                               B02.TP_BRUTTO(INDEX) +                           
                               B02.TP_NETTO(INDEX);                             
            END;                                                                
                                                                                
          IF W_BRUTTO_GT   > 0 THEN                                             
            DO;                                                                 
             B02.GT_TILLEGG_LOV92(INDEX)       =                                
                              ROUND(W_BRUTTO_GT                                 
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);            
              REST_FRADRAG =  REST_FRADRAG -                                    
                               W_BRUTTO_GT +                                    
                               B02.GT_TILLEGG_LOV92(INDEX);                     
            END;                                                                
          ELSE                                                                  
            DO;                                                                 
             B02.GT_TILLEGG_LOV92(INDEX)       = 0;                             
            END;                                                                
                      /*ENDRET REKKEFØLGEN PÅ STM. PGA KT  */                   
          IF W_BRUTTO_TP > 0 THEN                                               
            DO;                                                                 
              IF G > 35500    THEN                                              
                DO;                                                             
                 IF B02.ALDERSP.ST(INDEX)       =  0 THEN                       
                    B02.AP_TP_NETTO(INDEX) =                                    
                             B02.ALDERSP.TP(INDEX) - REST_FRADRAG;              
                 ELSE                                                           
                  DO;                                                           
                   B02.AP_TP_NETTO(INDEX) = ROUND(W_BRUTTO_TP *                 
                                  W_NETTO_AP / W_BRUTTO_AP , 0);                
                   REST_FRADRAG =  REST_FRADRAG -                               
                                   W_BRUTTO_TP +                                
                                   B02.AP_TP_NETTO(INDEX);                      
                  END;                                                          
                END;                                                            
              ELSE                                                              
                 DO;                                                            
                   B02.AP_TP_NETTO(INDEX) = ROUND(W_BRUTTO_TP *                 
                                  W_NETTO_AP / W_BRUTTO_AP , 0);                
                   REST_FRADRAG =  REST_FRADRAG -                               
                                   W_BRUTTO_TP +                                
                                   B02.AP_TP_NETTO(INDEX);                      
                 END;                                                           
            END;                                                                
                                                                                
          IF B02.ALDERSP.ST(INDEX)        > 0 THEN                              
            DO;                                                                 
             IF W_KT  = 0 THEN                                                  
               DO;                                                              
                 DCL SÆRT   PIC'9999';                                          
                 DCL SÆRT2  PIC'9999';                                          
                 SÆRT  =   B02.ALDERSP.ST(INDEX);                               
                 B02.ALDERSP.ST(INDEX)       =                                  
                           B02.ALDERSP.ST(INDEX) - REST_FRADRAG;                
                 SÆRT2 =   B02.ALDERSP.ST(INDEX);                               
               END;                                                             
             ELSE                                                               
                DO;                                                             
                   B02.ALDERSP.ST(INDEX) =                                      
                              ROUND(B02.ALDERSP.ST(INDEX)                       
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);            
                    REST_FRADRAG =  REST_FRADRAG -                              
                                    W_BRUTTO_ST +                               
                                    B02.ALDERSP.ST(INDEX);                      
                END;                                                            
            END;                                                                
                                                                                
          IF W_KT > 0 THEN                                                      
            DO;                                                                 
                                                                                
             IF W_KT >= REST_FRADRAG THEN                                       
                W_KT = W_KT - REST_FRADRAG;                                     
             ELSE                                                               
                W_KT  = 0;                                                      
                                                                                
             B02.ALDERSP.KT(INDEX) = W_KT;                                      
            END;                                                                
                                                                                
     END;                                                                       
                                                                                
    IF B02.AP_GP_NETTO(INDEX) +                                                 
       B02.AP_TP_NETTO(INDEX) < 10 THEN                                         
                                                                                
       DO;                                                                      
      /*  B02.ALDERSP.GP(INDEX)             = 0;  */                            
          B02.AP_GP_NETTO(INDEX)            = 0;                                
     /*   B02.ALDERSP.TP(INDEX)             = 0; */                             
          B02.AP_TP_NETTO(INDEX)            = 0;                                
          B02.ALDERSP.ST(INDEX)             = 0;                                
          B02.ALDERSP.KT(INDEX)             = 0;                                
          B02.GT_LOV92  (INDEX)             = 0;                                
                                                                                
          B02.GARANTITILLEGG_EK(INDEX)                = 0;                      
          B02.GARANTITILLEGG_BARN(INDEX)              = 0;                      
          B02.BT_SÆRBARN(INDEX)                       = 0;                      
          B02.GARANTITILLEGG_SÆRBARN(INDEX)           = 0;                      
          B02.FT_SKAL_BEREGNES(INDEX)                 = 'D';                    
                                                                                
       END;                                                                     
   END;                                                                         
 ELSE   /*FRADRAGET ER MINDRE ENN G */                                          
     DO;                                                                        
        B02.AP_GP_NETTO(INDEX)        = B02.ALDERSP.GP(INDEX);                  
        B02.AP_TP_NETTO(INDEX)        = B02.ALDERSP.TP(INDEX);                  
        B02.TP_NETTO(INDEX)           = B02.TP_BRUTTO (INDEX);                  
        B02.ALDERSP.ST(INDEX)         = B02.ALDERSP.ST(INDEX);                  
        B02.ALDERSP.KT(INDEX)         = W_KT;                                   
     END;                                                                       
                                                                                
 L500:                                                                          
                                                                                
  B02.ALDERSP.UTTAKS_APD(INDEX) = 000; /* 999 ØNSKE FRA NORTYGD */              
  B02.ALDERSP.APD(INDEX) = 000;             /*  "  ØNSKE FRA NORTYGD */         
                                                                                
  /*TRUDE 210292:  */                                                           
  IF B02.ALDERSP.UTTAKSDATO_ÅMD(INDEX) = 0        THEN  /*2000*/                
     B02.ALDERSP.UTTAKSDATO_ÅMD(INDEX) =                 /*2000*/               
                            B02.VIRK_DATO_ÅMD(INDEX);                           
                                                                                
  /* ALLE NYE AFP PENSJONISTER SKAL HA KODE 'N' */                              
                                                                                
    IF (B02.PENSJONSTYPE1(BER_SØ_IND) = 'K'        !                            
        B02.KONV_P_KODE(BER_SØ_IND)   = 'K'        ) &                          
       (B02.UTTAKSDATO_ÅMD(BER_SØ_IND) <= 20000800 &                            
        B02.UTTAKSDATO_ÅMD(BER_SØ_IND)  > 19970900 ) THEN                       
       DIV_PARAM_OMR.AP_KODE_AEY(INDEX) = 'N';     /**TS*/                      
                                                                                
  L999:                                                                         
                                                                                
 END JUSTER_MED_FORVENTET;                                                      
