 /*   SIST ENDRET PÅ PROD   2004.12.17 14.33.49 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.48.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.15.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.03.22  9.40.48 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.14 12.35.19 AV   JDA7339          */        
 /*       SIST ENDRET 07/07-99 12.29.40 AV   JDA7339                  */        
 /*       SIST ENDRET 19/02-99 12.31.19 AV   JDA7339                  */        
 /*       SIST ENDRET 08/01-99 14.25.44 AV   JDA7339                  */        
 /*       SIST ENDRET 08/09-98 13.05.44 AV   JDA7339                  */        
 /*       SIST ENDRET 12/10-95 14.01.55 AV   JDA0310                  */        
 /* ***************************************************************** */        
 /*                R 0 0 1 U 8 0 9                                    */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001U809 - SUBPROGRAM - FLYTTER EE         FRA   */        
 /*                                          MAP TIL ARBEIDSOMRÅDE    */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : SATISH                                           */        
 /*  PROGRAMMET BLE LAGET :     1294                                  */        
 /*                                                                   */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  OVERFØRER DATA FRA SKJERMBILDE                                   */        
 /*  - MAP S001U81 - TIL EE_TRANS_OMR.                                */        
 /*  DATA SOM OVERFØRES ER EE_SØKER OG EE_SPES -                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  PROGRAMMET INCLUDES AV R001U801 - KONTROLL_GRUNNBLANKETT_EE      */        
 /*  ALLE CICS-KOMMANDOS LIGGER I HOVEDPROG.                          */        
 /*  ARBEIDSOMRÅDET - P001U801 - ER INCLUDET I HOVEDPROG.             */        
 /*  PROGRAMMET BRUKER FUNKSJONEN :                                   */        
 /*    R0019912 - F_FELT_PIC_CHARNN    (INCLUDET I HOVEDPROG).        */        
 /*             - F_FELT_CHAR_PICNN             ""                    */        
 /*  DE INTERNE PROSEDYRER ER :                                       */        
 /*    BLANK_EE_MAP:          BLANKER MAPEN (1 & 2)                   */        
 /*    BLANK_EE_SP_MAP_SØKER: BLANKER MAPEN (3)                       */        
 /*    BLANK_EE_SP_MAP_AVDØD: BLANKER MAPEN (4)                       */        
 /*    BLANK_EE_SP_MAP_EØS:   BLANKER MAPEN (6)                       */        
 /*    BLANK_EE_YP_MAP:       BLANKER YRKESSKADEDELEN                 */        
 /*    OVERFØR_EE_SØKER:      OVERFØRER EE MAP   -> ARB.OMR.(1 & 2)   */        
 /*    OVERFØR_EE_SP_SØKER:   OVERFØRER EESP MAP -> ARB.OMR.(3)       */        
 /*    OVERFØR_EE_SP_AVDØD:   OVERFØRER EESP MAP -> ARB.OMR.(4)       */        
 /*    OVERFØR_EE_SP_EØS:     OVERFØRER EESP MAP -> ARB.OMR.(6)       */        
 /*    OVERFØR_EE_YP:         OVERFØRER YRKESSKADEDELEN               */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*    INGEN                                                          */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*    INGEN                                                          */        
 /* ***************************************************************** */        
 BLANK_EE_SØKER_MAP: PROC;                                                      
    DCL               LOW BUILTIN;                                              
 /* S001U81O.REGDATOO                   =   0; MARTIN */                        
    S001U81O.REGDATOO                   =   LOW(06);                            
    S001U81O.TERMIDO                    =   LOW(04);                            
                                                                                
    /* ************************************************************** */        
    /* PUNKT 1 OPPLYSNINGER OM SØKEREN (GJENLEVENDE                   */        
    /* ************************************************************** */        
                                                                                
    /* 1.1                                                            */        
    S001U81O.FNRO                       =   LOW(11);                            
                                                                                
    /* 1.2                                                            */        
    S001U81O.TKNRO                      =   0;                                  
                                                                                
    /* 1.3                                                            */        
    S001U81O.NAVNO                      =   LOW(25);                            
                                                                                
    /* 1.4                                                            */        
    S001U81O.SPRÅKO                     =   LOW(01);                            
                                                                                
    /* 1.5                                                            */        
    S001U81O.SIVILSTANDO                =   LOW(01);                            
    S001U81O.RED_GP_3_2_5O              =   LOW(01);                            
    S001U81O.FRADRAG_2GO                =   LOW(01);                            
                                                                                
    /* 1.6                                                            */        
    S001U81O.NORSK_BOSATTO              =   LOW(01);                            
                                                                                
    /* 1.7                                                            */        
    S001U81O.FORVENTET_INNTO            =   0;                                  
                                                                                
    /* 1.8                                                            */        
    S001U81O.FAIO                       =   0;                                  
                                                                                
    /* 1.9                                                            */        
    S001U81O.GP_OS_KODEO                =   LOW(01);                            
                                                                                
    /* 1.10                                                           */        
    S001U81O.YSKADE_TILLEGGO            =   LOW(01);                            
                                                                                
    /* 1.11                                                           */        
    S001U81O.VIRK_DATO_MÅO              =   0;                                  
                                                                                
    /* 1.12                                                           */        
    S001U81O.FRAMLEGGSDATO_MÅO          =   0;                                  
                                                                                
    /* ************************************************************** */        
    /* PUNKT 2 OPPLYSNINGER OM AVDØDE                                 */        
    /* ************************************************************** */        
                                                                                
    /* 2.1                                                            */        
    S001U81O.FNR_EKO                    =   0;                                  
                                                                                
    /* 2.2                                                            */        
    S001U81O.NAVN_EKO                   =   LOW(25);                            
                                                                                
    /* 2.3                                                            */        
    S001U81O.SIVILSTAND_EKO             =   LOW(01);                            
                                                                                
    /* 2.4                                                            */        
    S001U81O.DØDSDATO_DMÅ_EKO           =   0;                                  
                                                                                
    /* 2.5                                                            */        
    S001U81O.NORSK_BOSATT_EKO           =   LOW(01);                            
                                                                                
    /* 2.6                                                            */        
    S001U81O.VILKÅR_3_17AO              =   LOW(01);                            
                                                                                
    /* 2.7                                                            */        
    S001U81O.PI_EKO                     =   0;                                  
                                                                                
    /* 2.8                                                            */        
    DO J = 1 TO HBOUND(S001U81O.VP_ÅR_EKO);                                     
       S001U81O.VP_ÅR_EKO(J)            =   0;                                  
    END;                                                                        
                                                                                
    S001U81O.MELDING1O                  = (78)' ';                              
    S001U81O.MELDING2O                  = (78)' ';                              
    S001U81O.MELDING3O                  = (78)' ';                              
    S001U81O.MELDING4O                  = (78)' ';                              
    S001U81O.MELDING5O                  = (78)' ';                              
    S001U81O.MELDING6O                  = (78)' ';                              
                                                                                
 END BLANK_EE_SØKER_MAP;                                                        
 /* ----------------------------------------------------------------- */        
 BLANK_EE_SP_SØKER_MAP: PROC;                                                   
    DCL LOW BUILTIN;                                                            
    /* ************************************************************** */        
    /* PUNKT 3 SPESIELLE OPPLYSNINGER OM GJENLEVENDE                  */        
    /* ************************************************************** */        
                                                                                
    /* 3.1                                                            */        
    S001U81O.STATSBORGERO               =   LOW(03);                            
                                                                                
    /* 3.2                                                            */        
    S001U81O.BOSATTO                    =   LOW(03);                            
                                                                                
    /* 3.3.1                                                          */        
    S001U81O.MEDLEMO                    =   LOW(01);                            
                                                                                
    /* 3.3.2                                                          */        
    S001U81O.TT_LIK_PÅO                 =   LOW(01);                            
                                                                                
    /* 3.3.3                                                          */        
    S001U81O.MINST_20ÅRO                =   LOW(01);                            
                                                                                
    /* 3.3.4                                                          */        
    S001U81O.KONVENSJON_LANDO           =   LOW(03);                            
                                                                                
    /* 3.3.5                                                          */        
    S001U81O.FRAVIK_BOSATT_EØSO         =   LOW(01);                            
                                                                                
    /* 3.3.6                                                          */        
    S001U81O.UNG_UFØRO                  =   LOW(01);                            
                                                                                
    /* 3.4                                                            */        
    S001U81O.FRAVIK_FLYKTO              =   LOW(01);                            
                                                                                
    /* 3.5                                                            */        
    S001U81O.TT_ENDRESO                 =   LOW(01);                            
 END BLANK_EE_SP_SØKER_MAP;                                                     
 /* ----------------------------------------------------------------- */        
 BLANK_EE_SP_AVDØD_MAP : PROC;                                                  
    DCL LOW BUILTIN;                                                            
    /* ************************************************************** */        
    /* PUNKT 4 SPESIELLE OPPLYSNINGER OM AVDØDE                       */        
    /* ************************************************************** */        
                                                                                
 /* S001U82O.REGDATOO      MARTIN       =   LOW(04); */                         
    S001U82O.REGDATOO                   =   LOW(06);                            
                                                                                
    /* 4.1                                                            */        
    S001U82O.STATSBORGERO               =   LOW(03);                            
                                                                                
    /* 4.2                                                            */        
    S001U82O.BOSATTO                    =   LOW(03);                            
                                                                                
    /* 4.3                                                            */        
    S001U82O.FRAVIK_FLYKT_EKO           =   LOW(01);                            
                                                                                
    /* 4.4                                                            */        
    S001U82O.FRAVIK_17_3_4AO            =   LOW(01);                            
    S001U82O.FRAVIK_17_3_4BO            =   LOW(01);                            
                                                                                
    /* 4.5                                                            */        
    S001U82O.OVERKOMP_UTL_EKO           =   LOW(01);                            
                                                                                
    /* 4.6                                                            */        
    S001U82O.TT_FRA_1937_ÅR_EKO         =   LOW(02);                            
    S001U82O.TT_FRA_1937_MND_EKO        =   LOW(02);                            
                                                                                
    /* 4.7                                                            */        
    S001U82O.TT_KONVENSJON_ÅR_EKO       =   LOW(02);                            
                                                                                
    S001U82O.EØS_OPPLYSNO               =   LOW(01);                            
                                                                                
    /* ************************************************************** */        
    /* PUNKT 6 SPESIELLE OPPLYSNINGER OM AVDØDE - EØS/NORDISK KONV.   */        
    /* ************************************************************** */        
                                                                                
    /* BLANKER MELDINGENE I EE-SPESIELLE OPPLYSNINGER                 */        
    S001U82O.SMELDING1O = (78)' ';                                              
    S001U82O.SMELDING2O = (78)' ';                                              
    S001U82O.SMELDING3O = (78)' ';                                              
    S001U82O.SMELDING4O = (78)' ';                                              
    S001U82O.SMELDING5O = (78)' ';                                              
    S001U82O.SMELDING6O = (78)' ';                                              
 END BLANK_EE_SP_AVDØD_MAP;                                                     
 /* ----------------------------------------------------------------- */        
 BLANK_EE_EØS_MAP:PROC;                                                         
    /* 6.1                                                            */        
    S001U83O.BEREGN_FOLKETRYGDO         =   LOW(01);                            
                                                                                
    /* 6.2                                                            */        
    S001U83O.EØS_3_17AO                 =   LOW(01);                            
                                                                                
    /* 6.3                                                            */        
    DO J = 1 TO HBOUND(S001U83O.EØS_ÅRO);                                       
       S001U83O.EØS_ÅRO(J) = LOW(04);                                           
    END;                                                                        
                                                                                
    /* 6.4                                                            */        
    DO J =1 TO HBOUND(S001U83O.ÅR_EØS_IKKE_PRO_RATAO);                          
       S001U83O.ÅR_EØS_IKKE_PRO_RATAO(J) = LOW(04);                             
    END;                                                                        
                                                                                
    /* 6.5                                                            */        
    S001U83O.TT_TEORETISK_ÅRO           =   LOW(02);                            
    S001U83O.TT_TEORETISK_MNDO          =   LOW(02);                            
                                                                                
    /* 6.6                                                            */        
    S001U83O.TT_PRORATA_ÅRO             =   LOW(02);                            
    S001U83O.TT_PRORATA_MNDO            =   LOW(02);                            
                                                                                
    /* 6.7                                                            */        
    S001U83O.PENSJON_EØSO               =   LOW(07);                            
                                                                                
    /* 6.8                                                            */        
    DO J = 1 TO HBOUND(S001U83O.ÅR_PRO_RATA2O);                                 
       S001U83O.ÅR_PRO_RATA2O(J)        =   LOW(04);                            
    END;                                                                        
                                                                                
    /* 6.9                                                            */        
    S001U83O.TT_PRORATA2_ÅRO            =   LOW(02);                            
    S001U83O.TT_PRORATA2_MNDO           =   LOW(02);                            
                                                                                
    /* 6.10                                                           */        
    S001U83O.TT_FAKTISK_NORDISK_ÅRO     =   LOW(02);                            
    S001U83O.TT_FAKTISK_NORDISK_MNDO    =   LOW(02);                            
                                                                                
    /* 6.11                                                           */        
    S001U83O.PÅ_FAKTISK_NORDISKO        =   LOW(02);                            
                                                                                
    /* 6.12                                                           */        
    S001U83O.INNT_PRØVET_EØS_PENSO      =   LOW(01);                            
                                                                                
                                                                                
    /* BLANKER MELDINGENE I EE-SPESIELLE OPPLYSNINGER                 */        
    S001U83O.EMELDING1O = (78)' ';                                              
    S001U83O.EMELDING2O = (78)' ';                                              
    S001U83O.EMELDING3O = (78)' ';                                              
    S001U83O.EMELDING4O = (78)' ';                                              
    S001U83O.EMELDING5O = (78)' ';                                              
    S001U83O.EMELDING6O = (78)' ';                                              
 END BLANK_EE_EØS_MAP;                                                          
 /* ----------------------------------------------------------------- */        
 BLANK_EE_YP_MAP: PROC;                                                         
    DCL                                                                         
       LOW BUILTIN;                                                             
    VILKÅR_1_2_2AO                      =   LOW(1);                             
    VILKÅR_1_2_2BO                      =   LOW(1);                             
    YST_MÅO                             =   LOW(4);                             
    YSYKDOMO                            =   LOW(1);                             
    YUGO                                =   LOW(3);                             
    KAP11_7_UTLØSTO                     =   LOW(1);                             
    YRKE11O                             =   LOW(1);                             
    AÅIO                                =   LOW(7);                             
    S001201O.FNR_EKO                    =   LOW(11);                            
    FNR_SAMBOERO                        =   LOW(11);                            
    FNR_Y_BARNO                         =   LOW(11);                            
    PLEIEBARNO                          =   LOW(1);                             
                                                                                
    S001201O.YMELDING1O                 = (78)' ';                              
    S001201O.YMELDING2O                 = (78)' ';                              
    S001201O.YMELDING3O                 = (78)' ';                              
    S001201O.YMELDING4O                 = (78)' ';                              
    S001201O.YMELDING5O                 = (78)' ';                              
    S001201O.YMELDING6O                 = (78)' ';                              
 END BLANK_EE_YP_MAP;                                                           
 /* ----------------------------------------------------------------- */        
 OVERFØR_EE_YP: PROC;                                                           
    IF VILKÅR_1_2_2AL > 0 THEN                                                  
       EEY.VILKÅR_1_2_2A = VILKÅR_1_2_2AI;                                      
    IF VILKÅR_1_2_2BL > 0 THEN                                                  
       EEY.VILKÅR_1_2_2B = VILKÅR_1_2_2BI;                                      
    IF YST_MÅL > 0 THEN                                                         
       EEY.YST_ÅMD                                                              
          = KONV_MÅ_HÅMD(F_FELT_CHAR_PIC4(YST_MÅI));                            
    IF YSYKDOML > 0 THEN                                                        
       EEY.YSYKDOM = YSYKDOMI;                                                  
    IF YUGL             > 0 THEN                                                
       EEY.YUG          = F_FELT_CHAR_PIC3(YUGI);                               
    IF KAP11_7_UTLØSTL > 0 THEN                                                 
       EEY.KAP_11_7_UTLØST = KAP11_7_UTLØSTI;                                   
    IF YRKE11L > 0 THEN                                                         
       EEY.YRKE11 = YRKE11I;                                                    
    IF AÅIL > 0 THEN                                                            
       EEY.AÅI          = F_FELT_CHAR_PIC7(AÅII);                               
    /* ENDRA NESTE 3 STMT TIL Å TESTE PÅ I ISTEDENFOR L */                      
    IF S001201I.FNR_EKL > 0 THEN                                                
       EEY.FNR_EK = F_FELT_CHAR_PIC11(S001201I.FNR_EKI);                        
    IF FNR_SAMBOERL > 0 THEN                                                    
       EEY.FNR_SAMBOER = F_FELT_CHAR_PIC11(FNR_SAMBOERI);                       
    IF FNR_Y_BARNL > 0 THEN                                                     
       EEY.FNR_Y_BARN = F_FELT_CHAR_PIC11(FNR_Y_BARNI);                         
    IF PLEIEBARNL > 0 THEN                                                      
       EEY.PLEIEBARN = PLEIEBARNI;                                              
 END OVERFØR_EE_YP;                                                             
 /* ----------------------------------------------------------------- */        
 OVERFØR_EE_SØKER: PROC;                                                        
                                                                                
    /* -------------------------------------------------------------- */        
    /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                 */        
    /*   EVENTUELT ENDRET PÅ SKJERMBILDET TIL EE_TRANS_OMR I          */        
    /*   KOM_OMR FOR EE_SØKER.                                        */        
    /*           MAPSET:  S001U83   MAP S001U81                       */        
    /* -------------------------------------------------------------- */        
                                                                                
    IF (S001U81I.REGDATOL > 0) THEN                                             
       EES.REGDATO_ÅMD                                                          
          = KONV_ÅMD_HÅMD((S001U81I.REGDATOI));                                 
    IF (S001U81I.TERMIDL > 0) THEN                                              
       EES.TERMID = S001U81I.TERMIDI;                                           
                                                                                
    /* ************************************************************** */        
    /* PUNKT 1 OPPLYSNINGER OM SØKEREN (GJENLEVENDE                   */        
    /* ************************************************************** */        
                                                                                
    /* 1.1                                                            */        
    IF (S001U81I.FNRL > 0) THEN                                                 
       EES.FNR = F_FELT_CHAR_PIC11(S001U81I.FNRI);                              
                                                                                
    /* 1.2                                                            */        
    IF (S001U81I.TKNRL > 0) THEN                                                
       EES.TKNR = F_FELT_CHAR_PIC4(S001U81I.TKNRI);                             
                                                                                
    /* 1.3                                                            */        
    IF (S001U81I.NAVNL > 0) THEN                                                
       EES.NAVN = S001U81I.NAVNI;                                               
                                                                                
    /* 1.4                                                            */        
    IF (S001U81I.SPRÅKL > 0) THEN                                               
       EES.SPRÅK = SPRÅKI;                                                      
                                                                                
    /* 1.5                                                            */        
    IF (S001U81I.SIVILSTANDL > 0) THEN                                          
       EES.SIVILSTAND = SIVILSTANDI;                                            
                                                                                
    IF (S001U81I.RED_GP_3_2_5L > 0) THEN                                        
       EES.RED_GP_3_2_5 = RED_GP_3_2_5I;                                        
                                                                                
                                                                                
    IF (S001U81I.FRADRAG_2GL > 0) THEN                                          
       EES.FRADRAG_2G = FRADRAG_2GI;                                            
                                                                                
    /* 1.6                                                            */        
    IF (S001U81I.NORSK_BOSATTL > 0) THEN                                        
       EES.NORSK_BOSATT = NORSK_BOSATTI;                                        
                                                                                
    /* 1.7                                                            */        
    IF (S001U81I.FORVENTET_INNTL > 0) THEN                                      
       EES.FORVENTET_INNT = FORVENTET_INNTI ;                                   
                                                                                
    /* 1.8                                                            */        
    IF (S001U81I.FAIL > 0) THEN                                                 
       EES.FAI = FAII ;                                                         
                                                                                
    /* 1.9                                                            */        
    IF (S001U81I.GP_OS_KODEL > 0) THEN                                          
       EES.GP_OS_KODE = GP_OS_KODEI;                                            
                                                                                
    /* 1.10                                                           */        
    IF (S001U81I.YSKADE_TILLEGGL > 0) THEN                                      
       EES.YSKADE_TILLEGG = YSKADE_TILLEGGI;                                    
                                                                                
    /* 1.11                                                           */        
    IF (S001U81I.VIRK_DATO_MÅL > 0) THEN                                        
       EES.VIRK_DATO_ÅMD                                                        
          = KONV_MÅ_HÅMD(F_FELT_CHAR_PIC4(VIRK_DATO_MÅI));                      
                                                                                
    /* 1.12                                                           */        
    IF (S001U81I.FRAMLEGGSDATO_MÅL > 0) THEN                                    
       EES.FRAMLEGGSDATO_ÅMD                                                    
          = KONV_MÅ_HÅMD(F_FELT_CHAR_PIC4(FRAMLEGGSDATO_MÅI));                  
                                                                                
    /* ************************************************************** */        
    /* PUNKT 2 OPPLYSNINGER OM AVDØDE                                 */        
    /* ************************************************************** */        
                                                                                
    /* 2.1                                                            */        
    IF (S001U81I.FNR_EKL > 0) THEN                                              
       EES.FNR_EK = F_FELT_CHAR_PIC11(S001U81I.FNR_EKI);                        
                                                                                
    /* 2.2                                                            */        
    IF (S001U81I.NAVN_EKL > 0) THEN                                             
       EES.NAVN_EK = NAVN_EKI;                                                  
                                                                                
    /* 2.3                                                            */        
    IF (S001U81I.SIVILSTAND_EKL > 0) THEN                                       
       EES.SIVILSTAND_EK = SIVILSTAND_EKI;                                      
                                                                                
    /* 2.4                                                            */        
    IF (S001U81I.DØDSDATO_DMÅ_EKL > 0) THEN                                     
       EES.DØDSDATO_ÅMD_EK                                                      
          = KONV_DMÅ_HÅMD(F_FELT_CHAR_PIC6(DØDSDATO_DMÅ_EKI));                  
                                                                                
    /* 2.5                                                            */        
    IF (S001U81I.NORSK_BOSATT_EKL > 0) THEN                                     
       EES.NORSK_BOSATT_EK = NORSK_BOSATT_EKI;                                  
                                                                                
    /* 2.6                                                            */        
    IF (S001U81I.VILKÅR_3_17AL > 0) THEN                                        
       EES.VILKÅR_3_17A_EK = S001U81I.VILKÅR_3_17AI;                            
                                                                                
    /* 2.7                                                            */        
    IF (S001U81I.PI_EKL > 0) THEN                                               
    /* EES.PI_EK = F_FELT_CHAR_PIC7(PI_EKI); */                                 
       EES.PI_EK = PI_EKI;                                                      
                                                                                
    /* 2.8                                                            */        
    DO J = 1 TO HBOUND(S001U81I.VP_ÅR_EKD);                                     
       IF (S001U81I.VP_ÅR_EKL(J) > 0) THEN                                      
           EES.VP_ÅR_EK(J) = F_FELT_CHAR_PIC4(VP_ÅR_EKI(J));                    
    END;                                                                        
 END OVERFØR_EE_SØKER;                                                          
 /* ----------------------------------------------------------------- */        
 OVERFØR_EE_SP_SØKER: PROC;                                                     
    /* -------------------------------------------------------------- */        
    /*   PROSEDYRE FOR Å OVERFØRE SPESIELLE OPPLYSNINGER FRA          */        
    /*   SKJERMBILDET TIL EE_TRANS_OMR I KOM_OMR FOR EE_SPES.OPPL.    */        
    /*                 MAPSET S001U83   MAP S001U81                   */        
    /* -------------------------------------------------------------- */        
                                                                                
    /* ************************************************************** */        
    /* PUNKT 3 SPESIELLE OPPLYSNINGER OM GJENLEVENDE                  */        
    /* ************************************************************** */        
                                                                                
    /* 3.1                                                            */        
    IF (S001U81I.STATSBORGERL > 0) THEN                                         
       EESP.STATSBORGER = F_FELT_CHAR_PIC3((S001U81I.STATSBORGERI));            
                                                                                
    /* 3.2                                                            */        
    IF (S001U81I.BOSATTL > 0) THEN                                              
       EESP.BOSATT = F_FELT_CHAR_PIC3((S001U81I.BOSATTI));                      
                                                                                
    /* 3.3.1                                                          */        
    IF (S001U81I.MEDLEML > 0) THEN                                              
       EESP.MEDLEM = S001U81I.MEDLEMI;                                          
                                                                                
    /* 3.3.2                                                          */        
    IF (S001U81I.TT_LIK_PÅL > 0) THEN                                           
       EESP.TT_LIK_PÅ = S001U81I.TT_LIK_PÅI;                                    
                                                                                
    /* 3.3.3                                                          */        
    IF S001U81I.MINST_20ÅRL > 0 THEN                                            
       EESP.MINST_20ÅR = S001U81I.MINST_20ÅRI;                                  
                                                                                
    /* 3.3.4                                                          */        
    IF S001U81I.KONVENSJON_LANDL > 0 THEN                                       
       EESP.KONVENSJON_LAND                                                     
          = F_FELT_CHAR_PIC3((S001U81I.KONVENSJON_LANDI));                      
                                                                                
    /* 3.3.5                                                          */        
    IF S001U81I.FRAVIK_BOSATT_EØSL > 0 THEN                                     
       EESP.FRAVIK_BOSATT_EØS = S001U81I.FRAVIK_BOSATT_EØSI ;                   
                                                                                
    /* 3.3.6                                                          */        
    IF S001U81I.UNG_UFØRL > 0 THEN                                              
       EESP.UNG_UFØR = S001U81I.UNG_UFØRI;                                      
                                                                                
    /* 3.4                                                            */        
    IF S001U81I.FRAVIK_FLYKTL > 0 THEN                                          
       EESP.FRAVIK_FLYKT = FRAVIK_FLYKTI;                                       
                                                                                
    /* 3.5                                                            */        
    IF S001U81I.TT_ENDRESL > 0 THEN                                             
       EESP.TT_ENDRES = TT_ENDRESI;                                             
 END OVERFØR_EE_SP_SØKER;                                                       
 /* ----------------------------------------------------------------- */        
 OVERFØR_EE_SP_AVDØD: PROC;                                                     
    /* ************************************************************** */        
    /* PUNKT 4 SPESIELLE OPPLYSNINGER OM AVDØDE                       */        
    /* ************************************************************** */        
    IF (S001U82I.REGDATOL > 0) THEN                                             
       EES.REGDATO_ÅMD                                                          
          = KONV_ÅMD_HÅMD((S001U82I.REGDATOI));                                 
                                                                                
    /* 4.1                                                            */        
    IF S001U82I.STATSBORGERL > 0 THEN                                           
       EESP.STATSBORGER_EK = F_FELT_CHAR_PIC3((S001U82I.STATSBORGERI));         
                                                                                
    /* 4.2                                                            */        
    IF S001U82I.BOSATTL > 0 THEN                                                
       EESP.BOSATT_EK = F_FELT_CHAR_PIC3((S001U82I.BOSATTI));                   
                                                                                
    /* 4.3                                                            */        
    IF S001U82I.FRAVIK_FLYKT_EKL > 0 THEN                                       
       EESP.FRAVIK_FLYKT_EK = FRAVIK_FLYKT_EKI;                                 
                                                                                
    /* 4.4                                                            */        
    IF (S001U82I.FRAVIK_17_3_4AL > 0) THEN                                      
       EESP.FRAVIK_17_3_4A = S001U82I.FRAVIK_17_3_4AI;                          
    IF (S001U82I.FRAVIK_17_3_4BL > 0) THEN                                      
       EESP.FRAVIK_17_3_4B = S001U82I.FRAVIK_17_3_4BI;                          
                                                                                
    /* 4.5                                                            */        
    IF S001U82I.TT_FRA_1937_ÅR_EKL > 0 THEN                                     
       EESP.TT_FRA_1937_ÅR_EK = F_FELT_CHAR_PIC2((TT_FRA_1937_ÅR_EKI));         
    IF S001U82I.TT_FRA_1937_MND_EKL > 0 THEN                                    
       EESP.TT_FRA_1937_MND_EK                                                  
          = F_FELT_CHAR_PIC2((TT_FRA_1937_MND_EKI));                            
                                                                                
    /* 4.6                                                            */        
    IF S001U82I.OVERKOMP_UTL_EKL > 0 THEN                                       
       EESP.OVERKOMP_UTL_EK = OVERKOMP_UTL_EKI;                                 
                                                                                
    /* 4.7                                                            */        
    IF S001U82I.TT_KONVENSJON_ÅR_EKL > 0 THEN                                   
       EESP.TT_KONVENSJON_ÅR_EK =                                               
          F_FELT_CHAR_PIC2((TT_KONVENSJON_ÅR_EKI));                             
                                                                                
    IF S001U82I.EØS_OPPLYSNL         > 0 THEN                                   
         EESP.EØS_OPPLYSN    =  EØS_OPPLYSNI;                                   
    /* ************************************************************** */        
    /* PUNKT 6 SPESIELLE OPPLYSNINGER OM AVDØDE - EØS/NORDISK KONV.   */        
    /*         DETTE PUNKTET ER FLYTTET TIL NY PROC                   */        
    /* ************************************************************** */        
 END OVERFØR_EE_SP_AVDØD;                                                       
 /* ----------------------------------------------------------------- */        
 OVERFØR_EE_EØS:PROC;                                                           
    /* 6.1                                                            */        
    IF S001U83I.BEREGN_FOLKETRYGDL > 0 THEN                                     
       EEEØS.BEREGN_FOLKETRYGD = S001U83I.BEREGN_FOLKETRYGDI;                   
                                                                                
    /* 6.2                                                            */        
    IF S001U83I.EØS_3_17AL > 0 THEN                                             
       EEEØS.EØS_3_17A = S001U83I.EØS_3_17AI;                                   
                                                                                
    /* 6.3                                                            */        
    DO J = 1 TO HBOUND(S001U83I.EØS_ÅRD);                                       
       IF S001U83I.EØS_ÅRL(J) > 0 THEN                                          
          EEEØS.EØS_ÅR(J)                                                       
             = F_FELT_CHAR_PIC4((S001U83I.EØS_ÅRI(J)));                         
    END;                                                                        
                                                                                
    /* 6.4                                                            */        
    DO J = 1 TO HBOUND(S001U83I.ÅR_EØS_IKKE_PRO_RATAD);                         
       IF (S001U83I.ÅR_EØS_IKKE_PRO_RATAL(J) > 0) THEN                          
          EEEØS.EØS_ÅR_IKKE_PRO_RATA(J)                                         
             = F_FELT_CHAR_PIC4((ÅR_EØS_IKKE_PRO_RATAI(J)));                    
    END;                                                                        
                                                                                
    /* 6.5                                                            */        
    IF S001U83I.TT_TEORETISK_ÅRL > 0 THEN                                       
       EEEØS.TT_TEORETISK_ÅR = F_FELT_CHAR_PIC2((TT_TEORETISK_ÅRI));            
    IF S001U83I.TT_TEORETISK_MNDL > 0 THEN                                      
       EEEØS.TT_TEORETISK_MND = F_FELT_CHAR_PIC2((TT_TEORETISK_MNDI));          
                                                                                
    /* 6.6                                                            */        
    IF S001U83I.TT_PRORATA_ÅRL > 0 THEN                                         
       EEEØS.TT_PRORATA_ÅR = F_FELT_CHAR_PIC2((TT_PRORATA_ÅRI));                
    IF S001U83I.TT_PRORATA_MNDL > 0 THEN                                        
       EEEØS.TT_PRORATA_MND = F_FELT_CHAR_PIC2((TT_PRORATA_MNDI));              
                                                                                
    /* 6.7                                                            */        
    IF S001U83I.PENSJON_EØSL > 0 THEN                                           
       EEEØS.PENSJON_EØS = F_FELT_CHAR_PIC7(S001U83I.PENSJON_EØSI);             
                                                                                
    /* 6.8                                                            */        
    DO J = 1 TO HBOUND(S001U83I.ÅR_PRO_RATA2D);                                 
       IF (S001U83I.ÅR_PRO_RATA2L(J) > 0) THEN                                  
          EEEØS.EØS_ÅR_PRO_RATA2(J)                                             
             = F_FELT_CHAR_PIC4((ÅR_PRO_RATA2I(J)));                            
    END;                                                                        
                                                                                
    /* 6.9                                                            */        
    IF S001U83I.TT_PRORATA2_ÅRL > 0 THEN                                        
       EEEØS.TT_PRORATA2_ÅR                                                     
          = F_FELT_CHAR_PIC2((TT_PRORATA2_ÅRI));                                
    IF S001U83I.TT_PRORATA2_MNDL > 0 THEN                                       
       EEEØS.TT_PRORATA2_MND                                                    
          = F_FELT_CHAR_PIC2((TT_PRORATA2_MNDI));                               
                                                                                
    /* 6.10                                                           */        
    IF S001U83I.TT_FAKTISK_NORDISK_ÅRL > 0 THEN                                 
       EEEØS.TT_FAKTISK_NORDISK_ÅR                                              
          = F_FELT_CHAR_PIC2((TT_FAKTISK_NORDISK_ÅRI));                         
    IF S001U83I.TT_FAKTISK_NORDISK_MNDL > 0 THEN                                
       EEEØS.TT_FAKTISK_NORDISK_MND                                             
          = F_FELT_CHAR_PIC2((TT_FAKTISK_NORDISK_MNDI));                        
                                                                                
    /* 6.11                                                           */        
    IF S001U83I.PÅ_FAKTISK_NORDISKL > 0 THEN                                    
       EEEØS.PÅ_FAKTISK_NORDISK                                                 
          = F_FELT_CHAR_PIC2((PÅ_FAKTISK_NORDISKI));                            
                                                                                
    /* 6.12                                                           */        
    IF S001U83I.INNT_PRØVET_EØS_PENSL > 0 THEN                                  
       EEEØS.INNT_PRØVET_EØS_PENS = INNT_PRØVET_EØS_PENSI;                      
                                                                                
 END OVERFØR_EE_EØS;                                                            
