 /*   SIST ENDRET PÅ PROD   2008.05.31 11.27.11 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2007.03.01 15.17.18 AV   SPA2990          */        
 /*   SIST ENDRET PÅ TEST   2007.03.01 15.15.24 AV   SPA2990          */        
 /*   SIST ENDRET PÅ TEST   2005.04.12  9.08.01 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.16 14.05.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.12 13.47.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.10.22 12.59.53 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.22 12.55.32 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.10.22  8.31.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.21 15.03.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.57.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.09.04 10.00.26 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.37.04 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.13 14.18.43 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.35.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.07.10 12.50.24 AV   JDA7339          */        
 /*       SIST ENDRET 20/10-99 12.40.47 AV   JDA7339                  */        
 /*       SIST ENDRET 20/10-99 12.38.45 AV   JDA7339                  */        
 /*       SIST ENDRET 14/09-99 10.23.50 AV   JDA7339                  */        
 /*       SIST ENDRET 26/08-99 15.51.36 AV   SPA7339                  */        
 /*       SIST ENDRET 28/08-98 15.58.44 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.49.42 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO10  BEHANDLING AV GRUNNBLANKETTER          */        
 /*                            REGISTRERT I NORTRYGD-PENSJONER        */        
 /*                            ELLER INFOTRYGDS GRUNNBLANKETT-RUTINE. */        
 /*  PROGRAM-SPRÅK : PLI/CICS                     HOVEDPROGRAM        */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : 1986                                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  PROGRAMMET LESER RECORDS SOM ER OVERFØRT FRA                     */        
 /*  INFOTRYGD.  DISSE INNEHOLDER GRUNNBLANKTETT-OPPLYSNINGER.        */        
 /*  PROGRAMMET KONTROLLERER OPPLYSNINGENE PÅ RECORDEN, OG SENDER     */        
 /*  TRANSAKSJONEN INN I DET VANLIGE REGISTRERINGSSYSTEMET, VIA       */        
 /*  R0013001.                                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  BLIR GITT KONTROLL V EXEC CICS XCTL FRA R0010426.                */        
 /*                                                                   */        
 /*  EXEC CICS LINK TIL :                                             */        
 /*                                                                   */        
 /*     R0013001   BEHANDLE TRANS                                     */        
 /*     R0012201   BEHANDLE EP,BP                                     */        
 /*     R0016501   STATISTIKK                                         */        
 /*     R0019921   HENT FEILMELD. FRA FEILMELD-BASEN                  */        
 /*                                                                   */        
 /*  EXEC CICS XCTL TIL :                                             */        
 /*                                                                   */        
 /*     R0010301   BEHANDLE TRANS                                     */        
 /*     R0010420   BEHANDLE EP,BP                                     */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*     R001NO11   KONTROLL AP-BLANKETT                               */        
 /*     R001NN11   KONTROLL A1-BLANKETT                               */        
 /*     R001NO12   KONTROLL UP-BLANKETT                               */        
 /*     R001NN12   KONTROLL U2-BLANKETT                               */        
 /*     R001NU12   KONTROLL U3-BLANKETT                               */        
 /*     R001NO13   KONTROLL EP-BLANKETT                               */        
 /*     R001NN13   KONTROLL E3-BLANKETT                               */        
 /*     R001NU13   KONTROLL EE-BLANKETT                               */        
 /*     R001NO14   KONTROLL BP-BLANKETT                               */        
 /*     R001NN14   KONTROLL B6-BLANKETT                               */        
 /*     R001NO15   KONTROLL FT-BLANKETT                               */        
 /*     R001NN15   KONTROLL F7-BLANKETT                               */        
 /*     R001NO16   KONTROLL E1-BLANKETT                               */        
 /*     R001NU16   KONTROLL EN-BLANKETT                               */        
 /*     R001NO17   KONTROLL O1-BLANKETT                               */        
 /*     R001NO18   KONTROLL O2-BLANKETT                               */        
 /*     R001NO19   KONTROLL E2-BLANKETT                               */        
 /*     R001NO1A   KONTROLL AFP-BLANKETT                              */        
 /*     R001NU1A   KONTROLL KFP-BLANKETT                              */        
 /*     R0010508   TT_AP                                              */        
 /*     R0010608   TT_UP_EP                                           */        
 /*     R0019901   F_GYLDIG_DATO                                      */        
 /*     R0019902   F_KJØNN                                            */        
 /*     R0019903   F_EK_ALDER                                         */        
 /*     R0019904   F_GYLDIG_FNR                                       */        
 /*     R0019905   F_ALDER                                            */        
 /*     R0019907   F_TABSØKC_FUNNET                                   */        
 /*     R0019908   F_DAGS_DATO_PLUSS1_MÅ                              */        
 /*     R0019909   F_KONTROLL_TT                                      */        
 /*     R0019910   F_NUMERISK                                         */        
 /*     R0019912   F_FELT_CHAR_PICNN                                  */        
 /*     R0019913   F_SNU_DATO                                         */        
 /*     R0019942   F_SNU_DØDSDATO                                     */        
 /*     R0019953   F_AP_40DAGER                                       */        
 /*     R0019964   F_6MDR                                             */        
 /*     R0019956   P9956_BER_G_CICS                                   */        
 /*                                                                   */        
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */        
 /*                                                                   */        
 /*          S001NO                               MAP NOR_OVERF       */        
 /*          P001NO10                             BLANKETT_RECORD     */        
 /*          P001NO30                             STATISTIKK_REC      */        
 /*          P0010501     INCL I UNDERPROGRAM     TRANS_OMR AP        */        
 /*          P001N501     INCL I UNDERPROGRAM     TRANS_OMR A1        */        
 /*          P0010601     INCL I UNDERPROGRAM     TRANS_OMR UP        */        
 /*          P001N601     INCL I UNDERPROGRAM     TRANS_OMR U2        */        
 /*          P001U601     INCL I UNDERPROGRAM     TRANS_OMR U3        */        
 /*          P0010801     INCL I UNDERPROGRAM     TRANS_OMR EP        */        
 /*          P001U801     INCL I UNDERPROGRAM     TRANS_OMR EE        */        
 /*          P0011101     INCL I UNDERPROGRAM     TRANS_OMR BP        */        
 /*          P0011B01     INCL I UNDERPROGRAM     TRANS_OMR B6        */        
 /*          P0011201     INCL I UNDERPROGRAM     TRANS_OMR FT        */        
 /*          P001NC01     INCL I UNDERPROGRAM     TRANS_OMR F7        */        
 /*          P0011401     INCL I UNDERPROGRAM     TRANS_OMR E1        */        
 /*          P001UE01     INCL I UNDERPROGRAM     TRANS_OMR EN        */        
 /*          P0011501     INCL I UNDERPROGRAM     TRANS_OMR E2        */        
 /*          P0011601     INCL I UNDERPROGRAM     TRANS_OMR O1        */        
 /*          P0011701     INCL I UNDERPROGRAM     TRANS_OMR O2        */        
 /*          P0011801     INCL I UNDERPROGRAM     TRANS_OMR AU        */        
 /*          P0011901     INCL I UNDERPROGRAM     TRANS_OMR AFP       */        
 /*          P001UJ01     INCL I UNDERPROGRAM     TRANS_OMR KFP       */        
 /*          P0012002                             PCB_UIB_OMR         */        
 /*          P0014009                             POTALL_OPPL         */        
 /*          P0019906                             TRANS_OPPL_OMR      */        
 /*          P0019908                             KOM_OMR             */        
 /*          P0019910                             STYRINGS_OMR        */        
 /*          P0019912                             DIV_OMR             */        
 /*          P0019924                             G_V_TAB             */        
 /*          P0019925                             G_TAB               */        
 /*          P0019953                             TKNR_TAB            */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  INPUT-DATSETTET ER EN VSAM-FILE SOM BLIR FYLT MED RECORDER       */        
 /*  OVERFØRT FRA NORTRYGD OG INFOTRYGD.                              */        
 /*  OUTPUT ER                                                        */        
 /*            OPPDATERT RF-BASE,                                     */        
 /*            TRANSAKSJONSBASE TIL STATISTIKK OG                     */        
 /*            STØNADSBREV-BASEN                                      */        
 /*            LOGG                                                   */        
 /*            STATISTIKK                                             */        
 /*            FEILMELDINGER                                          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*  FEIL-MELDINGER SKRIVES TIL EN VSAM-FILE.  DISSE BLIR SENDT       */        
 /*                                             TIL TRYGDEKONTORET.   */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*ENDRINGER:                                                         */        
 /* *******************                                               */        
 /*  LAGT INN MULIGHET FOR Å KJØRE STYRT AUTOHENDELSE.                */        
 /*                                                                   */        
 /*      OBS OBS OBS OBS                                              */        
 /*         DERSOM TRYGDEKONTORENE FÅR REGISTRERE STYRT AUTO,         */        
 /*         MÅ PROGRAMMET GJØRES OM SLIK AT STATISTIKK-RECORD         */        
 /*         BLIR SKREVET, SELV OM DET KOM EN 'AU'-TRANS INN.          */        
 /*                                                                   */        
 /*  210489 BRITT                                                     */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001NO1: PROC(COMMAREA_PEKER)  OPTIONS  (MAIN);                                
                                                                                
    %PAGE;                                                                      
    %INCLUDE S001NO  ;                  /* MAP : OVERFØRING           */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019908;                  /* KOM_OMR                    */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P001NO10;                  /* BLANKETT_REC               */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0012004;                  /* STATISTIKK_REC             */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0014009;                  /* POTALL_OPPL                */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019906;                  /* TRANS_OPPL_OMR             */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019910;                  /* STYRINGS_OMR               */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019912;                  /* DIV_OMR                    */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019924;                  /* G_V_TAB                    */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019925;                  /* G_TAB                      */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019953;                  /* TKNRTAB                    */        
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   PCB- OG UIB-OMR.                                             */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
    DCL UIB_RC_OK             BIT  (8)     INIT ('00000000'B);                  
                                                                                
    DCL COMMAREA_PEKER        POINTER;                                          
                                                                                
    %INCLUDE  P0012002;                 /* PCB-UIB-PEKER OMR  BASED   */        
                                                                                
    %INCLUDE  DFHBMSCA;                                                         
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   INPUT OMRÅDER FOR G_TAB OG G_V_TAB                           */        
    /* ************************************************************** */        
                                                                                
    DCL GRUNN_OMR1            CHAR      (1440);       /*2000*/                  
    DCL GRUNN_OMR2            CHAR      (1440);       /*2000*/                  
    DCL GRUNN_IDENT           CHAR      ( 8);                                   
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
    DCL (ADDR, VERIFY, TIME, LOW, SYSPRINT, CSTG, STG, SUBSTR    )              
                                                               BUILTIN;         
                                                                                
    DCL PLITDLI               ENTRY;                                            
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   DATOBEHANDLING   TIDSBEHANDLING                              */        
    /* ************************************************************** */        
                                                                                
    DCL TIDS_PEKER            POINTER                      ,                    
        TIDS_TEST             CHAR (4)   BASED (TIDS_PEKER),                    
        TID_UTE               CHAR (4)                     ;                    
                                                                                
    DCL FORRIGE_TID           PIC'999B99B99'  INIT (0);                         
    DCL FORRIGE_TID_MIN       PIC'99'         DEF  FORRIGE_TID POS(5);          
    DCL FORRIGE_TID_TIM       PIC'999'        DEF  FORRIGE_TID;                 
    DCL START_TID             PIC'999B99B99'  INIT (0);                         
                                                                                
    DCL KJØRE_SLUTT_TID_CHAR  CHAR (4),                                         
        KJØRE_SLUTT_MIN       PIC '99' DEF KJØRE_SLUTT_TID_CHAR POS(3),         
                                                                                
        KJØRE_SLUTT_TID_DEC   FIXED DEC ( 7);                                   
                                                                                
    DCL TRANS_TID_CHAR        CHAR (4),                                         
        TRANS_TID_MIN         PIC '99' DEF TRANS_TID_CHAR POS(3);               
                                                                                
    DCL DIFFERANSE            PIC'9999';                                        
    DCL NÅ_TID                PIC'999B99B99'  INIT (0);                         
    DCL NÅ_TID_MIN            PIC'99'         DEF  NÅ_TID      POS(5);          
    DCL NÅ_TID_TIM            PIC'999'        DEF  NÅ_TID;                      
    DCL  MAP_MELDING               CHAR (78);                                   
                                                                                
                                                                                
    /* ************************************************************** */        
    /*  BRYTERE                                                       */        
    /* ************************************************************** */        
                                                                                
    DCL FEIL_FUNNET           BIT  (1) INIT('0'B),                              
        FEIL_BLANKETT         BIT  (1) INIT('0'B),                              
        FEIL_I_BOSATT         BIT  (1) INIT('0'B),                              
        EOF_NORFILE           BIT  (1) INIT('0'B),                              
        INGEN_FEIL            BIT  (1) INIT('1'B),                              
        TRUE                  BIT  (1) INIT('1'B),                              
        FALSE                 BIT  (1) INIT('0'B),                              
        W_ANT_FERDIG_BEH_OPPD BIT  (1) INIT('0'B),                              
        W_ERSTATT_FEILTEKST   BIT  (1) INIT('0'B),                              
        AUTO_KJØRING          BIT  (1) INIT('0'B);                              
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*  TELLERE, INDEKSER                                             */        
    /* ************************************************************** */        
                                                                                
    DCL ANT_BEH               FIXED BIN (15) INIT (0);                          
    DCL INTERVALL_TELL        FIXED BIN (15) INIT (1);                          
    DCL (I,J)                 FIXED BIN (15);                                   
    DCL FEIL_TALL             FIXED BIN (15);                                   
    DCL FEIL_LOOP             FIXED BIN (15);                                   
    DCL FEIL_IND              FIXED BIN (15);                                   
    DCL ANT_FEIL_SKREVET      FIXED DEC (3);                                    
                                                                                
    DCL SYSTEM_INDEX          FIXED BIN (15);                                   
                                                                                
    DCL 01 STATISTIKK_TABELL(2),  /* INDEKS 1: INFOTRYGD, 2: NORTRYGD */        
           05 AP_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 A1_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 AP_AVVIST       FIXED BIN (15) INIT (0),                          
           05 A1_AVVIST       FIXED BIN (15) INIT (0),                          
           05 UP_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 U2_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 U3_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 UP_AVVIST       FIXED BIN (15) INIT (0),                          
           05 U2_AVVIST       FIXED BIN (15) INIT (0),                          
           05 U3_AVVIST       FIXED BIN (15) INIT (0),                          
           05 EP_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 EE_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 EP_AVVIST       FIXED BIN (15) INIT (0),                          
           05 EE_AVVIST       FIXED BIN (15) INIT (0),                          
           05 BP_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 B6_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 BP_AVVIST       FIXED BIN (15) INIT (0),                          
           05 B6_AVVIST       FIXED BIN (15) INIT (0),                          
           05 FT_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 F7_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 FT_AVVIST       FIXED BIN (15) INIT (0),                          
           05 F7_AVVIST       FIXED BIN (15) INIT (0),                          
           05 E1_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 E1_AVVIST       FIXED BIN (15) INIT (0),                          
           05 EN_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 EN_AVVIST       FIXED BIN (15) INIT (0),                          
           05 E2_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 E2_AVVIST       FIXED BIN (15) INIT (0),                          
           05 O1_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 O1_AVVIST       FIXED BIN (15) INIT (0),                          
           05 O2_MOTTATT      FIXED BIN (15) INIT (0),                          
           05 O2_AVVIST       FIXED BIN (15) INIT (0),                          
           05 AFP_MOTTATT     FIXED BIN (15) INIT (0),                          
           05 AFP_AVVIST      FIXED BIN (15) INIT (0),                          
           05 KFP_MOTTATT     FIXED BIN (15) INIT (0),                          
           05 KFP_AVVIST      FIXED BIN (15) INIT (0),                          
           05 FEIL_BL_TYPE    FIXED BIN (15) INIT (0);                          
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*  FELTER FOR MAP-BEHANDLING OG FIL-BEHANDLING                   */        
    /* ************************************************************** */        
                                                                                
    DCL MAP_CHAR              CHAR(250)  BASED (BMSMAPBR);                      
    DCL BRI_NUM_MDT           CHAR(1)    INIT  ('P');                           
    DCL BRI_PROT_MDT          CHAR(1)    INIT  ('Z');                           
                                                                                
    DCL FEIL_RBA              POINTER;                                          
    DCL LOGG_RBA              POINTER;                                          
    DCL STAT_RBA              POINTER;                                          
    DCL REST_RBA              POINTER;                                          
    DCL NOR_RBA               POINTER;                                          
    DCL BMSMAPBR              POINTER;                                          
    DCL KEY_PEKER             POINTER;                                          
                                                                                
    DCL KEY_NORFIL            CHAR      (33) ;                                  
    DCL KEY_TKTAB             BIT       (32)   BASED (KEY_PEKER);               
                                                                                
    DCL W_FNR                 PIC '(11)9' INIT (0);                             
                                                                                
    /* ************************************************************** */        
    /*  FEILBEHANDLING                                                */        
    /* ************************************************************** */        
                                                                                
    DCL MELDING               CHAR      (78)         INIT(' ');                 
                                                                                
    DCL W01_FEIL_NR (3)       FIXED DEC (5);                                    
    DCL W02_FEIL_NR_PIC       PIC      '(4)9';                                  
                                                                                
    DCL 01 FEIL_REC  ,                                                          
           05 HODE,                                                             
              10 HODE_TKNR             PIC '( 4)9',                             
              10 HODE_RECORD_TYPE      CHAR ( 2),                               
              10 HODE_TRANS_TYPE       CHAR ( 2),                               
              10 HODE_TRANS_DATO_ÅMD   PIC '( 8)9',    /*2000*/                 
              10 HODE_TRANS_TID        PIC '( 4)9',                             
           05 FEILMELD,                                                         
              10 TKNR                  PIC '( 4)9',                             
              10 RECORD_TYPE           CHAR ( 2),                               
              10 TRANS_TYPE            CHAR ( 2),                               
              10 TRANS_DATO_ÅMD        PIC '( 8)9',    /*2000*/                 
              10 TRANS_TID             PIC '( 4)9',                             
              10 FNR                   PIC '(11)9',                             
              10 BL_TYPE               CHAR ( 2)  ,                             
              10 NAVN                  CHAR (25),                               
              10 VIRK_DATO_ÅMD         PIC '( 8)9',    /*2000*/                 
              10 FEIL_MELD(3)          CHAR (78);      /*2000*/                 
  /*       05 FILLER                   CHAR ( 8);        2000*/                 
                                                                                
    DCL 01 FEIL_STRUC,                                                          
           02 FEIL_NR         FIXED DEC ( 5)      INIT (0),                     
           02 FEIL_MELDING    CHAR      (78)      INIT ((78)' '),               
           02 KOM_OMR_PEKER   POINTER;                                          
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*  RECORDBESKRIVELSE NORREST.                                    */        
    /*  RECORDENE SOM BEHANDLES LOGGES ETTERHVERT.  BRUKES VED        */        
    /*  RESTART ETTER UKONTROLLERT AVBRUDD.                           */        
    /* ************************************************************** */        
                                                                                
    DCL 01 REST_REC  ,                                                          
           05 REST_TKNR             PIC '( 4)9',                                
           05 REST_TRANS_DATO_ÅMD   PIC '( 8)9',     /*2000*/                   
           05 REST_TRANS_TID        PIC '( 4)9',                                
           05 REST_FNR              PIC '(11)9',                                
           05 REST_BLANKETT_TYPE    CHAR ( 2),                                  
           05 REST_REC_NR           CHAR ( 2);                                  
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*  HJELPEFELTER                                                  */        
    /* ************************************************************** */        
                                                                                
    DCL W01_GMLT_TKNR         PIC '(4)9'     INIT (0);                          
    DCL DATO_HÅMD             PIC '(8)9'     INIT (0);     /*2000*/             
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */        
    /* ************************************************************** */        
                                                                                
  FEIL_RBA   = ADDR(FEIL_REC);                                                  
  LOGG_RBA   = ADDR(MAP_CHAR);                                                  
  STAT_RBA   = ADDR(STATISTIKK_REC);                                            
  NOR_RBA   =  ADDR(NOR_REC);                                                   
                                                                                
  EXEC CICS HANDLE CONDITION ERROR   (CICS_ABEND);                              
                                                                                
  ON ERROR SNAP                                                                 
     BEGIN;                                                                     
        DATO_HÅMD = BLANKETT_RECORD.TRANS_DATO_ÅMD;                             
                ON ERROR SYSTEM;                                                
                   MELDING = 'STOPP !ERROR  ABEND KEY:'            !!           
                              BLANKETT_RECORD.TKNR           !! ' ' !!          
                              BLANKETT_RECORD.FNR            !! ' ' !!          
                              DATO_HÅMD           !! ' ' !!  /*2000*/           
                              BLANKETT_RECORD.TRANS_TID      !! ' ' !!          
                              BLANKETT_RECORD.BLANKETT_TYPE  !! ' ' !!          
                              BLANKETT_RECORD.REC_NR         !!                 
                             ' TA HARD-COPY! TRYKK ENTER!';                     
            /*  GOTO L99;   SATISH 13082001  FOE ABEND-ASRA  */                 
                EXEC CICS SYNCPOINT ROLLBACK;                                   
                GOTO LES_NESTE;                                                 
            /*   OPPTIL HERE                                 */                 
     END;                                                                       
                                                                                
   CALL P010_INITIERING;                                                        
                                                                                
   EXEC CICS ASSIGN  USERID (  DIV_PARAM_OMR.BRUKER_ID );                       
   EXEC CICS HANDLE CONDITION ERROR          (CICS_ABEND);                      
                                                                                
   DB_STATUS_KODE = '  '                                      ;                 
   FEIL_MELD_NR          = 0                                  ;                 
   /* ******************************************************** */               
   /* KOMMER FRA R0010426 FØRSTE GANG VI KOMMER INN .                 */        
   /* ******************************************************** */               
                                                                                
                                                                                
   IF PROGRAM_ID           = 'R0010426' THEN                                    
      DO;                                                                       
         PROGRAM_ID = 'R001NO10';                                               
                                                                                
         CALL P020_LES_LOGG;                                                    
                                                                                
         EXEC CICS LOAD          PROGRAM ('S001NO3');                           
         S001NO1O.CICS_INFOO = CICS_NAVN;                                       
         EXEC CICS SEND          MAP     ('S001NO1') MAPSET ('S001NO3')         
                                                 ERASE            ;             
         EXEC CICS RETURN TRANSID ('RNO1'          ) COMMAREA(KOM_OMR) ;        
                                                                                
      END;                                                                      
                                                                                
                                                                                
   /* ******************************************************** */               
   /* ANDRE GANG BLIR OPPLYSNINGENE PÅ MAPEN SJEKKET. TEST PÅ         */        
   /* FUNKSJONSKODE.                                                  */        
   /* ******************************************************** */               
                                                                                
                                                                                
   EXEC CICS RECEIVE MAP ('S001NO1') MAPSET ('S001NO3')                         
                                     SET           (BMSMAPBR);                  
                                                                                
   IF S001NO1I.FUNKSJONSKODEL               >  0   &                            
      S001NO1I.FUNKSJONSKODEI               = 'X'  THEN                         
      DO;                                                                       
         STYRINGS_OMR.FUNKSJONSKODE         = 'X';                              
         EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);                
      END;                                                                      
                                                                                
   CALL P060_INPUTKONTROLL_MAP;                                                 
                                                                                
                                                                                
   /* ******************************************************** */               
   /* HVIS FEIL SENDES UT MELDING OG RETURN TIL CICS                  */        
   /* ******************************************************** */               
                                                                                
                                                                                
   IF MELDING              ^= (78) ' '  THEN                                    
      CALL P040_MAP_UT_OG_RETUR;                                                
                                                                                
                                                                                
   /* ******************************************************** */               
   /* TAR STARTBROWSE MED LOW(27) ELLER OPPGITT NØKKEL                */        
   /* ******************************************************** */               
                                                                                
                                                                                
   IF S001NO1O.FNRO > 0                            THEN                         
      DO;                                                                       
         BLANKETT_RECORD.TKNR = S001NO1O.TKNRO               ;                  
         BLANKETT_RECORD.FNR = S001NO1O.FNRO               ;                    
         BLANKETT_RECORD.BLANKETT_TYPE = S001NO1O.BLANKETT_TYPEO;               
         BLANKETT_RECORD.TRANS_DATO_ÅMD                                         
            = KONV_ÅMD_HÅMD(S001NO1O.TRANS_DATOO) ;         /*2000*/            
         BLANKETT_RECORD.TRANS_TID = S001NO1O.TRANS_TIDO               ;        
         BLANKETT_RECORD.REC_NR           = S001NO1O.REC_NRO           ;        
                                                                                
         DATO_HÅMD = BLANKETT_RECORD.TRANS_DATO_ÅMD;                            
         KEY_NORFIL =          BLANKETT_RECORD.TKNR           !!                
                       'PE'                                   !!                
                       '01'                                   !!                
                        DATO_HÅMD                              !!               
                        BLANKETT_RECORD.TRANS_TID             !!                
                        BLANKETT_RECORD.FNR                   !!                
                        BLANKETT_RECORD.BLANKETT_TYPE         !!                
                        BLANKETT_RECORD.REC_NR                ;                 
      END;                                                                      
                                                                                
   ELSE                                                                         
      KEY_NORFIL =         LOW(33)      ;                                       
                                                                                
   BLANKETT_RECORD.TKNR                  =  0         ;                         
   BLANKETT_RECORD.FNR                   =  0         ;                         
   BLANKETT_RECORD.BLANKETT_TYPE         = '  '       ;                         
   BLANKETT_RECORD.REC_NR                = '  '       ;                         
   BLANKETT_RECORD.TRANS_DATO_ÅMD =         0         ;                         
   BLANKETT_RECORD.TRANS_TID             =  0         ;                         
                                                                                
                                                                                
   CALL DATABASE           ('OPEN');                                            
                                                                                
   IF MELDING ^= (78)' '                 THEN                                   
      GOTO L999;                                                                
                                                                                
                                                                                
   /* ******************************************************** */               
   /* 1) HVIS NØKKEL = LOW(27), LESER FRA BEGYNNELSEN AV INPUT-*/               
   /*           FILEN                                                 */        
   /* 2) HVIS NØKKEL HAR VERDI, LESER BARE DENNE REC NÅR              */        
   /*           ANTALL = 1                                            */        
   /* 3) HVIS NØKKEL HAR VERDI, OG ANTALL > 1 , LESER F.O.M.          */        
   /*           RECORDEN ETTER DEN OPPGITTE NØKKELEN                  */        
   /*                                                                 */        
   /* LESER 1. RECORD                                                 */        
   /* ******************************************************** */               
                                                                                
                                                                                
   EXEC CICS HANDLE          CONDITION ENDFILE   (ENDINP)           ;           
                                                                                
   EXEC CICS HANDLE          CONDITION NOTFND    (NOTFOUND2)        ;           
                                                                                
   EXEC CICS STARTBR         DATASET ('NORFREG') RIDFLD (KEY_NORFIL);           
                                                                                
   EXEC CICS READNEXT DATASET ('NORFREG') INTO         (BLANKETT_RECORD)        
                                          RIDFLD(KEY_NORFIL)         ;          
                                                                                
                                                                                
   /* ******************************************************** */               
   /* LESER NESTE RECORD HVIS ANTALL > 1                              */        
   /* ******************************************************** */               
                                                                                
                                                                                
   IF S001NO1O.ANT_Ø_BEHO         > 1        THEN                               
      DO;                                                                       
         EXEC CICS READNEXT DATASET ('NORFREG')                                 
                            INTO           (BLANKETT_RECORD)                    
                            RIDFLD         ( KEY_NORFIL ) ;                     
      END;                                                                      
                                                                                
                                                                                
   /* ******************************************************** */               
   /* SENDER UT MAP MED BESKJED OM OPPSTART                           */        
   /* ******************************************************** */               
                                                                                
                                                                                
   S001NO1O.MELDINGO          = 'BEHANDLINGEN FOREGÅR  ' !!  DATO_2000;         
   S001NO1O.RECORD_TYPEO            = 'O'                              ;        
   S001NO1O.TKNRA                   =  BRI_PROT_MDT                    ;        
   S001NO1O.FNRA                    =  BRI_PROT_MDT                    ;        
   S001NO1O.BLANKETT_TYPEA          =  BRI_PROT_MDT                    ;        
   S001NO1O.REC_NRA                 =  BRI_PROT_MDT                    ;        
   S001NO1O.TRANS_DATOA             =  BRI_PROT_MDT                    ;        
   S001NO1O.TRANS_TIDA              =  BRI_PROT_MDT                    ;        
   S001NO1O.ANT_Ø_BEHA              =  BRI_PROT_MDT                    ;        
   S001NO1O.STOPP_TIDA              =  BRI_PROT_MDT                    ;        
   S001NO1O.START_TIDO              =  EIBTIME / 100                   ;        
   S001NO1O.KLOKKE_LOGO             =  EIBTIME / 100                   ;        
   S001NO1I.DATO_LOGI               =  KONV_HÅMD_ÅMD(DATO_2000);                
   S001NO1O.CICS_INFOO              =  CICS_NAVN;                               
                                                                                
   EXEC CICS SEND         MAP    ('S001NO1') MAPSET ('S001NO3')                 
                                      WAIT            DATAONLY;                 
   EXEC CICS WRITE DATASET('NORLOGG') FROM          ( MAP_CHAR )                
                                      RIDFLD ( LOGG_RBA ) RBA;                  
                                                                                
   S001NO1O.RECORD_TYPEO            = 'L'                              ;        
   TIDS_TEST              = LOW (4) ;                                           
                                                                                
   /* ******************************************************** */               
   /* HOVEDPROSEDYRE.         ETTER LESING BLIR INPUTRECORDEN KONTROL-*/        
   /* LERT I KONTROLLPROGRAMMET FOR DEN BLANKETT-TYPEN OVER-          */        
   /* FØRINGEN GJELDER.         DERSOM KONTROLLEN GÅR BRA, BLIR       */        
   /* TRANSAKSJONEN SENDT INN I DET VANLIGE REGISTRERINGS-            */        
   /* SYSTEMET.         (PROGRAMMET SIMULERER R0012001.)              */        
   /* ******************************************************** */               
                                                                                
  /* HOVED PROC   */                                                            
   DO ANT_BEH = 1 TO S001NO1O.ANT_Ø_BEHO                                        
                                  WHILE (^EOF_NORFILE &                         
                                          INGEN_FEIL         &                  
                                          TIDS_TEST = LOW (4) );                
                                                                                
      W_ANT_FERDIG_BEH_OPPD           =  '0'B                         ;         
      S001NO1O.ANT_REC_INPUTO         =  ANT_BEH                      ;         
                                                                                
      STYRINGS_OMR.FUNKSJONSKODE         = 'S';                                 
                                                                                
      /* ***************************************************** */               
      /* RESTART-LOGGEN SKRIVES.                                      */        
      /* ***************************************************** */               
                                                                                
                                                                                
      REST_TKNR                       = BLANKETT_RECORD.TKNR;                   
      REST_TRANS_DATO_ÅMD             = BLANKETT_RECORD.TRANS_DATO_ÅMD;         
      REST_TRANS_TID                  = BLANKETT_RECORD.TRANS_TID;              
      REST_FNR                        = BLANKETT_RECORD.FNR;                    
      REST_BLANKETT_TYPE              = BLANKETT_RECORD.BLANKETT_TYPE;          
      REST_REC_NR                     = BLANKETT_RECORD.REC_NR;                 
                                                                                
      EXEC CICS WRITE DATASET ('NORREST')                                       
                      FROM           ( REST_REC ) RIDFLD (REST_RBA) RBA;        
                                                                                
                                                                                
      /* ***************************************************** */               
      /* ENDBROWSE. SYNCPOINT OG INIT PÅ BASENE TAS.                  */        
      /* ***************************************************** */               
                                                                                
                                                                                
      EXEC CICS ENDBR DATASET          ('NORFREG');                             
      EXEC CICS SYNCPOINT;                                                      
      CALL DATABASE               ('OPEN');                                     
                                                                                
                                                                                
      /* ***************************************************** */               
      /* TRYGDEKONTOR-TABELLEN FINNES FOR Å FINNE EDB_SYSTEM          */        
      /* ***************************************************** */               
                                                                                
                                                                                
      IF BLANKETT_RECORD.TKNR            ^= W01_GMLT_TKNR      THEN             
         DO;                                                                    
            KEY_PEKER              = ADDR(BLANKETT_RECORD.TKNR);                
                                                                                
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD (KEY_TKTAB)               
                                               INTO          (TKNRTAB);         
            IF TKNRTAB.INFO_NOR          = 'I'    THEN                          
               SYSTEM_INDEX = 1;                                                
            ELSE                                                                
               SYSTEM_INDEX = 2;                                                
                                                                                
            W01_GMLT_TKNR          = BLANKETT_RECORD.TKNR;                      
         END;                                                                   
                                                                                
                                                                                
      /* ***************************************************** */               
      /* INITIERING FØR BEHANDLINGEN.                                 */        
      /* ***************************************************** */               
                                                                                
                                                                                
      TRANS_OPPL_OMR.FØDSNUMMER           = BLANKETT_RECORD.FNR;                
      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 0;                                     
      TRANS_OPPL_OMR.BLANKETTYPE          =                                     
                                   BLANKETT_RECORD.BLANKETT_TYPE;               
      IF BLANKETT_RECORD.BLANKETT_TYPE = 'U7'         THEN                      
         BLANKETT_RECORD.BLANKETT_TYPE = 'F7' ;                                 
                                                                                
      STYREKODE                         = BLANKETT_RECORD.BLANKETT_TYPE;        
      IF STYREKODE = 'E3' THEN                                                  
         STYREKODE = 'EE';                                                      
      DIV_PARAM_OMR. FEIL_MELD_NR         = 0       ;                           
                                                                                
      DIV_PARAM_OMR. TERMINAL_NR          =                                     
             SUBSTR(DIV_PARAM_OMR.BRUKER_ID,1,4);                               
                                                                                
      DIV_PERIODE = '';                                                         
                                                                                
                                                                                
                                                                                
      POTALL_OPPL                     =  ''           ;                         
      TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '          ;                          
                                                                                
                                                                                
                                                                                
      FEIL_FUNNET                         = '0'B;                               
      FEIL_BLANKETT                       = '0'B;                               
      FEIL_I_BOSATT                       = '0'B;                               
                                                                                
                                                                                
      DO I = 1 TO 3;                                                            
         W01_FEIL_NR(I)                   = 0;                                  
         NOR_REC.MELDNR(I)                = 0;                                  
      END;                                                                      
                                                                                
                                                                                
      /* ***************************************************** */               
      /* STYREKODEN BESTEMMER HVILKET UNDERPROGRAM SOM SKAL           */        
      /* FORETA INPUTKONTROLL                                         */        
      /* ***************************************************** */               
                                                                                
                                                                                
      SELECT (STYREKODE);                                                       
                                                                                
         WHEN ('AP')                                                            
            DO;                                                                 
               AP_MOTTATT(SYSTEM_INDEX) =                                       
                                   AP_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P105_BEHANDLE_AP;            /* R001NO11 */         
            END;                                                                
                                                                                
         WHEN ('A1')                                                            
            DO;                                                                 
               A1_MOTTATT(SYSTEM_INDEX) =                                       
                                   A1_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P105_BEHANDLE_A1;            /* R001NN11 */         
            END;                                                                
                                                                                
         WHEN ('UP')                                                            
            DO;                                                                 
               UP_MOTTATT(SYSTEM_INDEX) =                                       
                                   UP_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P106_BEHANDLE_UP;            /* R001NO12 */         
            END;                                                                
                                                                                
         WHEN ('U2')                                                            
            DO;                                                                 
               U2_MOTTATT(SYSTEM_INDEX) =                                       
                                   U2_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P106_BEHANDLE_U2;        /*   R001NN12  */          
            END;                                                                
                                                                                
         WHEN ('U3')                                                            
            DO;                                                                 
               U3_MOTTATT(SYSTEM_INDEX) =                                       
                                   U3_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P106_BEHANDLE_U3;        /*   R001NU12  */          
            END;                                                                
                                                                                
         WHEN ('EP')                                                            
            DO;                                                                 
               EP_MOTTATT(SYSTEM_INDEX) =                                       
                                   EP_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P108_BEHANDLE_EP;            /* R001NO13 */         
            END;                                                                
                                                                                
         WHEN ('EE')                                                            
            DO;                                                                 
               EE_MOTTATT(SYSTEM_INDEX) =                                       
                                   EE_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P108_BEHANDLE_EE;           /* R001NU13 */          
            END;                                                                
                                                                                
         WHEN ('BP')                                                            
            DO;                                                                 
               BP_MOTTATT(SYSTEM_INDEX) =                                       
                                   BP_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P111_BEHANDLE_BP;            /* R001NO14 */         
            END;                                                                
                                                                                
         WHEN ('B6')                                                            
            DO;                                                                 
               B6_MOTTATT(SYSTEM_INDEX) =                                       
                                   B6_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P111_BEHANDLE_B6;         /*  * R001NN14 */         
            END;                                                                
                                                                                
         WHEN ('FT')                                                            
            DO;                                                                 
               FT_MOTTATT(SYSTEM_INDEX) =                                       
                                   FT_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P112_BEHANDLE_FT;            /* R001NO15 */         
            END;                                                                
                                                                                
         WHEN ('F7')                                                            
            DO;                                                                 
               F7_MOTTATT(SYSTEM_INDEX) =                                       
                                   F7_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P112_BEHANDLE_F7;            /* R001NN15 */         
            END;                                                                
                                                                                
         WHEN ('E1')                                                            
            DO;                                                                 
               E1_MOTTATT(SYSTEM_INDEX) =                                       
                                   E1_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P114_BEHANDLE_E1;            /* R001NO16 */         
            END;                                                                
                                                                                
         WHEN ('EN')                                                            
            DO;                                                                 
               EN_MOTTATT(SYSTEM_INDEX) =                                       
                                   EN_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P114_BEHANDLE_EN;            /* R001NU16 */         
            END;                                                                
                                                                                
         WHEN ('E2')                                                            
            DO;                                                                 
               E2_MOTTATT(SYSTEM_INDEX) =                                       
                                   E2_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P115_BEHANDLE_E2;            /* R001NO19 */         
            END;                                                                
                                                                                
         WHEN ('O1')                                                            
            DO;                                                                 
               O1_MOTTATT(SYSTEM_INDEX) =                                       
                                   O1_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P116_BEHANDLE_O1;            /* R001NO17 */         
            END;                                                                
                                                                                
         WHEN ('O2')                                                            
            DO;                                                                 
               O2_MOTTATT(SYSTEM_INDEX) =                                       
                                   O2_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P117_BEHANDLE_O2;            /* R001NO18 */         
            END;                                                                
                                                                                
         WHEN ('AF')                                                            
            DO;                                                                 
               AFP_MOTTATT(SYSTEM_INDEX) =                                      
                                  AFP_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P119_BEHANDLE_AFP;           /* R001NO1A */         
            END;                                                                
                                                                                
         WHEN ('KF')                                                            
            DO;                                                                 
               KFP_MOTTATT(SYSTEM_INDEX) =                                      
                                  KFP_MOTTATT(SYSTEM_INDEX) + 1;                
               CALL         P119_BEHANDLE_KFP;           /* R001NU1A */         
            END;                                                                
       /* AU = DET ER IKKE ET BLANKET. DET ER EN TRANSTYPE                      
         WHEN ('AU')                                                            
            DO;                                                                 
               AUTO_KJØRING = TRUE;                                             
               CALL         P118_BEHANDLE_AU;               R001NO1B            
            END;                                                                
         FJERNET AV  SATISH   2004.10.04   */                                   
         OTHERWISE                                                              
            DO;                                                                 
               FEIL_FUNNET = TRUE;                                              
               FEIL_BLANKETT = TRUE;                                            
               FEIL_BL_TYPE(SYSTEM_INDEX) =                                     
                                 FEIL_BL_TYPE(SYSTEM_INDEX) + 1;                
            END;                                                                
                                                                                
      END;          /* SELECT */                                                
                                                                                
                                                                                
      IF FEIL_FUNNET         THEN                                               
         CALL P080_FEIL_I_BEH;                                                  
      ELSE                                                                      
         DO;                                                                    
                                                                                
                                                                                
            /* *********************************************** */               
            /* RUTINE SOM SIMULERER PROGRAM R0012001                  */        
            /* RUTINEN TAR UTGANGSPUNKT I STYRINGSKODEN               */        
            /* (BLANKETT REGISTRERT) OG OVERLATER KONTROLL TIL */               
            /* RUTINEN SOM BESTEMMER OM OG EVENTUELT HVORDAN          */        
            /* "BEHANDLE-TRANS" SKAL ANVENDES.                        */        
            /*     'FB','BP','B6',   KAN IKKE AKSEPTERE NY TKNR       */        
            /* *********************************************** */               
                                                                                
           SEARCH_FNR = TRANS_OPPL_OMR.FØDSNUMMER;                              
           SELECT(STYREKODE);                                                   
             WHEN ('AP','A1','UP','U2','U3','EF','E4','FT','F7',                
                   'FO','EP','E3','EE','E1','EN',                               
                   'AF','KF','O1','O2')                                         
               DO;                                                              
                  EXEC CICS LINK PROGRAM('R0012010')                            
                                    COMMAREA(KOM_OMR);                          
               END;                                                             
               OTHERWISE;                                                       
           END; /* END SELECT */                                                
                                                                                
      IF FEIL_MELD_NR > 0            THEN                                       
            CALL P080_FEIL_I_BEH;                                               
      ELSE                                                                      
       DO;  /* FEIL-MELD-NR = 0     */                                          
          SELECT(STYREKODE);                                                    
                                                                                
               WHEN ( 'E2' )                                                    
                  DO;                                                           
                     EXEC CICS LINK PROGRAM         ('R0011520')                
                                    COMMAREA ( KOM_OMR);                        
                  END;                                                          
                                                                                
               WHEN ( 'EP' , 'BP', 'B6', 'EE' )                                 
                  DO;                                                           
                     EXEC CICS LINK PROGRAM         ('R0012201')                
                                    COMMAREA ( KOM_OMR);                        
                  END;                                                          
                                                                                
               WHEN ('AP','A1','UP','U2','U3','E1','EN',                        
                     'O1','O2','FT','F7','AF','KF')                             
                  DO;                                                           
                     /* ************************************** */               
                     /* OPPHØR GRUNNSTØNAD/HJELPESTØNAD SKAL          */        
                     /* BARE TIL STATISTIKK. DISSE HAR                */        
                     /* TRANSTYPE = 68                                */        
                     /* ************************************** */               
                     IF STYREKODE                       = 'O2' &                
                        TRANS_OPPL_OMR.TRANSTYPE =         68  THEN             
                        DO;                                                     
                           EXEC CICS LINK PROGRAM         ('R0016501')          
                                          COMMAREA ( KOM_OMR);                  
                        END;                                                    
                                                                                
                     ELSE                                                       
                        DO;                                                     
                           EXEC CICS LINK PROGRAM         ('R0013001')          
                                          COMMAREA ( KOM_OMR);                  
                        END;                                                    
                                                                                
                  END;                                                          
       /*    STOPET AV SATISH 01032007                                          
               WHEN ( 'AU' )                                                    
                  DO;                                                           
                                                                                
                ** ************************************** **                    
                ** I PROGRAM R0011820 BLIR AUTO-TRANSENS         **             
                ** VIRKNINGSDATO SATT TIL NESTE MÅNED, I         **             
                ** MOTSETNING TIL NÅR AUTO REGISTRERES I         **             
                ** DET VANLIGE REG.-SYSTEMET: DA BLIR            **             
                ** VIRKNINGSDATO SATT TIL INNEVÆRENDE            **             
                ** MÅNED.                                        **             
               /* ************************************** **                     
                                                                                
                     EXEC CICS LINK PROGRAM         ('R0011820')                
                                    COMMAREA ( KOM_OMR);                        
                  END;                                                          
            */                                                                  
               OTHERWISE;                                                       
                                                                                
                                                                                
            END;            /* SLUTT PÅ 'SELECT (STYREKODE)' */                 
       END; /* FEIL-MELD-NR = 0     */                                          
                                                                                
            IF FEIL_MELD_NR > 0            THEN                                 
               CALL P080_FEIL_I_BEH;                                            
            ELSE                                                                
               DO;                                                              
                  PROGRAM_ID = 'R001NO10';                                      
                  S001NO1O.ANT_FERDIG_BEHO =                                    
                               S001NO1O.ANT_FERDIG_BEHO            +  1;        
                                                                                
                  W_ANT_FERDIG_BEH_OPPD = TRUE;                                 
               END;                                                             
                                                                                
         END;                                                                   
                                                                                
      IF INTERVALL_TELL * 10000 <=         ANT_BEH    THEN                      
         CALL P070_SKRIV_LOGG;                                                  
                                                                                
                                                                                
  LES_NESTE:                                                                    
                                                                                
      /* ***************************************************** */               
      /* STARTBROWSE MED SIST LESTE NØKKEL                            */        
      /* ***************************************************** */               
                                                                                
                                                                                
      DATO_HÅMD = BLANKETT_RECORD.TRANS_DATO_ÅMD;                               
      KEY_NORFIL =          BLANKETT_RECORD.TKNR             !!                 
                    'PE'                                     !!                 
                    '01'                                     !!                 
           /*         BLANKETT_RECORD.TRANS_DATO_ÅMD   !!       */              
                     DATO_HÅMD                    !!     /*2000*/               
                     BLANKETT_RECORD.TRANS_TID               !!                 
                     BLANKETT_RECORD.FNR                     !!                 
                     BLANKETT_RECORD.BLANKETT_TYPE           !!                 
                     BLANKETT_RECORD.REC_NR               ;                     
                                                                                
      EXEC CICS STARTBR DATASET ('NORFREG')                                     
                         RIDFLD ( KEY_NORFIL )                     ;            
                                                                                
      EXEC CICS READNEXT DATASET ('NORFREG')                                    
                         INTO           ( BLANKETT_RECORD)                      
                         RIDFLD         ( KEY_NORFIL )     ;                    
                                                                                
                                                                                
      /* ***************************************************** */               
      /* HVIS ANTALL ER STØRRE ENN 1, BLIR NESTE RECORD LEST.         */        
      /* ***************************************************** */               
                                                                                
                                                                                
      IF S001NO1O.ANT_Ø_BEHO > 1                               THEN             
         DO;                                                                    
            EXEC CICS READNEXT DATASET ('NORFREG')                              
                               INTO           ( BLANKETT_RECORD)                
                               RIDFLD         ( KEY_NORFIL) ;                   
                                                                                
         END;                                                                   
                                                                                
      GOTO READ_OK;                                                             
                                                                                
                                                                                
  NOTFOUND2:                                                                    
      MELDING             = 'OPPGITT NØKKEL FINNES IKKE';                       
      CALL P040_MAP_UT_OG_RETUR;                                                
                                                                                
                                                                                
  ENDINP:                                                                       
      EOF_NORFILE                =  TRUE;                                       
                                                                                
      IF ANT_BEH                    =  0           THEN                         
        DO;  /* ANT_BEH = 0 */                                                  
         IF BLANKETT_RECORD.FNR = 00000000000 THEN                              
            DO;                                                                 
                                                                                
                                                                                
               /* ***************************************** */                  
               /* INPUT-FILEN INNEHOLDT BARE DUMMY-RECORD          */           
               /* ***************************************** */                  
                                                                                
                                                                                
               MELDING           = 'INPUT-FILEN ER TOM';                        
               CALL P040_MAP_UT_OG_RETUR;                                       
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
                                                                                
                                                                                
               /* ***************************************** */                  
               /* INGEN RECORD BEHANDLET, DET OPPGITTE             */           
               /* STARTFNR VAR DEN SISTE RECORD PÅ FILEN           */           
               /* ***************************************** */                  
                                                                                
                                                                                
               S001NO1O.ANT_Ø_BEHA = BRI_PROT_MDT                     ;         
               S001NO1O.STOPP_TIDA = BRI_PROT_MDT                     ;         
               S001NO1O.START_TIDO = EIBTIME / 100                    ;         
                                                                                
               MELDING            =  'SISTE FNR PÅ FILEN ER FNR : ' !!          
                             BLANKETT_RECORD.FNR !!                             
                            '    TRYKK ENTER   !!';                             
               CALL P040_MAP_UT_OG_RETUR;                                       
            END;                                                                
        END; /* ANT_BEH = 0 */                                                  
                                                                                
  READ_OK:                                                                      
                                                                                
       IF FEIL_TALL   > 20  THEN                                                
                EOF_NORFILE = '1'B;                                             
   END; /* ANT_BEH = 1 TO S001NO1O.ANT_Ø_BEHO   */                              
                                                                                
  L999:                                                                         
          CALL P999_SLUTT ;                                                     
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*           I N T E R N E     P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* INITIERER PEKERE OG FELTER.  LESER INN GRUNNBELØP VED CALL TIL    */        
 /* P9956_BER_B_CICS (R0019956)                                       */        
 /* ***************************************************************** */        
 P010_INITIERING:                                                               
      PROC;                                                                     
                                                                                
          KOM_OMR.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR);               
          KOM_OMR.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR);                  
          KOM_OMR.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR);             
          KOM_OMR.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR);              
          KOM_OMR.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);            
          BLANKETT_PEKER            = ADDR(BLANKETT_RECORD.BLANKETT);           
          ATK_KOM_PTR               =  ADDR(KOM_OMR.ATK_COM_OMR);               
          ALLOCATE                   PCB_UIB_PEKER_OMR;                         
          ALLOCATE                   GV_TAB_RE    ;                             
          ALLOCATE                   G_TAB_RE     ;                             
          ALLOCATE                   POTALL_OPPL  ;                             
          KOM_OMR.GV_PEKER         = ADDR (GRUNN_OMR1 ) ;                       
          KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2 ) ;                       
          GV_TAB_RE                =  ''           ;                            
          G_TAB_RE                 =  ''           ;                            
          POTALL_OPPL              =  ''           ;                            
                                                                                
          START_TID           = EIBTIME                               ;         
          FORRIGE_TID         = EIBTIME                               ;         
          TID_UTE             = ' @  '             ;/* X'40008000'  */          
                                                                                
          TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '   ;                             
          TRANS_OPPL_OMR.FØDSNUMMER       =  0    ;                             
          TRANS_OPPL_OMR.BLANKETTYPE      = '  '  ;                             
          DIV_PARAM_OMR. FEIL_MELD_NR     =  0    ;                             
          DIV_PARAM_OMR. KJØRINGS_TYPE    = 'N'   ;                             
                                                                                
          GRUNN_IDENT                     = 'P0019924';                         
                                                                                
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                        
                                                                                
          GRUNN_IDENT                     = 'P0019925';                         
                                                                                
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                        
                                                                                
                                                                                
    END P010_INITIERING;                                                        
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* INITIERER PEKERE OG FELTER.  LESER INN GRUNNBELØP VED CALL TIL    */        
 /* P9956_BER_B_CICS (R0019956)                                       */        
 /* ***************************************************************** */        
 P020_LES_LOGG:                                                                 
      PROC;                                                                     
                                                                                
          EXEC CICS HANDLE CONDITION NOTFND  (NOTFND)                           
                                     ENDFILE (NOTFND);                          
          EXEC CICS STARTBR  DATASET ('NORLOGG')                                
                             RIDFLD  ( LOGG_RBA) RBA;                           
                                                                                
          DO WHILE ('A' = 'A');                                                 
             EXEC CICS READNEXT DATASET ('NORLOGG')                             
                                RIDFLD  ( LOGG_RBA) RBA                         
                                SET     ( BMSMAPBR);                            
          END;                                                                  
                                                                                
                                                                                
  NOTFND:                                                                       
          IF S001NO1O.FNRO                    =  99999999999 THEN               
             DO;                                                                
                MAP_CHAR                      =  LOW (250);                     
                S001NO1O.TKNRO                =  0;                             
                S001NO1O.FNRO                 =  0;                             
                S001NO1O.BLANKETT_TYPEO       =  '  ';                          
                S001NO1O.REC_NRO              =  '00';                          
                S001NO1O.TRANS_DATOO          =  0;                             
                S001NO1O.TRANS_TIDO           =  0;                             
                S001NO1O.ANT_FERDIG_BEHO      =  0;                             
                S001NO1O.ANT_AVVISTO          =  0;                             
                S001NO1O.ANT_FEILM_TKO        =  0;                             
                S001NO1O.MELDINGO             = 'HER ER ALT I ORDEN FOR'        
           !!' OPPSTART FRA BEGYNNELSEN AV INN-FILEN  ' !! DATO_2000;           
                                                                                
                EXEC CICS WRITE DATASET('NORLOGG') FROM   ( MAP_CHAR )          
                                             RIDFLD ( LOGG_RBA ) RBA;           
             END;                                                               
                                                                                
          ELSE IF S001NO1O.RECORD_TYPEO      ^= 'S' THEN                        
             DO;                                                                
                                                                                
                                                                                
                /* ************************************************** */        
                /* RESTART-LOGGEN LESES FOR Å FINNE SISTE BEHANDLEDE  */        
                /* RECORD.  PÅ BILDET GIS DET BESKJED OM Å TA         */        
                /* HARDCOPY.  DERETTER STARTER BEHANDLINGEN PÅ NESTE  */        
                /* PERSON.                                            */        
                /* ************************************************** */        
                                                                                
                                                                                
                EXEC CICS HANDLE CONDITION NOTFND (NOTFND2)                     
                                           ENDFILE (NOTFND2);                   
                EXEC CICS STARTBR DATASET ('NORREST')                           
                                   RIDFLD ( REST_RBA) RBA;                      
                                                                                
                DO WHILE ('A' = 'A');                                           
                   EXEC CICS READNEXT DATASET ('NORREST')                       
                                      RIDFLD  ( REST_RBA) RBA                   
                                      INTO    ( REST_REC);                      
                END;                                                            
                                                                                
                                                                                
  NOTFND2:                                                                      
                S001NO1I.TKNRI                = REST_TKNR          ;            
                S001NO1I.FNRI                 = REST_FNR           ;            
                S001NO1I.BLANKETT_TYPEI       = REST_BLANKETT_TYPE ;            
                S001NO1I.REC_NRI              = REST_REC_NR        ;            
                S001NO1I.TRANS_DATOI                                            
                  = KONV_HÅMD_ÅMD(REST_TRANS_DATO_ÅMD); /*2000*/                
                S001NO1I.TRANS_TIDI           = REST_TRANS_TID     ;            
                                                                                
                S001NO1O.TKNRA                = BRI_NUM_MDT;                    
                S001NO1O.FNRA                 = BRI_NUM_MDT;                    
                S001NO1O.BLANKETT_TYPEA       = 'A'        ;                    
                S001NO1O.REC_NRA              = BRI_NUM_MDT;                    
                S001NO1O.TRANS_DATOA          = BRI_NUM_MDT;                    
                S001NO1O.TRANS_TIDA           = BRI_NUM_MDT;                    
                S001NO1O.STOPP_TIDA           = BRI_NUM_MDT;                    
                S001NO1I.STOPP_TIDI           = LOW (4)    ;                    
                S001NO1I.ANT_Ø_BEHI           = LOW (8)    ;                    
                S001NO1O.ANT_Ø_BEHA           = BRI_NUM_MDT;                    
                S001NO1I.ANT_Ø_BEHL           = -1         ;                    
                S001NO1I.ANT_REC_INPUTI       = LOW (7)    ;                    
                S001NO1I.ANT_FERDIG_BEHI      = LOW (7)    ;                    
                S001NO1I.ANT_AVVISTI          = LOW (7)    ;                    
                S001NO1I.ANT_FEILM_TKI        = LOW (7)    ;                    
                S001NO1O.ANT_FERDIG_BEHO      = 0          ;                    
                S001NO1O.ANT_AVVISTO          = 0          ;                    
                S001NO1O.ANT_FEILM_TKO        = 0          ;                    
                S001NO1O.MELDINGO             = 'OBS HER HAR DET VÆRT'!!        
     ' UKONTROLLERT BRUDD !! TA HARD-COPY FØR NY START !!' !! DATO_2000;        
                 EXEC CICS WRITE DATASET('NORLOGG') FROM   ( MAP_CHAR )         
                                             RIDFLD ( LOGG_RBA ) RBA;           
             END;                                                               
                                                                                
          ELSE /* S001NO1O.RECORD_TYPEO = 'S' */                                
             DO;                                                                
                S001NO1O.TKNRA                = BRI_NUM_MDT;                    
                S001NO1O.FNRA                 = BRI_NUM_MDT;                    
                S001NO1O.BLANKETT_TYPEA       = 'A'        ;                    
                S001NO1O.REC_NRA              = BRI_NUM_MDT;                    
                S001NO1O.TRANS_DATOA          = BRI_NUM_MDT;                    
                S001NO1O.TRANS_TIDA           = BRI_NUM_MDT;                    
                S001NO1O.STOPP_TIDA           = BRI_NUM_MDT;                    
                S001NO1I.STOPP_TIDI           = LOW (4)    ;                    
                S001NO1I.ANT_Ø_BEHL           = -1         ;                    
                S001NO1I.ANT_Ø_BEHI           = LOW (8)    ;                    
                S001NO1O.ANT_Ø_BEHA           = BRI_NUM_MDT;                    
                S001NO1I.ANT_REC_INPUTI       = LOW (7)    ;                    
                S001NO1I.ANT_FERDIG_BEHI      = LOW (7)    ;                    
                S001NO1I.ANT_AVVISTI          = LOW (7)    ;                    
                S001NO1I.ANT_FEILM_TKI        = LOW (7)    ;                    
                S001NO1O.MELDINGO             =                                 
                  'HER ER ALT I ORDEN FOR OPPSTART' !! DATO_2000;               
                 EXEC CICS WRITE DATASET('NORLOGG') FROM   ( MAP_CHAR )         
                                             RIDFLD ( LOGG_RBA ) RBA;           
             END;                                                               
                                                                                
                                                                                
    END P020_LES_LOGG;                                                          
                                                                                
 /* ***************************************************************** */        
 /* SENDER UT MAPEN OG RETURNERER TIL R001NO10                        */        
 /* ***************************************************************** */        
 P040_MAP_UT_OG_RETUR:                                                          
      PROC;                                                                     
                                                                                
          S001NO1O.MELDINGO     =   MELDING;                                    
          S001NO1O.CICS_INFOO       =  CICS_NAVN;                               
          EXEC CICS SEND  MAP      ('S001NO1') MAPSET   ('S001NO3')             
                                               DATAONLY   CURSOR  ;             
          EXEC CICS RETURN TRANSID ('RNO1' )   COMMAREA ( KOM_OMR ) ;           
                                                                                
                                                                                
    END P040_MAP_UT_OG_RETUR;                                                   
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* SKRIVER FEILRECORDEN UT PÅ VSAM-FILEN NORFEIL.  DENNE BLIR SENERE */        
 /* SENDT OVER LINJE TIL TRYGDEKONTORET SOM HAR REGISTRERT TRANSAK-   */        
 /* SJONEN MED FEIL.                                                  */        
 /* ***************************************************************** */        
 P050_SKRIV_NORFEIL:                                                            
      PROC;                                                                     
          FEIL_MELD_NR    =    0;                                               
          EXEC CICS HANDLE CONDITION ERROR   (P060_S999);                       
          EXEC CICS WRITE DATASET ('NORFEIL')                                   
                    FROM    ( FEIL_REC ) RIDFLD (FEIL_RBA) RBA;                 
                                                                                
          S001NO1O.ANT_FEILM_TKO = S001NO1O.ANT_FEILM_TKO + 1;                  
                                                                                
    P050_S999:                                                                  
          EXEC CICS HANDLE CONDITION ERROR   (P060_S999);                       
          CALL SKRIV_NOR_REG;                                                   
                                                                                
    P060_S999:                                                                  
    END P050_SKRIV_NORFEIL;                                                     
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* KONTROLLERER OM START-OPPLYSNINGENE PÅ MAPEN ER RIKTIG UTFYLT.    */        
 /* ***************************************************************** */        
 P060_INPUTKONTROLL_MAP:                                                        
      PROC;                                                                     
                                                                                
          KJØRE_SLUTT_TID_CHAR   = S001NO1I.STOPP_TIDI;                         
          TRANS_TID_CHAR         = S001NO1I.TRANS_TIDI;                         
                                                                                
                                                                                
          IF S001NO1O.FNRO > 0 THEN                                             
             DO;                                                                
                                                                                
                IF ^ F_NUMERISK((S001NO1I.FNRI)) THEN                           
                   DO;                                                          
                      S001NO1I.FNRL = -1;                                       
                      MELDING =                                                 
                         'TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';        
                   END;                                                         
                                                                                
                ELSE IF                                                         
                     ^ F_GYLDIG_FNR(S001NO1O.FNRO)  &                           
                          S001NO1O.FNRO > 0           THEN                      
                   DO;                                                          
                      S001NO1I.FNRL = -1;                                       
                      MELDING = 'UGYLDIG FØDSELSNUMMER ';                       
                   END;                                                         
                                                                                
                ELSE IF ^ F_NUMERISK((S001NO1I.TKNRI)) THEN                     
                   DO;                                                          
                      S001NO1I.TKNRL = -1;                                      
                      MELDING =                                                 
                             'TEGN SOM IKKE ER TALL I TKNUMMER - FELT';         
                   END;                                                         
                                                                                
                ELSE IF ^ (S001NO1I.BLANKETT_TYPEI = 'AP' !                     
                           S001NO1I.BLANKETT_TYPEI = 'A1' !                     
                           S001NO1I.BLANKETT_TYPEI = 'UP' !                     
                           S001NO1I.BLANKETT_TYPEI = 'U2' !                     
                           S001NO1I.BLANKETT_TYPEI = 'U3' !                     
                           S001NO1I.BLANKETT_TYPEI = 'EP' !                     
                           S001NO1I.BLANKETT_TYPEI = 'EE' !                     
                           S001NO1I.BLANKETT_TYPEI = 'BP' !                     
                           S001NO1I.BLANKETT_TYPEI = 'B6' !                     
                           S001NO1I.BLANKETT_TYPEI = 'FT' !                     
                           S001NO1I.BLANKETT_TYPEI = 'F7' !                     
                           S001NO1I.BLANKETT_TYPEI = 'E1' !                     
                           S001NO1I.BLANKETT_TYPEI = 'EN' !                     
                           S001NO1I.BLANKETT_TYPEI = 'E2' !                     
                           S001NO1I.BLANKETT_TYPEI = 'O1' !                     
                           S001NO1I.BLANKETT_TYPEI = 'O2' !                     
                           S001NO1I.BLANKETT_TYPEI = 'AF' !                     
                           S001NO1I.BLANKETT_TYPEI = 'KF' !                     
                           S001NO1I.BLANKETT_TYPEI = 'AU' ) THEN                
                   DO;                                                          
                      S001NO1I.BLANKETT_TYPEL = -1;                             
                      MELDING ='UGYLDIG KODE FOR BLANKETT - TYPE';              
                   END;                                                         
                                                                                
                ELSE IF ^ F_NUMERISK((S001NO1I.TRANS_DATOI)) THEN               
                   DO;                                                          
                      S001NO1I.TRANS_DATOL = -1;                                
                      MELDING =                                                 
                           'TEGN SOM IKKE ER TALL I TRANS-DATO - FELT';         
                   END;                                                         
                                                                                
                ELSE IF ^ F_NUMERISK((S001NO1I.REC_NRI)) THEN                   
                   DO;                                                          
                      S001NO1I.REC_NRL = -1;                                    
                      MELDING =                                                 
                           'TEGN SOM IKKE ER TALL I REC-NR - FELT';             
                   END;                                                         
                                                                                
                ELSE IF ^ F_GYLDIG_DATO                    /*2000*/             
                               (S001NO1I.TRANS_DATOI)   THEN                    
                   DO;                                                          
                      S001NO1I.TRANS_DATOL = -1;                                
                      MELDING = 'UGYLDIG DATO  -  TRANS - DATO';                
                   END;                                                         
                                                                                
                ELSE IF ^ F_NUMERISK((S001NO1I.TRANS_TIDI)) THEN                
                   DO;                                                          
                      S001NO1I.TRANS_TIDL = -1;                                 
                      MELDING = 'TEGN SOM IKKE ER TALL I TIDS - FELT';          
                   END;                                                         
                                                                                
        /*      ELSE IF TRANS_TID_MIN > 59 THEN                                 
         *         DO;                                                          
         *            S001NO1I.TRANS_TIDL = -1;                                 
         *            MELDING = 'URIKTIG TIDSANGIVELSE';                        
         *         END;                                                         
         */                                                                     
             END;                                                               
                                                                                
          IF ^ F_NUMERISK((S001NO1I.ANT_Ø_BEHI)) THEN                           
             DO;                                                                
                S001NO1I.ANT_Ø_BEHL = -1;                                       
                MELDING = 'TEGN SOM IKKE ER TALL I ANTALL - FELT';              
             END;                                                               
                                                                                
          ELSE IF S001NO1O.ANT_Ø_BEHO = 1 & S001NO1I.FNRI = 0 THEN              
             DO;                                                                
                S001NO1I.ANT_Ø_BEHL = -1;                                       
                MELDING      = 'FEIL KOMBINASJON - KJØRE-ANTALL ='!!            
                                     ' 1 OG FNR = 0';                           
             END;                                                               
                                                                                
          ELSE IF ^ F_NUMERISK((S001NO1I.STOPP_TIDI)) THEN                      
             DO;                                                                
                S001NO1I.STOPP_TIDL = -1;                                       
                MELDING = 'TEGN SOM IKKE ER TALL I TIDS - FELT';                
             END;                                                               
                                                                                
          ELSE IF KJØRE_SLUTT_MIN > 59 THEN                                     
             DO;                                                                
                S001NO1I.STOPP_TIDL = -1;                                       
                MELDING       = 'URIKTIG TIDSANGIVELSE';                        
             END;                                                               
                                                                                
          ELSE                                                                  
             DO;                                                                
                KJØRE_SLUTT_TID_DEC = S001NO1O.STOPP_TIDO * 100;                
                EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC)                     
                                 SET  (TIDS_PEKER);                             
                EXEC CICS HANDLE CONDITION EXPIRED(EXPIRED);                    
                EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC)                     
                                 SET  (TIDS_PEKER);                             
                LEAVE;                                                          
  EXPIRED:                                                                      
                S001NO1I.STOPP_TIDL = -1;                                       
                MELDING = 'TIDSANGIVELSEN STOPPER TASKEN, '   !!                
                               'DEN ER MULIGENS FØR NÅ - TIDSPUNKT' ;           
             END;                                                               
                                                                                
                                                                                
    END P060_INPUTKONTROLL_MAP;                                                 
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* PROCEDYRE SOM SKRIVER PÅ LOGGEN FOR HVER 10000 RECORD.  DENNE VIL */        
 /* I PRAKSIS ALDRI BLI KALT FORDI SÅ MANGE RECORDER IKKE VIL BLI     */        
 /* OVERFØRT PÅ EN DAG.                                               */        
 /* ***************************************************************** */        
 P070_SKRIV_LOGG:                                                               
      PROC;                                                                     
                                                                                
                                                                                
          EXEC CICS ASKTIME;                                                    
          NÅ_TID                        = EIBTIME;                              
          S001NO1O.KLOKKE_LOGO          = EIBTIME / 100;                        
          S001NO1I.DATO_LOGI        =  KONV_HÅMD_ÅMD(DATO_2000);                
                                                                                
          DIFFERANSE                    = NÅ_TID_TIM * 60 + NÅ_TID_MIN -        
                                FORRIGE_TID_TIM * 60 - FORRIGE_TID_MIN ;        
                                                                                
          S001NO1O.CICS_INFOO       =  CICS_NAVN;                               
          S001NO1O.MELDINGO             =                                       
                                       'MIN SISTE 10000 ER KJØRT PÅ: '          
                                    !! DIFFERANSE !! ',ANT:'!! ANT_BEH          
                                    !! ' ' !! BLANKETT_RECORD.FNR ;             
                                                                                
          EXEC CICS SEND  MAP     ('S001NO1') MAPSET ('S001NO3')                
                                              WAIT     DATAONLY;                
                                                                                
          S001NO1O.ANT_REC_INPUTO            = 0;                               
          S001NO1O.ANT_FERDIG_BEHO           = 0;                               
          S001NO1O.ANT_AVVISTO               = 0;                               
          S001NO1O.ANT_FEILM_TKO             = 0;                               
          INTERVALL_TELL                     = INTERVALL_TELL + 1;              
          FORRIGE_TID                        = NÅ_TID;                          
                                                                                
                                                                                
    END P070_SKRIV_LOGG;                                                        
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* FEILBEHANDLING.                                                   */        
 /* VED FEIL I BEHANDLINGEN BLIR FØRST EVENTUELLE OPPDATERINGER       */        
 /* SLETTET.  DERETTER BLIR DET BYGD OPP EN FEIL-MELDING.             */        
 /* ***************************************************************** */        
 P080_FEIL_I_BEH:                                                               
      PROC;                                                                     
                                                                                
                                                                                
   /* ******************************************************* */                
   /* TELLERE FOR ANTALL AVVISTE OPPDATERES                          */         
   /* *********************************************************/                
                                                                                
                                                                                
   S001NO1O.ANT_AVVISTO = S001NO1O.ANT_AVVISTO + 1;                             
                                                                                
   SELECT (STYREKODE);                                                          
      WHEN ('AP')                                                               
         AP_AVVIST(SYSTEM_INDEX) = AP_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('A1')                                                               
         A1_AVVIST(SYSTEM_INDEX) = A1_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('UP')                                                               
         UP_AVVIST(SYSTEM_INDEX) = UP_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('U2')                                                               
         U2_AVVIST(SYSTEM_INDEX) = U2_AVVIST(SYSTEM_INDEX) + 1;                 
                                                                                
      WHEN ('U3')                                                               
         U3_AVVIST(SYSTEM_INDEX) = U3_AVVIST(SYSTEM_INDEX) + 1;                 
                                                                                
      WHEN ('EP')                                                               
         EP_AVVIST(SYSTEM_INDEX) = EP_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('EE')                                                               
         EE_AVVIST(SYSTEM_INDEX) = EE_AVVIST(SYSTEM_INDEX) + 1;                 
                                                                                
      WHEN ('BP')                                                               
         BP_AVVIST(SYSTEM_INDEX) = BP_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('B6')                                                               
         B6_AVVIST(SYSTEM_INDEX) = B6_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('FT')                                                               
         FT_AVVIST(SYSTEM_INDEX) = FT_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('F7')                                                               
         F7_AVVIST(SYSTEM_INDEX) = F7_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('E1')                                                               
         E1_AVVIST(SYSTEM_INDEX) = E1_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('EN')                                                               
         EN_AVVIST(SYSTEM_INDEX) = EN_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('E2')                                                               
         E2_AVVIST(SYSTEM_INDEX) = E2_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('O1')                                                               
         O1_AVVIST(SYSTEM_INDEX) = O1_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('O2')                                                               
         O2_AVVIST(SYSTEM_INDEX) = O2_AVVIST(SYSTEM_INDEX) + 1;                 
      WHEN ('AF')                                                               
         AFP_AVVIST(SYSTEM_INDEX) = AFP_AVVIST(SYSTEM_INDEX) + 1;               
      WHEN ('KF')                                                               
         KFP_AVVIST(SYSTEM_INDEX) = KFP_AVVIST(SYSTEM_INDEX) + 1;               
      OTHERWISE;                                                                
                                                                                
   END;             /* SELECT */                                                
                                                                                
                                                                                
   EXEC CICS SYNCPOINT ROLLBACK;                                                
                                                                                
                                                                                
   /* ******************************************************* */                
   /* DERSOM FEIL-MELD-NR = 9999 KAN DET SKYLDES EN ABEND I          */         
   /* R0013001 ELLER FATAL FEIL I R0011820.                          */         
   /* *********************************************************/                
                                                                                
                                                                                
   IF FEIL_MELD_NR = 9999             THEN                                      
      DO;                                                                       
         INGEN_FEIL = FALSE;                                                    
         FEIL_MELD_NR = 0;                                                      
         MELDING = 'STOPP ! FEIL 9999 KEY:'                   !!                
                    BLANKETT_RECORD.TKNR                  !! ' ' !!             
                    BLANKETT_RECORD.FNR                   !! ' ' !!             
                    BLANKETT_RECORD.TRANS_DATO_ÅMD !! ' ' !!                    
                    BLANKETT_RECORD.TRANS_TID             !! ' ' !!             
                    BLANKETT_RECORD.BLANKETT_TYPE         !! ' ' !!             
                    BLANKETT_RECORD.REC_NR                !!                    
                   ' TA HARD-COPY! TRYKK ENTER!';                               
                                                                                
   FEIL_TALL   = FEIL_TALL  + 1;                                                
                                                                                
   IF W_FNR =  BLANKETT_RECORD.FNR   THEN                                       
          FEIL_LOOP   = FEIL_LOOP + 1;                                          
   ELSE                                                                         
      W_FNR =  BLANKETT_RECORD.FNR;                                             
                                                                                
       IF FEIL_LOOP   > 20  THEN                                                
          DO;                                                                   
            S001NO1O.MELDINGO =                                                 
                 '***************************************************';         
            EXEC CICS WRITE DATASET ('NORLOGG') FROM   ( MAP_CHAR)              
                                RIDFLD ( LOGG_RBA)  RBA;                        
            S001NO1O.MELDINGO =                                                 
               'BEHANDING I LOOP KONTAKT SYSTEM AVD/ IKKE KJØRE JOBB.';         
                                                                                
            EXEC CICS WRITE DATASET ('NORLOGG') FROM   ( MAP_CHAR)              
                                RIDFLD ( LOGG_RBA)  RBA;                        
                                                                                
            EXEC CICS SEND  MAP     ('S001NO1') MAPSET ('S001NO3')              
                                              WAIT     DATAONLY;                
                                                                                
            S001NO1O.MELDINGO =                                                 
                 '***************************************************';         
            EXEC CICS WRITE DATASET ('NORLOGG') FROM   ( MAP_CHAR)              
                                RIDFLD ( LOGG_RBA)  RBA;                        
                                                                                
              EOF_NORFILE = '1'B;                                               
              CALL P999_SLUTT ;                                                 
                                                                                
           END;                                                                 
 /*       BY STOPPING P999_SLUTT    PROGRAM WILL GO IN LOOP AND                 
   WILL COMPLETE THE TOTAL PROCCESS FOR ALL THE PERSON          */              
    /*          CALL P999_SLUTT ; */                                            
                                                                                
      END;                                                                      
                                                                                
                                                                                
   /* ******************************************************* */                
   /* FEILRECORDEN BLANKES, OG FYLLES UT.                            */         
   /* *********************************************************/                
                                                                                
                                                                                
   EXEC CICS ASKTIME;                                                           
                                                                                
   FEIL_REC                            =  '';                                   
   FEIL_REC.HODE_TKNR                  =  BLANKETT_RECORD.TKNR;                 
                                                                                
   FEIL_REC.HODE_RECORD_TYPE           = 'PE';                                  
   FEIL_REC.HODE_TRANS_TYPE            = '04';                                  
   FEIL_REC.HODE_TRANS_DATO_ÅMD =         DATO_2000;   /*2000*/                 
   FEIL_REC.HODE_TRANS_TID             =  EIBTIME / 100;                        
   FEIL_REC.TKNR                       = BLANKETT_RECORD.TKNR;                  
   FEIL_REC.RECORD_TYPE                = BLANKETT_RECORD.RECORD_TYPE;           
   FEIL_REC.TRANS_TYPE                 = BLANKETT_RECORD.TRANS_TYPE;            
   FEIL_REC.TRANS_DATO_ÅMD             = BLANKETT_RECORD.TRANS_DATO_ÅMD;        
   FEIL_REC.TRANS_TID                  = BLANKETT_RECORD.TRANS_TID;             
   FEIL_REC.FNR                        = BLANKETT_RECORD.FNR;                   
   FEIL_REC.BL_TYPE                    = BLANKETT_RECORD.BLANKETT_TYPE;         
   FEIL_REC.NAVN                       = BLANKETT_RECORD.NAVN;                  
                                                                                
   SELECT(BLANKETT_RECORD.BLANKETT_TYPE);                                       
      WHEN ('AP')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = AP_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('A1')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = A1_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('UP')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = UP_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('U2')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = U2_BLANKETT.VIRK_DATO_ÅMD;                    
                                                                                
      WHEN ('U3')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = U3_BLANKETT.VIRK_DATO_ÅMD;                    
                                                                                
      WHEN ('EP')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = EP_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('EE')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = EE_BLANKETT.VIRK_DATO_ÅMD;                    
                                                                                
      WHEN ('BP')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = BP_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('B6')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = B6_BLANKETT.VIRK_DATO_ÅMD;                    
                                                                                
      WHEN ('FT')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = FT_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('F7')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = F7_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('E1')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = E1_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('EN')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = EN_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('O2')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = O2_BLANKETT.VIRK_DATO_ÅMD;                    
      WHEN ('AF')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = AFP_BLANKETT.VIRK_DATO_ÅMD;                   
      WHEN ('KF')                                                               
         FEIL_REC.VIRK_DATO_ÅMD = KFP_BLANKETT.VIRK_DATO_ÅMD;                   
      OTHERWISE;                                                                
   END;                                                                         
                                                                                
   CALL DATABASE ('OPEN');                                                      
                                                                                
                                                                                
   /* ******************************************************* */                
   /* HVIS FEIL_BLANKETT, ELLER FEIL_I_BOSATT, ER FEILEN             */         
   /* FUNNET AV DETTE PROGRAMMET.         EGEN FEILMELDINGSTEKST     */         
   /* SKRIVES.                                                       */         
   /* *********************************************************/                
                                                                                
                                                                                
   IF FEIL_BLANKETT THEN                                                        
      DO;                                                                       
         FEIL_REC.FEIL_MELD(1) = '     FEIL BLANKETT_TYPE : ' !!                
                                  FEIL_REC.BL_TYPE                   !!         
                                  '.'         ;                                 
         FEIL_BLANKETT                = '0'B;                                   
      END;                                                                      
                                                                                
   ELSE                                                                         
      IF FEIL_I_BOSATT THEN                                                     
         DO;                                                                    
            FEIL_REC.FEIL_MELD(1) = '     IKKE NORSK BOSATT -' !!               
                                    ' SEND GRUNN-BLANKETT'            !!        
                                    ' TIL RTV.';                                
            FEIL_I_BOSATT = '0'B;                                               
         END;                                                                   
                                                                                
      ELSE                                                                      
         DO;                                                                    
                                                                                
           FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                           
                                                                                
                                                                                
           /* *********************************************** */                
           /* DERSOM FEIL_FUNNET ER SATT, ER FEILEN FUNNET           */         
           /* I ET AV BLANKETT-KONTROLL-PROGRAMMENE, OG              */         
           /* FEIL_NR HENTES FRA EN HJELPETABELL.                    */         
           /* HVIS IKKE SETTES FEIL_NR LIK FEIL_MELD_NR.             */         
           /* PROGRAM R0019921 LINKES FOR Å FINNE FEIL-              */         
           /* MELDINGS-TEKSTEN.                                      */         
           /* *********************************************** */                
                                                                                
                                                                                
           IF DIV_PARAM_OMR.FEIL_MELD_NR ^= 0          THEN                     
              W01_FEIL_NR(1) = DIV_PARAM_OMR.FEIL_MELD_NR;                      
                                                                                
                                                                                
            DO I = 1 TO 3 WHILE (W01_FEIL_NR(I) ^= 0);                          
                                                                                
                NOR_REC.MELDNR (I)         = W01_FEIL_NR(I);                    
                /* OPPDATE FEILMELDNR FOR NOR_REG             */                
               /* ******************************************* */                
               /* NOEN AV TEKSTENE I VÅRE FEILMELDINGER SKAL         */         
               /* ERSTATTES MED ANDRE TEKSTER.         FEILMELDINGS- */         
               /* NUMMERET SKAL BEHOLDES.         ANDRE MELDINGER    */         
               /* SKAL HA EN TILLEGGS-TEKST, SOM LEGGES PÅ           */         
               /* PLASS NR. 2 I FEIL-TABELLEN.                       */         
               /* *********************************************/                
                                                                                
               SELECT (W01_FEIL_NR(I));                                         
                                                                                
                  WHEN (210,495,497,498,500,501,1710,1802,1901,                 
                                                     1902,1903)                 
                     DO;                                                        
                                                                                
                        /* ********************************** */                
                        /* MELDING:                                  */         
                        /* SYSTEMFEIL, SEND GRUNNBLANKETT TIL */                
                        /* RTV.                                      */         
                        /* ************************************/                
                                                                                
                        FEIL_STRUC.FEIL_NR = 1990;                              
                        W_ERSTATT_FEILTEKST = TRUE;                             
                     END;                                                       
                                                                                
                  WHEN (211,212,217,499,503,504,505,1904)                       
                     DO;                                                        
                                                                                
                        /* ********************************** */                
                        /* MELDING:                                  */         
                        /* SYSTEMFEIL, PRØV PÅ NYTT ELLER            */         
                        /* SEND GRUNNBLANKETT TIL RTV.               */         
                        /* ************************************/                
                                                                                
                        FEIL_STRUC.FEIL_NR = 1991;                              
                        W_ERSTATT_FEILTEKST = TRUE;                             
                     END;                                                       
                                                                                
                  WHEN (213,215,216,225,226,227,502,601,602,1202,               
                                                       1609,1703)               
                     DO;                                                        
                                                                                
                        /* ********************************** */                
                        /* MELDING:                                  */         
                        /* SEND GRUNNBLANKETT TIL RTV.               */         
                        /* ************************************/                
                                                                                
                        FEIL_STRUC.FEIL_NR = 1992;                              
                        W_ERSTATT_FEILTEKST = TRUE;                             
                     END;                                                       
                                                                                
                  WHEN (1008)                                                   
                     DO;                                                        
                                                                                
                        /* ********************************** */                
                        /* ERSTATTES MED                             */         
                        /* GIFTEMÅLSMELDING FOR EKTEFELLE MÅ         */         
                        /* REGISTRERES.                              */         
                        /* ************************************/                
                                                                                
                        FEIL_STRUC.FEIL_NR = 1995;                              
                        W_ERSTATT_FEILTEKST = TRUE;                             
                     END;                                                       
                                                                                
                  WHEN (270,1704,1719)                                          
                     DO;                                                        
                                                                                
                        /* ********************************** */                
                        /* TILLEGGS-TEKST:                           */         
                        /* TA KONTAKT MED REG.SEKSJ., RTV.           */         
                        /* ************************************/                
                                                                                
                        W01_FEIL_NR(2)            = 1994;                       
                        FEIL_STRUC.FEIL_NR = W01_FEIL_NR(I);                    
                     END;                                                       
                                                                                
                  WHEN (1711)                                                   
                     DO;                                                        
                                                                                
                        /* ********************************** */                
                        /* TILLEGGS-TEKST:                           */         
                        /* SEND GRUNNBLANKETT TIL RTV.               */         
                        /* ************************************/                
                                                                                
                        W01_FEIL_NR(2)            = 1992;                       
                        FEIL_STRUC.FEIL_NR = W01_FEIL_NR(I);                    
                     END;                                                       
                                                                                
                  OTHERWISE                                                     
                     FEIL_STRUC.FEIL_NR = W01_FEIL_NR(I);                       
                                                                                
               END; /* SELECT */                                                
                                                                                
               EXEC CICS LINK PROGRAM ('R0019921')                              
                              COMMAREA(FEIL_STRUC);                             
                                                                                
               IF W_ERSTATT_FEILTEKST                   THEN                    
                  DO;                                                           
                     W02_FEIL_NR_PIC = W01_FEIL_NR(I);                          
                     FEIL_REC.FEIL_MELD(I) =                                    
                             W02_FEIL_NR_PIC          !!                        
                             SUBSTR(FEIL_STRUC.FEIL_MELDING,5);                 
                     W_ERSTATT_FEILTEKST = FALSE;                               
                  END;                                                          
               ELSE                                                             
                  FEIL_REC.FEIL_MELD(I) =                                       
                                       FEIL_STRUC.FEIL_MELDING;                 
                                                                                
               CALL P081_REDIGER_FEIL_MELDING;                                  
            END;                                                                
                                                                                
                                                                                
         END;                                                                   
                                                                                
                                                                                
   CALL P050_SKRIV_NORFEIL;                                                     
                                                                                
   KOM_OMR.TRANS_OPPL_PEKER         = ADDR(KOM_OMR.TRANS_OPPL_OMR);             
   KOM_OMR.TRANS_PEKER              = ADDR(KOM_OMR.TRANS_OMR);                  
                                                                                
                                                                                
 END P080_FEIL_I_BEH;                                                           
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* DENNE SETTER PÅ NULLER FORAN FEIL-MELDINGSNUMMER SOM ER KORTERE   */        
 /* ENN 4 POS. (ØNSKE FRA KARI ØSTDAHL/THOR BJERKE 14/10-87)          */        
 /* ***************************************************************** */        
 P081_REDIGER_FEIL_MELDING:PROC;                                                
                                                                                
                                                                                
          IF SUBSTR(FEIL_REC.FEIL_MELD(I),2,1) = ' '       THEN                 
             FEIL_REC.FEIL_MELD(I) =       '000'       !!                       
                                            FEIL_REC.FEIL_MELD(I);              
          ELSE                                                                  
             IF SUBSTR(FEIL_REC.FEIL_MELD(I),3,1) = ' '    THEN                 
                FEIL_REC.FEIL_MELD(I) =    '00'        !!                       
                                            FEIL_REC.FEIL_MELD(I);              
             ELSE                                                               
                IF SUBSTR(FEIL_REC.FEIL_MELD(I),4,1) = ' ' THEN                 
                   FEIL_REC.FEIL_MELD(I) = '0'         !!                       
                                            FEIL_REC.FEIL_MELD(I);              
                                                                                
                                                                                
    END P081_REDIGER_FEIL_MELDING;                                              
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .      */        
 /* ***************************************************************** */        
 P090_DANN_STATISTIKK_REC:PROC;                                                 
                                                                                
                                                                                
          STATISTIKK_REC = '';                                                  
          STATISTIKK_DATO_ÅMD = DATO_2000;           /*2000*/                   
                                                                                
          DO SYSTEM_INDEX = 1 TO 2;                                             
                                                                                
             IF SYSTEM_INDEX = 1   THEN                                         
                EDB_SYSTEM   = 'I';                                             
             ELSE                                                               
                EDB_SYSTEM   = 'N';                                             
                                                                                
             BLANK_MOTTATT_I.GRUNNBL_AP     = AP_MOTTATT(SYSTEM_INDEX)          
                                        +  A1_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I.GRUNNBL_UP      = UP_MOTTATT(SYSTEM_INDEX)         
                                         + U2_MOTTATT(SYSTEM_INDEX)             
                                         + U3_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I.GRUNNBL_EP      = EP_MOTTATT(SYSTEM_INDEX)         
                                         + EE_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I.GRUNNBL_BP      = BP_MOTTATT(SYSTEM_INDEX)         
                                         + B6_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I.GRUNNBL_FT      = FT_MOTTATT(SYSTEM_INDEX)         
                              +   F7_MOTTATT(SYSTEM_INDEX);                     
             BLANK_MOTTATT_I .GRUNNBL_E1 = E1_MOTTATT(SYSTEM_INDEX)             
                                       +  EN_MOTTATT(SYSTEM_INDEX);             
             BLANK_MOTTATT_I .GRUNNBL_E2 = E2_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I .GRUNNBL_O1 = O1_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I .GRUNNBL_O2 = O2_MOTTATT(SYSTEM_INDEX);            
             BLANK_MOTTATT_I.GRUNNBL_AF     = AFP_MOTTATT(SYSTEM_INDEX)         
                                          +   KFP_MOTTATT(SYSTEM_INDEX);        
                                                                                
             BLANK_AVVIST.GRUNNBL_AP         = AP_AVVIST(SYSTEM_INDEX)          
                                         + A1_AVVIST(SYSTEM_INDEX);             
             BLANK_AVVIST.GRUNNBL_UP         = UP_AVVIST(SYSTEM_INDEX)          
                                          + U2_AVVIST(SYSTEM_INDEX)             
                                          + U3_AVVIST(SYSTEM_INDEX);            
             BLANK_AVVIST.GRUNNBL_EP         = EP_AVVIST(SYSTEM_INDEX)          
                                         + EE_AVVIST(SYSTEM_INDEX);             
             BLANK_AVVIST.GRUNNBL_BP         = BP_AVVIST(SYSTEM_INDEX)          
                                         + B6_AVVIST(SYSTEM_INDEX);             
             BLANK_AVVIST.GRUNNBL_FT         = FT_AVVIST(SYSTEM_INDEX)          
                                         + F7_AVVIST(SYSTEM_INDEX);             
             BLANK_AVVIST .GRUNNBL_E1 = E1_AVVIST(SYSTEM_INDEX)                 
                                      + EN_AVVIST(SYSTEM_INDEX);                
             BLANK_AVVIST .GRUNNBL_E2 = E2_AVVIST(SYSTEM_INDEX);                
             BLANK_AVVIST .GRUNNBL_O1 = O1_AVVIST(SYSTEM_INDEX);                
             BLANK_AVVIST .GRUNNBL_O2 = O2_AVVIST(SYSTEM_INDEX);                
             BLANK_AVVIST.GRUNNBL_AF        = AFP_AVVIST(SYSTEM_INDEX)          
                                           +  KFP_AVVIST(SYSTEM_INDEX);         
                                                                                
             FEIL_BLANKETTYPE              = FEIL_BL_TYPE(SYSTEM_INDEX);        
                                                                                
             EXEC CICS WRITE DATASET ('NORSTAT')                                
                             FROM ( STATISTIKK_REC)                             
                             RIDFLD ( STAT_RBA) RBA;                            
                                                                                
          END;                                                                  
                                                                                
                                                                                
    END P090_DANN_STATISTIKK_REC;                                               
                                                                                
 /*********************************************************************/        
 /*                                                                   */        
 /*    RECORD-FOR FEIL BLANKETT ER SKRIVES HERE                       */        
 /*                                                                   */        
 /*********************************************************************/        
                                                                                
    DCL 01 NOR_REC,                                                             
           05 KJØRING_DATO       PIC '(8)9',     /*2000*/                       
           05 MELDNR (3)         PIC '(4)9',                                    
           05 HODE,                                                             
              10 TKNR            PIC '(4)9',                                    
              10 RECORD_TYPE     CHAR (2),                                      
              10 TRANS_TYPE      CHAR (2),                                      
              10 TRANS_DATO_ÅMD  PIC '(8)9',     /*2000*/                       
              10 TRANS_TID       PIC '(4)9',                                    
           05 BLANKETT_HODE,                                                    
              10 FNR             PIC '(11)9',                                   
              10 BLANKETT_TYPE   CHAR (2),                                      
              10 REC_NR          CHAR (2),                                      
              10 NAVN            CHAR (25),                                     
              10 BLANKETT        CHAR (264);                                    
                                                                                
                                                                                
  SKRIV_NOR_REG: PROC;                                                          
     NOR_REC.KJØRING_DATO   = DATO_2000;            /*2000*/                    
     NOR_REC.HODE           = BLANKETT_RECORD.HODE;                             
     NOR_REC.BLANKETT_HODE  = BLANKETT_RECORD.BLANKETT_HODE;                    
                                                                                
     EXEC CICS WRITE  DATASET ('NORSYS')                                        
                      FROM    (NOR_REC)                                         
                      RIDFLD  (NOR_RBA)                                         
                      RBA;                                                      
  END SKRIV_NOR_REG;                                                            
                                                                                
 /* ***************************************************************** */        
 /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .      */        
 /* ***************************************************************** */        
 P999_SLUTT:                                                                    
      PROC;                                                                     
                                                                                
                                                                                
    DCL UNORMAL_AVSLUTNING     BIT (1)     INIT ('0'B)               ;          
                                                                                
                                                                                
   EXEC CICS HANDLE CONDITION ERROR (ABEND)                          ;          
                                                                                
                                                                                
   IF (S001NO1O.ANT_Ø_BEHO = ANT_BEH !                                          
       TIDS_TEST            =  TID_UTE      )   &                               
                                                                                
       MELDING              =  (78)' '              THEN                        
                                                                                
       DO;                                                                      
          MELDING           =  'NORMALT AVSLUTTET PÅ FNR : ' !!                 
                BLANKETT_RECORD.FNR !! '    TRYKK ENTER  !! ' ;                 
       END;                                                                     
                                                                                
   ELSE                                                                         
     IF MELDING                         =   (78)' '      &                      
        TIDS_TEST                      ^=   TID_UTE               THEN          
                                                                                
                                                                                
        DO;                                                                     
           MELDING                =  'NORMALT AVSLUTTET PÅ FNR : ' !!           
                               BLANKETT_RECORD.FNR !!                           
                              '   TRYKK ENTER   !!';                            
        END;                                                                    
                                                                                
                                                                                
     ELSE                                                                       
        DO;                                                                     
                                                                                
                                                                                
           /* ************************************************ */               
           /* FEIL I BEH. OPPDATERINGENE FJERNES OG TELLERE           */        
           /* RESTILLES.                                              */        
           /* ************************************************ */               
                                                                                
                                                                                
           EXEC CICS SYNCPOINT ROLLBACK                                ;        
                                                                                
           S001NO1O.ANT_REC_INPUTO =                                            
                                   S001NO1O.ANT_REC_INPUTO         -  1;        
                                                                                
           IF W_ANT_FERDIG_BEH_OPPD                                 THEN        
              S001NO1O.ANT_FERDIG_BEHO =                                        
                               S001NO1O.ANT_FERDIG_BEHO            -  1;        
                                                                                
           UNORMAL_AVSLUTNING          =  TRUE                         ;        
        END;                                                                    
                                                                                
                                                                                
   /* ******************************************************** */               
   /* TERMINERER PSB'EN                                               */        
   /* SENDER UT MAP'EN OG SKRIVER PÅ LOGGEN .                         */        
   /* SIMULERER NY INNGANG FRA R0010426 HVIS ABEND                    */        
   /* ******************************************************** */               
                                                                                
                                                                                
   CALL DATABASE ('TERM')                                    ;                  
                                                                                
                                                                                
   EXEC CICS ASKTIME                                                  ;         
   S001NO1O.KLOKKE_LOGO = EIBTIME / 100                               ;         
   S001NO1I.DATO_LOGI =         DATO_2000/100;       /*2000*/                   
                                                                                
   S001NO1O.MELDINGO         =   MELDING;                                       
   S001NO1O.CICS_INFOO              =  CICS_NAVN;                               
                                                                                
   EXEC CICS SEND MAP ('S001NO1') MAPSET ('S001NO3') WAIT                       
                                          DATAONLY;                             
   S001NO1O.RECORD_TYPEO           = 'S';                                       
   S001NO1O.TKNRO                  =  BLANKETT_RECORD.TKNR;                     
   S001NO1O.FNRO                   =  BLANKETT_RECORD.FNR;                      
   S001NO1O.BLANKETT_TYPEO         =  BLANKETT_RECORD.BLANKETT_TYPE;            
   S001NO1O.REC_NRO                =  BLANKETT_RECORD.REC_NR;                   
   S001NO1O.TRANS_DATOO                                                         
     = KONV_HÅMD_ÅMD(BLANKETT_RECORD.TRANS_DATO_ÅMD); /*2000*/                  
   S001NO1O.TRANS_TIDO             =  BLANKETT_RECORD.TRANS_TID;                
                                                                                
                                                                                
   IF ANT_BEH               >  0                      THEN                      
      DO;                                                                       
         EXEC CICS WRITE DATASET ('NORLOGG') FROM          ( MAP_CHAR)          
                                             RIDFLD ( LOGG_RBA)                 
                                             RBA;                               
         EXEC CICS HANDLE CONDITION ERROR (STA99);                              
         IF ^AUTO_KJØRING THEN                                                  
            CALL P090_DANN_STATISTIKK_REC;                                      
                                                                                
      END;                                                                      
 STA99:                                                                         
                                                                                
   IF UNORMAL_AVSLUTNING                                       THEN             
      DO;                                                                       
         DIV_PARAM_OMR.PROGRAM_ID = 'R0010426'                     ;            
                                                                                
        EXEC CICS RETURN TRANSID('RNO1') COMMAREA( KOM_OMR );                   
      END;                                                                      
   ELSE                                                                         
      DO;                                                                       
         EXEC CICS RECEIVE MAP ('S001NO1') MAPSET ('S001NO3')                   
                                           SET (BMSMAPBR);                      
                                                                                
         /* ************************************************** */               
         /* SIMULERER INGANG FRA R0010301                      */               
         /* ************************************************** */               
                                                                                
         DIV_PARAM_OMR.PROGRAM_ID = 'R0010301'                     ;            
         TRANS_OPPL_OMR.TRANSKODE = 'RA26'                         ;            
         EXEC CICS XCTL PROGRAM ('R0010426')                                    
                       COMMAREA ( KOM_OMR ) ;                                   
      END;                                                                      
                                                                                
                                                                                
  END P999_SLUTT;                                                               
                                                                                
                                                                                
  /* ********************************************************** */              
  /* LABLER VED ABEND-SITUASJONER                               */              
  /* ********************************************************** */              
                                                                                
                                                                                
  CICS_ABEND:                                                                   
          ON ERROR SYSTEM;                                                      
          MELDING = 'STOPP ! CICS ABEND KEY:'            !!                     
                     BLANKETT_RECORD.TKNR           !! ' ' !!                   
                     BLANKETT_RECORD.FNR            !! ' ' !!                   
                     BLANKETT_RECORD.TRANS_DATO_ÅMD !! ' ' !!                   
                     BLANKETT_RECORD.TRANS_TID      !! ' ' !!                   
                     BLANKETT_RECORD.BLANKETT_TYPE  !! ' ' !!                   
                     BLANKETT_RECORD.REC_NR         !!                          
                    ' TA HARD-COPY! TRYKK ENTER!';                              
                                                                                
     /*   CALL P999_SLUTT ; */                                                  
                                                                                
                                                                                
  ABEND:                                                                        
          EXEC CICS ABEND ABCODE ('FEIL')                          ;            
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
  /* ********************************************************** */              
  /*          E K S T E R N E   P R O C E D U R E R             */              
  /* ********************************************************** */              
                                                                                
                                                                                
 %INCLUDE R0019920;          /*     ÅPNE /LUKKE DATABASE */                     
 %INCLUDE R001NO11;          /*     KONTROLL AP_BLANKETT */                     
 %INCLUDE R001NN11;          /*     KONTROLL A1_BLANKETT */                     
 %INCLUDE R001NO12;          /*     KONTROLL UP_BLANKETT */                     
 %INCLUDE R001NN12;           /*   KONTROLL U2_BLANKETT */                      
 %INCLUDE R001NU12;           /*   KONTROLL U3_BLANKETT */                      
 %INCLUDE R001NO13;          /*     KONTROLL EP_BLANKETT */                     
 %INCLUDE R001NU13;          /*     KONTROLL EE_BLANKETT */                     
 %INCLUDE R001NO14;          /*     KONTROLL BP_BLANKETT */                     
  %INCLUDE R001NN14;        /*   KONTROLL B6_BLANKETT */                        
 %INCLUDE R001NO15;          /*     KONTROLL FT_BLANKETT */                     
 %INCLUDE R001NN15;          /*     KONTROLL F7_BLANKETT */                     
 %INCLUDE R001NO16;          /*     KONTROLL E1_BLANKETT */                     
 %INCLUDE R001NU16;          /*     KONTROLL EN_BLANKETT */                     
 %INCLUDE R001NO17;          /*     KONTROLL O1_BLANKETT */                     
 %INCLUDE R001NO18;          /*     KONTROLL O2_BLANKETT */                     
 %INCLUDE R001NO19;          /*     KONTROLL E2_BLANKETT */                     
 %INCLUDE R001NO1A;          /*     KONTROLL AFP_BLANKETT */                    
 %INCLUDE R001NU1A;          /*     KONTROLL KFP_BLANKETT */                    
 /* %INCLUDE R001NO1B;              KONTROLL AU_BLANKETT */                     
 %INCLUDE R0010508;          /*     TT_AP                */                     
 %INCLUDE R0010608;          /*     TT_UP_EP             */                     
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO        */                     
 %INCLUDE R0019902;          /*     F_KJØNN              */                     
 %INCLUDE R0019903;          /*     F_EK_ALDER           */                     
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR         */                     
 %INCLUDE R0019905;          /*     F_ALDER              */                     
 %INCLUDE R0019907;          /*     F_TABSØKC_FUNNET     */                     
 %INCLUDE R0019908;          /*    F_DAGS_DATO_PLUSS1_MND*/                     
 %INCLUDE R0019909;          /*     F_KONTROLL_TT        */                     
 %INCLUDE R0019910;          /*     F_NUMERISK           */                     
 %INCLUDE R0019912;          /*     F_FELT_CHAR_PICNN    */                     
                                                                                
 %INCLUDE R0019953;          /*     F_40DAGER            */                     
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS     */                     
 %INCLUDE R0019959;          /*     F_2MDR               */                     
 %INCLUDE R0019964;          /*     F_6MDR               */                     
 %INCLUDE R0019965;          /*     F_DATO_ÅMD_PLUSS1    */                     
 %INCLUDE R0019983;          /*     KONV_ÅMD_HÅMD        */                     
 %INCLUDE R0019985;          /*     KONV_DMÅ_HÅMD        */                     
 %INCLUDE R0019987;          /*     KONV_HÅMD_ÅM         */                     
 %INCLUDE R0019988;          /*     KONV_HÅMD_ÅMD        */                     
 %INCLUDE R0019989;          /*     KONV_HÅMD_MÅ         */                     
 %INCLUDE R0019995;          /*     KONV_FNR11_FNR13     */                     
 %INCLUDE R0019945;          /*     ATK_KONTROLL         */                     
 %INCLUDE R0019998;          /*     ACF2_SKRIV           */                     
 %INCLUDE R0019999;          /*     ACF2_KONTROLL        */                     
                                                                                
                                                                                
 END R001NO1;                                                                   
