 /*       SIST ENDRET 20/07-98 13.06.27 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/06-98 13.21.32 AV   JDA7339                  */00000010
 /*       SIST ENDRET 11/06-98 08.47.21 AV   RFA9991                  */00000020
  /* **************************************************************** */00000030
  /*IDENTIFIKASJON:                                                   */00000040
  /*    R0011609                                                      */00000050
  /*    PROGRAMMERER: GEIR, SEPTEMBER 81                              */00000060
  /*HENSIKT:                                                          */00000070
  /*    R0011609 INNEHOLDER:                                          */00000080
  /*      PROSEDYRE FOR BLANKING AV O1_MAPEN.                         */00000090
  /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL       */00000100
  /*           O1_TRANS_OMR.                                          */00000110
  /*    PROSEDYRENE ER SKILT UT FRA R0011602.  050787   BRITT.        */00000120
  /*PROGRAMTILKNYTNING:                                               */00000130
  /*    PROSEDYRENE INCLUDES I ALDERSBEHANDLINGA TIL DET MASKINELLE   */00000140
  /*    FOLKETRYGDSYSTEMET.                                           */00000150
  /*    ARBEIDSOMRÅDE: P0011601  (LIGGER I R001.TEST.COPYLIB)         */00000160
  /*BRUK:                                                             */00000170
  /*    %INCLUDE R0011609;                                            */00000180
  /*    BLANK_O1_MAP:          SETTER LOW VALUES TIL MAPEN OG         */00000190
  /*                           BLANKER MELDINGSFELTENE.               */00000200
  /*    OVERFØR_O1_OPPHØR:     OVERFØRER OPPHØRSBL. MAP -> ARBEIDSOMR.*/00000210
  /*                                                                  */00000220
  /* **************************************************************** */00000230
  %PAGE;            /*             */                                   00000240
 /* ***************************************************************** */00000250
 /*                                                                   */00000260
 /*   PROSEDYRE FOR Å SETTE LOW VALUES TIL MAPEN OG BLANKE            */00000270
 /*   MELDINGSFELTENE.                                                */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 %SKIP;                                                                 00000310
   BLANK_O1_MAP:                                                        00000320
      PROC;                                                             00000330
   DCL                                                                  00000340
     LOW   BUILTIN;                                                     00000350
                                                                        00000360
                                                                        00000370
     REGDATOO       =    LOW (6)     ;                                  00000380
     TERMIDO        =    LOW (4)     ;                                  00000390
     FNR_DØDO       =    LOW (11)   ;                                   00000400
     TKNR_DØDO      =    LOW ( 4)   ;                                   00000410
     DØDSDATO_DØDO  =    LOW ( 6)   ;                                   00000420
     FNR_EKO        =    LOW (11)   ;                                   00000430
     PI_DØDO        =    LOW ( 7)   ;                                   00000440
     MELDING1O      =        (78)' ';                                   00000450
     MELDING2O      =        (78)' ';                                   00000460
     MELDING3O      =        (78)' ';                                   00000470
     MELDING4O      =        (78)' ';                                   00000480
     MELDING5O      =        (78)' ';                                   00000490
     MELDING6O      =        (78)' ';                                   00000500
   END BLANK_O1_MAP;                                                    00000510
 %PAGE;                                /*   */                          00000520
  /* **************************************************************** */00000530
  /*                                                                  */00000540
  /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                   */00000550
  /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL O1_TRANS_OMR I             */00000560
  /*   KOM_OMR FOR OPPHØRSBLANKETT 1.                                 */00000570
  /*           MAPSET:  S001163   MAP:  S001161                       */00000580
  /*                                                                  */00000590
  /* **************************************************************** */00000600
  %SKIP(2);                                                             00000610
  OVERFØR_O1_OPPHØR:                                                    00000620
    PROC;                                                               00000630
       IF REGDATOL        > 0 THEN                                      00000640
          O1.REGDATO_ÅMD  = KONV_ÅMD_HÅMD(REGDATOI);                    00000650
       IF TERMIDL         > 0 THEN                                      00000660
          O1.TERMID       = TERMIDI;                                    00000670
       IF FNR_DØDL        > 0 THEN                                      00000680
          O1.FNR_DØD      = F_FELT_CHAR_PIC11 (FNR_DØDI);               00000690
       IF TKNR_DØDL       > 0 THEN                                      00000700
          O1.TKNR_DØD     = F_FELT_CHAR_PIC4 (TKNR_DØDI);               00000710
       IF DØDSDATO_DØDL   > 0 THEN                                      00000720
          O1.DØDSDATO_ÅMD = KONV_DMÅ_HÅMD(DØDSDATO_DØDI);               00000730
       IF FNR_EKL         > 0 THEN                                      00000740
          O1.FNR_EK       = F_FELT_CHAR_PIC11 (FNR_EKI);                00000750
       IF PI_DØDL         > 0 THEN                                      00000760
          O1.PI_DØD       = F_FELT_CHAR_PIC7 (PI_DØDI);                 00000770
  END OVERFØR_O1_OPPHØR;                                                00000780
