 /*       SIST ENDRET 26/11-97 11.53.52 AV   SPA7339                  */00000000
 /*       SIST ENDRET 21/04-97 10.18.02 AV   SPA7339                  */00000010
 /*       SIST ENDRET 11/04-83 14.35.35 AV   FARVIK                   */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    P0019907 PLI          HANSEMANN                                */00000040
 /*    FUNKSJONEN ER LAGET I APRIL 1981.                              */00000050
 /*HENSIKT:                                                           */00000060
 /*    SØKER BINÆRT ETTER ET GITT ELEMENT I EN GITT TABELL.           */00000070
 /*BRUKES:                                                            */00000080
 /*    IF F_TABSØKC_FUNNET(X,T_MAX,TAB) THEN...........               */00000090
 /*PARAMETRE INN:                                                     */00000100
 /*    ELEMENTNAVN,ANTALL ELEMENTER I TABELLEN,TABELLENS NAVN         */00000110
 /*PARAMETRE UT :                                                     */00000120
 /*    R_KODE                                                         */00000130
 /* ***************************************************************** */00000140
 %PAGE;                                /*   */                          00000150
 F_TABSØKC_FUNNET:                                                      00000160
   PROC(X,T_MAX,TAB) RETURNS(BIT(1));                                   00000170
   DCL                                                                  00000180
      TAB(*) CHAR(*);                                                   00000190
   DCL                                                                  00000200
      X CHAR(*);                                                        00000210
   DCL                                                                  00000220
      I FIXED BIN(15);                                                  00000230
   DCL                                                                  00000240
      (T_MAX,                                                           00000250
      MAX,                                                              00000260
      MIN) FIXED BIN(15);                                               00000270
   DCL                                                                  00000280
      R_KODE BIT(1);                                                    00000290
 %SKIP(2);                                                              00000300
      R_KODE = '0'B;                                                    00000310
      MIN    = 0;                                                       00000320
      MAX    = T_MAX;                                                   00000330
 %SKIP(1);                                                              00000340
      DO WHILE(MAX - MIN > 1 & ^R_KODE);                                00000350
                                                                        00000360
         I = (MAX + MIN) / 2;                                           00000370
                                                                        00000380
         IF TAB(I) = X THEN                                             00000390
            R_KODE = '1'B;                                              00000400
                                                                        00000410
         IF X < TAB(I) THEN                                             00000420
            MAX = I;                                                    00000430
         ELSE                                                           00000440
            MIN = I;                                                    00000450
      END;                                                              00000460
 %SKIP(1);                                                              00000470
      RETURN(R_KODE);                                                   00000480
   END F_TABSØKC_FUNNET;                                                00000490
