 /*       SIST ENDRET 09/06-98 08.30.00 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 10.43.33 AV   HLA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R001NC09  -                                                    */00000030
 /*    PROGRAMMERER:      SATISH 1991                                 */00000040
 /*HENSIKT:                                                           */00000050
 /*    R001NC09 INNHOLDER:                                            */00000060
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000070
 /*           F7_TRANS_OMR.                                           */00000080
 /*PROGRAMTILKNYTNING:                                                */00000090
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000100
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000110
 /*    FOLKETRYGDSYSTEMET.                                            */00000120
 /*    ARBEIDSOMRÅDE: P001NC01                                        */00000130
 /*BRUK:                                                              */00000140
 /*    %INCLUDE R001NC09;                                             */00000150
 /*    OVERFØR_F7_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */00000160
 /* ***************************************************************** */00000170
 /*                                                                   */00000180
 /*   PROSEDYRE FOR Å BLANKE MAPEN                                    */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 %SKIP;                                                                 00000220
   BLANK_F7_MAP:                                                        00000230
      PROC;                                                             00000240
   DCL                                                                  00000250
     LOW BUILTIN;                                                       00000260
     BT_ANTO      = LOW(2);                                             00000270
     FNR_EKO      = LOW(11);                                            00000280
     TILL_EKO     = ' ';                                                00000290
     PIO          = LOW(7 );                                            00000300
     AIO          = LOW(7 );                                            00000310
     PI_EKO       = LOW(7 );                                            00000320
     AI_EKO       = LOW(7 );                                            00000330
                                                                        00000340
     DO A = 1 TO 8;                                                     00000350
       FNR_BARNO(A)   = LOW(11);                                        00000360
       RBTNO(A)        = LOW(1);                                        00000370
     END;                                                               00000380
                                                                        00000390
     MELDING1O    = (78)' ';                                            00000400
     MELDING2O    = (78)' ';                                            00000410
     MELDING3O    = (78)' ';                                            00000420
     MELDING4O    = (78)' ';                                            00000430
     MELDING5O    = (78)' ';                                            00000440
     MELDING6O    = (78)' ';                                            00000450
   END BLANK_F7_MAP;                                                    00000460
 %PAGE;                                /*   */                          00000470
 /* ***************************************************************** */00000480
 /*                                                                   */00000490
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000500
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL F7_TRANS_OMR I              */00000510
 /*   KOM_OMR FOR F7_SØKER.                                           */00000520
 /*           MAPSET:  S001123   MAP S001121                          */00000530
 /*                                                                   */00000540
 /* ***************************************************************** */00000550
 %SKIP;                                                                 00000560
                                                                        00000570
 OVERFØR_F7_SØKER:                                                      00000580
   PROC;                                                                00000590
      IF REGDATOL > 0 THEN                                              00000600
         F7S.REGDATO_ÅMD = KONV_ÅMD_HÅMD (REGDATOI); /*2000*/           00000610
      IF TERMIDL  > 0 THEN                                              00000620
           F7S.TERMID  = TERMIDI;                                       00000630
      IF FNRL > 0 THEN                                                  00000640
           F7S.FNR = F_FELT_CHAR_PIC11 (FNRI);                          00000650
      IF TKNRL > 0 THEN                                                 00000660
           F7S.TKNR = F_FELT_CHAR_PIC4 (TKNRI);                         00000670
      IF TILL_EKL > 0 THEN                                              00000680
           F7S.TILL_EK = TILL_EKI;                                      00000690
      IF BT_ANTL > 0 THEN                                               00000700
           F7S.BT_ANT = F_FELT_CHAR_PIC2 (BT_ANTI);                     00000710
      IF VIRK_DATO_MÅL > 0 THEN                                         00000720
         F7S.VIRK_DATO_ÅMD = KONV_MÅ_HÅMD(VIRK_DATO_MÅI);/*2000*/       00000730
      IF FNR_EKL > 0 THEN                                               00000740
           F7S.FNR_EK = F_FELT_CHAR_PIC11 (FNR_EKI);                    00000750
                                                                        00000760
   END OVERFØR_F7_SØKER;                                                00000770
 /***  ********************************* ***/                           00000780
 /*    SISTE 2 LINJE                       */                           00000790
 /******************************************/                           00000800
 OVERFØR_F7_SØKER2:                                                     00000810
   PROC;                                                                00000820
                                                                        00000830
      IF PIL         > 0 THEN                                           00000840
           F7S.PENSJONSINNTEKT = PII;                                   00000850
      IF AIL         > 0 THEN                                           00000860
           F7S.ARBEIDSINNTEKT = AII;                                    00000870
      IF PI_EKL      > 0 THEN                                           00000880
           F7S.PENSJONSINNTEKT_EK = PI_EKI;                             00000890
      IF AI_EKL      > 0 THEN                                           00000900
           F7S.ARBEIDSINNTEKT_EK = AI_EKI;                              00000910
   END OVERFØR_F7_SØKER2;                                               00000920
