 /*       SIST ENDRET 22/06-98 09.15.59 AV   JDA7339                  */00000000
 /*       SIST ENDRET 03/06-98 08.53.36 AV   JDA7339                  */00000010
 /*       SIST ENDRET 06/03-91 11.51.05 AV   DYBVIK                   */00000020
  /* **************************************************************** */00000030
  /*IDENTIFIKASJON:                                                   */00000040
  /*    R001N905 - PROSEDYRE I PLI                                    */00000050
  /*    PROGRAMMERER: GEIR, JULI 1981                                 */00000060
  /*HENSIKT:                                                          */00000070
  /*    PROSEDYREN KONTROLLERER DATA I SPESIELLE OPPLYSNINGER         */00000080
  /*    FOR ETTERLATT FAMILIEPLEIER.                                  */00000090
  /*BRUK:                                                             */00000100
  /*    CALL KONTROLL_E4_SPES(FEIL_FUNNET);                           */00000110
  /*PARAMETRE INN:                                                    */00000120
  /*    INGEN, MEN BRUKER E4SP DATAENE I E4_TRANS_OMR.                */00000130
  /*PARAMETRE UT:                                                     */00000140
  /*    FEIL_FUNNET                                                   */00000150
  /* **************************************************************** */00000160
  %SKIP;                                                                00000170
  /* **************************************************************** */00000180
  /*                                                                  */00000190
  /*   MODULEN KONTROLLERER ETTERLATT FAMILIEPLEIER SPESIELLE         */00000200
  /*   OPPLYSNINGER OM SØKEREN OG RETURNERER MED FEIL_FUNNET = '1'B   */00000210
  /*   HVIS FEIL, '0'B HVIS RIKTIG.                                   */00000220
  /*                                                                  */00000230
  /* **************************************************************** */00000240
                                                                        00000250
  KONTROLL_E4_SPES:                                                     00000260
    PROC(FEIL_FUNNET);                                                  00000270
    DCL                                                                 00000280
       FEIL_FUNNET      BIT (1);                                        00000290
   DCL                                                                  00000300
      KEY_BIT1                   BIT(32) BASED (KEY_PEKER1),            00000310
      KEY_BIT2                   BIT(32) BASED (KEY_PEKER2),            00000320
      KEY_PEKER1                 POINTER,                               00000330
      KEY_PEKER2                 POINTER,                               00000340
      ST_RECL                    CHAR (35);                             00000350
    DCL T_FNR           PIC'(11)9';                                     00000360
    DCL T_FNR13         PIC'(13)9';                                     00000370
    DCL 1 FNR13 DEF T_FNR13,                                            00000380
        2 DG PIC'99',                                                   00000390
        2 MN PIC'99',                                                   00000400
        2 ÅR PIC'9999',                                                 00000410
        2 PERSNR,                                                       00000420
          3 ÅRHUNDRE    PIC'999',                                       00000430
          3 REST        PIC'99';                                        00000440
    DCL                                                                 00000450
        FYLT_SEKSTISJU  PIC'9999';                                      00000460
    DCL                                                                 00000470
        MAKS_FRAMT_TT   PIC'9999',                                      00000480
        FRAMT_TT_ÅR     PIC'9999';                                      00000490
    DCL                                                                 00000500
       ALDER            FIXED DEC(5),                                   00000510
       DATO             PIC'99999999';                                  00000520
                                                                        00000530
    DCL                                                                 00000540
       MAKS_TT_FØR_1967 PIC'99',                                        00000550
       TT_TIL_TPK       PIC'9999',                                      00000560
       TT_E66_ÅMD       PIC'99999999';                                  00000570
                                                                        00000580
    KEY_PEKER1          = ADDR(E4SP.STATSBORGER);                       00000590
    KEY_PEKER2          = ADDR(E4SP.BOSATT);                            00000600
    T_FNR               = E4S.FNR;                                      00000610
                                                                        00000620
  %SKIP;                                                                00000630
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E4SP.STATSBORGER)) THEN            00000640
       DO;                                                              00000650
          FEIL_FUNNET        = '1'B;                                    00000660
          E4SP.STATSBORGERNR = 200;                                     00000670
       END;                                                             00000680
    ELSE                                                                00000690
       DO;                                                              00000700
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);               00000710
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT1)       00000720
                                               INTO(ST_RECL);           00000730
              GOTO STAT_UT;                                             00000740
          NOTFND1:                                                      00000750
              FEIL_FUNNET        = '1'B;                                00000760
              E4SP.STATSBORGERNR = 24;                                  00000770
              LEAVE;                                                    00000780
          STAT_UT:                                                      00000790
       END;                                                             00000800
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E4SP.BOSATT)) THEN                 00000810
       DO;                                                              00000820
          FEIL_FUNNET   = '1'B;                                         00000830
          E4SP.BOSATTNR = 200;                                          00000840
       END;                                                             00000850
    ELSE                                                                00000860
       DO;                                                              00000870
              EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);               00000880
              EXEC CICS READ DATASET ('STATTAB') RIDFLD(KEY_BIT2)       00000890
                                               INTO(ST_RECL);           00000900
              GOTO BO_UT;                                               00000910
          NOTFND2:                                                      00000920
              FEIL_FUNNET   = '1'B;                                     00000930
              E4SP.BOSATTNR = 25;                                       00000940
              LEAVE;                                                    00000950
          BO_UT:                                                        00000960
        END;                                                            00000970
    IF VERIFY(E4SP.PENSJONSTRYGDET,'JN ') ^= 0 THEN                     00000980
       DO;                                                              00000990
          FEIL_FUNNET          = '1'B;                                  00001000
          E4SP.PENSJONSTRYGDETNR = 354;                                 00001010
       END;                                                             00001020
    IF VERIFY(E4SP.MINST_20ÅR,'JN ') ^= 0 THEN                          00001030
       DO;                                                              00001040
          FEIL_FUNNET        = '1'B;                                    00001050
          E4SP.MINST_20ÅRNR = 355;                                      00001060
       END;                                                             00001070
    IF E4SP.FRAVIK_KONVENSJON = 'N' THEN                                00001080
       E4SP.FRAVIK_KONVENSJON = ' ';                                    00001090
    IF VERIFY(E4SP.FRAVIK_KONVENSJON,'J ') ^= 0 THEN                    00001100
       DO;                                                              00001110
          FEIL_FUNNET        = '1'B;                                    00001120
          E4SP.FRAVIK_KONVENSJONNR = 120;                               00001130
       END;                                                             00001140
    IF VERIFY(E4SP.FRAVIK_FLYKT,'J ') ^= 0 THEN                         00001150
       DO;                                                              00001160
          FEIL_FUNNET         = '1'B;                                   00001170
          E4SP.FRAVIK_FLYKTNR = 26;                                     00001180
       END;                                                             00001190
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E4SP.TT_FRA_1937_ÅR)) THEN         00001200
       DO;                                                              00001210
          FEIL_FUNNET            = '1'B;                                00001220
          E4SP.TT_FRA_1937_ÅRNR = 200;                                  00001230
       END;                                                             00001240
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E4SP.TT_FRA_1937_MND)) THEN        00001250
       DO;                                                              00001260
          FEIL_FUNNET            = '1'B;                                00001270
          E4SP.TT_FRA_1937_MNDNR = 200;                                 00001280
       END;                                                             00001290
    IF VERIFY(E4SP.TT_NORDEN_ANNET,'JN ') ^= 0 THEN                     00001300
       DO;                                                              00001310
          FEIL_FUNNET       = '1'B;                                     00001320
          E4SP.TT_NORDEN_ANNETNR = 361;                                 00001330
       END;                                                             00001340
    IF VERIFY(E4SP.BEREGN_KONVENSJON,'JN ') ^= 0 THEN                   00001350
       DO;                                                              00001360
          FEIL_FUNNET       = '1'B;                                     00001370
          E4SP.BEREGN_KONVENSJONNR = 356;                               00001380
       END;                                                             00001390
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(E4SP.TT_KONVENSJON_ÅR)) THEN       00001400
       DO;                                                              00001410
          FEIL_FUNNET   = '1'B;                                         00001420
          E4SP.TT_KONVENSJON_ÅRNR = 200;                                00001430
       END;                                                             00001440
  %PAGE;                                                                00001450
  /* **************************************************************** */00001460
  /*   KRYSSKONTROLLER                                                */00001470
  /*                                                                  */00001480
  /* **************************************************************** */00001490
  %SKIP;                                                                00001500
                                                                        00001510
 /* ^FEIL_FUNNET THEN        */                                         00001520
 IF E4S.NORSK_BOSATT = 'N' THEN                                         00001530
    DO;                                                                 00001540
       IF E4SP.TT_FRA_1937_ÅR     = 0 &                                 00001550
          E4SP.TT_FRA_1937_MND    = 0 &                                 00001560
          E4SP.FRAVIK_FLYKT      ^= 'J' &                               00001570
          E4SP.BEREGN_KONVENSJON ^= 'J' THEN                            00001580
                                                                        00001590
          DO;                                                           00001600
             FEIL_FUNNET = '1'B;                                        00001610
             E4SP.TT_FRA_1937_ÅRNR = 195;                               00001620
             E4SP.TT_FRA_1937_MNDNR = 999;                              00001630
             E4SP.FRAVIK_FLYKTNR   = 999;                               00001640
          END;                                                          00001650
                                                                        00001660
       IF E4SP.BOSATT > 0 &  (E4SP.PENSJONSTRYGDET ^= 'J' &             00001670
                              E4SP.MINST_20ÅR      ^= 'J' &             00001680
                              E4SP.FRAVIK_KONVENSJON  ^= 'J') THEN      00001690
          DO;                                                           00001700
             FEIL_FUNNET          = '1'B;                               00001710
             E4SP.BOSATTNR        = 366;                                00001720
          END;                                                          00001730
                                                                        00001740
       IF E4SP.FRAVIK_FLYKT = 'J'  & (E4SP.TT_FRA_1937_ÅR > 0 &         00001750
                                    E4SP.TT_FRA_1937_MND > 0 ) THEN     00001760
          DO;                                                           00001770
             FEIL_FUNNET          = '1'B;                               00001780
             E4SP.FRAVIK_FLYKTNR   = 157;                               00001790
             E4SP.TT_FRA_1937_ÅRNR = 999;                               00001800
             E4SP.TT_FRA_1937_MNDNR = 999;                              00001810
          END;                                                          00001820
                                                                        00001830
       IF E4SP.BEREGN_KONVENSJON = 'J' &                                00001840
                         E4SP.TT_KONVENSJON_ÅR = 0   THEN               00001850
          DO;                                                           00001860
             FEIL_FUNNET          = '1'B;                               00001870
             E4SP.BEREGN_KONVENSJONNR = 358;                            00001880
             E4SP.TT_KONVENSJON_ÅRNR = 999;                             00001890
          END;                                                          00001900
     END;                                                               00001910
  END KONTROLL_E4_SPES;                                                 00001920
