 /*   SIST ENDRET PÅ PROD   2000.02.18 14.34.37 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.57.04 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.41.03 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO19  UNDERPROGRAM SOM BRUKES AV R001NO10    */        
 /*                            KONTROLL E2-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : AUGUST 1987                               */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NO19                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R0011502   BLANK E2 TRANSOMR                                   */        
 /*    R0011503   KONTR E2 SØKER                                      */        
 /*    FUNKSJONER SOM BLIR BRUKT ER INKLUDERT I HOVEDPROGRAMMET       */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR E2 OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P115_BEHANDLE_E2: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P0011501;                               /* TRANSOMR E2 */             
                                                                                
                                                                                
          FEIL_I_BOSATT = '0'B;                                                 
          FEIL_BLANKETT = '0'B;                                                 
          FEIL_FUNNET   = '0'B;                                                 
          CALL BLANK_E2_SØKER;                   /* R0011502 */                 
          CALL BLANK_E2_MELDNR;                  /* R0011502 */                 
          CALL OVERFØR_E2_BLANKETT;                                             
          CALL KONTROLL_E2_SØKER(FEIL_FUNNET);   /* R0011503 */                 
                                                                                
          IF FEIL_FUNNET     THEN                                               
             DO;                                                                
                CALL FINN_FEIL_E2;                                              
             END;                                                               
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORDEN           */        
 /*   TIL E2.TRANS_OMR I KOM_OMR FOR ENDRINGSBLANKETT 2.              */        
 /* ***************************************************************** */        
 OVERFØR_E2_BLANKETT: PROC;                                                     
                                                                                
                                                                                
          E2S.FNR            = BLANKETT_RECORD.FNR;                             
          E2S.TKNR_FRA       = BLANKETT_RECORD.TKNR;                            
          E2S.TKNR_TIL       = E2_BLANKETT.TKNR_NYTT;                           
                                                                                
                                                                                
    END OVERFØR_E2_BLANKETT;                                                    
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRE DERSOM    */        
 /*   DET ER FEIL I DEN OVERFØRTE RECORDEN.                           */        
 /* ***************************************************************** */        
 FINN_FEIL_E2:PROC;                                                             
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF E2S.FNRNR ^= 0  &                                                  
             E2S.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E2S.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF E2S.TKNR_FRANR ^= 0 &                                              
             E2S.TKNR_FRANR ^= 999 THEN                                         
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E2S.TKNR_FRANR;                         
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF E2S.TKNR_TILNR ^= 0 &                                              
             E2S.TKNR_TILNR ^= 999 THEN                                         
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E2S.TKNR_TILNR;                         
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
                                                                                
    END FINN_FEIL_E2;                                                           
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0011502;          /*     BLANK E2 TRANSOMR  */                       
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0011503;          /*     KONTR E2 BLANKETT  */                       
                                                                                
                                                                                
 END P115_BEHANDLE_E2;                                                          
                                                                                
                                                                                
