 /*   SIST ENDRET PÅ PROD   2005.06.24 12.51.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.08 13.19.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.59.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.16 13.40.09 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.02.08 13.46.01 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.02.08 13.44.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.23  8.20.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.21 12.41.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.38.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.09  8.31.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.25 11.42.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.25 11.37.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.09 12.23.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.09 12.20.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.26 13.44.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.26 13.43.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.06  8.27.26 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.06  8.24.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.01  8.12.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.01  8.06.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 13.19.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 14.58.21 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.02 11.38.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.07.19  7.30.27 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.04.17 12.53.52 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.14 12.42.34 AV   JDA7339          */        
 /*       SIST ENDRET 07/06-99 07.58.03 AV   JDA7339                  */        
 /*       SIST ENDRET 07/06-99 07.57.22 AV   JDA7339                  */        
 /*       SIST ENDRET 13/04-99 14.35.08 AV   JDA7339                  */        
 /*       SIST ENDRET 13/04-99 14.33.05 AV   JDA7339                  */        
 /*       SIST ENDRET 15/12-98 08.37.04 AV   JDA7339                  */        
 /*       SIST ENDRET 15/12-98 08.36.32 AV   JDA7339                  */        
 /*       SIST ENDRET 02/09-98 11.16.45 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*    R001U620 - PROSEDYRE I PLI        HOVEDPROGRAM                 */        
 /*    PROGRAMMERER: HERMAN 0793                                      */        
 /* HENSIKT:                                                          */        
 /*    KONTROLLERE U3TRANS MOT STATUS FAMILIEFORHOLD.                 */        
 /*    RUTINEN KONTROLLERER ALLE PERSONER I TRANSAKSJONEN MOT         */        
 /*    INFORMASJON I REGISTERET. FOR HVER FAMILIEPERSON SOM GÅR       */        
 /*    FEILFRI GJENNOM KONTROLLENE BLIR DET OPPRETTET NY STATUS       */        
 /*    FOR PERSONEN, OG SØKERENS STATUS OPPDATERES.                   */        
 /* ***************************************************************** */        
 /* ENDRET:                                                          */         
 /* ENDRINGEN GJELDER:                                               */         
 /* ENDRET AV:                                                       */         
 /* ***************************************************************  */         
 /* PROGRAMTILKNYTNING:                                              */         
 /*    KALLES OPP AV PROGRAM R0013520                                */         
 /* BRUK:                                                            */         
 /*    EXEC CICS XCTL PROGRAM ('R001U620') COMMAREA (KOM_OMR)        */         
 /*                                                                  */         
 /* **************************************************************** */         
 U3TR:PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                     
    /* -------------------------------------------------------------- */        
    %INCLUDE P001U601; /* TRANS_OMR U3S/U3SP/U3EØS/U3Y                */        
    %INCLUDE P0019906; /* TRANS_OPPL_OMR                              */        
    %INCLUDE P0019908; /* KOM_OMR                                     */        
    %INCLUDE P0019910; /* STYRINGS_OMR                                */        
    %INCLUDE P0019912; /* DIV_PARAM_OMR                               */        
    %INCLUDE P0019913; /* LOKAL_KOM_OMR                               */        
    %INCLUDE P0019924; /* GRUNNBELØP-VEIET GJENNOMSNITT               */        
    /* -------------------------------------------------------------- */        
                                                                                
    DCL (COMMAREA_PEKER,LOKAL_KOM_PTR) PTR;                                     
                                                                                
    DCL 1 B00 BASED(B00_PEKER), %INCLUDE P0019921;                              
    DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                              
    DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                              
                                                                                
    DCL                                                                         
       (                                                                        
        BARN_IND,                                                               
        I,                                                                      
        IND,                                                                    
        J,                                                                      
        UF_IND,                                                                 
        ÅR_IND                                                                  
       )               FIXED BIN(15);                                           
                                                                                
    DCL ALDER_UF       PIC '999999',                                            
        ALDER_VIRK     PIC '999999';                                            
 /* ***************************************************************** */        
 /* HJELPE DCL FOR Å SNU DATO                                         */        
 /* ***************************************************************** */        
                                                                                
   DCL                                                                          
      HJ_VIRK_DATO_ÅMD         PIC '99999999';                                  
   DCL                                                                          
      FNR13                    PIC '(13)9',                                     
      FNR13_D  POS (1) DEF FNR13 PIC '99',                                      
      FNR13_M  POS (3) DEF FNR13 PIC '99',                                      
      FNR13_Å  POS (5) DEF FNR13 PIC '9999';                                    
                                                                                
  DCL SEKSTISJUÅRSDATO     PIC '(8)9',                                          
      TJUEÅRSDATO_ÅMD      PIC '(8)9',                                          
      SISTE_UTFYLTE        PIC '99';                                            
   DCL                                                                          
      1 ALDER_67 DEF SEKSTISJUÅRSDATO,                                          
        2 ÅR                   PIC'9999',                                       
        2 MND                  PIC'99',                                         
        2 DAG                  PIC'99';                                         
                                                                                
   DCL                                                                          
      1 STATUS_TYPE_SØKER  CHAR(1);                                             
   DCL                                                                          
     (ADDR,                                                                     
      CSTG,                                                                     
      HBOUND,                                                                   
      LBOUND,                                                                   
      MOD,                                                                      
      VERIFY)              BUILTIN;                                             
   DCL HJ_UFT_ÅMD                      PIC'(8)9';                               
   DCL HJ_FRIINNTEKT_DATO_ÅMD          PIC'(8)9';                               
   DCL HJ_UFT_D DEF HJ_UFT_ÅMD POS(7)  PIC'99';                                 
   DCL HJ_UFT_M DEF HJ_UFT_ÅMD POS(5)  PIC'99';                                 
   DCL HJ_UFT_Å DEF HJ_UFT_ÅMD POS(1)  PIC'9999';                               
   DCL HJ_ÅMD                          PIC'(8)9';                               
   DCL HJ_M     DEF HJ_ÅMD    POS(5)   PIC'99';                                 
   DCL HJ_Å     DEF HJ_ÅMD    POS(1)   PIC'9999';                               
   DCL HJ_ÅMD_FIX             FIXED DEC (9) INIT (0);                           
                                                                                
   DCL MAX_BUP                FIXED DEC (3) INIT (0);                           
   DCL TIL_ÅR                 FIXED DEC (5) INIT (0);                           
   DCL TT_RED                 CHAR      (1) INIT (' ');                         
   DCL W_TT_NORSK_FAKTISK_MND FIXED DEC (3)   INIT (0);                         
   DCL HJ_TT_FRAMT            FIXED DEC (3)   INIT (0);                         
   DCL OPPH_ÅMD               PIC '(8)9';   /*KONS RF */                        
   DCL OPPH_ÅR DEF OPPH_ÅMD POS(1)  PIC '9999',                                 
       OPPH_MN DEF OPPH_ÅMD POS(5)  PIC '99',                                   
       OPPH_DAG DEF OPPH_ÅMD POS(7)  PIC '99';                                  
   DCL FNR_ÅM_00               PIC '(8)9';          /*9904*/                    
   DCL REGÅR                  FIXED DEC (5) INIT (0);                           
   DCL SISTE                  FIXED DEC (5) INIT (0);                           
   DCL POENGÅR                FIXED DEC (5) INIT (0);                           
   DCL W_PI                   FIXED DEC (9) INIT (0);                           
   DCL W_GV                   FIXED DEC (5) INIT (0);                           
   DCL POENG_FIRE_DEC         FIXED DEC (7,4) INIT (0);                         
   DCL RUNDING_0049           FIXED DEC (5,4) INIT (1.0049);                    
                                                                                
    /* == R001U620 ================================================== */        
                                                                                
    ALLOCATE LOKAL_KOM_OMR;                                                     
                                                                                
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                                       
    IF (FEIL_MELD_NR = 0) THEN                                                  
       PROGRAM_ID = 'R001U620';                                                 
    FNR13               = KONV_FNR11_FNR13(U3S.FNR);                            
    FNR_ÅM_00 = (FNR13_Å * 10000) + (FNR13_M * 100);                            
    HJ_VIRK_DATO_ÅMD       = U3S.VIRK_DATO_ÅMD;                                 
    HJ_FRIINNTEKT_DATO_ÅMD = U3S.FRIINNTEKT_DATO_ÅMD;                           
    HJ_UFT_ÅMD             = U3S.UFT_ÅMD;                                       
    HJ_UFT_D               = 0;                                                 
    U3S.UFT_ÅMD            = HJ_UFT_ÅMD;                                        
    OPPH_ÅMD               = U3S.UFT_ÅMD;        /* KONS RF */                  
    ALDER_UF = F_ALDER(U3S.FNR,U3S.UFT_ÅMD);                                    
                                                                                
 L001:                                                                          
    IF (B01.PENSJONSTYPE1(SØKER_IND)    = 'K' &                                 
        B01.STATUS_KODE_HIST(SØKER_IND) = ' ' ) THEN                            
       DO;                                                                      
          FEIL_VED_LABEL = '001';                                               
          FEIL_MELD_NR   = 1735;                                                
          GO TO L999;                                                           
       END;                                                                     
                                                                                
    IF (U3S.ATT_UF = 'X') THEN                                                  
       DO;  /* DAGPENGER, OPPHØRT VIRK MÅ VÆRE FØR 2002 */                      
          B01.SIVILSTAND(SØKER_IND) = 'U';                                      
          U3S.SIVILSTAND            = 'U';                                      
          DO I = 1 TO 13;                                                       
             B01.TILKN(SØKER_IND,I)    = '';                                    
          END;                                                                  
          B01.PERSON(EKTEF_IND)    = '';                                        
          B01.ANTALL_BARN(SØKER_IND) = 0;                                       
       END; /* DAGPENGER, OPPHØRT VIRK MÅ VÆRE FØR 2002 */                      
                                                                                
    SEKSTISJUÅRSDATO    =  FNR_ÅM_00 + 670000;   /*9904*/                       
    TJUEÅRSDATO_ÅMD     =  FNR_ÅM_00 + 200000;   /*9904*/                       
                                                                                
    TRANSTYPE           = 2;                                                    
    I                   = 0;                                                    
    IND                 = 0;                                                    
    UF_IND              = 0;                                                    
    SISTE_UTFYLTE       = 0;                                                    
                                                                                
    DO I = 1 TO 7;                                                              
       IF B01.UFØRHIST.UFT_ÅMD (SØKER_IND,I) = 0 THEN                           
          DO;                                                                   
             SISTE_UTFYLTE    = I - 1;                                          
             IF I             = 1               THEN                            
                SISTE_UTFYLTE = 1;                                              
             I                = 7;                                              
          END;                                                                  
    END;                                                                        
 L639:                                                                          
    IF SISTE_UTFYLTE       = 0   THEN                                           
       DO;                                                                      
           FEIL_VED_LABEL = '639';                                              
           FEIL_MELD_NR   = 639;                                                
           GO TO L999;                                                          
       END;                                                                     
                                                                                
 L644:                                                                          
    IF (((B01.UFØRHIST.UFT_ÅMD (SØKER_IND,1) > 0          &                     
          B01.UFØRHIST.UFT_ÅMD (SØKER_IND,1) = U3S.UFT_ÅMD) !                   
         (B01.UFØRHIST.UFT_ÅMD (SØKER_IND,1) = 0          ) ) &                 
        U3S.VIRK_DATO_ÅMD                  > 20039999      ) &                  
        U3S.ATT_UF                        ^= 'A'     &  /* #713*/               
        U3S.INNTEKT_FØR_UP                 = 0               THEN               
       DO;  /* FØRSTEGANGSREGISTRERING I MED VIRK 2004 ELLER SENERE */          
          IF (U3S.YRKE = 11 !                                                   
              U3S.YRKE = 12 !                                                   
              U3S.YRKE = 18 ) THEN                                              
             ;                                                                  
          ELSE                                                                  
          IF (U3S.GARANTERT_TP ^= 'J' ! ALDER_UF > 2600) THEN                   
             DO;                                                                
                /* KRAV TIL UTFYLLING NÅR IKKE UNG UFØR,     */                 
                /* IKKE KRAV VED HJEMMEARB. ELLER KOMBINERTE */                 
     /*         U3S.INNTEKT_FØR_UPNR = 644;   */                                
                                                                                
                FEIL_VED_LABEL = '644';                                         
                FEIL_MELD_NR   = 644;                                           
                GO TO L999;                                                     
             END; /* KRAV TIL UTFYLLING NÅR IKKE UNG UFØR */                    
       END; /* FØRSTEGANGSREGISTRERING I MED VIRK 2004 ELLER SENERE */          
                                                                                
 /*OPPDRAG 05070: */                                                            
    IF U3S.REAKTIVISERING            = 'S'      THEN                            
       DO;                                                                      
          IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'U'  &                             
             B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y'        THEN                    
             DO;                                                                
 L633:                                                                          
                FEIL_VED_LABEL = '633';                                         
                FEIL_MELD_NR   = 633;                                           
                GO TO L999;                                                     
             END;                                                               
          IF U3S.UFG < B01.UFØRPENS.UFG(SØKER_IND)  THEN                        
             DO;                                                                
 L680:                                                                          
                FEIL_VED_LABEL = '680';                                         
                FEIL_MELD_NR   = 680;                                           
                GO TO L999;                                                     
             END;                                                               
          IF ^(B01.LØNNSTILSKUDD(SØKER_IND) = 'J' &                             
               U3S.LØNNSTILSKUDD            = 'X'   )   THEN                    
             DO;                                                                
                IF U3S.YRKE > 10               !                                
                   ^ (B01.YRKES_KODE(SØKER_IND) = 11  !                         
                      B01.YRKES_KODE(SØKER_IND) = 12  !                         
                      B01.YRKES_KODE(SØKER_IND) = 18    )  THEN                 
                DO;                                                             
 L681:                                                                          
                   FEIL_VED_LABEL = '681';                                      
                   FEIL_MELD_NR   = 681;                                        
                   GO TO L999;                                                  
                END;                                                            
             END;                                                               
       END;                                                                     
 L649:                                                                          
    IF B01.REAKTIVISERING(SØKER_IND) = 'J'    &                                 
       U3S.REAKTIVISERING            = ' '    &                                 
       B01.GARANTIGRAD(SØKER_IND)    >  0     &                                 
       U3S.UFG >= B01.GARANTIGRAD(SØKER_IND)      THEN                          
       DO;                                                                      
  /*HER KREVES DET AT REAKTIVISERING REGISTRERES SOM AVSLUTTET*/                
          FEIL_VED_LABEL = '649';                                               
          FEIL_MELD_NR   = 649;                                                 
          GO TO L999;                                                           
       END;                                                                     
    /* -------------------------------------------------------------- */        
    /* 071004: MH; DENNE TESTEN ER OVERFØRT FRA U603 DA VI PÅ DET     */        
    /*         TIDSPUNKT IKKE KAN TA HENSYN TIL OM DET ER REAKTIV-    */        
    /*         ISERINGSTIDSPUNKT SOM IKKE ER OPPHEVET                 */        
    /* -------------------------------------------------------------- */        
 L634:                                                                          
    IF (U3S.VIRK_DATO_ÅMD > 20040000        ) &                                 
       (B01.REAKTIVISERING(SØKER_IND) = ' ' &                                   
        U3S.REAKTIVISERING           ^= 'S' ) &                                 
        U3S.ATT_UF                   ^= 'A'   &  /* #713*/                      
       (U3S.LØNNSTILSKUDD      ^= 'S'       ) &                                 
       ((B01.LØNNSTILSKUDD(SØKER_IND)  = ' '  )  !                              
        (U3S.LØNNSTILSKUDD      = 'X'  )           ) &                          
       (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1) ^= U3S.UFT_ÅMD) & /* #962 */          
       (U3S.FRIINNTEKT_DATO_ÅMD = 0         ) THEN                              
       DO;  /* KRAV TIL REGISTRERING */                                         
       /* IF (B01.PENSJONSTYPE1(SØKER_IND)    = 'K'          &                  
              B01.STATUS_KODE_HIST(SØKER_IND) = 'X'          &                  
              B01.VIRK_DATO_ÅMD(SØKER_IND) = HJ_VIRK_DATO_ÅMD) THEN             
             DO;                                                                
                                                                                
                U3S.FRIINNTEKT_DATO_ÅMD = U3S.VIRK_DATO_ÅMD + 1;                
             END;                                                               
          ELSE   */                                                             
             DO;                                                                
                FEIL_VED_LABEL = '634';                                         
                FEIL_MELD_NR   = 634;                                           
                GO TO L999;                                                     
             END;                                                               
       END; /* KRAV TIL REGISTRERING */                                         
 L635:                                                                          
     IF (B01.REAKTIVISERING(SØKER_IND) = 'J' &                                  
         U3S.REAKTIVISERING           ^= 'X' ) &                                
        (U3S.FRIINNTEKT_DATO_ÅMD       > 0   ) THEN                             
        DO;  /* SKAL IKKE FYLLES UT VED REAKTIVISERING */                       
           FEIL_VED_LABEL = '635';                                              
           FEIL_MELD_NR   = 635;                                                
           GO TO L999;                                                          
        END; /* SKAL IKKE FYLLES UT VED REAKTIVISERING */                       
    /* -------------------------------------------------------------- */        
    /* 241104: MH; OVERFØRT TESTER ANG. FRIINNTEKT FRA U603 DA VI     */        
    /*         OGSÅ MÅ TA HENSYN TIL HVA SOM LIGGER I STATUS          */        
    /* -------------------------------------------------------------- */        
  L679:                                                                         
    IF U3S.FRIINNTEKT_DATO_ÅMD > 0              &                               
       B01.LØNNSTILSKUDD(SØKER_IND) = 'J'       &                               
       U3S.LØNNSTILSKUDD     ^= 'X'           THEN                              
          DO;                                                                   
             FEIL_VED_LABEL = '679';                                            
             FEIL_MELD_NR   = 679;                                              
             GO TO L999;                                                        
          END;                                                                  
                                                                                
    IF (B01.UFØRPENS.GARANTIGRAD(SØKER_IND) >  0       &                        
        B01.UFØRPENS.GARANTIGRAD(SØKER_IND) <= U3S.UFG ) !                      
       (U3S.REAKTIVISERING                  =  'X'     ) THEN                   
       DO;  /* HER SKAL FIINNTEKTSDATO SETTES LIK NYTT VIRK */                  
            /* DET GJØRES I U622 */                                             
       END; /* HER SKAL FIINNTEKTSDATO SETTES LIK NYTT VIRK */                  
    ELSE                                                                        
    IF (U3S.FRIINNTEKT_DATO_ÅMD > 0                        &                    
        U3S.FRIINNTEKT_DATO_ÅMD <(HJ_VIRK_DATO_ÅMD + 10000)) THEN               
       DO;  /* MINST ETT ÅR ETTER VIRK */                                       
          /* REMEDY 962 IKKE KRAV VED TIDLIGERE AFP                             
          IF (B01.PENSJONSTYPE1(SØKER_IND)    = 'K'          &                  
              B01.STATUS_KODE_HIST(SØKER_IND) = 'X'          &                  
              B01.VIRK_DATO_ÅMD(SØKER_IND) = HJ_VIRK_DATO_ÅMD) THEN             
             DO;                                                                
             END;                                                               
          ELSE                      */                                          
          IF (U3S.UFG = B01.UFØRPENS.GARANTIGRAD(SØKER_IND) &                   
              U3S.LØNNSTILSKUDD                     = 'X'   ) THEN              
             DO;  /* IKKE VED OPPHØR AV LØNNSTILSKUDD */                        
             END; /* IKKE VED OPPHØR AV LØNNSTILSKUDD */                        
          ELSE                                                                  
             DO;                                                                
                /* REMEDY 973 KORRIGERT TILBAKE */                              
                 FEIL_VED_LABEL = '635';                                        
                 FEIL_MELD_NR   = 643;                                          
                 GO TO L999;                                                    
              END;                                                              
                                                                                
        /* U3S.FRIINNTEKT_DATO_ÅMDNR = 643  REMEDY 973 */                       
       END; /* MINST ETT ÅR ETTER VIRK */                                       
                                                                                
 /* *************************************************************** */          
 /*  GARANTI_TP . BLANKETTER MÅ  AVVISES NÅR UFG REDUSERES.TS 0992  */          
 /* *************************************************************** */          
   L300:                                                                        
    IF B01.GARANTI_TP(SØKER_IND)  > 0  THEN                                     
       DO;                                                                      
         IF B01.UFØRHIST.UFG (SØKER_IND,SISTE_UTFYLTE) >                        
                U3S.UFG    THEN                                                 
            DO;                                                                 
               FEIL_VED_LABEL = '300';                                          
               FEIL_MELD_NR   = 383;                                            
               GO TO L999;                                                      
            END;                                                                
       END;                                                                     
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* HVIS SØKEREN HAR PENSJONSSTATUS                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
    STATUS_TYPE_SØKER = DIV_PARAM_OMR.STATUS_TYPE;                              
                                                                                
           /* ***********************************************  */               
           /* ETTERFØLGENDE TESTER GJELDER DISSE STATUS-TYPER: */               
           /* - B - BYGGER PÅ SISTE STATUS                     */               
           /* - D - BYGGER PÅ NEST SISTE STATUS                */               
           /* - G - BYGGER PÅ NEST SISTE STATUS, ER OPPHØRT I  */               
           /*       SISTE STATUS MED X (IKKE DØD)              */               
           /* ************************************************ */               
                                                                                
                                                                                
    IF (STATUS_TYPE_SØKER = 'B' !                                               
        STATUS_TYPE_SØKER = 'D' !                                               
        STATUS_TYPE_SØKER = 'G' ) THEN                                          
       DO;  /* STATUS_TYPE_SØKER = B!D!G ( HAR STATUS) */                       
          IF (B01.TKNR(SØKER_IND)  >  0        &                                
              B01.TKNR(SØKER_IND)  ^= U3S.TKNR) &                               
              B01.SIVILSTAND(SØKER_IND) ^= 'A' THEN                             
              B02.TKNR(SØKER_IND) = U3S.TKNR;                                   
                                                                                
          IF (B01.PENSJONSTYPE1(SØKER_IND) = 'L') THEN                          
             DO;                                                                
                /* -------------------------------------------------- */        
                /* SØKER ER REGISTRERT SOM FORSØRGET BARN.            */        
                /* FORSØRGINGSTILLEGGET MÅ OPPHØRE FØR UFØREPENSJON   */        
                /* KAN REGISTRERES.                                   */        
                /* -------------------------------------------------- */        
  L102:                                                                         
                FEIL_VED_LABEL = '102';                                         
                FEIL_MELD_NR   = 1720;                                          
                GO TO L999;                                                     
             END;                                                               
                                                                                
          IF (B01.PENSJONSTYPE1(SØKER_IND) = 'K') THEN                          
             DO;                                                                
                /* -------------------------------------------------- */        
                /* SØKER HAR AVTALEFESTET PENSJON FRA FØR.            */        
                /* -------------------------------------------------- */        
        L103:                                                                   
                  FEIL_VED_LABEL = '103';                                       
                  FEIL_MELD_NR   = 1104;                                        
                  GO TO L999;                                                   
               END;                                                             
                                                                                
          IF (B01.PENSJONSTYPE1(SØKER_IND) = 'U' !                              
              B01.PENSJONSTYPE1(SØKER_IND) = 'Y' )    &                         
              B01.UFT_ÅMD (SØKER_IND,SISTE_UTFYLTE) > ( U3S.UFT_ÅMD) &          
               U3S.ATT_UF  ^= 'A'                                               
                                                              THEN              
                                                                                
 /* ***************************************************************** */        
 /* SØKER ER REGISTRERT FRA FØR SOM UFØREPENSJONIST MED ET UFØRE-     */        
 /* TIDSPUNKT SENERE ENN DET SOM NÅ BLIR RAPPORTERT                   */        
 /* ***************************************************************** */        
                                                                                
             DO;                                                                
  L110:                                                                         
                FEIL_VED_LABEL = '110';                                         
                FEIL_MELD_NR   = 1711;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
             IF B01.VERNEPLIKTÅR(SØKER_IND,1) > 0 &                             
                U3S.VP_ÅR(1) = 0 THEN                                           
                                                                                
 /* ***************************************************************** */        
 /* SØKEREN REGISTRERT MED OPPLYSNING OM VERNEPLIKTSÅR, TRANSAKSJONER */        
 /* INNEHOLDER IKKE DETTE                                             */        
 /* ***************************************************************** */        
                                                                                
                DO;                                                             
  L120:                                                                         
                   FEIL_VED_LABEL = '120';                                      
                   FEIL_MELD_NR   = 1707;                                       
                   GO TO L999;                                                  
                END;                                                            
             ELSE                                                               
                DO;                                                             
                /*   IF B01.OPPHØRSDATO_ÅMD(                                    
                        SØKER_IND,SISTE_PERIODE) > (                            
                                                   U3S.UFT_ÅMD) THEN            
                      KORRIGERT FORRIGE STMT, SISTE_ VAR FEIL MH 2004 */        
                   /* R962 KORRIGERT FRA UFT TIL VIRKDATO */                    
      /*           IF B01.OPPHØRSDATO_ÅMD(SØKER_IND,SISTE_UTFYLTE) >            
                      (U3S.VIRK_DATO_ÅMD) THEN             */                   
                                                                                
 /* ***************************************************************** */        
 /* SØKER ER REGISTRERT MED OPPHØRSDATO I UFØREHISTORIKK SENERE ENN   */        
 /* UFØRETIDSPUNKT I TRANSEN - FJERNET 200504 ETTER KONF. MED GH      */        
 /* ***************************************************************** */        
                                                                                
     /*               DO;                                                       
  L130:                                                                         
                          FEIL_VED_LABEL = '130';                               
                          FEIL_MELD_NR   = 1712;                                
                           GO TO L999;                                          
                      END;                           */                         
                END;                                                            
          IF U3S.FNR_EK > 0 THEN                                                
             DO;  /* DET ER EN EKTEFELLE I TRANSEN */                           
                SELECT ( B01.SIVILSTAND(SØKER_IND));                            
                   WHEN ('U')                                                   
                      DO;  /* HVIS SØKEREN ER REG UGIFT */                      
   L140:                                                                        
                         FEIL_VED_LABEL = '140';                                
                         FEIL_MELD_NR   = 1001;                                 
                         GO TO L999;                                            
                      END; /* HVIS SØKEREN ER REG UGIFT */                      
                   WHEN ('S')                                                   
                      DO;  /* HVIS SØKEREN ER REG SKILT */                      
  L150:                                                                         
                         FEIL_VED_LABEL = '150';                                
                         FEIL_MELD_NR   = 1002;                                 
                         GO TO L999;                                            
                      END; /* HVIS SØKEREN ER REG SKILT */                      
                   WHEN ('E')                                                   
                      DO;  /* HVIS SØKEREN ER REG ETTERLATT */                  
  L160:                                                                         
                         FEIL_VED_LABEL = '160';                                
                         FEIL_MELD_NR   = 1003;                                 
                         GO TO L999;                                            
                      END; /* HVIS SØKEREN ER REG ETTERLATT */                  
                   OTHERWISE                                                    
                      DO;  /* ELLERS ER SØKEREN REG "GIFT" */                   
                         IF (B01.FNR(EKTEF_IND) ^= U3S.FNR_EK) THEN             
                            DO;  /* ANNEN EKTEFELLE I PENSJONSSTATUS */         
  L170:                                                                         
                               FEIL_VED_LABEL = '170';                          
                               FEIL_MELD_NR   = 1004;                           
                               GO TO L999;                                      
                            END; /* ANNEN EKTEFELLE I PENSJONSSTATUS */         
                                                                                
 /* ***************************************************************** */        
 /* DET FORUTSETTES NÅ AT EKTEFELLEN ER I SØKERENS PENSJONSSTATUS     */        
 /* ***************************************************************** */        
                                                                                
                         ELSE                                                   
                            DO;                                                 
                                                                                
 /* ***************************************************************** */        
 /* HVIS DET SØKES OM EKTEFELLETILLEGG                                */        
 /* ***************************************************************** */        
                                                                                
                               IF U3S.TILL_EK = 'J' THEN                        
                                  DO;                                           
 /* ***************************************************************** */        
 /* HVIS EKTEFELLEN HAR EGEN PENSJON                                  */        
 /* ***************************************************************** */        
                                                                                
                                     IF (                                       
                                           B01.PENSJONSTYPE1(EKTEF_IND)         
                                                              = 'A' !           
                                           B01.PENSJONSTYPE1(EKTEF_IND)         
                                                              = 'U' !           
                                           B01.PENSJONSTYPE1(EKTEF_IND)         
                                                              = 'Y' !           
                                           B01.PENSJONSTYPE1(EKTEF_IND)         
                                                              = 'K'  )          
                                                                   THEN         
                                          DO;                                   
  L180:                                                                         
                                             FEIL_VED_LABEL = '180';            
                                             FEIL_MELD_NR   = 1011;             
                                             GO TO L999;                        
                                          END;                                  
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR IKKE PENSJON                                       */        
 /* ***************************************************************** */        
                                                                                
                                       ELSE                                     
                                          DO;                                   
                                             CALL                               
                                                 FLYTT_B01_TIL_B02(             
                                                            SØKER_IND);         
                                             IF FEIL_MELD_NR > 0 THEN           
                                                GO TO L999;                     
                                             ELSE                               
                                                PROGRAM_ID = 'R001U620';        
                                             CALL                               
                                                 FLYTT_B01_TIL_B02(             
                                                            EKTEF_IND);         
                                             IF FEIL_MELD_NR > 0 THEN           
                                                GO TO L999;                     
                                             ELSE                               
                                                PROGRAM_ID = 'R001U620';        
                                             CALL                               
                                              AJOURFØR_B02_MED_U3TRANS;         
                                             IF FEIL_MELD_NR > 0 THEN           
                                               GO TO L999;                      
                                          END;                                  
                                    END;                                        
                                                                                
 /* ***************************************************************** */        
 /* DET SØKES IKKE OM EKTEFELLETILLEGG                                */        
 /* ***************************************************************** */        
                                                                                
                                 ELSE                                           
                                    DO;                                         
                                       CALL                                     
                                       FLYTT_B01_TIL_B02(SØKER_IND);            
                                       IF FEIL_MELD_NR > 0 THEN                 
                                          GO TO L999;                           
                                       ELSE                                     
                                          PROGRAM_ID = 'R001U620';              
                                       CALL                                     
                                       FLYTT_B01_TIL_B02(EKTEF_IND);            
                                       IF FEIL_MELD_NR > 0 THEN                 
                                          GO TO L999;                           
                                       ELSE                                     
                                          PROGRAM_ID = 'R001U620';              
                                       CALL                                     
                                       AJOURFØR_B02_MED_U3TRANS;                
                                       IF FEIL_MELD_NR > 0 THEN                 
                                          GO TO L999;                           
                                    END;                                        
                              END;                                              
                        END;                                                    
                  END;                                                          
               END;                                                             
                                                                                
 /* ***************************************************************** */        
 /* DET ER INGEN EKTEFELLE I TRANSEN                                  */        
 /* ***************************************************************** */        
                                                                                
            ELSE                                                                
                                                                                
 /* ***************************************************************** */        
 /* HVIS SØKERENS SIVILSTAND ER 'G' ELLER 'A'...                      */        
 /* ***************************************************************** */        
                                                                                
                  IF (                                                          
                       B01.SIVILSTAND(SØKER_IND) = 'G' !                        
     /*9710 HL*/       B01.SIVILSTAND(SØKER_IND) = 'P' !                        
                       B01.SIVILSTAND(SØKER_IND) = 'W' !                        
                       B01.SIVILSTAND(SØKER_IND) = 'V' !                        
                       B01.SIVILSTAND(SØKER_IND) = 'A') THEN                    
                     DO;                                                        
   L190:                                                                        
                        FEIL_VED_LABEL = '190';                                 
                        FEIL_MELD_NR   = 1102;                                  
                        GO TO L999;                                             
                     END;                                                       
                  ELSE                                                          
                     DO;                                                        
                        IF SØKER_IND > 3                      THEN              
                           CALL FLYTT_B01_TIL_B02(3);                           
                        ELSE                                                    
                           CALL FLYTT_B01_TIL_B02(SØKER_IND);                   
                        IF FEIL_MELD_NR > 0 THEN                                
                           GO TO L999;                                          
                                                                                
                        PROGRAM_ID          = 'R001U620'   ;                    
                                                                                
                        IF (B01.PENSJONSTYPE1(SØKER_IND) = 'B' !                
                            B01.PENSJONSTYPE1(SØKER_IND) = 'N') THEN            
                           DO;  /* AVDØD MOR/FAR FLYTTES */                     
                              B02.PERSON(1) = B01.PERSON(1);                    
                              B02.PERSON(2) = B01.PERSON(2);                    
                           END;                                                 
                        IF B01.PENSJONSTYPE1(SØKER_IND) = 'E' !                 
                           B01.PENSJONSTYPE2(SØKER_IND) = 'E'   THEN            
                           B02.PERSON(EKTEF_IND) =                              
                                            B01.PERSON(EKTEF_IND);              
                        CALL AJOURFØR_B02_MED_U3TRANS;                          
                        IF FEIL_MELD_NR > 0 THEN                                
                           GO TO L999;                                          
                     END;                                                       
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
                                                                                
 /* **************************************************************** */         
 /* SØKER ER I BASEN, HAR IKKE PENSJONSSTATUS                        */         
 /* ELLER HAR EN OPPHØRT PENSJONSSTATUS (STATUS_KODE_HIST = O / X)   */         
 /* **************************************************************** */         
 /* KS 6/12-84 */                                                               
            /**************************************************/                
            /* DET ETTERFØLGENDE GJELDER DISSE STATUS_TYPER:  */                
            /* - A - IKKE STATUS-SEGMENT ELLER STATUS-SEGMENT */                
            /*       SOM ER OPPHØRT, STATUS_KODE_HIST = 'O'   */                
            /*       INGEN OPPL. FRA STATUS SKAL MED I B02    */                
            /* - C - IKKE STATUS_SEGMENT                      */                
            /* - I - HAR STATUS_SEGMENT(SS) SOM ER HISTORISK, */                
            /*       STATUS_KODE_HIST = 'X', UFØREHISTORIKKEN */                
            /*       SKAL VÆRE MED OVER TIL B02               */                
            /* - K - HAR STATUS_SEGMENT(NS) SOM ER HISTORISK  */                
            /*       STATUS_KODE_HIST = 'X', UFØREHISTORIKKEN */                
            /*       SKAL VÆRE MED OVER TIL B02.              */                
            /* ********************************************** */                
                                                                                
                                                                                
            IF B01.FNR(SØKER_IND) > 0 THEN                                      
               DO;                                                              
                  IF SØKER_IND > 3                      THEN                    
                     CALL FLYTT_B01_TIL_B02(3);                                 
                  ELSE                                                          
                     CALL FLYTT_B01_TIL_B02(SØKER_IND);                         
                  IF FEIL_MELD_NR > 0 THEN                                      
                     GO TO L999;                                                
                  ELSE                                                          
                     PROGRAM_ID = 'R001U620';                                   
                                                                                
                  B02.NAVN(SØKER_IND)     =  U3S.NAVN;                          
               END;                                                             
            ELSE                                                                
                                                                                
 /* ***************************************************************** */        
 /* ROTSEGMENTOPPLYSNINGER.                                           */        
 /* ***************************************************************** */        
                                                                                
               DO;                                                              
                  B02.FNR (SØKER_IND)     =  U3S.FNR;                           
                  B02.NAVN(SØKER_IND)     =  U3S.NAVN;                          
                  B02.TKNR(SØKER_IND)     =  U3S.TKNR;                          
                  B02.SPRÅK(SØKER_IND)    =  U3S.SPRÅK;                         
                  B02.SIVILSTAND(SØKER_IND)    =  U3S.SIVILSTAND;               
               END;                                                             
                                                                                
 /* ***************************************************************** */        
 /* HVIS DET ER EKTEFELLE I TRANSEN                                   */        
 /* ***************************************************************** */        
                                                                                
            IF U3S.FNR_EK > 0 THEN                                              
               DO;                                                              
                  POS_I_B01 = EKTEF_IND;                                        
                  SEARCH_FNR = U3S.FNR_EK;                                      
                  EXEC CICS LINK PROGRAM('R0019928') COMMAREA(KOM_OMR);         
                  IF FEIL_MELD_NR > 0 THEN                                      
                     GO TO L999;                                                
                  ELSE                                                          
                     PROGRAM_ID = 'R001U620';                                   
                                                                                
 /* ***************************************************************** */        
 /* HVIS EKTEFELLEN IKKE HAR PENSJONSSTATUS                           */        
 /* ***************************************************************** */        
                                                                                
                  IF STATUS_TYPE = 'A' !                                        
                     STATUS_TYPE = 'I' !                                        
                     STATUS_TYPE = 'K' !   /* KS 6/12-84 */                     
                     STATUS_TYPE = 'Z' !   /*SP 23.08.01*/                      
                     STATUS_TYPE = 'C' THEN                                     
                     DO;                                                        
                                                                                
 /* ***************************************************************** */        
 /* HVIS EKTEFELLEN ER I BASEN MEN IKKE HAR PENSJONSSTATUS            */        
 /* ***************************************************************** */        
                                                                                
                        IF B01.FNR(EKTEF_IND) > 0 THEN                          
                           DO;                                                  
                              CALL FLYTT_B01_TIL_B02 (EKTEF_IND);               
                              IF FEIL_MELD_NR > 0 THEN                          
                                 GO TO L999;                                    
                              ELSE                                              
                                 PROGRAM_ID = 'R001U620';                       
                                                                                
                              B02.NAVN(EKTEF_IND)     =  U3S.NAVN_EK;           
                              B02.TKNR(EKTEF_IND)     =  U3S.TKNR;              
                           END;                                                 
                        ELSE                                                    
                                                                                
 /* ***************************************************************** */        
 /* ROTSEGMENTOPPLYSNINGER.                                           */        
 /* ***************************************************************** */        
                                                                                
                           DO;                                                  
                              B02.FNR (EKTEF_IND)     =  U3S.FNR_EK;            
                              B02.NAVN(EKTEF_IND)     =  U3S.NAVN_EK;           
                              B02.TKNR(EKTEF_IND)     =  U3S.TKNR;              
                              B02.SPRÅK(EKTEF_IND)    =  U3S.SPRÅK;             
                           END;                                                 
                                                                                
                        CALL OPPRETT_STATUS_U3_SØKER;                           
                        IF FEIL_MELD_NR > 0 THEN                                
                           GO TO L999;                                          
                                                                                
                        IF B01.PENSJONSTYPE1(EKTEF_IND) = ' ' &                 
  /*0296 HL*/   B01.STATUS_KODE_HIST(EKTEF_IND) ^= 'X'   THEN                   
                           B02.FØRSTE_GANG_REG(EKTEF_IND) = 'J';                
                                                                                
                        CALL KOBLE_TO_PERSONER(SØKER_IND,                       
                                                      EKTEF_IND);               
                     END;                                                       
                  ELSE                                                          
                     DO;                                                        
                                                                                
 /* ***************************************************************** */        
 /* HVIS EKTEFELLEN HAR PENSJONSSTATUS                                */        
 /* ***************************************************************** */        
                                                                                
                        IF STATUS_TYPE = 'F' !                                  
                           STATUS_TYPE = 'H' THEN                               
  L195:                                                                         
                           DO;                                                  
                              FEIL_VED_LABEL = '195';                           
                              FEIL_MELD_NR   = 1716;                            
                              GO TO L999;                                       
                           END;                                                 
                        ELSE                                                    
                           DO;                                                  
                              FEIL_VED_LABEL = '195';                           
                              FEIL_MELD_NR   = 1008;                            
                              GO TO L999;                                       
                                                                                
                           END;                                                 
                     END;                                                       
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  CALL OPPRETT_STATUS_U3_SØKER;                                 
                  IF FEIL_MELD_NR > 0 THEN                                      
                     GO TO L999;                                                
               END;                                                             
                                                                                
         END; /*ER FLYTTET FØR TEST PÅ REDUSERT ANTALL_BUP_ÅR */                
              /*TRUDE 270792                                  */                
                                                                                
 /*NY NORDISK KONVENSJON FRA 1.1.94 :       1195 HL   */                        
     IF B02.TT_16_66(SØKER_IND) > 0 THEN                                        
        W_TT_NORSK_FAKTISK_MND = B02.TT_16_66(SØKER_IND);                       
     ELSE                                                                       
        W_TT_NORSK_FAKTISK_MND = B02.TT_FØR_1967(SØKER_IND) * 12 +              
                             B02.TT_ETTER_1966(SØKER_IND);                      
     DIV_PARAM_OMR.TT_NORSK_FAKTISK =                                           
                       W_TT_NORSK_FAKTISK_MND;      /*9812*/                    
     IF (U3S.ATT_UF ^= 'X' &                                                    
        (U3EØS.BEREGN_FOLKETRYGD ^= ' ' !                                       
         U3EØS.EØS_8_4_3A ^= ' ' !                                              
         U3EØS.TT_FAKTISK_NORDISK_ÅR > 0 !                                      
         U3EØS.TT_FAKTISK_NORDISK_MND> 0 !                                      
         U3EØS.PÅ_FAKTISK_NORDISK> 0     ))THEN                                 
        B02.TT_FAKTISK_NORSK_MND(SØKER_IND) =                                   
                       W_TT_NORSK_FAKTISK_MND;      /*9812*/                    
   /*                   (TT_NORSK_FAKTISK_MND + 6) / 12  */                     
     IF DIV_PARAM_OMR.TT_NORSK_FAKTISK > 480     THEN                           
        DIV_PARAM_OMR.TT_NORSK_FAKTISK = 480;                                   
     HJ_TT_FRAMT = B02.TT_FRAMT(SØKER_IND);                                     
     DIV_PARAM_OMR.TT_NORSK_FRAMT = B02.TT_FRAMT(SØKER_IND);                    
                                                                                
  /*     IF B02.TT_FAKTISK_NORDEN(SØKER_IND)   > 0         THEN                 
            B02.TT_FRAMT(SØKER_IND) = B02.TT_FRAMT(SØKER_IND) *                 
            DIV_PARAM_OMR.TT_NORSK_FAKTISK /                                    
            (DIV_PARAM_OMR.TT_NORSK_FAKTISK +                                   
              B02.TT_FAKTISK_NORDEN(SØKER_IND)) + 0.5;                          
        HIT ***********/                                                        
                                                                                
 /*LOVENDRING 1.1.91 - REDUSERT ANTALL BUP_ÅR - HL : */                         
                                                                                
     MAX_BUP = (HJ_TT_FRAMT + 6) / 12;                                          
     /*TT_RED BLIR INITIERT I N824*/                                            
     IF TT_RED = 'J'    &                 /*FEIL 8 - 9803 HL*/                  
        MAX_BUP < 40    THEN                                                    
        DO;                                                                     
            TIL_ÅR  = B02.UFØRHIST.UFT_ÅMD(SØKER_IND,UF_IND) / 10000            
                      + MAX_BUP;                                                
            IF (ALDER_67.ÅR) > TIL_ÅR         THEN                              
               B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(SØKER_IND,UF_IND)               
                   = MAX_BUP;                                                   
        END;                                                                    
                                                                                
    IF (B02.PENSJONSTYPE1(SØKER_IND) = 'U' !                                    
        B02.PENSJONSTYPE1(SØKER_IND) = 'Y' ) THEN                               
       DO;  /* OPPDATERER ANTALL BARN I STATUS-SEGMENTET */                     
          B02.ANTALL_BARN(SØKER_IND) = 0;                                       
          DO I = 1 TO 13 WHILE (B02.TILKN.FNR_TILKN(SØKER_IND,I) > 0);          
             IF (B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L' !                
                 B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V' !                
                 B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W' ) THEN           
                B02.ANTALL_BARN(SØKER_IND) =                                    
                   B02.ANTALL_BARN(SØKER_IND) + 1;                              
          END; /* DO I WHILE */                                                 
       END; /* OPPDATERER ANTALL BARN I STATUS-SEGMENTET */                     
                                                                                
                                                                                
 /* ************************************************************* */            
 /* NYTT UFØRE-TILFELLE . DET KAN ENDRE EN PERSONS POENG.         */            
 /* DATA SKRIVES UT TIL NORTRYGD-KONTORENE .                      */            
 /* ************************************************************* */            
    /*                                                                          
  CALL P900_NOR_DATA ((B02.FNR(SØKER_IND)),(B02.TKNR(SØKER_IND)));              
   */                                                                           
                                                                                
                                                                                
  IF   FEIL_MELD_NR                 =  0                        THEN            
       PROGRAM_ID                   = 'R001U620'                   ;            
 /* ************************************************************* */            
 /* KONTROLL AV REGISTRERT TT MOT POENGÅR - 200308 HL             */            
 /* ************************************************************* */            
                                                                                
  IF U3SP.TT_FRA1937_ÅR > 0              THEN                                   
     REGÅR = U3SP.TT_FRA1937_ÅR;                                                
  ELSE                                                                          
  IF U3SP.TT_E66_Å > 0                   THEN                                   
     REGÅR = U3SP.TT_E66_Å;                                                     
  IF REGÅR > 0 THEN                                                             
  DO;                                                                           
     SISTE = U3S.UFT_ÅMD / 10000  - 1;                                          
     DO I = 1967 TO SISTE;                                                      
        W_PI = B02.PINNTEKT.PI(SØKER_IND,I);  /*100    JD0405*/                 
        W_GV = GV_TAB_ARRAY.G_V(I);                                             
        IF W_PI > 0    THEN                                                     
           POENG_FIRE_DEC =  W_PI / W_GV;                                       
        ELSE                                                                    
           POENG_FIRE_DEC = 0;                                                  
        IF POENG_FIRE_DEC > RUNDING_0049     THEN                               
           POENGÅR = POENGÅR + 1;                                               
     END;                                                                       
     IF POENGÅR > REGÅR                 THEN                                    
  L196:                                                                         
         DO;                                                                    
            FEIL_VED_LABEL = '196';                                             
            FEIL_MELD_NR   = 0422;                                              
            GO TO L999;                                                         
         END;                                                                   
   END;                                                                         
                                                                                
    /* -------------------------------------------------------------- */        
  L999:                                                                         
     EXEC CICS RETURN;                                                          
                                                                                
                                                                                
    /* -------------------------------------------------------------- */        
        %INCLUDE R001U621;  /* OPPRETT_STATUS_U3_SØKER   */                     
        %INCLUDE R001U622;  /* AJOURFØR B02 MED U3 TRANS */                     
        %INCLUDE R001U623;  /* UNGE UFØRE                */                     
        %INCLUDE R001N824;  /* F_BEREGN_TT_FRAMT_UTLAND  */                     
        %INCLUDE R0019905;  /* REGN ALDER PR VIRKDATO    */                     
  /*    %INCLUDE R  19923   /* OPPRETT STATUS FOR BARN   */                     
        %INCLUDE R0019924;  /* KOBLE TO PERSONER         */                     
        %INCLUDE R0019926;  /* FLYTT B01 TIL B02         */                     
  /*    %INCLUDE R  19957      P900_NOR_DATA (FNR,TKNR)  */                     
        %INCLUDE R0019940;  /* UFØREPENSJON OPPHØRER     */                     
        %INCLUDE R0019934;  /* OPPHØR_KOBLING_TO_PERSONER*/                     
        %INCLUDE R0019954;  /* RULL_FORVENTET_INNT       */                     
        %INCLUDE R0019967;  /* RULL_FAI                  */                     
        %INCLUDE R0019968;  /* F_RULL_FORSI              */                     
        %INCLUDE R0019995;  /* KONV_FNR11_FNR13          */                     
 END U3TR;                                                                      
