 /*       SIST ENDRET 26/11-97 12.57.56 AV   SPA7339                  */00000000
                                                                        00000010
 /* ***************************************************************** */00000020
 /* IDENTIFIKASJON                                                    */00000030
 /*     R0019906 - PROGRAM SJEKKER OM ETT FNR ER ENDRET  .            */00000040
 /*                                                                   */00000050
 /* HENSIKT                                                           */00000060
 /*     PROGRAMMET BLIR KALT FOR HVERT FNR SOM SKAL SJEKKES OG DET    */00000070
 /*     FINNER RETURNERER MED DET ENDREDE FNR .                       */00000080
 /*                                                                   */00000090
 /* PROGRAMTILKNYTNING                                                */00000100
 /*     BLIR GITT KONTROLL FRA ALLE BALNKETT-STYREPROGRAM.            */00000110
 /*                                                                   */00000120
 /* ENDRET 25.08.84 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000130
 /*     RUTINEN LEGGES OM SLIK AT DEN LESER EN VSAM-FILE MED DD-NAVN  */00000140
 /*    'VSKJEDE'. DEN DANNES I FNR-ENDRINGSKJØRINGEN .                */00000150
 /*                                                                   */00000160
 /* ENDRET 06.09.84 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000170
 /*     RUTINEN SJEKKER IKKE MOT VSKJEDE OM FNR ER ENDRET FOR ET      */00000180
 /*     BESTEMT BRUKERID .                                            */00000190
 /*                                                                   */00000200
 /* ENDRET 08.03.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000210
 /*     RUTINEN SJEKKER IKKE MOT VSKJEDE OM FNR ER ENDRET FOR ET      */00000220
 /*     BESTEMT BRUKERID MED G I 2. POSISJON (SOM FOR CICS_IND).      */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
                                                                        00000260
 R00199:                                                                00000270
   PROC (COMMAREA_PEKER)   OPTIONS(MAIN);                               00000280
                                                                        00000290
   DCL                                                                  00000300
      COMMAREA_PEKER       PTR;                                         00000310
   DCL                                                                  00000320
      1 FNR_ENDR_REG BASED (COMMAREA_PEKER)                           , 00000330
        2 FNR1             FIXED  DEC  (11)                           , 00000340
        2 FNR2             FIXED  DEC  (11)                           , 00000350
        2 BRUKERID         CHAR        ( 4)                           ; 00000360
                                                                        00000370
   DCL                                                                  00000380
      1 REG,                                                            00000390
        2 KODE             CHAR        ( 1)     INIT   (' ')          , 00000400
        2 FNR_1            FIXED  DEC  (11)     INIT   (  0)          , 00000410
        2 FNR_2            FIXED  DEC  (11)     INIT   (  0)          ; 00000420
   DCL                                                                  00000430
      LEN                  FIXED  BIN  (15)     INIT   ( 13)          , 00000440
      TELL                 FIXED  BIN  (15)                           ; 00000450
   DCL                                                                  00000460
     (ADDR , STG ,LENGTH,SUBSTR)  BUILTIN                             , 00000470
      EP                   POINTER                                    , 00000480
      KEYBIT         BASED (EP)   BIT  (48)                           ; 00000490
                                                                        00000500
                                                                        00000510
 /* ***************************************************************** */00000520
 /*   EKSEKVERING                                                     */00000530
 /* ***************************************************************** */00000540
                                                                        00000550
                                                                        00000560
                                                                        00000570
      EXEC CICS HANDLE CONDITION NOTFND (NOT_FOUND)                  ;  00000580
                                                                        00000590
      FNR_ENDR_REG.FNR2             =    0                           ;  00000600
      EP                            =    ADDR (FNR_ENDR_REG.FNR1)    ;  00000610
                                                                        00000620
                                                                        00000630
      IF SUBSTR (FNR_ENDR_REG.BRUKERID , 2)  =  'G'      THEN           00000640
         GO  TO  NOT_FOUND;                                             00000650
                                                                        00000660
                                                                        00000670
      EXEC CICS READ DATASET('VSKJEDE')  INTO(REG) RIDFLD(KEYBIT)    ;  00000680
                                                                        00000690
      IF REG.FNR_2                  >    0         &                    00000700
         REG.FNR_2                 ^=    REG.FNR_1 &                    00000710
         REG.KODE                   =   'F'        THEN                 00000720
         DO;                                                            00000730
             FNR_ENDR_REG.FNR1      =    REG.FNR_1                   ;  00000740
             FNR_ENDR_REG.FNR2      =    REG.FNR_2                   ;  00000750
         END;                                                           00000760
                                                                        00000770
   EXEC CICS RETURN;                                                    00000780
                                                                        00000790
 NOT_FOUND:                                                             00000800
   EXEC CICS RETURN;                                                    00000810
                                                                        00000820
   END R00199;                                                          00000830
