 /*       SIST ENDRET 12/05-99 09.19.43 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/05-99 09.19.13 AV   JDA7339                  */00000010
 /*       SIST ENDRET 02/09-98 13.00.34 AV   SPA7339                  */00000020
  /* **************************************************************** */00000030
  /*IDENTIFIKASJON:                                                   */00000040
  /*    R0015601 - HOVEDPROGRAM I PLI                                 */00000050
  /*                                                                  */00000060
  /*    PROGRAMMERER: S. LUNDEBY , SFK , DESEMBER 1982                */00000070
  /*                                                                  */00000080
  /*HENSIKT:                                                          */00000090
  /*    SJEKKER ROT-SEGMENTET OM PERSONEN ER SPERRET                  */00000100
  /*    OG SPERRER DET MED :                                          */00000110
  /*                                                                  */00000120
  /*    ROT_SEGM. EKSISTERTE      :      J                            */00000130
  /*    ROT_SEGM. EKSISTERTE IKKE :      D     (FOR DUMMY-SEGM)       */00000140
  /*                                                                  */00000150
  /*PROGRAMTILKNYTNING:                                               */00000160
  /*                                                                  */00000170
  /*BRUKER                                                            */00000180
  /*                                                                  */00000190
  /* **************************************************************** */00000200
                                                                        00000210
  R001560 :                                                             00000220
    PROC            (COMMAREA_PEKER)                                    00000230
           OPTIONS  (MAIN);                                             00000240
                                                                        00000250
    %PAGE;                                                              00000260
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */00000270
                                                                        00000280
    %PAGE;                                                              00000290
    %INCLUDE P0019908;                              /* KOM_OMR        */00000300
                                                                        00000310
    %PAGE;                                                              00000320
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */00000330
                                                                        00000340
    %PAGE;                                                              00000350
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */00000360
                                                                        00000370
    %PAGE;                                                              00000380
       DCL 1 B01              BASED (B01_PEKER),                        00000390
    %INCLUDE P0019921;                              /* B01            */00000400
                                                                        00000410
    %PAGE;                                                              00000420
       DCL 1 B02              BASED (B02_PEKER),                        00000430
    %INCLUDE P0019921;                              /* B02            */00000440
                                                                        00000450
    %PAGE;                                                              00000460
    /* ************************************************************** */00000470
    /*                                                                */00000480
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000490
    /*                                                                */00000500
    /* ************************************************************** */00000510
                                                                        00000520
       DCL                                                              00000530
         ( ADDR , CSTG , LOW , STG , SUBSTR , DATE )  BUILTIN;          00000540
       DCL                                                              00000550
         PLITDLI ENTRY;                                                 00000560
                                                                        00000570
    /* ************************************************************** */00000580
    /*                                                                */00000590
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000600
    /*                                                                */00000610
    /* ************************************************************** */00000620
                                                                        00000630
    %INCLUDE DLIUIB;                                                    00000640
                                                                        00000650
       DCL                                                              00000660
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000670
       DCL                                                              00000680
           COMMAREA_PEKER            POINTER;                           00000690
       DCL                                                              00000700
           W01_HJELPE_PTR            POINTER;                           00000710
       DCL  OVER_RBA                 POINTER;                           00000720
                                                                        00000730
    /* ************************************************************** */00000740
    /*                                                                */00000750
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000760
    /*                                                                */00000770
    /* ************************************************************** */00000780
                                                                        00000790
       DCL 1  W01_OMR                   UNALIGNED,                      00000800
              2   I                     FIXED  BIN  (15)     INIT ( 0 ),00000810
              2   W02_ANT_GANGER_I_WAIT FIXED  BIN  (15)     INIT ( 0 ),00000820
              2   B                            CHAR (1)      INIT (' ');00000830
                                                                        00000840
   DCL 01   HELP_DATO      PIC '(8)9',                                  00000850
       01   HELP_DATO_C DEF   HELP_DATO       CHAR (8);                 00000860
                                                                        00000870
    /* ************************************************************** */00000880
    /*                                                                */00000890
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000900
    /*                                                                */00000910
    /* ************************************************************** */00000920
                                                                        00000930
       DCL 1  W01_DLI_PARAM,                                            00000940
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),     00000950
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),     00000960
              2   W02_REPL                CHAR (4)   INIT ('REPL'),     00000970
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00000980
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00000990
              2   W02_OUT2                CHAR (20)  INIT ((20)' '),    00001000
              2   W02_SPERREBEHANDLING    BIT  (1)   INIT ('0'B),       00001010
              2   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B);       00001020
                                                                        00001030
       DCL    W01_IO                 CHAR (100)      INIT ( (100) ' '); 00001040
       DCL    W01_HJELPE_IO          CHAR (100) BASED (W01_HJELPE_PTR); 00001050
                                                                        00001060
    /* ************************************************************** */00001070
    /*                                                                */00001080
    /*   DL1 SSA-OMRÅDER FOR ROT                                      */00001090
    /*                                                                */00001100
    /* ************************************************************** */00001110
                                                                        00001120
       DCL    SSA_UQUAL                         CHAR (9)  INIT ((9)' ');00001130
                                                                        00001140
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001150
              2    HDEL                         CHAR (17) INIT          00001160
                   ('RF0PERSN(FNR     '),                               00001170
              2    REL_OP                       CHAR (2)  INIT (' ='),  00001180
              2    PKEY               FIXED     DEC  (11) INIT ( 0  ),  00001190
              2    HP                           CHAR (1)  INIT (')' );  00001200
                                                                        00001210
    /* ************************************************************** */00001220
    /*                                                                */00001230
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00001240
    /*                                                                */00001250
    /* ************************************************************** */00001260
                                                                        00001270
    %PAGE;                                                              00001280
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00001290
                                                                        00001300
    %PAGE;                                                              00001310
       DCL 1  HF1              BASED (HF1_PCB_PEKER),                   00001320
    %INCLUDE P0012003;                         /* PCB                 */00001330
                                                                        00001340
                                                                        00001350
    DCL 1 OVERFOR_REC,                                                  00001360
          2 FRST           CHAR (9) INIT ('000000001'),                 00001370
          2 FNR            PIC '(11)9',                                 00001380
          2 REST           CHAR (52)  INIT ( (52) ' ' ), /*120599RF*/   00001390
          2 OVER_DATO      CHAR (08)  INIT ( (8) ' ' ); /*---"----*/    00001400
                                                                        00001410
    /* ************************************************************** */00001420
    /*                                                                */00001430
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001440
    /*     ---------------------------------------------------        */00001450
    /*                                                                */00001460
    /*                                                                */00001470
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001480
    /*                                                                */00001490
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001500
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001510
    /*                                                                */00001520
    /* ************************************************************** */00001530
                                                                        00001540
    DB_STATUS_KODE                          =   '  '         ;          00001550
    PROGRAM_ID                              =   'R0015602'   ;          00001560
    UIBPTR                                  =    UIB_PEKER   ;          00001570
    HELP_DATO                               =    DATO_2000;/*120599RF*/ 00001580
    OVER_DATO                               =    HELP_DATO_C;/*--"---*/ 00001590
                                                                        00001600
    /* ********************************************************** */    00001610
    /*        SJEKKER ROT-SEGM FINNES I HISTORIK DATABASE         */    00001620
    /* ********************************************************** */    00001630
    SSA1_RF0PERSN.PKEY                      =    SEARCH_FNR  ;          00001640
    CALL P020_LES_ROT_GHU;                                              00001650
                                                                        00001660
    IF   DLIUIB.UIBFCTR                    ^=    UIB_RC_OK         THEN 00001670
      DO;                                                               00001680
         /* ********************************************** */           00001690
         /* UIB'S RETURCODE ER UAKSEPTABEL                 */           00001700
         /* ********************************************** */           00001710
  L100:                                                                 00001720
         FEIL_MELD_NR                 =   500;                          00001730
         FEIL_VED_LABEL               =  '100';                         00001740
         GO TO L999;                                                    00001750
      END;                                                              00001760
                                                                        00001770
    EXEC CICS ENTER TRACEID(10) FROM (HF1.STATUS_KODE);                 00001780
                                                                        00001790
     SELECT    ( HF1.STATUS_KODE);                                      00001800
      WHEN     ('  ')                 /*     PERSONEN FINNES I DB.   */ 00001810
                                                                        00001820
        DO;                                                             00001830
            OVERFOR_REC.FNR = SEARCH_FNR  ;                             00001840
            EXEC CICS WRITE DATASET ( 'OVERFOR' )                       00001850
                            FROM    (OVERFOR_REC)                       00001860
                            RIDFLD  (OVER_RBA)                          00001870
                            RBA;                                        00001880
                                                                        00001890
            FEIL_MELD_NR                 =   382;                       00001900
            FEIL_VED_LABEL               =  '100';                      00001910
        END;                                                            00001920
                                                                        00001930
      WHEN ('GE')                /*      PERSONEN FINNES IKKE I DB.  */ 00001940
        DO;                                                             00001950
            FEIL_MELD_NR                 =   000;                       00001960
            FEIL_VED_LABEL               =  '000';                      00001970
        END;                                                            00001980
                                                                        00001990
                                                                        00002000
      OTHERWISE                                                         00002010
        DO;                                                             00002020
          /* ************************************************ */        00002030
          /*    UGYLDIG STATUSKODE FRA DLI                    */        00002040
          /* ************************************************ */        00002050
  L140:                                                                 00002060
          FEIL_MELD_NR    =  500;                                       00002070
          FEIL_VED_LABEL  = '140';                                      00002080
          DB_STATUS_KODE  =  HF1.STATUS_KODE;                           00002090
          GO TO L999;                                                   00002100
        END;                                                            00002110
     END;     /*   SELECT : STATUS-KODE ETTER KALL MOT ROT  */          00002120
                                                                        00002130
                                                                        00002140
                                                                        00002150
                                                                        00002160
                                                                        00002170
    %PAGE;                                                              00002180
    /* ************************************************************** */00002190
    /*                                                                */00002200
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00002210
    /*                                                                */00002220
    /* ************************************************************** */00002230
                                                                        00002240
    P020_LES_ROT_GHU:                                                   00002250
      PROC;                                                             00002260
                                                                        00002270
      CALL PLITDLI                              (W02_PARM_CT_4,         00002280
                                                 W02_GHU,               00002290
                                                 HF1,                   00002300
                                                 W01_IO,                00002310
                                                 SSA1_RF0PERSN);        00002320
    END P020_LES_ROT_GHU;                                               00002330
                                                                        00002340
                                                                        00002350
  L999:                                                                 00002360
                                                                        00002370
    EXEC CICS RETURN;                                                   00002380
  END    R001560;                                                       00002390
