 /*       SIST ENDRET 26/11-97 12.54.09 AV   SPA7339                  */00000000
 /* ***************************************************************  */ 00000010
 /* PROC FOR KONVERTERING AV DATO   ÅR                               */ 00000020
 /* ***************************************************************  */ 00000030
  KONV_HÅ_Å: PROC(IN_DATO) RETURNS (  PIC '99'    );                    00000040
  DCL IN_DATO     PIC '(4)9';                                           00000050
  DCL UT_DATO     PIC '99'     ;                                        00000060
  DCL 1 H_DATO,                                                         00000070
        02 HH     PIC '99'  INIT (00),                                  00000080
        02 ÅÅ     PIC '99'  INIT (00),                                  00000090
      1 H_DATO_IN DEF H_DATO PIC '9999';                                00000100
                                                                        00000110
  DCL 1 H_DATO_UT,                                                      00000120
        02 ÅÅ     PIC '99'  INIT (00),                                  00000130
      1 H_DATO_UT_PK  DEF H_DATO_UT  PIC '99';                          00000140
                                                                        00000150
  IF IN_DATO > 0 THEN                                                   00000160
     H_DATO_IN = IN_DATO;                                               00000170
  ELSE                                                                  00000180
     H_DATO_IN = 0      ;                                               00000190
                                                                        00000200
     H_DATO_UT = H_DATO, BY NAME;                                       00000210
                                                                        00000220
     UT_DATO = H_DATO_UT_PK;                                            00000230
                                                                        00000240
                                                                        00000250
     RETURN (UT_DATO);                                                  00000260
  END KONV_HÅ_Å;                                                        00000270
                                                                        00000280
