 /*       SIST ENDRET 19/06-91 10.18.45 AV   HERMAN                   */00000000
 /*       SIST ENDRET 14/06-91 09.38.51 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 08/05-91 13.25.23 AV   DYBVIK                   */00000020
 /******************************************************************* */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /************************                                            */00000050
 /*  PROGRAM-IDENT : R001TK08 - REGISTRERING TK-HISTORIKKER           */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS - HOVEDPROGRAM                          */00000070
 /*  PROGRAMMERER  : TUYEN                                            */00000080
 /*  PROGRAM LAGET : FEB 91                                           */00000090
 /******************************************************************* */00000100
 /*HENSIKT:                                                           */00000110
 /************                                                        */00000120
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN TIL TK-REGISTER.         */00000130
 /*  PROGRAMMETS TRANSKODE ER RT08.                                   */00000140
 /*  PROGRAMMET BLIR AKTIVISERT NÅR OPERATØREN TASTER INN 'H' I       */00000150
 /*  FUNKSJONSKODE, MAP S001018 MAPSET S001T23.                       */00000160
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */00000170
 /*  OG SENDER UT DET FØRSTE BILDET AV OPPLYSNINGER SOM SKAL          */00000180
 /*  REGISTRERES:                                                     */00000190
 /*     S ---> MAP S001022 MAPSET S001T23 -                           */00000200
 /*     D ---> MAP S001020 MAPSET S001T23 -                           */00000210
 /*     F ---> MAP S001021 MAPSET S001T23 -                           */00000220
 /*     X ---> MAP S001013 MAPSET S001TK3 - INNHENTING FUNKSJONSKODE  */00000230
 /*                                                                   */00000240
 /******************************************************************* */00000250
 /*PROGRAMTILKNYTTING:*/                                                00000260
 /**********************                                              */00000270
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = RT08.          */00000280
 /*  DENNE TRANSID SETTES I R001TK03.                                 */00000290
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAM AVHENGIG AV     */00000300
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN.                */00000310
 /*   S - SAMMENSLÅING      - RT60 - R001TK60                         */00000320
 /*   D - SPLITTING         - RT61 - R001TK61                         */00000330
 /*   F - FORESPØRSEL       - RT62 - R001TK62                         */00000340
 /*   X - NY FUNKSJONSKODE  - RT03 - R001TK03                         */00000350
 /******************************************************************* */00000360
 /*DATASETTOPPLYSNINGER:                                              */00000370
 /*************************                                           */00000380
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000390
 /******************************************************************* */00000400
 /*FEILMELDINGER:*/                                                     00000410
 /*********************                                               */00000420
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */00000430
 /*  IKKE HAR GYLDIG VERDI                                            */00000440
 /* ***************************************************************** */00000450
 R001TK8:                                                               00000460
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000470
                                                                        00000480
 %PAGE;                                                                 00000490
      %INCLUDE S001TK;     /*  MENY MAPSETTET  */                       00000500
 %PAGE;                                                                 00000510
      %INCLUDE S001T2;     /*  HISTORIKK-MAPSETTET  */                  00000520
 %PAGE;                                                                 00000530
      %INCLUDE P001TK03;   /*  KOM_OMRÅDE (BASED) */                    00000540
 %PAGE;                                                                 00000550
      %INCLUDE P001TK04;   /*  FUNKTAB            */                    00000560
 %PAGE;                                                                 00000570
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */              00000580
 %PAGE;                                                                 00000590
                                                                        00000600
   DCL                                                                  00000610
      (COMMAREA_PEKER,IDENT_PEKER,                                      00000620
       BMSMAPBR)                       POINTER;                         00000630
   DCL                                                                  00000640
      (DATE,NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                         00000650
                                                                        00000660
   DCL CURSOR_POS FIXED BIN(15) INIT (-1);                              00000670
                                                                        00000680
 /* SLUTT PÅ DEKLARASJON */                                             00000690
 /************************/                                             00000700
                                                                        00000710
  EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                            00000720
  EXEC CICS IGNORE CONDITION MAPFAIL       ;                            00000730
                                                                        00000740
  IF SEND_MAP THEN                                                      00000750
     DO;                                                                00000760
        SEND_MAP = '0'B;                                                00000770
                                                                        00000780
        ALLOCATE S001018O;                                              00000790
        EXEC CICS SEND MAP('S001018') MAPSET ('S001T23') ERASE;         00000800
     END;                                                               00000810
                                                                        00000820
  EXEC CICS RECEIVE MAP('S001018') MAPSET ('S001T23')                   00000830
           SET(BMSMAPBR);                                               00000840
                                                                        00000850
  /* LESER SKJERMBILDE MED STYRINGSKODE  */                             00000860
                                                                        00000870
  STYREKODE = S001018I.STYREKODEI;                                      00000880
                                                                        00000890
  SELECT(STYREKODE);                                                    00000900
      WHEN('S','s')                                                     00000910
        DO;                                                             00000920
            IF SUBSTR(FUNKSJON,1,1) ^= '' &                             00000930
               SUBSTR(FUNKSJON,2,1) ^= '' &                             00000940
               SUBSTR(FUNKSJON,3,1) ^= '' &                             00000950
               SUBSTR(FUNKSJON,4,1) ^= ''   THEN                        00000960
                                                                        00000970
               DO;                                                      00000980
                  TRANSKODE = 'RT60';                                   00000990
                                                                        00001000
                  /* SKRIVER MENY-SKJERMBILDE FOR HISTORIKK*/           00001010
                  ALLOCATE S001022O;                                    00001020
                                                                        00001030
                  S001022I.TIL_TKNRL = CURSOR_POS;                      00001040
                                                                        00001050
                  /* SKRIVER REGISTRERINGSBILDE FOR               */    00001060
                  /* SAMMENSLÅING-HISTORIKK                       */    00001070
                                                                        00001080
                  EXEC CICS SEND MAP('S001022') MAPSET('S001T23')       00001090
                        ERASE CURSOR;                                   00001100
               END;                                                     00001110
            ELSE                                                        00001120
               GOTO IKKE_TILGANG;                                       00001130
        END;                                                            00001140
                                                                        00001150
      WHEN('D','d')                                                     00001160
        DO;                                                             00001170
            IF SUBSTR(FUNKSJON,1,1) ^= '' &                             00001180
               SUBSTR(FUNKSJON,2,1) ^= '' &                             00001190
               SUBSTR(FUNKSJON,3,1) ^= '' &                             00001200
               SUBSTR(FUNKSJON,4,1) ^= ''   THEN                        00001210
                                                                        00001220
               DO;                                                      00001230
                  TRANSKODE = 'RT61';                                   00001240
                  ALLOCATE S001020O;                                    00001250
                  S001020I.FRA_TKNRL = CURSOR_POS;                      00001260
                                                                        00001270
                  /* SKRIVER REGISTRERINGSBILDE FOR               */    00001280
                  /* SPLITTING-HISTORIKK                          */    00001290
                                                                        00001300
                  EXEC CICS SEND MAP('S001020') MAPSET('S001T23')       00001310
                      ERASE CURSOR;                                     00001320
               END;                                                     00001330
            ELSE                                                        00001340
               GOTO IKKE_TILGANG;                                       00001350
        END;                                                            00001360
                                                                        00001370
      WHEN('F','f')                                                     00001380
        DO;                                                             00001390
            TRANSKODE  = 'RT62';                                        00001400
            PROGRAM_ID = 'R001TK62';                                    00001410
            EXEC CICS XCTL PROGRAM(PROGRAM_ID) COMMAREA(KOM_OMR);       00001420
        END;                                                            00001430
                                                                        00001440
      WHEN('X','x')                                                     00001450
        DO;                                                             00001460
            TRANSKODE = 'RT03';                                         00001470
                                                                        00001480
            /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */          00001490
            /* FUNKSJONSKODE                                */          00001500
                                                                        00001510
            EXEC CICS SEND MAP('S001013') MAPSET('S001TK3') ERASE;      00001520
        END;                                                            00001530
                                                                        00001540
      OTHERWISE                                                         00001550
        DO;                                                             00001560
            ALLOCATE S001018O;                                          00001570
            /* FEILMELDING 'UGYLDIG STYREKODE' SKRIVES */               00001580
            S001018O.MELDING1O   = 'UGYLDIG STYRINGSKODE';              00001590
            S001018O.STYREKODEA  = 'I';  /* MDT SET, HIGH INT */        00001600
            S001018O.STYREKODEO  = STYREKODE;                           00001610
            EXEC CICS SEND MAP('S001018') MAPSET('S001T23') ERASE;      00001620
                                                                        00001630
            TRANSKODE = 'RT08';                                         00001640
        END;                                                            00001650
  END;                                                                  00001660
                                                                        00001670
  GOTO NESTE;                                                           00001680
                                                                        00001690
  IKKE_TILGANG:                                                         00001700
     S001018O.MELDING1O = 'DU HAR IKKE TILGANG TIL DENNE FUNKSJON!';    00001710
                                                                        00001720
     EXEC CICS SEND MAP('S001018') MAPSET ('S001T23') ERASE;            00001730
                                                                        00001740
     TRANSKODE     = 'RT08';                                            00001750
                                                                        00001760
  NESTE:                                                                00001770
                                                                        00001780
  PROGRAM_ID = 'R001TK08';                                              00001790
  EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                00001800
                                                                        00001810
  FEILBEH:                                                              00001820
      TRANSKODE  = 'RT03';                                              00001830
      PROGRAM_ID = 'R001TK08';                                          00001840
                                                                        00001850
      /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */                00001860
      /* FUNKSJONSKODE                                */                00001870
                                                                        00001880
      EXEC CICS SEND MAP('S001013') MAPSET('S001TK3') MAPONLY ERASE;    00001890
                                                                        00001900
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);            00001910
                                                                        00001920
 %PAGE;                                                                 00001930
 END R001TK8;                                                           00001940
