 /*       SIST ENDRET 30/07-98 08.34.17 AV   JDA7339                  */00000000
 /*               R 0 0 1 1 8 3 3                                     */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /* **********************                                            */00000040
 /*  PROGRAM-IDENT : R0011833  KONTROLL_UF         SUBPROGRAM         */00000050
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000060
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */00000070
 /*  PROGRAMMET BLE LAGET : JUNI 1989                                 */00000080
 /*  ENDRINGERSDATO :                                                 */00000090
 /*  ENDRINGEN GJELDER:                                               */00000100
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*HENSIKT:                                                           */00000140
 /* **********                                                        */00000150
 /*  FORETAR KONTROLL AV BLANKETT UF.                                 */00000160
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */00000170
 /*                                                                   */00000180
 /*                                                                   */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 /*PROGRAMTILKNYTTING:                                                */00000220
 /* ********************                                              */00000230
 /*  PROGRAMMET INCLUDES AV R0011831 - KONTROLL_BANKETT_UF            */00000240
 /*  ARBEIDSOMRÅDET P0011831 ER INCLUDET I HOVEDPROG                  */00000250
 /*  BRUK :                                                           */00000260
 /*  CALL KONTROLL_UF_SØKER(FEIL_I_UP_SØKER);                         */00000270
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000280
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000290
 /*          R0019902 - F_KJØNN                                       */00000300
 /*          R0019904 - F_GYLDIG_FNR                                  */00000310
 /*          R0019905 - F_ALDER                                       */00000320
 /*          R0019910 - F_NUMERISK                                    */00000330
 /*          R0019912 - F_FELT_PIC_CHAR11                             */00000340
 /*          VERIFY   - BUILTIN-FUNCTION                              */00000350
 /* ***************************************************************** */00000360
 /*DATASETTOPPLYSNINGER:                                              */00000370
 /* ***********************                                           */00000380
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */00000390
 /*                                                                   */00000400
 /* ***************************************************************** */00000410
 /*FEILMELDINGER:                                                     */00000420
 /* *******************                                               */00000430
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */00000440
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000450
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */00000460
 /*                                                                   */00000470
 /* ***************************************************************** */00000480
 %PAGE;                                /*   */                          00000490
 /* ***************************************************************** */00000500
 KONTROLL_UF_SØKER:                                                     00000510
   PROC (FEIL_FUNNET);                                                  00000520
   DCL                                                                  00000530
      FEIL_FUNNET     BIT (1);                                          00000540
                                                                        00000550
   DCL                                                                  00000560
      W_FNR                                     PIC'(11)9';             00000570
   DCL                                                                  00000580
      1 FNR DEF W_FNR,                                                  00000590
        2 DAG                                   PIC'(2)9',              00000600
        2 MND                                   PIC'(2)9',              00000610
        2 AAR                                   PIC'(2)9',              00000620
        2 ÅRHUNDRE                              PIC'9',                 00000630
        2 REST                                  PIC'(4)9';              00000640
   DCL                                                                  00000650
      W_FNR13                                   PIC'(13)9';             00000660
   DCL                                                                  00000670
      W_FNR13ÅR      DEF W_FNR13 POS(5)         PIC'(4)9';              00000680
   DCL                                                                  00000690
      ALDER           FIXED DEC (7),                                    00000700
      ALDERSGRENSE    FIXED DEC (5),    /*HL*/                          00000710
      IÅR             FIXED BIN (15),                                   00000720
      J               FIXED BIN (15),                                   00000730
      TELL            FIXED BIN (15);                                   00000740
                                                                        00000750
 %SKIP;                                                                 00000760
   DCL                                                                  00000770
      HJ_UFT_ÅMD                                PIC '99999999',         00000780
      HJ_UFT_M DEF HJ_UFT_ÅMD POS(5)           PIC '99',                00000790
      HJ_UFT_Å DEF HJ_UFT_ÅMD POS(1)           PIC '9999';              00000800
 %SKIP;                                                                 00000810
   DCL                                                                  00000820
      1 FNR_REG,                                                        00000830
        2 FNR1      FIXED DEC(11),                                      00000840
        2 FNR2      FIXED DEC(11),                                      00000850
        2 BRUKERID  CHAR     ( 4);                                      00000860
 %PAGE;                                                                 00000870
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                         00000880
    FEIL_FUNNET      =  '0'B           ;                                00000890
                                                                        00000900
                                                                        00000910
    IF ^F_NUMERISK(F_FELT_PIC_CHAR11(UFS.FNR)) THEN                     00000920
       DO;                                                              00000930
          FEIL_FUNNET = '1'B;                                           00000940
          UFS.FNRNR   = 200;                                            00000950
       END;                                                             00000960
    ELSE                                                                00000970
        IF ^F_GYLDIG_FNR(UFS.FNR) THEN                                  00000980
          DO;                                                           00000990
             FEIL_FUNNET = '1'B;                                        00001000
             UFS.FNRNR   = 1;                                           00001010
          END;                                                          00001020
        ELSE                                                            00001030
            DO;                                                         00001040
              W_FNR13      = KONV_FNR11_FNR13(UFS.FNR);                 00001050
              FNR_REG.FNR1 = UFS.FNR;                                   00001060
              W_FNR        = UFS.FNR;                                   00001070
              EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);     00001080
                                                                        00001090
                IF FNR_REG.FNR2 > 0 THEN                                00001100
                  DO;                                                   00001110
                     UFS.FNRNR   = 203;                                 00001120
                     UFS.FNR_GML = UFS.FNR;                             00001130
                     UFS.FNR     = FNR_REG.FNR2;                        00001140
                     W_FNR       = FNR_REG.FNR2;                        00001150
                  END;                                                  00001160
                                                                        00001170
                   IF W_FNR13ÅR < 1923 !                                00001180
                      W_FNR13ÅR > 1944  THEN                            00001190
                     DO;                                                00001200
                        FEIL_FUNNET   = '1'B;                           00001210
                        UFS.FNRNR     = 293;                            00001220
                     END;                                               00001230
            END;                                                        00001240
                                                                        00001250
                                                                        00001260
    IF ^F_NUMERISK(F_FELT_PIC_CHAR8(UFS.UFT_ÅMD)) THEN                  00001270
       DO;                                                              00001280
          FEIL_FUNNET  = '1'B;                                          00001290
          UFS.UFT_ÅMDNR= 200;                                           00001300
       END;                                                             00001310
    ELSE                                                                00001320
       IF UFT_ÅMD = 0  THEN                                             00001330
       DO;                                                              00001340
          FEIL_FUNNET  = '1'B;                                          00001350
          UFS.UFT_ÅMDNR=  40;                                           00001360
       END;                                                             00001370
                                                                        00001380
                                                                        00001390
    IF UFS.UFT_ÅMDNR= 0   THEN                                          00001400
       DO;                                                              00001410
         HJ_UFT_ÅMD   = UFS.UFT_ÅMD;                                    00001420
                                                                        00001430
         IF HJ_UFT_M  > 0 &  HJ_UFT_M  <  13                            00001440
                       &  HJ_UFT_Å  <= 1966  THEN;                      00001450
         ELSE                                                           00001460
            DO;                                                         00001470
              FEIL_FUNNET   = '1'B;                                     00001480
              UFS.UFT_ÅMDNR =  40;                                      00001490
            END;                                                        00001500
       END;                                                             00001510
                                                                        00001520
    HJ_UFT_ÅMD   = UFS.UFT_ÅMD;                                         00001530
                                                                        00001540
    IF UFS.UFT_ÅMDNR= 0   THEN                                          00001550
         DO;                                                            00001560
           IF  UFS.UFT_ÅMD  > 19670100 THEN                             00001570
             DO;                                                        00001580
               FEIL_FUNNET    = '1'B;                                   00001590
               UFS.UFT_ÅMDNR  = 294;                                    00001600
             END;                                                       00001610
         END;                                                           00001620
                                                                        00001630
    IF UFS.UFT_ÅMDNR= 0   THEN                                          00001640
         DO;                                                            00001650
           ALDER                = F_ALDER(UFS.FNR,UFS.UFT_ÅMD);         00001660
                                                                        00001670
           IF ALDER        > 2600    THEN  /*FYLLER IKKE VILKÅRET: */   00001680
             DO;                           /*MÅ HA TAPT MINST 50% AV */ 00001690
                FEIL_FUNNET     = '1'B;    /*ERVERVSEVNEN FØR FYLTE  */ 00001700
                UFS.UFT_ÅMDNR   = 292;     /* 22 ÅR.                 */ 00001710
             END;                          /* ENDRET TIL 24 0592   */   00001720
                                           /* ENDRET TIL 26 0797   */   00001730
         END;                                                           00001740
                                                                        00001750
   END KONTROLL_UF_SØKER;                                               00001760
                                                                        00001770
