 /*   SIST ENDRET PÅ PROD   2008.05.31 11.27.41 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2004.12.16 13.44.04 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.16 13.42.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.26 15.42.28 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.02.23 13.17.39 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.23 13.16.22 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.54.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.26 13.16.18 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.13 10.19.25 AV   JDA2970          */        
  /* **************************************************************** */        
  /*IDENTIFIKASJON:                                                   */        
  /*     R0019E01 - HOVEDPROGRAM I CICS/PLI                           */        
  /*                                                                  */        
  /*PROGRAMMERER:                                                     */        
  /*     SATISH   JULY 2003                                           */        
  /*                                                                  */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  PROGRAMMET FORETAR FNR-ENDRING I P001-BASEN.                     */        
 /*   VIDERE FORETAS DET CALL TIL PROGRAM SOM FORETAR NØDVENDIGE      */        
 /*   NYE BEREGNINGER AV PENSJON PÅ GRUNNLAG AV ENDRINGENE.           */        
 /*  PROGRAMMET R0019E05 SKAL KJØRES ETTERPÅ FOR Å SKRIVE UT          */        
 /*   MELDINGER.                                                      */        
 /*  PROGRAM R0019001 SKAL OGSÅ KJØRES ETTERPÅ FOR UTSKRIVING AV      */        
 /*   STØNADSBREV.                                                    */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  EXEC CICS LINK TIL :                                             */        
 /*                                                                   */        
 /*     R0013101   HENTER DATA TIL B01                                */        
 /*     R0014901   AUTOHENDELSE_BEREGNING                             */        
 /*     R0015401   SKRIV B02                                          */        
 /*     R0016001   STAT TRANS                                         */        
 /*     R0019921   HENT MELDING FRA FEIL-MELD-BASEN                   */        
 /*                                                                   */        
 /*  INCLUDE På FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*     R0021201   FNR_ENDR I DSR, M/ PARAMETERLISTE                  */        
 /*     R0019961   OMREGNING_PGA_FNRENDRING                           */        
 /*     R0019956   BEREGNER GRUNNBELøP I ONLINE PROGRAM               */        
 /*                                                                   */        
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */        
 /*                                                                   */        
 /*          P0014009;                                 POENGREKKER    */        
 /*          P0019014;                                 FNR TAB/ST.BREV*/        
 /*          P0019906;                                 TRANS_OPPL_OMR */        
 /*          P0019908;                                 KOM_OMR        */        
 /*          P0019910;                                 STYRINGS_OMR   */        
 /*          P0019911;                                 TRANS_LISTE    */        
 /*          P0019912;                                 DIV_PARAM_OMR  */        
 /*          P0019921;                                 B00            */        
 /*          P0019924;                                 G_TAB          */        
 /*          P0019925;                                 G_V_TAB        */        
 /*          P0010601;                        TRANS_OMR FOR UFØRE     */        
 /*          P0019940;                                 TRANHIST       */        
 /*          P0019941;                                 GRUNNBAP       */        
 /*          P0019942;                                 GRUNNBUP       */        
 /*          P0019943;                                 GRBLUFST       */        
 /*          P0019944;                                 GRBLFORS       */        
 /*          P0019945;                                 GRUNNBEP       */        
 /*          P0019946;                                 GRBLFAMP       */        
 /*          P0019947;                                 GRBLEBEN       */        
 /*          P0019948;                                 GRBLEBBE       */        
 /*          P0019949;                                 ENDRBLAN       */        
 /*          P0019950;                                 OPPHBL1        */        
 /*          P0019951;                                 OPPHBL2        */        
 /*          P0019952;                                 BARN           */        
 /*          P0019995;                            KONV_FNR11_FNR13    */        
 /*          P0012002;                            PCB_UIB_PEKER_OMR   */        
 /*          P0012003;                            PCB                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  INPUT-DATSETTET ER VSAM-FILEN P001.FNRTILG OG RF-BASEN           */        
 /*  OUTPUT ER VSAMFILEN P001.FNRENDR,                                */        
 /*            VSAMFILEN P001.MELD.TRANS,                             */        
 /*            OPPDATERT RF-BASE,                                     */        
 /*            TRANSAKSJONSBASE TIL STATISTIKK OG                     */        
 /*            STØNADSBREV-BASEN                                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*  LISTE OVER FEIL SKRIVES UT                                       */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 R0019E:                                                                        
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                          
 %PAGE;                                                                         
      %INCLUDE S0019E;                 /* AU-MAPSETTET   */                     
                                                                                
    %INCLUDE P0014009;                              /* ????           */        
                                                                                
    %INCLUDE P0019014;                              /* FNR TAB/ST.BREV*/        
                                                                                
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */        
                                                                                
    %INCLUDE P0019908;                              /* KOM_OMR        */        
                                                                                
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */        
                                                                                
    DCL 1 TRANS_LISTE_OMR UNALIGNED BASED(TRANS_LISTE_PEKER),                   
        3 TRANS_LISTE_LINJE(5),                                                 
    %INCLUDE P0019911;                         /*  **  TRANS_LISTE ** */        
                                                                                
    DCL 1 WORK_TRANS_LISTE UNAL BASED(WORK_TRANS_LISTE_PEKER),                  
    %INCLUDE P0019911;                   /*       WORK_TRANS_LISTE    */        
                                                                                
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */        
    %PAGE;                                                                      
    %INCLUDE P0019924;                              /* G_V_TAB        */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019925;                              /*  G_TAB         */        
                                                                                
       DCL 1 B00              BASED (B00_PEKER),                                
    %INCLUDE P0019921;                              /* B00            */        
                                                                                
    %PAGE;                                                                      
       DCL 1 B01              BASED (B01_PEKER),                                
    %INCLUDE P0019921;                              /* B01            */        
                                                                                
    %PAGE;                                                                      
       DCL 1 B02              BASED (B02_PEKER),                                
    %INCLUDE P0019921;                              /* B02            */        
                                                                                
    %PAGE;                                                                      
       DCL 1 W02,                                   /* WORK-OMR FOR   */        
    %INCLUDE P0019921;                              /* B02            */        
                                                                                
    %PAGE;                                                                      
       DCL 1 TRANH_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019940;                              /* TRANHIST       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 ALDER_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019941;                              /* GRUNNBAP       */        
                                                                                
       DCL 1 AF_S           BASED (IO_PEKER),                                   
    %INCLUDE P0019967;                              /* GRUNNBAF       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 A1DER_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019N41;                              /* GRUNNBA1       */        
                                                                                
       DCL 1 KF_S           BASED (IO_PEKER),                                   
    %INCLUDE P0019U67;                              /* GRUNNBKF       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 UFØRP_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019942;                              /* GRUNNBUP       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 U2ØRP_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019N42;                              /* GRUNNBU2       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 U3_S           BASED (IO_PEKER),                                   
    %INCLUDE P0019U42;                              /* GRUNNBU3       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 GRUNN_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019943;                              /* GRBLUFST       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 FORSØ_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019944;                              /* GRBLFORS       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 ETT_E_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019945;                              /* GRUNNBEP       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 ETT_E3_S        BASED (IO_PEKER),                                  
    %INCLUDE P0019N45;                              /* GRUNNBE3       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 ETT_F_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019946;                              /* GRBLFAMP       */        
                                                                                
       DCL 1 E4_S        BASED (IO_PEKER),                                      
    %INCLUDE P0019N46;                              /* GRBLFAE4       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 ETT_B_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019947;                              /* GRBLEBEN       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 ETT_B6_S        BASED (IO_PEKER),                                  
    %INCLUDE P0019N47;                              /* GRBLEBB6       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 FOREL_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019948;                              /* GRBLEBBE       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 FOREL_F5_S        BASED (IO_PEKER),                                
    %INCLUDE P0019N48;                              /* GRBLF5BE       */        
                                                                                
       DCL 1 F7_S           BASED (IO_PEKER),                                   
    %INCLUDE P0019968;                              /* GRUNNBIF       */        
                                                                                
       DCL 1 FO_S           BASED (IO_PEKER),                                   
    %INCLUDE P0019N44;                              /* GRUNNBFO       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 YRKEP_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019960;                              /* GRUNNBYP       */        
       DCL 1 ENDRB_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019949;                              /* ENDRBLAN       */        
                                                                                
    %PAGE;                                                                      
       DCL 1 OPPB1_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019950;                              /* OPPHBL1        */        
                                                                                
    %PAGE;                                                                      
       DCL 1 OPPB2_S        BASED (IO_PEKER),                                   
    %INCLUDE P0019951;                              /* OPPHBL2        */        
                                                                                
    %PAGE;                                                                      
       DCL 1 BARN_S         BASED (IO_PEKER),                                   
    %INCLUDE P0019952;                              /* BARN           */        
                                                                                
       DCL 1 EN_S           BASED (IO_PEKER),                                   
    %INCLUDE P0019U49;                              /* ENBLAN1        */        
                                                                                
       DCL 1 EE_S            BASED (IO_PEKER),                                  
    %INCLUDE P0019U45;                              /* GRUNNBEE       */        
                                                                                
                                                                                
      %INCLUDE P0019E01;               /* TRANS-OMR FOR STYRT AUTOHE.*/         
                                                                                
      %INCLUDE DFHBMSCA;                                                        
                                                                                
   DCL  PLITDLI                     ENTRY;                                      
                                                                                
   DCL  (BMSMAPBR, COMMAREA_PEKER) PTR;                                         
                                                                                
   DCL   ( ADDR , CSTG , LOW , STG , SUBSTR , DATETIME , VERIFY ,               
           NULL , UNSPEC , STORAGE, ONCODE )  BUILTIN;                          
                                                                                
    /* ************************************************************** */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
       DCL UIB_RC_OK                 BIT  (8)      INIT ( 0 );                  
       DCL W01_HJELPE_PTR            POINTER;                                   
       DCL IO_PEKER                  POINTER;                                   
       DCL ENDR_PEKER                POINTER;                                   
       DCL MELD_PEKER                POINTER;                                   
                                                                                
    /* ************************************************************** */        
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */        
                                                                                
      DCL 1  PCB1             BASED (RF1_PCB_PEKER),                            
    %INCLUDE P0012003;                         /* PCB                 */        
                                                                                
       DCL 1  PCB2             BASED (RF2_PCB_PEKER),                           
    %INCLUDE P0012003;                         /* PCB                 */        
                                                                                
       DCL 1  PCB3             BASED (RF3_PCB_PEKER),                           
    %INCLUDE P0012003;                         /* PCB                 */        
                                                                                
    /* ************************************************************** */        
    /*   DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */        
    /*   KALL                                                         */        
    /**************************************************************** */        
                                                                                
       DCL                                                                      
         W01_PSB_NAVN          CHAR (8)       INIT('B0019E04'),                 
                                                                                
         W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),               
         W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');               
                                                                                
    /* ************************************************************** */        
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_DLI_PARAM,                                                    
              2   W02_GU                  CHAR (4)   INIT ('GU  '),             
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),             
              2   W02_GHNP                CHAR (4)   INIT ('GHNP'),             
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),             
              2   W02_DLET                CHAR (4)   INIT ('DLET'),             
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),             
              2   W02_REPL                CHAR (4)   INIT ('REPL'),             
              2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),                  
              2   W02_PARM_CT_2     FIXED BIN  (31)  INIT (2),                  
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                  
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                  
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),                  
              2   W02_PARM_CT_6     FIXED BIN  (31)  INIT (6);                  
       DCL    1   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B);               
       DCL    1   W02_MER_DATA            BIT  (1)   INIT ('1'B);               
       DCL    1   W02_ISRT_OK             BIT  (1)   INIT ('1'B);               
       DCL    1   W02_REPL_OK             BIT  (1)   INIT ('1'B);               
       DCL    1   W02_DLET_OK             BIT  (1)   INIT ('1'B);               
       DCL    1   W02_SS_ER_DØD           BIT  (1)   INIT ('0'B);               
       DCL    1   W02_OUT2                CHAR (20)  INIT ( (20) ' ');          
                                                                                
       DCL    W01_IO                 CHAR (340)      INIT ( '' );               
       DCL    W01_HJELPE_IO          CHAR (340) BASED (W01_HJELPE_PTR);         
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL    SSA_UQUAL              STATIC      CHAR (9) INIT ((9)' ');        
                                                                                
       DCL    SSA3_TILKN_UQUAL       STATIC      CHAR (9)                       
                                                 INIT ('TILKN    ');            
                                                                                
       DCL    SSA3_STATUS_F          STATIC      CHAR (11)                      
                                                 INIT ('STATUS  *F ');          
                                                                                
       DCL    SSA3_STATUS_L          STATIC      CHAR (11)                      
                                                 INIT ('STATUS  *L ');          
                                                                                
       DCL    SSA3_TRANHIST_F        STATIC      CHAR (11)                      
                                                 INIT ('TRANHIST*F ');          
                                                                                
       DCL 1  SSA1_RF0PERSN          STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('RF0PERSN(FNR     '),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA2_RF0PERSN          STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('RF0PERSN(FNR     '),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA3_RF0PERSN          STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('RF0PERSN(FNR     '),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA3_TILKN             STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('TILKN   (FNRANDR '),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA3_STATUS            STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('STATUS  (STATKODE'),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    KODE                          CHAR (1)   INIT ('S'),         
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA4_STATUS            STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('STATUS  (STATKODE'),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    KODE                          CHAR (1),                      
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA5_TRANHIST          STATIC,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('TRANHIST(VTPBLKOD'),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    VTP                FIXED      DEC  (9),       /*Y2K*/        
              2    KODE                          CHAR (2),                      
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL                                                                      
           MAP_MELDING              CHAR(78)      INIT((78)' '),                
           1  FEIL_STRUC,                                                       
              2  FEIL_NR               FIXED DEC(5),                            
              2  FEIL_MELDING          CHAR     (78);                           
                                                                                
    DCL    1     KOM_OMR_PEKER         POINTER;                                 
    DCL  FEILNR                        FIXED DEC(5);                            
    DCL KEY_PACK      FIXED DEC (11);                                           
    DCL KEY_CHAR            CHAR (6);                                           
                                                                                
    /* ************************************************************** */        
    /*   OUTPUT RECORD                                                */        
    /* ************************************************************** */        
    DCL 1 MELD_IO,                                                              
          2 ADRESSAT     CHAR(1),                                               
          2 SORTERINGSBEGREP,                                                   
            5 TKNR       PIC '(4)9',                                            
            5 FNR        PIC '(11)9',                                           
          2 ENDRINGSDATA,                                                       
            5 KODE       CHAR(1),                                               
            5 FRANR      PIC '(11)9',                                           
            5 SISTENR    PIC '(11)9',                                           
            5 ENDR_DATO_ÅMD PIC '(8)9',                          /*Y2K*/        
            5 LINKNR     PIC '(11)9',                                           
          2 NAVN         CHAR(25),                                              
          2 TKNR         PIC '(4)9',                                            
          2 VIRKDATO_ÅMD PIC '(8)9',                             /*Y2K*/        
          2 PK1          CHAR(1);                                               
                                                                                
    DCL 1 ENDR_DSR,                                                             
          2 FRANR        PIC '(11)9',                                           
          2 FILLER1      CHAR (1) INIT(' '),                                    
          2 TILNR        PIC '(11)9',                                           
          2 FILLER       CHAR (1) INIT(' '),                                    
          2 KODE         CHAR (1);                                              
                                                                                
    /* ************************************************************** */        
    /*  DIV. DEKLARASJONER                                            */        
    /* ************************************************************** */        
                                                                                
    DCL ANT_LEST                               PIC '(5)9',                      
        ANT_LEST_CHAR      DEF   ANT_LEST      CHAR (5)  ,                      
        ANT_ENDR                               PIC '(5)9',                      
        ANT_ENDR_CHAR      DEF   ANT_ENDR      CHAR (5)  ,                      
        ANT_UFØRH                              PIC '(5)9',                      
        ANT_UFØRH_CHAR     DEF   ANT_UFØRH     CHAR (5)  ,                      
        ANT_OMR_4001                           PIC '(5)9',                      
        ANT_OMR_4001_CHAR  DEF   ANT_OMR_4001  CHAR (5)  ,                      
        ANT_OMR_4901                           PIC '(5)9',                      
        ANT_OMR_4901_CHAR  DEF   ANT_OMR_4901  CHAR (5)  ,                      
        ANT_STAT                               PIC '(5)9',                      
        ANT_STAT_CHAR      DEF   ANT_STAT      CHAR (5)  ,                      
        ANT_CALL_OMR                           PIC '(5)9',                      
        ANT_CALL_OMR_CHAR  DEF   ANT_CALL_OMR  CHAR (5)  ,                      
        ANT_CALL_MAN                           PIC '(5)9',                      
        ANT_CALL_MAN_CHAR  DEF   ANT_CALL_MAN  CHAR (5)  ,                      
        ANT_CALL_DØD                           PIC '(5)9',                      
        ANT_CALL_DØD_CHAR  DEF   ANT_CALL_DØD  CHAR (5)  ,                      
        PRINT_TELLER                           PIC '(2)9',                      
        W01_DUMMY_DATO_ÅMD                     DEC FIXED(9);     /*Y2K*/        
                                                                                
    DCL FATAL_FEIL       CHAR (1) INIT('5');                                    
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   FEILMELDINGS-LINJE .                                         */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DCL OPPH_ÅMD                        PIC '(8)9';                             
    DCL OPPH_ÅR DEF OPPH_ÅMD POS(1)      PIC '(4)9';                            
    DCL OPPH_MN DEF OPPH_ÅMD POS(5)      PIC '(2)9';                            
    DCL OPPH_DG DEF OPPH_ÅMD POS(7)      PIC '(2)9';                            
                                                                                
    DCL 1 DATO_DAGENS_ÅMD PIC  '(8)9',                                          
        1 DAGENS_DATO_ÅR_MND DEF DATO_DAGENS_ÅMD POS(1) PIC '(6)9',             
        1 DAGENS_DATO_DAG DEF DATO_DAGENS_ÅMD POS(7) PIC '99';                  
                                                                                
    DCL 1 DATO_ÅR_MND    PIC '(6)9',                                            
        1 DATO_ÅR DEF DATO_ÅR_MND POS(1) PIC '(4)9',                            
        1 DATO_MND DEF DATO_ÅR_MND POS(5) PIC '99';                             
                                                                                
    DCL 1 WORK_TILKN_FNR(13),                                                   
         2 WORK_FNR_TILKN DEC FIXED(11);                                        
                                                                                
    DCL WORK_BLANKETTYPE  CHAR(2);                                              
                                                                                
    DCL 1 WORK_DØDSDATO_ÅMD PIC '(8)9',                                         
        1 DØD_DATO_ÅR  DEF WORK_DØDSDATO_ÅMD POS(1) PIC '(4)9',                 
        1 DØD_DATO_MND DEF WORK_DØDSDATO_ÅMD POS(5) PIC '99',                   
        1 DØD_DATO_DAG DEF WORK_DØDSDATO_ÅMD POS(7) PIC '99';                   
                                                                                
    DCL WORK_VIRKDATO_ÅM PIC '(6)9';                             /*Y2K*/        
                                                                                
    DCL WORK_DATO_ÅR_MND PIC '(6)9';                             /*Y2K*/        
                                                                                
    DCL WORK_DATO_ÅMD    PIC '(8)9';                             /*Y2K*/        
                                                                                
    DCL WORK_FNR_ÅM_P PIC '(6)9';                                /*Y2K*/        
                                                                                
    DCL 1 WORK_FNR_ÅM  DEF WORK_FNR_ÅM_P,                        /*Y2K*/        
        2 WORK_FNR_Å   PIC '(4)9',                               /*Y2K*/        
        2 WORK_FNR_M   PIC '99';                                 /*Y2K*/        
                                                                                
    DCL FØDSELSNR        PIC '(11)9';                                           
    DCL FØD_DAG     DEF FØDSELSNR POS(1) PIC '99',                              
        FØD_MND     DEF FØDSELSNR POS(3) PIC '99',                              
        FØD_ÅR      DEF FØDSELSNR POS(5) PIC '99',                              
        FØD_INDSIFF DEF FØDSELSNR POS(7) PIC '999',                             
        FØD_KJØNN   DEF FØDSELSNR POS(9) PIC '9';                               
                                                                                
    DCL FØDSELSNR13      PIC '(13)9';                            /*Y2K*/        
    DCL 1 FØD13_DEF DEF FØDSELSNR13,                             /*Y2K*/        
        2 FØD13_DAG            PIC '99',                         /*Y2K*/        
        2 FØD13_MND            PIC '99',                         /*Y2K*/        
        2 FØD13_ÅR             PIC '(4)9',                       /*Y2K*/        
        2 FØD13_INDSIFF        PIC '999',                        /*Y2K*/        
        2 FØD13_KJØNN          PIC '9';                          /*Y2K*/        
                                                                                
    DCL FNR_PIC                PIC '(11)9';                                     
    DCL FNR_CHAR DEF FNR_PIC   CHAR (11)  ;                                     
                                                                                
    DCL FNR_PIC2               PIC '(11)9';                                     
    DCL FNR_CHAR2 DEF FNR_PIC2 CHAR (11)  ;                                     
                                                                                
    DCL WORK_FRAALDER    PIC '999999';                                          
    DCL FRAALDER DEF WORK_FRAALDER POS(1) PIC '999';                            
                                                                                
    DCL WORK_TILALDER    PIC '999999';                                          
    DCL TILALDER DEF WORK_TILALDER POS(1) PIC '999';                            
                                                                                
    DCL W01_SUM_YTELSE       DEC FIXED (5) INIT ('0');                          
    DCL W01_PENSJONSTYPE1                     CHAR(1);                          
    DCL W01_STATUS_KODE_HIST                  CHAR(1);                          
    DCL GRUNN_OMR1                            CHAR(1440);                       
    DCL GRUNN_OMR2                            CHAR(1440);                       
    DCL GRUNN_IDENT                           CHAR( 8);                         
                                                                                
    DCL STATUS_PT1       CHAR (1);                                              
                                                                                
    DCL EOF_FNRTILG      BIT (1) INIT('0'B),                                    
        TRANHIST_ENDRET  BIT (1) INIT('0'B),                                    
        FUNNET           BIT (1) INIT('0'B),                                    
        FUNNET_TNR       BIT (1) INIT('0'B),                                    
        PLI_ABEND        BIT (1) INIT('0'B),                                    
        TRUE             BIT (1) INIT('1'B),                                    
        FALSE            BIT (1) INIT('0'B),                                    
        FEIL_INPUT       BIT (1) INIT('0'B);                                    
   /* *  VERKOMR. ...                                   */                      
    DCL I                BIN FIXED (15),                                        
        RBAFELT          BIN FIXED (31) INIT ('0'),                             
        J                BIN FIXED (15),                                        
        X                BIN FIXED (15);                                        
                                                                                
    DCL TNAVN            CHAR (30),                                             
        TTKNR            PIC '9999';                                            
                                                                                
                                                                                
   DCL                                                                          
      FEIL_FUNNET                 BIT(1) INIT ('0'B),                           
      ONKODE                      PIC'9999',                                    
      CURSOR_POS                  FIXED BIN(15) INIT(-1),                       
      ONK DEF ONKODE              CHAR(4),                                      
      FEILKODE                    CHAR(4),                                      
      DSNAVN                      CHAR(8),                                      
      ANT_FEIL_SKREVET        FIXED DEC (3)  INIT (0);                          
    DCL  START_TID        PIC '99B99B99';                                       
    DCL  FEIL_RBA   POINTER;                                                    
                                                                                
  /* DCL  KEY_FNR                PIC '(15)9';     */                            
     DCL  KEY_FNR                FIXED DEC (11) ;                               
     DCL  KEY_BIT            BIT (48) BASED (KEY_PEKER);                        
     DCL  KEY_PEKER  POINTER;                                                   
                                                                                
     DCL 01 END_OF_REG     BIT (1) INIT ('0'B);                                 
     DCL 01 DATO_ÅMD       PIC '(8)9' INIT  (0);    /*2000*/                    
    /* ************************************************************** */        
    /*   INPUT RECORD                                                 */        
    /* ************************************************************** */        
    DCL 1 FNRREC,                                                               
          2 LINKNR       FIXED DEC(11),                                         
          2 FRANR        FIXED DEC(11),                                         
          2 TILNR        FIXED DEC(11),                                         
          2 REKKEF       PIC '(2)9',                                            
          2 DATO         FIXED DEC(9),     /* HH AA MM DD + 0 */ /*Y2K*/        
          2 KODE         CHAR(1),                                               
          2 SISTENR      FIXED DEC(11);                                         
                                                                                
     DCL 01 FEIL_MELD             CHAR (61);                                    
  /*        02 FEIL               CHAR(61);     */                              
                                                                                
     KEY_PEKER      = ADDR(KEY_FNR);                                            
                                                                                
 %PAGE;                                                                         
 /*                                                                             
      ON ERROR SNAP BEGIN       ;                                               
         ON ERROR SYSTEM        ;                                               
         ONKODE=ONCODE          ;                                               
         FEILKODE = ONK         ;                                               
         PLI_ABEND    = TRUE;                                                   
         DSNAVN   = EIBDS       ;                                               
         GO TO FEILBEH          ;                                               
      END;                                                                      
                                                                                
  */                                                                            
                                                                                
 FEILKODE  = 'FEIL'     ;                                                       
 DSNAVN    = '      '   ;                                                       
                                                                                
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                                     
                                                                                
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);            
                                                                                
 CALL INITIERING_AV_BILDE;                                                      
                                                                                
 IF FRA_CICS THEN                                                               
  DO;                                                                           
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);        
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);             
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);          
    ATK_KOM_PTR           = ADDR  (KOM_OMR.ATK_COM_OMR  ) ;                     
    ALLOCATE  B00;                                                              
    ALLOCATE  B01;                                                              
    ALLOCATE  B02;                                                              
    ALLOCATE  FNRTAB;                                                           
    ALLOCATE  POTALL_OPPL;                                                      
    ALLOCATE  WORK_TRANS_LISTE;                                                 
    ALLOCATE  GV_TAB_RE;                                                        
    ALLOCATE  G_TAB_RE;                                                         
                                                                                
    ALLOCATE  PCB_UIB_PEKER_OMR;                                                
                                                                                
                                                                                
    KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER =                                     
                                 ADDR(KOM_OMR.TRANS_LISTE_OMR);                 
    KOM_OMR.GV_PEKER           = ADDR (GRUNN_OMR1             ) ;               
    KOM_OMR.G_PEKER            = ADDR (GRUNN_OMR2             ) ;               
                                                                                
 /* STYRINGS_OMR = '';         */                                               
    TRANS_OPPL_OMR = '';                                                        
    TRANS_OMR = '';                                                             
 /* DIV_PARAM_OMR = '';         */                                              
    FNRTAB = '';                                                                
    POTALL_OPPL = '';                                                           
    B00 = '';                                                                   
    B01 = '';                                                                   
    B02 = '';                                                                   
    GV_TAB_RE                       =  ''  ;                                    
    G_TAB_RE                        =  ''  ;                                    
                                                                                
    MELD_IO = '';                                                               
    ENDR_DSR = '';                                                              
    FØDSELSNR = '';                                                             
    FØDSELSNR13 = '';                                            /*Y2K*/        
    WORK_FRAALDER = '';                                                         
    WORK_TILALDER = '';                                                         
    WORK_VIRKDATO_ÅM = '';                                       /*Y2K*/        
    PROGRAM_ID = 'R0019E01';                                                    
                                                                                
    GRUNN_IDENT                     = 'P0019924';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                              
                                                                                
    IF FEIL_MELD_NR > 0 THEN                                                    
       DO;                                                                      
        /* ********************************* */                                 
        /*  FEIL I  R0019956.                */                                 
        /* ********************************* */                                 
  L100:                                                                         
          FEIL_VED_LABEL                      = '100';                          
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
    GRUNN_IDENT                     = 'P0019925';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                              
                                                                                
                                                                                
    IF FEIL_MELD_NR > 0 THEN                                                    
       DO;                                                                      
         /* ********************************* */                                
         /*  FEIL I  R0019956.                */                                
         /* ********************************* */                                
  L105:                                                                         
          FEIL_VED_LABEL                      = '105';                          
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
  /*DIV_PARAM_OMR.DATO_2000 = DATE_8BYTE;   */                                  
    DATO_DAGENS_ÅMD     =   DATO_2000;                           /*Y2K*/        
    DATO_ÅR_MND = DAGENS_DATO_ÅR_MND;                                           
    IF DATO_MND = 12     THEN                                                   
       DO;                                                                      
          DATO_MND = 02;                                                        
          DATO_ÅR = DATO_ÅR + 1;                                                
       END;                                                                     
    ELSE                                                                        
    IF DATO_MND = 11     THEN                                                   
       DO;                                                                      
          DATO_MND = 01;                                                        
          DATO_ÅR = DATO_ÅR + 1;                                                
       END;                                                                     
    ELSE                                                                        
       DATO_MND = DATO_MND + 2;                                                 
                                                                                
  END;                                                                          
                                                                                
 IF HENT_FRAM_MAP  THEN                                                         
   DO;                                                                          
     S0019E1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                             
     EXEC CICS SEND MAP('S0019E1') MAPSET('S0019E3') MAPONLY                    
     SET (BMSMAPBR);                                                            
     ALLOCATE S0019E1O;                                                         
   END;                                                                         
                                                                                
 RECEIVE_MAP:                                                                   
                                                                                
 IF ^ HENT_FRAM_MAP THEN                                                        
   EXEC CICS RECEIVE MAP('S0019E1') MAPSET('S0019E3') SET(BMSMAPBR);            
                                                                                
 IF FUNKSJONSKODEL > 0 THEN                                                     
    DO;                                                                         
       FUNKSJONSKODE = FUNKSJONSKODEI;                                          
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);                    
    END;                                                                        
                                                                                
      FEIL_FUNNET = '0'B;                                                       
   /* ****************************************  */                              
                                                                                
      START_TID  =   EIBTIME / 100  ;                                           
      FEIL_MELD       =                                                         
        '   ******************          ******************** ';                 
     CALL SKRIV_FNRFEIL;                                                        
     DATO_ÅMD = DATO_2000;               /*2000*/                               
     FEIL_MELD       = ' FNR ENDRING  START ' !! DATO_ÅMD !! ' KL. '            
       !! START_TID !!  '  BRUKER-ID  ' !! DIV_PARAM_OMR.BRUKER_ID;             
     CALL SKRIV_FNRFEIL;                                                        
                                                                                
     STYRINGS_OMR.FUNKSJONSKODE = 'S';                                          
  /* ******************************************* */                             
     EUS.FNR        = 0;                                                        
     IF FNRL > 0 THEN                                                           
        EUS.FNR    = F_FELT_CHAR_PIC11(FNRI);                                   
                                                                                
     ANT_LEST     = 1;                                                          
     ANT_ENDR     = 0;                                                          
     ANT_UFØRH    = 0;                                                          
     ANT_OMR_4001 = 0;                                                          
     ANT_OMR_4901 = 0;                                                          
     ANT_STAT     = 0;                                                          
     ANT_CALL_OMR = 0;                                                          
     ANT_CALL_MAN = 0;                                                          
     ANT_CALL_DØD = 0;                                                          
                                                                                
     FNRREC.FRANR    = EUS.FNR ;                                                
     IF FNRREC.FRANR    = 0 THEN                                                
           KEY_FNR   = 1;                                                       
     ELSE                                                                       
           KEY_FNR   = FNRREC.FRANR + 1;                                        
  /*    OPPTIL HER                               */                             
                                                                                
     EXEC CICS STARTBR  DATASET('FNRTILG')                                      
                                RIDFLD(KEY_BIT) GTEQ;                           
                                                                                
     EXEC CICS READNEXT DATASET('FNRTILG')                                      
                             INTO(FNRREC)                                       
                             RIDFLD(KEY_BIT);                                   
                                                                                
     EXEC CICS ENDBR DATASET('FNRTILG');                                        
     CALL  INIT_PCB;                                                            
                                                                                
    DO WHILE(^EOF_FNRTILG  &                                                    
             FNRREC.FRANR   ^= 99999999999 );                                   
        EUS.FNRNR      = 0;                                                     
        EUS.FNR = FNRREC.FRANR;                                                 
        TRANS_OPPL_OMR.FØDSNUMMER = EUS.FNR;                                    
                                                                                
        FEIL_MELD      = 'FNR UNDER BEHANDLING '!! FNRREC.FRANR ;               
                                                                                
        CALL SKRIV_FNRFEIL;                                                     
        KJØRINGS_TYPE= 'O' ;                                                    
        TRANS_OPPL_OMR.BLANKETTYPE = STYREKODE;                                 
   /*  ***********************************************  */                      
   /*  CALL HOVER PROC FOR                             */                       
   /*   CALL KONVERT_FNR;                              */                       
   /*  ***********************************************  */                      
                                                                                
                                                                                
        FNRTAB = '';                                                            
        IF FNRREC.KODE = 'A' !                                                  
           FNRREC.KODE = 'B' !                                                  
           FNRREC.KODE = 'F' THEN                                               
           DO;                                                                  
              CALL TEST_MOT_BASEN;                                              
                                                                                
             /*--------------------------------------------*/                   
             /* TAR ENDBROWSE FØR SYNCPOINT                */                   
             /* INITIERING SYNCPOINT                       */                   
             /* INITIERING DATABASEN                       */                   
             /*--------------------------------------------*/                   
                                                                                
    /*        EXEC CICS ENDBR DATASET('FNRTILG');    */                         
              EXEC CICS SYNCPOINT;                                              
              CALL INIT_PCB;                                                    
                                                                                
             IF FEIL_FUNNET THEN                                                
               DO;                                                              
                 FEIL_MELD      =  EUS.FNR !! '  FNR KONV FEIL' ;               
                 CALL SKRIV_FNRFEIL;                                            
                                                                                
                 FEIL_FUNNET = '0'B;                                            
               END;                                                             
            END;                                                                
                                                                                
   NEXT_FNR:                                                                    
        KEY_FNR   = FNRREC.FRANR  + 1;                                          
                                                                                
  /* EXEC CICS HANDLE CONDITION ENDFILE(EOF_FNRTILG = '1'B); */                 
        EXEC CICS READ DATASET('FNRTILG') INTO(FNRREC)                          
                                     RIDFLD(KEY_BIT) GTEQ;                      
                                                                                
    END;    /*  END MAIL LOOP   */                                              
   /*  ***********************************************  */                      
                                                                                
    CALL SKRIV_UT_TELLERE          ;                                            
     IF ^FEIL_FUNNET THEN                                                       
           FEIL_MELD = ' FNR ENDRING  ER OK ' !! DATO_ÅMD ;                     
     ELSE                                                                       
           FEIL_MELD = ' FEIL I KJØRING.... ' !! DATO_ÅMD ;                     
                                                                                
           FRA_CICS = '0'B;                                                     
           CALL SKRIV_FNRFEIL;                                                  
           MELDING1O = FEIL_MELD     ;                                          
                                                                                
           S0019E1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                       
           EXEC CICS SEND MAP('S0019E1')  MAPSET('S0019E3')                     
                                             DATAONLY;                          
                                                                                
     TRANS_OPPL_OMR.TRANSKODE = 'R9E1'         ;                                
                                                                                
       CALL   PLITDLI (W02_PARM_CT_1,                                           
                       W01_TERM_FUNCTION);                                      
     CALL UTGANG;                                                               
                                                                                
  UTGANG: PROC;                                                                 
    IF  FRA_CICS THEN                                                           
      EXEC CICS XCTL PROGRAM('R0019E01') COMMAREA(KOM_OMR);                     
    ELSE                                                                        
      EXEC CICS RETURN;                                                         
  END UTGANG;                                                                   
                                                                                
  /* HANDLE CONDITION...................... */                                  
  FEILBEH:                                                                      
                                                                                
      FEIL_MELD       =   EUS.FNR !!'     MED SYSTEM FEIL ' ;                   
                 CALL SKRIV_FNRFEIL;                                            
                                                                                
      FEIL_MELD       = ' ONKODE ' !! ONCODE ;                                  
                 CALL SKRIV_FNRFEIL;                                            
                                ;                                               
      FEIL_MELD       = ' FEILKODE  ' !! ONK ;                                  
                 CALL SKRIV_FNRFEIL;                                            
                                                                                
      FEIL_MELD       = ' DSNAVN    ' !! EIBDS  ;                               
                 CALL SKRIV_FNRFEIL;                                            
                                                                                
                                                                                
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                                   
     IF FEIL_MELD_NR = 0 THEN /* AB 01.08.16 */                                 
        PROGRAM_ID = 'R0019E01';                                                
                                                                                
     S0019E1O.MELDING2O =                                                       
              'F E I L  H A R  O P P S T Å T T ! ! !.';                         
                                                                                
      FEIL_MELD       =        S0019E1O.MELDING2O;                              
                 CALL SKRIV_FNRFEIL;                                            
     S0019E1O.MELDING3O =                                                       
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                                
                                                                                
      FEIL_MELD       =        S0019E1O.MELDING3O;                              
     CALL SKRIV_FNRFEIL;                                                        
                                                                                
     S0019E1O.MELDING4O =                                                       
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE         
                                         !! '. DATASETT : ' !! DSNAVN;          
      FEIL_MELD       =        S0019E1O.MELDING4O;                              
      CALL SKRIV_FNRFEIL;                                                       
                                                                                
                                                                                
     S0019E1O.MELDING5O =                                                       
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                        
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';                       
                                                                                
      FEIL_MELD       =        S0019E1O.MELDING5O;                              
      CALL SKRIV_FNRFEIL;                                                       
                                                                                
                                                                                
     S0019E1O.MELDING6O =                                                       
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';                   
                                                                                
                                                                                
     S0019E1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                             
     EXEC CICS SEND MAP('S0019E1')   MAPSET('S0019E3')                          
                                             DATAONLY;                          
                                                                                
     EXEC CICS RECEIVE MAP('S0019E1')                                           
                                    MAPSET('S0019E3') SET(BMSMAPBR);            
                                                                                
                                                                                
     EXEC CICS SYNCPOINT ROLLBACK;                                              
                                                                                
                                                                                
     TERMINERINGS_IND = 'F';                                                    
                                                                                
     TRANS_OPPL_OMR.TRANSKODE  = 'R9E1';                                        
     EXEC CICS RETURN;                                                          
                                                                                
                                                                                
  ABEND:                                                                        
    EXEC CICS ABEND ABCODE(FEIL);                                               
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR BLANKING AU_SØKER I AU_TRANS_OMR.                 */        
 /*                                                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
  INITIERING_AV_BILDE: PROC;                                                    
    DIV_PERIODE                             = '' ;                              
    DIV_PARAM_OMR.FRA_CICS                  = '1'B;                             
    DIV_PARAM_OMR.HENT_FRAM_MAP             = '0'B;                             
    DIV_PARAM_OMR.FRA_MED_DIALOG            = '0'B;                             
    DIV_PARAM_OMR.FRA_UTEN_DIALOG           = '0'B;                             
    KOM_OMR.PCB_UIB_PEKER             =  NULL;                                  
    STYRINGS_OMR.STYREKODE            = 'AU';                                   
                                                                                
    TRANS_OPPL_OMR.TRANSKODE = 'R9E1';                                          
    ALLOCATE S0019E1O ;                                                         
    S0019E1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                             
                                                                                
    EXEC CICS SEND MAP('S0019E1') MAPSET('S0019E3')                             
                                  ERASE ;                                       
                                                                                
  END INITIERING_AV_BILDE;                                                      
                                                                                
                                                                                
 TEST_MOT_BASEN: PROC;                                                          
                                                                                
    IF FNRREC.KODE = 'A' !                                                      
       FNRREC.KODE = 'B'  THEN                                                  
       DO;                                                                      
         /*  LESER ROT FRANR  */                                                
                                                                                
         SSA1_RF0PERSN.PKEY = FNRREC.FRANR;                                     
         CALL LESER_ROT_SEGM_GU;                                                
                                                                                
         IF FEIL_MELD_NR      >  0            THEN                              
            DO;                                                                 
               /* **************************************** */                   
               /*  DATABASEFEIL                            */                   
               /* **************************************** */                   
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
            DO;                                                                 
                                                                                
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,           
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;                 
                                                                                
              MELD_IO.ADRESSAT = 'S'; /* MELDING TIL SSB */                     
              CALL MELDINGSREC;                                                 
                                                                                
            END;                                                                
                                                                                
       END;                                                                     
                                                                                
    ELSE                             /* FNRREC.KODE = 'F' */                    
                                                                                
       DO;                                                                      
         /*  LESER ROT TILNR  */                                                
                                                                                
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                                   
                                                                                
         CALL LESER_ROT_SEGM_GU;                                                
                                                                                
         IF FEIL_MELD_NR      >  0            THEN                              
            DO;                                                                 
               /* **************************************** */                   
               /*  DATABASEFEIL                            */                   
               /* **************************************** */                   
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
            DO;                                                                 
                                                                                
                                                                                
                                                                                
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,           
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;                 
                                                                                
              FUNNET_TNR    = TRUE;                                             
              TNAVN         = B01.PERSON(1).RF0PERSN.NAVN;                      
              TTKNR         = B01.PERSON(1).RF0PERSN.TKNR;                      
              ENDR_DSR.KODE = ' ';                                              
            END;                                                                
                                                                                
         ELSE                                                                   
                                                                                
            DO;                                                                 
              FUNNET_TNR = FALSE;                                               
              /* ENDRE FNR I DSR OG TRANS-DSR */                                
                                                                                
              ANT_STAT = ANT_STAT + 1;                                          
              ENDR_DSR.KODE = '0';                                              
            END;                                                                
                                                                                
         /* LESER SISTE STATUS FOR Å TESTE PÅ VIRKNINGSDATO */                  
                                                                                
         SSA3_RF0PERSN.PKEY = FNRREC.FRANR ;                                    
                                                                                
         CALL LESER_STATUS_GU;                                                  
                                                                                
         IF FEIL_MELD_NR >  0            THEN                                   
            DO;                                                                 
               /* ************** */                                             
               /*  DATABASEFEIL  */                                             
               /* ************** */                                             
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
            DO;                                                                 
                                                                                
              SUBSTR(ADDR(B01.PERSON(1).STATUS) -> W01_HJELPE_IO,1,             
                     STORAGE(B01.PERSON(1).STATUS)) = W01_IO;                   
              WORK_VIRKDATO_ÅM =                                 /*Y2K*/        
                          B01.PERSON(1).STATUS.VIRK_DATO_ÅMD/100;/*Y2K*/        
                                                                                
            END;                                                                
                                                                                
         ELSE                                                                   
                                                                                
            WORK_VIRKDATO_ÅM = 0;                                /*Y2K*/        
                                                                                
                                                                                
         /*  LESER ROT FRANR  */                                                
                                                                                
         SSA1_RF0PERSN.PKEY = FNRREC.FRANR;                                     
         CALL LESER_ROT_SEGM_GU;                                                
                                                                                
         IF FEIL_MELD_NR      >  0            THEN                              
            DO;                                                                 
               /* **************************************** */                   
               /*  DATABASEFEIL                            */                   
               /* **************************************** */                   
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
            DO;                                                                 
                                                                                
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,           
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;                 
                                                                                
              IF B01.PERSON(1).RF0PERSN.SPERRE = ' ' THEN                       
                 DO;                                                            
                                                                                
                   FØDSELSNR = FNRREC.SISTENR;                                  
                   FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);    /*Y2K*/        
                   WORK_FNR_Å = FØD13_ÅR;                        /*Y2K*/        
                   WORK_FNR_M = FØD13_MND;                       /*Y2K*/        
                                                                                
                   IF FUNNET_TNR THEN                                           
                      DO;                                                       
                         /* MELDING TIL RTV */                                  
                         MELD_IO.ADRESSAT = 'R';                                
                         CALL MELDINGSREC;                                      
                      END;                                                      
                   ELSE                                                         
                      IF (WORK_FNR_Å > 1899  &                 /*Y2K-2*/        
                         WORK_VIRKDATO_ÅM > 0 &                  /*Y2K*/        
                         WORK_VIRKDATO_ÅM < WORK_FNR_ÅM_P) THEN  /*Y2K*/        
                         DO;                                                    
                            /* MELDING TIL RTV */                               
                            MELD_IO.ADRESSAT = 'V';                             
                            CALL MELDINGSREC;                                   
                         END;                                                   
                      ELSE                                                      
                         DO;                                                    
                            ENDR_DSR.KODE = '1';                                
                            CALL FNR_SKAL_ENDRES;                               
                         END;                                                   
                                                                                
                 END;                                                           
                                                                                
              ELSE                                                              
                                                                                
                 /* DENNE PERSON ER SPERRET OG ÅMD BEHANDLES SENERE */          
                 /* MELDING PÅ FNRFEIL                           */             
                                                                                
                 DO;                                                            
                                                                                
                    /*                B01.PERSON(1).REF0PERSN.FNR; */           
                    FEIL_MELD     =                                             
                    '499 FRA FNR ENDRING. DETTE FNR ER SPERRET : ' !!           
                          FNRREC.FRANR;                                         
                    /* RECORD FOR ENDRING AV FNR. I DSR / T-DSR: */             
                                                                                
                    CALL SKRIV_FNRFEIL;                                         
                                                                                
                    ENDR_DSR.KODE = ' ';                                        
                                                                                
                 END;                                                           
                                                                                
            END;                                                                
                                                                                
         IF ENDR_DSR.KODE ^= ' ' THEN                                           
            DO;                                                                 
              ENDR_DSR.FRANR = FNRREC.FRANR;                                    
              ENDR_DSR.TILNR = FNRREC.SISTENR;                                  
                                                                                
              /* RECORD FOR ENDRING AV FNR. I DSR / T-DSR: */                   
                                                                                
              EXEC CICS WRITE DATASET('ENDRDSR') FROM(ENDR_DSR)                 
                   RIDFLD(ENDR_PEKER) RBA;                                      
                                                                                
            END;                                                                
    END;                                                                        
                                                                                
 END TEST_MOT_BASEN;                                                            
                                                                                
 FNR_SKAL_ENDRES: PROC;                                                         
                                                                                
 DCL FEIL   BIT (1) INIT('0'B);                                                 
                                                                                
    /* ROTSEGMENT ER ALLEREDE LEST */                                           
                                                                                
    /* ENDRE FNR I BASEN */                                                     
                                                                                
    STATUS_PT1 = ' ';                                                           
    SSA2_RF0PERSN.PKEY = FNRREC.SISTENR;                                        
    SSA_UQUAL = PCB1.SEGM_NAVN;                                                 
                                                                                
    B01.PERSON(1).RF0PERSN.FNR = FNRREC.SISTENR;                                
                                                                                
    W01_HJELPE_PTR = ADDR(B01.PERSON(1).RF0PERSN);                              
    W01_IO = W01_HJELPE_IO;                                                     
                                                                                
    CALL DANNE_ROT_SEGM_ISRT;                                                   
    IF FEIL_MELD_NR      >  0            THEN                                   
       DO;                                                                      
          /* **************************************** */                        
          /*  DATABASEFEIL                            */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
    /* LESER ALLE UNDERSEGMENT */                                               
                                                                                
    CALL LESER_RESTEN_GNP;                                                      
                                                                                
    IF FEIL_MELD_NR        >  0            THEN                                 
       DO;                                                                      
          /* **************************************** */                        
          /*    DATABASEFEIL                          */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
    SSA_UQUAL = PCB1.SEGM_NAVN;                                                 
                                                                                
    /* SÅ LENGE DET FINNES SEGMENTER UNDER DENNE ROT, ISRT */                   
                                                                                
    DO WHILE( W02_MER_DATA  &  W02_ISRT_OK );                                   
                                                                                
                                                                                
         SELECT ( PCB1.SEGM_NAVN );                                             
                                                                                
           WHEN ('STATUS  ')                                                    
             DO;                                                                
                                                                                
                                                                                
               /* SKAL FØRST LEGGE INN NEST_SISTE_STATUS */                     
                                                                                
               SSA4_STATUS.KODE = 'N';                                          
                                                                                
               CALL LESER_NEST_SISTE_STATUS_GNP;                                
                                                                                
               IF FEIL_MELD_NR > 0         THEN                                 
                  DO;                                                           
                     /* **************************************** */             
                     /* DATABASEFEIL                             */             
                     /* **************************************** */             
                                                                                
                     GO TO FEILBEH;                                             
                  END;                                                          
                                                                                
               IF W02_MER_DATA THEN                                             
                  CALL STATUS;                                                  
                                                                                
               /* SKAL DERETETTER LEGGE INN SISTE_STATUS */                     
                                                                                
               CALL LESER_SISTE_STATUS_GNP;                                     
                                                                                
               IF FEIL_MELD_NR > 0         THEN                                 
                  DO;                                                           
                     /* **************************************** */             
                     /* DATABASEFEIL                             */             
                     /* **************************************** */             
                                                                                
                     GO TO FEILBEH;                                             
                  END;                                                          
                                                                                
               IF W02_MER_DATA THEN                                             
                  DO;                                                           
                                                                                
              SUBSTR(ADDR(B01.PERSON(1).STATUS) -> W01_HJELPE_IO,1,             
                     STORAGE(B01.PERSON(1).STATUS)) = W01_IO;                   
                                                                                
                    STATUS_PT1 = B01.PERSON(1).STATUS.PENSJONSTYPE1;            
                    WORK_DØDSDATO_ÅMD =                          /*Y2K*/        
                              B01.PERSON(1).STATUS.DØDSDATO_ÅMD; /*Y2K*/        
                    SSA4_STATUS.KODE = 'S';                                     
                    CALL STATUS;                                                
                  END;                                                          
                                                                                
               /* HVIS PROGRAMMET HAR TRANHIST I IO_OMR */                      
                                                                                
               IF PCB1.SEGM_NAVN = 'TRANHIST' THEN                              
                  CALL TRANHIST;                                                
               ELSE                                                             
                  IF PCB1.SEGM_NAVN = 'STATUS  ' THEN                           
                     DO;                                                        
                       CALL LESER_TRANHIST_GNP;                                 
                                                                                
                       IF FEIL_MELD_NR > 0 THEN                                 
                          DO;                                                   
                             /* *************** */                              
                             /* DATABASEFEIL    */                              
                             /* *************** */                              
                             GO TO FEILBEH;                                     
                          END;                                                  
                                                                                
                       IF W02_MER_DATA THEN                                     
                          CALL TRANHIST;                                        
                                                                                
                     END;                                                       
             END;                                                               
                                                                                
           WHEN ('TRANHIST')                                                    
                                                                                
             CALL TRANHIST;                                                     
                                                                                
           OTHERWISE                                                            
             DO;                                                                
               /* INSERTER RESTEN AV SEGMENTENE */                              
                                                                                
               IF SSA_UQUAL ^= PCB1.SEGM_NAVN    THEN                           
                  SSA_UQUAL = PCB1.SEGM_NAVN;                                   
                                                                                
               CALL DANNE_SEGM_ISRT;                                            
                                                                                
               IF FEIL_MELD_NR  >  0            THEN                            
                  DO;                                                           
                     /* **************************************** */             
                     /* DATABASEFEIL                             */             
                     /* **************************************** */             
                                                                                
                     GO TO FEILBEH;                                             
                  END;                                                          
                                                                                
               /* LESER ALLE UNDERSEGMENT */                                    
                                                                                
               CALL LESER_RESTEN_GNP;                                           
                                                                                
               IF FEIL_MELD_NR > 0         THEN                                 
                  DO;                                                           
                     /* ************ */                                         
                     /* DATABASEFEIL */                                         
                     /* ************ */                                         
                                                                                
                     GO TO FEILBEH;                                             
                  END;                                                          
                                                                                
                                                                                
             END;                                                               
                                                                                
         END;                                                                   
                                                                                
    END;                                                                        
                                                                                
                                                                                
    IF W02_ISRT_OK THEN                                                         
                                                                                
       DO;                                                                      
                                                                                
         CALL LESER_ROT_SEGM_GHU;                                               
                                                                                
         IF FEIL_MELD_NR >  0            THEN                                   
            DO;                                                                 
               /* ************ */                                               
               /* DATABASEFEIL */                                               
               /* ************ */                                               
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
           DO;                                                                  
                                                                                
          /* FJERNER FRA-NUMMER */                                              
                                                                                
             CALL FJERNER_ALLE_SEGM_DLET;                                       
                                                                                
                                                                                
             IF FEIL_MELD_NR > 0           THEN                                 
                DO;                                                             
                     /* ************ */                                         
                     /* DATABASEFEIL */                                         
                     /* ************ */                                         
                                                                                
                 GO TO FEILBEH;                                                 
                END;                                                            
           END;                                                                 
                                                                                
                                                                                
                                                                                
         B01 = '';                                                              
         DIV_PARAM_OMR.SEARCH_FNR = FNRREC.SISTENR;                             
                                                                                
                                                                                
         ANT_ENDR = ANT_ENDR + 1;                                               
         IF STATUS_PT1 = 'D' THEN                                               
            DO;                                                                 
                                                                                
                  CALL DØD;                                                     
               ANT_CALL_DØD = ANT_CALL_DØD + 1;                                 
                                                                                
            END;                                                                
                                                                                
         ELSE                                                                   
                                                                                
            DO;                                                                 
               TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 99999999;      /*Y2K*/        
               TRANS_OPPL_OMR.FØDSNUMMER = FNRREC.SISTENR;                      
                                                                                
               EXEC CICS LINK PROGRAM ('R0013101')                              
                              COMMAREA (KOM_OMR);                               
                                                                                
                                                                                
               IF FEIL_MELD_NR >  0            THEN                             
                  DO;                                                           
                    /* *************************** */                           
                    /* FEIL VED SPERRE-BEHANDLING  */                           
                    /* *************************** */                           
                                                                                
                    GO TO FEILBEH;                                              
                  END;                                                          
               ELSE                                                             
                                                                                
                  PROGRAM_ID = 'R0019E01';                                      
                                                                                
               /*--------------------------------------------*/                 
               /* SISTE STATUS TIL B01 . FNR ER ENDRET       */                 
               /*--------------------------------------------*/                 
                                                                                
               B02 = B01;                                                       
                                                                                
                                                                                
               DO I = 1 TO 14 WHILE(B02.PERSON(I).RF0PERSN.FNR ^=               
                                    FNRREC.SISTENR);                            
               END;                                                             
                                                                                
                                                                                
               /*--------------------------------------------*/                 
               /* I = POS I B01 TIL ENDRET PERSOM            */                 
               /*--------------------------------------------*/                 
                                                                                
               IF B02.STATUS.PENSJONSTYPE1 (I) ^= ' ' THEN                      
                  DO;                                                           
                     MELD_IO.ADRESSAT = 'T';                                    
                     /* MELDING TIL TRYGDEKTR. */                               
                     CALL MELDINGSREC;                                          
                  END;                                                          
                                                                                
                                                                                
               /* OMREGNING ELLER IKKE EGEN PERSON BESTEMMES: */                
                                                                                
               FØDSELSNR = FNRREC.FRANR;                                        
               FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);        /*Y2K*/        
                                                                                
               WORK_DATO_ÅR_MND = FØD13_ÅR!!FØD13_MND;           /*Y2K*/        
                                                                                
               WORK_FRAALDER = DAGENS_DATO_ÅR_MND -                             
                               WORK_DATO_ÅR_MND;                 /*Y2K*/        
                                                                                
                                                                                
               FØDSELSNR = FNRREC.SISTENR;                                      
               FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);        /*Y2K*/        
                                                                                
               WORK_DATO_ÅR_MND = FØD13_ÅR!!FØD13_MND;           /*Y2K*/        
                                                                                
               WORK_TILALDER = DAGENS_DATO_ÅR_MND -                             
                               WORK_DATO_ÅR_MND;                 /*Y2K*/        
                                                                                
                                                                                
               CALL TESTVTP(FEIL);                                              
                                                                                
                                                                                
               IF FEIL                                THEN                      
                  DO;                                                           
                     CALL MANUELL;                                              
                     FEIL          = '0'B;                                      
                  END;                                                          
                                                                                
               ELSE IF STATUS_PT1  = ' '              !                         
                       STATUS_PT1  = 'G'                  THEN                  
                                                                                
                  DO;                                                           
                     /*---------------------------------------*/                
                     /* IKKE EGNE YTELSER - TABELL 2          */                
                     /*---------------------------------------*/                
                                                                                
                                                                                
                     SELECT;                                                    
                                                                                
                       WHEN (FRAALDER < 016)                                    
                         DO;                                                    
                                                                                
                            SELECT;                                             
                              WHEN (TILALDER >= 067)                            
                                DO;                                             
                                                                                
                                   CALL MANUELL;                                
                                END;                                            
                              OTHERWISE;                                        
                            END;                                                
                         END;                                                   
                                                                                
                       WHEN (FRAALDER > 067)                                    
                         DO;                                                    
                                                                                
                            SELECT;                                             
                              WHEN (TILALDER < 016)                             
                                DO;                                             
                                                                                
                                   CALL MANUELL;                                
                                END;                                            
                              OTHERWISE;                                        
                            END;                                                
                         END;                                                   
                                                                                
                       OTHERWISE;                                               
                                                                                
                     END;                                                       
                                                                                
                  END;                                                          
                                                                                
               ELSE                                                             
                                                                                
               IF STATUS_PT1 = 'F' !                                            
                  STATUS_PT1 = 'L' THEN                                         
                  DO;                                                           
                     IF (STATUS_PT1 = 'F' & TILALDER > 067) !                   
                        (STATUS_PT1 = 'L' & TILALDER > 018) THEN                
                        DO;                                                     
                           CALL MANUELL;                                        
                        END;                                                    
                  END;                                                          
                                                                                
               ELSE                                                             
                                                                                
                  DO;                                                           
                     /*-----------------------------------------------*/        
                     /* STATUS_PT1 ER ^= (' ' ! 'G' ! 'D' ! 'F' ! 'L')*/        
                     /* EGNE YTELSER TABELL 1                         */        
                     /*                                               */        
                     /* TESTEN PÅ 'F' ! 'L' 17 LINJER OPP ER NY       */        
                     /* LAGT INN AV O.G. 09.04.87                     */        
                     /*-----------------------------------------------*/        
                                                                                
                                                                                
                     SELECT;                                                    
                                                                                
                       WHEN (FRAALDER < 016)                                    
                         DO;                                                    
                            SELECT;                                             
                              WHEN (TILALDER < 016);                            
                                                                                
                              WHEN (TILALDER < 067)                             
                                DO;                                             
                                   CALL OMREGN;                                 
                                END;                                            
                              OTHERWISE                                         
                                DO;                                             
                                   CALL MANUELL;                                
                                END;                                            
                            END;                                                
                          END;                                                  
                       WHEN (FRAALDER < 067)                                    
                         DO;                                                    
                                                                                
                            CALL OMREGN;                                        
                                                                                
                         END;                                                   
                       WHEN (FRAALDER < 070)                                    
                         DO;                                                    
                            SELECT;                                             
                              WHEN (TILALDER < 067)                             
                                DO;                                             
                                   CALL MANUELL;                                
                                END;                                            
                              OTHERWISE                                         
                                DO;                                             
                                   CALL OMREGN;                                 
                                END;                                            
                            END;                                                
                         END;                                                   
                       WHEN (FRAALDER >= 070)                                   
                         DO;                                                    
                            SELECT;                                             
                                                                                
                              WHEN (TILALDER < 070)                             
                                   CALL MANUELL;                                
                                                                                
                              WHEN (WORK_TILALDER > WORK_FRAALDER)              
                                   CALL MANUELL;                                
                                                                                
                              OTHERWISE                                         
                                   CALL OMREGN;                                 
                             END;                                               
                         END;                                                   
                       OTHERWISE;                                               
                     END;                                                       
                  END;                                                          
            END;                                                                
                                                                                
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
                                                                                
                                                                                
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                                   
         CALL LESER_ROT_SEGM_GHU;                                               
                                                                                
         IF FEIL_MELD_NR >  0            THEN                                   
            DO;                                                                 
               /* ************ */                                               
               /* DATABASEFEIL */                                               
               /* ************ */                                               
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
           DO;                                                                  
                                                                                
             /*------------------------------------------------*/               
             /* ADRESSERER B01 FOR MELDINGSREC                 */               
             /* FJERNER ALLE OPPLYSNNINGER UNDER TIL-NR        */               
             /*------------------------------------------------*/               
                                                                                
             SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,            
                    STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;                  
                                                                                
                                                                                
             CALL FJERNER_ALLE_SEGM_DLET;                                       
                                                                                
                                                                                
             IF FEIL_MELD_NR > 0           THEN                                 
                DO;                                                             
                     /* ************ */                                         
                     /* DATABASEFEIL */                                         
                     /* ************ */                                         
                                                                                
                 GO TO FEILBEH;                                                 
                END;                                                            
           END;                                                                 
                                                                                
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                                   
                                                                                
         /* MELDING TIL SYTEMAVDELING OM FEIL PÅ BASEN */                       
                                                                                
         MELD_IO.ADRESSAT = 'X';                                                
         CALL MELDINGSREC;                                                      
                                                                                
                                                                                
       END;                                                                     
                                                                                
 END FNR_SKAL_ENDRES;                                                           
                                                                                
                                                                                
 TESTVTP:PROC(FEIL);                                                            
                                                                                
                                                                                
 DCL W_GRENSEPASS_ÅMD PIC '(8)9';                                /*Y2K*/        
 DCL W_GRENSEPASS_ÅM  PIC '(6)9' DEF W_GRENSEPASS_ÅMD;           /*Y2K*/        
 DCL W_VDATO_ÅMD      PIC '(8)9';                                /*Y2K*/        
 DCL FEIL           BIT (1);                                                    
                                                                                
 DCL WORK_FNR_ÅM_P  PIC '(6)9';                                  /*Y2K*/        
                                                                                
 DCL 1 WORK_FNR_ÅM  DEF WORK_FNR_ÅM_P,                           /*Y2K*/        
     2 WORK_FNR_Å   PIC '(4)9',                                  /*Y2K*/        
     2 WORK_FNR_M   PIC '99';                                                   
                                                                                
 DCL FØDSELSNR      PIC '(11)9';                                                
 DCL FØD_DAG     DEF FØDSELSNR POS(1) PIC '99',                                 
     FØD_MND     DEF FØDSELSNR POS(3) PIC '99',                                 
     FØD_ÅR      DEF FØDSELSNR POS(5) PIC '99',                                 
     FØD_INDSIFF DEF FØDSELSNR POS(7) PIC '999',                                
     FØD_KJØNN   DEF FØDSELSNR POS(9) PIC '9';                                  
                                                                                
  DCL FØDSELSNR13      PIC '(13)9';                              /*Y2K*/        
  DCL 1 FØD13_DEF DEF FØDSELSNR13,                               /*Y2K*/        
      2 FØD13_DAG            PIC '99',                           /*Y2K*/        
      2 FØD13_MND            PIC '99',                           /*Y2K*/        
      2 FØD13_ÅR             PIC '(4)9',                         /*Y2K*/        
      2 FØD13_INDSIFF        PIC '999',                          /*Y2K*/        
      2 FØD13_KJØNN          PIC '9';                            /*Y2K*/        
                                                                                
  W_GRENSEPASS_ÅMD = 0;                                          /*Y2K*/        
  W_VDATO_ÅMD  = B01.VIRK_DATO_ÅMD(I);                           /*Y2K*/        
  FØDSELSNR    = B01.FNR(I);                                                    
  FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);                     /*Y2K*/        
                                                                                
                                                                                
  WORK_FNR_Å = FØD13_ÅR;                                         /*Y2K*/        
  WORK_FNR_M = FØD13_MND;                                        /*Y2K*/        
                                                                                
  DCL TEKST           CHAR(29);                                                 
                                                                                
                                                                                
                                                                                
  IF (FRAALDER < 18 &                                                           
      TILALDER > 18 ) !                                                         
     (FRAALDER > 18 &                                                           
      TILALDER < 18 ) THEN                                                      
     W_GRENSEPASS_ÅM  = WORK_FNR_ÅM_P + 1800;                    /*Y2K*/        
  ELSE                                                                          
     IF (FRAALDER < 20 &                                                        
         TILALDER > 20 ) !                                                      
        (FRAALDER > 20 &                                                        
         TILALDER < 20 ) THEN                                                   
        W_GRENSEPASS_ÅM  = WORK_FNR_ÅM_P + 2000;                 /*Y2K*/        
     ELSE                                                                       
        IF (FRAALDER < 67 &                                                     
            TILALDER > 67 ) !                                                   
           (FRAALDER > 67 &                                                     
            TILALDER < 67 ) THEN                                                
            W_GRENSEPASS_ÅM  = WORK_FNR_ÅM_P + 6700;             /*Y2K*/        
        ELSE                                                                    
           IF (FRAALDER < 70 &                                                  
               TILALDER > 70 ) !                                                
              (FRAALDER > 70 &                                                  
               TILALDER < 70 ) THEN                                             
               W_GRENSEPASS_ÅM  = WORK_FNR_ÅM_P + 7000;          /*Y2K*/        
  IF W_GRENSEPASS_ÅMD ^= 0 THEN                                  /*Y2K*/        
     IF W_VDATO_ÅMD > W_GRENSEPASS_ÅMD THEN                      /*Y2K*/        
        FEIL = '1'B;                                                            
     ELSE                                                                       
        FEIL = '0'B;                                                            
 END TESTVTP;                                                                   
                                                                                
                                                                                
                                                                                
 OMREGN: PROC;                                                                  
                                                                                
  /*---------------------------------------------------*/                       
  /* LOKALE DECLARASJONER                              */                       
  /*---------------------------------------------------*/                       
                                                                                
  DCL Z            BIN FIXED    (15);                                           
  DCL TEKST        CHAR         (29)   INIT ('')        ;                       
  DCL OMR_ÅMW      PIC          '9999'                  ;                       
  DCL FØDSELSNRW   PIC          '(11)9'                 ;                       
  DCL FØD_ÅRW      DEF FØDSELSNRW POS (5) PIC '99' ;                            
  DCL FØD_MNDW     DEF FØDSELSNRW POS (3) PIC '99' ;                            
  DCL FØD_INDW     DEF FØDSELSNRW POS (7) PIC '999';                            
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    TEKST        =  'OMREGN';                                                   
    FØDSELSNRW   =  FNRREC.SISTENR;                                             
    OMR_ÅMW      =  FØD_ÅRW!!FØD_MNDW;                                          
                                                                                
                                                                                
    SØKER_IND    =  I;                                                          
    ANT_CALL_OMR =  ANT_CALL_OMR + 1;                                           
                                                                                
    IF SØKER_IND =  1 THEN                                                      
       EKTEF_IND =  2;                                                          
    ELSE                                                                        
       IF SØKER_IND = 2 THEN                                                    
          EKTEF_IND = 1;                                                        
                                                                                
    IF (FRAALDER >= 16 & FRAALDER < 67) & TILALDER < 16 THEN                    
      DO;                                                                       
        /* FJERN UFØREPENSJON: */                                               
                                                                                
        IF B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'U' THEN                        
          DO;                                                                   
            IF B02.PERSON(I).STATUS.PENSJONSTYPE2 = 'E' THEN                    
               B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'E';                        
            ELSE                                                                
               B02.PERSON(I).STATUS.VIRK_DATO_ÅMD = 0;           /*Y2K*/        
          END;                                                                  
                                                                                
        B02.PERSON(I).UFØRPENS    = '';                                         
        B02.PERSON(I).UFØRHIST(1) = '';                                         
        B02.PERSON(I).UFØRHIST(2) = '';                                         
        B02.PERSON(I).UFØRHIST(3) = '';                                         
        B02.PERSON(I).UFØRHIST(4) = '';                                         
        B02.PERSON(I).UFØRHIST(5) = '';                                         
                                                                                
        IF B02.PERSON(I).STATUS.VIRK_DATO_ÅMD ^= 0 THEN          /*Y2K*/        
          DO;                                                                   
            /* ANDRE YTELSER FINNES */                                          
            /* AUTOHENDELSE BEREGNING */                                        
                                                                                
            DIV_PARAM_OMR.KJØRINGS_TYPE = 'O';                                  
                                                                                
  /*        NESTE_HENDELSE_DATO_ÅMD = DAGENS_DATO_ÅR_MND; */                    
            NESTE_HENDELSE_DATO_ÅMD = DATO_ÅR_MND * 100;         /*Y2K*/        
                                                                                
            TRANS_OPPL_OMR.TRANSTYPE = 45;                                      
                                                                                
            STØNADSBREV_ØNSKET_IND = '1'B;                                      
                                                                                
                                                                                
            W01_SUM_YTELSE =                                                    
                B01.SUM_YTELSE(I);                                              
            W01_PENSJONSTYPE1 =                                                 
                B01.PENSJONSTYPE1(I);                                           
            W01_STATUS_KODE_HIST =                                              
                B01.STATUS_KODE_HIST(I);                                        
                                                                                
            TRANS_OPPL_OMR.FØDSNUMMER =                                         
                  B02.PERSON(I).RF0PERSN.FNR;                                   
                                                                                
            EXEC CICS LINK PROGRAM ('R0014901')  COMMAREA (KOM_OMR);            
                                                                                
                                                                                
            IF FEIL_MELD_NR      >  0            THEN                           
              DO;                                                               
                /* **************************************** */                  
                /*  FEIL VED R0014901(AUTOBEREGNING).       */                  
                /* **************************************** */                  
                                                                                
                TERMINERINGS_IND = FATAL_FEIL;                                  
                                                                                
                GO TO FEILBEH;                                                  
              END;                                                              
                                                                                
            ELSE                                                                
                                                                                
              PROGRAM_ID   =   'R0019E01';                                      
                                                                                
            /* IF B02.PERSON(I).RF0PERSN.FNR > 0                                
                    B00.PERSON(I).RF0PERSN.FNR =                                
                               B02.PERSON(I).RF0PERSN.FNR;  */                  
                                                                                
            B00.PERSON(I).STATUS.VIRK_DATO_ÅMD = 0;              /*Y2K*/        
                                                                                
            /* DLET NEST SISTE STATUS */                                        
            /* HELE FAMILIEPAKKE      */                                        
                                                                                
                                                                                
                                                                                
            IF (B02.STATUS_KODE_HIST(I) =                                       
                    W01_STATUS_KODE_HIST)            &                          
               (B02.SUM_YTELSE(I) =                                             
                    W01_SUM_YTELSE)                  &                          
               (B02.PENSJONSTYPE1(I) =                                          
                    W01_PENSJONSTYPE1)               THEN                       
                                                                                
               DO;                                                              
                                                                                
                 W01_DUMMY_DATO_ÅMD = 0;                                        
                 CALL OMREGNING_PGA_FNRENDRING;                                 
                                                                                
                 IF FEIL_MELD_NR > 0              THEN                          
                    DO;                                                         
                  /* *********************************/                         
                  /* FEIL VED OMREGNING              */                         
                  /* *********************************/                         
                                                                                
                       TERMINERINGS_IND = FATAL_FEIL;                           
                                                                                
                       GO TO FEILBEH;                                           
                    END;                                                        
                 ELSE                                                           
                                                                                
                    PROGRAM_ID = 'R0019E01';                                    
                                                                                
                    ANT_OMR_4001 = ANT_OMR_4001 + 1;                            
                                                                                
                 /* PROC R0019961 OMREGNING_PGA_FNRENDRING                      
                    BRUKES HER FORDI DEN GIR ØNSKET RESULTAT VED                
                    FØDSELNUMMERENDRING                          */             
                                                                                
               END;                                                             
                                                                                
            ELSE                                                                
                                                                                
               DO;                                                              
                                                                                
                 ANT_OMR_4901 = ANT_OMR_4901 + 1;                               
                                                                                
                 TRANS_OPPL_OMR.FØDSNUMMER =                                    
                                      B02.PERSON(I).RF0PERSN.FNR;               
  /*AB 22.12.00 */ IF B02.PENSJONSTYPE2(I) ^= 'A'  THEN                         
                 EXEC CICS LINK PROGRAM ('R0016001')                            
                                        COMMAREA (KOM_OMR);                     
                                                                                
                                                                                
                 IF FEIL_MELD_NR   >  0            THEN                         
                    DO;                                                         
                       /* *********************************/                    
                       /* FEIL VED R0016001(STATESTIKK).  */                    
                       /* *********************************/                    
                                                                                
                       GO TO FEILBEH;                                           
                    END;                                                        
                 ELSE                                                           
                                                                                
                    PROGRAM_ID =  'R0019E01';                                   
                                                                                
                                                                                
                 /*------------------------------------------------*/           
                 /* SKRIV B02 MED NYE KRITTERIER PÅ RF - DB        */           
                 /*------------------------------------------------*/           
                                                                                
                 TRANS_OPPL_OMR.FØDSNUMMER =                                    
                       B02.PERSON(I).RF0PERSN.FNR;                              
                                                                                
                 EXEC CICS LINK PROGRAM ('R0015401')                            
                                        COMMAREA (KOM_OMR);                     
                                                                                
                                                                                
                 IF FEIL_MELD_NR   >  0            THEN                         
                    DO;                                                         
                       /* *************************************/                
                       /* FEIL VED R0015401(BASEUTSKRIVING).  */                
                       /* *************************************/                
                                                                                
                       GO TO FEILBEH;                                           
                    END;                                                        
                 ELSE                                                           
                                                                                
                    PROGRAM_ID =  'R0019E01';                                   
                                                                                
               END;                                                             
                                                                                
          END;                                                                  
        ELSE                                                                    
          DO;                                                                   
             /*------------------------------------------------*/               
             /* SKRIV B02 MED NYE KRITTERIER PÅ RF - DB        */               
             /*------------------------------------------------*/               
                                                                                
              TRANS_OPPL_OMR.FØDSNUMMER = B02.FNR (I)          ;                
                                                                                
              EXEC CICS LINK PROGRAM  ('R0015401')                              
                             COMMAREA ( KOM_OMR  )             ;                
                                                                                
                                                                                
              IF FEIL_MELD_NR      >  0            THEN                         
                 DO;                                                            
                    /* *************************************/                   
                    /* FEIL VED R0015401(BASEUTSKRIVING).  */                   
                    /* *************************************/                   
                                                                                
                    GO TO FEILBEH;                                              
                 END;                                                           
              ELSE                                                              
                 PROGRAM_ID =     'R0019E01';                                   
          END;                                                                  
      END;                                                                      
    ELSE                                                                        
      DO;                                                                       
        /*------------------------------------------------*/                    
        /* ANDRE YTELSER FINNES . ATOHENDELSE BEREGNING   */                    
        /*------------------------------------------------*/                    
                                                                                
        W01_SUM_YTELSE              =   B01.SUM_YTELSE       (I);               
        W01_PENSJONSTYPE1           =   B01.PENSJONSTYPE1    (I);               
        W01_STATUS_KODE_HIST        =   B01.STATUS_KODE_HIST (I);               
                                                                                
        TRANS_OPPL_OMR.FØDSNUMMER   =   B01.RF0PERSN.FNR     (I);               
                                                                                
                                                                                
        DIV_PARAM_OMR.KJØRINGS_TYPE = 'O';                                      
        STØNADSBREV_ØNSKET_IND      = '1'B;                                     
 /*     NESTE_HENDELSE_DATO_ÅMD     =  DAGENS_DATO_ÅR_MND;   */                 
        NESTE_HENDELSE_DATO_ÅMD     =  DATO_ÅR_MND * 100;        /*Y2K*/        
        TRANS_OPPL_OMR.TRANSTYPE    =  45;                                      
        TEKST                       = 'R0014901 FERDIG              ';          
                                                                                
        EXEC CICS LINK PROGRAM   ('R0014901') COMMAREA (KOM_OMR);               
                                                                                
        TEKST  = 'R0014901  FERDIG             ';                               
                                                                                
        IF FEIL_MELD_NR        >  0            THEN                             
           DO;                                                                  
             /* **************************************** */                     
             /*    FEIL VED R0014901(AUTOBEREGNING).     */                     
             /* **************************************** */                     
                                                                                
             TERMINERINGS_IND = FATAL_FEIL;                                     
                                                                                
             GO TO FEILBEH;                                                     
           END;                                                                 
        ELSE                                                                    
                                                                                
           PROGRAM_ID     =   'R0019E01';                                       
                                                                                
        B00.PERSON(I).STATUS.VIRK_DATO_ÅMD = 0;                  /*Y2K*/        
                                                                                
        /* DLET NEST SISTE STATUS */                                            
        /* HELE FAMILIEPAKKE      */                                            
                                                                                
                                                                                
                                                                                
                                                                                
        IF (B02.STATUS_KODE_HIST(I) =                                           
                 W01_STATUS_KODE_HIST)            &                             
           (B02.SUM_YTELSE(I) =                                                 
                 W01_SUM_YTELSE)                  &                             
           (B02.PENSJONSTYPE1(I) =                                              
                 W01_PENSJONSTYPE1)               THEN                          
                                                                                
                                                                                
           DO;                                                                  
                                                                                
                 W01_DUMMY_DATO_ÅMD = 0;                                        
                 CALL OMREGNING_PGA_FNRENDRING;                                 
                                                                                
             IF FEIL_MELD_NR > 0                  THEN                          
                DO;                                                             
                   /* *********************************/                        
                   /* FEIL VED OMREGNING              */                        
                   /* *********************************/                        
                                                                                
                   TERMINERINGS_IND = FATAL_FEIL;                               
                                                                                
                   GO TO FEILBEH;                                               
                END;                                                            
             ELSE                                                               
                                                                                
                PROGRAM_ID = 'R0019E01';                                        
                                                                                
                ANT_OMR_4001 = ANT_OMR_4001 + 1;                                
                                                                                
             /* PROC R0019961 OMREGNING_PGA_FNRENDRING                          
                BRUKES HER FORDI DEN GIR ØNSKET RESULTAT VED                    
                FØDSELNUMMERENDRING                          */                 
                                                                                
           END;                                                                 
                                                                                
        ELSE                                                                    
                                                                                
           DO;                                                                  
                                                                                
             ANT_OMR_4901 = ANT_OMR_4901 + 1;                                   
                                                                                
             TRANS_OPPL_OMR.FØDSNUMMER =                                        
                   B02.PERSON(I).RF0PERSN.FNR;                                  
             IF B02.PENSJONSTYPE2(I) ^= 'A'  THEN /* AB 27.12*/                 
             EXEC CICS LINK PROGRAM ('R0016001')                                
                                    COMMAREA (KOM_OMR);                         
                                                                                
                                                                                
             IF FEIL_MELD_NR   >  0            THEN                             
                DO;                                                             
                   /* **************************************** */               
                   /* FEIL VED R0016001(STATESTIKK).           */               
                   /* **************************************** */               
                                                                                
                   GO TO FEILBEH;                                               
                END;                                                            
             ELSE                                                               
                                                                                
                PROGRAM_ID =  'R0019E01';                                       
             /*------------------------------------------------*/               
             /* SKRIV B02 MED NYE KRITTERIER PÅ RF - DB        */               
             /*------------------------------------------------*/               
                                                                                
                                                                                
             TRANS_OPPL_OMR.FØDSNUMMER =                                        
                   B02.PERSON(I).RF0PERSN.FNR;                                  
                                                                                
             EXEC CICS LINK PROGRAM ('R0015401')                                
                                    COMMAREA (KOM_OMR);                         
                                                                                
                                                                                
             IF FEIL_MELD_NR   >  0            THEN                             
                DO;                                                             
                   /* **************************************** */               
                   /* FEIL VED R0015401(BASEUTSKRIVING).       */               
                   /* **************************************** */               
                                                                                
                   GO TO FEILBEH;                                               
                END;                                                            
             ELSE                                                               
                                                                                
                PROGRAM_ID =  'R0019E01';                                       
                                                                                
           END;                                                                 
                                                                                
      END;                                                                      
                                                                                
 END OMREGN;                                                                    
                                                                                
 MANUELL: PROC;                                                                 
                                                                                
    /* MELDING TIL RTV REG.SEKSJ. OM 'MANUELL' OMREGNING */                     
    MELD_IO.ADRESSAT = 'F';                                                     
    CALL MELDINGSREC;                                                           
    ANT_CALL_MAN = ANT_CALL_MAN + 1;                                            
                                                                                
  DCL TEKST           CHAR(29);                                                 
  TEKST ='MANUELL';                                                             
                                                                                
 END MANUELL;                                                                   
                                                                                
 DØD: PROC;                                                                     
                                                                                
    DCL TEKST         CHAR(29);                                                 
                                                                                
                                                                                
    FØDSELSNR = FNRREC.SISTENR;                                                 
    FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);                   /*Y2K*/        
                                                                                
    WORK_DATO_ÅR_MND = FØD13_ÅR!!FØD13_MND;                      /*Y2K*/        
                                                                                
    WORK_TILALDER = DAGENS_DATO_ÅR_MND -                                        
                    WORK_DATO_ÅR_MND;                            /*Y2K*/        
                                                                                
    IF  WORK_DATO_ÅR_MND < 190601 THEN                           /*Y2K*/        
                                                                                
       DO;                                                                      
                                                                                
         /*  LESER ROT TILNR  */                                                
                                                                                
         SSA1_RF0PERSN.PKEY = FNRREC.SISTENR;                                   
                                                                                
         CALL LESER_ROT_SEGM_GU;                                                
                                                                                
         IF FEIL_MELD_NR      >  0            THEN                              
            DO;                                                                 
               /* **************************************** */                   
               /*  DATABASEFEIL                            */                   
               /* **************************************** */                   
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
         IF W02_MER_DATA THEN                                                   
            DO;                                                                 
                                                                                
              SUBSTR(ADDR(B01.PERSON(1).RF0PERSN) -> W01_HJELPE_IO,1,           
                     STORAGE(B01.PERSON(1).RF0PERSN)) = W01_IO;                 
                                                                                
            END;                                                                
                                                                                
         MELD_IO.ADRESSAT = 'U';                                                
         CALL MELDINGSREC;                                                      
                                                                                
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
                                                                                
         WORK_BLANKETTYPE = TRANS_OPPL_OMR.BLANKETTYPE;                         
         TRANS_OPPL_OMR.BLANKETTYPE = 'O1';                                     
         TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = WORK_DØDSDATO_ÅMD;   /*Y2K*/        
         TRANS_OPPL_OMR.FØDSNUMMER = FNRREC.SISTENR;                            
                                                                                
         EXEC CICS LINK PROGRAM ('R0013101') COMMAREA (KOM_OMR);                
                                                                                
                                                                                
         IF FEIL_MELD_NR       >  0            THEN                             
            DO;                                                                 
              /* ***************************** */                               
              /*   FEIL VED SPERRE-BEHANDLING  */                               
              /* ***************************** */                               
                                                                                
              GO TO FEILBEH;                                                    
            END;                                                                
         ELSE                                                                   
                                                                                
            PROGRAM_ID    =   'R0019E01';                                       
                                                                                
         /* DATA M/ SISTE STATUS TIL B01 */                                     
         B02 = B01;                                                             
                                                                                
                                                                                
         /* NB: FNR ER ENDRET */                                                
                                                                                
         DO I = 1 TO 14 WHILE(B02.PERSON(I).RF0PERSN.FNR ^=                     
                              FNRREC.SISTENR);                                  
                                                                                
         /* I PEKER NÅ PÅ DET FELT (DEN PERSON) HVOR                            
            FNR-ENDRING ER FORETATT              */                             
                                                                                
         END;                                                                   
                                                                                
         WORK_DØDSDATO_ÅMD = B02.PERSON(I).STATUS.DØDSDATO_ÅMD;  /*Y2K*/        
         WORK_FNR_Å = DØD_DATO_ÅR;                                              
         WORK_FNR_M = DØD_DATO_MND;                                             
                                                                                
         /* TESTER PÅ FRAALDER MOT DØDSDATO */                                  
                                                                                
         FØDSELSNR = FNRREC.FRANR;                                              
         FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);              /*Y2K*/        
                                                                                
         WORK_DATO_ÅR_MND = FØD13_ÅR!!FØD13_MND;                 /*Y2K*/        
                                                                                
         WORK_FRAALDER = WORK_FNR_ÅM_P -                         /*Y2K*/        
                         WORK_DATO_ÅR_MND;                       /*Y2K*/        
                                                                                
                                                                                
         /* TESTER PÅ TILALDER MOT DØDSDATO */                                  
                                                                                
         FØDSELSNR = FNRREC.SISTENR;                                            
         FØDSELSNR13 = KONV_FNR11_FNR13(FØDSELSNR);              /*Y2K*/        
                                                                                
         WORK_DATO_ÅR_MND = FØD13_ÅR!!FØD13_MND;                 /*Y2K*/        
                                                                                
         WORK_TILALDER = WORK_FNR_ÅM_P -                         /*Y2K*/        
                         WORK_DATO_ÅR_MND;                       /*Y2K*/        
                                                                                
                                                                                
         SELECT;                                                                
                                                                                
           WHEN (FRAALDER < 067)                                                
             DO;                                                                
                                                                                
                SELECT;                                                         
                  WHEN (TILALDER >= 067)                                        
                    DO;                                                         
                                                                                
                       CALL ENDRE_UFØRH_ALDER;                                  
                       CALL SKRIV_6001_5401;                                    
                                                                                
                    END;                                                        
                  OTHERWISE;                                                    
                END;                                                            
             END;                                                               
                                                                                
           WHEN (FRAALDER >= 067)                                               
             DO;                                                                
                                                                                
                SELECT;                                                         
                  WHEN (TILALDER < 067)                                         
                    DO;                                                         
                                                                                
                       CALL ENDRE_UFØRH_DØD;                                    
                       CALL SKRIV_6001_5401;                                    
                                                                                
                    END;                                                        
                  OTHERWISE;                                                    
                END;                                                            
             END;                                                               
                                                                                
           OTHERWISE;                                                           
                                                                                
         END;                                                                   
                                                                                
         TRANS_OPPL_OMR.BLANKETTYPE = WORK_BLANKETTYPE;                         
         WORK_TILKN_FNR(*) = '';                                                
                                                                                
         DO J = 1 TO 13 WHILE(B02.PERSON(I).TILKN(J).FNR_TILKN > 0);            
                                                                                
            /* LEGGER UT ALLE TILKN-FNR TIL DEN DØDE I WORK-TABELL */           
            /* HVIS TILKNYTNINGSKODE = E ELLER B.                  */           
                                                                                
            IF B02.PERSON(I).TILKN(J).TILKNYTNINGSKODE = 'E' !                  
               B02.PERSON(I).TILKN(J).TILKNYTNINGSKODE = 'B' THEN               
                                                                                
                 WORK_TILKN_FNR(J).WORK_FNR_TILKN =                             
                      B02.PERSON(I).TILKN(J).FNR_TILKN;                         
                                                                                
         END;                                                                   
                                                                                
                                                                                
         W02.PERSON(1) = B02.PERSON(I);                                         
                                                                                
         DO J = 1 TO 13 WHILE(WORK_TILKN_FNR(J).WORK_FNR_TILKN > 0);            
                                                                                
            /* KALLER R0013101 OG R0019961 FOR ALLE FNR I TABELL */             
                                                                                
            /* ENDRE OG REGNE OM TILKNYTTEDE PERSONER */                        
                                                                                
            TRANS_OPPL_OMR.FØDSNUMMER =                                         
                  WORK_TILKN_FNR(J).WORK_FNR_TILKN;                             
            TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 99999999;         /*Y2K*/        
                                                                                
            EXEC CICS LINK PROGRAM ('R0013101') COMMAREA (KOM_OMR);             
                                                                                
                                                                                
            IF FEIL_MELD_NR     >  0            THEN                            
               DO;                                                              
                  /* **************************************** */                
                  /* FEIL VED SPERRE-BEHANDLING               */                
                  /* **************************************** */                
                                                                                
                  TERMINERINGS_IND = FATAL_FEIL;                                
                                                                                
                  GO TO FEILBEH;                                                
               END;                                                             
            ELSE                                                                
                                                                                
               PROGRAM_ID  =   'R0019E01';                                      
                                                                                
            B01.PERSON(I) = W02.PERSON(1);                                      
            B02 = B01;                                                          
            B00 = '';                                                           
                                                                                
            DO I = 1 TO 14 WHILE(B02.PERSON(I).RF0PERSN.FNR ^=                  
                                 WORK_TILKN_FNR(J).WORK_FNR_TILKN);             
                                                                                
               /* I PEKER NÅ PÅ DET FELT (DEN PERSON) I B02 */                  
               /* SOM ER TILKNYTTET DEN DØDE OG SOM HAR     */                  
               /* TILKNYTNINGSKODE = E ELLER B.             */                  
                                                                                
            END;                                                                
                                                                                
            MELD_IO.ADRESSAT = 'T';                                             
            CALL MELDINGSREC;       /* MELDING TRYGDEKTR. */                    
                                                                                
                                                                                
            SØKER_IND = I;                                                      
            ANT_CALL_OMR = ANT_CALL_OMR + 1;                                    
                                                                                
            IF SØKER_IND = 1 THEN                                               
               EKTEF_IND = 2;                                                   
            ELSE                                                                
               IF SØKER_IND = 2 THEN                                            
                  EKTEF_IND = 1;                                                
                                                                                
                                                                                
            DIV_PARAM_OMR.KJØRINGS_TYPE = 'O';                                  
                                                                                
  /*        NESTE_HENDELSE_DATO_ÅMD = DAGENS_DATO_ÅR_MND; */                    
            NESTE_HENDELSE_DATO_ÅMD = DATO_ÅR_MND * 100;         /*Y2K*/        
                                                                                
            TRANS_OPPL_OMR.TRANSTYPE = 45;                                      
                                                                                
            STØNADSBREV_ØNSKET_IND = '1'B;                                      
                                                                                
            FNR_PIC = B02.PERSON(I).RF0PERSN.FNR;                               
            TEKST ='CALL 4001 I DØD ' !! FNR_CHAR;                              
                                                                                
            W01_DUMMY_DATO_ÅMD = 0;                                             
            CALL OMREGNING_PGA_FNRENDRING;                                      
                                                                                
            IF FEIL_MELD_NR > 0                 THEN                            
               DO;                                                              
                  /* ****************** */                                      
                  /* FEIL VED OMREGNING */                                      
                  /* ****************** */                                      
                                                                                
                  TERMINERINGS_IND = FATAL_FEIL;                                
                                                                                
                  GO TO FEILBEH;                                                
               END;                                                             
            ELSE                                                                
                                                                                
               PROGRAM_ID = 'R0019E01';                                         
                                                                                
            ANT_OMR_4001 = ANT_OMR_4001 + 1;                                    
                                                                                
            /* PROC R0019961 OMREGNING_PGA_FNRENDRING                           
               BRUKES HER FORDI DEN GIR ØNSKET RESULTAT VED                     
               FØDSELNUMMERENDRING                          */                  
                                                                                
         END;                                                                   
                                                                                
       END;                                                                     
                                                                                
 END DØD;                                                                       
                                                                                
 SKRIV_6001_5401: PROC;                                                         
                                                                                
    /* STAT-TRANS */                                                            
                                                                                
    TRANS_OPPL_OMR.FØDSNUMMER =                                                 
          B02.PERSON(I).RF0PERSN.FNR;                                           
                                                                                
  IF B02.PENSJONSTYPE2(I) ^= 'A'  THEN /* AB 27.12 */                           
                                                                                
    EXEC CICS LINK PROGRAM ('R0016001')                                         
                           COMMAREA (KOM_OMR);                                  
                                                                                
                                                                                
    IF FEIL_MELD_NR             >  0            THEN                            
       DO;                                                                      
          /* **************************************** */                        
          /*         FEIL VED SPERRE-BEHANDLING       */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
    ELSE                                                                        
                                                                                
       PROGRAM_ID = 'R0019E01';                                                 
                                                                                
                       /* SKRIV B02 M/ NYE KRITT */                             
                       /* PÅ BASEN               */                             
                                                                                
    TRANS_OPPL_OMR.FØDSNUMMER =                                                 
          B02.PERSON(I).RF0PERSN.FNR;                                           
                                                                                
    EXEC CICS LINK PROGRAM ('R0015401') COMMAREA (KOM_OMR);                     
                                                                                
                                                                                
    IF FEIL_MELD_NR >         0            THEN                                 
       DO;                                                                      
          /* **************************************** */                        
          /* FEIL VED SPERRE-BEHANDLING               */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
    ELSE                                                                        
                                                                                
       PROGRAM_ID = 'R0019E01';                                                 
                                                                                
    ANT_UFØRH = ANT_UFØRH + 1;                                                  
                                                                                
 END SKRIV_6001_5401;                                                           
                                                                                
                                                                                
 ENDRE_UFØRH_ALDER: PROC;                                                       
                                                                                
    DO J = 1 TO 5 WHILE(B02.PERSON(I).UFØRHIST(J).UFT_ÅMD > 0);  /*Y2K*/        
                                                                                
    /* J PEKER NÅ PÅ DET 1. LEDIGE UFØRHIST SEGMENT   */                        
    /* ELLER DET SISTE HVIS ALLE ER BENYTTET.         */                        
    /* PROGRAMMET SKAL ENDRE PÅ DET SIST OPPDATERTE.  */                        
                                                                                
    END;                                                                        
                                                                                
    IF B02.PERSON(I).UFØRHIST(J).UFT_ÅMD = 0 THEN                /*Y2K*/        
       J = J - 1;                                                               
                                                                                
    /* LEGGER TIL 67 ÅR PÅ FØDSELSÅR  */                                        
    /* LEGGER TIL 1 MND PÅ FØDSELSMND */                                        
  /*ETTER 1998 SKAL UP IKKE OPPHØRE I JANUAR - ENDRES TIL DESEMBER*/            
                                                                                
    OPPH_ÅR = FØD13_ÅR + 67;                                                    
    OPPH_MN = FØD13_MND;               /* KONS RF */                            
    OPPH_DG = FØD13_DAG;                                                        
                                                                                
    FØD13_ÅR = FØD13_ÅR + 67;                                    /*Y2K*/        
    FØD13_MND = FØD13_MND + 1;                                   /*Y2K*/        
                                                                                
    IF FØD13_MND > 12 THEN                                       /*Y2K*/        
                                                                                
      DO;                                                                       
                                                                                
        FØD13_ÅR = FØD13_ÅR + 1;                                 /*Y2K*/        
        FØD13_MND = FØD13_MND - 12;                              /*Y2K*/        
                                                                                
      END;                                                                      
                                                                                
    IF OPPH_ÅR > 1997       &                 /* KONS RF */                     
       OPPH_MN = 12       THEN                                                  
       WORK_DATO_ÅMD = OPPH_ÅMD;                                                
    ELSE                                                                        
       WORK_DATO_ÅMD = FØD13_ÅR!!FØD13_MND!!FØD13_DAG;                          
                                                                                
    B02.PERSON(I).UFØRHIST(J).OPPHØRSDATO_ÅMD = WORK_DATO_ÅMD;                  
    B02.PERSON(I).UFØRHIST(J).OPPHØRSKODE    = 'A';                             
    WORK_DATO_ÅR_MND = FØD13_ÅR!!FØD13_MND;                      /*Y2K*/        
                                                                                
                                                                                
    FØD_ÅR  = SUBSTR(FØD13_ÅR,3,2);                              /*Y2K*/        
    FØD_MND = FØD13_MND;                                         /*Y2K*/        
                                                                                
 END ENDRE_UFØRH_ALDER;                                                         
                                                                                
                                                                                
 ENDRE_UFØRH_DØD: PROC;                                                         
                                                                                
    DO J = 1 TO 5 WHILE(B02.PERSON(I).UFØRHIST(J).UFT_ÅMD > 0);  /*Y2K*/        
                                                                                
    /* J PEKER NÅ PÅ DET 1. LEDIGE UFØRHIST SEGMENT   */                        
    /* ELLER DET SISTE HVIS ALLE ER BENYTTET.         */                        
    /* PROGRAMMET SKAL ENDRE PÅ DET SIST OPPDATERTE.  */                        
                                                                                
    END;                                                                        
                                                                                
    IF B02.PERSON(I).UFØRHIST(J).UFT_ÅMD = 0 THEN                /*Y2K*/        
       J = J - 1;                                                               
                                                                                
    /* LEGGER INN DØDSDATO FRA STATUS SEGMENT */                                
                                                                                
    /* LEGGER TIL 1 MND PÅ DØDSDATO MND */                                      
                                                                                
    OPPH_ÅR = FØD13_ÅR;                                                         
    OPPH_MN = FØD13_MND;               /* KONS RF */                            
    OPPH_DG = FØD13_DAG;                                                        
                                                                                
                                                                                
    FØD13_MND = FØD13_MND + 1;       /* KONS RF */                              
    IF FØD13_MND > 12 THEN                                                      
      DO;                                                                       
        FØD13_ÅR = FØD13_ÅR + 1;                                                
        FØD13_MND = FØD13_MND - 12;                                             
      END;                                                                      
                                                                                
  /*ETTER 1998 SKAL UP IKKE OPPHØRE I JANUAR - ENDRES TIL DESEMBER*/            
                                                                                
    IF OPPH_ÅR > 1997       &      /* KONS RF */                                
       OPPH_MN = 12       THEN                                                  
       WORK_DATO_ÅMD = OPPH_ÅMD;                                                
    ELSE                                                                        
       WORK_DATO_ÅMD = FØD13_ÅR!!FØD13_MND!!FØD13_DAG;                          
                                                                                
    B02.PERSON(I).UFØRHIST(J).OPPHØRSDATO_ÅMD = WORK_DATO_ÅMD;                  
    B02.PERSON(I).UFØRHIST(J).OPPHØRSKODE    = 'D';                             
                                                                                
 END ENDRE_UFØRH_DØD;                                                           
                                                                                
                                                                                
 ENDRE_TILKN: PROC;                                                             
                                                                                
    DCL TEKST         CHAR(29);                                                 
                                                                                
    /*  LESER ROT TILNR  */                                                     
                                                                                
    SUBSTR(ADDR(B01.PERSON(1).TILKN(1)) -> W01_HJELPE_IO,1,                     
           STORAGE(B01.PERSON(1).TILKN(1))) = W01_IO;                           
                                                                                
    SSA3_RF0PERSN.PKEY = B01.PERSON(1).TILKN(1).FNR_TILKN;                      
    SSA3_TILKN.PKEY    = FNRREC.FRANR;                                          
                                                                                
    CALL LESER_TILKN_GHU;                                                       
                                                                                
    IF FEIL_MELD_NR      >  0            THEN                                   
       DO;                                                                      
          /* **************************************** */                        
          /*  DATABASEFEIL                            */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
    IF W02_MER_DATA THEN                                                        
       DO;                                                                      
                                                                                
       SUBSTR(ADDR(B01.PERSON(1).TILKN(1)) -> W01_HJELPE_IO,1,                  
              STORAGE(B01.PERSON(1).TILKN(1))) = W01_IO;                        
                                                                                
       CALL FJERNER_SEGM_DLET;                                                  
                                                                                
       IF FEIL_MELD_NR      >  0            THEN                                
          DO;                                                                   
             /* **************************************** */                     
             /*  DATABASEFEIL                            */                     
             /* **************************************** */                     
                                                                                
             GO TO FEILBEH;                                                     
                                                                                
          END;                                                                  
                                                                                
                                                                                
       B01.PERSON(1).TILKN(1).FNR_TILKN = FNRREC.SISTENR;                       
                                                                                
       W01_HJELPE_PTR = ADDR(B01.PERSON(1).TILKN(1));                           
       W01_IO = W01_HJELPE_IO;                                                  
                                                                                
                                                                                
       TEKST ='TILKN';                                                          
       FNR_PIC = SSA3_RF0PERSN.PKEY;                                            
       TEKST ='TILKN: ' !! SSA4_STATUS.KODE !! ' FNR ' !! FNR_CHAR;             
                                                                                
       CALL DANNER_TILKN_ISRT;                                                  
                                                                                
       IF FEIL_MELD_NR      >  0            THEN                                
          DO;                                                                   
             /* **************************************** */                     
             /*  DATABASEFEIL                            */                     
             /* **************************************** */                     
                                                                                
             GO TO FEILBEH;                                                     
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
 END ENDRE_TILKN;                                                               
                                                                                
                                                                                
 STATUS: PROC;                                                                  
                                                                                
                                                                                
    SSA_UQUAL = PCB1.SEGM_NAVN;                                                 
                                                                                
    CALL DANNE_SEGM_ISRT;                                                       
                                                                                
    IF FEIL_MELD_NR             >  0            THEN                            
       DO;                                                                      
          /* **************************************** */                        
          /* DATABASEFEIL                             */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
                                                                                
    CALL LESER_UNDER_STATUS_GNP;                                                
                                                                                
    IF FEIL_MELD_NR        >  0            THEN                                 
       DO;                                                                      
          /* **************************************** */                        
          /* DATABASEFEIL                             */                        
          /* **************************************** */                        
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
    DO WHILE( W02_MER_DATA  &  W02_ISRT_OK );                                   
                                                                                
       /* DANNER RESTEN AV SEGMENTENE */                                        
                                                                                
       SSA_UQUAL = PCB1.SEGM_NAVN;                                              
                                                                                
       CALL DANNE_UNDER_STATUS_ISRT;                                            
                                                                                
       IF FEIL_MELD_NR          >  0            THEN                            
          DO;                                                                   
             /* **************************************** */                     
             /* DATABASEFEIL                             */                     
             /* **************************************** */                     
                                                                                
             GO TO FEILBEH;                                                     
          END;                                                                  
                                                                                
       /* FNR ÅMD ENDRES I DE TILKNYTTEDE SEGMENT I                             
          " FAMILIEPAKKEN "                                 */                  
                                                                                
       IF PCB1.SEGM_NAVN = 'TILKN   ' THEN                                      
          DO;                                                                   
                                                                                
             CALL ENDRE_TILKN;                                                  
             CALL TRANHIST_TILKN;                                               
                                                                                
          END;                                                                  
                                                                                
       CALL LESER_UNDER_STATUS_GNP;                                             
                                                                                
       IF FEIL_MELD_NR          >  0            THEN                            
          DO;                                                                   
             /* **************************************** */                     
             /* DATABASEFEIL                             */                     
             /* **************************************** */                     
                                                                                
             GO TO FEILBEH;                                                     
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
 END STATUS;                                                                    
                                                                                
 TRANHIST: PROC;                                                                
                                                                                
    /* DANNER TRANHIST OG SEGMENTENE UNDER */                                   
                                                                                
    W02_MER_DATA = '1'B;                                                        
                                                                                
    DO WHILE( W02_MER_DATA  &  W02_ISRT_OK );                                   
                                                                                
       SELECT ( PCB1.SEGM_NAVN );                                               
                                                                                
         WHEN ( 'BARN    ' )                                                    
           /* ********************************* */                              
           /* FÅTT INN :    B A R N          */                                 
           /* ********************************* */                              
           DO;                                                                  
                                                                                
             IO_PEKER = ADDR(W01_IO);                                           
                                                                                
             IF BARN_S.FNR = FNRREC.FRANR THEN                                  
                BARN_S.FNR = FNRREC.SISTENR;                                    
                                                                                
                                                                                
           END;                                                                 
                                                                                
       OTHERWISE;                                                               
                                                                                
       END;                                                                     
                                                                                
       SSA_UQUAL = PCB1.SEGM_NAVN;                                              
       CALL DANNE_SEGM_ISRT;                                                    
                                                                                
       IF FEIL_MELD_NR > 0                      THEN                            
          DO;                                                                   
             /* ********************************* */                            
             /* DATABASEFEIL                      */                            
             /* ********************************* */                            
                                                                                
             GO TO FEILBEH;                                                     
          END;                                                                  
                                                                                
       CALL LESER_RESTEN_GNP;  /* LES UNDERSEGMENT */                           
        IF SSA_UQUAL = PCB1.SEGM_NAVN  THEN                                     
           W02_MER_DATA = '0'B;                                                 
                                                                                
       IF FEIL_MELD_NR > 0                 THEN                                 
          DO;                                                                   
             /* **************************************** */                     
             /* DATABASEFEIL                             */                     
             /* **************************************** */                     
                                                                                
             GO TO FEILBEH;                                                     
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
                                                                                
 END TRANHIST;                                                                  
                                                                                
 TRANHIST_TILKN: PROC;                                                          
                                                                                
    DCL TEKST         CHAR(29);                                                 
                                                                                
    /*       LESER ROT FRANR  */                                                
                                                                                
    CALL LESER_ROT_SEGM_TRANH_GU;                                               
                                                                                
    IF FEIL_MELD_NR      >  0   THEN                                            
       DO;                                                                      
          /* ********************************* */                               
          /*  DATABASEFEIL                     */                               
          /* ********************************* */                               
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
    IF W02_MER_DATA             THEN                                            
       DO;                                                                      
                                                                                
         CALL LESER_TRANHIST_F_GHNP;                                            
                                                                                
         IF FEIL_MELD_NR >  0   THEN                                            
            DO;                                                                 
               /* ********************************* */                          
               /* DATABASEFEIL                      */                          
               /* ********************************* */                          
                                                                                
               GO TO FEILBEH;                                                   
            END;                                                                
                                                                                
         IO_PEKER = ADDR(W01_IO);                                               
                                                                                
       END;                                                                     
                                                                                
    FNR_PIC = SSA3_RF0PERSN.PKEY;                                               
    TEKST ='TRANHIST ' !! FNR_CHAR;                                             
                                                                                
    DO WHILE( W02_MER_DATA & W02_ISRT_OK );                                     
                                                                                
      SELECT ( PCB3.SEGM_NAVN );                                                
                                                                                
        WHEN ( 'TRANHIST' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    T R A N H I S T    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
             SSA5_TRANHIST.VTP = TRANH_S.VTP_KEY;                               
             SSA5_TRANHIST.KODE = TRANH_S.GRBLKODE;                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBAP' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B A P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF ALDER_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 ALDER_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBA1' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B A P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF A1DER_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 A1DER_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBKF' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B A P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF KF_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 KF_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBAF' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B A P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF AF_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 AF_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBUP' )                                                     
          /* **************************************************** */            
          /* FÅTT INN :  G R U N N B U P                          */            
          /* **************************************************** */            
          DO;                                                                   
            IF SSA5_TRANHIST.KODE = 'UP'        THEN                            
                                                                                
               IF UFØRP_S.FNR_EK = FNRREC.FRANR THEN                            
                  DO;                                                           
                    UFØRP_S.FNR_EK = FNRREC.SISTENR;                            
                    TRANHIST_ENDRET = TRUE;                                     
                  END;                                                          
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBUF' );                                                    
          /* **************************************************** */            
          /* FÅTT INN :  G R U N N B U P                          */            
          /* **************************************************** */            
                                                                                
        WHEN ( 'GRUNNBU2' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B U P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF U2ØRP_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 U2ØRP_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBU3' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B U P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF U3_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 U3_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRBLUFST' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L U F S T    */                               
          /* ********************************* */                               
             DO;                                                                
                 TRANHIST_ENDRET = TRUE;                                        
             END;                                                               
                                                                                
        WHEN ( 'GRBLFORS' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L F O R S    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF FORSØ_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 FORSØ_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBEP' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B E P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF ETT_E_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 ETT_E_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBE3' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B E P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF ETT_E3_S.FNR_EK = FNRREC.FRANR THEN                              
               DO;                                                              
                 ETT_E3_S.FNR_EK = FNRREC.SISTENR;                              
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRBLFAMP', 'GRBLFAE4' )                                         
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L F A M P    */                               
          /* ********************************* */                               
             DO;                                                                
                 TRANHIST_ENDRET = TRUE;                                        
             END;                                                               
                                                                                
                                                                                
        WHEN ( 'GRBLEBEN' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L E B E N    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF ETT_B_S.FNR_DØD = FNRREC.FRANR THEN                              
               DO;                                                              
                 ETT_B_S.FNR_DØD = FNRREC.SISTENR;                              
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRBLEBB6' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L E B E N    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF ETT_B6_S.FNR_DØD = FNRREC.FRANR THEN                             
               DO;                                                              
                 ETT_B6_S.FNR_DØD = FNRREC.SISTENR;                             
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRBLEBBE' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L E B B E    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF FOREL_S.FNR_FAR = FNRREC.FRANR THEN                              
               DO;                                                              
                 FOREL_S.FNR_FAR = FNRREC.SISTENR;                              
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
            IF FOREL_S.FNR_MOR = FNRREC.FRANR THEN                              
               DO;                                                              
                 FOREL_S.FNR_MOR = FNRREC.SISTENR;                              
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRBLF5BE' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L E B B E    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF FOREL_F5_S.FNR_F   = FNRREC.FRANR THEN                           
               DO;                                                              
                 FOREL_F5_S.FNR_F   = FNRREC.SISTENR;                           
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
            IF FOREL_S.FNR_MOR   = FNRREC.FRANR THEN                            
               DO;                                                              
                 FOREL_S.FNR_MOR   = FNRREC.SISTENR;                            
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBIF' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L F O R S    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF F7_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 F7_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBFO' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L F O R S    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF FO_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 FO_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBYP' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R U N N B Y P    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF YRKEP_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 YRKEP_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
        WHEN ( 'ENDRBLAN' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    E N D R B L A N    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF ENDRB_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 ENDRB_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'ENBLAN1 ' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    E N D R B L A N    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF EN_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 EN_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'OPPHBL1 ' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    O P P H B L 1      */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF OPPB1_S.FNR_EK = FNRREC.FRANR THEN                               
               DO;                                                              
                 OPPB1_S.FNR_EK = FNRREC.SISTENR;                               
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'OPPHBL2 ' );                                                    
          /* ********************************* */                               
          /*  FÅTT INN :    O P P H B L 2      */                               
          /* ********************************* */                               
                                                                                
        WHEN ( 'BARN    ' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    B A R N            */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF BARN_S.FNR = FNRREC.FRANR THEN                                   
               DO;                                                              
                 CALL FJERNER_SEGM_DLET;                                        
                                                                                
                 IF FEIL_MELD_NR > 0       THEN                                 
                    DO;                                                         
                       /* ************************** */                         
                       /* DATABASEFEIL               */                         
                       /* ************************** */                         
                                                                                
                       GO TO FEILBEH;                                           
                    END;                                                        
                                                                                
                 SSA_UQUAL = PCB3.SEGM_NAVN;                                    
                                                                                
                 BARN_S.FNR = FNRREC.SISTENR;                                   
                                                                                
                 CALL DANNER_TRANH_BARN_ISRT;                                   
                                                                                
                 IF FEIL_MELD_NR > 0       THEN                                 
                    DO;                                                         
                       /* ************************** */                         
                       /* DATABASEFEIL               */                         
                       /* ************************** */                         
                                                                                
                       GO TO FEILBEH;                                           
                    END;                                                        
                                                                                
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBEE' )                                                     
          /* ********************************* */                               
          /*  FÅTT INN :    G R B L F O R S    */                               
          /* ********************************* */                               
          DO;                                                                   
                                                                                
            IF EE_S.FNR_EK = FNRREC.FRANR THEN                                  
               DO;                                                              
                 EE_S.FNR_EK = FNRREC.SISTENR;                                  
                 TRANHIST_ENDRET = TRUE;                                        
               END;                                                             
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNEES' )                                                     
             DO;                                                                
                 TRANHIST_ENDRET = TRUE;                                        
             END;                                                               
                                                                                
        OTHERWISE                                                               
          /* ********************************* */                               
          /*  FÅTT INN : ET UKJENT SEGMENT     */                               
          /* ********************************* */                               
          DO;                                                                   
  L105:                                                                         
            FEIL_MELD_NR                        =  500;                         
            FEIL_VED_LABEL                      = '105';                        
            GO TO FEILBEH;                                                      
          END;                                                                  
                                                                                
      END;/*   SELECT    :  PCB3.SEGM_NAVN     */                               
                                                                                
      IF TRANHIST_ENDRET THEN                                                   
                                                                                
         DO;                                                                    
                                                                                
           CALL DANNER_TRANH_TILKN_REPL;                                        
                                                                                
           IF FEIL_MELD_NR >  0            THEN                                 
              DO;                                                               
                 /* ************************** */                               
                 /* DATABASEFEIL               */                               
                 /* ************************** */                               
                                                                                
                 GO TO FEILBEH;                                                 
              END;                                                              
                                                                                
           TRANHIST_ENDRET = FALSE;                                             
                                                                                
         END;                                                                   
                                                                                
    CALL LESER_TRANH_TILKN_GHNP;                                                
                                                                                
    IF FEIL_MELD_NR      >  0            THEN                                   
       DO;                                                                      
          /* ********************************* */                               
          /*  DATABASEFEIL                     */                               
          /* ********************************* */                               
                                                                                
          GO TO FEILBEH;                                                        
       END;                                                                     
                                                                                
                                                                                
    END; /* DO WHILE W02_MER_DATA ------    */                                  
                                                                                
 END TRANHIST_TILKN;                                                            
                                                                                
 MELDINGSREC: PROC;                                                             
                                                                                
                                                                                
    IF MELD_IO.ADRESSAT = 'S' !                                                 
       MELD_IO.ADRESSAT = 'V' !                                                 
       MELD_IO.ADRESSAT = 'U' !                                                 
       MELD_IO.ADRESSAT = 'X' !                                                 
       MELD_IO.ADRESSAT = 'R' THEN                                              
       DO;                                                                      
                                                                                
          /* IKKE LAGT UT I B02. REF. TIL INPUT SEGMENT: */                     
                                                                                
          MELD_IO.NAVN = B01.PERSON(1).RF0PERSN.NAVN;                           
          MELD_IO.TKNR = B01.PERSON(1).RF0PERSN.TKNR;                           
                                                                                
          SSA3_RF0PERSN.PKEY = FNRREC.FRANR;                                    
                                                                                
          CALL LESER_STATUS_GU;                                                 
                                                                                
                                                                                
          IF FEIL_MELD_NR      >  0            THEN                             
             DO;                                                                
                /* **************************************** */                  
                /*  DATABASEFEIL                            */                  
                /* **************************************** */                  
                                                                                
                GO TO FEILBEH;                                                  
             END;                                                               
                                                                                
          IF W02_MER_DATA THEN                                                  
             DO;                                                                
                                                                                
               SUBSTR(ADDR(B01.PERSON(1).STATUS) -> W01_HJELPE_IO,1,            
                      STORAGE(B01.PERSON(1).STATUS)) = W01_IO;                  
                                                                                
               MELD_IO.PK1 = B01.PERSON(1).STATUS.PENSJONSTYPE1;                
                                                                                
               IF MELD_IO.ADRESSAT = 'V' THEN                                   
                  MELD_IO.VIRKDATO_ÅMD =                         /*Y2K*/        
                          B01.PERSON(1).STATUS.VIRK_DATO_ÅMD;    /*Y2K*/        
               ELSE                                                             
                                                                                
                  MELD_IO.VIRKDATO_ÅMD = 0;                      /*Y2K*/        
                                                                                
             END;                                                               
                                                                                
          ELSE                                                                  
                                                                                
             IF MELD_IO.ADRESSAT = 'U' THEN                                     
                MELD_IO.PK1 = 'D';                                              
                                                                                
             ELSE                                                               
                                                                                
                MELD_IO.PK1 = ' ';                                              
                                                                                
       END;                                                                     
                                                                                
    ELSE     /* MELD_IO.ADRESSAT = F ! T. B02 ER LAGT UT                        
                                             REF TIL B02: */                    
       DO;                                                                      
          MELD_IO.NAVN = B02.PERSON(I).RF0PERSN.NAVN;                           
          MELD_IO.TKNR = B02.PERSON(I).RF0PERSN.TKNR;                           
          MELD_IO.PK1  = B02.PERSON(I).STATUS.PENSJONSTYPE1;                    
       END;                                                                     
                                                                                
    MELD_IO.ENDRINGSDATA.KODE        = FNRREC.KODE;                             
    MELD_IO.ENDRINGSDATA.FRANR       = FNRREC.FRANR;                            
    MELD_IO.ENDRINGSDATA.SISTENR     = FNRREC.SISTENR;                          
    MELD_IO.ENDRINGSDATA.ENDR_DATO_ÅMD = FNRREC.DATO / 10;       /*Y2K*/        
    MELD_IO.ENDRINGSDATA.LINKNR      = FNRREC.LINKNR;                           
                                                                                
    IF MELD_IO.ADRESSAT = 'T' THEN                                              
       MELD_IO.SORTERINGSBEGREP.TKNR = MELD_IO.TKNR;                            
    ELSE                                                                        
       MELD_IO.SORTERINGSBEGREP.TKNR = 0;                                       
                                                                                
    IF MELD_IO.ADRESSAT = 'S' THEN                                              
       MELD_IO.SORTERINGSBEGREP.FNR = MELD_IO.ENDRINGSDATA.LINKNR;              
    ELSE                                                                        
       /* ADRESSAT = F , R  , V ELLER T */                                      
                                                                                
       MELD_IO.SORTERINGSBEGREP.FNR = MELD_IO.ENDRINGSDATA.FRANR;               
                                                                                
    EXEC CICS WRITE DATASET('MELDREC') FROM(MELD_IO)                            
         RIDFLD(MELD_PEKER) RBA;                                                
                                                                                
 END MELDINGSREC;                                                               
                                                                                
                                                                                
 %INCLUDE R0019961;      /* OMREGNING_PGA_FNRENDRING */                         
                                                                                
 %INCLUDE R0019956;      /* P9956_BER_G_CICS    */                              
                                                                                
    /* ************************************************************** */        
    /* ************************************************************** */        
    /* **********                                       ************* */        
    /* ******        INTERNE    PROCEDURER                  ********* */        
    /* **********                                       ************* */        
    /* ************************************************************** */        
    /* ************************************************************** */        
                                                                                
                                                                                
                                                                                
                                                                                
    INIT_PCB: PROC;                                                             
                                                                                
       CALL PLITDLI                       (W02_PARM_CT_3,                       
                                           W01_PCB_FUNCTION,                    
                                              W01_PSB_NAVN,                     
                                              UIBPTR);                          
                                                                                
                                                                                
       IF DLIUIB.UIBFCTR         ^=    UIB_RC_OK       THEN                     
         DO;                                                                    
           /* ************************** */                                     
           /*  FEIL I INITIERINGKALL  */                                        
           /* ************************** */                                     
           MELDING1O =                                                          
                         'FEIL VED INITIERINGS-KALLET :'       !!               
                         '     UIBFCTR = ' !! UNSPEC (UIBFCTR) !!               
                         '     UIBDLTR = ' !! UNSPEC (UIBDLTR) ;                
                                                                                
           EXEC CICS SEND MAP('S0019E1') MAPSET('S0019E3') DATAONLY;            
                                                                                
           EXEC CICS   RETURN;                                                  
                                                                                
         END;                                                                   
                                                                                
    /* ********************************************************** */            
    /*                                                            */            
    /*  SETTER  PCB_PEKER  =  UIBPCBAL  FRA INITIERINGS-KALLET    */            
    /*                                                            */            
    /* ********************************************************** */            
                                                                                
         PCB_UIB_PEKER_OMR.UIB_PEKER     =    UIBPTR  ;                         
         PCB_UIB_PEKER_OMR.PCB_PEKER     =    UIBPCBAL;                         
                                                                                
                                                                                
    END INIT_PCB;                                                               
                                                                                
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR  Å LESE NESTE SEGMENT ( GNP   UKVALIFISERT  )    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_RESTEN_GNP:                                                           
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_GNP,                       
                                                 PCB1,                          
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' , 'GA' , 'GK' )                                         
             DO;                                                                
              W02_MER_DATA                 =    '1'B;                           
             END;                                                               
            WHEN ( 'GE' , 'GB' )                                                
             DO;                                                                
              W02_MER_DATA                 =    '0'B;                           
             END;                                                               
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L110:                                                                          
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '110';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L120:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '120';                                
        END;                                                                    
    END LESER_RESTEN_GNP;                                                       
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DANNE_SEGM_ISRT:                                                            
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_ISRT,                      
                                                 PCB2,                          
                                                 W01_IO,                        
                                                 SSA2_RF0PERSN,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB2.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_ISRT_OK                  =    '1'B;                           
            WHEN ( 'II' )                                                       
              W02_ISRT_OK                  =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L130:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB2.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '130';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L140:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB2.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '140';                                
        END;                                                                    
    END DANNE_SEGM_ISRT;                                                        
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT SEGMENT ( GU     KVALIFISERT  )         */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_ROT_SEGM_GU:                                                          
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GU,                        
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L150:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '150';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L160:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '160';                                
        END;                                                                    
    END LESER_ROT_SEGM_GU;                                                      
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT SEGMENT ( GHU    KVALIFISERT  )         */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_ROT_SEGM_GHU:                                                         
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GHU,                       
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L170:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '170';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L180:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '180';                                
        END;                                                                    
    END LESER_ROT_SEGM_GHU;                                                     
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR FJERNE ALLE SEGMENTER ( DLET )                   */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    FJERNER_ALLE_SEGM_DLET:                                                     
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_DLET,                      
                                                 PCB1,                          
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_DLET_OK                  =    '1'B;                           
            WHEN ( 'DJ' )                                                       
              W02_DLET_OK                  =    '1'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L190:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '190';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L200:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '200';                                
        END;                                                                    
    END FJERNER_ALLE_SEGM_DLET;                                                 
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE ROT SEGMENT ( GHU    KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_TILKN_GHU:                                                            
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_6,                 
                                                 W02_GHU,                       
                                                 PCB3,                          
                                                 W01_IO,                        
                                                 SSA3_RF0PERSN,                 
                                                 SSA4_STATUS,                   
                                                 SSA3_TILKN);                   
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L210:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '210';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L220:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '220';                                
        END;                                                                    
                                                                                
                                                                                
    END LESER_TILKN_GHU;                                                        
                                                                                
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR FJERNE TILKN. SEGM DLET                          */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    FJERNER_SEGM_DLET:                                                          
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_DLET,                      
                                                 PCB3,                          
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_DLET_OK                  =    '1'B;                           
            WHEN ( 'DJ' )                                                       
              W02_DLET_OK                  =    '1'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L230:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '230';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L240:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '240';                                
        END;                                                                    
                                                                                
                                                                                
    END FJERNER_SEGM_DLET;                                                      
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å DANNE TILKN SEGM ISRT                          */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DANNER_TILKN_ISRT:                                                          
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_6,                 
                                                 W02_ISRT,                      
                                                 PCB3,                          
                                                 W01_IO,                        
                                                 SSA3_RF0PERSN,                 
                                                 SSA4_STATUS,                   
                                                 SSA3_TILKN_UQUAL);             
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_ISRT_OK                  =    '1'B;                           
            WHEN ( 'II' )                                                       
              W02_ISRT_OK                  =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L250:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '250';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L260:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '260';                                
        END;                                                                    
                                                                                
                                                                                
    END DANNER_TILKN_ISRT;                                                      
                                                                                
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE STATUS SEGM ( GU     KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_STATUS_GU:                                                            
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_GU,                        
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA3_RF0PERSN,                 
                                                 SSA3_STATUS);                  
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L270:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '270';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L280:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '280';                                
        END;                                                                    
                                                                                
                                                                                
    END LESER_STATUS_GU;                                                        
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE ROT SEGMENT ( GHU    KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_TILKN_GNP:                                                            
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA3_TILKN);                   
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L290:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '290';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L300:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '300';                                
        END;                                                                    
                                                                                
                                                                                
    END LESER_TILKN_GNP;                                                        
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE STATUS SEGM ( GNP    KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_NEST_SISTE_STATUS_GNP:                                                
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA3_STATUS_L);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L310:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '310';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L315:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '315';                                
                                                                                
        END;                                                                    
                                                                                
    END LESER_NEST_SISTE_STATUS_GNP;                                            
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE STATUS SEGM ( GNP    KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_SISTE_STATUS_GNP:                                                     
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA3_STATUS_F);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L320:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '320';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L330:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '330';                                
                                                                                
        END;                                                                    
                                                                                
    END LESER_SISTE_STATUS_GNP;                                                 
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR  Å LESE NESTE SEGMENT ( GNP   UKVALIFISERT  )    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_UNDER_STATUS_GNP:                                                     
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_GNP,                       
                                                 PCB1,                          
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' , 'GA' , 'GK' )                                         
              DO;                                                               
                 W02_MER_DATA              =    '1'B;                           
                                                                                
                 SELECT ( PCB1.SEGM_NAVN );                                     
                   WHEN ( 'STATUS  ' )                                          
                     W02_MER_DATA          =    '0'B;                           
                   WHEN ( 'TRANHIST' )                                          
                     W02_MER_DATA          =    '0'B;                           
                   OTHERWISE;                                                   
                                                                                
                 END;                                                           
              END;                                                              
                                                                                
            WHEN ( 'GE' , 'GB' )                                                
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L340:                                                                          
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '340';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L350:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '350';                                
        END;                                                                    
    END LESER_UNDER_STATUS_GNP;                                                 
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DANNE_UNDER_STATUS_ISRT:                                                    
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_6,                 
                                                 W02_ISRT,                      
                                                 PCB2,                          
                                                 W01_IO,                        
                                                 SSA2_RF0PERSN,                 
                                                 SSA4_STATUS,                   
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB2.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_ISRT_OK                  =    '1'B;                           
            WHEN ( 'II' )                                                       
              W02_ISRT_OK                  =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L360:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB2.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '360';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L370:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB2.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '370';                                
        END;                                                                    
    END DANNE_UNDER_STATUS_ISRT;                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE TRANH  SEGM ( GNP    KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_TRANHIST_GNP:                                                         
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 PCB1,                          
                                                 W01_IO,                        
                                                 SSA3_TRANHIST_F);              
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB1.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L380:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB1.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '380';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L390:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB1.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '390';                                
                                                                                
        END;                                                                    
                                                                                
    END LESER_TRANHIST_GNP;                                                     
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DANNE_ROT_SEGM_ISRT:                                                        
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_ISRT,                      
                                                 PCB2,                          
                                                 W01_IO,                        
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB2.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_ISRT_OK                  =    '1'B;                           
            WHEN ( 'II' )                                                       
              W02_ISRT_OK                  =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L400:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB2.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '400';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L410:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB2.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '410';                                
        END;                                                                    
    END DANNE_ROT_SEGM_ISRT;                                                    
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR  Å LESE NESTE SEGMENT ( GNP   UKVALIFISERT  )    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_TRANH_TILKN_GHNP:                                                     
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_GHNP,                      
                                                 PCB3,                          
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' , 'GA' , 'GK' )                                         
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' , 'GB' )                                                
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L420:                                                                          
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '420';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L430:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '430';                                
        END;                                                                    
    END LESER_TRANH_TILKN_GHNP;                                                 
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LEGGE INN SEGMENT ( ISRT   UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DANNER_TRANH_TILKN_REPL:                                                    
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_REPL,                      
                                                 PCB3,                          
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_REPL_OK                  =    '1'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L440:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '440';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L450:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '450';                                
        END;                                                                    
    END DANNER_TRANH_TILKN_REPL;                                                
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT SEGMENT ( GU     KVALIFISERT  )         */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_ROT_SEGM_TRANH_GU:                                                    
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GU,                        
                                                 PCB3,                          
                                                 W01_IO,                        
                                                 SSA3_RF0PERSN);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L460:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '460';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L470:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '470';                                
        END;                                                                    
    END LESER_ROT_SEGM_TRANH_GU;                                                
                                                                                
                                                                                
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å DANNE BARN UNDER TRANHIST                      */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DANNER_TRANH_BARN_ISRT:                                                     
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_6,                 
                                                 W02_ISRT,                      
                                                 PCB3,                          
                                                 W01_IO,                        
                                                 SSA3_RF0PERSN,                 
                                                 SSA5_TRANHIST,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_ISRT_OK                  =    '1'B;                           
            WHEN ( 'II' )                                                       
              W02_ISRT_OK                  =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L480:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '480';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L490:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '490';                                
        END;                                                                    
    END DANNER_TRANH_BARN_ISRT;                                                 
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LESE TRANH  SEGM ( GHNP   KVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    LESER_TRANHIST_F_GHNP:                                                      
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GHNP,                      
                                                 PCB3,                          
                                                 W01_IO,                        
                                                 SSA3_TRANHIST_F);              
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( PCB3.STATUS_KODE );                                          
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' )                                                       
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
 L492:                                                                          
                                                                                
                                                                                
                DB_STATUS_KODE             =    PCB3.STATUS_KODE;               
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '492';                          
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
 L493:                                                                          
                                                                                
          DB_STATUS_KODE             =    PCB3.STATUS_KODE;                     
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '493';                                
                                                                                
        END;                                                                    
                                                                                
    END LESER_TRANHIST_F_GHNP;                                                  
                                                                                
                                                                                
  SKRIV_FEILMELDING:                                                            
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    GIR UT FEILMELDING.                                           */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SJELL_FEILMELDING;                                       */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
     FNR_PIC      =    FNRREC.FRANR                                ;            
     FEIL_MELDING = '  RESTART FNR ER :    ' !! FNR_CHAR           ;            
      CALL SKRIV_FNRFEIL;                                                       
                                                                                
     FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!                   
                            ' GÅR I FEIL VED LABEL NR. '           !!           
                                     DIV_PARAM_OMR.FEIL_VED_LABEL;              
     CALL SKRIV_FNRFEIL;                                                        
                                                                                
     IF FEIL_MELD_NR          =     500              THEN                       
        DO;                                                                     
                                                                                
           /* *************************************************** */            
           /*        DATA-BASE FEIL . RETUR_KODEN LEGGES UT .     */            
           /* *************************************************** */            
                                                                                
           FEIL_MELDING        =  '  RETUR_KODE   =  '                          
                                    !! DIV_PARAM_OMR.DB_STATUS_KODE ;           
           CALL SKRIV_FNRFEIL;                                                  
                                                                                
        END;                                                                    
                                                                                
     ELSE                                                                       
        IF FEIL_MELD_NR      =     499              THEN                        
           DO;                                                                  
                                                                                
            /* *************************************************** */           
            /*        PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS */           
            /* *************************************************** */           
                                                                                
                                                                                
              FNR_PIC             =  DIV_PARAM_OMR.SEARCH_FNR  ;                
              FEIL_MELDING        =  '  FNR  =  ' !!  FNR_CHAR ;                
              CALL SKRIV_FNRFEIL;                                               
                                                                                
           END;                                                                 
                                                                                
             FEIL_MELDING   = 'TASKEN BLIR KANSELERT !!!!     ' !!              
                               'INGEN OPPDATERING ER BLITT UTFØRT. ';           
     CALL SKRIV_FNRFEIL;                                                        
                                                                                
                                                                                
     CALL SKRIV_UT_TELLERE;                                                     
                                                                                
                                                                                
                                                                                
                                                                                
     /******** NB!      NB! TASKEN BLIR KANSELERT  ********/                    
                                                                                
     EXEC CICS ABEND                                                            
                 ABCODE(STOP);                                                  
                                                                                
  END SKRIV_FEILMELDING;                                                        
                                                                                
                                                                                
  /* **************************************************************** */        
  /*                                                                  */        
  /*    SKRIVER UT TELLERNE PÅ SKJERM OG PÅ PRINTER .                 */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
  SKRIV_UT_TELLERE:                                                             
     PROC;                                                                      
                                                                                
                                                                                
       /* ****************************************** */                         
       /*  HVIS PRINT_TELLER = 0 MELDING TIL SKJERM  */                         
       /*  HVIS PRINT_TELLER = 1 MELDING TIL PRINTER */                         
       /* ****************************************** */                         
                                                                                
                                                                                
       FEIL_MELDING =   ANT_LEST_CHAR !! ' ENDRINGSRECORDS LEST';               
                                                                                
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_ENDR_CHAR !! ' FØDSELSNUMMER ENDRET';                 
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_OMR_4001_CHAR !! ' OMREGNINGER I R0014001';           
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_OMR_4901_CHAR !! ' OMREGNINGER I R0014901';           
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
                                                                                
       FEIL_MELDING = ANT_STAT_CHAR !! ' FNR-ENDR. TIL STAT.BASEN';             
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_CALL_OMR_CHAR !! ' ANTALL CALL OMREGN';               
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_CALL_MAN_CHAR !! ' ANTALL CALL MANUELL';              
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_CALL_DØD_CHAR !! ' ANTALL CALL DØD';                  
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
       FEIL_MELDING = ANT_UFØRH_CHAR !! ' ANTALL ENDR PÅ UFØRHIST';             
       CALL  SKRIV_FNRFEIL;                                                     
                                                                                
                                                                                
  END SKRIV_UT_TELLERE;                                                         
                                                                                
  SKRIV_FNRFEIL: PROC;                                                          
                                                                                
     EXEC CICS WRITE DATASET ('FNRFEIL')                                        
          FROM (FEIL_MELD) RIDFLD(FEIL_RBA) RBA;                                
                                                                                
  END SKRIV_FNRFEIL;                                                            
                                                                                
  %INCLUDE R0019995;                                             /*Y2K*/        
  %INCLUDE R0019993;                  /* DATO_8BYTE                Y2K*/        
                                                                                
 %PAGE;                                                                         
      %INCLUDE R0019912;               /* KONVERTERING CHAR ==> PIC /           
                                          PIC ==> CHAR              */          
      %INCLUDE R0019944;               /* SKRIV_FEIL      */                    
                                                                                
   END R0019E;                                                                  
