 /*       SIST ENDRET 04/05-98 14.17.14 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/12-97 13.04.47 AV   SPA7339                  */00000010
 /* ***************************************************************** */00000020
 /*                                                                   */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R0010470 - UTSKRIFT VED SPLITTING - HOVEDPROGRAM */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  : ROLF FARVIK                                      */00000090
 /*  PROGRAMMET BLE LAGET : MARS 1983                                 */00000100
 /*                                                                   */00000110
 /* ***************************************************************** */00000120
 /*HENSIKT:                                                           */00000130
 /* **********                                                        */00000140
 /*  PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETT-MAPENE    */00000150
 /*  DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT PÅ        */00000160
 /*  FORHÅND.                                                         */00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*PROGRAMTILKNYTTING:                                                */00000200
 /* ********************                                              */00000210
 /*  PROGRAMMET BLIR AKTIVISERT VIA CICS FRA R0013001(BEHANDLE-TRANS) */00000220
 /*  OG FRA R0010480(VENTETRANSBEHANDLING) SLIK:                      */00000230
 /*    EXEC CICS XCTL PROGRAM ('R0010470') COMMAREA(KOM_OMR);         */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*PROGRAMMET LINKER A470, B470 OG C470 FOR BEHANDLING AV DE          */00000270
 /*           FORSKJELLIGE BLANKETTER                                 */00000280
 /* ***************************************************************** */00000290
                                                                        00000300
 R001047: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000310
 %PAGE;                                                                 00000320
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                    00000330
 %PAGE;                                                                 00000340
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000350
 %PAGE;                                                                 00000360
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                    00000370
 %PAGE;                                                                 00000380
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                    00000390
 %PAGE;                                                                 00000400
                                                                        00000410
                                                                        00000420
 DCL                                                                    00000430
    QUENAME                CHAR(8),                                     00000440
       QTERMID             CHAR(4) DEF QUENAME POS(1),                  00000450
       REST                CHAR(4) DEF QUENAME POS(5);                  00000460
                                                                        00000470
 DCL                                                                    00000480
    1 ROUTELIST,                                                        00000490
      2 PRINTER,                                                        00000500
        3 TERMID           CHAR(4),                                     00000510
        3 REST             CHAR(12),                                    00000520
      2 SISTE,                                                          00000530
        3 SLUTT            FIXED BIN(15),                               00000540
        3 REST             CHAR(14);                                    00000550
                                                                        00000560
 DCL                                                                    00000570
    CSTG                   BUILTIN,                                     00000580
    COMMAREA_PEKER         PTR,                                         00000590
    BMSMAPBR               PTR,                                         00000600
    I                      FIXED BIN(15),                               00000620
    START                  FIXED BIN(15) INIT(1),                       00000630
    LENGTH                 FIXED BIN(15),                               00000640
    LABEL_Y                LABEL,                                       00000650
    MELDING                CHAR(10) INIT('NOE ER GALT'),                00000660
    LOW_CHAR_BASED         CHAR(1000) BASED(BMSMAPBR),                  00000670
    ADDR                   BUILTIN;                                     00000680
                                                                        00000690
 /*----------------------------------------------------------------*/   00000700
 /* DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE                    */   00000710
 /*----------------------------------------------------------------*/   00000720
                                                                        00000730
 DCL                                                                    00000740
    CURSOR_POS     FIXED BIN  (15)   INIT (-1),                         00000750
    DFHBMUNP             CHAR (1)    INIT (' '),                        00000760
    DFHBMBRY             CHAR (1)    INIT ('H'),                        00000770
    DFHBMASK             CHAR (1)    INIT ('8'),/* H.INT + ASKIP  */    00000780
    FEIL_FUNNET          BIT  (1)    INIT ('1'B),                       00000790
    FORKASTES            BIT  (1)    INIT ('0'B),                       00000800
       W01_FAR_BEHANDLES BIT  (1)    INIT ('0'B),                       00000810
       W01_MOR_BEHANDLES BIT  (1)    INIT ('0'B),                       00000820
    MELDING6O            CHAR (78),                                     00000830
    YMELDING6O           CHAR (78);                                     00000840
                                                                        00000850
                                                                        00000860
         DCL  W01_YSKADE      BIT(1)         INIT  ('0'B);              00000870
         DCL  W01_NORSK_BOSATT     BIT(1)         INIT  ('0'B);         00000880
         DCL  W01_SIDE_ANTALL FIXED BIN(15)  INIT  ( 1  );              00000890
    QTERMID        = EIBTRMID;                                          00000900
    REST           = 'COMA';                                            00000910
    ROUTELIST      = '';                                                00000920
    PRINTER.TERMID = 'R41J';                                            00000930
    SISTE.SLUTT    = -1;                                                00000940
                                                                        00000950
                                                                        00000960
                                                                        00000970
                                                                        00000980
    SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                                 00000990
       WHEN('AP','UP','US','EP','EF','FB','BP','FT','AF','UF',          00001000
            'E1','E2','O1','O2')                                        00001010
         EXEC CICS LINK PROGRAM('R001A470') COMMAREA ( KOM_OMR);        00001020
                                                                        00001030
       WHEN('A1','U2','E3','E4','B6','F7')                              00001040
         EXEC CICS LINK PROGRAM('R001B470') COMMAREA ( KOM_OMR);        00001050
                                                                        00001060
       WHEN('U3','FO','EN', 'EE','KF')                                  00001070
                                                                        00001080
         EXEC CICS LINK PROGRAM('R001C470') COMMAREA ( KOM_OMR);        00001090
                                                                        00001100
           OTHERWISE;                                                   00001110
        END;       /*   SELECT     */                                   00001120
                                                                        00001130
                                                                        00001140
    EXEC CICS RETURN;                                                   00001150
                                                                        00001160
                                                                        00001170
                                                                        00001180
 END R001047;                                                           00001190
