 /*       SIST ENDRET 02/09-98 10.17.50 AV   SPA7339                  */00000000
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001IA03 - SUBPROGRAM - BLANKER ARBEIDSOMRÅDE OO */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : PATAHK                                           */        
 /*  PROGRAMMET BLE LAGET : FEB 1994                                  */        
 /*  ENDRINGERSDATO : 04.06.1998.                                     */        
 /*  ENDRINGEN GJELDER: ÅR2000 - O.GØYTIL.                            */        
 /*                                                                   */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  BLANKER OO_TRANS_OMR.                                            */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /* ***************************************************************** */        
 /* ÅR2000 - O.GØYTIL - 04.06.1998  */                                  00000010
 /*        - DATO_2000 LÅ INNE      */                                  00000020
 /*                                                                 */  00000020
 /*  PROGRAM NAME  :  R001IA03                                      */  00000020
 /*                                 */                                  00000020
 /*        - DATO_2000 LÅ INNE      */                                  00000020
 KONTROLL_OO_SØKER:                                                     00000030
   PROC (FEIL_FUNNET);                                                  00000040
   DCL                                                                  00000050
      FEIL_FUNNET     BIT (1);                                          00000060
                                                                        00000070
   DCL    W_FNR                                   PIC'(11)9';           00000080
   DCL  1 FNR DEF W_FNR,                                                00000090
          2 DAG                                   PIC'(2)9',            00000100
          2 MND                                   PIC'(2)9',            00000110
          2 AAR                                   PIC'(2)9',            00000120
          2 ÅRHUNDRE                              PIC'9',               00000130
          2 REST                                  PIC'(4)9';            00000140
   DCL                                                                  00000150
      DATO_2000       BUILTIN;                                          00000160
 /*  HJELPE DCL FOR Å SNU DATO           */                             00000170
                                                                        00000180
                                                                        00000190
                                                                        00000200
   DCL                                                                  00000210
      (FEIL19,                                                          00000220
      FEIL20,                                                           00000230
      FEIL21,                                                           00000240
      FEIL22) BIT (1);                                                  00000250
                                                                        00000260
                                                                        00000270
   DCL                                                                  00000280
      ANT_BARN          FIXED BIN(15),                                  00000290
      TELL_BARN         FIXED BIN(15),                                  00000300
      TELL              FIXED BIN(15);                                  00000310
                                                                        00000320
                                                                        00000330
   DCL                                                                  00000340
      1 FNR_REG,                                                        00000350
        2 FNR1      FIXED DEC(11),                                      00000360
        2 FNR2      FIXED DEC(11),                                      00000370
        2 BRUKERID  CHAR     ( 4);                                      00000380
                                                                        00000390
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                         00000400
                                                                        00000410
                                                                        00000420
      FEIL19 = '0'B;                                                    00000430
      FEIL20 = '0'B;                                                    00000440
      FEIL21 = '0'B;                                                    00000450
      FEIL22 = '0'B;                                                    00000460
      FEIL_FUNNET = '0'B;                                               00000470
                                                                        00000480
                                                                        00000490
       IF ^F_GYLDIG_FNR(OOS.FRA_FNR) THEN                               00000500
          DO;                                                           00000510
             FEIL_FUNNET = '1'B;                                        00000520
             OOS.FRA_FNRNR = 1;                                         00000530
          END;                                                          00000540
    ELSE                                                                00000550
          DO;                                                           00000560
             FNR_REG.FNR1 = OOS.FRA_FNR;                                00000570
             W_FNR    = OOS.FRA_FNR;                                    00000580
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00000590
             IF FNR_REG.FNR2 > 0 THEN                                   00000600
                DO;                                                     00000610
                   OOS.FRA_FNRNR = 203;                                 00000620
                   OOS.FRA_FNR_GML = OOS.FRA_FNR;                       00000630
                   OOS.FRA_FNR = FNR_REG.FNR2;                          00000640
                END;                                                    00000650
          END;                                                          00000660
                                                                        00000670
       IF ^F_GYLDIG_FNR(OOS.TIL_FNR) THEN                               00000680
          DO;                                                           00000690
             FEIL_FUNNET = '1'B;                                        00000700
             OOS.TIL_FNRNR = 1;                                         00000710
          END;                                                          00000720
       ELSE                                                             00000730
          DO;                                                           00000740
             FNR_REG.FNR1 = OOS.TIL_FNR;                                00000750
             W_FNR    = OOS.TIL_FNR;                                    00000760
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);      00000770
             IF FNR_REG.FNR2 > 0 THEN                                   00000780
                DO;                                                     00000790
                   OOS.TIL_FNRNR = 203;                                 00000800
                   OOS.TIL_FNR_GML = OOS.TIL_FNR;                       00000810
                   OOS.TIL_FNR = FNR_REG.FNR2;                          00000820
                END;                                                    00000830
          END;                                                          00000840
                                                                        00000850
    IF OOS.START_ÅR  <  '1992'    THEN                                  00000860
       DO;                                                              00000870
          FEIL_FUNNET = '1'B;                                           00000880
          OOS.START_ÅRNR    = 140;                                      00000890
       END;                                                             00000900
                                                                        00000910
    IF OOS.BARN_ANTTAL > 12     THEN                                    00000920
       DO;                                                              00000930
          FEIL_FUNNET = '1'B;                                           00000940
          OOS.BARN_ANTTALNR = 214;                                      00000950
       END;                                                             00000960
                                                                        00000970
 /* ***************************************************************** */00000980
 /*                                                                   */00000990
 /*    KONTROLL AV OO_BARN.                                           */00001000
 /*                                                                   */00001010
 /* ***************************************************************** */00001020
 %SKIP(2);                                                              00001030
      TELL_BARN = 0;                                                    00001040
                                                                        00001050
                                                                        00001060
  DO K = 1 TO 12;                                                       00001070
     IF OOB.FNR_BARN(K) >   0   THEN                                    00001080
        TELL_BARN = TELL_BARN + 1;                                      00001090
  END;                                                                  00001100
                                                                        00001110
  IF OOS.BARN_ANTTAL ^= TELL_BARN     THEN                              00001120
     DO;                                                                00001130
         FEIL_FUNNET = '1'B;                                            00001140
         OOS.BARN_ANTTALNR = 282;                                       00001150
     END;                                                               00001160
                                                                        00001170
  DO K = 1 TO 12 WHILE( OOB.FNR_BARN(K) > 0);                           00001180
     IF ^ F_GYLDIG_FNR(OOB.FNR_BARN(K)) THEN                            00001190
          DO;                                                           00001200
         IF ^FEIL20 THEN                                                00001210
             DO;                                                        00001220
                FEIL20 = '1'B;                                          00001230
                OOB.FNR_BARNNR(K) = 20;                                 00001240
             END;                                                       00001250
          ELSE                                                          00001260
                OOB.FNR_BARNNR(K) = 999;                                00001270
       END;                                                             00001280
     ELSE                                                               00001290
     IF OOB.FNR_BARN(K) =          OOS.FRA_FNR  THEN                    00001300
        DO;                                                             00001310
          FEIL_FUNNET = '1'B;                                           00001320
          OOB.FNR_BARNNR(K) = 165;                                      00001330
        END;                                                            00001340
     ELSE                                                               00001350
     IF OOB.FNR_BARN(K)         =  OOS.TIL_FNR  THEN                    00001360
        DO;                                                             00001370
           FEIL_FUNNET = '1'B;                                          00001380
           OOB.FNR_BARNNR(K) = 165;                                     00001390
         END;                                                           00001400
                                                                        00001410
                                                                        00001420
  END;                                                                  00001430
                                                                        00001440
      FEIL_FUNNET = FEIL_FUNNET ! FEIL21 ! FEIL22 ! FEIL19 ! FEIL20;    00001450
                                                                        00001460
   END KONTROLL_OO_SØKER;                                               00001470
                                                                        00001480
