 /*       SIST ENDRET 09/06-98 08.32.09 AV   SPA7339                  */00000000
 /*       SIST ENDRET 26/05-98 09.37.29 AV   RFA9991                  */00000010
 /* ***************************************************************** */00000020
 /*               R 0 0 1 0 6 0 4                                     */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R0010604 - BLANKER ARBEIDS-                      */00000070
 /*                             OMRÅDE UP_BARN  - SUBPROGRAM          */00000080
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000090
 /*  PROGRAMMERER  : INGER SLOTTE                                     */00000100
 /*  PROGRAMMET BLE LAGET : MAI  1981                                 */00000110
 /*  ENDRINGERSDATO :                                                 */00000120
 /*  ENDRINGEN GJELDER:                                               */00000130
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 /*  ENDRINGERSDATO :          220487                                 */00000170
 /*  ENDRINGEN GJELDER:        PROSEDYREN OVERFØR_UP_BARN ER SKILT UT */00000180
 /*                            OG LAGT I R0010610                     */00000190
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000200
 /*                                                                   */00000210
 /* ***************************************************************** */00000220
 /*HENSIKT:                                                           */00000230
 /* **********                                                        */00000240
 /*  BRUKES VED REGISTRERING AV GRUNNBLANKETT_UP.                     */00000250
 /*  KONTROLLERER OPPLYSNINGER OM FORSØRGET BARN.                     */00000260
 /*  PROSEDYREN KONTROLL_UP_BARN MÅ CALLES MED PARAMETER              */00000270
 /*  (FEIL_FUNNET). VED FEIL RETURNERES '1'B, ELLERS '0'B.            */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 /*PROGRAMTILKNYTTING:                                                */00000310
 /* ********************                                              */00000320
 /*  PROGRAMMET INCLUDES AV R0010601 - KONTROLL_GRUNNBLANKETT_UP      */00000330
 /*  ARBEIDSOMRÅDET P0010601 ER INCLUDET I HOVEDPROG.                 */00000340
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000350
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000360
 /*    R0019904 - F_GYLDIG_FNR                                        */00000370
 /*    R0019905 - F_ALDER                                             */00000380
 /*    R0019910 - F_NUMERISK                                          */00000390
 /*    R0019912 - F_FELT_PIC_CHARNN  OG F_FELT_CHAR_PICNN             */00000400
 /*                                                                   */00000410
 /*  INTERNE PROSEDYRER :                                             */00000420
 /*    KONTROLL_UP_BARN  - BLANKETTKONTROLL                           */00000430
 /*                                                                   */00000440
 /*                                                                   */00000450
 /* ***************************************************************** */00000460
 /*DATASETTOPPLYSNINGER:                                              */00000470
 /* ***********************                                           */00000480
 /*   INGEN                                                           */00000490
 /* ***************************************************************** */00000500
 /*FEILMELDINGER:                                                     */00000510
 /* *******************                                               */00000520
 /*   MELDINGER LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM             */00000530
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000540
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000550
 /*                                                                   */00000560
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000570
 /* ******                                                            */00000580
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000590
 /*    OM FNR ER ENDRET (R0019906).                                   */00000600
 /*                                                                   */00000610
 /* ***************************************************************** */00000620
 %PAGE;                                /*  */                           00000630
 /* ***************************************************************** */00000640
 /*                                                                   */00000650
 /*    KONTROLL AV UP_BARN.                                           */00000660
 /*                                                                   */00000670
 /* ***************************************************************** */00000680
 %SKIP(2);                                                              00000690
 KONTROLL_UP_BARN:                                                      00000700
   PROC (FEIL_FUNNET);                                                  00000710
 %SKIP;                                                                 00000720
   DCL                                                                  00000730
      FEIL_FUNNET BIT (1);                                              00000740
   DCL                                                                  00000750
      (FEIL19,                                                          00000760
      FEIL20,                                                           00000770
      FEIL21,                                                           00000780
      FEIL22) BIT (1);                                                  00000790
      FEIL19 = '0'B;                                                    00000800
      FEIL20 = '0'B;                                                    00000810
      FEIL21 = '0'B;                                                    00000820
      FEIL22 = '0'B;                                                    00000830
      FEIL_FUNNET = '0'B;                                               00000840
   DCL                                                                  00000850
      ANT_BARN FIXED BIN(15),                                           00000860
      TELL_BARN FIXED BIN(15),                                          00000870
      TELL FIXED BIN(15),                                               00000880
                                                                        00000890
      1 FNR_REG,                                                        00000900
        2 FNR1         FIXED DEC(11),                                   00000910
        2 FNR2         FIXED DEC(11),                                   00000920
        2 BRUKERID     CHAR     ( 4);                                   00000930
   DCL                                                                  00000940
      ALDER FIXED DEC (5);                                              00000950
      TELL_BARN = 0;                                                    00000960
                                                                        00000970
      FNR_REG.BRUKERID =          DIV_PARAM_OMR.CICS_IND;               00000980
                                                                        00000990
      DO ANT_BARN = 1 TO 12;                                            00001000
                                                                        00001010
       IF F_FELT_PIC_CHAR11(UPB.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN     00001020
        DO;                                                             00001030
         IF ^F_NUMERISK(F_FELT_PIC_CHAR11(UPB.FNR_BARN(ANT_BARN)))      00001040
         THEN                                                           00001050
            DO;                                                         00001060
               IF ^FEIL19 THEN                                          00001070
                  DO;                                                   00001080
                     FEIL19 = '1'B;                                     00001090
                     UPB.FNR_BARNNR(ANT_BARN) = 200;                    00001100
                  END;                                                  00001110
               ELSE                                                     00001120
                  UPB.FNR_BARNNR(ANT_BARN) = 200;                       00001130
            END;                                                        00001140
         ELSE                                                           00001150
         IF ^ F_GYLDIG_FNR(UPB.FNR_BARN(ANT_BARN)) THEN                 00001160
            DO;                                                         00001170
               IF ^FEIL20 THEN                                          00001180
                  DO;                                                   00001190
                     FEIL20 = '1'B;                                     00001200
                     UPB.FNR_BARNNR(ANT_BARN) = 20;                     00001210
                  END;                                                  00001220
               ELSE                                                     00001230
                  UPB.FNR_BARNNR(ANT_BARN) = 999;                       00001240
            END;                                                        00001250
         ELSE                                                           00001260
            DO;                                                         00001270
               FNR_REG.FNR1 = UPB.FNR_BARN(ANT_BARN);                   00001280
               EXEC CICS LINK PROGRAM('R0019906')                       00001290
               COMMAREA(FNR_REG);                                       00001300
               IF FNR_REG.FNR2 > 0 THEN                                 00001310
                  DO;                                                   00001320
                    UPB.FNR_BARNNR(ANT_BARN) = 203;                     00001330
                    UPB.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;              00001340
                    UPB.FNR_GML_BARN(ANT_BARN) = FNR_REG.FNR1;          00001350
                  END;                                                  00001360
               ALDER =                                                  00001370
               F_ALDER(UPB.FNR_BARN(ANT_BARN),UPS.VIRK_DATO_ÅMD);       00001380
               IF ALDER > 1800 THEN                                     00001390
                  DO;                                                   00001400
                     IF ^FEIL21 THEN                                    00001410
                        DO;                                             00001420
                           FEIL21 = '1'B;                               00001430
                           UPB.FNR_BARNNR(ANT_BARN) = 21;               00001440
                        END;                                            00001450
                     ELSE                                               00001460
                        UPB.FNR_BARNNR(ANT_BARN) = 999;                 00001470
                  END;                                                  00001480
               ELSE                                                     00001490
                  IF ALDER < 0 THEN                                     00001500
                     DO;                                                00001510
                        IF ^FEIL22 THEN                                 00001520
                           DO;                                          00001530
                              FEIL22 = '1'B;                            00001540
                              UPB.FNR_BARNNR( ANT_BARN) = 22;           00001550
                           END;                                         00001560
                        ELSE                                            00001570
                           UPB.FNR_BARNNR( ANT_BARN) = 999;             00001580
                     END;                                               00001590
                                                                        00001600
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00001610
                                                                        00001620
               ELSE                                                     00001630
                  IF UPS.VIRK_DATO_ÅMD > 19901200 &                     00001640
                     ALDER < 1 THEN                 /* 2000-3 */        00001650
                     DO;                                                00001660
                        IF ^FEIL22 THEN                                 00001670
                           DO;                                          00001680
                              FEIL22 = '1'B;                            00001690
                              UPB.FNR_BARNNR( ANT_BARN) = 22;           00001700
                           END;                                         00001710
                        ELSE                                            00001720
                           UPB.FNR_BARNNR( ANT_BARN) = 999;             00001730
                     END;                                               00001740
                IF F_FELT_PIC_CHAR11(UPB.FNR_BARN(ANT_BARN)) =          00001750
                F_FELT_PIC_CHAR11(UPS.FNR) THEN                         00001760
                  DO;                                                   00001770
                    FEIL_FUNNET = '1'B;                                 00001780
                    UPB.FNR_BARNNR(ANT_BARN) = 165;                     00001790
                  END;                                                  00001800
                ELSE                                                    00001810
                IF F_FELT_PIC_CHAR11(UPB.FNR_BARN(ANT_BARN)) =          00001820
                F_FELT_PIC_CHAR11(UPS.FNR_EK) THEN                      00001830
                  DO;                                                   00001840
                    FEIL_FUNNET = '1'B;                                 00001850
                    UPB.FNR_BARNNR(ANT_BARN) = 165;                     00001860
                  END;                                                  00001870
              END;                                                      00001880
            IF UPB.RBT_BARN(ANT_BARN) = 'J' THEN                        00001890
              DO;                                                       00001900
                 IF UPS.VIRK_DATO_ÅMD < 19840700 THEN                   00001910
                    DO;                              /* 2000-3*/        00001920
                       FEIL_FUNNET = '1'B;                              00001930
                       UPS.VIRK_DATO_ÅMDNR = 276;                       00001940
                    END;                                                00001950
              END;                                                      00001960
            ELSE                                                        00001970
               IF UPB.RBT_BARN(ANT_BARN) ^= ' ' THEN                    00001980
                  DO;                                                   00001990
                     FEIL_FUNNET = '1'B;                                00002000
                     UPB.RBT_BARNNR(ANT_BARN) = 271;                    00002010
                  END;                                                  00002020
             TELL_BARN = TELL_BARN + 1;                                 00002030
            END;                                                        00002040
         ELSE                                                           00002050
            LEAVE;                                                      00002060
      END;                                                              00002070
      IF ^FEIL_FUNNET THEN                                              00002080
        IF UPS.BT_ANT ^= TELL_BARN THEN                                 00002090
           DO;                                                          00002100
              FEIL_FUNNET = '1'B;                                       00002110
              UPS.BT_ANTNR = 23;                                        00002120
           END;                                                         00002130
                                                                        00002140
      FEIL_FUNNET = FEIL_FUNNET ! FEIL21 ! FEIL22 ! FEIL19 ! FEIL20;    00002150
                                                                        00002160
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00002170
      IF ^FEIL_FUNNET  THEN                                             00002180
        IF UPS.BT_ANT > 0 THEN                                          00002190
           DO ANT_BARN = 1 TO 12 WHILE(UPB.FNR_BARN(ANT_BARN) > 0);     00002200
              DO TELL = ANT_BARN TO 12 WHILE(UPB.FNR_BARN(TELL) > 0);   00002210
                 IF TELL ^= ANT_BARN THEN                               00002220
                    IF UPB.FNR_BARN(TELL) = UPB.FNR_BARN(ANT_BARN) THEN 00002230
                       DO;                                              00002240
                          FEIL_FUNNET = '1'B;                           00002250
                          UPB.FNR_BARNNR(ANT_BARN) = 124;               00002260
                          UPB.FNR_BARNNR(TELL) = 999;                   00002270
                       END;                                             00002280
              END;                                                      00002290
           END;                                                         00002300
                                                                        00002310
  /*  HER GÅR EN INN I TABELLEN OG SETTER NULL I ALLE FNR ETTER DET     00002320
      FØRSTE SOM ER NULL */                                             00002330
                                                                        00002340
      DO ANT_BARN = 1 TO 12 UNTIL(F_FELT_PIC_CHAR11                     00002350
      (UPB.FNR_BARN(ANT_BARN)) = (11)'0');                              00002360
        IF F_FELT_PIC_CHAR11(UPB.FNR_BARN(ANT_BARN)) = (11)'0' THEN     00002370
           DO TELL = ANT_BARN TO 12;                                    00002380
              UPB.FNR_BARN(TELL) = 0;                                   00002390
              UPB.RBT_BARN(TELL) = ' ';                                 00002400
           END;                                                         00002410
      END;                                                              00002420
   END KONTROLL_UP_BARN;                                                00002430
