 /*   SIST ENDRET PÅ PROD   2005.06.08 13.18.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.01.43 AV   JDA2970          */        
 /*       SIST ENDRET 20/05-99 10.54.44 AV   JDA7339                  */        
 /*       SIST ENDRET 20/05-99 10.53.50 AV   JDA7339                  */        
 /*       SIST ENDRET 30/07-98 09.25.33 AV   JDA7339                  */        
 /*       SIST ENDRET 06/07-98 14.23.01 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*     R0019937 - PROSEDYRE I PLI                                    */        
 /*     PROGRAMMERER: JAN, MARS 1982                                  */        
 /* HENSIKT:                                                          */        
 /*     DENNE RUTINEN OPPHØRER ALDERSPENSJON.                         */        
 /*     DERSOM SØKER HAR EKTEFELLE SKJER FØLGENDE:                    */        
 /*     A) EKTEFELLEN HAR EN OPPHØRT UFØREPENSJON/AP/AFP              */        
 /*          (STATUS_KODE_HIST = X)                                   */        
 /*      SøKERS STATUS SLETTES                                        */        
 /*      EKTEFELLEN FÅR PENSJONSTYPE1 = U OG PT2 = ' '                */        
 /*     B) EKTEFELLEN HAR IKKE PENSJON, OG HELLER IKKE UFØREHISTORIKK */        
 /*      SØKERS OG EKTEFELLENS STATUS SLETTES.                        */        
 /*     C) EKTEFELLEN HAR EGEN PENSJON:                               */        
 /*      SØKER BEHOLDER STATUS SEGMENT MED NYE PENSJONSKODER,         */        
 /*      EKTEFELLEN FÅR NY PENSJONSKODE2 OG NY TILKNYTNINGSKODE.      */        
 /*     DERSOM SØKER IKKE HAR EKTEFELLE:                              */        
 /*      SØKERS STATUS SLETTES.                                       */        
 /*     DERSOM SøKER FORSØRGER BARN BLIR OGSÅ DISSE SLETTET           */        
 /*      FRA STATUS.                                                  */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*      KALLES OPP AV PROGRAM R0011720.                              */        
 /* BRUK:                                                             */        
 /*      ALDERSPENSJON_OPPHØRER                                       */        
 /* ***************************************************************** */        
 %SKIP;                                                                         
 ALDERSPENSJON_OPPHØRER:                                                        
   PROC;                                                                        
 %SKIP;                                                                         
   DCL                                                                          
      I         FIXED BIN(15),                                                  
      J         FIXED BIN(15);                                                  
   DCL SEKSTISJU_ÅMD  FIXED DEC (9);                                            
   DCL W_FNR    PIC '(11)9';                                                    
   DCL W_MN  DEF W_FNR POS(3)   PIC '99';                                       
   DCL W_ÅR  DEF W_FNR POS(5)   PIC '99';                                       
                                                                                
    AVDØD_IND = EKTEF_IND;                                                      
                                                                                
   W_FNR = B02.FNR(SØKER_IND);                                                  
   SEKSTISJU_ÅMD = ((W_ÅR + 1967) * 10000)  + (W_MN * 100);                     
        B02.PENSJONSRETT_FØR_91(SØKER_IND) = ' ';                               
        B02.EK_INNT_OVER_2G (SØKER_IND) = ' ';                                  
     IF B02.PENSJON_FØR_9802(SØKER_IND) ^= 'X' THEN                             
        B02.PENSJON_FØR_9802(SØKER_IND) = ' ';                                  
                                                                                
 /* ***************************************************************** */        
 /* DERSOM SØKEREN FORSØRGER BARN                                     */        
 /* ***************************************************************** */        
                                                                                
         DO I = 1 TO 13 WHILE (B01.FNR_TILKN(SØKER_IND,I) > 0);                 
            IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'   !                
               B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'   !                
               B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W'   THEN             
               DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);                           
                  B02.VIRK_DATO_ÅMD(J)    = HJ_VIRK_DATO_ÅMD;                   
                  B02.STATUS_KODE_HIST(J) = 'O';                                
                  B02.ANTALL_BARN(J)      = 0; /*0599RF*/                       
               END;                                                             
         END;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* DERSOM SØKER ER UGIFT, SKILT ELLER ETTERLATT                      */        
 /* ***************************************************************** */        
                                                                                
       IF B01.SIVILSTAND(SØKER_IND) = 'U' !                                     
          B01.SIVILSTAND(SØKER_IND) = 'E' !                                     
          B01.SIVILSTAND(SØKER_IND) = 'S' THEN                                  
          DO;                                                                   
             B02.VIRK_DATO_ÅMD(SØKER_IND)    = HJ_VIRK_DATO_ÅMD;                
                                                                                
 /* ENDRET 14.2.85  HL : NÅR DET FINNES EN UFØREHISTORIKK, SÅ        */         
 /*                      SKAL STATUS_KODE_HIST VÆRE 'X'              */         
 /*GJELDER OGSÅ AP/AFP-HISTORIKK - RETTET 200206*/                              
                                                                                
             IF B01.UFT_ÅMD(SØKER_IND,1) > 0           !                        
               (B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) > 0    &                  
                B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) <                         
                       SEKSTISJU_ÅMD)                  THEN                     
                DO;                                                             
                  B02.STATUS_KODE_HIST(SØKER_IND) = 'X';                        
                  B02.ANTALL_BARN(SØKER_IND)      = 0;                          
                END;                                                            
             ELSE                                                               
                DO;                                                             
                  B02.STATUS_KODE_HIST(SØKER_IND) = 'O';                        
                  B02.ANTALL_BARN(SØKER_IND)      = 0;                          
                END;                                                            
             TRANSTYPE                             = 55;                        
                                                                                
 /* ***************************************************************** */        
 /* DERSOM SØKER HAR ETTERLATTEPENSJON                                */        
 /* ***************************************************************** */        
                                                                                
             IF B01.PENSJONSTYPE2(SØKER_IND) = 'E' THEN                         
                                                                                
 /* 9934 */     CALL OPPHØR_KOBLING_TO_PERSONER(SØKER_IND,AVDØD_IND);           
                                                                                
 /* ***************************************************************** */        
 /* AVDØDE ER IKKE KNYTTA TIL ANDRE PERSONER,SPESOPPLSEGMENT  FJERNES */        
 /* ***************************************************************** */        
                                                                                
              ELSE                                                              
                  B02.SPESOPPL (AVDØD_IND) = '';                                
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* DERSOM SØKER HAR EKTEFELLE,EKTEFELLEN HAR IKKE EGEN YTELSE        */        
 /* ***************************************************************** */        
                                                                                
             IF B01.PENSJONSTYPE1(EKTEF_IND) = 'G' !                            
                B01.PENSJONSTYPE1(EKTEF_IND) = 'F' THEN                         
                DO;                                                             
                                                                                
 /* ***************************************************************** */        
 /* B02.STATUS OG UNDERLIGGENDE SEGMENTER SLETTES                     */        
 /* ***************************************************************** */        
                                                                                
                   B02.VIRK_DATO_ÅMD(SØKER_IND)    = HJ_VIRK_DATO_ÅMD;          
                                                                                
 /* ENDRET 14.2.85  HL : NÅR DET FINNES EN UFØREHISTORIKK, SÅ        */         
 /*                      SKAL STATUS_KODE_HIST VÆRE 'X'              */         
 /*GJELDER OGSÅ AP/AFP-HISTORIKK - RETTET 200206*/                              
                                                                                
                   IF B01.UFT_ÅMD(SØKER_IND,1) > 0           !                  
                     (B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) > 0    &            
                      B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) <                   
                          SEKSTISJU_ÅMD)                  THEN                  
                      DO;                                                       
                         B02.STATUS_KODE_HIST(SØKER_IND) = 'X';                 
                         B02.ANTALL_BARN(SØKER_IND)      = 0;                   
                      END;                                                      
                   ELSE                                                         
                      DO;                                                       
                         B02.STATUS_KODE_HIST(SØKER_IND) = 'O';                 
                         B02.ANTALL_BARN(SØKER_IND)      = 0;                   
                      END;                                                      
                   B02.VIRK_DATO_ÅMD(EKTEF_IND)    = HJ_VIRK_DATO_ÅMD;          
                                                                                
 /* ENDRET 27.2.85  HL : NÅR DET FINNES EN UFØREHISTORIKK, SÅ        */         
 /*                      SKAL STATUS_KODE_HIST VÆRE 'X' OG PT1 = 'U' */         
 /*                                                   ' OG PT2 = ' ' */         
 /*GJELDER OGSÅ AP/AFP-HISTORIKK - RETTET 200206*/                              
                                                                                
                   W_FNR = B02.FNR(EKTEF_IND);                                  
                   SEKSTISJU_ÅMD = ((W_ÅR + 1967) * 10000)                      
                                               + (W_MN * 100);                  
                   IF B01.UFT_ÅMD(EKTEF_IND,1) > 0           THEN               
                                                                                
                      DO;                                                       
                         B02.STATUS_KODE_HIST(EKTEF_IND) = 'X';                 
                         B02.ANTALL_BARN(EKTEF_IND)      = 0;                   
                         B02.PENSJONSTYPE1(EKTEF_IND) = 'U';                    
                         B02.PENSJONSTYPE2(EKTEF_IND) = ' ';                    
                      END;                                                      
                                                                                
                   ELSE                                                         
                   IF (B01.ALDERSP.UTTAKSDATO_ÅMD(EKTEF_IND) > 0   &            
                       B01.ALDERSP.UTTAKSDATO_ÅMD(EKTEF_IND) <                  
                          SEKSTISJU_ÅMD)                  THEN                  
                                                                                
                      DO;                                                       
                         B02.STATUS_KODE_HIST(EKTEF_IND) = 'X';                 
                         B02.ANTALL_BARN(EKTEF_IND)      = 0;                   
                      END;                                                      
                                                                                
                   ELSE                                                         
                      DO;                                                       
                         B02.STATUS_KODE_HIST(EKTEF_IND) = 'O';                 
                         B02.ANTALL_BARN(EKTEF_IND)      = 0;                   
                      END;                                                      
                   TRANSTYPE                             = 55;                  
                                                                                
 /* 9934 */        CALL OPPHØR_KOBLING_TO_PERSONER(SØKER_IND,EKTEF_IND);        
                                                                                
                END;                                                            
                                                                                
             ELSE                                                               
                DO;                                                             
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR EGEN PENSJON                                       */        
 /* ***************************************************************** */        
                                                                                
                    DO I = 1 TO 13 WHILE                                        
                               (B01.FNR_TILKN(SØKER_IND,I) > 0);                
                IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'L'  !             
                   B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'V'  !             
                   B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) = 'W' THEN           
                                                                                
                       DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);                   
                                                                                
 /* 9934 */              CALL OPPHØR_KOBLING_TO_PERSONER(SØKER_IND,J);          
                                                                                
                         B02.VIRK_DATO_ÅMD(J)     = HJ_VIRK_DATO_ÅMD;           
                         B02.STATUS_KODE_HIST(J)      = 'O';                    
                         B02.ANTALL_BARN(J)           = 0;                      
                       END;                                                     
                    END;                                                        
                    B02.PENSJONSTYPE1(SØKER_IND) = 'G';                         
                    B02.PENSJONSTYPE2(SØKER_IND) = ' ';                         
                    B02.TT_FØR_1967(SØKER_IND)   = 0;                           
                    B02.TT_ETTER_1966(SØKER_IND) = 0;                           
                    B02.TT_ANV(SØKER_IND)        = 0;                           
                    B02.TT_16_66(SØKER_IND)      = 0;                           
                    B02.GAMMEL_SAMMENSTØTS_REGEL(SØKER_IND) = ' ';              
                    B02.TP_GAR_KODE(SØKER_IND)   = ' ';                         
                    B02.SUM_YTELSE(SØKER_IND)    = 0;                           
                                                                                
 /* ***************************************************************** */        
 /* B02.SPESOPPL-SEGMENTET SLETTES                                 */           
 /* ***************************************************************** */        
                                                                                
                    B02.SPESOPPL (SØKER_IND) = '';                              
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLEN HAR PENSJON                                            */        
 /* ***************************************************************** */        
                                                                                
     /*AFP*/        IF B02.PENSJONSTYPE2(EKTEF_IND) ^= 'N' THEN                 
                       B02.PENSJONSTYPE2(EKTEF_IND) = 'P';                      
                                                                                
                    B02.GAMMEL_SAMMENSTØTS_REGEL(EKTEF_IND) = ' ';              
                                                                                
 /* ***************************************************************** */        
 /* FINNER SØKERS FNR I EKTEFELLENS TILKNYTNINGSSEGMENT               */        
 /* ***************************************************************** */        
                                                                                
                    DO I = 1 TO 13 WHILE (                                      
                                       B02.FNR_TILKN(EKTEF_IND,I) > 0);         
                       IF B02.FNR_TILKN(EKTEF_IND,I) =                          
                                              B02.FNR(SØKER_IND) THEN           
                          DO;                                                   
                             B02.TILKN.TILKNYTNINGSKODE(                        
                                                   EKTEF_IND,I) = 'G';          
                             TRANSTYPE    = 36;                                 
                          END;                                                  
                    END;                                                        
              END;                                                              
         END;                                                                   
  END ALDERSPENSJON_OPPHØRER;                                                   
