 /*       SIST ENDRET 20/07-98 13.19.03 AV   SPA7339                  */00000000
 F_DATO_ÅMD_PLUSS1:                                              /*Y2K*/00000010
   PROC(DATO_ÅMD) RETURNS(PIC'(8)9');                                   00000020
 %SKIP(2);                                                              00000030
                                                                                
 /* ***************************************************************** */00000050
 /*                                                                   */00000060
 /* MOTTAR DATO_ÅM OG RETURNERER DATAOEN TILLAGT 1 MÅNED              */00000070
 /*                                                                   */00000080
 /* ENDRET 19980720 MEA9991: RETURNERT DATO Må VÆRE GYLDIG.           */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 %SKIP(2);                                                              00000120
   DCL                                                                  00000130
      DATO_ÅMD                            PIC '(8)9';            /*Y2K*/00000140
   DCL                                                                  00000150
      DATO_ÅMD_PLUSS1                     PIC '(8)9',            /*Y2K*/00000160
      DATO_Å   DEF DATO_ÅMD_PLUSS1 POS(1) PIC '(4)9',            /*Y2K*/00000170
      DATO_M   DEF DATO_ÅMD_PLUSS1 POS(5) PIC '99',              /*Y2K*/00000180
      DATO_D   DEF DATO_ÅMD_PLUSS1 POS(7) PIC '99';         /*19980720*/00000190
 %SKIP(2);                                                              00000200
      DATO_ÅMD_PLUSS1  = DATO_ÅMD;                               /*Y2K*/00000210
      DATO_M           = DATO_M + 1;                                    00000220
      IF DATO_M > 12 THEN                                               00000230
         DO;                                                            00000240
            DATO_Å     = DATO_Å + 1;                                    00000250
            DATO_M     = DATO_M - 12;                                   00000260
         END;                                                           00000270
      IF DATO_M = 2 & DATO_D > 29 THEN                      /*19980720*/00000280
         DATO_D = 29;                                       /*19980720*/00000290
      IF DATO_D > 28 THEN                                   /*19980720*/00000300
         DO;                                                /*19980720*/00000310
            IF ^F_GYLDIG_DATO(DATO_ÅMD_PLUSS1) THEN         /*19980720*/00000320
               DATO_D = DATO_D - 1;                         /*19980720*/00000330
         END;                                               /*19980720*/00000340
      RETURN(DATO_ÅMD_PLUSS1);                                   /*Y2K*/00000350
   END F_DATO_ÅMD_PLUSS1;                                        /*Y2K*/00000360
