 /*   SIST ENDRET PÅ PROD   2003.02.27 12.27.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.14.44 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.34.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 14.34.14 AV   JDA7339          */        
 /*       SIST ENDRET 09/06-98 08.28.55 AV   SPA7339                  */        
 /*       SIST ENDRET 25/05-98 10.43.17 AV   HLA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R001NC03 - PROSEDYRE I PLI                                     */        
 /*    PROGRAMMERER:                                                  */        
 /*HENSIKT:                                                           */        
 /*    PROSEDYREN FORETAR KONTROLL AV DATA FOR F7_SØKER FRA           */        
 /*       GRUNNBLANKETT FORSØRGINGSTILLEGG EKTEFELLE OG/ELLER BARN.   */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLING AV FORSØRGINGS-     */        
 /*       TILLEG EKTEFELLE OG/ELLER BARN.                             */        
 /*    INCLUDES I  R001NC01.                                          */        
 /*BRUK:                                                              */        
 /* CALL KONRTOLL_F7_SØKER(FEIL_I_F7_SØKER);                          */        
 /*                                                                   */        
 /*   MODULEN KONTROLLERER F7_SØKER, OG RETURNERER                    */        
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */        
 /*                                                                   */        
 /* ***************************************************************** */        
 %SKIP(2);                                                                      
 KONTROLL_F7_SØKER:                                                             
   PROC (FEIL_FUNNET);                                                          
   DCL                                                                          
      FEIL_FUNNET BIT (1);                                                      
   DCL DAGENS_DATO_ÅMD    PIC '99999999';        /*2000*/                       
   DCL DAGENS_DATO_ÅM DEF DAGENS_DATO_ÅMD PIC '999999';   /*2000*/              
   DCL                                                                          
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),                     
      KEY_PEKER                  POINTER,                                       
      TK_RECL                    CHAR (101);                                    
   DCL                                                                          
      ALDER FIXED DEC (5),                                                      
      TYPE CHAR(1);                                                             
   DCL                                                                          
      1 FNR_REG,                                                                
        2 FNR1        FIXED DEC(11),                                            
        2 FNR2        FIXED DEC(11),                                            
        2 BRUKERID    CHAR     ( 4);                                            
                                                                                
 /*------------------------------------------------------------*/               
 /*  HJELPE DCL FOR Å SNU DATO                                 */               
 /*------------------------------------------------------------*/               
                                                                                
   DCL           /*2000*/                                                       
      HJ_VIRK_DATO_ÅMD            PIC '99999999',                               
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅMD POS(1) PIC '9999',                       
      VIRK_DATO_ÅM DEF HJ_VIRK_DATO_ÅMD POS(1) PIC '999999',                    
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅMD POS(5) PIC '99';                         
      ANT_FEIL_SKREVET = 0;                                                     
      FEIL_FUNNET      = '0'B;                                                  
      KEY_PEKER        = ADDR(F7S.TKNR);                                        
                                                                                
  /* ******************************************************* */                 
  /* DATE () ER EN BUILTIN-FUNKSJON I PLI SOM RETURNERER     */                 
  /* DAGENS DATO I FORMEN ÅR - MNDR - DAG                    */                 
  /* ******************************************************* */                 
                                                                                
  FNR_REG.BRUKERID   = DIV_PARAM_OMR.CICS_IND;                                  
  DAGENS_DATO_ÅMD    = DATO_2000;                 /*2000*/                      
                                                                                
                                                                                
 /* BLANKETTER MED VIRK FRAM I TID AVVISES FRA 01.92  SP 8.91 */                
    HJ_VIRK_DATO_ÅMD  = F7S.VIRK_DATO_ÅMD;       /*2000*/                       
                                                                                
      /* HIT SP 8.91                                      */                    
                                                                                
                                                                                
                                                                                
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(F7S.FNR)) THEN                          
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.FNRNR =200;                                                     
         END;                                                                   
      ELSE                                                                      
      IF ^F_GYLDIG_FNR(F7S.FNR) THEN                                            
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.FNRNR = 1;                                                      
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
            FNR_REG.FNR1 = F7S.FNR;                                             
            EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);               
            IF FNR_REG.FNR2 > 0 THEN                                            
               DO;                                                              
                 F7S.FNRNR = 203;                                               
                 F7S.FNR_GML = F7S.FNR;                                         
                 F7S.FNR = FNR_REG.FNR2;                                        
               END;                                                             
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(F7S.TKNR)) THEN                          
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.TKNRNR = 200;                                                   
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
                  EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                    
                  EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)            
                                                     INTO(TK_RECL);             
                  LEAVE;                                                        
              NOTFND:                                                           
                  FEIL_FUNNET = '1'B;                                           
                  F7S.TKNRNR  = 3;                                              
         END;                                                                   
                                                                                
    /* ************************************************** */                    
    /* KONTROLL AV ACF2 FOR TILLGANGE TIL TKNR            */                    
    /*                                                    */                    
    /* ************************************************** */                    
    BO_TKNR  = TKNR;                                                            
     /* NY PROC 18.11.02 SATISH */                                              
    CALL ATK_TILGANG_KONTROLL;                                                  
                                                                                
      IF ^(F7S.TILL_EK = 'J' ! F7S.TILL_EK = ' ') THEN                          
         DO;                                                                    
            FEIL_FUNNET ='1'B;                                                  
            F7S.TILL_EKNR = 4;                                                  
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR2(F7S.BT_ANT)) THEN                        
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.BT_ANTNR = 200;                                                 
         END;                                                                   
      ELSE                                                                      
      IF F7S.BT_ANT > 12 THEN                                                   
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.BT_ANTNR = 282;                                                 
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(PENSJONSINNTEKT)) THEN                   
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.PENSJONSINNTEKTNR = 200;                                        
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(ARBEIDSINNTEKT)) THEN                    
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.ARBEIDSINNTEKTNR = 200;                                         
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(PENSJONSINNTEKT_EK)) THEN                
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.PENSJONSINNTEKT_EKNR = 200;                                     
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(ARBEIDSINNTEKT_EK)) THEN                 
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.ARBEIDSINNTEKT_EKNR = 200;                                      
         END;                                                                   
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR8(F7S.VIRK_DATO_ÅMD)) THEN /**/            
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.VIRK_DATO_ÅMDNR = 200;                    /*2000*/              
         END;                                                                   
      ELSE                                                                      
      IF ^F_GYLDIG_DATO(F7S.VIRK_DATO_ÅMD) THEN           /*2000*/              
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.VIRK_DATO_ÅMDNR = 9;                     /*2000*/               
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
            IF VIRK_DATO_ÅM < 199105 THEN         /*2000*/                      
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  F7S.VIRK_DATO_ÅMDNR = 381;       /*2000*/                     
               END;                                                             
         END;                                                                   
                                                                                
                                                                                
  /* HER SETTES VERDIER INN I MENY_OMR */                                       
      FØDSNUMMER = F7S.FNR;                                                     
      VIRKNINGSDATO_ÅMD = F7S.VIRK_DATO_ÅMD;            /*2000*/                
      IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(F7S.FNR_EK)) THEN                       
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            F7S.FNR_EKNR = 200;                                                 
         END;                                                                   
      ELSE                                                                      
      IF F7S.FNR_EK > 0 THEN                                                    
         DO;                                                                    
            IF ^F_GYLDIG_FNR(F7S.FNR_EK) THEN                                   
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  F7S.FNR_EKNR = 15;                                            
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  FNR_REG.FNR1 = F7S.FNR_EK;;                                   
                  EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);         
                  IF FNR_REG.FNR2 > 0 THEN                                      
                     DO;                                                        
                        F7S.FNR_EKNR = 203;                                     
                        F7S.FNR_GML_EK = F7S.FNR_EK;                            
                        F7S.FNR_EK = FNR_REG.FNR2;                              
                     END;                                                       
               END;                                                             
         END;                                                                   
 %SKIP(3);                             /*  */                                   
 /*   KRYSS KONTROLLER       */                                                 
 %SKIP;                                                                         
                                                                                
                                                                                
      IF ^FEIL_FUNNET THEN                                                      
         DO;                                                                    
          /*IF F7S.FNR_EK > 0 THEN                                              
               DO;                                                              
                  IF F_KJØNN(F7S.FNR) = F_KJØNN(F7S.FNR_EK) THEN                
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        F7S.FNRNR = 999;                                        
                        F7S.FNR_EKNR = 16;                                      
                     END;                                                       
               END;     */                                                      
                                                                                
   /* RETTES SLIK AT VI KAN REG F7  SEKS MND FREM I TID *******                 
            IF HJ_VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN                            
               DO;                                                              
                  IF DAGENS_DATO_D > 19 THEN                                    
                     DO;                                                        
                        HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 2;                 
                     END;                                                       
                  ELSE                                                          
                     HJ_DAGENS_DATO_ÅM = DAGENS_DATO_ÅM + 1;                    
                  IF HJ_DAGENS_DATO_M > 12 THEN                                 
                     DO;                                                        
                        HJ_DAGENS_DATO_Å = HJ_DAGENS_DATO_Å + 1 ;               
                        HJ_DAGENS_DATO_M = HJ_DAGENS_DATO_M - 12;               
                     END;                                                       
                   IF HJ_VIRK_DATO_ÅM > HJ_DAGENS_DATO_ÅM THEN                  
                     DO;                                                        
                        FEIL_FUNNET        = '1'B;                              
                        F7S.VIRK_DATO_MÅNR =  10 ;                              
                     END;                                                       
               END;                                                             
         ***************** TRUDE 180392   ******* */                            
   /* RETTES SLIK AT VI KAN REG F7  SEKS MND FREM I TID ******* */              
                                                                                
            IF VIRK_DATO_ÅM > DAGENS_DATO_ÅM THEN        /*2000*/               
               DO;                                                              
                  IF ^ F_6MDR(HJ_VIRK_DATO_ÅMD)   THEN   /*2000*/               
                     DO;                                                        
                        FEIL_FUNNET        = '1'B;                              
                        F7S.VIRK_DATO_ÅMDNR = 205 ;     /*2000*/                
                     END;                                                       
               END;                                                             
                                        /* TRUDE 180392   HIT */                
                                                                                
               IF F7S.TILL_EK ^= 'J' & F7S.BT_ANT = 0 THEN                      
                  DO;                                                           
                     FEIL_FUNNET = '1'B;                                        
                     F7S.TILL_EKNR = 163;                                       
                     F7S.BT_ANTNR = 999;                                        
                  END;                                                          
            IF F7S.TILL_EK = 'J' THEN                                           
               IF F7S.FNR_EK = 0  THEN                                          
                  DO;                                                           
                     FEIL_FUNNET = '1'B;                                        
                     F7S.TILL_EKNR = 19;                                        
                     F7S.FNR_EKNR = 999;                                        
                  END;                                                          
         END;                                                                   
   END KONTROLL_F7_SØKER;                                                       
                                                                                
                                                                                
