 /*   SIST ENDRET PÅ PROD   2000.07.07 13.01.24 AV   JDA7339          */        
 /*       SIST ENDRET 26/11-97 12.54.39 AV   SPA7339                  */        
 /* ***************************************************************  */         
 /* PROC FOR KONVERTERING AV DATO  6 CHAR / 7 CHAR TIL 9 CHAR        */         
 /*              DD.MND.ÅR   ->  HHÅR.MND.DD                        */          
 /* ***************************************************************  */         
  KONV_HÅMD_MHÅ: PROC(IN_DATO) RETURNS(PIC '(06)9' );                           
  DCL IN_DATO     PIC '(8)9';                                                   
  DCL UT_DATO     PIC '(06)9'   ;                                               
                                                                                
  DCL 1 H_DATO,                                                                 
        02 HH     PIC '99'  INIT (00),                                          
        02 ÅR     PIC '99'  INIT (00),                                          
        02 MM     PIC '99'  INIT (00),                                          
        02 DD     PIC '99'  INIT (00),                                          
      1 H_DATO_IN DEF H_DATO PIC '99999999';                                    
                                                                                
  DCL 1 H_DATO_UT,                                                              
        02 MM     PIC '99'  INIT (00),                                          
        02 HH     PIC '99'  INIT (00),                                          
        02 ÅR     PIC '99'  INIT (00),                                          
      1 H_DATO_UT_PK  DEF H_DATO_UT  CHAR (06)     ;                            
                                                                                
  /*              ************                  */                              
  IF IN_DATO > 0 THEN                                                           
     DO;                                                                        
         H_DATO_IN = IN_DATO;                                                   
         H_DATO_UT = H_DATO, BY NAME;                                           
     END;                                                                       
  ELSE                                                                          
     H_DATO_UT_PK  = 0      ;                                                   
                                                                                
     UT_DATO = H_DATO_UT_PK;                                                    
                                                                                
     RETURN (UT_DATO);                                                          
  END KONV_HÅMD_MHÅ;                                                            
                                                                                
