 /*   SIST ENDRET PÅ PROD   2005.06.24 12.44.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.02.07 12.58.26 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.18 12.00.47 AV   JDA7339          */        
 /*       SIST ENDRET 04/05-98 12.59.45 AV   JDA7339                  */        
 /*       SIST ENDRET 17/03-98 09.30.12 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014253 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER: HERMAN LARSSEN, NOV. 88                          */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN KONTROLLERER AT PARAGRAFENE 6B) OG 6C) ER OPPFYLT      */        
 /*    FOR AFP-SØKERE.                                                */        
 /*BRUK   :                                                           */        
 /*    CALL KONTROLL_AFP_RETTIGHET                                    */        
 /*    INCLUDES I 4251                                                */        
 /*                                                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
  KONTROLL_AFP_RETTIGHET :                                                      
   PROC;                                                                        
    DCL                                                                         
       SUM_BESTE                 FIXED DEC(7,3) INIT(0),                        
       SLUTTÅR                   FIXED DEC(5),                                  
       REGEL_6B                  FIXED DEC(3) INIT(0),                          
       ANTALL_BESTE              FIXED DEC(3),                                  
       W_INNTEKT  (1967 : 2060)      FIXED DEC(9),                              
       BRUTTOPOENG(1967 : 2060)      FIXED DEC(5,3),                            
       BESTE_POENG(20)           FIXED DEC(5,3),                                
       FEMTIÅR                   FIXED DEC(5);                                  
  PROGRAM_ID = 'R0014253';                                                      
  BESTE_POENG          = 0;                                                     
  BRUTTOPOENG          = 0;                                                     
  W_INNTEKT            = 0;                                                     
                                                                                
    FEMTIÅR    = W_FNR_R13.ÅR + 50;                                             
    SLUTTÅR    = (B02.UTTAKSDATO_ÅMD(BER_SØ_IND) / 10000) - 1;                  
    DCL TEST1 FIXED DEC (3,2) INIT (0);                                         
    DCL TEST2 FIXED DEC (3,2) INIT (0);                                         
                                                                                
    DO I = FEMTIÅR TO SLUTTÅR;                                                  
       TEST1 = W_POREKKE.POENG(I);                                              
       TEST2 = POREKKE.POENG(BER_SØ_IND,I);                                     
       W_INNTEKT(I) = B02.PI(BER_SØ_IND,I);       /*200504 */                   
       IF POREKKE.POENG(BER_SØ_IND,I) > 0     THEN                              
          REGEL_6B = REGEL_6B + 1;                                              
                                                                                
    END;                                                                        
                                                                                
                                                                                
 /* PARAGRAF 6 B SETTER SOM VILKÅR AT PERSONEN HAR TJENT OPP   */               
 /* PENSJONSPOENG I MINST 10 ÅR FRA OG MED 50-ÅRS-ÅRET TIL OG  */               
 /* MED ÅRET FØR UTTAK.                                        */               
                                                                                
                                                                                
                                                                                
         IF REGEL_6B < 10               THEN                                    
 L300:                                                                          
            DO;                                                                 
               FEIL_VED_LABEL = '300';                                          
               FEIL_MELD_NR   = 411;                                            
            END;                                                                
                                                                                
 /* PARAGRAF 6 C SETTER SOM VILKÅR        AT PERSONEN HAR HATT  */              
 /* EN GJENNOMSNITTLIG PENSJONSGIVENDE INNTEKT PÅ MINST 2 G I   */              
 /* DE 10 BESTE INNTEKTSÅRENE FRA OG MED 1967 TIL OG MED ÅRET   */              
 /* FØR UTTAKSÅRET :                                            */              
                                                                                
    DO I = 1967 TO SLUTTÅR;                                                     
       IF POREKKE.POENG(BER_SØ_IND,I) > 0     THEN                              
          BRUTTOPOENG(I) = POREKKE.POENG(BER_SØ_IND,I) + 1;                     
       ELSE                                                                     
       IF W_INNTEKT(I) > 0                  THEN                                
          BRUTTOPOENG(I) = W_INNTEKT(I) / GV_TAB_ARRAY.G_V(I);                  
    END;                                                                        
                                                                                
    DO I = 1 TO 10;                                                             
       DO J = 1967 TO SLUTTÅR;                                                  
          IF BRUTTOPOENG(J) > BESTE_POENG(I) THEN                               
             DO;                                                                
                BESTE_POENG(I) = BRUTTOPOENG(J);                                
                K = J;                                                          
             END;                                                               
       END;                                                                     
       BRUTTOPOENG(K) = 0;                                                      
                                                                                
    END;                                                                        
                                                                                
    DO I = 1 TO 10;                                                             
       SUM_BESTE = SUM_BESTE + BESTE_POENG(I);                                  
    END;                                                                        
                                                                                
    IF SUM_BESTE / 10 < 2   THEN                                                
 L310:                                                                          
       DO;                                                                      
          FEIL_VED_LABEL = '310';                                               
          FEIL_MELD_NR   = 412;                                                 
       END;                                                                     
  END KONTROLL_AFP_RETTIGHET;                                                   
