 /*   SIST ENDRET PÅ PROD   2004.03.02 11.37.37 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.11 11.24.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2001.10.31 10.28.59 AV   JDA2970          */        
 /*       SIST ENDRET 09/06-98 08.32.23 AV   SPA7339                  */        
 /*       SIST ENDRET 26/05-98 09.37.50 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*               R 0 0 1 0 6 0 8                                     */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R0010608      TT_UP_EP      SUBPROGRAM           */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : BERGESTAD                                        */        
 /*  PROGRAMMET BLE LAGET : MAI 1981                                  */        
 /*  ENDRINGERSDATO : 16/10-84                                        */        
 /*  ENDRINGEN GJELDER: GRENSE FOR MAX TT, IKKE LENGER 40 ÅR          */        
 /*  ENDRINGEN BLE UTFØRT AV : KARIN                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*    BEREGNER MAKS TT FØR 1967, OG TT FRA 1966 TIL UFØRE/           */        
 /*    DØDSTIDSPUNKTET                                                */        
 /*  BRUK:                                                            */        
 /*    CALL TT_UP_EP(FNR,DATO,MAKS_TT_FØR_1967,TT_TIL_TPK);           */        
 /*  PARAMETER INN :                                                  */        
 /*    FNR,DATO                                                       */        
 /*  PARAMETER UT :                                                   */        
 /*    MAKS_TT_FØR_1967, TT_TIL_TPK                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  PROGRAMMET INCLUDES I R0010601 - KONTROLL_GRUNNBLANKETT_UP       */        
 /*  PROGRAMMET INCLUDES I R0010801 - KONTROLL_GRUNNBLANKETT_EP       */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  INGEN                                                            */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*  INGEN                                                            */        
 /* ***************************************************************** */        
 %PAGE;                                                                         
 TT_UP_EP:                                                                      
    PROC(FNR,TPK_ÅMD,MAKS_TT_FØR_1967,TT_TIL_TPK);                              
   DCL                                                                          
      FNR PIC'(11)9';                                                           
   DCL                                                                          
      FNR13 PIC'(13)9';                                                         
   DCL                                                                          
      W_FNR_MN PIC'(2)9' DEF FNR13 POS(3),                                      
      W_FNR_ÅR13 PIC'(4)9' DEF FNR13 POS(5),                                    
      W_PERSNR PIC'(3)9' DEF FNR13 POS(9);                                      
   DCL                                                                          
      TPK_ÅMD PIC'(8)9',                                                        
      TPK_M DEF TPK_ÅMD POS(5) PIC '99',                                        
      TPK_Å DEF TPK_ÅMD POS(1) PIC '9999',                                      
      TPK_ÅM  PIC'(6)9';                                                        
                                                                                
   DCL MAKS_TT_FØR_1967 PIC'(2)9';                                              
   DCL TT_TIL_TPK       PIC'(4)9';                                              
   DCL TIDLIGST_67          PIC'999999' INIT ('196700');                        
                                                                                
 %SKIP(2);                                                                      
   FNR13 = KONV_FNR11_FNR13(FNR);                                               
   TPK_ÅM = ((TPK_Å * 100) + TPK_M);                                            
 %SKIP(2);                                                                      
   IF (W_FNR_ÅR13 > 1950) THEN                                                  
     DO;                                                                        
      TIDLIGST_67 = (W_FNR_ÅR13 + 16) * 100;                                    
     END;                                                                       
   ELSE                                                                         
     DO;                                                                        
      MAKS_TT_FØR_1967 = 1967 - (W_FNR_ÅR13 +16);                               
     END;                                                                       
                                                                                
   IF (TPK_ÅM > TIDLIGST_67) THEN                                               
      TT_TIL_TPK = TPK_ÅM - TIDLIGST_67;                                        
   ELSE                                                                         
      TT_TIL_TPK = 0;  /* KAN IKKE VÆRE NEGATIV! */                             
   RETURN;                                                                      
 END TT_UP_EP;                                                                  
