 /*   SIST ENDRET PÅ PROD   2003.10.02  9.11.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.09.12 11.30.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.02.21 10.21.50 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.02.16 12.06.29 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.01.05 14.42.36 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.29 11.57.37 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.18 12.48.14 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.28 15.18.49 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.13 12.59.32 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.05.23 13.09.18 AV   JDA7339          */        
 /*       SIST ENDRET 11/06-99 09.03.44 AV   SPA7339                  */        
 /*       SIST ENDRET 11/06-99 09.02.42 AV   SPA7339                  */        
 /*       SIST ENDRET 19/04-99 15.09.20 AV   JDA7339                  */        
 /*       SIST ENDRET 19/04-99 15.09.00 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.16.35 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.13.31 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.54 AV   JDA7339                  */        
 /*       SIST ENDRET 11/03-98 12.06.17 AV   JDA7339                  */        
  /* *************************************************************** */         
  /* IDENTIFIKASJON:   R0017047 - PROSEDYRE I PLI                    */         
  /* PROGRAMMERER:  JAN, JANUAR 1983                                 */         
  /* HENSIKT:                                                        */         
  /*        LEGGER INFORMASJON FRA B02 OVER I ET BER-GRUNL-SEGMENT   */         
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */         
  /*        HVER AJOURFØRT TRANSAKSJON.                              */         
  /* PROGRAMTILKNYTNING:                                             */         
  /*        PROGRAMMET INKLUDERES I  R0017001                        */         
  /* BRUK:                                                           */         
  /*        CALL BYGG_OPP_BERGRUNL_SEGMENT                           */         
  /* *************************************************************** */         
  BYGG_OPP_BERGRUNL_SEGMENT:                                                    
      PROC(IND);                                                                
                                                                                
    DCL W_FNR13   PIC '(13)9';                                                  
    DCL IND       FIXED BIN (15);                                               
    DCL SEKSTI_NIÅR PIC '9999';                                                 
    DCL SEKSTI_SEKSÅR PIC '9999';                                               
    DCL SKAL_SKRIVE   BIT(1);                                                   
    DCL KODE_FINNES   BIT(1)  INIT ('0'B);                                      
                                                                                
    DCL HJ_SISTE_UFTP PIC '(8)9';                                               
    DCL SISTE_UFÅR  PIC '(4)9';                                                 
    DCL M           FIXED BIN (15);                                             
                                                                                
                                                                                
    DCL                                                                         
        1 W_FNR_R DEF W_FNR13,                                                  
          2 DAG   PIC '99',                                                     
          2 MÅNED PIC '99',                                                     
          2 ÅR    PIC '9999',                                                   
          2 F1900 PIC '999',                                                    
          2 REST  PIC '99';                                                     
                                                                                
  /* *************************************************************** */         
  /*  PROGRAMMET BEGYNNER HER. VI BLANKER W_BERGRUNL                 */         
  /* *************************************************************** */         
                                                                                
    SISTE_UFÅR = 0;                                                             
    HJ_SISTE_UFTP = 0;                                                          
    DO M = 1 TO 7 WHILE (B02.UFØRHIST.UFT_ÅMD(IND,M) > 0); /* JFA */            
       HJ_SISTE_UFTP = (B02.UFØRHIST.UFT_ÅMD(IND,M));                           
       SISTE_UFÅR = SUBSTR(HJ_SISTE_UFTP,1,4);                                  
    END;                                                                        
                                                                                
    W_BERGRUNL   = '';                                                          
    W_FNR13      = KONV_FNR11_FNR13((B02.FNR(IND)));                            
    SKAL_SKRIVE  = '0'B;                                                        
    SEKSTI_NIÅR  = W_FNR_R13.ÅR + 69;                                           
    SEKSTI_SEKSÅR = SEKSTI_NIÅR - 3;                                            
    DO I = (SEKSTI_SEKSÅR+1) TO SEKSTI_NIÅR;                                    
       IF POREKKE.KODE(IND,I) ^= 'U91'    &                                     
          POREKKE.KODE(IND,I) ^= ' '     THEN                                   
          KODE_FINNES = '1'B;                                                   
    END;                                                                        
                                                                                
    DO AVDIND = 1963 TO SEKSTI_NIÅR;                                            
       W_BERGRUNL.ÅR             = AVDIND;                                      
       W_BERGRUNL.UFG            = POREKKE.UFG(IND,AVDIND);                     
       W_BERGRUNL.POENG          = POREKKE.POENG(IND,AVDIND);                   
       W_BERGRUNL.POENG_KODE     = POREKKE.KODE(IND,AVDIND);                    
                                                                                
       IF AVDIND < 2011 &                                                       
          AVDIND > 1966 THEN                                                    
          W_BERGRUNL.P_INNTEKT   = B02.PI(IND,AVDIND);                          
       IF POREKKE.KODE(IND,AVDIND) = 'U91'  &    /* JFA 15.1.2001 */            
          AVDIND = SEKSTI_SEKSÅR       THEN                                     
          W_BERGRUNL.P_INNTEKT   =  0;                                          
       IF POREKKE.KODE(IND,AVDIND) = 'U54' !                                    
          POREKKE.KODE(IND,AVDIND) = 'U60' !                                    
          POREKKE.KODE(IND,AVDIND) = 'U61' !                                    
          POREKKE.KODE(IND,AVDIND) = 'U64' THEN                                 
          DO;                                                                   
   /* NY TEST HL 140296 : */                                                    
             IF W_BERGRUNL.ÅR < 1973     THEN                                   
                AVDIND = SEKSTI_NIÅR;                                           
             ELSE                                                               
             IF AVDIND < SEKSTI_SEKSÅR           THEN                           
                AVDIND = SEKSTI_SEKSÅR;                                         
             W_HENDELSE.EØS_GARANTI = B02.EØS_GARANTI(IND);                     
          END;                                                                  
                                                                                
     IF B02.PENSJONSTYPE1(IND) ^= 'K' THEN     /* JFA 5.2.2003 */               
       IF (W_BERGRUNL.UFG > 49         &                                        
           W_BERGRUNL.POENG_KODE = ''  &                                        
           AVDIND >= SISTE_UFÅR        &                                        
           AVDIND >  1991              &   /*200009 HL*/                        
           B02.PENSJONSTYPE1(IND) ^= 'A') THEN /* JFA 31.8.2000 */              
                AVDIND = SEKSTI_NIÅR;                                           
                                                                                
       IF (AVDIND >= SEKSTI_SEKSÅR &                                            
  /*   IF (AVDIND >  SEKSTI_SEKSÅR &   RETTET TILBAKE 21.2.2001 JFA */          
           ^KODE_FINNES            &                                            
           W_FNR_R.ÅR > 1905       &           /*HL 200012   */                 
           B02.TT_67_TIL_70(IND) = 0 )  THEN   /* JFA 10.7.00 */                
                AVDIND = SEKSTI_NIÅR;                                           
                                                                                
       IF SKAL_SKRIVE = '1'B &                                                  
          AVDIND < 2011      &                                                  
          AVDIND <= SEKSTI_NIÅR THEN  /* JFA 23.6.00 FØYD TIL = */              
             CALL INSERT_BERGR;                                                 
       ELSE                                                                     
       IF (W_BERGRUNL.POENG       > 0    )         !                            
         ((W_BERGRUNL.P_INNTEKT   > 0    )         &                            
          (AVDIND                 < 2011 ))        !                            
          (W_BERGRUNL.POENG_KODE   = 'U55' )       !  /*9906*/                  
          (W_BERGRUNL.POENG_KODE   = 'U56' )     THEN                           
          DO;                                                                   
             CALL INSERT_BERGR;                                                 
                SKAL_SKRIVE = '1'B;                                             
          END;                                                                  
    END;                                                                        
  END  BYGG_OPP_BERGRUNL_SEGMENT;                                               
