 /*       SIST ENDRET 04/05-98 13.14.27 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/03-98 10.34.09 AV   SLA9300                  */00000010
 /*       SIST ENDRET 06/05-96 13.10.19 AV   JDA0310                  */00000020
 /*       SIST ENDRET 12/04-94 15.04.10 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 16/02-94 15.41.22 AV   TRUDE                    */00000040
 /*       SIST ENDRET 13/12-91 12.26.19 AV   DYBVIK                   */00000050
 /*********************************************************************/00000060
 /* IDENTIFIKASJON:                                                   */00000070
 /*    R0016031 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000080
 /* HENSIKT:                                                          */00000090
 /*    EN FUNKSJON SOM KOVERTERER SIVILSTAND FRA RF- TIL SR-STANDARD  */00000100
 /* PROGRAMTILKNYTNING:                                               */00000110
 /*    LOKAL PROSEDYRE I R0016001                                     */00000120
 /* ENDRET UKE 7 1994 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S            */00000130
 /*                   PT1 = K ==> SVAR = 21                           */00000140
 /* ENDRET UKE 15 1994 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000150
 /*            NYE SIVILSTANDSKODER                                  */ 00000160
 /* ENDRET UKE 151996 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S            */00000170
 /*                   NY KODE=32 : ETTERL.SAMBOER (PT1/PT2=E OG SIV=W)*/00000180
 /* ENDRET UKE 01 1998 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000210
 /*                   NY KODE=09 : SAMBOERE IKKE BARN (         SIV=V)*/00000220
 /* ENDRET UKE 30 1998 AV SVERRE LUNDEBY,DATA-UTVIKLING A/S           */00000230
 /*            FEIL TEST VED RF0_SS=S,W TILLEGG V/RF0_SS=E            */00000240
 /*********************************************************************/00000190
                                                                        00000200
 F_KONV_SIVILSTAND: PROC (RF0_SS) RETURNS (PIC '99');                   00000210
                                                                        00000220
    DCL RF0_SS               CHAR (1); /* SIVILSTAND HOVED-BASEN (RF) */00000230
    DCL SVAR                 PIC '99'; /* SIVILSTAND STATISTKK-BASEN  */00000240
                                                                        00000250
    SELECT(RF0_SS);                                                     00000260
       WHEN ('G')                                                       00000270
          SELECT(B02.PERSON(3-I).STATUS.PENSJONSTYPE1);                 00000280
             WHEN ('A') SVAR = 21;                                      00000290
             WHEN ('K') SVAR = 21;                                      00000300
             WHEN ('U') SVAR = 22;                                      00000310
             WHEN ('V') SVAR = 22;                                      00000320
             WHEN ('Y') SVAR = 22;                                      00000330
             WHEN ('F') SVAR = 23;                                      00000340
             OTHERWISE  SVAR = 29;                                      00000350
          END; /* OF SELECT */                                          00000360
       WHEN ('U') SVAR = 10;                                            00000370
       WHEN ('A') SVAR = 24;                                            00000380
       WHEN ('S')                                                       00000380
            IF B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'E' !    /*9807SL*/ 00000460
               B02.PERSON(I).STATUS.PENSJONSTYPE2 = 'E' THEN /*9807SL*/ 00000470
               SVAR = 31;                                               00000410
            ELSE                                                        00000420
               SVAR = 40;                                               00000430
       WHEN ('E')                                                       00000440
            IF B02.PERSON(3-I).STATUS.SIVILSTAND = 'S' THEN /*9807SL*/  00000520
               SVAR = 31;                                   /*9807SL*/  00000530
            ELSE IF                                                     00000540
               B02.PERSON(3-I).STATUS.SIVILSTAND = 'W' THEN /*9807SL*/  00000550
               SVAR = 32;                                   /*9807SL*/  00000560
            ELSE                                                        00000570
               SVAR = 30;                                               00000580
       WHEN ('P') SVAR = 60;                                            00000450
       WHEN ('W')                                                       00000460
            IF B02.PERSON(I).STATUS.PENSJONSTYPE1 = 'E' !    /*9807SL*/ 00000610
               B02.PERSON(I).STATUS.PENSJONSTYPE2 = 'E' THEN /*9807SL*/ 00000620
                     SVAR = 32;                                         00000480
                  ELSE                                                  00000490
                     SVAR = 00;                                         00000500
       WHEN ('V') SVAR = 09;                                            00000660
       OTHERWISE  SVAR = 99;                                            00000510
    END; /* OF SELECT */                                                00000520
    RETURN(SVAR);                                                       00000530
 END; /* F_KONV_SIVILSTAND */                                           00000540
                                                                        00000550
