 /*       SIST ENDRET 28/08-98 14.34.01 AV   SPA7339                  */00000000
 /*       SIST ENDRET 14/01-98 15.24.33 AV   SPA7339                  */00000010
 /* ***************************************************************** */00000020
 /* IDENTIFIKASJON                                                    */00000030
 /*     R0010426 - PROGRAM SOM STYRER HVILKE SATSVISE RUTINER SOM     */00000040
 /*                SKAL KJØRES UNDER ADMINISTRASJONSDELEN AV SYSTEMET.*/00000050
 /*                HOVEDPROGRAM I CICS/PLI.                           */00000060
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SEPTEMBER 1983.             */00000070
 /* HENSIKT                                                           */00000080
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */00000090
 /*     VELGE HVILKEN SATSVIS JOBB SOM ØNSKES KJØRT.                  */00000100
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */00000110
 /*     KAN GI KONTROLL TIL DET PROGRAM SOM UTFØRER AKSJONEN.         */00000120
 /* PROGRAMTILKNYTNING                                                */00000130
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */00000140
 /*     UNDER ADMINISTRASJONSDELEN.                                   */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
                                                                        00000180
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);          00000190
                                                                        00000200
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */00000210
    %INCLUDE P0019908;            /* KOM_OMR                          */00000220
    %INCLUDE P0019910;            /* STYRE_OMR                        */00000230
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */00000240
    %INCLUDE S001A1;              /* MAP TIL Å BESTEMME HVILKEN       */00000250
                                  /* SATSVIS JOBB SOM SKAL KJØRES     */00000260
                                                                        00000270
    DCL                                                                 00000280
      CSTG                       BUILTIN,                               00000290
      ADDR                       BUILTIN,                               00000300
      BMSMAPBR                   POINTER,                               00000310
      COMMAREA_PEKER             POINTER;                               00000320
                                                                        00000330
                                                                        00000340
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);             00000350
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);               00000360
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);              00000370
    TRANSKODE               = 'RA21';        /* DETTE PROGRAM  */       00000380
                                                                        00000390
                                                                        00000400
    IF PROGRAM_ID = 'R0010420' THEN         /* KOMMER IN FØRSTE GANG */ 00000410
                                                                        00000420
       DO;                                                              00000430
          EXEC CICS SEND MAP('S001A1') MAPSET('S001A13') MAPONLY ERASE; 00000440
                                                                        00000450
       END;                                                             00000460
                                                                        00000470
                                                                        00000480
    ELSE IF PROGRAM_ID = 'R0010421' THEN       /*   DETTE PROGRAM   */  00000490
                                                                        00000500
       DO;                                                              00000510
          EXEC CICS RECEIVE MAP('S001A1')MAPSET('S001A13')              00000520
                                         SET  (BMSMAPBR);               00000530
          S001A1O.MELDINGO  = ' ';                                      00000540
                                                                        00000550
          IF S001A1I.FUNKSJONSKODEL > 0 &                               00000560
             S001A1I.FUNKSJONSKODEI ^= 'A' THEN                         00000570
             DO;                                                        00000580
                FUNKSJONSKODE = S001A1I.FUNKSJONSKODEI;                 00000590
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR); 00000600
             END;                                                       00000610
                                                                        00000620
          ELSE                                                          00000630
          IF S001A1I.STYRE_KODEL > 0 &                                  00000640
             S001A1I.STYRE_KODEI ^= 'SK' THEN                           00000650
             DO;                                                        00000660
                STYREKODE  = S001A1I.STYRE_KODEI;                       00000670
                EXEC CICS XCTL PROGRAM ('R0010420') COMMAREA (KOM_OMR); 00000680
             END;                                                       00000690
                                                                        00000700
          ELSE                                                          00000710
          IF S001A1I.ALDERS_KONVL     > 0 THEN                          00000720
             EXEC CICS XCTL PROGRAM ('R0019F01') COMMAREA (KOM_OMR);    00000730
                                                                        00000740
          ELSE                                                          00000750
          IF S001A1I.OMREGNING_E_INTL > 0 THEN                          00000760
             EXEC CICS XCTL PROGRAM ('R0019D70') COMMAREA (KOM_OMR);    00000770
                                                                        00000780
          ELSE                                                          00000790
          IF S001A1I.GR_BEL_ENDRL     > 0 THEN                          00000800
             EXEC CICS XCTL PROGRAM ('R0019H01') COMMAREA (KOM_OMR);    00000810
                                                                        00000820
          ELSE                                                          00000830
             S001A1O.MELDINGO =                                         00000840
                    'HER VAR DET INGEN MARKERINGER';                    00000850
                                                                        00000860
          EXEC CICS SEND MAP ('S001A1') MAPSET ('S001A13')              00000870
                                            DATAONLY ;                  00000880
                                                                        00000890
                                                                        00000900
       END;                                                             00000910
                                                                        00000920
                                                                        00000930
  UT:                                                                   00000940
    PROGRAM_ID = 'R0010421';                                            00000950
    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);              00000960
                                                                        00000970
                                                                        00000980
 END R001B1;                                                            00000990
                                                                        00001000
