 /*   SIST ENDRET PÅ PROD   2007.06.08  8.15.39 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2005.01.28 11.37.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.01.25  9.15.07 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 13.33.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.14 13.03.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.55.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.13  9.26.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.07.10 12.46.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.07.10 12.32.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.06.04 13.22.20 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.06.04 10.59.19 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.39.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.30.56 AV   JDA2970          */        
 /*       SIST ENDRET 28/08-98 14.33.18 AV   SPA7339                  */        
 /*       SIST ENDRET 14/01-98 15.27.23 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0010426 - PROGRAM SOM STYRER HVILKE SATSVISE RUTINER SOM     */        
 /*                SKAL KJØRES UNDER ADMINISTRASJONSDELEN AV SYSTEMET.*/        
 /*                HOVEDPROGRAM I CICS/PLI.                           */        
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SEPTEMBER 1983.             */        
 /* HENSIKT                                                           */        
 /*     PROGRAMMET SKAL SENDE UT EN MAP FØRST FOR AT EN SKAL KUNNE    */        
 /*     VELGE HVILKEN SATSVIS JOBB SOM ØNSKES KJØRT.                  */        
 /*     DERETTER SKAL DENNE MAPPEN RECEIVES SLIK AT DETTE PROGRAMMET  */        
 /*     KAN GI KONTROLL TIL DET PROGRAM SOM UTFØRER AKSJONEN.         */        
 /* PROGRAMTILKNYTNING                                                */        
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010301                       */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001B1: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);                  
                                                                                
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */        
    %INCLUDE P0019908;            /* KOM_OMR                          */        
    %INCLUDE P0019910;            /* STYRE_OMR                        */        
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */        
    %INCLUDE S001A6;              /* MAP TIL Å BESTEMME HVILKEN       */        
    %INCLUDE S0019A;              /* MAP TIL Å BESTEMME HVILKEN       */        
                                  /* SATSVIS JOBB SOM SKAL KJØRES     */        
                                                                                
    DCL                                                                         
      CSTG                       BUILTIN,                                       
      ADDR                       BUILTIN,                                       
      VERIFY                     BUILTIN,                                       
      NULL                       BUILTIN,                                       
      BMSMAPBR                   POINTER,                                       
      COMMAREA_PEKER             POINTER;                                       
                                                                                
    ALLOCATE S001A6O;                                                           
    KOM_OMR.TRANS_OPPL_PEKER  =  ADDR (KOM_OMR.TRANS_OPPL_OMR)    ;             
    KOM_OMR.STYRINGS_PEKER    =  ADDR (KOM_OMR.STYRINGS_OMR)      ;             
    KOM_OMR.DIV_PARAM_PEKER   =  ADDR (KOM_OMR.DIV_PARAM_OMR)     ;             
    TRANSKODE                 = 'RA26';        /* DETTE PROGRAM  */             
                                                                                
                                                                                
    IF PROGRAM_ID      =  'R0010301' THEN   /* KOMMER IN FØRSTE GANG */         
       DO;                                                                      
          S001A6O.CICS_INFOO            =  CICS_NAVN;                           
          S001A6O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                      
                                                                                
          EXEC CICS SEND MAP('S001A6') MAPSET('S001A63')  ERASE;                
       END;                                                                     
    ELSE                                                                        
       IF PROGRAM_ID   =  'R0010426' THEN   /*   DETTE PROGRAM   */             
          DO;                                                                   
             EXEC CICS RECEIVE MAP('S001A6')MAPSET ('S001A63')                  
                                            SET    ( BMSMAPBR);                 
                                                                                
             S001A6O.MELDINGO            =  ' ';                                
                                                                                
             IF S001A6I.FUNKSJONSKODEL > 0 &                                    
             VERIFY(S001A6I.FUNKSJONSKODEI,'RVEFIAHTX') = 0 THEN                
                DO;                                                             
                   FUNKSJONSKODE         =   'H';                               
                                                                                
                   EXEC CICS XCTL PROGRAM  ('R0010301')                         
                                  COMMAREA ( KOM_OMR  );                        
                END;                                                            
             /*-----------------------------------------------------*/          
             /* SJEKKER HVILKEN KJØRING SOM SKAL AKTIVISERES        */          
             /*-----------------------------------------------------*/          
                                                                                
             IF S001A6I.KJØRE_TYPEL     >   0                 THEN              
                                                                                
                SELECT   (S001A6I.KJØRE_TYPEI);                                 
                                                                                
                   WHEN  (       '1'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019F01')                     
                                      COMMAREA ( KOM_OMR  )      ;              
                                                                                
                   WHEN  (       '2'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019D70')                     
                                      COMMAREA ( KOM_OMR  )      ;              
                                                                                
                   WHEN  (       '3'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019H01')                     
                                      COMMAREA ( KOM_OMR  )  ;                  
                                                                                
                   WHEN  (       '4'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019E01')                     
                                      COMMAREA ( KOM_OMR  )  ;                  
                                                                                
                   WHEN  (       '5'        )                                   
                       DO;                                                      
                          DIV_PERIODE                 = '' ;                    
                          DIV_PARAM_OMR.FRA_CICS      = '1'B;                   
                          DIV_PARAM_OMR.HENT_FRAM_MAP = '0'B;                   
                          DIV_PARAM_OMR.FRA_MED_DIALOG = '0'B;                  
                          DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                 
                          KOM_OMR.PCB_UIB_PEKER         =  NULL;                
                          STYRINGS_OMR.STYREKODE        = 'AU';                 
                                                                                
                          TRANSKODE = 'R9A0';                                   
                          ALLOCATE S0019A1O ;                                   
                          S0019A1O.CICS_INFOO =                                 
                                           DIV_PARAM_OMR.CICS_NAVN ;            
                                                                                
                           EXEC CICS SEND MAP('S0019A1')                        
                                       MAPSET('S0019A3') ERASE;                 
                                                                                
                          EXEC CICS XCTL PROGRAM  ('R0019A01')                  
                                      COMMAREA ( KOM_OMR  )  ;                  
                       END;                                                     
                   WHEN  (       '6'        )                                   
                       EXEC CICS XCTL PROGRAM  ('R001NO10')                     
                                      COMMAREA ( KOM_OMR  )  ;                  
                                                                                
                   WHEN  (       '7'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019H21')                     
                                      COMMAREA ( KOM_OMR  )      ;              
                   WHEN  (       '8'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019H31')                     
                                      COMMAREA ( KOM_OMR  )      ;              
                                                                                
                   WHEN  (       '9'         )                                  
                       EXEC CICS XCTL PROGRAM  ('R0019H41')                     
                                      COMMAREA ( KOM_OMR  )      ;              
                                                                                
                   OTHERWISE                                                    
                      S001A6O.MELDINGO =                                        
                             'FEIL MARKERING               ' ;                  
                                                                                
                END;/*  SELECT                              */                  
            ELSE                                                                
                S001A6O.MELDINGO =                                              
                             'HER VAR DET INGEN MARKERINGER' ;                  
                                                                                
                                                                                
  SEND_MAP:                                                                     
             EXEC CICS SEND MAP ('S001A6') MAPSET ('S001A63')                   
                                            DATAONLY ;                          
                                                                                
       END;  /*    ELSE   IF                                */                  
                                                                                
  UT:                                                                           
    PROGRAM_ID = 'R0010426';                                                    
    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                      
                                                                                
                                                                                
 END R001B1;                                                                    
                                                                                
