 /*       SIST ENDRET 30/07-98 13.44.29 AV   JDA7339                  */00000000
 %SKIP;                                /*  */                           00000010
 /* ***************************************************************** */00000020
 /*                                                                   */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R0011304     VELG MENY_TG     HOVEDPROG          */00000070
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000080
 /*  PROGRAMMERER  :                                                  */00000090
 /*  PROGRAMMET BLE LAGET :                                           */00000100
 /*  ENDRINGSDATO         :                                           */00000110
 /*  ENDRINGEN GJELDER    :                                           */00000120
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
 /*HENSIKT:                                                           */00000160
 /* **********                                                        */00000170
 /*                                                                   */00000180
 /*  KONTROLLEN GIS FRA    REGISTRERINGSRUTINEN -R0010401- VED        */00000190
 /*  HJELP AV TRANSKODE R130.                                         */00000200
 /*  PROGRAMMET TAR IMOT OPPLYSNINGER FRA MENYEN FOR TILLEGGSBLANKETT */00000210
 /*  OG SENDER UT DET ØNSKEDE BILDE FOR REGISTRERING AV TG-BLANKETTEN.*/00000220
 /*  DERETTER BLIR KONTROLLEN OVERLATT TIL R0011301, SOM              */00000230
 /*  LESER AKTUELT BILDE OG KONTROLLERER OPPLYSNINGENE.               */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*PROGRAMTILKNYTTING:                                                */00000270
 /* ********************                                              */00000280
 /*  PROGRAMMETS TRANSKODE ER 'R130'                                  */00000290
 /*  PROGRAMMET FÅR KONTROLL VIA CICS/TRANSKODE FRA R0010401          */00000300
 /*  PROGRAMMET HAR EXEC      XCTL TIL                                */00000310
 /*                              R0010301 - VELG FUNKSJON             */00000320
 /*                              R0010401 - REGISTRERING              */00000330
 /*  PROGRAMMET GIR KONTROLL VIA CICS/TRANSKODE TIL R0011301          */00000340
 /*                                                                   */00000350
 /* ***************************************************************** */00000360
 /*FEILMELDINGER:                                                     */00000370
 /* *******************                                               */00000380
 /* GIR MELDING PÅ BILDE S001131 :                                    */00000390
 /*           'F E I L  H A R  O P P S T Å T T ! ! !.' !!             */00000400
 /*           'TRYKK "ENTER" OG PRØV PÅ NYTT.';                       */00000410
 /*  GIR MELDING VED FEIL KODE :                                      */00000420
 /*           S001131O.MELDINGO = 'UGYLDIG TILLEGGSKODE';             */00000430
 /*           EXEC CICS SEND MAP('S001131') MAPSET('S001133')         */00000440
 /*                                                                   */00000450
 /* ***************************************************************** */00000460
 R00113:                                                                00000470
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000480
 %PAGE;                                                                 00000490
      %INCLUDE S00113;     /*  TILLEGG TIL GRUNNBLANKETT MAPSETTET  */  00000500
 %PAGE;                                                                 00000510
      %INCLUDE P0019906;   /*  TRANS_OPPLYSNINGS_OMRÅDE (BASED)     */  00000520
 %PAGE;                                                                 00000530
      %INCLUDE P0019908;   /*  KOMMUNIKASJONSOMRÅDE (BASED)         */  00000540
 %PAGE;                                                                 00000550
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED)              */  00000560
 %PAGE;                                                                 00000570
      %INCLUDE P0019912;   /*  DIV_PARAM_OMR   (BASED)              */  00000580
 %PAGE;                                                                 00000590
   DCL                                                                  00000600
      (COMMAREA_PEKER,                                                  00000610
      BMSMAPBR) PTR;                                                    00000620
   DCL                                                                  00000630
      (ADDR,UNSPEC,CSTG) BUILTIN;                                       00000640
   DCL                                                                  00000650
      TG_KODE CHAR(2);                                                  00000660
   DCL                                                                  00000670
      FEIL_FUNNET  BIT (1),                                             00000680
      ONKODE PIC'9999',                                                 00000690
      CURSOR_POS FIXED BIN(15) INIT(-1),                                00000700
      ONK DEF ONKODE CHAR(4),                                           00000710
      FEILKODE       CHAR(4),                                           00000720
      DSNAVN         CHAR(8),                                           00000730
      ANT_FEIL_SKREVET FIXED DEC (3);                                   00000740
 %PAGE;                                                                 00000750
 %PAGE;                                                                 00000760
      ON ERROR SNAP BEGIN       ;                                       00000770
         ON ERROR SYSTEM        ;                                       00000780
         ONKODE=ONCODE          ;                                       00000790
         FEILKODE = ONK         ;                                       00000800
         DSNAVN   = EIBDS       ;                                       00000810
         GO TO FEILBEH          ;                                       00000820
      END;                                                              00000830
                                                                        00000840
 FEILKODE   = 'FEIL'    ;                                               00000850
 DSNAVN     = '        ';                                               00000860
                                                                        00000870
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00000880
                                                                        00000890
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000900
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000910
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000920
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_PEKER);  00000930
                                                                        00000940
      EXEC CICS RECEIVE MAP('S001131') MAPSET ('S001133') SET(BMSMAPBR);00000950
                                                                        00000960
      IF S001131I.FUNKSJONSKODEL > 0 THEN                               00000970
        DO;                                                             00000980
            FUNKSJONSKODE = S001131I.FUNKSJONSKODEI;                    00000990
            EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);       00001000
         END;                                                           00001010
                                                                        00001020
      IF S001131I.STYRE_KODEL > 0 THEN                                  00001030
         STYREKODE = S001131I.STYRE_KODEI;                              00001040
                                                                        00001050
      IF STYREKODE ^= 'TG' THEN                                         00001060
        TRANSKODE = 'R041';                                             00001070
      ELSE                                                              00001080
        DO;                                                             00001090
          TG_KODE = S001131I.TG_KODEI;                                  00001100
            SELECT(TG_KODE);                                            00001110
               WHEN('UP')                                               00001120
                  DO;                                                   00001130
                     EXEC CICS SEND MAP('S001132') MAPSET('S001133')    00001140
                     MAPONLY ERASE;                                     00001150
                     TRANSKODE = 'R131';                                00001160
                  END;                                                  00001170
               WHEN('EP')                                               00001180
                  DO;                                                   00001190
                     EXEC CICS SEND MAP('S001133') MAPSET('S001133')    00001200
                     MAPONLY ERASE;                                     00001210
                     TRANSKODE = 'R132';                                00001220
                  END;                                                  00001230
               WHEN('FB')                                               00001240
                  DO;                                                   00001250
                     EXEC CICS SEND MAP('S001134') MAPSET('S001133')    00001260
                     MAPONLY ERASE;                                     00001270
                     TRANSKODE = 'R133';                                00001280
                  END;                                                  00001290
                                                                        00001300
  /* TILLEGG 27.3.85  HL :                                         */   00001310
                                                                        00001320
               WHEN('AI')                                               00001330
                  DO;                                                   00001340
                     EXEC CICS SEND MAP('S001135') MAPSET('S001133')    00001350
                     MAPONLY ERASE;                                     00001360
                     TRANSKODE = 'R137';                                00001370
                  END;                                                  00001380
                                                                        00001390
  /* HIT 27.3.85  HL                                              */    00001400
                                                                        00001410
               OTHERWISE                                                00001420
                  DO;                                                   00001430
                     S001131O.MELDINGO = 'UGYLDIG TILLEGGSKODE';        00001440
                     EXEC CICS SEND MAP('S001131') MAPSET('S001133')    00001450
                     ERASE;                                             00001460
                     TRANSKODE = 'R130';                                00001470
                  END;                                                  00001480
            END;                                                        00001490
                                                                        00001500
          EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);        00001510
                                                                        00001520
        END;                                                            00001530
                                                                        00001540
      EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);             00001550
                                                                        00001560
  FEILBEH:                                                              00001570
                                                                        00001580
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                           00001590
     PROGRAM_ID = 'R0011304';                                           00001600
                                                                        00001610
     S001131O.MELDINGO =                                                00001620
              'F E I L  H A R  O P P S T Å T T ! ! !.' !!               00001630
              'TRYKK "ENTER" OG PRØV PÅ NYTT.';                         00001640
                                                                        00001650
                                                                        00001660
     EXEC CICS SEND MAP('S001131')                                      00001670
                                                 MAPSET('S001133');     00001680
                                                                        00001690
     EXEC CICS RECEIVE MAP('S001131')                                   00001700
                                    MAPSET('S001133') SET(BMSMAPBR);    00001710
                                                                        00001720
                                                                        00001730
     EXEC CICS SYNCPOINT ROLLBACK;                                      00001740
                                                                        00001750
                                                                        00001760
     TERMINERINGS_IND = 'F';                                            00001770
                                                                        00001780
     TRANSKODE  = 'R041';                                               00001790
                                                                        00001800
     EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);              00001810
                                                                        00001820
  ABEND:                                                                00001830
     EXEC CICS ABEND ABCODE(FEIL);                                      00001840
                                                                        00001850
                                                                        00001860
   END R00113;                                                          00001870
