 /*   SIST ENDRET PÅ PROD   2003.02.27 12.35.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.04.26 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.01.15 11.51.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.54.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 12.47.28 AV   JDA7339          */        
 /*       SIST ENDRET 04/05-98 10.27.44 AV   JDA7339                  */        
 /*       SIST ENDRET 28/11-97 09.52.30 AV   SPA7339                  */        
 R00104:                                                                        
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                          
 %SKIP;                                /*  */                                   
 /*****************PROGRAM ER DEL AV R0010401  ********************** */        
 /*IDENTIFIKASJON:                                                    */        
 /************************                                            */        
 /*  PROGRAM-IDENT : R001A401-REGISTRERING NYE BLANKETTER-HOVEDPROGR. */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  :                                                  */        
 /*  PROGRAMMET BLE DEL AV:  PATHAK                                   */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /******************************************************************* */        
 /*HENSIKT:*/                                                                   
 /************                                                        */        
 /*  PROGRAMMET ER FøRST DEL AV R0010401                              */        
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */        
 /*  OG SENDER UT DET FØRSTE BILDET AV DEN BLANKETTEN SOM SKAL        */        
 /*  REGISTRERES:                                                     */        
 /*    AP ---> MAP S001051 MAPSET S001053 - GRBL. ALDERSPENSJON       */        
 /*    UP ---> MAP S001061 MAPSET S001063 - GRBL. UFØREPENSJON        */        
 /*    US ---> MAP S001071 MAPSET S001073 - GRBL. UF/GR STØNAD        */        
 /*    EP ---> MAP S001081 MAPSET S001083 - GRBL. ETTERL. EKTEFELLE   */        
 /*    EF ---> MAP S001091 MAPSET S001093 - GRBL. ETTERL. FAM.PLEIER  */        
 /*    FB ---> MAP S001101 MAPSET S001103 - GRBL. FORELDREL. BARN     */        
 /*    BP ---> MAP S001111 MAPSET S001113 - GRBL. ETTERLATTE BARN     */        
 /*    FT ---> MAP S001121 MAPSET S001123 - GRBL. FORSØRGINGSTILLEGG  */        
 /*    TG ---> MAP S001131 MAPSET S001133 - TILLEGGSBLANKETTEN        */        
 /*    E1 ---> MAP S001141 MAPSET S001143 - ENDRINGSBLANKETT-1        */        
 /*    E2 ---> MAP S001151 MAPSET S001153 - ENDRINGSBLANKETT-2        */        
 /*    O1 ---> MAP S001161 MAPSET S001163 - OPPHØRSBLANKETT-1         */        
 /*    O2 ---> MAP S001171 MAPSET S001173 - OPPHØRSBLANKETT-2         */        
 /*    AU ---> MAP S001181 MAPSET S001183 - STYRT AUTOHENDELSE        */        
 /*    NI ---> MAP S001I04 MAPSET S001I43 - NYE INNTEKTER             */        
 /*    MK ---> MAP S001B01 MAPSET S001B03 - MEDISINSK KODE            */        
 /*    AF ---> MAP S001901 MAPSET S001193 - AVTALEFESTET FØRTIDSPENS. */        
 /*    UF ---> MAP S001831 MAPSET S001833 - UNGE UFØRE FØR 1967     . */        
 /*    XX ---> MAP S001013 MAPSET S001013 - INNHENTING FUNKSJONSKODE  */        
 /*                                                                   */        
 /******************************************************************* */        
 /*PROGRAMTILKNYTTING:*/                                                        
 /**********************                                              */        
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = R040 OG R041.  */        
 /*  R040: KONTROLLEN KOMMER FRA R0010301                             */        
 /*  R041: KONTROLLEN KOMMER FRA                                      */        
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAMMER AVHENGIG     */        
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN ELLER           */        
 /*  ETTER BLANKETTKONTROLLEN TRANSKODE SATT AV PROGRAMMENE:          */        
 /*  AP - ALDERSPENSJON    - R050 - R0010501                          */        
 /*  UP - UFØREPENSJON     - R060 - R0010601                          */        
 /*  US - GR/HJ STØNAD     - R070 - R0010701                          */        
 /*  EP - ETTERLATT EK     - R080 - R0010801                          */        
 /*  EF - ETTERLATT FP     - R090 - R0010901                          */        
 /*  FB - FORELDRELØSE BARN- R100 - R0011001                          */        
 /*  BP - ETTERLATTE  BARN - R110 - R0011101                          */        
 /*  FT - FORSØRGINGSTILL. - R120 - R0011201                          */        
 /*  TG - TILLEGGSBLANKETT - R130 - R0011301                          */        
 /*  E1 - ENDRINGSBLANK-1  - R140 - R0011401                          */        
 /*  E2 - ENDRINGSBLANK-2  - R150 - R0011501                          */        
 /*  O1 - OPPHØRSBLANK-1   - R160 - R0011601                          */        
 /*  O2 - OPPHØRSBLANK-2   - R170 - R0011701                          */        
 /*  AU - STYRT AUTOHEND   - R180 - R0011801                          */        
 /*  NI - NYE INNTEKTER    - R0I4 - R001????                          */        
 /*  MK - MEDISINSK KODE   - RB00 - R001B001                          */        
 /*  AF -AFP               - R190 - R0011901                          */        
 /*  UF -UNGE UFØRE FØR 1967 R183 - R0011831                          */        
 /*  UF - UNGE UF   FØR 1967 R183 - R0011831                          */        
 /*                          R042 - R0012001 -FEILFRI BLANKETT        */        
 /*                                                                   */        
 /******************************************************************* */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /*************************                                           */        
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */        
 /*                                                                   */        
 /******************************************************************* */        
 /*FEILMELDINGER:*/                                                             
 /*********************                                               */        
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */        
 /*  IKKE HAR GYLDIG VERDI                                            */        
 /*                                                                   */        
 /* ***************************************************************** */        
      %INCLUDE S00101;     /*  MENY            */                               
 %PAGE;                                                                         
      %INCLUDE S00105;     /*  ALDER MAPSETTET */                               
 %PAGE;                                                                         
      %INCLUDE S00106;     /*  UFØRE MAPSETTET */                               
 %PAGE;                                                                         
      %INCLUDE S00107;     /*  GR.ST./HJ.ST. MAPSETTET        */                
 %PAGE;                                                                         
      %INCLUDE S00108;     /*  ETTERLATT EKTEFELLE MAPSETTET  */                
 %PAGE;                                                                         
      %INCLUDE S00109;     /*  ETTERLATT FAMILIEPLEIER MAPSETTET   */           
 %PAGE;                                                                         
      %INCLUDE S00110;     /*  FORELDRELØSE BARN MAPSETTET    */                
 %PAGE;                                                                         
      %INCLUDE S00111;     /*  ETTERLATTE BARN MAPSETTET      */                
 %PAGE;                                                                         
      %INCLUDE S00112;     /*  FORSØRGINGSTILLEGG EKTF/BARN MAPSETTET */        
 %PAGE;                                                                         
      %INCLUDE S00113;     /*  TILLEGG TIL GRUNNBLANKETT MAPSETTET   */         
 %PAGE;                                                                         
      %INCLUDE S00114;     /*  ENDRINGSBLANKETT-1 MAPSETTET   */                
 %PAGE;                                                                         
      %INCLUDE S00116;     /*  OPPHØRSBLANKETT-1 MAPSETTET   */                 
 %PAGE;                                                                         
      %INCLUDE S00117;     /*  OPPHØRSBLANKETT-2 MAPSETTET   */                 
 %PAGE;                                                                         
      %INCLUDE S00118;     /*  STYRT AUTOHENDELSE - MAPSETTET   */              
 %PAGE;                                                                         
      %INCLUDE S00119;     /*  STYRT AFP          - MAPSETTET   */              
 %PAGE;                                                                         
      %INCLUDE S00121;     /*  STYRT YK KODE      - MAPSETTET   */              
 %PAGE;                                                                         
      %INCLUDE S00183;     /*  UNGE UFØRE FØR 1967- MAPSETTET   */              
 %PAGE;                                                                         
      %INCLUDE S001I4;     /*  REG-INNTEKT    MAPSETTET   */                    
 %PAGE;                                                                         
      %INCLUDE S001B0;     /*  MEDISINSK KODE  MAPSETTET  */                    
 %PAGE;                                                                         
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */                    
 %PAGE;                                                                         
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                            
 %PAGE;                                                                         
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */                       
 %PAGE;                                                                         
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */                      
 %PAGE;                                                                         
   /* %INCLUDE P0019959;       OMRAADE FOR FUNKTAB      */                      
 %PAGE;                                                                         
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */                      
 %PAGE;                                                                         
   DCL                                                                          
      (COMMAREA_PEKER,IDENT_PEKER,                                              
      BMSMAPBR)      PTR;                                                       
   DCL                                                                          
      IDENT_BIT BIT(32) BASED (IDENT_PEKER);                                    
   DCL                                                                          
       W01_IDENT          CHAR(05),                                             
       W01_CICSINFO       CHAR(16);                                             
   DCL W_MELD             CHAR (45);                                            
   DCL                                                                          
      (NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                                      
   DCL W_TERMINAL   CHAR (4)       ;                                            
   DCL DATO     PIC '(6)9' INIT (0);                                            
                                                                                
      ATK_KOM_PTR              =  ADDR(KOM_OMR.ATK_COM_OMR);                    
      DATO   =   KONV_HÅMD_ÅMD(DIV_PARAM_OMR.DATO_2000);                        
      W_TERMINAL    =  DIV_PARAM_OMR.TERMINAL_NR;                               
                                                                                
      SELECT(STYREKODE);                                                        
         WHEN('AP')                                                             
            DO;                                                                 
               TRANSKODE = 'R050';                                              
               ALLOCATE S001051O ;                                              
               S001051O.REGDATOO = DATO;                                        
               S001051O.TERMIDO    = W_TERMINAL;                                
               S001051O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* ALDERSPENSJON                                */               
               EXEC CICS SEND MAP('S001051') MAPSET('S001053')                  
                                             ERASE;                             
            END;                                                                
         WHEN('UP')                                                             
            DO;                                                                 
               TRANSKODE = 'R060';                                              
               ALLOCATE S001061O ;                                              
               S001061O.REGDATOO = DATO;                                        
               S001061O.TERMIDO    = W_TERMINAL;                                
               S001061O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* UFØREPENSJON                                 */               
               EXEC CICS SEND MAP('S001061') MAPSET('S001063')                  
                                             ERASE;                             
            END;                                                                
         WHEN('US')                                                             
            DO;                                                                 
               IF SUBSTR(DIV_PARAM_OMR.CICS_NAVN,1,4) = 'HELP'  THEN            
                  DO;                                                           
                      TRANSKODE = 'R070';                                       
                      ALLOCATE S001071O ;                                       
                      S001071O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;           
                                                                                
                     /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */         
                     /* GRUNNSTØNAD / HJELPESTØNAD   */                         
                       EXEC CICS SEND MAP('S001071') MAPSET('S001073')          
                                             ERASE ;                            
                  END;                                                          
               ELSE                                                             
                 DO;                                                            
                     ALLOCATE S001014O;                                         
                     S001014O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;            
                     S001014O.MELDINGO =                                        
                        '"US" BLLANKET MÅ REGISTERE MED "HELP" KODE ';          
                                                                                
                     S001014O.STYRE_KODEO = STYREKODE;                          
                     EXEC CICS SEND MAP('S001014')                              
                                                 MAPSET('S001013')              
                                                           ERASE;               
                     TRANSKODE = 'R040';                                        
                                                                                
                 END;                                                           
            END;                                                                
         WHEN('EP')                                                             
            DO;                                                                 
               TRANSKODE = 'R080';                                              
               ALLOCATE S001081O ;                                              
               S001081O.REGDATOO = DATO;                                        
               S001081O.TERMIDO    = W_TERMINAL;                                
               S001081O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* ETTERLATT EKTEFELLE                                */         
               EXEC CICS SEND MAP('S001081') MAPSET('S001083')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('EF')                                                             
            DO;                                                                 
               TRANSKODE = 'R090';                                              
               ALLOCATE S001091O ;                                              
               S001091O.TERMIDO    = W_TERMINAL;                                
               S001091O.REGDATOO = DATO;                                        
               S001091O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* ETTERLATT FAMILIEPLEIER                            */         
               EXEC CICS SEND MAP('S001091') MAPSET('S001093')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('FB')                                                             
            DO;                                                                 
               TRANSKODE = 'R100';                                              
               ALLOCATE S001101O ;                                              
               S001101O.TERMIDO    = W_TERMINAL;                                
               S001101O.REGDATOO = DATO;                                        
               S001101O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* FORELDRELØSE BARN                                  */         
               EXEC CICS SEND MAP('S001101') MAPSET('S001103')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('BP')                                                             
            DO;                                                                 
               TRANSKODE = 'R110';                                              
               ALLOCATE S001111O ;                                              
               S001111O.TERMIDO    = W_TERMINAL;                                
               S001111O.REGDATOO = DATO;                                        
               S001111O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* ETTERLATTE BARN, EN AV FORELDRENE ER DØDE          */         
               EXEC CICS SEND MAP('S001111') MAPSET('S001113')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('FT')                                                             
            DO;                                                                 
               TRANSKODE = 'R120';                                              
               ALLOCATE S001121O ;                                              
               S001121O.TERMIDO    = W_TERMINAL;                                
               S001121O.REGDATOO = DATO;                                        
               S001121O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* FORSØRGNINGSTILLEGG                                */         
               EXEC CICS SEND MAP('S001121') MAPSET('S001123')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('TG')                                                             
            DO;                                                                 
               TRANSKODE = 'R130';                                              
               ALLOCATE S001131O ;                                              
               S001131O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR TILLEGGS-           */         
               /* BLANKETTEN                                         */         
               EXEC CICS SEND MAP('S001131') MAPSET('S001133')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('E1')                                                             
            DO;                                                                 
               TRANSKODE = 'R140';                                              
               ALLOCATE S001141O ;                                              
               S001141O.TERMIDO    = W_TERMINAL;                                
               S001141O.REGDATOO = DATO;                                        
               S001141O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR ENDRINGS-           */         
               /* BLANKETT-1                                         */         
               EXEC CICS SEND MAP('S001141') MAPSET('S001143')                  
                                             ERASE ;                            
            END;                                                                
                                                                                
   /*    WHEN('E2')                                                             
                                                                                
       REGISTERING AV TKNR ER FLYTTET TIL R0010301                              
                                                                                
   */                                                                           
         WHEN('O1')                                                             
            DO;                                                                 
               TRANSKODE = 'R160';                                              
               ALLOCATE S001161O ;                                              
               S001161O.TERMIDO    = W_TERMINAL;                                
               S001161O.REGDATOO = DATO;                                        
               S001161O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR OPPHØRS-            */         
               /* BLANKETT-1                                         */         
               EXEC CICS SEND MAP('S001161') MAPSET('S001163')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('O2')                                                             
            DO;                                                                 
               TRANSKODE = 'R170';                                              
               ALLOCATE S001171O ;                                              
               S001171O.TERMIDO    = W_TERMINAL;                                
               S001171O.REGDATOO = DATO;                                        
               S001171O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR OPPHØRS-            */         
               /* BLANKETT-2                                         */         
               EXEC CICS SEND MAP('S001171') MAPSET('S001173')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('MK')                                                             
            DO;                                                                 
               TRANSKODE                 =  'RB00'        ;                     
               ALLOCATE S001B01O                          ;                     
               S001B01O.CICS_INFOO =         DIV_PARAM_OMR.CICS_NAVN ;          
                                                                                
               /*----------------------------------------------*/               
               /* SKRIVER REGISTRERINGSBILDE FOR                     */         
               /* MEDISINSK KODE                                     */         
               /*----------------------------------------------*/               
                                                                                
               EXEC CICS SEND MAP('S001B01') MAPSET('S001B03')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('AF')                                                             
            DO;                                                                 
               TRANSKODE                 =  'R190'        ;                     
               EXEC CICS LOAD PROGRAM('S001193');                               
               ALLOCATE S001191O                          ;                     
               S001191O.TERMIDO    = W_TERMINAL;                                
               S001191O.REGDATOO = DATO;                                        
               S001191O.CICS_INFOO =         DIV_PARAM_OMR.CICS_NAVN ;          
                                                                                
               /*----------------------------------------------*/               
               /* SKRIVER REGISTRERINGSBILDE FOR                     */         
               /* AFP                                                */         
               /*----------------------------------------------*/               
               S001191O.TT_F67A             = DFHBMPRO;                         
               S001191O.TT_E66_ÅA           = DFHBMPRO;                         
               S001191O.TT_E66_MA           = DFHBMPRO;                         
               S001191O.STATSBORGERA        = DFHBMPRO;                         
               S001191O.BOSATTA             = DFHBMPRO;                         
               S001191O.FRAVIK_FLYKTA = DFHBMPRO;                               
               S001191O.OVERKOMP_UTLA = DFHBMPRO;                               
               S001191O.FRAVIK_19_3A        = DFHBMPRO;                         
                                                                                
               EXEC CICS SEND MAP('S001191') MAPSET('S001193')                  
                                             ERASE ;                            
            END;                                                                
 /*UF*/        WHEN('UF')                                                       
            DO;                                                                 
               TRANSKODE                 =  'R183'        ;                     
               EXEC CICS LOAD PROGRAM('S001833');                               
               ALLOCATE S001831O                          ;                     
               S001831O.TERMIDO    = W_TERMINAL;                                
               S001831O.REGDATOO = DATO;                                        
               S001831O.CICS_INFOO =         DIV_PARAM_OMR.CICS_NAVN ;          
               S001831O.TERMIDO          =   DIV_PARAM_OMR.TERMINAL_NR;         
                                                                                
               /*----------------------------------------------*/               
               /* SKRIVER REGISTRERINGSBILDE FOR                     */         
               /* UNGE UFØRE FØR 1967                                */         
               /*----------------------------------------------*/               
               EXEC CICS SEND MAP('S001831') MAPSET('S001833')                  
                                             ERASE ;                            
            END;                                                                
         WHEN('YK')                                                             
            DO;                                                                 
               TRANSKODE = 'R210';                                              
               ALLOCATE S001211O ;                                              
        /*  BILDE HAR IKKE REGDATO OG TERMID............                        
               S001211O.REGDATOO = DATO;                                        
               S001211O.TERMIDO    = W_TERMINAL;                                
          */                                                                    
               S001211O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                  
                                                                                
               /* SKRIVER REGISTRERINGSBILDE FOR GRUNNBLANKETT */               
               /* ALDERSPENSJON                                */               
               EXEC CICS SEND MAP('S001211') MAPSET('S001213')                  
                                             ERASE;                             
            END;                                                                
         OTHERWISE                                                              
            DO;                                                                 
               TRANSKODE = 'R040';                                              
               RETURN                  ;                                        
            END;                                                                
      END;                                                                      
                                                                                
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                    
                                                                                
  %INCLUDE R0019988;                /* KONV_HÅMD_ÅMD   */                       
   /* %INCLUDE R0019998;             ATK  FEILMELD           */                 
  %INCLUDE R0019999;           /*  ATK_KONTROLL            */                   
 END R00104;                                                                    
