 /*   SIST ENDRET PÅ PROD   2008.11.05 16.25.03 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.09.21 11.08.04 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.08.16 12.28.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.08 13.20.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.31.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.07  8.52.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 13.15.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 14.26.10 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.19 11.46.50 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.16 14.01.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.24 11.43.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.05.30 10.35.10 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.05.16  9.00.37 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2001.07.27 12.15.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.06.01  8.35.52 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.27.20 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.04 14.41.34 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.03.20 13.23.29 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.18 11.47.44 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.11.16 13.55.45 AV   JDA7339          */        
 /*       SIST ENDRET 26/10-99 14.27.42 AV   JDA7339                  */        
 /*       SIST ENDRET 26/10-99 14.24.49 AV   JDA7339                  */        
 /*       SIST ENDRET 16/09-99 09.39.07 AV   JDA7339                  */        
 /*       SIST ENDRET 23/04-99 13.19.15 AV   JDA7339                  */        
 /*       SIST ENDRET 23/04-99 13.18.14 AV   JDA7339                  */        
 /*       SIST ENDRET 30/11-98 08.56.01 AV   JDA7339                  */        
 /*       SIST ENDRET 30/11-98 08.50.32 AV   JDA7339                  */        
 /*       SIST ENDRET 19/08-98 09.29.15 AV   TSB7339                  */        
 /*       SIST ENDRET 20/07-98 10.09.18 AV   JDA7339                  */        
 /*       SIST ENDRET 27/05-98 09.58.13 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0014401 - BEREGN_UFØREPENSJON - HOVEDPROG I PLI.             */        
 /*     PROGRAMMERER: TOM JØRGENSEN, JULI 82.                         */        
 /* HENSIKT                                                           */        
 /*     BEREGNE UFØREPENSJON.                                         */        
 /*     OPPDATERER UFØRPENS MED : BT, ET, ST OG KT                    */        
 /*     OPPDATERER STATUS   MED : SUM_YTELSE                          */        
 /* PROGRAMTILKNYTNING.                                               */        
 /*     PROSEDYREN BLIR LINKET FRA  R0014001 - BEREGNINGER.           */        
 /* ENDRING 9803 - HL:                                                */        
 /*     ATTFØRINGSPENGER - ÅRSBELØP  LEGGES INN I :                   */        
 /*         DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP                         */        
 /*         DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP                         */        
 /* ***************************************************************** */        
  R001440:                                                                      
   PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                         
 %PAGE;                                                                         
 /*   %INCLUDE P0010601    */                                                   
 %PAGE;                                                                         
 %INCLUDE P0019912;   /* DIV_PARAM_OMR */                                       
 %PAGE;                                                                         
 %INCLUDE P0019910;   /* STYRINGS_OMR */                                        
 %PAGE;                                                                         
 %INCLUDE P0019906;   /* TRANS_OPPL_OMR */                                      
 %PAGE;                                                                         
 %INCLUDE P0019908;   /* KOM_OMR        */                                      
 %PAGE;                                                                         
   DCL 1 W_B02,                                                                 
 %INCLUDE P0019921;                                                             
   DCL 1 B01 BASED (B01_PEKER),                                                 
 %INCLUDE P0019921;                                                             
 %PAGE;                                                                         
   DCL 1 B02 BASED (B02_PEKER),                                                 
 %INCLUDE P0019921;                                                             
 %INCLUDE P0019924;   /* GV_TAB_RE */                                           
 %PAGE;                                                                         
 %INCLUDE P0014009;   /* POTALL_OPPL */                                         
 %PAGE;                                                                         
 %INCLUDE P0014002;   /* W_POREKKE */                                           
 %INCLUDE P0014003;   /* TAB          */                                        
 %PAGE;                                                                         
 %INCLUDE P0019925;   /* G_TAB_RE      */                                       
 %PAGE;                                                                         
                                                                                
  DCL (ADDR,                                                                    
       CSTG,                                                                    
       DATE, MAX, MOD, FLOOR,                                                   
       HBOUND,                                                                  
       VERIFY)     BUILTIN;                                                     
                                                                                
  DCL                                                                           
      DATO         CHAR(8);                                                     
  DCL                                                                           
     1 DAGENS_DATO DEF DATO,                                                    
       2 ÅR        PIC'9999',                                                   
       2 MND       PIC'99',                                                     
       2 DAG       PIC'99';                                                     
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
   DCL COMMAREA_PEKER PTR;                                                      
   DCL                                                                          
     ( UF_IND,                                                                  
       I,                                                                       
       J          ) FIXED BIN (15) INIT (0);                                    
   DCL ST_FRADRAG   FIXED DEC (5);                                              
   DCL TT_EGEN      FIXED DEC (5);                                              
   DCL TT_EK        FIXED DEC (5);                                              
   DCL ÅFT_MAX      FIXED DEC (5) INIT(0);                                      
   DCL W_BT         FIXED DEC (5) INIT(0);                                      
   DCL TP_GARANTI1  FIXED DEC (7) INIT(0);                                      
   DCL TP_GARANTI   FIXED DEC (13,4) INIT(0);                                   
   DCL TP_GARANTI1_YP  FIXED DEC (7) INIT(0);                                   
   DCL TP_GARANTI_YP   FIXED DEC (13,4) INIT(0);                                
   DCL UFØR_FØR_73  CHAR (1) INIT (' ');   /*310392TS*/                         
   DCL S_KODE       PIC '9';                                                    
   DCL K            FIXED BIN (15);                                             
   DCL INDEX        FIXED BIN (15);                                             
                                                                                
   DCL 1 W,                                                                     
           2 TP     FIXED DEC (5),                                              
           2 TP1    FIXED DEC (5),                                              
           2 TP2    FIXED DEC (13,4);                                           
   DCL                                                                          
      1 FNR_R  ,                                                                
        2 DAG                   PIC '(2)9',                                     
        2 MND                   PIC '(2)9',                                     
        2 ÅR                    PIC '(2)9',                                     
        2 ÅRHUNDRE              PIC '9',                                        
        2 FILLER                PIC '(4)9',                                     
      1 W_FNR    DEF FNR_R     PIC      '(11)9';                                
                                                                                
    DCL 1 FNR_R13 ,                                                             
          2 DAG                   PIC '(2)9',                                   
          2 MND                   PIC '(2)9',                                   
          2 ÅR                    PIC '(4)9',                                   
          2 ÅRHUNDRE              PIC '9',                                      
          2 FILLER                PIC '(4)9',                                   
        1 W_FNR13  DEF FNR_R13     PIC      '(13)9';                            
                                                                                
   DCL PÅ_EK        FIXED DEC (3);                                              
                                                                                
   DCL SPT_GARANTI  FIXED DEC (3,2) INIT(0);        /*UF*/                      
                                                                                
    DCL W_BT2        FIXED DEC (5) INIT(0);                                     
 DCL W_FNR_EK           PIC'(11)9';                                             
 DCL ALDER_EK        FIXED DEC (5) INIT (0);      /*HL*/                        
 DCL W_DATO_ÅMD         PIC'(8)9';                          /*Y2K*/             
 DCL W_DATO_ÅM DEF W_DATO_ÅMD POS(1)  PIC'(6)9';                                
 DCL W_ÅR  DEF W_DATO_ÅMD POS(1)   PIC'9999';                                   
 DCL W_MN  DEF W_DATO_ÅMD POS(5)   PIC'99';                                     
 DCL W_DATO_MÅ          PIC'9999';                                              
 DCL GARANTITILLEGG     FIXED DEC (5) INIT (0);     /*HL*/                      
                                                                                
 DCL KAP11_UTLØST      CHAR (1)  INIT (' ');         /*TS*/                     
 DCL U_UFT_ÅMD         PIC '(8)9';                   /*Y2K*/                    
 DCL U_FNR              PIC '(11)9';                  /*TS*/                    
 DCL TT_KONVENSJON      PIC '99'     INIT (0);                                  
 DCL REDUKSJONSBELØP   FIXED DEC (5) INIT (0);                                  
                                                /*TRUDE,210292      */          
 DCL UP_GP_DEC         FIXED DEC(7,2) INIT (0), /*VED 50%YP + 50% GP*/          
     YP_GP_DEC         FIXED DEC(7,2) INIT (0),/*BLIR GP KR 1 FOR LITE*/        
     SUM_GP            FIXED DEC (5) INIT (0),                                  
     DIFF_GP           FIXED DEC (5) INIT (0);                                  
                                                                                
 DCL W_BOSATT            CHAR(1) INIT (' ');   /*200392 TRUDE */                
 DCL YRKE_ÅRSTP        FIXED DEC (7) INIT (0);                                  
 DCL W_INNTEKT_FØR     FIXED DEC (9) INIT (0); /* 190994 TRUDE */               
 DCL ALTERNATIV_ER_OPPDATERT CHAR(1) INIT (' ');                                
 DCL ALTERNATIV_SAVE   FIXED DEC (7) INIT (0);                                  
 DCL OPPH_ÅM                         PIC'(6)9';                                 
 DCL OPPH_ÅR DEF OPPH_ÅM POS(1)      PIC'(4)9';                                 
 DCL OPPH_MN DEF OPPH_ÅM POS(5)      PIC'(2)9';                                 
 DCL UFT_ÅRM                         PIC'(6)9';                                 
 DCL UFT_ÅR DEF UFT_ÅRM POS(1)       PIC'(4)9';                                 
 DCL UFT_MN DEF UFT_ÅRM POS(5)       PIC'(2)9';                                 
 DCL JA           BIT(1)  INIT ('1'B);                                          
 DCL SKAL_TESTES  BIT(1)  INIT ('0'B);                                          
 DCL  TP_UP                       FIXED DEC (5);                                
 DCL VAR_NULL            CHAR(1) INIT (' ');   /*200407 HL    */                
                                                                                
   DCL UFGRAD         FIXED DEC (3);                                            
   DCL FAKTOR         FIXED DEC (3) INIT (0);                                   
   DCL W_GP           FIXED DEC (15,5) INIT (0); /*200402 HL*/                  
   DCL Y_GP           FIXED DEC (15,5) INIT (0); /*200402 HL*/                  
                                                                                
                                                                                
 /* ********************************************************* */                
 /*    SLUTT PÅ DCL                                           */                
 /* ********************************************************* */                
                                                                                
 COMMAREA_PEKER           = ADDR(KOM_OMR);                                      
 KOM_OMR.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);                        
 DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) = 0;       /*  SP    */            
 DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = 0;                               
 DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP           = 0;                               
 DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP           = 0;                               
                                                                                
 IF TRANS_OPPL_OMR.BLANKETTYPE   = 'UP' THEN    /*NY0191TS*/                    
    CALL HENT_FRA_UP;                                                           
 ELSE                                                                           
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'U2' THEN    /*NY0191TS*/                 
       CALL HENT_FRA_U2;                                                        
 ELSE                                                                           
    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'U3' THEN    /*NY0194HL*/                 
       DO;                                                                      
          CALL HENT_FRA_U3;                                                     
          /* CALL BEREGN_INNTEKT_FØR_UP    R0014430 */                          
       END;                                                                     
                                                                                
 W_DATO_ÅMD = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;  /*9910*/                       
 /* W_DATO_ÅM  = B02.VIRK_DATO_ÅMD(BER_SØ_IND) / 100;  200010 */                
 W_FNR_EK  = B02.FNR(BER_EK_IND);                                               
 /*HL : */            ALDER_EK =  F_ALDER(W_FNR_EK,W_DATO_ÅMD);                 
                                                                                
 %PAGE;                                                                         
  IF FEIL_MELD_NR = 0 THEN /* AB 01.08.16 */                                    
      PROGRAM_ID    = 'R0014401';                                               
      W_FNR         = B02.FNR(BER_SØ_IND);                                      
      W_FNR13       = KONV_FNR11_FNR13(W_FNR);              /* 2000-3 */        
                                                                                
   DATO          = DATO_2000;                                                   
                                                                                
                                                                                
    /* ************************************************************** */        
    /* IKKE SAMMENSTØTENDE BEREGNING NÅR EK HAR 0 APD                 */        
    /* ************************************************************** */        
                                                                                
                                                                                
 /* ENDRET 20.1.88 HL - FRAPP 467 OG 556                         */             
                                                                                
                                                                                
    IF (B02.PENSJONSTYPE1(BER_EK_IND) = 'A' !                                   
        B02.PENSJONSTYPE1(BER_EK_IND) = 'K' ) &                                 
       B02.ALDERSP.APD  (BER_EK_IND) =  0      &                                
       B02.SUM_YTELSE   (BER_EK_IND) =  0      &           /*NY92*/             
       B02.KONV_P_KODE  (BER_EK_IND) ^= 'F'   THEN                              
       DO;                                                                      
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                                 
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';                                 
       END;                                                                     
    ELSE                                                                        
    IF (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                                   
        B02.PENSJONSTYPE1(BER_EK_IND) = 'Y' ) &                                 
       B02.UFØRPENS.UFG (BER_EK_IND) =  0      &                                
       B02.YRKEPENS.YUG (BER_EK_IND) =  0         THEN   /*200103*/             
       DO;                                                                      
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                                 
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';                                 
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          IF (B02.SIVILSTAND (BER_EK_IND) = 'G' !                               
              B02.SIVILSTAND (BER_EK_IND) = 'P' !   /*9710 HL*/                 
              B02.SIVILSTAND (BER_EK_IND) = 'W'  ) &                            
             B02.PENSJONSTYPE2(BER_EK_IND)  = 'P'   &                           
             B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P'    THEN                       
             DO;                                                                
                B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S';                           
                B02.PENSJONSTYPE2(BER_EK_IND)  = 'S';                           
  /*TATT BORT 9712 HL : */                                                      
  /*            IF B02.PENSJONSTYPE3(BER_EK_IND) = 'S' THEN                     
                   B02.PENSJONSTYPE2(BER_SØ_IND) = 'P';      */                 
             END;                                                               
       END;                                                                     
                                                                                
  /*0-PENSJONISTER SKAL IKKE HA PENSJONSTYPE2 = 'S'  0797 HL: */                
                                                                                
    IF B02.UFØRPENS.UFG (BER_SØ_IND) =  0      &                                
       B02.YRKEPENS.YUG (BER_SØ_IND) =  0      &                                
      (B02.PENSJONSTYPE2(BER_SØ_IND)  = 'S'  !     /*200103*/                   
       B02.PENSJONSTYPE2(BER_EK_IND)  = 'S'     )         THEN                  
       DO;                                                                      
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                                 
          B02.PENSJONSTYPE2(BER_EK_IND)  = 'P';                                 
       END;                                                                     
        /* TATT BORT 9712 HL :     */                                           
 /* IF B02.PENSJONSTYPE3(BER_EK_IND)  = 'S' &                                   
       B02.SIVILSTAND   (BER_SØ_IND)  = 'G'  THEN                               
       DO;                                                                      
          B02.PENSJONSTYPE2(BER_SØ_IND)  = 'P';                                 
       END;                                         */                          
                                                                                
    IF (KAP11_UTLØST   = 'J'                &                                   
        U_FNR          = B02.FNR(BER_SØ_IND))  THEN                             
           B02.PENSJONSTYPE2(BER_SØ_IND)  = ' ';                                
                                                                                
   UFGRAD = B02.UFØRPENS.UFG(BER_SØ_IND) -                                      
            B02.YRKEPENS.YUG(BER_SØ_IND);                                       
                                                                                
   IF UFGRAD < 0 THEN                                                           
      UFGRAD = 0;                                                               
                                                                                
    B02.GP_REDUKSJON_KODE(BER_SØ_IND) = ' ';                                    
    IF  B02.PENSJONSTYPE2 (BER_SØ_IND) = 'S'   THEN                             
       DO;                                                                      
          IF B02.SIVILSTAND(BER_SØ_IND)        = 'V'    THEN                    
             B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'X';                           
          ELSE                                                                  
          IF B02.SIVILSTAND(BER_SØ_IND)        = 'W'    THEN                    
             B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Y';                           
          ELSE                                                                  
             B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'J';                           
 /*TILLEGG 18.9.89 HL - LOVENDRING 7.2 NR 2 B - 2. SETNING UTGÅR*/              
                                                                                
          IF B01.PENSJONSTYPE2(BER_SØ_IND)    = 'S'    &                        
             B01.STATUS_KODE_HIST(BER_SØ_IND) = ' '    &                        
             B01.UFØRPENS.UFG    (BER_EK_IND) < 100    &                        
             B01.UFØRPENS.UFG    (BER_EK_IND) >   0    &                        
             B01.VIRK_DATO_ÅMD   (BER_SØ_IND) < 19900100 THEN /*2000-3*/        
                                                                                
             B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J';                    
                                                                                
 /*ENDRET 21.9.91 HL - NY SAMMENSTØTS REGEL NÅR UFG_EK ER 100/0 */              
                                                                                
          IF B02.UFØRPENS.UFG    (BER_EK_IND) = 100    !                        
             B02.UFØRPENS.UFG    (BER_EK_IND) =   0      THEN                   
             B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';                    
                                                                                
 /*HIT HL */                                                                    
                                                                                
          IF  (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                            
               B02.PENSJONSTYPE1(BER_EK_IND) = 'Y'  )   THEN                    
                                                                                
             DO;                                                                
                IF (B02.VIRK_DATO_ÅMD   (BER_SØ_IND) <1990100 !                 
                   B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J') THEN         
                                                                                
                   FAKTOR = B02.UFØRPENS.UFG(BER_EK_IND);                       
                                                                                
                ELSE                                                            
                                                                                
                   DO;                                                          
                      B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';           
                      FAKTOR = 100;                                             
                   END;                                                         
             END;                                                               
          ELSE                                                                  
             FAKTOR = 100;                                                      
      END;                                                                      
                                                                                
   ELSE    /*IKKE SAMMENSTØTS-BEREGNING */                                      
  /* I DISSE TILFELLENE SKAL GP IKKE REDUSERES : 9805 HL */                     
                                                                                
   IF ^(B02.PENSJON_FØR_9802(BER_SØ_IND) = 'J'   &                              
        B02.SIVILSTAND(BER_SØ_IND)       = 'V')  THEN                           
 DO;  /*TILLEGG 9805*/                                                          
   IF B02.PENSJONSTYPE1(BER_EK_IND) = 'K'  &                                    
      B02.SUM_YTELSE   (BER_EK_IND) > 0    &        /*9802 HL*/                 
      B02.SIVILSTAND           (BER_SØ_IND) ^= 'A'    &                         
      B02.SIVILSTAND           (BER_SØ_IND) ^= 'S'    & /*200310 HL*/           
      ALDER_EK < 6501       THEN                                                
      DO;                                                                       
         IF B02.ALDERSP.UTTAKSDATO_ÅMD(BER_EK_IND) > 19970900  THEN             
            DO;                                                                 
               FAKTOR= 100;                                                     
               DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';                  
               IF B02.SIVILSTAND(BER_SØ_IND)        = 'V'    THEN               
                  B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'X';                      
               ELSE                                                             
               IF B02.SIVILSTAND(BER_SØ_IND)        = 'W'    THEN               
                  B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Y';                      
               ELSE                                                             
                  B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'J';                      
            END;                                                                
         ELSE    /*REGLER FØR 9710 : */                                         
         IF B02.PENSJONSTYPE3(BER_EK_IND) = 'S'   THEN                          
            DO;                                                                 
               FAKTOR= 100;                                                     
               DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = 'K';                  
               IF B02.SIVILSTAND(BER_SØ_IND)        = 'V'    THEN               
                  B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'X';                      
               ELSE                                                             
               IF B02.SIVILSTAND(BER_SØ_IND)        = 'W'    THEN               
                  B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'Y';                      
               ELSE                                                             
                  B02.GP_REDUKSJON_KODE(BER_SØ_IND) = 'J';                      
            END;                                                                
      END;                                                                      
   ELSE                                                                         
      FAKTOR = 0;                                                               
 END; /*TILLEGG 9805*/                                                          
 /* FJERNET 200310 HL                                                           
 IF FAMILIE_SPLITTET_IND = JA THEN                                              
    DO;                                                                         
       FAKTOR = 0;                                                              
       DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) = ' ';                          
       B02.GP_REDUKSJON_KODE(BER_SØ_IND) = ' ';                                 
    END;                                                                        
  ************************* */                                                  
                                                                                
 /* PRØVER Å FLYTT ALLE KALL TIL GP ETTER TP BEREGNING , TRUDE*/                
                                                                                
 /*FLYTTET TIL 4421    9804 :     *******************                           
         W_GP         = 1 - 0.25 * (FAKTOR/100);                                
         W_GP         = W_GP * G;                                               
         W_GP         = W_GP * B02.YRKEPENS.YUG(BER_SØ_IND)/100;                
         IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                            
            B02.ALTERNATIV_GP(BER_SØ_IND) = W_GP + 0.5;                         
         B02.YRKEPENS.GP(BER_SØ_IND) = W_GP/12 + 0.5;                           
         YP_GP_DEC                   = W_GP/12;                                 
                                                                                
  **************************************************** */                       
                                                                                
   CALL BEREGN_TP_UP;       /*4422*/                                            
                                                                                
 /*YS  4424 SKAL BARE CALLES VED NY SKADE */                                    
 /*YS  TRANSTYPE9 = ENDRINGSBLANKETT      */                                    
                                                                                
                                                                                
         IF ((B02.YRKEPENS.YUG(BER_SØ_IND) >                                    
              B01.YRKEPENS.YUG(BER_SØ_IND)   )  &                               
              TRANS_OPPL_OMR.TRANSTYPE ^= 9    )       !                        
                                                                                
 /*TILLEGG 20.3.90 HL : */                                                      
                                                                                
             (B01.YRKEHIST.AÅI(BER_SØ_IND,1) ^=                                 
              B02.YRKEHIST.AÅI(BER_SØ_IND,1) )      THEN                        
                                                                                
            DO;                                                                 
               CALL BEREGN_POENG_AV_AÅI;      /*4424*/                          
               CALL BEREGN_TP_YP;             /*4425*/                          
            END;                                                                
                                                                                
                                                                                
         ELSE                                                                   
         IF  B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'     THEN                       
 /* ****************                                                            
             IF TRANS_OPPL_OMR.TRANSTYPE = 22 !                                 
                TRANS_OPPL_OMR.TRANSTYPE = 23 !                                 
                TRANS_OPPL_OMR.TRANSTYPE = 30 !                                 
                TRANS_OPPL_OMR.TRANSTYPE = 31 !                                 
                TRANS_OPPL_OMR.TRANSTYPE = 39 !                                 
                TRANS_OPPL_OMR.TRANSTYPE = 46 THEN                              
 *** */                                                                         
                                                                                
                CALL BEREGN_TP_YP;            /*4425*/                          
                                                                                
 /*ENDRET 13.9.89 HL - SPT/YPT    KAN ENDRES BL.A.VED TILSTÅELSE*/              
 /*                    AV POENGTILLEGG                          */              
                                                                                
         ELSE;                                                                  
                                                                                
 /*YS DET KAN LØNNE SEG Å FORETA FULL BEREGNING ETTER KAP 8 */                  
                                                                                
   IF UFGRAD > 0 THEN                                                           
         ALTERNATIV_SAVE = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;/*9804*/           
         W.TP = F_TP92((FNR_R13.ÅR),                                            
                       (G),                                                     
                       (B02.UFØRPENS.SPT(BER_SØ_IND)),                          
                       (B02.UFØRPENS.OPT(BER_SØ_IND)),                          
                       (B02.UFØRPENS.PÅ(BER_SØ_IND)),                           
                       (B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),                   
                       (B02.UFØRPENS.UFG(BER_SØ_IND)),                          
                        100,                                                    
                        'J'                                                     
                      );                                                        
                                                                                
      DO;                                                                       
                                                                                
         IF W.TP > (B02.UFØRPENS.TP(BER_SØ_IND) +                               
                    B02.YRKEPENS.TP(BER_SØ_IND))    THEN                        
                                                                                
            DO;                                                                 
               ALTERNATIV_ER_OPPDATERT = 'J';                                   
               B02.UFØRPENS.TP(BER_SØ_IND) = W.TP -                             
                           B02.YRKEPENS.TP(BER_SØ_IND);                         
            END;                                                                
         ELSE                                                                   
 /*9804*/   DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = ALTERNATIV_SAVE;                
      END;                                                                      
                                                                                
  /* ************************************************************** */          
  /* BEREGNINGSREGLENES PUNKT 1.5 SIER AT BÅDE TILLEGGSPENSJON      */          
  /* ETTER KAP. 8 OG 11 SKAL AVRUNDES HVER FOR SEG.  DETTE GIR      */          
  /* I PRAKSIS 1 KRONE MER I TILLEGGSPENSJON NÅR KAP. 8 -           */          
  /* ALTERNATIVET VELGES SOM DET BESTE ALTERNATIVET (ISTEDET FOR    */          
  /* ALTERNATIVET MED PAÅ).  VISER SEG BARE NÅR YP-GRADEN ER MINDRE */          
  /* ENN UP-GRADEN.  AVKLART I YRKESKADEMØTE 13.1.88.  ERIK.        */          
  /* ************************************************************** */          
                                                                                
   IF FEIL_MELD_NR > 0  THEN                                                    
      GO TO L999;                                                               
   ELSE                                                                         
      PROGRAM_ID = 'R0014401';                                                  
                                                                                
   IF (TRANSTYPE = 2   ! DIV_PARAM_OMR.REGN_1291 = '2' )                        
      & DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = ' '  /* J BETYR AT DET */             
         /*IKKE SKAL TESTES OM SISTE UFØRETIDSPUNKT LØNNER SEG.  */             
      & DIV_PARAM_OMR.REGN_1291 ^= '3'    /*PROG 3001 SETTER FELTET =3*/        
             /*NÅR DET IKKE SKAL FORETAS NY TEST PÅ BESTE UFTIDSPKT*/           
      & B02.PENSJONSTYPE3(BER_SØ_IND) ^= 'A'                                    
   /*TILLEGG 200408 HL FOR UTLØST YP : */                                       
       & B01.PENSJONSTYPE1(BER_SØ_IND) ^= 'G'                                   
       & B01.STATUS_KODE_HIST(BER_SØ_IND) = ' ' THEN                            
                                                                                
 /* VI MÅ UNDERSØKE OM DET ER FLER ENN ETT MULIG UFØRETIDSPUNKT.      */        
 /* (DEN NYE UFØREPERIODEN ER LAGT INN).                              */        
      DO;                                                                       
                                                                                
         IF B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,2) > 0 THEN /* 2000-3 */            
            DO;                                                                 
               DO J = 2 TO 7;         /*0697 HL*/                               
               IF B02.UFØRHIST.OPPHØRSDATO_ÅMD(BER_SØ_IND,J) = 0 THEN           
                  DO;                                                           
             OPPH_ÅM =                                                          
               B02.UFØRHIST.OPPHØRSDATO_ÅMD(BER_SØ_IND,(J-1))/100;              
             UFT_ÅRM =  B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,J)/100;                 
             IF (OPPH_ÅM = UFT_ÅRM)  &                                          
                  ((B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,J) > 19970400 ) !           
                   (B02.UFØRHIST.UFG(BER_SØ_IND,(J-1)) >= 50))    THEN          
                 SKAL_TESTES = JA;                                              
                                                                                
 /*YS : OPPDATERING AV GAMMEL UFØREPENSJON ER IKKE AKTUELL FOR      */          
 /*YS : GRADER UNDER 50  (KAP11-PENSJON)                            */          
                                                                                
              IF SKAL_TESTES = JA               THEN                            
                       DO;                                                      
         ALTERNATIV_SAVE = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;                   
      /*                 IF B01.UFØRPENS.SPT_1291(BER_SØ_IND) >                 
                            B01.UFØRPENS.SPT(BER_SØ_IND)     THEN               
                                                                                
                            W.TP = F_TP92(FNR_R13.ÅR,G,                         
                                  (B01.UFØRPENS.SPT_1291(BER_SØ_IND)),          
                                  (B01.UFØRPENS.OPT_1291(BER_SØ_IND)),          
                                  (B01.UFØRPENS.PÅ_1291(BER_SØ_IND)),           
                                  (B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),        
                                  (B02.UFØRPENS.UFG(BER_SØ_IND)),               
                                  100,'J');                                     
                                                                                
                         ELSE    ************************ */                    
                                                                                
  /*FOR Å BEHANDLE PENSJON SOM HAR VÆRT STOPPET. 200401 HL :*/                  
                                                                                
             IF B01.UFØRPENS.UFG(BER_SØ_IND) = 0       THEN                     
                DO;                                                             
                       VAR_NULL = 'J';                                          
        /*             B01_B02_IND = 2;          */                             
  /*REMEDY 479*/       B01_B02_IND = 1; /*200407 HL */                          
                       POTALL_OPPL.IND  = BER_SØ_IND;                           
                       EXEC CICS LINK PROGRAM ('R0014141')                      
                                          COMMAREA (KOM_OMR);                   
                       IF B02.UFT_ÅMD(BER_SØ_IND,(J-1)) < 19920000 THEN         
                          POREKKE.PÅ_ETTER91(BER_SØ_IND) = 0;                   
                       W.TP    = F_TP92(FNR_R13.ÅR,G,                           
                                 POREKKE.SPT(BER_SØ_IND),                       
                                 POREKKE.OPT(BER_SØ_IND),                       
                                 POREKKE.PÅ (BER_SØ_IND),                       
                                 POREKKE.PÅ_ETTER91(BER_SØ_IND),                
                                 (B02.UFØRPENS.UFG(BER_SØ_IND)),                
                                  100,'J');                                     
                END;                                                            
             ELSE                                                               
  /*200401 HIT *************************** */                                   
                                                                                
                            W.TP = F_TP92(FNR_R13.ÅR,G,                         
                                 (B01.UFØRPENS.SPT(BER_SØ_IND)),                
                                 (B01.UFØRPENS.OPT(BER_SØ_IND)),                
                                 (B01.UFØRPENS.PÅ(BER_SØ_IND)),                 
                         (B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),                 
                                 (B02.UFØRPENS.UFG(BER_SØ_IND)),                
                                  100,'J');                                     
                                                                                
 /*ENDRING 22.11.89 HL : */                                                     
                                                                                
                         W.TP1 = F_TP92(FNR_R13.ÅR,G,                           
                                 (B02.UFØRPENS.SPT(BER_SØ_IND)),                
                                 (B02.UFØRPENS.OPT(BER_SØ_IND)),                
                                 (B02.UFØRPENS.PÅ(BER_SØ_IND)),                 
                         (B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),                 
                                 (B02.UFØRPENS.UFG(BER_SØ_IND)),                
                                  100,'J');                                     
                                                                                
            DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = ALTERNATIV_SAVE;                
                         IF W.TP >= W.TP1              THEN                     
                                                                                
 /*HIT 22.11.89 HL */                                                           
                                                                                
 /* GAMMELT UFØRETIDSPUNKT LØNNER SEG.                                */        
                            DO;                                                 
                               B02.UFØRPENS.TP(BER_SØ_IND)  = W.TP;             
  /*REMEDY 479 : */                                                             
                                                                                
           IF VAR_NULL = 'J'        THEN                                        
              DO;                                                               
                               B02.UFØRPENS.SPT(BER_SØ_IND) =                   
                                 POREKKE.SPT(BER_SØ_IND);                       
                               B02.UFØRPENS.OPT(BER_SØ_IND) =                   
                                 POREKKE.OPT(BER_SØ_IND);                       
                               B02.UFØRPENS.PÅ(BER_SØ_IND)  =                   
                                 POREKKE.PÅ (BER_SØ_IND);                       
                               B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)  =           
                                 POREKKE.PÅ_ETTER91(BER_SØ_IND);                
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                               B02.UFØRPENS.SPT(BER_SØ_IND) =                   
                                        B01.UFØRPENS.SPT(BER_SØ_IND);           
                               B02.UFØRPENS.OPT(BER_SØ_IND) =                   
                                        B01.UFØRPENS.OPT(BER_SØ_IND);           
                               B02.UFØRPENS.PÅ(BER_SØ_IND)  =                   
                                        B01.UFØRPENS.PÅ(BER_SØ_IND);            
                               B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)  =           
                                B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND);            
              END;                                                              
  /*4423*/                    CALL OPPDATER_GAMMEL_UFØRHISTORIKK;               
                              IF FEIL_MELD_NR > 0 THEN                          
                                 J = 7;        /*0697 HL*/                      
                                                                                
 /*TILLEGG 120589 - HL*/      CALL BEREGN_TP_UP;       /*4422*/                 
                                                                                
         IF  B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'     THEN                       
                                                                                
                CALL BEREGN_TP_YP;            /*4425*/                          
                                                                                
                            END;                                                
                        END;                                                    
                    J = 7;        /*0697 HL*/                                   
                  END;    /*OPPHØRSDATO = 0 */                                  
             END;   /* J = 2 TO 7 */                                            
           END;  /* UFT > 0 */                                                  
      END;   /* TRANSTYPE = 2 & PENSJONSTYPE3 ^= A */                           
                                                                                
   ELSE         /*200204 HL*/                                                   
   IF ((TRANSTYPE = 22 )    /*INNTEKTSENDRING*/    &                            
        ( DIV_PARAM_OMR.INTENDR_ÅR        > 1991                                
          & DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = ' '                               
          & DIV_PARAM_OMR.REGN_1291 ^= '3'                                      
          & B02.PRO_RATA_BEREGNING(BER_SØ_IND) ^= 'J'                           
          & B02.PENSJONSTYPE3(BER_SØ_IND) ^= 'A'        )) !                    
      ((TRANSTYPE = 31 )     /*UNG UFØR*/          &                            
        ( DIV_PARAM_OMR.INTENDR_ÅR        > 1991))        THEN                  
                                                                                
 /* VI MÅ SJEKKE OM DETTE PÅVIRKER VALG AV BESTE UFØRETIDSPUNKT.      */        
                                                                                
   DO;                                                                          
      TP_UP = B02.UFØRPENS.TP(BER_SØ_IND);                                      
      CALL FINN_BESTE_UFT(TP_UP); /*4410*/                                      
      B02.UFØRPENS.TP(BER_SØ_IND) = TP_UP;                                      
   END;                                                                         
                                                                                
             /*-------------------------------------------------------*/        
             /*----------PENSJON UTLAND-------------------------------*/        
             /*NÅ HAR VI ENDELIG FÅTT REGNET UT ANTALL POENGÅR.       */        
             /*DERSOM ANTALL POENGÅR > TT_ANV SÅ SKAL DENNE BRUKES TIL*/        
             /*Å REGNE GRUNNPENSJON ETTER. - TRUDE 0990---------------*/        
             /*-------------------------------------------------------*/        
                                                                                
   IF B02.SPESOPPL.BOSATT(BER_SØ_IND) > 0  &                                    
      B02.VIRK_DATO_ÅMD(BER_SØ_IND) <  19910100 THEN  /* 2000 */                
                                                                                
      CALL BEREGN_GP_UP_UTLAND; /* 4482-NYTT PROGRAM               */           
   ELSE                                                                         
      CALL BEREGN_GP_UP;         /*4421*/                                       
                                                                                
                                                                                
             /*-------------------------------------------------------*/        
             /* GRUNNPENSJON BLE KR 1 FOR LITE VED 50%UP + 50% YP     */        
             /* TRUDE, 21.02.92                                       */        
             /*-------------------------------------------------------*/        
       SUM_GP   = UP_GP_DEC  + YP_GP_DEC + 0.5;                                 
       DIFF_GP  = SUM_GP - (B02.UFØRPENS.GP(BER_SØ_IND) +                       
                            B02.YRKEPENS.GP(BER_SØ_IND));                       
       IF ( DIFF_GP  > 0  &                                                     
            B02.IKKE_GP(BER_SØ_IND) ^= 'J') THEN                                
           B02.UFØRPENS.GP(BER_SØ_IND) =                                        
                          B02.UFØRPENS.GP(BER_SØ_IND) + DIFF_GP;                
       ELSE                                                                     
           DIFF_GP  = 0 ;                                                       
                                                                                
             /*-------------------------------------------------------*/        
             /* HER SKAL VI SE OM GARANTIEN FOR UNGE UFØRE FØR 1967   */        
             /* SLÅR TIL. TRUDE, 28.06.89                             */        
             /*-------------------------------------------------------*/        
             /* PGA ENDRING AV ALDERSGRENSE 0592 TIL 24 ÅR.           */        
             /* MÅ HA MED TEST PÅ ALDER. TRUDE 200892                 */        
             /*-------------------------------------------------------*/        
                                                                                
   /*0697 HL:*/                                                                 
   DO K = 7 TO 1 BY -1 UNTIL(B02.UFØRHIST.BUP_GAR_KODE(BER_SØ_IND,K)            
                                                  ^= ' ');                      
      S_KODE   = K;                                                             
   END;                                                                         
                                                                                
   DCL TEST_KODE CHAR(1) INIT (' ');                                            
   TEST_KODE =                                                                  
              B02.BUP_GAR_KODE(BER_SØ_IND,S_KODE);                              
                                                                                
   IF B02.BUP_GAR_KODE(BER_SØ_IND,1)  =   'E'   &                               
      B02.VIRK_DATO_ÅMD(BER_SØ_IND)   >  19890600   THEN                        
                                                                                
  /*ENDRET 9708 HL : */                                                         
                                                                                
     DO;  /*VIRK 8907 - 9012 :*/                                                
        IF B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19910000  THEN                       
           DO;                                                                  
              SPT_GARANTI  = 1.6;                                               
           END;                                                                 
        ELSE /*VIRK 9101-9112 :*/                                               
        IF B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19920100        THEN                 
           DO;                                                                  
              IF FNR_R13.ÅR   =  1923  !                                        
                 FNR_R13.ÅR   =  1924  THEN                                     
                 SPT_GARANTI  = 1.6;                                            
              ELSE                                                              
                 SPT_GARANTI  = 2;                                              
           END;                                                                 
        ELSE  /*VIRK 9201 - 9204: */                                            
        IF B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19920500         THEN                
           DO;                                                                  
              IF  FNR_R13.ÅR   = 1925  THEN                                     
                  SPT_GARANTI  = 2;                                             
              ELSE                                                              
              IF  FNR_R13.ÅR  >  1925  &                                        
                  FNR_R13.ÅR  <  1945  THEN                                     
                  SPT_GARANTI  = 2.5;                                           
              ELSE                                                              
              IF FNR_R13.ÅR   =  1923  !                                        
                 FNR_R13.ÅR   =  1924  THEN                                     
                 SPT_GARANTI  = 1.6;                                            
           END;                                                                 
        ELSE  /*VIRK 9205 - 9704: */                                            
        IF B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19970500     THEN                    
           DO;                                                                  
              IF  FNR_R13.ÅR   = 1925  THEN                                     
                  SPT_GARANTI  = 2;                                             
              ELSE                                                              
                  SPT_GARANTI  = 3;                                             
           END;                                                                 
        ELSE  /*VIRK ETTER 9704 : */                                            
        IF B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 20080500     THEN                    
           IF FNR_R13.ÅR > 1930        THEN                                     
              SPT_GARANTI  = 3.3;                                               
           ELSE                                                                 
              SPT_GARANTI  = 3;                                                 
        ELSE  /*VIRK ETTER 0804 : */                                            
           IF FNR_R13.ÅR > 1940        THEN                                     
              SPT_GARANTI  = 3.5;                                               
           ELSE                                                                 
              SPT_GARANTI  = 3.3;                                               
                                                                                
        TP_GARANTI  = ( SPT_GARANTI * 0.45 * G );                               
        TP_GARANTI  = TP_GARANTI / 100  ;                                       
        TP_GARANTI  = TP_GARANTI * B02.TT_ANV(BER_SØ_IND);                      
        TP_GARANTI  = TP_GARANTI * UFGRAD;                                      
        TP_GARANTI  = TP_GARANTI / ( 40 * 12) ;                                 
        TP_GARANTI1 = TP_GARANTI + 0.5;                                         
                                                                                
          IF TP_GARANTI1 > B02.UFØRPENS.TP(BER_SØ_IND)  THEN                    
             DO;                                                                
                B02.UFØRPENS.TP(BER_SØ_IND)   = TP_GARANTI1;                    
                B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = 'E';                      
             END;                                                               
          IF B02.PENSJONSTYPE1(BER_SØ_IND)  = 'Y' THEN                          
            DO;                                                                 
               TP_GARANTI_YP = ( SPT_GARANTI * 0.45 * G );                      
               TP_GARANTI_YP = TP_GARANTI_YP / 100 ;                            
               TP_GARANTI_YP = TP_GARANTI_YP                                    
                                        * B02.TT_ANV(BER_SØ_IND);               
               TP_GARANTI_YP = TP_GARANTI_YP                                    
                                 * B02.YRKEPENS.YUG(BER_SØ_IND);                
               TP_GARANTI_YP = TP_GARANTI_YP / ( 40 * 12) ;                     
               TP_GARANTI1_YP = TP_GARANTI_YP + 0.5;                            
             IF TP_GARANTI1_YP > B02.YRKEPENS.TP(BER_SØ_IND) THEN               
               DO;                                                              
                 B02.YRKEPENS.TP(BER_SØ_IND) = TP_GARANTI1_YP;                  
                 B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = 'E';                      
               END;                                                             
            END;                                                                
      END;                                                                      
                                                                                
                                                                                
   IF FEIL_MELD_NR > 0 THEN                                                     
      GO TO L999;                                                               
   ELSE                                                                         
      PROGRAM_ID = 'R0014401';                                                  
                                                                                
                                                                                
   CALL BEREGN_BT(W_BT,                        /*4233*/                         
                 UFGRAD);                                                       
           B02.UFØRPENS.BT (BER_SØ_IND) = W_BT;                                 
                                                                                
   CALL BEREGN_BT(W_BT2,                       /*4233*/                         
                 (B02.YRKEPENS.YUG(BER_SØ_IND)));                               
           B02.YRKEPENS.BT (BER_SØ_IND) = W_BT2;                                
                                                                                
   UF_IND = 1;                                                                  
                                                                                
   DO J = 2 TO 7;         /*0697 HL*/                                           
     IF (B02.UFT_ÅMD(BER_SØ_IND,J) = 0 & B02.UFT_ÅMD(BER_SØ_IND,J-1)            
                                                            > 0) THEN           
                                                                                
 /* FINN INDEKSEN TIL 'UF_IND' FOR SISTE UFØRHIST-SEGMENT.            */        
                                                                                
        UF_IND = J - 1;                                                         
   END;                                                                         
                                                                                
 /*DET ER IKKE LAGT INN BEREGNING AV ÅFT FOR YRKESSKADE : */                    
                                                                                
    IF (B02.UFT_ÅMD(BER_SØ_IND,UF_IND) < 19730700     &                         
    /*  B02.GARANTIGRAD  (BER_SØ_IND) = 0             &                         
        NULLA UT 150502 MARTIN SE SYSLOGG 81 */                                 
        B02.PENSJONSTYPE1(BER_SØ_IND) = 'U'    )  THEN                          
                                                                                
       CALL ÅFT_TILLEGG((B02.UFØRPENS.ÅFT(BER_SØ_IND)),ÅFT_MAX,UF_IND);         
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
                                                                                
                   ÅFT_MAX = 0;                                                 
 /* 7.6.84 HL. */  B02.UFØRPENS.ÅFT(BER_SØ_IND) = 0;                            
                                                                                
       END;                                                                     
                                                                                
 /* ************************************************************** */           
 /* ET OG ST BARE FOR UFG >= 50 %                                  */           
 /* ************************************************************** */           
                                                                                
           B02.UFØRPENS.ET(BER_SØ_IND) = 0;                                     
                                                                                
           IF (B02.UFØRPENS.UFG(BER_SØ_IND) >= 50)  !                           
              (B02.VIRK_DATO_ÅMD(BER_SØ_IND) > 19970400 &                       
               (B02.UFØRHIST.UFG(BER_SØ_IND,1) > 49 !                           
               B02.PENSJONSTYPE1(BER_SØ_IND) = 'U'))  THEN                      
              DO;                                                               
                                                                                
                IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'F' THEN                     
                   DO;                                                          
  /*LOVENDRING OM BEHOVSPRØVET FORSØRGINGSTILLEGG FRA 1.5.91 :*/                
  /* SÅ SNART DET SKAL BEREGNES MED HØYERE GRUNNBELØP ENN     */                
  /* PR 30.4.91, SÅ SKAL ALL BEREGNING SKJE I R0014011        */                
                                                                                
                     IF G > 34100 THEN                                          
                        DO;                                                     
                           B02.UFØRPENS.ET(BER_SØ_IND) = 0;                     
      /*HL*/            IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) ^= 'J' THEN         
                            B02.FT_SKAL_BEREGNES(BER_SØ_IND) = 'N';             
                        END;                                                    
                      ELSE                                                      
                         B02.UFØRPENS.ET(BER_SØ_IND) =                          
                            0.5 * G * B02.TT_ANV(BER_SØ_IND) *                  
                            B02.UFØRPENS.UFG(BER_SØ_IND) /                      
                            (12 * 40 * 100) + 0.5;                              
                                                                                
                      IF (ALDER_EK       >= 6000 &                              
                          W_DATO_ÅM      >  198903 &          /*Y2K*/           
                          W_DATO_ÅM      <  199100)   !       /*Y2K*/           
                         (ALDER_EK       >= 6001 &                              
                          W_DATO_ÅM      >  199100)     THEN  /*Y2K*/           
                                                                                
                         B02.UFØRPENS.ST(BER_SØ_IND)                            
                                  = F_BEREGN_SÆRTILLEGG(                        
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),              
                                    ÅFT_MAX,'J',                                
                                    (ST_PROSENT_SAMST * 2),                     
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),             
                                    (B02.TT_ANV(BER_SØ_IND)));                  
                      ELSE                                                      
                                                                                
                          B02.UFØRPENS.ST(BER_SØ_IND)                           
                                  = F_BEREGN_SÆRTILLEGG(                        
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),              
                                    ÅFT_MAX,'J',                                
                                    (ST_PROSENT_ENSLIG),                        
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),             
                                    (B02.TT_ANV(BER_SØ_IND)));                  
                                                                                
                      /* TILLEGGSTEST 21.03.94. REGELENDR 0194 */               
                      /* BLE TIDL. TAKLET I 4010. TRUDE        */               
                      /* FJERNES 240594           TRUDE        */               
                                                                                
                      /* NB! PGM ER LAGT OVER MED KOMMENTAR PÅ */               
                      /* NEDENST. TEST. TRUDE 030694           */               
                      IF  ALDER_EK       >= 6001 &                              
                          W_DATO_ÅM      >  199400 THEN       /*Y2K*/           
                                                                                
                         B02.UFØRPENS.ST(BER_SØ_IND)                            
                                  = F_BEREGN_SÆRTILLEGG(                        
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),              
                                    ÅFT_MAX,'J',                                
                                    (ST_PROSENT_ENSLIG * 2),                    
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),             
                                    (B02.TT_ANV(BER_SØ_IND)));                  
                                                                                
                   END;                                                         
                ELSE                                                            
                                                                                
                   IF( B02.PENSJONSTYPE2(BER_SØ_IND) = 'S')  &                  
                     ^( B02.PENSJONSTYPE3(BER_EK_IND) = 'K') &                  
                     ^( B02.PENSJONSTYPE3(BER_EK_IND) = 'S')  THEN              
                                                                                
 /*ANNA RIBE HAR FASTLAGT REGNEREGEL I NOTAT AV 8.10.99*/                       
                                                                                
                      B02.UFØRPENS.ST(BER_SØ_IND)                               
                                  = F_BEREGN_SÆRTILLEGG(                        
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),              
                                    ÅFT_MAX,'J',                                
                                    (ST_PROSENT_SAMST),                         
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),             
                                    (B02.TT_ANV(BER_SØ_IND)));                  
                   ELSE                                                         
                                                                                
                       B02.UFØRPENS.ST(BER_SØ_IND)                              
                                  = F_BEREGN_SÆRTILLEGG(                        
                                    (B02.UFØRPENS.TP(BER_SØ_IND)),              
                                    ÅFT_MAX,'J',                                
                                    (ST_PROSENT_ENSLIG),                        
                                    (B02.UFØRPENS.UFG(BER_SØ_IND)),             
                                    (B02.TT_ANV(BER_SØ_IND)));                  
                                                                                
              END;                                                              
                                                                                
                                                                                
                                                                                
 /* **************************************************************** */         
 /* PENSJON UTLAND. DERSOM TT-F67 > 0 OG TT-E66 < 3 ,KODE 19-3= 1(NY)*/         
 /* I ALLE ANDRE TILFELLE ,19-3 KODE= 0 , RETT TIL SÆRTILLEGG ETTER  */         
 /* SAMME TT SOM GRUNNPENSJON ER REGNET ETTER. TRUDE 01.03.90        */         
 /* **************************************************************** */         
                                                                                
         IF B02.TT_FØR_1967(BER_SØ_IND)    > 0    &                             
           ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12   < 3 ) THEN              
            DO;                                                                 
               IF  B02.FRAVIK_19_3  (BER_SØ_IND)  = '1'  THEN                   
                   B02.UFØRPENS.ST(BER_SØ_IND)    = 0;                          
            END;                                    /* TIL HIT TRUDE */         
                                                                                
                                                                                
   IF (KAP11_UTLØST = 'J'     &                                                 
       U_FNR = B02.FNR(BER_SØ_IND)) THEN                                        
      DO;                                                                       
          ÅFT_MAX                       = 0;                                    
          B02.UFØRPENS.ÅFT(BER_SØ_IND)  = 0;                                    
      END;                                                                      
                                                                                
   IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'A')    !      /*DAGPENGER*/             
      (B02.PENSJONSTYPE3(BER_SØ_IND) = 'A')      THEN                           
      B02.UFØRPENS.ST(BER_SØ_IND) = 0;                                          
                                                                                
                                                                                
  /* ************************************************************* */           
  /* HVIS TILLEGGSPENSJONEN ER BEREGNET UT FRA PAÅ, SÅ VIL DET     */           
  /* KUNNE BLI REGNET SÆRTILLEGG.  DET MÅ DERFOR TESTES PÅ OM      */           
  /* BÅDE UP-TP OG YP-TP SAMLET OVERSTIGER SÆRTILLEGGET.           */           
  /* TESTEN PÅ OM UP-TP ER STØRRE ENN ST. GJØRES ANNET STED.       */           
  /* ERIK.                                                         */           
  /* ************************************************************* */           
                                                                                
                                                                                
             IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'   THEN                      
                DO;                                                             
                   B02.UFØRPENS.ST(BER_SØ_IND) =                                
                   B02.UFØRPENS.ST(BER_SØ_IND) -                                
                               B02.YRKEPENS.TP(BER_SØ_IND);                     
                   IF B02.UFØRPENS.ST(BER_SØ_IND) < 0 THEN                      
                      B02.UFØRPENS.ST(BER_SØ_IND) = 0;                          
                END;                                                            
                                                                                
                                                                                
        IF B02.UFØRPENS.UFG(BER_SØ_IND) < 50 THEN                               
           B02.UFØRPENS.KT(BER_SØ_IND) = 0;                                     
        ELSE                                                                    
                                                                                
                                                                                
      B02.UFØRPENS.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(              
                                    B02.PENSJONSTYPE1(BER_SØ_IND),              
                                    B02.PENSJONSTYPE2(BER_SØ_IND),              
                                    B02.TT_ANV(BER_SØ_IND),0,1,'J');            
                                                                                
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                            
                                                                                
  IF G > 34100 THEN                                                             
     IF B02.UFØRPENS.KT(BER_SØ_IND) > B02.UFØRPENS.ST(BER_SØ_IND) THEN          
        B02.UFØRPENS.KT(BER_SØ_IND) =                                           
        B02.UFØRPENS.KT(BER_SØ_IND) - B02.UFØRPENS.ST(BER_SØ_IND);              
     ELSE                                                                       
        B02.UFØRPENS.KT(BER_SØ_IND) = 0;                                        
                                                                                
   B02.SUM_YTELSE(BER_SØ_IND) = B02.UFØRPENS.GP(BER_SØ_IND)    +                
                                  B02.UFØRPENS.ST(BER_SØ_IND)  +                
                                  B02.UFØRPENS.BT(BER_SØ_IND)  +                
                                  B02.UFØRPENS.KT(BER_SØ_IND)  +                
                                  B02.UFØRPENS.ET(BER_SØ_IND)  +                
                                  B02.UFØRPENS.TP(BER_SØ_IND)  +                
                                  B02.UFØRPENS.ÅFT(BER_SØ_IND) +                
                                  B02.YRKEPENS.GP(BER_SØ_IND)  +                
                                  B02.YRKEPENS.BT(BER_SØ_IND)  +                
                                  B02.YRKEPENS.TP(BER_SØ_IND)  ;                
   DCL W_SUM FIXED DEC (7) INIT (0);                                            
   W_SUM  =     B02.SUM_YTELSE(BER_SØ_IND);                                     
   IF B02.GARANTI_TP(BER_SØ_IND) > 0 THEN                                       
     DO;                                                     /*9304TS*/         
        IF B02.GARANTI_DATO_ÅMD(BER_SØ_IND) > 19930100 THEN                     
          DO;                                                                   
                                                                                
            IF G > 35500     THEN                            /*9304TS*/         
              DO;                                                               
               B02.VIRK_DATO_ÅMD(BER_SØ_IND) =                                  
                           B02.GARANTI_DATO_ÅMD(BER_SØ_IND); /*9304TS*/         
               GARANTITILLEGG = B02.GARANTI_TP(BER_SØ_IND) -                    
                                 (B02.UFØRPENS.TP(BER_SØ_IND)  +                
                                  B02.UFØRPENS.ST(BER_SØ_IND)  +                
                                  B02.YRKEPENS.TP(BER_SØ_IND)) ;                
              END;                                                              
          END;                                                                  
        ELSE                                                 /*9304TS*/         
          DO;                                                /*9304TS*/         
        IF (G > 34100)                       !                                  
           ((G = 34100) & (TRANSTYPE ^= 27))      THEN                          
   /* DO */                                                                     
         GARANTITILLEGG = B02.GARANTI_TP(BER_SØ_IND) -                          
                                 (B02.UFØRPENS.TP(BER_SØ_IND)  +                
                                  B02.UFØRPENS.ST(BER_SØ_IND)  +                
                                  B02.YRKEPENS.TP(BER_SØ_IND)) ;                
          END;                                                                  
                                                                                
         IF GARANTITILLEGG > 0 THEN                                             
            DO;                                                                 
               B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)          
                                         + GARANTITILLEGG;                      
               DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) =                    
                                           GARANTITILLEGG;                      
            END;                                                                
     END;                                                                       
   W_SUM  =     B02.SUM_YTELSE(BER_SØ_IND);                                     
                                                                                
   DCL B1_LOV92  FIXED DEC (7) INIT (0);                                        
   DCL B2_LOV92  FIXED DEC (7) INIT (0);                                        
   B1_LOV92 =   B01.GT_LOV92(BER_SØ_IND);                                       
   B2_LOV92 =   B02.GT_LOV92(BER_SØ_IND);                                       
   /*TRUDE,170292:   */                                                         
                                                                                
   IF B01.GT_LOV92(BER_SØ_IND) > 0      &      /*TRUDE,170292:   */             
      B02.GT_LOV92(BER_SØ_IND) = 0            THEN                              
       DO;                                                                      
        B02.UFØRPENS.SPT_1291(BER_SØ_IND) =                                     
                                     B01.UFØRPENS.SPT_1291(BER_SØ_IND);         
        B02.UFØRPENS.OPT_1291(BER_SØ_IND) =                                     
                                     B01.UFØRPENS.OPT_1291(BER_SØ_IND);         
        B02.UFØRPENS.PÅ_1291(BER_SØ_IND) =                                      
                                     B01.UFØRPENS.PÅ_1291(BER_SØ_IND);          
        B02.GT_LOV92(BER_SØ_IND)  =  B01.GT_LOV92(BER_SØ_IND);                  
       END;                                                                     
                                                                                
   /*TRUDE TIL HIT 170292 */                                                    
                                                                                
                                                                                
 /* LOVENDRING FRA 1.1.92 - HL : */                                             
                                                                                
   IF B02.GT_LOV92(BER_SØ_IND) > 0            THEN                              
      DO;                                                                       
         ALTERNATIV_SAVE = DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;                   
                                                                                
         B02.GT_LOV92(BER_SØ_IND) = F_TILLEGGSPENSJON(FNR_R13.ÅR,35500,         
                       (B02.UFØRPENS.SPT_1291(BER_SØ_IND)),                     
                       (B02.UFØRPENS.OPT_1291(BER_SØ_IND)),                     
                       (B02.UFØRPENS.PÅ_1291(BER_SØ_IND)),                      
                       (UFGRAD),                                                
                        100,'J');                                               
                                                                                
         IF B02.YRKE_POENG_1291(BER_SØ_IND) > 0 THEN                            
            DO;                                                                 
               B02.GT_LOV92(BER_SØ_IND) =                                       
                        B02.GT_LOV92(BER_SØ_IND) +                              
                                                                                
                        F_TILLEGGSPENSJON(FNR_R13.ÅR,G,                         
                        (B02.YRKE_POENG_1291(BER_SØ_IND)),0,40,                 
                        (B02.YRKEPENS.YUG(BER_SØ_IND)),                         
                        100,'J');                                               
                                                                                
 /*F_TILLEGGSPENSJON LEGGER VERDI INN I ALTERNATIV_TP - TIL BRUK  */            
 /* FOR BEREGNING AV DAGPENGER.  DETTE SKAL BARE GJØRES NÅR VANLIG*/            
 /* TP SKAL OPPDATERES - ALTSÅ IKKE HER :                         */            
                                                                                
               DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = 0;                           
                                                                                
               REDUKSJONSBELØP =  B02.UFØRPENS.TP(BER_SØ_IND) +                 
                                  B02.UFØRPENS.ST(BER_SØ_IND) +                 
                                  B02.YRKEPENS.TP(BER_SØ_IND);                  
            END;                                                                
         ELSE                                                                   
                                                                                
             REDUKSJONSBELØP =  B02.UFØRPENS.TP(BER_SØ_IND) +                   
                                  B02.UFØRPENS.ST(BER_SØ_IND);                  
                                                                                
         IF B02.GT_LOV92(BER_SØ_IND) > REDUKSJONSBELØP      THEN                
         DO;                                                                    
             B02.GT_TILLEGG_LOV92(BER_SØ_IND) = B02.GT_LOV92(BER_SØ_IND)        
                                                - REDUKSJONSBELØP;              
             IF B02.GARANTI_TP(BER_SØ_IND) > REDUKSJONSBELØP  THEN              
                IF B02.GARANTI_TP(BER_SØ_IND) <                                 
                             B02.GT_LOV92(BER_SØ_IND)  THEN                     
                B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)         
                + REDUKSJONSBELØP - B02.GARANTI_TP(BER_SØ_IND)                  
                                + B02.GT_TILLEGG_LOV92(BER_SØ_IND);             
                ELSE;                                                           
             ELSE                                                               
             B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)            
                                + B02.GT_TILLEGG_LOV92(BER_SØ_IND);             
         END;                                                                   
         ELSE                                                                   
            DO;                                                                 
               B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                            
                                                                                
 /*VI KAN NULLSTILLE DERSOM VI IKKE TRENGER GT_LOV92 TIL      */                
 /*BEREGNING AV GARANTI TIL FORSØRGINGSTILLEGG :              */                
               IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) = ' '  THEN                  
                  DO;                                                           
                     B02.GT_LOV92(BER_SØ_IND)         = 0;                      
                     B02.UFØRPENS.SPT_1291(BER_SØ_IND) = 0;                     
                     B02.UFØRPENS.OPT_1291(BER_SØ_IND) = 0;                     
                     B02.UFØRPENS.PÅ_1291(BER_SØ_IND) = 0;                      
                  END;                                                          
            END;                                                                
         DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP = ALTERNATIV_SAVE;                   
      END;                                                                      
   ELSE /*REMEDY 2005 - 200604 HL */                                            
      B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                                     
                                                                                
   /*DESSUTEN NULLING AV FELT: 200608 HL : */                                   
       IF  (B02.UFØRPENS.TP(BER_SØ_IND)     >                                   
            B02.GT_LOV92(BER_SØ_IND))        THEN                               
          DO;                                                                   
   /*      IF B02.PENSJONSTYPE2(BER_SØ_IND) ^= 'F'  &                           
              B02.ANTALL_BARN(BER_SØ_IND)    = 0  THEN */                       
                  B02.GT_LOV92(BER_SØ_IND)     = 0;                             
          END;                                                                  
       IF  (B02.UFØRPENS.TP(BER_SØ_IND)     >                                   
            B02.GARANTI_TP(BER_SØ_IND))        THEN                             
          DO;                                                                   
   /*      IF B02.PENSJONSTYPE2(BER_SØ_IND) ^= 'F'  &                           
              B02.ANTALL_BARN(BER_SØ_IND)    = 0  THEN */                       
              B02.GARANTI_TP(BER_SØ_IND)     = 0;                               
          END;                                                                  
   /*HIT 200608 HL */                                                           
                                                                                
   W_SUM  =     B02.SUM_YTELSE(BER_SØ_IND);                                     
                                                                                
 /*YS***********************************/                                       
 /*YS  TRUDE KAP_11_7 UTLØSNINSGBELØP  */                                       
 /*YS***********************************/                                       
                                                                                
  IF (KAP11_UTLØST     = 'J'   &                                                
      U_FNR = B02.FNR(BER_SØ_IND) )  THEN                                       
    DO;                                                                         
     IF  ( B02.YRKEPENS.YUG(BER_SØ_IND)  >14    )    &                          
         ( B02.YRKEPENS.YUG(BER_SØ_IND)  <   20 )    THEN                       
 /*ENGANGSBELOEP FLYTTET FRA B02 TIL DIV-PARAM  J.D 10.90*/                     
   DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) =                                
                           (B02.SUM_YTELSE(BER_SØ_IND) * 3 * 12);               
                                                                                
       IF (B02.YRKEPENS.YUG(BER_SØ_IND)   >   19 )     &                        
          (B02.YRKEPENS.YUG(BER_SØ_IND)   <   25 )     THEN                     
                                                                                
   DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) =                                
                           (B02.SUM_YTELSE(BER_SØ_IND) * 6 * 12);               
                                                                                
                                                                                
       IF (B02.YRKEPENS.YUG(BER_SØ_IND)   >   24 )     &                        
          (B02.YRKEPENS.YUG(BER_SØ_IND)   <   30 )     THEN                     
                                                                                
   DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND) =                                
                           (B02.SUM_YTELSE(BER_SØ_IND) * 9 * 12);               
                                                                                
    DCL BELØP_11_7   PIC '99999999';                                            
    BELØP_11_7   = DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND);                 
                                                                                
 /*YS  NB! UTLØSNINGSBELØPET SKAL IKKE OVERSTIGE KAPITALVERDIEN */              
 /*YS  AV PENSJONEN REGNET FRAM TIL FYLTE 67 ÅR, ELLER TIL FYLTE*/              
 /*YS  70 ÅR DERSOM SKADETILFELLET INTRAFF FØR 1973             */              
                                                                                
    DCL KAPITALISERINGSBELØP  PIC'(7)9'INIT(0);                                 
                                                                                
          KAPITALISERINGSBELØP     = F_KAPFAKT(W_FNR,                           
                                     (B02.SUM_YTELSE(BER_SØ_IND)),              
                                     (W_DATO_ÅMD),             /*Y2K*/          
                                     (B02.YRKEPENS.YUG(BER_SØ_IND)));           
          IF KAPITALISERINGSBELØP >  0 THEN                                     
            DO;                                                                 
  DIV_PARAM_OMR.ENGANGSBELØP_11_7(BER_SØ_IND)  = KAPITALISERINGSBELØP;          
            END;  /* NB!DERSOM BEGGE BELØP SKAL OPPGIS PÅ SB !!!  */            
                                                                                
                                                                                
       B02.SUM_YTELSE(BER_SØ_IND)  = 0;                                         
       B02.YRKEPENS(BER_SØ_IND) = '';                                           
 /*YS        B02.YRKEHIST.OPPH_KODE(BER_SØ_IND,M)    =  'J'  */                 
                                                                                
                                                                                
       IF ( B01.PENSJONSTYPE1(BER_SØ_IND)    = ' ' &                            
          B01.STATUS_KODE_HIST(BER_SØ_IND)   = ' ' )  !                         
          ( B01.PENSJONSTYPE1(BER_SØ_IND)   ^= ' ' &                            
          B01.STATUS_KODE_HIST(BER_SØ_IND)   = 'X') THEN                        
           DO;                                                                  
            B02.STATUS_KODE_HIST(BER_SØ_IND) = 'X';                             
           END;                                                                 
    END;                                                                        
   IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A'    &                                  
      ALTERNATIV_ER_OPPDATERT ^= 'J'      THEN                                  
      DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP =           /*9804*/                    
      DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP + YRKE_ÅRSTP;                           
                                                                                
                                                                                
   IF B02.LØNNSTILSKUDD(BER_SØ_IND) = 'J'      THEN                             
      DO;                                                                       
         B02.INNTEKTSKODE1(BER_SØ_IND) = 'A';                                   
         B02.INNTEKTSKODE2(BER_SØ_IND) = '0';                                   
         B02.UFØRPENS.LOVLIG_INNTEKT(SØKER_IND) = 0;                            
      END;                                                                      
   ELSE                                                                         
      CALL OPPDATER_INNTEKTSGRENSE(BER_SØ_IND);                                 
   /*                                                                           
   B02.UFØRPENS.LOVLIG_INNTEKT(BER_SØ_IND) =                                    
      B_LOVLIG_INNT                                                             
         ((B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,1)),                                 
          (B02.UFØRPENS.UFG(BER_SØ_IND)),                                       
          (B02.UFØRPENS.INNTEKT_FØR_UP(BER_SØ_IND)),                            
          (B02.UFØRPENS.INNT_DATO_ÅMD(BER_SØ_IND)),                             
          (B02.UFØRPENS.REAKTIVISERING(BER_SØ_IND)),                            
          (B02.UFØRPENS.TIDSBEGR_ATTF(BER_SØ_IND)),                             
          (B02.UFØRPENS.UNNTAK_FRA_VENTETID(BER_SØ_IND)),                       
          (B02.UFØRPENS.SKJERM_ATTF(BER_SØ_IND)),                               
          (B02.UFØRHIST.BUP_GAR_KODE(BER_SØ_IND,1)),                            
          (B02.STATUS.YRKES_KODE(BER_SØ_IND)),                                  
          (DIV_PARAM_OMR.DATO_2000));          */                               
 /* ================================================================= */        
 HENT_FRA_UP: PROC;                                                             
     %INCLUDE P0010601;                                                         
     U_FNR         = UPS.FNR;                                                   
     KAP11_UTLØST  = UPY.KAP_11_7_UTLØST;                                       
     U_UFT_ÅMD     = UPS.UFT_ÅMD;                                               
     W_BOSATT        = UPS.NORSK_BOSATT;       /* 200392 TRUDE*/                
 END HENT_FRA_UP;                                                               
 /* ================================================================= */        
 HENT_FRA_U2: PROC;                                                             
    %INCLUDE P001N601;                                                          
    U_FNR               = U2S.FNR;                                              
    U_UFT_ÅMD           = U2S.UFT_ÅMD;                                          
    IF F_KJØNN(U2S.FNR) = 'M' THEN     /*R0019902 TRUDE 0892*/                  
       INDEX            = 2;                                                    
    ELSE                                                                        
       INDEX            = 1;                                                    
    TT_KONVENSJON       = U2SP.TT_KONVENSJON_ÅR;                                
    KAP11_UTLØST        = U2Y.KAP_11_7_UTLØST;                                  
    W_BOSATT            = U2S.NORSK_BOSATT;       /* 200392 TRUDE*/             
 END HENT_FRA_U2;                                                               
 /* ================================================================= */        
 HENT_FRA_U3: PROC;                                                             
    %INCLUDE P001U601;                                                          
    U_FNR             = U3S.FNR;                                                
      U_UFT_ÅMD         = U3S.UFT_ÅMD;                                          
      IF F_KJØNN(U3S.FNR) = 'M' THEN                                            
         INDEX         = 2;                                                     
      ELSE                                                                      
         INDEX         = 1;                                                     
                                                                                
      TT_KONVENSJON     = U3SP.TT_KONVENSJON_ÅR;                                
      KAP11_UTLØST      = U3Y.KAP_11_7_UTLØST;                                  
 /*   W_INNTEKT_FØR     = U3S.INNTEKT_FØR_UP;      NY 0994*/                    
                                                                                
 /*DET TESTES PÅ W_BOSATT I 4421, MEN DENNE TESTEN KAN IKKE BRUKES*/            
 /*FOR U3-REGISTRERING.  DERFOR SETTES W_BOSATT = 'J' HER  :      */            
                                                                                
      W_BOSATT          = 'J';                                                  
                                                                                
   END HENT_FRA_U3;                                                             
 %PAGE;                                                                         
        %INCLUDE R0014133;      /* F_BEREGN_SÆRTILLEGG           */             
        %INCLUDE R0014134;      /* F_BEREGN_KOMPTILLEGG          */             
        %INCLUDE R0014142;      /* F_TILLEGGSPENSJON             */             
        %INCLUDE R0014143;      /* POENG_TILLEGG                 */             
        %INCLUDE R0014148;      /* F_TP92                        */             
        %INCLUDE R0014153;      /* BEREGN_SPT_OPT_PÅ             */             
        %INCLUDE R0014233;      /* BEREGN_BT FELLES FOR AP UP    */             
        %INCLUDE R0014410;      /* FINN_BESTE_UFT                */             
        %INCLUDE R0014421;      /* BEREGN_GP_UP                  */             
   /*   %INCLUDE R0014427          B_LOVLIG_INNT   FALLER BORT   */             
        %INCLUDE R0014428;      /* OPPDATER_INNTEKTSGRENSE       */             
        %INCLUDE R0014482;      /* BEREGN_GP_UP_UTLAND.          */             
        %INCLUDE R0014422;      /* BEREGN_TP_UP                  */             
        %INCLUDE R0014423;      /* OPPDATER_GAMMEL_UFØRHISTORIKK */             
        %INCLUDE R0014424;      /* BEREGN_POENG_AV_AÅI           */             
        %INCLUDE R0014425;      /* BEREGN_TP_YP                  */             
        %INCLUDE R0014426;      /* KAPITALISERING AV SMÅ-        */             
   /*   %INCLUDE R0014430       BEREGN_INNTEKT_FØR_UP         */                
        %INCLUDE R0014431;      /* ÅFT_TILLEGG                   */             
        %INCLUDE R0019905;      /* F_ALDER                       */             
                                /* PENSJONER KAP 11-7.TRUDE      */             
        %INCLUDE R0019902;      /* F_KJØNN,BLIR BRUKT I R001KAPT */             
    /*  %INCLUDE R0019910       /* F_NUMERIC                     */             
    /*  %INCLUDE R0019984       /* KONV_MÅ_HÅMD                  */             
        %INCLUDE R0019995;      /* KONV_FNR11_FNR13    2000-3    */             
                                                                                
  L999:                                                                         
                                                                                
  END R001440;                                                                  
