 /*   SIST ENDRET PÅ PROD   2000.02.28 11.47.57 AV   JDA7339          */        
 /*       SIST ENDRET 04/05-98 14.14.56 AV   JDA7339                  */        
                                                                                
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R00104AF  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : KRISTENSEN                                       */        
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */        
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */        
 /*    FORHÅND.                                                       */        
 /*    MAPS HØRER INN UNDER MAPSET 'S001F3'.                         */         
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */        
 /*                                                                   */        
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */        
 /*    BRUK :                                                         */        
 /*    EXEC CICS XCTL PROGRAM ('R00104AF') COMMAREA(KOM_OMR);         */        
 /*    PROGRAMMET INCLUDER :                                          */        
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    AF       */        
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       AF       */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                                   
                                                                                
          %INCLUDE P0019906;                                                    
          %INCLUDE P0019908;                                                    
          %INCLUDE P0019910;                                                    
          %INCLUDE P0019912;                                                    
          %INCLUDE P0019913;                                                    
 DCL                                                                            
      (CSTG, ADDR)                   BUILTIN;                                   
 DCL  COMMAREA_PEKER         PTR,                                               
      LOKAL_KOM_PTR          PTR;                                               
                                                                                
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/                  
 DCL                                                                            
    CURSOR_POS FIXED BIN(15) INIT(-1),                                          
    DFHBMUNP             CHAR(1) INIT(' '),                                     
    DFHBMBRY             CHAR(1) INIT('H'),                                     
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */              
    FEIL_FUNNET          BIT(1)  INIT('1'B),                                    
    MELDING6O            CHAR(10),                                              
    YMELDING6O           CHAR(10);                                              
                                                                                
          %INCLUDE S001F3  ;                                                    
          %INCLUDE P001UJ01;                                                    
                                                                                
                                                                                
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                            
                                                                                
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);           
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);                
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);             
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);            
                                                                                
                                                                                
                                                                                
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);        
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);               
                                                                                
           CALL OVERFØR_KFPSØKER_MAP;                /* R001UJ06 */             
           /* ENDRET AV SATISH 25.02.2000                                       
           IF KFP.NORSK_BOSATT = 'N' THEN                                       
              DO;                                                               
                 CALL OVERFØR_KFPSPES_MAP;                                      
              END;                                                              
           */                                                                   
                                                                                
           S001UJ1O.DUMMYA = 'Ø';                   /* PROT,DARK  */            
        /* FREE TRANS_OMR,TRANS_OPPL_OMR; */                                    
                                                                                
                                                                                
      EXEC CICS RETURN;                                                         
                                                                                
      /*   *******END HOVED PROGRAM   ***************** */                      
   SKRIV_FEIL:                       /**   DUMMY PROC  **/                      
      PROC(FIXED_DEC_5);                                                        
                                                                                
      DCL                                                                       
        FIXED_DEC_5 UNAL FIXED DEC(5);                                          
                                                                                
   END SKRIV_FEIL;                                                              
                                                                                
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                         
                                                                                
           DCL                                                                  
             FIXED_DEC_5 UNAL FIXED DEC(5);                                     
                                                                                
        END SKRIV_FEIL_YP;                                                      
                                                                                
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                    
                                                                                
           DCL                                                                  
             FIXED_DEC_5 UNAL FIXED DEC(5);                                     
                                                                                
   END SKRIV_FEIL_SP;                                                           
                                                                                
                                                                                
   %INCLUDE R001UJ06;                                                           
   %INCLUDE R0019912;                                                           
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */        
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */        
   %INCLUDE  R0019990;                        /*  KONV_HÅMD_DMÅ       */        
 END R001041;                                                                   
