 /*       SIST ENDRET 09/06-98 08.50.12 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 13.30.50 AV   MEA9991                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0019911 - F_GYLDIG_DATO_DMÅ - FUNKSJON I PLI.                 */00000040
 /*    PROGRAMMERER: JAN-H. KRISTENSEN JUNI 1981.                     */00000050
 /*HENSIKT:                                                           */00000060
 /*    FUNKSJONEN KONTROLLERER OM ET NUMERISK FELT PÅ SEKS            */00000070
 /*    KARAKTERER REPRESENTERER EN RIKTIG DATO I DETTE ÅRHUNDRET.     */00000080
 /*    DERSOM DATOEN ER KORREKT RETURNERES '1'B, DERSOM               */00000090
 /*    DATOEN IKKE ER KORREKT RETURNERES '0'B.                        */00000100
 /*PARAMETER INN:                                                     */00000110
 /*    DATO_DMÅ.                                                      */00000120
 /*PARAMETER UT:                                                      */00000130
 /*    RETUR.                                                         */00000140
 /*BRUK:                                                              */00000150
 /*    IF ^ F_GYLDIG_DATO_DMÅ(DATO_DMÅ) THEN (SKRIV FEILMELDING)      */00000160
 /* ***************************************************************** */00000170
 %PAGE;                                                                 00000180
 F_GYLDIG_DATO_DMÅ: PROC(DATO_DMÅ) RETURNS(BIT(1));                     00000190
 DCL                                                                    00000200
    DATO_DMÅ PIC '999999',                                              00000210
    DAG DEF DATO_DMÅ POS(1) PIC '99',                                   00000220
    MND DEF DATO_DMÅ POS(3) PIC '99',                                   00000230
    ÅR DEF DATO_DMÅ POS(5) PIC '99',                                    00000240
    MNDTAB(12) DEC FIXED(2) INIT(31,28,31,30,31,30,31,31,30,31,30,31),  00000250
    RETUR BIT(1) INIT('1'B),                                            00000260
    MOD BUILTIN;                                                        00000270
    IF DAG = 29 & MND = 2 THEN                                          00000280
      DO;                                                               00000290
         IF MOD(ÅR + 1900,400) = 0 THEN                                 00000300
            MNDTAB(2) = 29;                                             00000310
         ELSE                                                           00000320
         IF MOD(ÅR + 1900,100) = 0 THEN                                 00000330
            ;                                                           00000340
         ELSE                                                           00000350
         IF MOD(ÅR + 1900,4) = 0 THEN                                   00000360
            MNDTAB(2) = 29;                                             00000370
      END;                                                              00000380
    IF (MND < 1 ! MND > 12 )THEN                                        00000390
       RETUR = '0'B;                                                    00000400
    ELSE                                                                00000410
    IF ÅR < 0 THEN                                                      00000420
       RETUR = '0'B;                                                    00000430
    ELSE                                                                00000440
    IF (DAG < 1 ! DAG > MNDTAB(MND)) THEN                               00000450
       RETUR = '0'B;                                                    00000460
    RETURN(RETUR);                                                      00000470
 END F_GYLDIG_DATO_DMÅ;                                                 00000480
