 /*       SIST ENDRET 02/09-98 10.26.31 AV   SPA7339                  */00000000
 /* ***************************************************************** */00000010
 /* IDENTIFIKASJON                                                    */00000020
 /*     R0019958 - P9958_BEH_STRYK_REG   PROCEDURE I  PLI             */00000030
 /*                                                                   */00000040
 /*     PROGRAMMERER: S. LUNDEBY  FRA    DATA-UTVIKLING A/S  OKT 1985 */00000050
 /*                                                                   */00000060
 /* HENSIKT                                                           */00000070
 /*     FNR , ÅR OG DATO SKRIVES UT PÅ STRYK-REG.( VSAM : KSDS ).     */00000080
 /*     DENNE BRUKES VED INNTEKTS-OPPDATERING FO Å SJEKKE OM DEN ER   */00000090
 /*     FJERNET TIDLIGERE.                                            */00000100
 /*                                                                   */00000110
 /* PARAMETRE                                                         */00000120
 /*     BEH  :  BEHANDLINGS-KODE. FORTELLER OM DET SKAL GJØRES        */00000130
 /*             OPPSLAG ELLER OPPDATERING. FØLGENDE KODER BRUKES :    */00000140
 /*                      LES , SKRIV , FJERN                          */00000150
 /*     FNR  :  AKTUELLT FNR.                                         */00000160
 /*     ÅR   :  DET ÅR HVOR INNTEKTEN FJERNES.                        */00000170
 /*                                                                   */00000180
 /* PROGRAMTILKNYTNING                                                */00000190
 /*     INCLUDE MODUL I :                                             */00000200
 /*                                                                   */00000210
 /*            R001I301 :   FJERNING AV INNTEKTER                     */00000220
 /*            R001I801 :   FJERN   FRA STRYK-REGISTERET.             */00000230
 /*                                                                   */00000240
 /* ***************************************************************** */00000250
                                                                        00000260
    P9958_BEH_STRYK_REG:                                                00000270
       PROC                (W9958_BEH , W9958_FNR , W9958_ÅR);          00000280
                                                                        00000290
                                                                        00000300
       DCL W9958_FNR         FIXED DEC (11) UNAL,                       00000310
           W9958_ÅR          FIXED DEC ( 5) UNAL,                       00000320
           W9958_BEH         CHAR      ( 5) UNAL;                       00000330
                                                                        00000340
                                                                        00000350
      /*--------------------------------------------------------------*/00000360
      /*  RECORD FOR DATA TIL STRYK-REG.                              */00000370
      /*  DIV. HJELPE-OMRÅDER                                         */00000380
      /*--------------------------------------------------------------*/00000390
                                                                        00000400
       %INCLUDE P0019958;     /***               STRYK_REC          ***/00000410
                                                                        00000420
                                                                        00000430
       DCL I                      FIXED BIN (15)     INIT ( 0 ),        00000440
          STRYK_REC_RBA           POINTER                      ,        00000450
         (DATE , STG)             BUILTIN                      ,        00000460
          TID                     PIC      '( 4)9'   INIT ( 0 ),        00000470
          TID_TIM DEF TID         CHAR      ( 2)     POS  ( 1 ),        00000480
          TID_MIN DEF TID         CHAR      ( 2)     POS  ( 3 ),        00000490
          D                       CHAR      ( 8)     INIT ( ''),        00000500
          D_ÅR    DEF D           CHAR      ( 4)     POS  ( 1 ),        00000510
          D_MND   DEF D           CHAR      ( 2)     POS  ( 5 ),        00000520
          D_DAG   DEF D           CHAR      ( 2)     POS  ( 7 ),        00000530
          KEY_FNR_ÅR              PIC      '(15)9'   INIT ( 0 ),        00000540
          KEY_FNR DEF KEY_FNR_ÅR  PIC      '(11)9'   POS  ( 1 ),        00000550
          KEY_ÅR  DEF KEY_FNR_ÅR  PIC      '( 4)9'   POS  ( 12);        00000560
                                                                        00000570
                                                                        00000580
                                                                        00000590
                                                                        00000600
      /* ************************************************************ */00000610
      /* *******    EKSEKVERING STARTER HER                ********** */00000620
      /* ************************************************************ */00000630
                                                                        00000640
      /*--------------------------------------------------------------*/00000650
      /*  ADDRESSERER EIB-OMR.                                        */00000660
      /*--------------------------------------------------------------*/00000670
                                                                        00000680
      EXEC CICS  ADDRESS EIB(DFHEIPTR)                                ; 00000690
                                                                        00000700
      KEY_FNR                 =           W9958_FNR                   ; 00000710
      KEY_ÅR                  =           W9958_ÅR                    ; 00000720
                                                                        00000730
                                                                        00000740
      SELECT  ( W9958_BEH );                                            00000750
                                                                        00000760
         WHEN ('LES '     )                                             00000770
            DO;                                                         00000780
               /*----------------------------------------------------*/ 00000790
               /* SJEKKER OM ØNSKET RECORD LIGGER PÅ STRYK.          */ 00000800
               /* RETURNERER MED :  FEIL_MELD_NR  =  9999            */ 00000810
               /* HVIS DEN IKKE FINNES.                              */ 00000820
               /*----------------------------------------------------*/ 00000830
                                                                        00000840
               EXEC CICS HANDLE CONDITION ERROR  (L900)               ; 00000850
               EXEC CICS HANDLE CONDITION NOTFND (L905)               ; 00000860
               EXEC CICS READ   DATASET ('STRYK') INTO   ( STRYK_REC )  00000870
                                                  RIDFLD ( KEY_FNR_ÅR); 00000880
            END;                                                        00000890
                                                                        00000900
         WHEN ('SKRIV'    )                                             00000910
            DO;                                                         00000920
               /*-----------------------------------------------------*/00000930
               /* FJERNING AV INNTEKTER. STRYK-REG. SKAL OPPDATERES.  */00000940
               /* RETURNERER MED :  FEIL_MELD_NR  =  9999             */00000950
               /* HVIS RECORDEN FINNES FRA FØR.                       */00000960
               /*-----------------------------------------------------*/00000970
                                                                        00000980
               D                   =    DATO_2000                     ; 00000990
               TID                 =    EIBTIME / 100                 ; 00001000
                                                                        00001010
               STRYK_REC           =    ''                            ; 00001020
               STRYK_REC.FNR       =    W9958_FNR                     ; 00001030
               STRYK_REC.ÅR        =    W9958_ÅR                      ; 00001040
               STRYK_REC.DATO_ÅMD  =    DIV_PARAM_OMR.DATO_2000       ; 00001050
                                                                        00001060
                                                                        00001070
               EXEC CICS HANDLE CONDITION ERROR  (L910)               ; 00001080
               EXEC CICS HANDLE CONDITION DUPREC (L915)               ; 00001090
                                                                        00001100
               EXEC CICS WRITE DATASET ('STRYK'     ) FROM (STRYK_REC)  00001110
                               RIDFLD  ( KEY_FNR_ÅR )                 ; 00001120
            END;                                                        00001130
                                                                        00001140
         WHEN ('FJERN'    )                                             00001150
            DO;                                                         00001160
               /*-----------------------------------------------------*/00001170
               /* FJERNING AV RECORDS PÅ STRYK-REG.                   */00001180
               /* RETURNERER MED :  FEIL_MELD_NR  =  9999             */00001190
               /* HVIS RECORDEN IKKE FINNES FRA FØR.                  */00001200
               /*-----------------------------------------------------*/00001210
                                                                        00001220
               EXEC CICS HANDLE CONDITION ERROR  (L920)               ; 00001230
               EXEC CICS HANDLE CONDITION NOTFND (L925)               ; 00001240
                                                                        00001250
               EXEC CICS DELETE DATASET ('STRYK'     )                  00001260
                                RIDFLD  ( KEY_FNR_ÅR )                ; 00001270
            END;                                                        00001280
                                                                        00001290
         OTHERWISE;                                                     00001300
                                                                        00001310
      END;  /*   SELECT .....                                    */     00001320
                                                                        00001330
                                                                        00001340
      GOTO L9958;                                                       00001350
                                                                        00001360
                                                                        00001370
      /*--------------------------------------------------------------*/00001380
      /*   FEIL VED LES AV FILE                      :  STRYK         */00001390
      /*--------------------------------------------------------------*/00001400
  L900:                                                                 00001410
      FEIL_MELD_NR                =    507 ;                            00001420
      FEIL_VED_LABEL              =   '900';                            00001430
                                                                        00001440
      /*--------------------------------------------------------------*/00001450
      /*   ØNSKET RECORD IKKE FUNNET FILE            :  STRYK         */00001460
      /*--------------------------------------------------------------*/00001470
  L905:                                                                 00001480
      FEIL_MELD_NR                =    9999;                            00001490
                                                                        00001500
      /*--------------------------------------------------------------*/00001510
      /*   FEIL VED SKRIV AV FILE                    :  STRYK         */00001520
      /*--------------------------------------------------------------*/00001530
  L910:                                                                 00001540
      FEIL_MELD_NR                =    508 ;                            00001550
      FEIL_VED_LABEL              =   '910';                            00001560
                                                                        00001570
      /*--------------------------------------------------------------*/00001580
      /*   RECORD LÅ INNE FRA FØR VED SKRIV I FILE   :  STRYK         */00001590
      /*--------------------------------------------------------------*/00001600
  L915:                                                                 00001610
      FEIL_MELD_NR                =    9999;                            00001620
                                                                        00001630
      /*--------------------------------------------------------------*/00001640
      /*   FEIL VED FJERN AV RECORD I FILE           :  STRYK         */00001650
      /*--------------------------------------------------------------*/00001660
  L920:                                                                 00001670
      FEIL_MELD_NR                =    509 ;                            00001680
      FEIL_VED_LABEL              =   '920';                            00001690
                                                                        00001700
      /*--------------------------------------------------------------*/00001710
      /*   RECORD IKKE FUNNET VED FJERNING I FILE    :  STRYK         */00001720
      /*--------------------------------------------------------------*/00001730
  L925:                                                                 00001740
      FEIL_MELD_NR                =    9999;                            00001750
                                                                        00001760
  L9958:                                                                00001770
                                                                        00001780
                                                                        00001790
    END P9958_BEH_STRYK_REG;                                            00001800
