 /*********************************************************************/00000030
 /*IDENTIFIKASJON :                                                   */00000040
 /****************                                                    */00000050
 /* PROGRAM-IDENT   : R0011836  OVERFØR_SØKER_TIL_MAP SUBPROGRAM      */00000060
 /* PROGRAMMERER    : TRUDE SPONBERG                                  */00000070
 /* PROGRAMMET BLE LAGET : OKTOBER 1989                               */00000080
 /* ENDRINGSDATO    :                                                 */00000090
 /* ENDRINGEN GJELDER    :                                            */00000100
 /* ENDRING UTFØRT AV    :                                            */00000110
 /*                                                                   */00000120
 /*********************************************************************/00000130
 /*HENSIKT:                                                           */00000140
 /*********                                                           */00000150
 /* OVERFØRER DATA FRA UP_TRANS_OMR TIL SKJERMBILDET.                 */00000160
 /* BRUKER MAP S001831 MAPSET S00183.                                 */00000170
 /*                                                                   */00000180
 /*********************************************************************/00000190
 /*PROGRAMTILKNYTNING:                                                */00000200
 /********************                                                */00000210
 /* PROGRAMMET INCLUDES AV R0010470  OG R0010412                      */00000220
 /*                                                                   */00000230
 /*********************************************************************/00000240
 /*                                                                   */00000250
                                                                        00000260
                                                                        00000270
                                                                        00000280
  OVERFØR_SØKER_TIL_MAP: PROC;                                          00000290
                                                                        00000300
   DCL NORMAL    CHAR (1)  INIT(' ');                                   00000310
                                                                        00000320
     S001831O.REGDATOO        =  KONV_HÅMD_ÅMD(UFS.REGDATO_ÅMD);        00000330
     S001831O.TERMIDO         =  UFS.TERMID;                            00000340
     S001831O.FNRO            =  F_FELT_PIC_CHAR11(UFS.FNR);            00000350
     S001831O.UFMÅO           =  KONV_HÅMD_MÅ(UFS.UFT_ÅMD);             00000360
                                                                        00000370
     /* FEILMELDINGER MARKERING AV FELT(ATTRIBUTTENE)  */               00000380
     S001831O.DUMMYA           = '_';                                   00000390
                                                                        00000400
     S001831O.REGDATOA         = NORMAL  ;                              00000410
     S001831O.TERMIDA          = NORMAL  ;                              00000420
     S001831O.FUNKSJONSKODEA   = NORMAL  ;                              00000430
     S001831O.STYRE_KODEA      = NORMAL  ;                              00000440
                                                                        00000450
     S001831O.FNRA             = DFHBMASK;                              00000460
     S001831O.UFMÅA            = DFHBMASK;                              00000470
     S001831O.FUNKSJONSKODEA   = DFHBMASK;                              00000480
     S001831O.STYRE_KODEA      = DFHBMASK;                              00000490
     S001831O.REGDATOA         = DFHBMASK;                              00000500
     S001831O.TERMIDA          = DFHBMASK;                              00000510
                                                                        00000520
  END OVERFØR_SØKER_TIL_MAP;                                            00000530
