 /*   SIST ENDRET PÅ PROD   2004.12.17 15.20.39 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 15.03.12 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.01.14 13.04.03 AV   JDA7339          */        
 /*       SIST ENDRET 19/02-99 12.32.05 AV   JDA7339                  */        
 /*       SIST ENDRET 26/01-99 17.47.43 AV   SPA7339                  */        
 /*       SIST ENDRET 26/01-99 14.33.43 AV   SPA7339                  */        
 /*       SIST ENDRET 08/01-99 14.26.04 AV   JDA7339                  */        
 /*       SIST ENDRET 10/09-98 10.20.58 AV   JDA7339                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /* ---------------                                                   */        
 /*  PROGRAM-IDENT : R00104EE  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : KRISTENSEN                                       */        
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /* HENSIKT:                                                          */        
 /* --------                                                          */        
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */        
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */        
 /*    FORHÅND.                                                       */        
 /*    MAPS HØRER INN UNDER MAPSET 'S001F3'.                         */         
 /*                                                                   */        
 /* ***************************************************************** */        
 /* PROGRAMTILKNYTTING:                                               */        
 /* -------------------                                               */        
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */        
 /*                                                                   */        
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */        
 /*    BRUK :                                                         */        
 /*    EXEC CICS XCTL PROGRAM ('R00104EE') COMMAREA(KOM_OMR)          */        
 /*    PROGRAMMET INCLUDER :                                          */        
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    EE       */        
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       EE       */        
 /* ***************************************************************** */        
 /* DATASETTOPPLYSNINGER:                                             */        
 /* ---------------------                                             */        
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /* FEILMELDINGER:                                                    */        
 /* --------------                                                    */        
 /*    PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                        */        
 /* ***************************************************************** */        
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                                   
          %INCLUDE P0019906; /* TRANS_OPPL_OMR */                               
          %INCLUDE P0019908; /* KOM_OMR        */                               
          %INCLUDE P0019910; /* STYRINGS_OMR   */                               
          %INCLUDE P0019912; /* DIV_PARAM_OMR  */                               
          %INCLUDE P0019913; /* LOKAL_KOM_OMR  */                               
                                                                                
    DCL                                                                         
         (CSTG, ADDR)                   BUILTIN;                                
    DCL  COMMAREA_PEKER         PTR,                                            
         LOKAL_KOM_PTR          PTR;                                            
    DCL  (                                                                      
          J,                                                                    
          K,                                                                    
          TELLER                                                                
         )             FIXED BIN(15) INIT (0);                                  
                                                                                
           /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/               
    DCL                                                                         
       CURSOR_POS FIXED BIN(15) INIT(-1),                                       
       DFHBMUNP             CHAR(1) INIT(' '),                                  
       DFHBMBRY             CHAR(1) INIT('H'),                                  
       DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */           
       FEIL_FUNNET          BIT(1)  INIT('1'B),                                 
       MELDING6O            CHAR(78),                                           
       YMELDING6O           CHAR(78);                                           
                                                                                
          %INCLUDE S001F3  ;                                                    
          %INCLUDE P001U801;                                                    
                                                                                
                                                                                
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                            
                                                                                
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);           
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);                
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);             
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);            
                                                                                
                                                                                
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);        
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);               
                                                                                
    IF ^W01_EØS          &                                                      
       ^W01_YSKADE       &                                                      
       ^W01_NORSK_BOSATT  THEN                                                  
       DO;                                                                      
          CALL OVERFØR_EE_SØKER_MAP;     /*      U806 */                        
                                                                                
          IF EES.NORSK_BOSATT      = 'N'   THEN                                 
             DO;                                                                
                                                                                
                CALL TEKST_SP_SØKER;                                            
                CALL OVERFØR_EE_SP_SØKER_MAP; /* U806 */                        
             END;                                                               
          S001U81O.DUMMYA = 'Ø';             /* PROT,DARK  */                   
          W01_MAP = 'S001U81' ;                                                 
                                                                                
             IF EES.NORSK_BOSATT_EK  = 'N'   THEN                               
                DO;                                                             
                    W01_NORSK_BOSATT = '1'B;                                    
                    W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;                      
                END;                                                            
                                                                                
             IF EESP.EØS_OPPLYSN      = 'J'   THEN                              
                DO;                                                             
                    W01_EØS          = '1'B;                                    
                    W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;                      
                END;                                                            
                                                                                
                IF EES.YSKADE_TILLEGG = 'J' THEN                                
                   DO;                                                          
                       W01_YSKADE = '1'B;                                       
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;                   
                   END;                                                         
       END;                                                                     
    ELSE                                                                        
       IF W01_NORSK_BOSATT  THEN                                                
          DO;                                                                   
             W01_NORSK_BOSATT = '0'B;                                           
             CALL OVERFØR_EE_SP_AVDØD_MAP;                                      
             S001U82O.DUMMYA = 'Ø';     /* PROT,DARK  */                        
             W01_MAP = 'S001U82' ;                                              
          END;                                                                  
    ELSE                                                                        
       IF W01_EØS           THEN                                                
          DO;                                                                   
             W01_EØS          = '0'B;                                           
             CALL OVERFØR_EE_EØS_MAP;                                           
             S001U83O.DUMMYA = 'Ø';     /* PROT,DARK  */                        
             W01_MAP = 'S001U83' ;                                              
          END;                                                                  
       ELSE                                                                     
          IF W01_YSKADE       THEN                                              
             DO;                                                                
                CALL OVERFØR_EE_YP_MAP;            /* R001U806 */               
                W01_YSKADE = '0'B;                                              
                S001201O.DUMMYA = 'Ø';             /* PROT,DARK  */             
                W01_MAP = 'S001201' ;                                           
             END;                                                               
                                                                                
 EXEC CICS RETURN;                                                              
    %INCLUDE R0019912;  /*  KONV CHAR -> PIC ! PIC -> CHAR         */           
    %INCLUDE R001U806;  /*  OVERFØR_EE_SØKER_MAP                   */           
                        /*  OVERFØR_EE_SP_SØKER_MAP                */           
                        /*  OVERFØR_EE_SP_AVDØD_MAP                */           
                        /*  OVERFØR_EE_EØS_MAP                */                
                        /*  OVERFØR_EE_YP_MAP                      */           
    %INCLUDE R001U807;  /*  TEKST_SP_SØKER                         */           
                        /*  FJERN_TEKST_SP_SØKER                   */           
    %INCLUDE R0019988;  /*  KONV_HÅMD_ÅMD                          */           
    %INCLUDE R0019989;  /*  KONV_HÅMD_MÅ                           */           
    %INCLUDE R0019990;  /*  KONV_HÅMD_DMÅ                          */           
    %INCLUDE  R0019972; /*  DUMMY FEIL MELDING */                               
 END R001041;                                                                   
