 /*   SIST ENDRET PÅ PROD   2008.05.31 11.11.08 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 11.37.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.43.35 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.44.00 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.10.03 12.09.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.10.03 12.03.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.07.26 12.23.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.09.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.58.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.03.13 10.14.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.06  8.53.37 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.02.26 10.06.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.35.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.05.23 13.08.58 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.35 AV   JDA7339          */        
 /*       SIST ENDRET 18/10-99 12.01.22 AV   JDA7339                  */        
 /*       SIST ENDRET 16/09-99 09.38.59 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.16.29 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.13.29 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.37 AV   JDA7339                  */        
 /*       SIST ENDRET 11/03-98 12.05.54 AV   JDA7339                  */        
  /* *************************************************************** */         
  /* IDENTIFIKASJON:   R0017037                                      */         
  /* PROGRAMMERER:  JAN Y. DYBVIK JANUAR 1988                        */         
  /* HENSIKT:                                                        */         
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */         
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */         
  /*        HVER AJOURFØRT TRANSAKSJON.                              */         
  /* PROGRAMTILKNYTNING:                                             */         
  /*        PROGRAMMET KALLES OPP AV R0017001                        */         
  /*                                                                 */         
  /* *************************************************************** */         
    LAG_YRKEPENS_HEND:                                                          
      PROC (YP_IND,YE_IND);                                                     
                                                                                
  EXEC CICS ADDRESS EIB(DFHEIPTR);                                              
 DCL  YP_IND                               FIXED BIN(15);                       
 DCL  YE_IND                               FIXED BIN(15);                       
 DCL  W_BARN_IND                           FIXED BIN(15);                       
                                                                                
  DCL K                 FIXED BIN(15) INIT (0);                                 
  DCL M                 FIXED BIN(15) INIT (0);                                 
  DCL Y                 FIXED BIN(15) INIT (0);                                 
  DCL W_INNT_GRENSE     FIXED DEC( 7) INIT (0);                                 
                                                                                
                                                                                
  /* *************************************************************** */         
  /* PROGRAMMET BEGYNNER HER . VI BLANKER W_HENDELSE.                */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE              =  '';                                              
    OMR_DATO                = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                 
    IF TRANS_OPPL_OMR.TRANSTYPE = 27     !                                      
       TRANS_OPPL_OMR.TRANSTYPE = 90     !    /*200506 HL */                    
       TRANS_OPPL_OMR.TRANSTYPE = 92     !                                      
       TRANS_OPPL_OMR.TRANSTYPE = 93 THEN                                       
       DO;                                                                      
          HENDDATO  =  OMR_DATO/100;                                            
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          IF DIV_PERIODE.INTENDR_ÅMD     > 0 THEN                               
             HENDDATO     = DIV_PERIODE.INTENDR_ÅMD/100;                        
          ELSE                                                                  
             DO;                                                                
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅMD(YP_IND);        
                HENDDATO     =  R_HENDDATO.AAR * 100 + R_HENDDATO.MND;          
             END;                                                               
       END;                                                                     
    W_HENDELSE.VERSJON      =  W_ROT.NESTE_SB_VERSJON_NR;                       
    W_HENDELSE.TERMINAL     =  DIV_PARAM_OMR.BRUKER_ID;                         
    IF TRANS_OPPL_OMR.TRANSTYPE ^= 21 THEN                                      
       DO;                                                                      
          W_HENDELSE.FNR_EKTEF    =  B02.PERSON.RF0PERSN.FNR(YE_IND);           
          W_HENDELSE.NAVN_EKTEF   =  B02.PERSON.RF0PERSN.NAVN(YE_IND);          
       END;                                                                     
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(YP_IND);                
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(YP_IND);                
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(YP_IND);                
    W_HENDELSE.PENSJONSTYPE1_EK = B02.STATUS.PENSJONSTYPE1(YE_IND);             
    W_HENDELSE.PENSJONSTYPE2_EK = B02.STATUS.PENSJONSTYPE2(YE_IND);             
    W_HENDELSE.PENSJONSTYPE3_EK = B02.STATUS.PENSJONSTYPE3(YE_IND);             
    W_HENDELSE.SIVILSTAND_EK    = B02.STATUS.SIVILSTAND(YE_IND);                
                                                                                
    W_HENDELSE.GAMMEL_SAMMENSTØTS_REGEL =                                       
               B02.STATUS.GAMMEL_SAMMENSTØTS_REGEL(YP_IND);                     
                                                                                
  /* *************************************************************** */         
  /* DERSOM ETTERLATTE PENSJONEN ER STØRSTE                          */         
  /* *************************************************************** */         
                                                                                
    IF B02.PERSON.ETTEPENS.GP_BRUTTO(YP_IND) > 0   THEN                         
                                                                                
       DO;                                                                      
          W_HENDELSE.GP_BRUTTO = B02.ETTEPENS.GP_BRUTTO(YP_IND);                
          W_HENDELSE.GP_NETTO  = B02.ETTEPENS.GP_NETTO(YP_IND);                 
          W_HENDELSE.TP_BRUTTO = B02.ETTEPENS.TP_BRUTTO(YP_IND) +               
                                        B02.UFØRPENS.TP(YP_IND);                
          W_HENDELSE.TP_NETTO  = B02.ETTEPENS.TP_NETTO(YP_IND)  +               
                                        B02.UFØRPENS.TP(YP_IND);                
          W_HENDELSE.ST        = B02.ETTEPENS.ST(YP_IND);                       
                                                                                
          IF B02.STATUS.SIVILSTAND(IND) ^= 'S' THEN                             
             W_HENDELSE.TP_PROSENT = 55;                                        
          ELSE                                                                  
             W_HENDELSE.TP_PROSENT = B02.ETTEPENS.TP_PROSENT(YP_IND);           
                                                                                
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          W_HENDELSE.GP_BRUTTO  =  B02.UFØRPENS.GP(YP_IND);                     
          W_HENDELSE.GP_NETTO   =  B02.UFØRPENS.GP(YP_IND);                     
          W_HENDELSE.TP_BRUTTO  =  B02.UFØRPENS.TP(YP_IND);                     
          W_HENDELSE.TP_NETTO   =  B02.UFØRPENS.TP(YP_IND);                     
          W_HENDELSE.ST         =  B02.UFØRPENS.ST(YP_IND);                     
                                                                                
       END;                                                                     
    W_HENDELSE.KT           =  B02.PERSON.UFØRPENS.KT(YP_IND);                  
    W_HENDELSE.ET           =  B02.PERSON.UFØRPENS.ET(YP_IND);                  
    W_HENDELSE.BT           =  B02.PERSON.UFØRPENS.BT(YP_IND);                  
                                                                                
    /* ATTFØRING - 9806    */                                                   
    W_HENDELSE.ATTFØRING_GP_ÅRSBELØP =                                          
             DIV_PERIODE.ATTFØRING_GP_ÅRSBELØP;                                 
    W_HENDELSE.ATTFØRING_TP_ÅRSBELØP =                                          
             DIV_PERIODE.ATTFØRING_TP_ÅRSBELØP;                                 
                                                                                
    W_HENDELSE.BT_SÆRBARN   =  B02.FORSI.BT_SÆRBARN(YP_IND);                    
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(YP_IND);           
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(YP_IND);             
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(YP_IND);           
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(YP_IND);         
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(YP_IND);        
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(YP_IND);         
    W_HENDELSE.FRIBELØP_FELLESBARN =                                            
                              DIV_PARAM_OMR.FRIBELØP_FELLESBARN(YP_IND);        
   W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(YP_IND);        
    W_HENDELSE.FOLKETRYGD        = DIV_PARAM_OMR.FOLKETRYGD(YP_IND);            
                                                                                
    W_HENDELSE.FOLKETRYGD_EK   = DIV_PARAM_OMR.FOLKETRYGD(YE_IND);              
    W_HENDELSE.ÅFT          =  B02.PERSON.UFØRPENS.ÅFT(YP_IND);                 
    W_HENDELSE.UF_GRAD      =  B02.PERSON.UFØRPENS.UFG(YP_IND);                 
    W_HENDELSE.TT           =  B02.PERSON.STATUS.TT_ANV(YP_IND);                
    W_HENDELSE.TT_EK        =  B02.PERSON.STATUS.TT_ANV(YE_IND);                
    W_HENDELSE.TP_GAR_KODE  = B02.STATUS.TP_GAR_KODE(YP_IND);                   
    W_HENDELSE.TP_GAR_KODE_EK = B02.STATUS.TP_GAR_KODE(YE_IND);                 
    W_HENDELSE.PÅ           = B02.UFØRPENS.PÅ   (YP_IND);                       
    W_HENDELSE.OPT          = B02.UFØRPENS.OPT  (YP_IND);                       
    W_HENDELSE.SPT          = B02.UFØRPENS.SPT  (YP_IND);                       
                                                                                
 /* IF  B02.INNTEKT_FØR_UP(YP_IND)    > 0  THEN                                 
      DO; */                                                                    
         CALL BEREGN_INNTEKT_FØR_YP;                                            
         W_HENDELSE.INNTEKT_FØR_UP =  B02.INNTEKT_FØR_UP(YP_IND);               
  /*     W_HENDELSE.INNTEKT_FØR_UP =  W_INNT_GRENSE;                            
      END; INNT-GRENSE ERSTATTET MED B02.INNTEKT-FøR-UP JD 0202*/               
                                                                                
  /* *************************************************************** */         
  /* NY LOV 0192     JD 11.91                                        */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(YP_IND);                      
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(YP_IND);          
    W_HENDELSE.GARANTI_DATO_ÅMD = B02.STATUS.GARANTI_DATO_ÅMD(YP_IND);          
    W_HENDELSE.SPT_1291         = B02.UFØRPENS.SPT_1291     (YP_IND);           
    W_HENDELSE.OPT_1291         = B02.UFØRPENS.OPT_1291     (YP_IND);           
    W_HENDELSE.PÅ_1291         = B02.UFØRPENS.PÅ_1291     (YP_IND);             
    W_HENDELSE.PÅ_ETTER91      = B02.UFØRPENS.PÅ_ETTER91  (YP_IND);             
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (YP_IND);             
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(YP_IND);          
    DO Y = 1 TO 7 WHILE (B02.UFØRHIST.UFT_ÅMD(YP_IND,Y) > 0);                   
       W_HENDELSE.BUP_GARANTI = B02.UFØRHIST.BUP_GARANTI(YP_IND,Y);             
    END;                                                                        
    W_HENDELSE.YRKE_GP      =  B02.PERSON.YRKEPENS.GP(YP_IND);                  
    W_HENDELSE.YRKE_TP      =  B02.PERSON.YRKEPENS.TP(YP_IND);                  
    W_HENDELSE.YRKE_BT      =  B02.PERSON.YRKEPENS.BT(YP_IND);                  
    W_HENDELSE.ANTALL_BARN  =  B02.PERSON.STATUS.ANTALL_BARN(YP_IND);           
    W_HENDELSE.ANTALL_BARN_TIDL                                                 
                            =  B01.PERSON.STATUS.ANTALL_BARN(YP_IND);           
    W_HENDELSE.TT           =  B02.PERSON.STATUS.TT_ANV(YP_IND);                
    W_HENDELSE.TT_EK        =  B02.PERSON.STATUS.TT_ANV(YE_IND);                
    W_HENDELSE.BOSATT       =  B02.BOSATT(YP_IND);                              
    W_HENDELSE.YRKE_ENGANGSBELØP_11_7 =                                         
                  DIV_PARAM_OMR.ENGANGSBELØP_11_7(YP_IND);                      
    W_HENDELSE.YRKE_UFG     = B02.PERSON.YRKEPENS.YUG(YP_IND);                  
    W_HENDELSE.YRKE_KODE    = B02.YRKEPENS.YPT_KODE(YP_IND);                    
                                                                                
    IF B02.YRKEPENS.YPT (YP_IND) < B02.YRKE_POENG_1291(YP_IND) THEN             
       W_HENDELSE.YRKE_YPT     = B02.YRKE_POENG_1291(YP_IND);                   
    ELSE                                                                        
       W_HENDELSE.YRKE_YPT     = B02.YRKEPENS.YPT  (YP_IND);                    
                                                                                
    W_HENDELSE.YRKE_SPT     = B02.YRKEPENS.SPT  (YP_IND);                       
    W_HENDELSE.FORVENTET_INNTEKT = B02.FORVENTET(YP_IND);                       
    W_HENDELSE.FRYSDATO_ÅMD       = B02.FRYSDATO_ÅMD(YP_IND);                   
    W_HENDELSE.INNT_DATO_ÅMD      = B02.INNT_DATO_ÅMD(YP_IND);                  
    W_HENDELSE.FRYSKODE           = B02.FRYSKODE   (YP_IND);                    
    W_HENDELSE.GARANTIGRAD        = B02.GARANTIGRAD(YP_IND);                    
    IF B02.REAKTIVISERING(YP_IND) = 'J' THEN                                    
       W_HENDELSE.ATTF_KODE = '1';                                              
    ELSE                                                                        
    IF B02.UNNTAK_VENTETID (YP_IND) = 'J' THEN                                  
       W_HENDELSE.ATTF_KODE = '2';                                              
    IF B01.UFØRPENS.UFG(YP_IND) >                                               
       B02.UFØRPENS.UFG(YP_IND)  &                                              
      (B02.FRYSKODE    (YP_IND) ^= '1' &                                        
       B02.FRYSKODE    (YP_IND) ^= '2' ) THEN                                   
           W_HENDELSE. FRYSKODE = '3';                                          
    IF B02.STATUS.SIVILSTAND(YP_IND) ^= 'S' &                                   
       B02.STATUS.PENSJONSTYPE2(YP_IND) = 'E' THEN                              
       W_HENDELSE.TP_PROSENT = 55;                                              
    ELSE                                                                        
       W_HENDELSE.TP_PROSENT = B02.ETTEPENS.TP_PROSENT(YP_IND);                 
  /* *************************************************************** */         
  /* FØLGENDE FELT HENTES FRA EØS-INFO  (HL 0994                     */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.TT_PRORATA_MND = B02.TT_PRO_RATA_MND(YP_IND);                    
    W_HENDELSE.TT_TEORETISK_EØS_MND =                                           
                                B02.TT_TEORETISK_EØS_MND(YP_IND);               
    W_HENDELSE.SPT_EØS      =   B02.SPT_EØS(YP_IND);                            
    W_HENDELSE.OPT_EØS      =   B02.OPT_EØS(YP_IND);                            
    W_HENDELSE.ALTERNATIV_GP       = B02.ALTERNATIV_GP(YP_IND);                 
    W_HENDELSE.ALTERNATIV_TP       = B02.ALTERNATIV_TP(YP_IND);                 
    W_HENDELSE.ALTERNATIV_ST       = B02.ALTERNATIV_ST(YP_IND);                 
    W_HENDELSE.ALTERNATIV_ET       = B02.ALTERNATIV_ET(YP_IND);                 
    W_HENDELSE.ALTERNATIV_BT       = B02.ALTERNATIV_BT(YP_IND);                 
    W_HENDELSE.ALTERNATIV_SUM_PENSJON =                                         
                            B02.ALTERNATIV_SUM_PENSJON(YP_IND);                 
    W_HENDELSE.ANTALL_NORSKE_PÅ     = B02.ANTALL_NORSKE_PÅ(YP_IND);             
    W_HENDELSE.ANTALL_NORSKE_PÅ_ETTER91 =                                       
                            B02.ANTALL_NORSKE_PÅ_ETTER91(YP_IND);               
    W_HENDELSE.PRO_RATA_BEREGNING   = B02.PRO_RATA_BEREGNING(YP_IND);           
    W_HENDELSE.BEREGN_FOLKETRYGD    = B02.BEREGN_FOLKETRYGD(YP_IND);            
    W_HENDELSE.TEORETISK_BELØP_GP   = DIV_PARAM_OMR.TEORETISK_BELØP_GP;         
    W_HENDELSE.TEORETISK_BELØP_TP   = DIV_PARAM_OMR.TEORETISK_BELØP_TP;         
    W_HENDELSE.EØS_8_4_3A           = B02.EØS_8_4_3A(YP_IND);                   
    W_HENDELSE.PÅ_EØS_FAKTISK   = DIV_PARAM_OMR.PÅ_EØS_FAKTISK(YP_IND);         
   W_HENDELSE.PÅ_NORSK_FAKTISK = DIV_PARAM_OMR.PÅ_NORSK_FAKTISK(YP_IND);        
    W_HENDELSE.TT_NORSK_FAKTISK     = DIV_PARAM_OMR.TT_NORSK_FAKTISK;           
    W_HENDELSE.TT_SUM_FAKTISK     = DIV_PARAM_OMR.TT_SUM_FAKTISK;               
    W_HENDELSE.TT_TEORETISK       = DIV_PARAM_OMR.TT_TEORETISK;                 
    IF YE_IND < 3        THEN                                                   
       W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                            
                                GARANTITILLEGG_TP(YP_IND);                      
                                                                                
                                                                                
    IF B02.PENSJONSTYPE1(YE_IND)  =  'F' THEN                                   
         DO I = 1 TO 13;                                                        
            IF B02.FNR_TILKN(YP_IND,I) =   B02.FNR(YE_IND) THEN                 
                DO;                                                             
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(YP_IND,I);            
                   I = 13;                                                      
                END;                                                            
         END;                                                                   
                                                                                
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(YP_IND);         
    W_HENDELSE.GARANTITILLEGG_BARN =                                            
                            B02.FORSI.GARANTITILLEGG_BARN(YP_IND);              
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                         
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(YP_IND);               
                                /* FT 0591 TIL HIT */                           
                                                                                
    IF B02.PENSJONSTYPE1(YE_IND) = 'U'   THEN                                   
       DO;                                                                      
          W_HENDELSE.PÅ_EK        = B02.UFØRPENS.PÅ   (YE_IND);                 
          W_HENDELSE.OPT_EK       = B02.UFØRPENS.OPT  (YE_IND);                 
          W_HENDELSE.SPT_EK       = B02.UFØRPENS.SPT  (YE_IND);                 
          W_HENDELSE.SPT_1291_EK    = B02.UFØRPENS.SPT_1291(YE_IND);            
          W_HENDELSE.OPT_1291_EK    = B02.UFØRPENS.OPT_1291(YE_IND);            
        W_HENDELSE.PÅ_1291_EK     = B02.UFØRPENS.PÅ_1291  (YE_IND);             
        W_HENDELSE.PÅ_ETTER91_EK = B02.UFØRPENS.PÅ_ETTER91(YE_IND);             
       END;                                                                     
                                                                                
    IF B02.PENSJONSTYPE1(YE_IND) = 'Y'   THEN                                   
       DO;                                                                      
          W_HENDELSE.SPT_EK       = B02.YRKEPENS.YPT  (YE_IND);                 
       END;                                                                     
                                                                                
    IF B02.PENSJONSTYPE1(YE_IND) = 'A'   THEN                                   
       DO;                                                                      
          W_HENDELSE.PÅ_EK        = B02.ALDERSP.PÅ    (YE_IND);                 
          W_HENDELSE.OPT_EK       = B02.ALDERSP.OPT   (YE_IND);                 
          W_HENDELSE.SPT_EK       = B02.ALDERSP.SPT   (YE_IND);                 
          W_HENDELSE.SPT_1291_EK    = B02.ALDERSP.SPT_1291(YE_IND);             
          W_HENDELSE.OPT_1291_EK    = B02.ALDERSP.OPT_1291(YE_IND);             
        W_HENDELSE.PÅ_1291_EK     = B02.ALDERSP.PÅ_1291  (YE_IND);              
        W_HENDELSE.PÅ_ETTER91_EK = B02.ALDERSP.PÅ_ETTER91(YE_IND);              
       END;                                                                     
    IF B02.PENSJONSTYPE2(YP_IND) = 'E'   THEN                                   
       DO;                                                                      
          W_HENDELSE.PÅ_EK        = B02.ETTEPENS.PÅ_AVD  (YP_IND);              
          W_HENDELSE.OPT_EK       = B02.ETTEPENS.OPT_AVD  (YP_IND);             
          W_HENDELSE.SPT_EK       = B02.ETTEPENS.SPT_AVD  (YP_IND);             
          W_HENDELSE.SPT_1291_EK    = B02.ETTEPENS.SPT_1291(YP_IND);            
          W_HENDELSE.OPT_1291_EK    = B02.ETTEPENS.OPT_1291(YP_IND);            
        W_HENDELSE.PÅ_1291_EK     = B02.ETTEPENS.PÅ_1291  (YP_IND);             
        W_HENDELSE.PÅ_ETTER91_EK = B02.ETTEPENS.PÅ_ETTER91(YP_IND);             
       END;                                                                     
    IF B02.PENSJONSTYPE2(YE_IND) = 'U' !                                        
       B02.PENSJONSTYPE2(YE_IND) = 'M' THEN                                     
           W_HENDELSE.INNT4G_EK = B02.PENSJONSTYPE2(YE_IND);                    
                                                                                
    W_BARN_IND = 1;                                                             
    DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                                       
                                                                                
       DO K = 1 TO 13 WHILE (B02.FNR_TILKN(YP_IND,K) > 0);                      
                                                                                
          IF B02.FNR(J) = B02.FNR_TILKN(YP_IND,K) THEN                          
                                                                                
             DO;                                                                
                 W_HENDELSE.BARN.FNR_B(W_BARN_IND)    = B02.FNR(J);             
                 W_HENDELSE.BARN.PENSJONSTYPE2_B(W_BARN_IND) =                  
                                                 B02.PENSJONSTYPE2(J);          
                 W_HENDELSE.BARN.BT_FØR_0591(W_BARN_IND) =                      
                                B02.FT_FØR_91(YP_IND,K);                        
                 W_BARN_IND = W_BARN_IND + 1;                                   
                 K = 13;                                                        
             END;                                                               
       END;                                                                     
    END;                                                                        
                                                                                
    IF B02.PENSJONSTYPE1(YE_IND) = 'G' &                                        
       (B02.SIVILSTAND   (YE_IND) = 'G' !                                       
        B02.SIVILSTAND   (YE_IND) = 'W') &                                      
       B02.PENSJONSTYPE2(YE_IND) = 'M' THEN                                     
       DO;                                                                      
                                                                                
          DO I = 3 TO 14 WHILE (B02.FNR(I) > 0);                                
             IF B02.PENSJONSTYPE2(I) = 'R' &                                    
                W_HENDELSE.ANT_BT_REDUSERT < 3 THEN                             
                W_HENDELSE.ANT_BT_REDUSERT =                                    
                W_HENDELSE.ANT_BT_REDUSERT + 1;                                 
          END;                                                                  
       END;                                                                     
                                                                                
  /* *************************************************************** */         
  /* FØLGENDE FELT HENTES FRA YRKESSKADEHISTORIKKK                   */         
  /* *************************************************************** */         
                                                                                
  DO M = 10 TO 1 BY -1  UNTIL (B02.YRKEHIST.YUFT_ÅMD                            
                                       (YP_IND,M) > 0);                         
  END;                                                                          
   IF DIV_PARAM_OMR.ENGANGSBELØP_11_7(YP_IND) > 0 THEN                          
     DO;                                                                        
        W_HENDELSE.YRKE_UFG     = B02.YRKEHIST.YUG(YP_IND,M);                   
     END;                                                                       
                                                                                
  W_HENDELSE.YRKE_YUFT_ÅMD = B02.YRKEHIST.YUFT_ÅMD(YP_IND,M);                   
  W_HENDELSE.YRKE_YST_ÅMD = B02.YRKEHIST.YST_ÅMD (YP_IND,M);                    
  IF B02.YRKEHIST.AÅI (YP_IND,M) = 9999999 THEN                                 
     W_HENDELSE.YRKE_AÅI         = 0;                                           
  ELSE                                                                          
     W_HENDELSE.YRKE_AÅI         = B02.YRKEHIST.AÅI   (YP_IND,M);               
  W_HENDELSE.YRKE_YRKE11  = B02.YRKEHIST.YRKE11 (YP_IND,M);                     
  W_HENDELSE.YRKE_PAÅ     = B02.YRKEHIST.PAÅ   (YP_IND,M);                      
                                                                                
 IF B02.PENSJONSTYPE2(YP_IND) = 'E'             THEN                            
 DO;                                                                            
                                                                                
                                                                                
    W_HENDELSE.YRKE_UFG_AVD = B02.YRKEPENS.YUG(YE_IND);                         
    W_HENDELSE.YRKE_KODE_AVD = B02.YRKEPENS.YPT_KODE(YE_IND);                   
    IF B02.YRKEPENS.YPT (YE_IND) < B02.YRKE_POENG_1291(YE_IND) THEN             
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKE_POENG_1291(YE_IND);                   
    ELSE                                                                        
       W_HENDELSE.YRKE_YPT_AVD = B02.YRKEPENS.YPT  (YE_IND);                    
                                                                                
    W_HENDELSE.YRKE_SPT_AVD = B02.YRKEPENS.SPT  (YE_IND);                       
                                                                                
  DO Y = 1  TO 10 WHILE (B02.YRKEHIST.YUFT_ÅMD (YE_IND,Y) > 0);                 
                                                                                
     W_HENDELSE.YRKE_UFG_AVD     = B02.YRKEHIST.YUG(YE_IND,Y);                  
     W_HENDELSE.YRKE_YUFT_ÅMD_AVD = B02.YRKEHIST.YUFT_ÅMD(YE_IND,Y);            
     W_HENDELSE.YRKE_YST_ÅMD_AVD = B02.YRKEHIST.YST_ÅMD (YE_IND,Y);             
     IF B02.YRKEHIST.AÅI (YE_IND,Y) = 9999999 THEN                              
        W_HENDELSE.YRKE_AÅI_AVD    = 0;                                         
     ELSE                                                                       
        W_HENDELSE.YRKE_AÅI_AVD     = B02.YRKEHIST.AÅI   (YE_IND,Y);            
                                                                                
     W_HENDELSE.YRKE_YRKE11_AVD  = B02.YRKEHIST.YRKE11 (YE_IND,Y);              
     W_HENDELSE.YRKE_PAÅ_AVD     = B02.YRKEHIST.PAÅ   (YE_IND,Y);               
  END;                                                                          
 END;                                                                           
  /* *************************************************************** */         
  /* FØLGENDE FELT HENTES FRA P0014009                               */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(YP_IND);                      
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(YE_IND);                      
                                                                                
    /* -------------------------------------------------------------- */        
    /* OPPDATO_2000R INNTEKTSGRENSE:              HENTES FRA R0014427 */        
    /* -------------------------------------------------------------- */        
    IF B02.UFØRPENS.UFG(YP_IND) > 0 THEN                                        
       W_HENDELSE.INNTEKTSGRENSE = B02.UFØRPENS.LOVLIG_INNTEKT(YP_IND);         
    /* -------------------------------------------------------------- */        
    /* OPPDATERER INNTEKTSKODE - BLIR SATT I 4428                     */        
    /* -------------------------------------------------------------- */        
    W_HENDELSE.INNTEKTSKODE1 = B02.UFØRPENS.INNTEKTSKODE1(YP_IND);              
    W_HENDELSE.INNTEKTSKODE2 = B02.UFØRPENS.INNTEKTSKODE2(YP_IND);              
    /* -------------------------------------------------------------- */        
    /* OPPLYSNINGEN UNDER ER FOR OVERFØRING TIL INFOTRYGD, VI GIR     */        
    /* IKKE OPPLYSNINGER OM INNTEKTSGRENSER I SELVE PENSJONSBREVET,   */        
    /* MEN BARE PÅ VEDLEGGET TIL TRYGDEKONTORET.                      */        
    /* - DETTE ETTER ØNSKE FRA SYSTEMEIER.......                      */        
    /* -------------------------------------------------------------- */        
    W_HENDELSE.FRIINNTEKT_DATO_ÅMD =                                            
       B02.STATUS.FRIINNTEKT_DATO_ÅMD(YP_IND);                                  
    /* 1. REAKTIVISERING            -> 5 */                                     
 /* IF (B02.UFØRPENS.REAKTIVISERING(YP_IND) = 'J' &                             
        B02.UFØRPENS.UFG(YP_IND)           >  49 ) THEN                         
       W_HENDELSE.INNTEKTSKODE = 5;                                             
    ELSE                                                                        
    /* 2. UNNTAK_VENTETID ? -> 6 */                                             
 /* IF (B02.UFØRPENS.UNNTAK_VENTETID(YP_IND)   = 'J' &                          
        B02.UFØRPENS.UFG(YP_IND)           >  49 ) THEN                         
       W_HENDELSE.INNTEKTSKODE = 6;                                             
    ELSE                                                                        
    /* 3. 100% UFØR ?FORELØPIG -> 3 */                                          
 /* IF (B02.UFØRPENS.UFG(YP_IND) = 100 &                                        
        B02.PENSJONSTYPE3(YP_IND)= 'A' ) THEN                                   
       W_HENDELSE.INNTEKTSKODE = 3;                                             
    ELSE                                                                        
    /* 3. 100% UFØR ? -> 4 */                                                   
 /* IF (B02.UFØRPENS.UFG(YP_IND) = 100 &                                        
        B02.PENSJONSTYPE3(YP_IND)= ' ' ) THEN                                   
       W_HENDELSE.INNTEKTSKODE = 4;                                             
    /* 4. UFØREGRAD > 0 & < 50 ? -> 7 */                                        
 /* IF (B02.UFØRPENS.UFG(YP_IND) >  0 &                                         
        B02.UFØRPENS.UFG(YP_IND) < 50 ) THEN                                    
       W_HENDELSE.INNTEKTSKODE = 7;                                             
    ELSE                                                                        
    /* 5. KOMBINERT VURDERT ? -> 11 ! 12 */                                     
  /*IF (B02.STATUS.YRKES_KODE(YP_IND) = 11 !                                    
        B02.STATUS.YRKES_KODE(YP_IND) = 12 )THEN                                
       W_HENDELSE.INNTEKTSKODE = 2;                                             
    ELSE                                                                        
    IF (W_HENDELSE.INNTEKTSGRENSE = 0) THEN                                     
       W_HENDELSE.INNTEKTSKODE = 3;                                             
    ELSE                                                                        
       W_HENDELSE.INNTEKTSKODE = 1;                                             
                                                                                
    /* -------------------------------------------------------------- */        
                                                                                
    CALL PLASSER_TEKST(YP_IND,YE_IND);                                          
                                                                                
    CALL INSERT_HENDELSE;                                                       
                                                                                
  /* *************************************************************** */         
  /* HVIS SLUTTPOENGTALLET ER STØRRE ENN 0 SKAL BEREGNINSGUNNLAG-    */         
  /* SEGMENT BYGGES OPP                                              */         
  /* *************************************************************** */         
                                                                                
                                                                                
    IF W_HENDELSE.YRKE_SPT > 0 THEN                                             
       DO;                                                                      
          CALL BYGG_OPP_BERGRUNL_SEGMENT(YP_IND);                               
       END;                                                                     
                                                                                
  /* *************************************************************** */         
                                                                                
 BEREGN_INNTEKT_FØR_YP: PROC;                                                   
                                                                                
                                                                                
   DCL         FNR_PIC13                PIC '(13)9',                            
               W_UFT_ÅMD                PIC '99999999',                         
               GAMMEL_GRAD              FIXED DEC     (3) INIT(0),              
               GV                       FIXED DEC     (7) INIT(0),              
               G_UFT                    FIXED DEC     (7) INIT(0),              
               INNTEKT                  FIXED DEC     (7) INIT(0),              
               POENG                    FIXED DEC   (5,2) INIT(0),              
               ÅRET                     FIXED DEC     (3);                      
                                                                                
    DCL       W_UFT_Å DEF W_UFT_ÅMD POS (1)    PIC    '9999';                   
    DCL       W_UFT_M DEF W_UFT_ÅMD POS (5)    PIC    '99';                     
                                                                                
    DCL        VIRK_ÅR_MND                  FIXED DEC (4);                      
    DCL        FNR_ÅR DEF FNR_PIC13 POS(5)    PIC '999';                        
    DCL        G_VIRK   FIXED DEC (5) INIT (0);                                 
    DCL        W_INNTUP      FIXED DEC (9) INIT (0);                            
    DCL        W_FAK         FIXED DEC (9,6) INIT (0);                          
                                                                                
                                                                                
 /*PROGRAMMET BEGYNNER HER:*/                                                   
                                                                                
    FNR_PIC13 = KONV_FNR11_FNR13((B02.FNR(YP_IND)));                            
    G_VIRK    = G;                                                              
                                                                                
 /* *************************************************************** */          
 /* FOR Å REGNE INNTKET_FØR_YP ÅMD VI:                              */          
 /*                      FINNE GRUNNBELØPET PÅ UFØRETIDSPUNKTET     */          
 /*                      FINNE GRUNNBELØPET PÅ DAGEN                */          
 /* *************************************************************** */          
                                                                                
    W_UFT_ÅMD  = B02.INNT_DATO_ÅMD(YP_IND);                                     
                                                                                
    DO J = 1 TO 65;                                                             
       IF W_UFT_ÅMD      >= PERIODE_START_ÅMD(J) &                              
          W_UFT_ÅMD      <= PERIODE_SLUTT_ÅMD(J) THEN                           
          DO;                                                                   
             G_UFT             = G_TAB_PERIODE.GRUNNBELØP(J);                   
             J                 = 99;                                            
          END;                                                                  
    END;                                                                        
                                                                                
    IF G_UFT   > 0  THEN                                                        
      DO;                                                                       
         W_FAK         = ROUND(G / G_UFT,6);                                    
         W_INNTUP      = B02.INNTEKT_FØR_UP(YP_IND) * 100;                      
         W_INNTUP      = W_INNTUP * W_FAK;                                      
         W_INNT_GRENSE = W_INNTUP / 10;                                         
      END;                                                                      
 END BEREGN_INNTEKT_FØR_YP ;                                                    
                                                                                
  /* *************************************************************** */         
                                                                                
  END  LAG_YRKEPENS_HEND;                                                       
