 /*   SIST ENDRET PÅ PROD   2004.07.16 12.36.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.12 13.23.58 AV   JDA2970          */        
 /*       SIST ENDRET 02/02-99 09.59.08 AV   JDA7339                  */        
 /*       SIST ENDRET 02/02-99 09.57.59 AV   JDA7339                  */        
 /*       SIST ENDRET 06/04-94 14.53.18 AV   DYBVIK                   */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001IA04 - SUBPROGRAM - BLANKER ARBEIDSOMRÅDE OO */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : PATAHK                                           */        
 /*  PROGRAMMET BLE LAGET : FEB 1994                                  */        
 /*  ENDRINGERSDATO : 04.06.1998.                                     */        
 /*  ENDRINGEN GJELDER: ÅR2000 - O.GØYTIL.                            */        
 /*                                                                   */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*    SKRIV  DATA TIL REG.                                           */        
 /*    ENDRET AV O.G. 16.09.1998 PGA. 'VILL DATO' (980916 --> 80916). */        
 /* ***************************************************************** */        
 %SKIP(2);                                                                      
 /*-----LAGT INN AV O.G. 17.12.1998---------------------------------- */        
    DCL BUFF_X         CHAR(8);                                                 
    DCL DGNR_X  DEF BUFF_X PIC '(7)9',                                          
        BÅR_X   DEF BUFF_X PIC '9999',                                          
        TESTB_X DEF BUFF_X POS(8) CHAR(1),                                      
        ÅRDATO  DEF BUFF_X POS(1) PIC '(8)9',                                   
        DGNR_X_PAK   FIXED DEC(7);                                              
 /*-----LAGT INN AV O.G. 16.12.1998---------------------------------- */        
                                                                                
 OVERFØR_INNTEKT_TIL:  PROC(FEIL_FUNNET);                                       
                                                                                
    DCL   FEIL_FUNNET  BIT (1) ;                                                
                                                                                
    CALL DATABASE ('OPEN ');                                                    
                                                                                
 /*-----LAGT INN AV O.G. 17.12.1998---------------------------------- */        
    ÅRDATO = DATO_2000;                                                         
    BUFF_X = R0019947(BUFF_X);                                                  
    DGNR_X_PAK = DGNR_X;                                                        
 /*-----LAGT INN AV O.G. 17.12.1998---------------------------------- */        
                                                                                
    SKRIV_KODE = ' ';                                                           
    MER_DATA   =    '0'B;                                                       
    RF1_KODE   = ' ';                                                           
    UT.FRA_FNR            =  OOS.FRA_FNR;                                       
    UT.TIL_FNR            =  OOS.TIL_FNR;                                       
    UT.START_ÅR           =  OOS.START_ÅR;                                      
    UT.BARN_ANTTAL        =  OOS.BARN_ANTTAL;                                   
    DO K = 1 TO 12;                                                             
       UT.FNR_BARN (K)       =  OOB.FNR_BARN (K);                               
    END;                                                                        
                                                                                
   CALL LES_Q_ROT;                                                              
   IF RF1_KODE = ' '  THEN                                                      
      DO;                                                                       
                                                                                
         CALL LES_INNTEKT_GNP;                                                  
                                                                                
         DO WHILE (RF1_KODE = ' ' & SKRIV_KODE = ' ' & MER_DATA);               
                                                                                
            IF PI_SEGM.ÅR    = OOS.START_ÅR  &                                  
               PI_SEGM.TYPE  = 'J'                  THEN                        
               DO;                                                              
                  UT.FRA_FNR            =  OOS.FRA_FNR;                         
                  UT.TIL_FNR            =  OOS.TIL_FNR;                         
                  UT.START_ÅR           =  OOS.START_ÅR;                        
                  UT.BARN_ANTTAL        =  OOS.BARN_ANTTAL;                     
                  DO K = 1 TO 12;                                               
                     IF  OOB.FNR_BARN (K) > 0 THEN                              
                         UT.FNR_BARN (K)    =  OOB.FNR_BARN (K);                
                     ELSE                                                       
                         UT.FNR_BARN (K)    =  0;                               
                  END;                                                          
                                                                                
              /*  UT.TYPE (K)           =  PI_SEGM.TYPE;                        
                  UT.ÅR   (K)           =  PI_SEGM.ÅR;                          
                  UT.INNTEKT(K)         =  PI_SEGM.PI;                          
              */                                                                
              /*  EXEC CICS WRITE DATASET ('FNR9W33') FROM (UT) */              
                  DSNAVN = 'OMSORGE';                                           
                                                                                
                  EXEC CICS WRITE DATASET ('OMSORGE') FROM (UT)                 
                                           RIDFLD(OMS_RBA) RBA;                 
                  CALL OPPDATE_DR_OMSORGSPOENG;                                 
                  CALL FJERNE_BARN_OMSORGE_FRAFNR;                              
                  CALL UPDATE_BARN_OMSORGE_TILFNR;                              
                                                                                
                  SKRIV_KODE = 'X';                                             
              END;                                                              
                                                                                
              IF  SKRIV_KODE = ' '  THEN                                        
                  CALL LES_INNTEKT_GNP;                                         
         END;                                                                   
      END;                                                                      
                                                                                
     IF SKRIV_KODE = ' ' THEN                                                   
        DO;                                                                     
          FEIL_FUNNET  = '1'B;                                                  
          OOSP. INNTEKTNR = '2';                                                
        END;                                                                    
                                                                                
      IF RF1_KODE   = 'X'  THEN                                                 
         DO;                                                                    
             FEIL_FUNNET  = '1'B;                                               
             OOSP.INNTEKTNR = '2';                                              
         END;                                                                   
                                                                                
                                                                                
     CALL DATABASE ('TERM');                                                    
 END  OVERFØR_INNTEKT_TIL;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */        
    /*                                                                */        
    /* ************************************************************** */        
  LES_Q_ROT: PROC;                                                              
                                                                                
                                                                                
                                                                                
      ROOT = '';                                                                
      SSA1_RF0PERSN.PKEY = OOS.FRA_FNR;                                         
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GU,                        
                                                 RF1,                           
                                                 ROOT  ,                        
                                                 SSA1_RF0PERSN);                
                                                                                
      IF   UIBFCTR              =     UIB_RC_OK    THEN                         
        DO;                                                                     
           IF RF1.STATUS_KODE   =  '  '  THEN                                   
               RF1_KODE = ' ';                                                  
           ELSE                                                                 
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  OOS.FRA_FNRNR = 1713;                                         
                  RF1_KODE = 'X';                                               
               END;                                                             
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
           RF1_KODE = 'X';                                                      
        END;                                                                    
                                                                                
    END LES_Q_ROT;                                                              
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
   LES_INNTEKT_GNP:PROC;                                                        
                                                                                
      SSA_UQUAL = 'PINNTEKT';                                                   
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GHNP,                      
                                                 RF1,                           
                                                 PI_SEGM,                       
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR              =     UIB_RC_OK    THEN                         
        DO;                                                                     
           IF RF1.STATUS_KODE   =  '  '  !                                      
              RF1.STATUS_KODE   =  'GA'  !                                      
              RF1.STATUS_KODE   =  'GK'  THEN                                   
               MER_DATA                     =    '1'B;                          
           ELSE                                                                 
               MER_DATA                     =    '0'B;                          
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
           MER_DATA                         =    '0'B;                          
           RF1_KODE                         =    'X';                           
        END;                                                                    
                                                                                
   END LES_INNTEKT_GNP;                                                         
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR FJERN PINNTEKT SEG                               */        
    /*  OG UPDATE INTEKT-MARK                                         */        
    /*                                                                */        
    /* ************************************************************** */        
  FJERNE_BARN_OMSORGE_FRAFNR: PROC;                                             
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_DLET,                      
                                                 RF1,                           
                                                 PI_SEGM);                      
                                                                                
      IF   UIBFCTR              =     UIB_RC_OK    THEN                         
        DO;                                                                     
           IF RF1.STATUS_KODE  =  '  '   THEN                                   
               RF1_KODE                         =    ' ';                       
           ELSE                                                                 
               RF1_KODE                         =    'X';                       
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
               RF1_KODE                         =    'X';                       
        END;                                                                    
                                                                                
                                                                                
  END FJERNE_BARN_OMSORGE_FRAFNR;                                               
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */        
    /*  OG UPDATE INTEKT-MARK                                         */        
    /*                                                                */        
    /* ************************************************************** */        
  UPDATE_BARN_OMSORGE_TILFNR: PROC;                                             
   CALL LES_TIL_FNR;                                                            
                                                                                
   IF RF1_KODE = ' ' THEN                                                       
      DO;                                                                       
                                                                                
         PI_SEGM.TYPE             = 'J' ;                                       
         PI_SEGM.ÅR               =    OOS.START_ÅR  ;                          
         PI_SEGM.PI               = 0;                                          
 /*-----LAGT INN AV O.G. 17.12.1998---------------------------------- */        
 /*      PI_SEGM.PI_RAPPDATO      = DATE;   '980916' --> '80916'      */        
         PI_SEGM.PI_RAPPDATO      = DGNR_X_PAK;                                 
 /*-----LAGT INN AV O.G. 17.12.1998---------------------------------- */        
         CALL SKRIV_PINNTEKT;                                                   
      END;                                                                      
   IF RF1_KODE ^= ' ' THEN                                                      
      DO;                                                                       
          FEIL_FUNNET = '1'B;                                                   
          OOS.TIL_FNRNR = 0217;                                                 
      END;                                                                      
                                                                                
  END UPDATE_BARN_OMSORGE_TILFNR;                                               
                                                                                
  LES_TIL_FNR: PROC;                                                            
                                                                                
      SSA1_RF0PERSN.PKEY = OOS.TIL_FNR;                                         
      ROOT = '';                                                                
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GHU,                       
                                                 RF1,                           
                                                 ROOT,                          
                                                 SSA1_RF0PERSN);                
                                                                                
      IF   UIBFCTR              =     UIB_RC_OK    THEN                         
        DO;                                                                     
           IF RF1.STATUS_KODE   =  '  '  THEN                                   
               RF1_KODE = ' ';                                                  
           ELSE                                                                 
              DO;                                                               
                 FEIL_FUNNET = '1'B;                                            
                 OOS.TIL_FNRNR = 1713;                                          
                 RF1_KODE = 'X';                                                
              END;                                                              
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
           RF1_KODE = 'X';                                                      
        END;                                                                    
                                                                                
  END LES_TIL_FNR;                                                              
                                                                                
                                                                                
   SKRIV_PINNTEKT:    PROC;                                                     
                                                                                
      SSA_UQUAL = 'PINNTEKT ';                                                  
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_ISRT,                      
                                                 RF1,                           
                                                 PI_SEGM,                       
                                                 SSA1_RF0PERSN,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR              =     UIB_RC_OK    THEN                         
        DO;                                                                     
           IF RF1.STATUS_KODE  =  '  '   THEN                                   
               RF1_KODE                         =    ' ';                       
           ELSE                                                                 
               RF1_KODE                         =    'X';                       
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
               RF1_KODE                         =    'X';                       
        END;                                                                    
                                                                                
   END SKRIV_PINNTEKT;                                                          
                                                                                
                                                                                
                                                                                
 DATABASE:                                                                      
   PROC(STYRING);                                                               
                                                                                
   DCL                                                                          
     STYRING                               CHAR(5),                             
     NULL                                  BUILTIN,                             
     UNSPEC                                BUILTIN;                             
                                                                                
                                                                                
     DCL                                                                        
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');                 
     DCL                                                                        
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
  %PAGE;                                                                        
                                                                                
     IF STYRING = 'OPEN' THEN                                                   
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_3,                
                                                  W01_PCB_FUNCTION,             
                                                  W01_PSB_NAVN,                 
                                                  UIBPTR);                      
                                                                                
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN           
             DO;                                                                
               ALLOCATE PCB_UIB_PEKER_OMR;                                      
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;                  
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;                    
             END;                                                               
           ELSE                                                                 
             DO;                                                                
               FEIL_KODE    = '1'B;                                             
               MELDING1O =                                                      
               'NOE ER GALT MED DATABASEN, KODE: ' !!                           
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);                       
             END;                                                               
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_1,                
                                                  W01_TERM_FUNCTION);           
           KOM_OMR.PCB_UIB_PEKER = NULL;                                        
        END;                                                                    
                                                                                
 END DATABASE;                                                                  
                                                                                
                                                                                
