 /*       SIST ENDRET 22/06-98 12.24.34 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/06-98 09.09.44 AV   RFA9991                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0011406 - PROSEDYRE I PLI                                     */00000030
 /*    PROGRAMMERER:  JAN, AUGUST 1981                                */00000040
 /*HENSIKT:                                                           */00000050
 /*    PROGRAMMET INNEHOLDER:                                         */00000060
 /*        PROSEDYRER FOR Å OVERFØRE DATA FRA E1_TRANS_OMR TIL        */00000070
 /*            SKJERMBILDE (MAP S001141 MAPSET S001143).              */00000080
 /*    PROSEDYRE FOR SKRIVING AV FEILMELDINGER.                       */00000090
 /*BRUK:                                                              */00000100
 /*    OVERFØR_E1SØKER_MAP:    OVERFØRING AV SØKERDELEN               */00000110
 /*    OVERFØR_E1KAP7_MAP:     OVERFØRING AV KAPITTEL 7               */00000120
 /*    OVERFØR_E1KAP8_MAP:     OVERFØRING AV KAPITTEL 8               */00000130
 /*    OVERFØR_E1KAP10_MAP:    OVERFØRING AV KAPITTEL 10              */00000140
 /*    OVERFØR_E1KAP11_MAP:    OVERFØRING AV KAPITTEL 11        */      00000150
 /*                                                                   */00000160
 /*                                                                   */00000170
 %PAGE;                                /*   */                          00000180
 /* ***************************************************************** */00000190
 /*                                                                   */00000200
 /*   PROSEDYRA OVERFØRER DATA FRA E1_TRANS_OMR.E1S TIL               */00000210
 /*   SKJERMBILDE E1_SØKER DELEN.                                     */00000220
 /*   MAP: S001141                                                    */00000230
 /*   MAPSET: S001143                                                 */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 %SKIP(2);                                                              00000270
 OVERFØR_E1SØKER_MAP:                                                   00000280
   PROC;                                                                00000290
   DCL                                                                  00000300
      NORMAL  CHAR (1) INIT(' '),                                       00000310
      NOR_NUM CHAR (1) INIT('&'),                                       00000320
      BRI_NUM CHAR (1) INIT('Q');                                       00000330
 %SKIP(2);                                                              00000340
      S001141O.REGDATOO        =  KONV_HÅMD_ÅMD (E1S.REGDATO_ÅMD);      00000350
      S001141O.TERMIDO         =  E1S.TERMID                    ;       00000360
      S001141O.FNRO            =  F_FELT_PIC_CHAR11 (E1S.FNR)   ;       00000370
      S001141O.TKNRO           =  F_FELT_PIC_CHAR4 (E1S.TKNR)   ;       00000380
      S001141O.SPRÅKO          =  E1S.SPRÅK                     ;       00000390
      S001141O.VIRK_DATO_MÅO   =  KONV_HÅMD_MÅ(VIRK_DATO_ÅMD);          00000400
      S001141O.NAVN_NYTTO      =  E1S.NAVN_NYTT                 ;       00000410
      S001141O.NAVN_NYTT_EKO   =  E1S.NAVN_NYTT_EK              ;       00000420
                                                                        00000430
      IF F_FELT_PIC_CHAR11(E1S.FNR_EK) ^= (11)'0' THEN                  00000440
         S001141O.FNR_EKO      = F_FELT_PIC_CHAR11 (E1S.FNR_EK);        00000450
                                                                        00000460
      S001141O.NAVN_EKO        =  E1S.NAVN_EK                   ;       00000470
      S001141O.SKILSMISSEO     =  E1S.SKILSMISSE                ;       00000480
      S001141O.FLYTTET_FRAO    =  E1S.FLYTTET_FRA               ;       00000490
      S001141O.FLYTTET_SAMMENO =  E1S.FLYTTET_SAMMEN            ;       00000500
      S001141O.UNDER4GO        =  E1S.EK_INNTU                  ;       00000510
      S001141O.MINST4GO        = E1S.EK_INNTM                  ;        00000520
 %SKIP(3);                             /*    */                         00000530
                                                                        00000540
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00000550
                                                                        00000560
      S001141O.DUMMYA = '_';                                            00000570
                                                                        00000580
  /*DERSOM FEIL FRA BEHANDLE-TRANS OVERFØRES FEIL HER,BARE FØRSTE GANG*/00000590
       IF ^ FRA_CICS THEN                                               00000600
          DO;                                                           00000610
            IF FEIL_MELD_NR > 0 THEN                                    00000620
               CALL SKRIV_FEIL(FEIL_MELD_NR);                           00000630
             FEIL_MELD_NR = 0;                                          00000640
          END;                                                          00000650
                                                                        00000660
      S001141O.REGDATOA = DFHBMASK;                                     00000670
      S001141O.TERMIDA  = DFHBMASK;                                     00000680
                                                                        00000690
      IF E1S.FNRNR = 0 THEN                                             00000700
         S001141O.FNRA = NOR_NUM;                                       00000710
      ELSE                                                              00000720
         DO;                                                            00000730
            S001141O.FNRA = BRI_NUM;                                    00000740
            S001141I.FNRL = CURSOR_POS;                                 00000750
            IF E1S.FNRNR ^= 999 THEN                                    00000760
               CALL SKRIV_FEIL(E1S.FNRNR);                              00000770
         END;                                                           00000780
                                                                        00000790
      IF E1S.TKNRNR = 0 THEN                                            00000800
         S001141O.TKNRA = NOR_NUM;                                      00000810
      ELSE                                                              00000820
         DO;                                                            00000830
            S001141O.TKNRA = BRI_NUM;                                   00000840
            S001141I.TKNRL = CURSOR_POS;                                00000850
            IF E1S.TKNRNR ^= 999 THEN                                   00000860
               CALL SKRIV_FEIL(E1S.TKNRNR);                             00000870
         END;                                                           00000880
      IF E1S.SPRÅKNR = 0 THEN                                           00000890
         S001141O.SPRÅKA = NORMAL;                                      00000900
      ELSE                                                              00000910
         DO;                                                            00000920
            S001141O.SPRÅKA = DFHBMBRY;                                 00000930
            S001141I.SPRÅKL = CURSOR_POS;                               00000940
            IF E1S.SPRÅKNR ^= 999 THEN                                  00000950
               CALL SKRIV_FEIL(E1S.SPRÅKNR);                            00000960
         END;                                                           00000970
      IF E1S.VIRK_DATO_ÅMDNR = 0 THEN                                   00000980
         S001141O.VIRK_DATO_MÅA = NOR_NUM;                              00000990
      ELSE                                                              00001000
         DO;                                                            00001010
            S001141O.VIRK_DATO_MÅA = BRI_NUM;                           00001020
            S001141I.VIRK_DATO_MÅL = CURSOR_POS;                        00001030
            IF E1S.VIRK_DATO_ÅMDNR ^= 999 THEN                          00001040
               CALL SKRIV_FEIL(E1S.VIRK_DATO_ÅMDNR);                    00001050
         END;                                                           00001060
      IF E1S.NAVN_NYTTNR = 0 THEN                                       00001070
         S001141O.NAVN_NYTTA = NORMAL;                                  00001080
      ELSE                                                              00001090
         DO;                                                            00001100
            S001141O.NAVN_NYTTA = DFHBMBRY;                             00001110
            S001141I.NAVN_NYTTL = CURSOR_POS;                           00001120
            IF E1S.NAVN_NYTTNR ^= 999 THEN                              00001130
               CALL SKRIV_FEIL(E1S.NAVN_NYTTNR);                        00001140
         END;                                                           00001150
      IF E1S.NAVN_NYTT_EKNR = 0 THEN                                    00001160
         S001141O.NAVN_NYTT_EKA = NORMAL;                               00001170
      ELSE                                                              00001180
         DO;                                                            00001190
            S001141O.NAVN_NYTT_EKA = DFHBMBRY;                          00001200
            S001141I.NAVN_NYTT_EKL = CURSOR_POS;                        00001210
            IF E1S.NAVN_NYTT_EKNR ^= 999 THEN                           00001220
               CALL SKRIV_FEIL(E1S.NAVN_NYTT_EKNR);                     00001230
         END;                                                           00001240
      IF E1S.FNR_EKNR = 0 THEN                                          00001250
         S001141O.FNR_EKA = NOR_NUM;                                    00001260
      ELSE                                                              00001270
         DO;                                                            00001280
            S001141O.FNR_EKA = BRI_NUM;                                 00001290
            S001141I.FNR_EKL = CURSOR_POS;                              00001300
            IF E1S.FNR_EKNR ^= 999 THEN                                 00001310
               CALL SKRIV_FEIL(E1S.FNR_EKNR);                           00001320
         END;                                                           00001330
      IF E1S.NAVN_EKNR = 0 THEN                                         00001340
         S001141O.NAVN_EKA = NORMAL;                                    00001350
      ELSE                                                              00001360
         DO;                                                            00001370
            S001141O.NAVN_EKA = DFHBMBRY;                               00001380
            S001141I.NAVN_EKL = CURSOR_POS;                             00001390
            IF E1S.NAVN_EKNR ^= 999 THEN                                00001400
               CALL SKRIV_FEIL(E1S.NAVN_EKNR);                          00001410
         END;                                                           00001420
      IF E1S.SKILSMISSENR = 0 THEN                                      00001430
         S001141O.SKILSMISSEA = NORMAL;                                 00001440
      ELSE                                                              00001450
         DO;                                                            00001460
            S001141O.SKILSMISSEA = DFHBMBRY;                            00001470
            S001141I.SKILSMISSEL = CURSOR_POS;                          00001480
            IF E1S.SKILSMISSENR ^= 999 THEN                             00001490
               CALL SKRIV_FEIL(E1S.SKILSMISSENR);                       00001500
         END;                                                           00001510
      IF E1S.FLYTTET_FRANR = 0 THEN                                     00001520
         S001141O.FLYTTET_FRAA = NORMAL;                                00001530
      ELSE                                                              00001540
         DO;                                                            00001550
           S001141O.FLYTTET_FRAA = DFHBMBRY;                            00001560
           S001141I.FLYTTET_FRAL = CURSOR_POS;                          00001570
           IF E1S.FLYTTET_FRANR ^= 999 THEN                             00001580
              CALL SKRIV_FEIL(E1S.FLYTTET_FRANR);                       00001590
         END;                                                           00001600
      IF E1S.FLYTTET_SAMMENNR = 0 THEN                                  00001610
         S001141O.FLYTTET_SAMMENA = NORMAL;                             00001620
      ELSE                                                              00001630
         DO;                                                            00001640
           S001141O.FLYTTET_SAMMENA = DFHBMBRY;                         00001650
           S001141I.FLYTTET_SAMMENL = CURSOR_POS;                       00001660
           IF E1S.FLYTTET_SAMMENNR ^= 999 THEN                          00001670
              CALL SKRIV_FEIL(E1S.FLYTTET_SAMMENNR);                    00001680
         END;                                                           00001690
      IF E1S.EK_INNTUNR = 0 THEN                                        00001700
         S001141O.UNDER4GA = NORMAL;                                    00001710
      ELSE                                                              00001720
         DO;                                                            00001730
           S001141O.UNDER4GA = DFHBMBRY;                                00001740
           S001141I.UNDER4GL = CURSOR_POS;                              00001750
           IF E1S.EK_INNTUNR ^= 999 THEN                                00001760
              CALL SKRIV_FEIL(E1S.EK_INNTUNR);                          00001770
         END;                                                           00001780
      IF E1S.EK_INNTMNR = 0 THEN                                        00001790
         S001141O.MINST4GA = NORMAL;                                    00001800
      ELSE                                                              00001810
         DO;                                                            00001820
           S001141O.MINST4GA = DFHBMBRY;                                00001830
           S001141I.MINST4GL = CURSOR_POS;                              00001840
           IF E1S.EK_INNTMNR ^= 999 THEN                                00001850
              CALL SKRIV_FEIL(E1S.EK_INNTMNR);                          00001860
         END;                                                           00001870
                                                                        00001880
      /* VED GAMLE TRANS SKAL FNR OG VIRKNINGSDATO BLOKKERES   */       00001890
                                                                        00001900
      IF TRANS_OPPL_OMR.NY_GML_TRANS_IND = 'G' & FRA_MED_DIALOG THEN    00001910
         DO;                                                            00001920
           S001141O.FNRA            = DFHBMASK; /* PROT AND ASKIP */    00001930
           S001141O.VIRK_DATO_MÅA   = DFHBMASK;                         00001940
         END;                                                           00001950
                                                                        00001960
      ELSE IF FRA_UTEN_DIALOG THEN  /* BLOKKER ALT SAMMEN  */           00001970
                                                                        00001980
         DO;                                                            00001990
           S001141O.REGDATOA        = DFHBMASK;                         00002000
           S001141O.TERMIDA         = DFHBMASK;                         00002010
           S001141O.FNRA            = DFHBMASK;                         00002020
           S001141O.TKNRA           = DFHBMASK;                         00002030
           S001141O.SPRÅKA          = DFHBMASK;                         00002040
           S001141O.VIRK_DATO_MÅA   = DFHBMASK;                         00002050
           S001141O.NAVN_NYTTA      = DFHBMASK;                         00002060
           S001141O.NAVN_NYTT_EKA   = DFHBMASK;                         00002070
           S001141O.FNR_EKA         = DFHBMASK;                         00002080
           S001141O.NAVN_EKA        = DFHBMASK;                         00002090
           S001141O.SKILSMISSEA     = DFHBMASK;                         00002100
           S001141O.FLYTTET_FRAA    = DFHBMASK;                         00002110
           S001141O.FLYTTET_SAMMENA = DFHBMASK;                         00002120
           S001141O.UNDER4GA        = DFHBMASK;                         00002130
           S001141O.MINST4GA        = DFHBMASK;                         00002140
           MELDING6O = 'TRYKK PF1 FOR OPPBEVAR, PF2 FOR FORKASTE.';     00002150
         END;                                                           00002160
                                                                        00002170
      IF ^ FRA_CICS THEN                                                00002180
         DO;                                                            00002190
           S001141O.STYRE_KODEA    = DFHBMASK;                          00002200
           S001141O.FUNKSJONSKODEA = DFHBMASK;                          00002210
         END;                                                           00002220
                                                                        00002230
   END OVERFØR_E1SØKER_MAP;                                             00002240
 %PAGE;                                /*   */                          00002250
 /* ***************************************************************** */00002260
 /*                                                                   */00002270
 /*   PROSEDYRA OVERFØRER DATA FRA E1_TRANS_OMR.E1K7 TIL              */00002280
 /*   SKJERMBILDE E1_KAPITTEL 7.                                      */00002290
 /*   MAP: S001141                                                    */00002300
 /*   MAPSET: S001143                                                 */00002310
 /*                                                                   */00002320
 /* ***************************************************************** */00002330
 %SKIP(2);                                                              00002340
 OVERFØR_E1KAP7_MAP:                                                    00002350
   PROC;                                                                00002360
   DCL                                                                  00002370
      NORMAL  CHAR (1) INIT(' '),                                       00002380
      NOR_NUM CHAR (1) INIT('&'),                                       00002390
      BRI_NUM CHAR (1) INIT('Q');                                       00002400
 %SKIP(2);                                                              00002410
      S001141O.FAIO = F_FELT_PIC_CHAR7(E1K7.FAI);                       00002420
      S001141O.APD_MAXO = E1K7.APD_MAX;                                 00002430
      S001141O.APDO = F_FELT_PIC_CHAR3(E1K7.APD);                       00002440
 %SKIP(3);                             /*  */                           00002450
 /*  MARKERING AV ATTRIBUTTER   */                                      00002460
 %SKIP;                                                                 00002470
      IF E1K7.FAINR = 0 THEN                                            00002480
         S001141O.FAIA = NOR_NUM;                                       00002490
      ELSE                                                              00002500
         DO;                                                            00002510
            S001141O.FAIA = BRI_NUM;                                    00002520
            S001141I.FAIL = CURSOR_POS;                                 00002530
            IF E1K7.FAINR ^= 999 THEN                                   00002540
               CALL SKRIV_FEIL(E1K7.FAINR);                             00002550
         END;                                                           00002560
      IF E1K7.APD_MAXNR = 0 THEN                                        00002570
         S001141O.APD_MAXA = NORMAL;                                    00002580
      ELSE                                                              00002590
         DO;                                                            00002600
            S001141O.APD_MAXA = DFHBMBRY;                               00002610
            S001141I.APD_MAXL = CURSOR_POS;                             00002620
            IF E1K7.APD_MAXNR ^= 999 THEN                               00002630
               CALL SKRIV_FEIL(E1K7.APD_MAXNR);                         00002640
         END;                                                           00002650
      IF E1K7.APDNR = 0 THEN                                            00002660
         S001141O.APDA = NOR_NUM;                                       00002670
      ELSE                                                              00002680
         DO;                                                            00002690
            S001141O.APDA = BRI_NUM;                                    00002700
            S001141I.APDL = CURSOR_POS;                                 00002710
            IF E1K7.APDNR ^= 999 THEN                                   00002720
               CALL SKRIV_FEIL(E1K7.APDNR);                             00002730
         END;                                                           00002740
                                                                        00002750
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00002760
        DO;                                                             00002770
           S001141O.FAIA     = DFHBMASK;                                00002780
           S001141O.APD_MAXA = DFHBMASK;                                00002790
           S001141O.APDA     = DFHBMASK;                                00002800
        END;                                                            00002810
                                                                        00002820
   END OVERFØR_E1KAP7_MAP;                                              00002830
 %PAGE;                                /*   */                          00002840
 /* ***************************************************************** */00002850
 /*                                                                   */00002860
 /*   PROSEDYRA OVERFØRER DATA FRA E1_TRANS_OMR.E1K8 TIL              */00002870
 /*   SKJERMBILDE E1_KAPITTEL 8.                                      */00002880
 /*   MAP: S001141                                                    */00002890
 /*   MAPSET: S001143                                                 */00002900
 /*                                                                   */00002910
 /* ***************************************************************** */00002920
 %SKIP(2);                                                              00002930
 OVERFØR_E1KAP8_MAP:                                                    00002940
   PROC;                                                                00002950
   DCL                                                                  00002960
      NORMAL  CHAR (1) INIT(' '),                                       00002970
      NOR_NUM CHAR (1) INIT('&'),                                       00002980
      BRI_NUM CHAR (1) INIT('Q');                                       00002990
 %SKIP(2);                                                              00003000
      IF F_FELT_PIC_CHAR3(E1K8.UFG) ^= '000' THEN                       00003010
         S001141O.UFGO = F_FELT_PIC_CHAR3(E1K8.UFG);                    00003020
 %SKIP(3);                             /*  */                           00003030
 /*  MARKERING AV ATTRIBUTTER   */                                      00003040
 %SKIP;                                                                 00003050
      IF E1K8.UFGNR = 0 THEN                                            00003060
         S001141O.UFGA = NOR_NUM;                                       00003070
      ELSE                                                              00003080
         DO;                                                            00003090
            S001141O.UFGA = BRI_NUM;                                    00003100
            S001141I.UFGL = CURSOR_POS;                                 00003110
            IF E1K8.UFGNR ^= 999 THEN                                   00003120
               CALL SKRIV_FEIL(E1K8.UFGNR);                             00003130
         END;                                                           00003140
                                                                        00003150
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00003160
         S001141O.UFGA = DFHBMASK;                                      00003170
                                                                        00003180
   END OVERFØR_E1KAP8_MAP;                                              00003190
 %PAGE;                                /*   */                          00003200
 /* ***************************************************************** */00003210
 /*                                                                   */00003220
 /*   PROSEDYRA OVERFØRER DATA FRA E1_TRANS_OMR.E1K10 TIL             */00003230
 /*   SKJERMBILDE E1_KAPITTEL 10.                                     */00003240
 /*   MAP: S001141                                                    */00003250
 /*   MAPSET: S001143                                                 */00003260
 /*                                                                   */00003270
 /* ***************************************************************** */00003280
 %SKIP(2);                                                              00003290
 OVERFØR_E1KAP10_MAP:                                                   00003300
   PROC;                                                                00003310
   DCL                                                                  00003320
      NORMAL  CHAR (1) INIT(' '),                                       00003330
      NOR_NUM CHAR (1) INIT('&'),                                       00003340
      BRI_NUM CHAR (1) INIT('Q');                                       00003350
 %SKIP(2);                                                              00003360
      S001141O.FORVENTETO     = F_FELT_PIC_CHAR7(E1K10.FORVENTET);      00003370
      S001141O.O_TIL_PENSJONO = E1K10.O_TIL_PENSJON;                    00003380
      S001141O.TP_PROSENTO    = F_FELT_PIC_CHAR3(E1K10.TP_PROSENT);     00003390
      IF F_FELT_PIC_CHAR8(E1K10.FRAML_DATO_ÅMD) ^= '00000000' THEN      00003400
        S001141O.FRAML_DATO_MÅO = KONV_HÅMD_MÅ(E1K10.FRAML_DATO_ÅMD);   00003410
      S001141O.OPPHØR_EOO = E1K10.OPPHØR_EO;                            00003420
 %SKIP(3);                             /*  */                           00003430
 /*  MARKERING AV ATTRIBUTTER   */                                      00003440
 %SKIP;                                                                 00003450
      IF E1K10.FORVENTETNR = 0 THEN                                     00003460
         S001141O.FORVENTETA = NOR_NUM;                                 00003470
      ELSE                                                              00003480
         DO;                                                            00003490
            S001141O.FORVENTETA = BRI_NUM;                              00003500
            S001141I.FORVENTETL = CURSOR_POS;                           00003510
            IF E1K10.FORVENTETNR ^= 999 THEN                            00003520
               CALL SKRIV_FEIL(E1K10.FORVENTETNR);                      00003530
         END;                                                           00003540
      IF E1K10.O_TIL_PENSJONNR = 0 THEN                                 00003550
         S001141O.O_TIL_PENSJONA = NORMAL;                              00003560
      ELSE                                                              00003570
         DO;                                                            00003580
            S001141O.O_TIL_PENSJONA = DFHBMBRY;                         00003590
            S001141I.O_TIL_PENSJONL = CURSOR_POS;                       00003600
            IF E1K10.O_TIL_PENSJONNR ^= 999 THEN                        00003610
               CALL SKRIV_FEIL(E1K10.O_TIL_PENSJONNR);                  00003620
         END;                                                           00003630
      IF E1K10.TP_PROSENTNR = 0 THEN                                    00003640
         S001141O.TP_PROSENTA = NOR_NUM;                                00003650
      ELSE                                                              00003660
         DO;                                                            00003670
            S001141O.TP_PROSENTA = BRI_NUM;                             00003680
            S001141I.TP_PROSENTL = CURSOR_POS;                          00003690
            IF E1K10.TP_PROSENTNR ^= 999 THEN                           00003700
               CALL SKRIV_FEIL(E1K10.TP_PROSENTNR);                     00003710
         END;                                                           00003720
      IF E1K10.FRAML_DATO_ÅMDNR = 0 THEN                                00003730
         S001141O.FRAML_DATO_MÅA = NOR_NUM;                             00003740
      ELSE                                                              00003750
         DO;                                                            00003760
            S001141O.FRAML_DATO_MÅA = BRI_NUM;                          00003770
            S001141I.FRAML_DATO_MÅL = CURSOR_POS;                       00003780
            IF E1K10.FRAML_DATO_ÅMDNR ^= 999 THEN                       00003790
               CALL SKRIV_FEIL(E1K10.FRAML_DATO_ÅMDNR);                 00003800
         END;                                                           00003810
      IF E1K10.OPPHØR_EONR = 0 THEN                                     00003820
         S001141O.OPPHØR_EOA = NORMAL;                                  00003830
      ELSE                                                              00003840
         DO;                                                            00003850
            S001141O.OPPHØR_EOA = DFHBMBRY;                             00003860
            S001141I.OPPHØR_EOL = CURSOR_POS;                           00003870
            IF E1K10.OPPHØR_EONR ^= 999 THEN                            00003880
               CALL SKRIV_FEIL(E1K10.OPPHØR_EONR);                      00003890
         END;                                                           00003900
                                                                        00003910
      IF FRA_UTEN_DIALOG THEN        /* BLOKKER ALT SAMMEN    */        00003920
         DO;                                                            00003930
           S001141O.REGDATOA       = DFHBMASK;                          00003940
           S001141O.TERMIDA        = DFHBMASK;                          00003950
           S001141O.FORVENTETA     = DFHBMASK;                          00003960
           S001141O.O_TIL_PENSJONA = DFHBMASK;                          00003970
           S001141O.TP_PROSENTA    = DFHBMASK;                          00003980
           S001141O.FRAML_DATO_MÅA = DFHBMASK;                          00003990
           S001141O.OPPHØR_EOA     = DFHBMASK;                          00004000
         END;                                                           00004010
                                                                        00004020
   END OVERFØR_E1KAP10_MAP;                                             00004030
 %PAGE;                                /*   */                          00004040
 /* *********************************************************** */      00004050
       /*   OBS - NY PROSEDYRE                                  */      00004060
 /*   PROSEDYRA OVERFØRER DATA FRA E1_TRANS_OMR.E1K11 TIL       */      00004070
 /*   SKJERMBILDE E1_KAPITTEL 11.                               */      00004080
 /*   MAP: S001141                                              */      00004090
 /*   MAPSET: S001143                                           */      00004100
 /*                                                             */      00004110
 /* *********************************************************** */      00004120
                                                                        00004130
 OVERFØR_E1KAP11_MAP:                                                   00004140
   PROC;                                                                00004150
   DCL                                                                  00004160
      NORMAL  CHAR (1) INIT(' '),                                       00004170
      NOR_NUM CHAR (1) INIT('&'),                                       00004180
      BRI_NUM CHAR (1) INIT('Q');                                       00004190
                                                                        00004200
      IF F_FELT_PIC_CHAR3(E1K11.YUG) ^= '000' THEN                      00004210
         S001141O.YUFGO = F_FELT_PIC_CHAR3(E1K11.YUG);                  00004220
                                                                        00004230
 /*  MARKERING AV ATTRIBUTTER   */                                      00004240
                                                                        00004250
      IF E1K11.YUGNR = 0 THEN                                           00004260
         S001141O.YUFGA = NOR_NUM;                                      00004270
      ELSE                                                              00004280
         DO;                                                            00004290
            S001141O.YUFGA = BRI_NUM;                                   00004300
            S001141I.YUFGL = CURSOR_POS;                                00004310
            IF E1K11.YUGNR ^= 999 THEN                                  00004320
               CALL SKRIV_FEIL(E1K11.YUGNR);                            00004330
         END;                                                           00004340
                                                                        00004350
      IF FRA_UTEN_DIALOG THEN       /* BLOKKER ALT SAMMEN   */          00004360
         S001141O.YUFGA = DFHBMASK;                                     00004370
                                                                        00004380
   END OVERFØR_E1KAP11_MAP;                                             00004390
