 /*       SIST ENDRET 04/05-98 14.13.32 AV   JDA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R00104EP  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000040
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000050
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000060
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000120
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000130
 /*    FORHÅND.                                                       */00000140
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*PROGRAMTILKNYTTING:                                                */00000180
 /* ********************                                              */00000190
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000200
 /*                                                                   */00000210
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000220
 /*    BRUK :                                                         */00000230
 /*    EXEC CICS XCTL PROGRAM ('R00104EP') COMMAREA(KOM_OMR);         */00000240
 /*    PROGRAMMET INCLUDER :                                          */00000250
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    EP       */00000260
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       EP       */00000270
 /* ***************************************************************** */00000280
 /*DATASETTOPPLYSNINGER:                                              */00000290
 /* ***********************                                           */00000300
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*FEILMELDINGER:                                                     */00000340
 /* *******************                                               */00000350
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000390
                                                                        00000400
          %INCLUDE P0019906;                                            00000410
          %INCLUDE P0019908;                                            00000420
          %INCLUDE P0019910;                                            00000430
          %INCLUDE P0019912;                                            00000440
          %INCLUDE P0019913;                                            00000450
                                                                        00000460
 DCL                                                                    00000470
      (CSTG, ADDR)                   BUILTIN;                           00000480
 DCL  COMMAREA_PEKER         PTR,                                       00000490
      LOKAL_KOM_PTR          PTR;                                       00000500
                                                                        00000510
                                                                        00000520
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000530
 DCL                                                                    00000540
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000550
    DFHBMUNP             CHAR(1) INIT(' '),                             00000560
    DFHBMBRY             CHAR(1) INIT('H'),                             00000570
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000580
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000590
    MELDING6O            CHAR(10),                                      00000600
    YMELDING6O           CHAR(10);                                      00000610
                                                                        00000620
          %INCLUDE S001F1  ;                                            00000630
          %INCLUDE P0010801;                                            00000640
                                                                        00000650
                                                                        00000660
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000670
                                                                        00000680
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000690
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000700
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000710
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000720
                                                                        00000730
                                                                        00000740
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000750
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000760
                                                                        00000770
                                                                        00000780
           IF ^W01_YSKADE THEN                                          00000790
              DO;                                                       00000800
                 CALL OVERFØR_EPSØKER_MAP;             /* R0010806 */   00000810
                 IF EPS.NORSK_BOSATT = 'N' THEN                         00000820
                    DO;                                                 00000830
                       CALL TEKST_SPES_SØKER;          /* R0010807 */   00000840
                       CALL OVERFØR_EPSPES_SØKER_MAP;  /* R0010806 */   00000850
                    END;                                                00000860
                 IF EPS.NORSK_BOSATT_EK = 'N' THEN                      00000870
                    DO;                                                 00000880
                       CALL TEKST_SPES_AVDØDE;         /* R0010807 */   00000890
                       CALL OVERFØR_EPSPES_AVDØDE_MAP; /* R0010806 */   00000900
                    END;                                                00000910
                                                                        00000920
                 IF EPS.YSKADE_TILLEGG  = 'J' THEN                      00000930
                    DO;                                                 00000940
                       W01_YSKADE = '1'B;                               00000950
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00000960
                                                                        00000970
                    END;                                                00000980
                                                                        00000990
                                                                        00001000
                 S001081O.DUMMYA = 'Ø';           /* PROT,DARK  */      00001010
                 W01_MAP  = 'S001081';                                  00001020
              END;                                                      00001030
           ELSE                                                         00001040
              DO;                                                       00001050
                                                                        00001060
                 CALL OVERFØR_EPY_MAP;            /* R0010806 */        00001070
                                                                        00001080
                 W01_YSKADE     = '0'B;                                 00001090
                                                                        00001100
                 S001201O.DUMMYA = 'Ø';           /* PROT,DARK */       00001110
                                                                        00001120
                 W01_MAP  = 'S001201';                                  00001130
              END;                                                      00001140
                                                                        00001150
                                                                        00001160
                                                                        00001170
      EXEC CICS RETURN;                                                 00001180
                                                                        00001190
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001200
      PROC(FIXED_DEC_5);                                                00001210
                                                                        00001220
      DCL                                                               00001230
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001240
                                                                        00001250
   END SKRIV_FEIL;                                                      00001260
                                                                        00001270
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001280
                                                                        00001290
           DCL                                                          00001300
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001310
                                                                        00001320
        END SKRIV_FEIL_YP;                                              00001330
                                                                        00001340
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001350
                                                                        00001360
           DCL                                                          00001370
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001380
                                                                        00001390
   END SKRIV_FEIL_SP;                                                   00001400
                                                                        00001410
   %INCLUDE R0019912;                                                   00001420
   %INCLUDE R0010806;                                                   00001430
   %INCLUDE R0010807;                                                   00001440
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00001450
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00001460
   %INCLUDE  R0019990;                        /*  KONV_HÅMD_DMÅ       */00001470
                                                                        00001480
 END R001041;                                                           00001490
                                                                        00001500
