 /*   SIST ENDRET PÅ PROD   2003.06.19 15.34.24 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.37.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.28.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.35.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.33 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.14 12.35.30 AV   JDA7339          */        
 /*       SIST ENDRET 03/08-99 13.13.52 AV   JDA7339                  */        
 /*       SIST ENDRET 26/03-99 13.25.58 AV   JDA7339                  */        
 /*       SIST ENDRET 26/03-99 13.11.33 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.27 AV   JDA7339                  */        
 /*       SIST ENDRET 11/03-98 12.05.44 AV   JDA7339                  */        
  /* *************************************************************** */         
  /* IDENTIFIKASJON:   R0017034                                      */         
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */         
  /* HENSIKT:                                                        */         
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */         
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */         
  /*        HVER AJOURFØRT TRANSAKSJON.                              */         
  /* PROGRAMTILKNYTNING:                                             */         
  /*        PROGRAMMET INKLUDERES I  R0017001                        */         
  /* *************************************************************** */         
  LAG_ETTERL_FAM_HEND:                                                          
      PROC(IND);                                                                
                                                                                
      DCL   IND      FIXED BIN (15);                                            
      DCL   AVD_IND  FIXED BIN (15);                                            
                                                                                
  /* *************************************************************** */         
  /* PROGRAMMET BEGYNNER HER. VI BLANKER W_HENDELSE.                 */         
  /* ADDRESSERER EIB                                                 */         
  /* *************************************************************** */         
                                                                                
    EXEC CICS ADDRESS EIB(DFHEIPTR);                                            
    AVD_IND = 3 - IND;                                                          
    W_HENDELSE              =    '';                                            
    OMR_DATO                = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                 
    IF TRANS_OPPL_OMR.TRANSTYPE = 27     !                                      
       TRANS_OPPL_OMR.TRANSTYPE = 92 THEN  /*200302 HL*/                        
       DO;                                                                      
          HENDDATO  =  OMR_DATO/100;                                            
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          R_HENDDATO_D    =  B02.PERSON.STATUS.VIRK_DATO_ÅMD(IND);              
          HENDDATO        =  R_HENDDATO.AAR * 100 + R_HENDDATO.MND;             
       END;                                                                     
    W_HENDELSE.VERSJON           =  W_ROT.NESTE_SB_VERSJON_NR;                  
    W_HENDELSE.TERMINAL          =  DIV_PARAM_OMR.BRUKER_ID;                    
    W_HENDELSE.PENSJONSTYPE1     = B02.STATUS.PENSJONSTYPE1(IND);               
    W_HENDELSE.PENSJONSTYPE2     = B02.STATUS.PENSJONSTYPE2(IND);               
    W_HENDELSE.PENSJONSTYPE3     = B02.STATUS.PENSJONSTYPE3(IND);               
    W_HENDELSE.GP_BRUTTO         =  B02.PERSON.ETTEPENS.GP_BRUTTO(IND);         
    W_HENDELSE.GP_NETTO          =  B02.PERSON.ETTEPENS.GP_NETTO(IND);          
    W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(IND);                 
    R_FRAMDATO_D                 =  B02.FRAMLEGGSDATO_ÅMD(IND);                 
    W_HENDELSE.FRAMLEGGS_DATO = + 1000000                                       
                                + R_FRAMDATO.MND * 10000                        
                                + R_FRAMDATO.AAR;                               
  /*W_HENDELSE.FRAMLEGGS_DATO = '01' !! R_FRAMDATO.MND !!                       
                                        R_FRAMDATO.AAR */                       
    W_HENDELSE.FRAMLEGGS_KODE    =  B02.FRAMLEGGSKODE(IND);                     
    W_HENDELSE.ST                =  B02.PERSON.ETTEPENS.ST(IND);                
    W_HENDELSE.FULLT_SÆRTILLEGG  =  DIV_PARAM_OMR.FULLT_SÆRTILLEGG(IND);        
    W_HENDELSE.ST_BRUTTO         =  B02.ST_BRUTTO(IND);                         
    W_HENDELSE.KT                =  B02.PERSON.ETTEPENS.KT(IND);                
    W_HENDELSE.TT                =  B02.PERSON.STATUS.TT_ANV(IND);              
    W_HENDELSE.BOSATT            =  B02.BOSATT(IND);  /*JD 08.90 */             
                                                                                
    W_HENDELSE.ALTERNATIV_GP_BRUTTO = B02.ALTERNATIV_GP_BRUTTO(AVD_IND);        
    W_HENDELSE.ALTERNATIV_TP_BRUTTO = B02.ALTERNATIV_TP_BRUTTO(AVD_IND);        
    W_HENDELSE.REDUSERT_GP_2G   = DIV_PARAM_OMR.REDUSERT_GP_2G(AVD_IND);        
                                                                                
    CALL  PLASSER_TEKST(IND,IND);                                               
                                                                                
 /* **************************************************************** */         
 /* HENDELSE SEGMENT SKRIVES UT.                                     */         
 /* **************************************************************** */         
                                                                                
    CALL INSERT_HENDELSE;                                                       
                                                                                
  END  LAG_ETTERL_FAM_HEND;                                                     
