 /*   SIST ENDRET PÅ PROD   2008.05.31 11.10.56 AV   SPA2990          */        
 /*       SIST ENDRET 25/05-98 13.59.06 AV   HLA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R001UC05 - PROGRAM I PLI                                       */        
 /*    PROGRAMMERT AV                                                 */        
 /*HENSIKT:                                                           */        
 /*                                                                   */        
 /*BRUK:                                                              */        
 /*    KONTROLL_FO_BARN                                               */        
 /*       (FEIL_FUNNET)                                               */        
 /*                                                                   */        
 /* ***************************************************************** */        
 %SKIP(2);                                                                      
                                                                                
 KONTROLL_ARBEIDSINNTEKT: PROC(W_VIRK_DATO_ÅMD);  /*2000*/                      
                                                                                
                                                                                
   /* ************************************************  */                      
    DCL GRUNN_OMR2         CHAR      (1440);        /*2000*/                    
    DCL GRUNN_IDENT        CHAR      ( 8);                                      
                                                                                
      %INCLUDE P0019925;               /* G_TAB                     */          
                                                                                
    ALLOCATE                    G_TAB_RE     ;                                  
    KOM_OMR.G_PEKER          = ADDR (GRUNN_OMR2 ) ;                             
    G_TAB_RE                 =  ''           ;                                  
                                                                                
                                                                                
                                                                                
    GRUNN_IDENT                     = 'P0019925';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                              
                                                                                
  /* **************************************************** */                    
                                                                                
                                                                                
                                                                                
                                                                                
    DCL W_VIRK_DATO_ÅMD       PIC '99999999';      /*2000*/                     
    DCL H_DATO_START          PIC '99999999';      /*2000*/                     
    DCL H_DATO_SLUTT          PIC '99999999';      /*2000*/                     
    DCL H_BELOP               PIC '999999';                                     
                                                                                
    DCL GRUNN_B       FIXED DEC (5) INIT (0);                                   
                                                                                
    DO J = 1 TO 65;                       /*2000*/                              
                                                                                
          H_DATO_START     = PERIODE_START_ÅMD(J) ;                             
          H_DATO_SLUTT     = PERIODE_SLUTT_ÅMD(J) ;                             
          H_BELOP          = G_TAB_PERIODE.GRUNNBELØP(J);                       
                                                                                
       IF W_VIRK_DATO_ÅMD >= PERIODE_START_ÅMD(J) &                             
          W_VIRK_DATO_ÅMD <= PERIODE_SLUTT_ÅMD(J) THEN                          
          DO;                                                                   
             GRUNN_B           = G_TAB_PERIODE.GRUNNBELØP(J);                   
             J                 = 65;        /*2000*/                            
          END;                                                                  
    END;                                                                        
                                                                                
    IF ^FEIL_FUNNET &                                                           
       GRUNN_B > 0  THEN                                                        
       DO;                                                                      
          IF (FOS.ARBEIDSINNTEKT_EK +                                           
              FOS.PENSJONSINNTEKT_EK )  > GRUNN_B  THEN                         
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                FOS.PENSJONSINNTEKT_EKNR =  '385';                              
                FOS.ARBEIDSINNTEKT_EKNR =   '387';                              
            END;                                                                
       END;                                                                     
 END KONTROLL_ARBEIDSINNTEKT;                                                   
