 /*       SIST ENDRET 26/03-99 13.24.20 AV   JDA7339                  */00000000
 /*       SIST ENDRET 26/02-99 09.12.41 AV   JDA7339                  */00000010
 /*       SIST ENDRET 09/06-98 08.31.12 AV   SPA7339                  */00000020
 /*       SIST ENDRET 25/05-98 13.59.12 AV   HLA7339                  */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R001UC07 - PROGRAM I PLI                                       */00000050
 /*    PROGRAMMERT AV SATISH 1991                                     */00000060
 /*HENSIKT:                                                           */00000070
 /*    SKRIVE PROSEDYRER FOR INNSETTING AV FORTEKSTER OG ATTRIBUTTER  */00000080
 /*TEKST_BARN:                                                        */00000090
 /*    SETTER INN FORTEKSTER OG ATTRIBUTTER I BARNEDELEN.             */00000100
 /*FJERN_TEKST_BARN:                                                  */00000110
 /*    SETTER 0 I LENGDEKODE FOR TEKSTER BARNEDEL OG BLANKE I         */00000120
 /*    TEKSTFELTET.                                                   */00000130
 %SKIP(3);                             /*  */                           00000140
 TEKST_BARN:                                                            00000150
   PROC;                                                                00000160
   DCL                                                                  00000170
      NOR_NUM CHAR(1) INIT('&');                                        00000180
                                                                        00000190
         S001UC1O.TFBXO = 'BARN ';                                      00000200
         S001UC1O.TFBNO     = 'FNR';                                    00000210
         S001UC1O.RBTXO     = 'FELLESBARN ETTER 0591';                  00000220
         S001UC1O.VRTXO     = 'FELLESBARN FØR 0591';                    00000230
                                                                        00000240
      CALL BLOKKERE_BARN;                                               00000250
      IF  FOS.BT_ANT > 0 THEN                                           00000260
          DO;                                                           00000270
             DO A = 1 TO FOS.BT_ANT;                                    00000280
                S001UC1O.FNR_BARNA (A)= NOR_NUM;                        00000290
                S001UC1O.RBT_E0591A (A)    = DFHBMUNP;                  00000300
                S001UC1O.RBT_F0591A (A)    = DFHBMUNP;                  00000310
             END;                                                       00000320
          END;                                                          00000330
                                                                        00000340
      IF ^FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                     00000350
                        TRANS_OPPL_OMR.TRANS_RETURKODE THEN             00000360
         S001UC1I.FNR_BARNL(1) = CURSOR_POS;                            00000370
   END TEKST_BARN;                                                      00000380
 %PAGE;                                                                 00000390
                                       /* BLANKE I TEKSTFELT */         00000400
                                                                        00000410
 FJERN_TEKST_BARN:                                                      00000420
   PROC;                                                                00000430
      S001UC1O.TFBXO = '     ';                                         00000440
      S001UC1O.TFBNO = '            ';                                  00000450
      S001UC1O.VRTXO = (24)' ';                                         00000460
      S001UC1O.RBTXO = (24)' ';                                         00000470
   END FJERN_TEKST_BARN;                                                00000480
                                                                        00000490
 BLOKKERE_BARN:                    /* ASKIP OG PROT    */               00000500
   PROC;                                                                00000510
      DO A = 1 TO 12;                                                   00000520
         S001UC1O.FNR_BARNA(A)      = DFHBMASK;                         00000530
         S001UC1O.RBT_E0591A (A)    = DFHBMASK;                         00000540
         S001UC1O.RBT_F0591A (A)    = DFHBMASK;                         00000550
      END;                                                              00000560
   END BLOKKERE_BARN;                                                   00000570
 %SKIP(3);                             /*  */                           00000580
 TEKST_SØKER2:                                                          00000590
   PROC;                                                                00000600
   DCL                                                                  00000610
      NOR_NUM CHAR(1) INIT('&');                                        00000620
                                                                        00000630
      S001UC1O.TSBO  = 'SØKER';                                         00000640
      S001UC1O.TSB1O = 'PENSJ.INNT';                                    00000650
      S001UC1O.TSB2O = 'ARB. INNT ';                                    00000660
      S001UC1O.TEBO  = 'EKTEF';                                         00000670
      S001UC1O.TEB1O = 'PENSJ.INNT';                                    00000680
      S001UC1O.TEB2O = 'ARB. INNT ';                                    00000690
      S001UC1O.PIA        = NOR_NUM;                                    00000700
      S001UC1O.AIA        = NOR_NUM;                                    00000710
      S001UC1O.PI_EKA     = NOR_NUM;                                    00000720
      S001UC1O.AI_EKA     = NOR_NUM;                                    00000730
                                                                        00000740
      IF ^FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                     00000750
                        TRANS_OPPL_OMR.TRANS_RETURKODE THEN             00000760
         S001UC1I.PIL        = CURSOR_POS;                              00000770
   END TEKST_SØKER2;                                                    00000780
 %PAGE;                                                                 00000790
                                       /* BLANKE I TEKSTFELT */         00000800
                                                                        00000810
 FJERN_TEKST_SØKER2:                                                    00000820
   PROC;                                                                00000830
      S001UC1O.TSBO = '     ';                                          00000840
      S001UC1O.TSB1O = '   ';                                           00000850
      S001UC1O.TSB2O = '   ';                                           00000860
      S001UC1O.TEBO = '     ';                                          00000870
      S001UC1O.TEB1O = '   ';                                           00000880
      S001UC1O.TEB2O = '   ';                                           00000890
   END FJERN_TEKST_SØKER2;                                              00000900
                                                                        00000910
