 /*   SIST ENDRET PÅ PROD   2006.04.07  9.57.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.10  9.59.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.01.05  8.52.39 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.37.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.07.14  8.32.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.07.08 12.38.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.04.21 11.34.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.21 10.22.35 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.01.19 16.57.34 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2005.01.19  9.30.57 AV   TSB2970          */        
 /*   SIST ENDRET PÅ PROD   2005.01.06 11.36.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.01.04 12.21.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.01.04 10.48.13 AV   TSB2970          */        
 /*   SIST ENDRET PÅ PROD   2005.01.04 10.41.23 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2005.01.04 10.40.28 AV   TSB2970          */        
 /*   SIST ENDRET PÅ PROD   2005.01.03 15.26.24 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2005.01.03 15.25.22 AV   TSB2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.10.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.09  8.23.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.25 11.41.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.25 11.37.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.05  9.20.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.05  9.20.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.01  8.28.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.01  8.18.04 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.26 11.58.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.26 11.38.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.20 14.17.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.09.20 14.16.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.08 12.15.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 12.54.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.48.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.03.02  8.15.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.02  8.08.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.27.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.15.01 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.10.25 14.43.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.08.18 14.48.19 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 14.34.31 AV   JDA7339          */        
 /*       SIST ENDRET 09/06-98 08.31.31 AV   SPA7339                  */        
 /*       SIST ENDRET 02/06-98 12.40.13 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001U603  KONTROLL_U3_SØKER   SUBPROGRAM         */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : HERMAN                                           */        
 /*  PROGRAMMET BLE LAGET :     1993                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  FORETAR KONTROLL AV GRUNNBLANKETT U3 - SØKERDELEN.               */        
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */        
 /*                                                                   */        
 /*  FORETAR KONTROLL AV TILLEGGSBLANKETT YP.                         */        
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  PROGRAMMET INCLUDES AV R001U601 - KONTROLL_GRUNNBLANKETT_U3      */        
 /*  ARBEIDSOMRÅDET P001U601 ER INCLUDET I HOVEDPROG                  */        
 /*  BRUK :                                                           */        
 /*  CALL KONTROLL_U3_SØKER(FEIL_I_U3_SØKER);                         */        
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */        
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */        
 /*          R0019901 - F_GYLDIG_DATO                                 */        
 /*          R0019902 - F_KJØNN                                       */        
 /*          R0019903 - F_EK_ALDER                                    */        
 /*          R0019904 - F_GYLDIG_FNR                                  */        
 /*          R0019905 - F_ALDER                                       */        
 /*          R0019910 - F_NUMERISK                                    */        
 /*          R0019912 - F_FELT_PIC_CHAR11                             */        
 /*          R0019964 - F_6MDR                                        */        
 /*          VERIFY   - BUILTIN-FUNCTION                              */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */        
 /*   TKNR_TAB.LESES VED EXEC CICS READ DATASET.                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */        
 /*   FEIL_FUNNET SETTES = '1'B.                                      */        
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   MODULEN KONTROLLERER U3_SØKER, OG RETURNERER                    */        
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */        
 /*                                                                   */        
 /* ***************************************************************** */        
 KONTROLL_U3_SØKER:                                                             
    PROC (FEIL_FUNNET);                                                         
    /* -------------------------------------------------------------- */        
    DCL                                                                         
         FEIL_FUNNET                BIT (1),                                    
         TRUE                       BIT (1) INIT('0'B);                         
   DCL                                                                          
         KEY_BIT                    BIT(32) BASED (KEY_PEKER),                  
         KEY_PEKER                  POINTER,                                    
         TK_RECL                    CHAR (101);                                 
                                                                                
    DCL                                                                         
         W_FNR                                     PIC'(11)9';                  
    DCL                                                                         
         1 FNR13,                                                               
           2 DAG                                   PIC'(2)9',                   
           2 MND                                   PIC'(2)9',                   
           2 AAR                                   PIC'(4)9',                   
           2 ÅRHUNDRE                              PIC'9',                      
           2 REST                                  PIC'(4)9';                   
      DCL  FNR13_DEF DEF FNR13    PIC '(13)9';                                  
    DCL                                                                         
         W_FNR_EK                                  PIC'(11)9';                  
    DCL                                                                         
         1 FNR13_EK,                                                            
           2 DAG                                   PIC'(2)9',                   
           2 MND                                   PIC'(2)9',                   
           2 AAR                                   PIC'(4)9',                   
           2 ÅRHUNDRE                              PIC'9',                      
           2 REST                                  PIC'(4)9';                   
      DCL  FNR13_EK_DEF DEF FNR13_EK PIC '(13)9';                               
    DCL                                                                         
         TT_E66_ÅM                                 PIC'(4)9';                   
    DCL                                                                         
         ALDER           FIXED DEC (5),                                         
         ALDER2          FIXED DEC (5),                                         
         ALDERSGRENSE    FIXED DEC (5),                                         
         IÅR             FIXED BIN (15),                                        
         J               FIXED BIN (15),                                        
         TELL            FIXED BIN (15),                                        
         DATO            PIC '(8)9';                                            
    DCL                                                                         
         1 DAGENS_DATO   DEF DATO,                                              
           2 ÅR          PIC'9999',                                             
           2 MN          PIC'99',                                               
           2 DG          PIC'99';                                               
    DCL                                                                         
         DAGENS_DATO_ÅMD DEF DATO POS(1) PIC'(8)9';                             
                                                                                
    DCL (                                                                       
         DATE,                                                                  
         MOD )           BUILTIN;                                               
    /*  HJELPE DCL FOR Å SNU DATO           */                                  
                                                                                
    DCL                                                                         
         HJ_VIRK_DATO_ÅMD                       PIC '99999999',                 
         VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅMD POS(1) PIC '9999',                    
         VIRK_DATO_M DEF HJ_VIRK_DATO_ÅMD POS(5) PIC '99';                      
                                                                                
   DCL   HJ_UFT_ÅMD                             PIC '99999999',                 
         UFT_Å DEF HJ_UFT_ÅMD POS(1)            PIC '9999',                     
         UFT_M DEF HJ_UFT_ÅMD POS(5)            PIC '99';                       
                                                                                
                                                                                
    DCL                                                                         
        1 FNR_REG,                                                              
          2 FNR1      FIXED DEC(11),                                            
          2 FNR2      FIXED DEC(11),                                            
          2 BRUKERID  CHAR     ( 4);                                            
                                                                                
    DCL TT_FRA37_M         FIXED DEC (3);                                       
    DCL TT_FRA37_Å         FIXED DEC (5);                                       
    DCL TT_HJELP_M         FIXED DEC (3);                                       
                                                                                
    /* ============================================================== */        
    /* HOVEDPROGRAMMET STARTER HER                                    */        
    /* ============================================================== */        
                                                                                
    DIV_PARAM_OMR.REGN_1291 = ' ';                                              
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                                 
    DATO             =  DATO_2000      ;                                        
 /* FEIL_FUNNET      =  '0'B           ; */                                     
    KEY_PEKER        =  ADDR (U3S.TKNR);                                        
                                                                                
 /*         200107 HL :           */                                            
      HJ_VIRK_DATO_ÅMD = U3S.VIRK_DATO_ÅMD;                                     
                                                                                
      IF VERIFY(U3S.RED_GP_3_2_5, 'JN ') ^= 0 THEN                              
         DO;                                                                    
             FEIL_FUNNET        = '1'B;                                         
              U3S.RED_GP_3_2_5NR = 1541;                                        
         END;                                                                   
    IF HJ_VIRK_DATO_ÅMD > 19980100             THEN                             
       DO;                                                                      
          IF U3S.RED_GP_3_2_5 ='J'          THEN                                
             DO;                                                                
                IF (VERIFY(U3S.SIVILSTAND,'GPW') = 0) THEN                      
                   DO;                                                          
                      FEIL_FUNNET        = '1'B;                                
                      U3S.RED_GP_3_2_5NR = 616 ;                                
                   END;                                                         
             END;                                                               
          ELSE                                                                  
          IF U3S.RED_GP_3_2_5 =' '          THEN                                
             DO;                                                                
                IF (VERIFY(U3S.SIVILSTAND,'USAVE') = 0) THEN                    
                   DO;                                                          
                      FEIL_FUNNET        = '1'B;                                
                      U3S.RED_GP_3_2_5NR = 618 ;                                
                   END;                                                         
             END;                                                               
       END;                                                                     
    ELSE                                                                        
       U3S.RED_GP_3_2_5 =' ';                                                   
 /* HIT         200107 HL  */                                                   
    HJ_VIRK_DATO_ÅMD = U3S.VIRK_DATO_ÅMD;                                       
                                                                                
    IF HJ_VIRK_DATO_ÅMD < 19930800 & (U3S.SIVILSTAND = 'P') THEN                
       DO;                                                                      
          /* ----------------------------------------------------- */           
          /* SIVILSTAND LIK P UGYLDIG FØR 01.08.93                 */           
          /* ----------------------------------------------------- */           
          FEIL_FUNNET = '1'B;                                                   
          U3S.SIVILSTANDNR = 388;                                               
       END;                                                                     
    ELSE                                                                        
    IF HJ_VIRK_DATO_ÅMD < 19940100 & (U3S.SIVILSTAND = 'W') THEN                
       DO;                                                                      
          /* ----------------------------------------------------- */           
          /* SIVILSTAND LIK W UGYLDIG FØR 01.01.94                 */           
          /* ----------------------------------------------------- */           
          FEIL_FUNNET = '1'B;                                                   
          U3S.SIVILSTANDNR = 389;                                               
       END;                                                                     
                                                                                
    IF VERIFY(U3S.ATT_UF,'AUX') ^= 0 THEN                                       
       DO;                                                                      
          FEIL_FUNNET  = '1'B;                                                  
          U3S.ATT_UFNR = 268;                                                   
       END;                                                                     
    IF (U3S.ATT_UF = 'X') THEN                                                  
       IF (U3S.VIRK_DATO_ÅMD >= 20020100) THEN /* MH1201 */                     
          DO; /* NYE REGLER FRA 01012002 SKAL AVVISES */                        
             FEIL_FUNNET  = '1'B;                                               
             U3S.ATT_UFNR = 1828;                                               
          END;/* NYE REGLER FRA 01012002 SKAL AVVISES */                        
    ELSE /* MH1201 TIL HIT */                                                   
       U3S.SIVILSTAND = 'U';                                                    
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.1 FØDSELSNUMMER SØKER                                        */        
    /* -------------------------------------------------------------- */        
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR11(U3S.FNR)) THEN                            
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.FNRNR   = 1;                                                      
       END;                                                                     
    ELSE                                                                        
       IF ^F_GYLDIG_FNR(U3S.FNR) THEN                                           
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3S.FNRNR   = 1;                                                   
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
             FNR_REG.FNR1 = U3S.FNR;                                            
             W_FNR        = U3S.FNR;                                            
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);              
             IF FNR_REG.FNR2 > 0 THEN                                           
                DO;                                                             
                   U3S.FNRNR   = 203;                                           
                   U3S.FNR_GML = U3S.FNR;                                       
                   U3S.FNR     = FNR_REG.FNR2;                                  
                END;                                                            
          END;                                                                  
                                                                                
    FNR13_DEF  = KONV_FNR11_FNR13(U3S.FNR);       /*2YK*/                       
                                                                                
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.2 TRYGDEKONTORNUMMER                                         */        
    /* -------------------------------------------------------------- */        
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(U3S.TKNR)) THEN                            
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.TKNRNR  = 200;                                                    
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                          
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)                  
                                               INTO(TK_RECL);                   
            LEAVE;                                                              
        NOTFND:                                                                 
            FEIL_FUNNET = '1'B;                                                 
            U3S.TKNRNR  = 3;                                                    
       END;                                                                     
                                                                                
    /* +-------------------------------------------------+                      
       !     KONTROLL AV ACF2 FOR TILLGANGE TIL TKNR     !                      
       +-------------------------------------------------+ */                   
   /*             NYTT */                                                       
    BO_TKNR  = TKNR;                                                            
    CALL ATK_TILGANG_KONTROLL;                                                  
                                                                                
    /*  ENDRET AV SATISH 16.11.2002                                             
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.3 NAVNET TIL SØKER                                           */        
    /* -------------------------------------------------------------- */        
    IF (U3S.NAVN = (25)' ') THEN                                                
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.NAVNNR  = 2;                                                      
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.4 SPRÅKKODE                                                  */        
    /* -------------------------------------------------------------- */        
    IF (VERIFY(U3S.SPRÅK,'NBE ') ^= 0) THEN                                     
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.SPRÅKNR = 6;                                                      
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.5 SIVILSTAND                                                 */        
    /* -------------------------------------------------------------- */        
    IF (VERIFY(U3S.SIVILSTAND,'GASUEPWV') ^= 0) THEN                            
       DO;                                                                      
          FEIL_FUNNET      = '1'B;                                              
          U3S.SIVILSTANDNR = 5;                                                 
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.6 NORSK BOSATT                                               */        
    /* -------------------------------------------------------------- */        
    IF (VERIFY(U3S.NORSK_BOSATT,'JN') ^= 0) THEN                                
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U3S.NORSK_BOSATTNR = 8;                                               
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.7 TILLEGG FOR EKTEFELLE/SAMBOER/PARTNER                      */        
    /* -------------------------------------------------------------- */        
    IF (VERIFY(U3S.TILL_EK,'J ') ^= 0) THEN                                     
       DO;                                                                      
          FEIL_FUNNET   ='1'B;                                                  
          U3S.TILL_EKNR = 4;                                                    
       END;                                                                     
                                                                                
                                                                                
     /* ------------------------------------------------------------- */        
     /* ATTFØRINGSPENGER I VENTETID - IKKE UNDER 50%                  */        
     /* ------------------------------------------------------------- */        
     IF   U3S.ATT_UF = 'A' &                                                    
          U3S.UFG < 50                   THEN                                   
       DO;                                                                      
          /* -------------------------------------------------------- */        
          /* NY TEST IFBM TILLATELSE TIL UFØREGRAD UNDER 50%, HL9705  */        
          /* -------------------------------------------------------- */        
          FEIL_FUNNET = '1'B;                                                   
          U3S.UFGNR     = 427;                                                  
       END;                                                                     
     /* ------------------------------------------------------------- */        
     IF   HJ_VIRK_DATO_ÅMD < 19970500       THEN                                
        IF   U3S.UFG < 50 &                                                     
             U3S.TILL_EK = 'J'              THEN                                
           DO;                                                                  
              FEIL_FUNNET = '1'B;                                               
              U3S.TILL_EKNR = 303;                                              
              U3S.UFGNR     = 999;                                              
           END; /* 9705 HL HIT */                                               
     /* ------------------------------------------------------------- */        
    HJ_UFT_ÅMD  = U3S.UFT_ÅMD;                                                  
    IF U3S.NORSK_BOSATT = 'J'    THEN                                           
       DO;  /* NORSK BOSATT, VED NEI BEHANDLES DEN I U62X */                    
          IF HJ_VIRK_DATO_ÅMD > 19910000    THEN     /* TS 0695 */              
             DO;  /* VIRK ETTER 1990 */                                         
                /* ---------------------------------------------- */            
                /* REVIDERT BEREGNINGEN NEDENFOR : 050494 HL      */            
                /* ---------------------------------------------- */            
                /*   TT_FRA37_ÅMD = HJ_UFT_ÅMD -((FNR13.AAR + 16)   */          
                /*                               * 100 + FNR.MND) */            
                /* ---------------------------------------------- */            
                TT_FRA37_M  = (UFT_Å -(FNR13.AAR + 16)) * 12                    
                              + UFT_M - FNR13.MND;                              
                TT_FRA37_Å  = TT_FRA37_M / 12;                                  
                TT_HJELP_M  = TT_FRA37_Å * 12;                                  
                U3SP.TT_FRA1937_ÅR  = TT_FRA37_Å;                               
                U3SP.TT_FRA1937_MND = TT_FRA37_M - TT_HJELP_M;                  
             END; /* VIRK ETTER 1990 */                                         
          ELSE                                                                  
             DO;  /* VIRK FØR 1991 */                                           
                /* ---------------------------------------------- */            
                /* TRYGDETID FØR 91 , FØR OG ETTER 1966.TS 0695   */            
                /* ---------------------------------------------- */            
       /*       IF FNR13.ÅRHUNDRE < 5       THEN      */                        
                                                                                
            IF (FNR13.AAR > 1899)              THEN                             
                                                                                
                   DO; /* FØDT I 19XX */                                        
                      U3SP.TT_F67 = 1967 - (FNR13.AAR + 16);                    
                      IF (FNR13.AAR + 16) > 1967 THEN                           
                         DO;  /* FØDT 1951 ELLER SENERE */                      
                            U3SP.TT_F67 = 0;                                    
                            IF UFT_Å > 1966  &                                  
                               UFT_Å >= (FNR13.AAR + 16)   THEN                 
                               DO;                                              
                                  IF UFT_M < FNR13.MND          THEN            
                                     DO;                                        
                                        U3SP.TT_E66_Å = UFT_Å -                 
                                           (FNR13.AAR + 17);                    
                                        U3SP.TT_E66_M = UFT_M -                 
                                          FNR13.MND + 12;                       
                                     END;                                       
                                  ELSE                                          
                                     DO;                                        
                                        U3SP.TT_E66_Å = UFT_Å -                 
                                          (FNR13.AAR + 16);                     
                                        U3SP.TT_E66_M = UFT_M -                 
                                           FNR13.MND;                           
                                     END;                                       
                               END;                                             
                            ELSE                                                
                               DO;                                              
                                  U3SP.TT_E66_Å = 0;                            
                                  U3SP.TT_E66_M = 0;                            
                               END;                                             
                         END; /* FØDT 1951 ELLER SENERE */                      
                      ELSE                                                      
                         DO;  /* SØKEREN ER FØDT 1900 - 1950 */                 
                            IF UFT_Å > 1966    THEN                             
                               DO;  /* UFØRETIDSPUNKT ETTER 1966 */             
                                  U3SP.TT_E66_Å = UFT_Å - 1967;                 
                                  U3SP.TT_E66_M = UFT_M;                        
                               END; /* UFØRETIDSPUNKT ETTER 1966 */             
                            ELSE                                                
                               DO;  /* UFØRETIDSPUNKT FØR 1967 */               
                                  U3SP.TT_E66_Å = 0;                            
                                  U3SP.TT_E66_M = 0;                            
                               END; /* UFØRETIDSPUNT FØR 1967 */                
                         END; /* SØKEREN ER FØDT 1900 - 1950 */                 
                   END; /* FØDT I 19XX */                                       
                ELSE                                                            
                   DO;  /* FØDT I 18XX */                                       
                      U3SP.TT_F67 = 1967 - (FNR13.AAR + 16 );                   
                      IF UFT_Å > 1966    THEN                                   
                         DO;                                                    
                            U3SP.TT_E66_Å = UFT_Å - 1967;                       
                            U3SP.TT_E66_M = UFT_M;                              
                         END;                                                   
                      ELSE                                                      
                         DO;                                                    
                            U3SP.TT_E66_Å = 0;                                  
                            U3SP.TT_E66_M = 0;                                  
                         END;                                                   
                   END; /* FØDT I 18XX */                                       
             END; /* VIRK FØR 1991 */                                           
       END;    /* NORSK BOSTATT */                                              
                                                                                
     /* ------------------------------------------------------------- */        
     /* 1.7 TILLEGG FOR BARN                                          */        
     /* ------------------------------------------------------------- */        
    IF VERIFY(U3S.TILL_BARN,'J ') ^= 0 THEN                                     
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.TILL_BARNNR = 271; /*HL*/                                         
       END;                                                                     
     /* ------------------------------------------------------------- */        
     /* 1.12 SÆRREGLER FOR YRKESSKADE (KAP 13, JFR. PRG. 12-18)       */        
     /* ------------------------------------------------------------- */        
    IF VERIFY(U3S.YSKADE_TILLEGG,'J ') ^= 0 THEN                                
       DO;                                                                      
          FEIL_FUNNET   ='1'B;                                                  
          U3S.YSKADE_TILLEGGNR = 300;                                           
       END;                                                                     
                                                                                
  /* DERSOM VP_ÅR1 ER NULL NOEN AV DE ANDRE UTFYLT, NULLES DISSE  */            
                                                                                
    DO J = 1 TO 4 UNTIL(U3S.VP_ÅR(J) =  0   );                                  
       IF U3S.VP_ÅR(J)  =  0     THEN                                           
          DO TELL            = J TO 4;                                          
             U3S.VP_ÅR(TELL) = 0;                                               
          END;                                                                  
    END;                                                                        
    /* ------------------------------------------------------------- */         
    DO IÅR = 1 TO 4 WHILE (U3S.VP_ÅR(IÅR)  ^=  0    );                          
       IF ^F_NUMERISK((U3S.VP_ÅR(IÅR)))  THEN                                   
          DO;                                                                   
             FEIL_FUNNET      = '1'B;                                           
             U3S.VP_ÅRNR(IÅR) = 200;                                            
          END;                                                                  
       ELSE                                                                     
          IF ^(U3S.VP_ÅR(IÅR)> 1966 &                                           
               U3S.VP_ÅR(IÅR)<= DAGENS_DATO.ÅR) !                               
             U3S.VP_ÅR(IÅR) < (FNR13.AAR + 17)         THEN                     
             DO;                                                                
                FEIL_FUNNET      = '1'B;                                        
                U3S.VP_ÅRNR(IÅR) = 47;                                          
             END;                                                               
    END;                                                                        
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.11 YNGSTE BARNS FØDSELSÅR                                    */        
    /* -------------------------------------------------------------- */        
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(U3S.YNGSTE_BARN_FÅR)) THEN                 
       DO;  /* F-ÅR YNGSTE BARN, FELT NUMERISK, TAST TALL. */                   
          FEIL_FUNNET = '1'B;                                                   
          U3S.YNGSTE_BARN_FÅRNR = 209;                                          
       END; /* F-ÅR YNGSTE BARN, FELT NUMERISK, TAST TALL. */                   
    ELSE                                                                        
       IF (U3S.YNGSTE_BARN_FÅR > 0) THEN                                        
          DO;  /* FELTET ER UFYLT */                                            
             IF (UFT_Å < 1993) THEN                                             
                DO;  /* KUN VED UFØRETIDSPUNKT ETTER 1992 */                    
                   U3S.YNGSTE_BARN_FÅRNR = 473;                                 
                   FEIL_FUNNET           = '1'B;                                
                END; /* KUN VED UFØRETIDSPUNKT ETTER 1992 */                    
             ELSE                                                               
                IF (UFT_Å > (U3S.YNGSTE_BARN_FÅR + 6)) THEN                     
                   DO;  /* SKAL BARE FYLLES UT FOR BARN UNDER 6 ÅR */           
                      U3S.YNGSTE_BARN_FÅRNR = 425;                              
                      FEIL_FUNNET = '1'B;                                       
                   END; /* SKAL BARE FYLLES UT FOR BARN UNDER 6 ÅR */           
                ELSE                                                            
                   IF (UFT_Å < U3S.YNGSTE_BARN_FÅR) THEN                        
                      DO;  /* BARNET MÅ VÆRE FØDT PÅ UFT */                     
                         U3S.YNGSTE_BARN_FÅRNR = 426;                           
                         FEIL_FUNNET = '1'B;                                    
                      END; /* BARNET MÅ VÆRE FØDT PÅ UFT */                     
          END; /* FELTET ER UTFYLT */                                           
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.14 UTDANNING                                                 */        
    /* -------------------------------------------------------------- */        
    IF U3S.ATT_UF ^= 'X'    THEN          /*HL 0895*/                           
       DO;                                                                      
          /* -------------------------------------------------------- */        
          /* DA VI IKKJE LAGRER DAGPENGER, BRYR VI OSS IKKJE OM AT    */        
          /* FELTET I DISSE TILFELLENE KAN INNEHOLDE FEIL             */        
          /* -------------------------------------------------------- */        
          IF VERIFY(U3S.UTDANNING,'123') ^= 0 THEN                              
             DO;                                                                
                U3S.UTDANNINGNR = 352;                                          
                FEIL_FUNNET     = '1'B;                                         
             END;                                                               
       END; /* KONTROLL FELT 1.14 */                                            
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.9 ARBEIDSINNTEKT MINST 1G PÅ UFT (PGR. 3-17 BOKSTAV A)       */        
    /* -------------------------------------------------------------- */        
    IF VERIFY(U3S.VILKÅR_8_4_3A,'JN') ^= 0 THEN                                 
       DO;                                                                      
          FEIL_FUNNET      = '1'B;                                              
          U3S.VILKÅR_8_4_3ANR = 45;                                             
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.16 UFØREGRAD ETTER KAPITTEL 12                               */        
    /* -------------------------------------------------------------- */        
    IF ^F_NUMERISK(F_FELT_PIC_CHAR3(U3S.UFG)) THEN                              
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.UFGNR   = 200;                                                    
       END;                                                                     
                                                                                
 /*SEPT 2001 ALLE HELE UGF FRA 15 OG OPPOVER GYLDIG JD VED FRYS */              
  IF (U3S.YSKADE_TILLEGG = 'J')           THEN                                  
    DO; /* HAR YRKESSKADE */                                                    
       IF (HJ_VIRK_DATO_ÅMD > 20010801 ! U3S.UFG < 15) &                        
          (U3S.FRYSP_5ÅR_ARB  = 'X'             !                               
           U3S.FRYSP_TIDSB    = 'X' )        THEN                               
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            U3S.UFGNR   = 350;                                                  
         END;                                                                   
       IF (U3S.UFG > 100 ) !                                                    
          (U3S.UFG < 015 ) THEN                                                 
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3S.UFGNR   = 350;                                                 
          END;                                                                  
       /* DENNE KONTROLLEN ER FLYTTA TIL U621 - KAN HA FLYTENDE UFG ....        
       ELSE                                                                     
       IF (HJ_VIRK_DATO_ÅMD  > 20010901 ) THEN                                  
          IF (MOD(U3S.UFG,5 )  ^= 0 ) THEN                                      
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFGNR   = 350;                                              
             END;                                                               
          ELSE;                                                                 
       ELSE                                                                     
          IF (MOD(U3S.UFG,10)  ^= 0 ) THEN                                      
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFGNR   = 350;                                              
             END;                                                               
 /*    IF ^(                                                                    
      U3S.UFG = 15 ! U3S.UFG = 20 ! U3S.UFG = 25 ! U3S.UFG = 30 !               
      U3S.UFG = 35 ! U3S.UFG = 40 ! U3S.UFG = 45 ! U3S.UFG = 50 !               
      U3S.UFG = 55 ! U3S.UFG = 60 ! U3S.UFG = 65 ! U3S.UFG = 70 !               
      U3S.UFG = 75 ! U3S.UFG = 80 ! U3S.UFG = 85 ! U3S.UFG = 90 !               
      U3S.UFG = 95 ! U3S.UFG = 100 ! U3S.UFG = 0) &                             
          (HJ_VIRK_DATO_ÅMD < 20010901 ) THEN                                   
      DO;                                                                       
         FEIL_FUNNET = '1'B;                                                    
         U3S.UFGNR   = 350;                                                     
      END; */                                                                   
    END; /* HAR YRKESSKADE */                                                   
  ELSE                                                                          
    DO;  /* HAR IKKE YRKESSKADE */                                              
       IF ( HJ_VIRK_DATO_ÅMD < 19970500  &                                      
            U3S.UFG < 50             )   THEN                                   
            DO;                                                                 
               FEIL_FUNNET = '1'B;                                              
               U3S.UFGNR   = 38;                                                
            END;                                                                
 /*SEPT 2001 ALLE HELE UGF FRA 20 OG OPPOVER GYLDIG JD(KUN FRYS) */             
       ELSE                                                                     
                                                                                
  /*   IF ^(            U3S.UFG = 20 ! U3S.UFG = 25 ! U3S.UFG = 30 !            
         U3S.UFG = 35 ! U3S.UFG = 40 ! U3S.UFG = 45 ! U3S.UFG = 50 !            
         U3S.UFG = 55 ! U3S.UFG = 60 ! U3S.UFG = 65 ! U3S.UFG = 70 !            
         U3S.UFG = 75 ! U3S.UFG = 80 ! U3S.UFG = 85 ! U3S.UFG = 90 !            
         U3S.UFG = 95 ! U3S.UFG = 100 ) &                                       
          (HJ_VIRK_DATO_ÅMD < 20010901 ) THEN */                                
       IF (U3S.UFG > 100 ) !                                                    
          (U3S.UFG < 020 ) THEN                                                 
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3S.UFGNR   = 350;                                                 
          END;                                                                  
       /* DENNE KONTROLLEN ER FLYTTA TIL U621 - KAN HA FLYTENDE UFG ....        
       ELSE                                                                     
       IF (HJ_VIRK_DATO_ÅMD  > 20010901 ) THEN                                  
          IF (MOD(U3S.UFG,5 )  ^= 0 ) THEN                                      
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFGNR   = 350;                                              
             END;                                                               
          ELSE;                                                                 
       ELSE                                                                     
          IF (MOD(U3S.UFG,10)  ^= 0 ) THEN                                      
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFGNR   = 350;                                              
             END;                                                               
      /*                                                                        
       IF (HJ_VIRK_DATO_ÅMD > 20010801 ! U3S.UFG < 20) &                        
          (U3S.FRYSP_5ÅR_ARB  = 'X'             !                               
           U3S.FRYSP_TIDSB    = 'X' )        THEN                               
         DO;                                                                    
            FEIL_FUNNET = '1'B;                                                 
            U3S.UFGNR   = 38;                                                   
         END; */                                                                
    END;                                                                        
                                                                                
    IF ^F_NUMERISK((U3S.UFT_ÅMD)) THEN                                          
       DO;                                                                      
          FEIL_FUNNET  = '1'B;                                                  
          U3S.UFT_ÅMDNR = 200;                                                  
       END;                                                                     
    ELSE                                                                        
 /*    IF ^F_GYLDIG_DATO(U3S.UFT_ÅMD) THEN               */                     
       IF UFT_M = 0      !                 /*160796 HL*/                        
          UFT_M > 12                 THEN                                       
          DO;                                                                   
             FEIL_FUNNET  = '1'B;                                               
             U3S.UFT_ÅMDNR = 40;                                                
          END;                                                                  
                                                                                
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U3S.PI)) THEN                               
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.PINR    = 200;                                                    
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.13 YRKESMESSIG ATTFØRING FORSØKT ? KRAV VED PENSJON          */        
    /* -------------------------------------------------------------- */        
    IF VERIFY(U3S.YRKESM_ATTF,'JN') ^= 0 THEN                                   
       IF VERIFY(U3S.ATT_UF,'X') ^= 0 THEN                                      
          DO;                                                                   
             FEIL_FUNNET        = '1'B;                                         
             U3S.YRKESM_ATTFNR  = 353;                                          
          END;                                                                  
       ELSE                                                                     
          U3S.YRKESM_ATTF = ' ';                                                
                                                                                
    IF U3S.ATT_UF      = 'X'       THEN                   /*DAGPENGER*/         
       DO;                                                                      
          U3S.TILL_EK = ' ' ;                                                   
          U3S.TILL_BARN = ' ';                                                  
 /*       U3S.PI = 0;                  */                                       
          U3S.NAVN_EK  = ' ';                                                   
       END;       /*END ATT_UF = X*/                                            
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.15 YRKESKODE                                                 */        
    /* -------------------------------------------------------------- */        
    IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U3S.YRKE)) THEN                             
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.YRKENR  = 200;                                                    
       END;                                                                     
    ELSE                                                                        
       IF ^ (U3S.YRKE >= 0 & U3S.YRKE <= 19) ! U3S.YRKE = 8 THEN                
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3S.YRKENR  = 42;                                                  
          END;                                                                  
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.16 UFØREGRAD                                                 */        
    /* -------------------------------------------------------------- */        
    IF (U3S.REAKTIVISERING = 'X' &                                              
        (MOD(U3S.UFG,5) ^= 0)    ) THEN                                         
       DO;  /* KAN IKKE HA TRINNLØS UFØREGRAD UTEN REAKTIVSERING */             
          FEIL_FUNNET = '1'B;                                                   
          U3S.UFGNR = 343;                                                      
       END; /* KAN IKKE HA TRINNLØS UFØREGRAD UTEN REAKTIVSERING */             
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.18 GARANTI SOM UNG UFØR       9802                           */        
    /* -------------------------------------------------------------- */        
    IF VERIFY(U3S.GARANTERT_TP, 'JN ') ^= 0 THEN                                
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U3S.GARANTERT_TPNR = 1541;                                            
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.19 DIAGNOSE - DETTE FELT ER TATT UT AV BLANKETTEN            */        
    /* -------------------------------------------------------------- */        
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.20 VIRKNINGSDATO                                             */        
    /* -------------------------------------------------------------- */        
    IF ^F_NUMERISK((U3S.VIRK_DATO_ÅMD)) THEN                                    
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U3S.VIRK_DATO_ÅMDNR = 200;                                            
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          IF ^F_GYLDIG_DATO(U3S.VIRK_DATO_ÅMD) THEN                             
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U3S.VIRK_DATO_ÅMDNR = 9;                                        
             END;                                                               
       END;                                                                     
                                                                                
    /* -------------------------------------------------------------- */        
    /* 1.19 FRIINNTEKT FRA OG MED DATO                                */        
    /* -------------------------------------------------------------- */        
                                                                                
    /* JFA KONTROLL PÅ VIRK - NY REGEL FOR FRIINNTEKT FRA 01.01.2004*/          
    IF (U3S.FRIINNTEKT_DATO_ÅMD > 0) THEN                                       
       DO;  /* FRIINTEKT ER FYLT UT */                                          
          IF HJ_VIRK_DATO_ÅMD > 20040000  THEN                                  
             DO;  /* VIRKDATO MÅ VÆRE 2004 ELLER SENERE */                      
                IF ^F_NUMERISK((U3S.FRIINNTEKT_DATO_ÅMD)) THEN                  
                   DO;  /* IKKE NUMMERISK */                                    
                      FEIL_FUNNET        = '1'B;                                
                      U3S.FRIINNTEKT_DATO_ÅMDNR = 200;                          
                   END; /* IKKE NUMMERISK */                                    
                ELSE                                                            
                   IF ^F_GYLDIG_DATO(U3S.FRIINNTEKT_DATO_ÅMD) THEN              
                      DO;  /* UGYLDIG DATO */                                   
                         FEIL_FUNNET        = '1'B;                             
                         U3S.FRIINNTEKT_DATO_ÅMDNR = 9;                         
                      END; /* UGYLDIG DATO */                                   
             END; /* VIRKDATO MÅ VÆRE 2004 ELLER SENERE */                      
          ELSE                                                                  
             DO;  /* VIRKDATO FØR 2004 - SKAL VÆRE BLANK */                     
                FEIL_FUNNET        = '1'B;                                      
                U3S.FRIINNTEKT_DATO_ÅMDNR = 642;                                
             END; /* VIRKDATO FØR 2004 - SKAL VÆRE BLANK */                     
                                                                                
       END;  /* FRIINTEKT ER FYLT UT */                                         
    /* -------------------------------------------------------------- */        
    /* DERSOM FRIINNTEKT IKKE ER UTFYLT MÅ DET KONTROLLERES MOT BLA.  */        
    /* STATUS DETTE ER DERFOR FLYTTET TIL U620 - 071004 MARTIN        */        
    /* -------------------------------------------------------------- */        
                                                                                
        /* ---------------------------------------------------------- */        
        /* 1.21 INNTEKT FØR UP                                        */        
        /* ---------------------------------------------------------- */        
                                                                                
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U3S.INNTEKT_FØR_UP)) THEN                   
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U3S.INNTEKT_FØR_UPNR = 200;                                           
       END;                                                                     
                                                                                
    IF U3S.INNTEKT_FØR_UP > 0 & U3S.ATT_UF = 'A' THEN                           
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U3S.INNTEKT_FØR_UPNR = 399;   /* JD 02.97 */                          
       END;                                                                     
    /* ---------------------------------------------------------- */            
    /* 1.22 REAKTIVISERING                                  §     */            
    /* ---------------------------------------------------------- */            
                                                                                
    IF (VERIFY(U3S.REAKTIVISERING,'SX ') ^=0)   THEN                            
       DO;  /* REAKTIVISERING KAN KUN OPPHØRE VED ØKNING AV GRAD */             
          FEIL_FUNNET = '1'B;                                                   
          U3S.REAKTIVISERINGNR = 429;                                           
       END; /* REAKTIVISERING KAN KUN OPPHØRE VED ØKNING AV GRAD */             
                                                                                
    IF U3S.REAKTIVISERING = 'S'           THEN                                  
       IF HJ_VIRK_DATO_ÅMD < 20010900        THEN                               
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3S.REAKTIVISERINGNR = 625;                                        
          END;                                                                  
       ELSE                                                                     
       IF (U3S.UFG < 20) ! (U3S.UFG = 100)    THEN                              
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3S.REAKTIVISERINGNR = 648;                                        
          END;                                                                  
                                                                                
                                                                                
    /* ---------------------------------------------------------- */            
    /* 1.23 UNNTAK FRA VENTETID                             §     */            
    /* ---------------------------------------------------------- */            
    IF (VERIFY(U3S.UNNTAK_VENTETID,'S ') ^=0)  THEN                             
       DO;                                                                      
          FEIL_FUNNET           = '1'B;                                         
          U3S.UNNTAK_VENTETIDNR = 665;                                          
       END;                                                                     
                                                                                
    /* ---------------------------------------------------------- */            
    /* 1.24 FEM ÅRS FRYSPERIODE           9802              §     */            
    /* ---------------------------------------------------------- */            
    IF (VERIFY(U3S.FRYSP_5ÅR_ARB,'SX ') ^=0)    THEN                            
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.FRYSP_5ÅR_ARBNR = 429;                                            
       END;                                                                     
                                                                                
    /* ---------------------------------------------------------- */            
    /* 1.25 TIDSBEGRENSET FRYSPERIODE     9802              §     */            
    /* ---------------------------------------------------------- */            
    IF (VERIFY(U3S.FRYSP_TIDSB,'SX ') ^=0)    THEN                              
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.FRYSP_TIDSBNR = 429;                                              
       END;                                                                     
                                                                                
    IF   U3S.FRYSP_5ÅR_ARB  = 'S'             &                                 
         U3S.FRYSP_TIDSB  = 'S'                        THEN                     
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.FRYSP_TIDSBNR = 437;                                              
       END;                                                                     
                                                                                
    IF   U3S.FRYSP_5ÅR_ARB  = 'X'             &                                 
         U3S.FRYSP_TIDSB  = 'X'                        THEN                     
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.FRYSP_TIDSBNR = 437;                                              
       END;                                                                     
                                                                                
    /* ---------------------------------------------------------- */            
    /* 1.26 LØNNSTILSKUDD               200501              §     */            
    /* --------------------------------------------------------   */            
    IF (VERIFY(U3S.LØNNSTILSKUDD,'SX ') ^=0)    THEN                            
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3S.LØNNSTILSKUDDNR = 429;                                            
       END;                                                                     
    IF U3S.LØNNSTILSKUDD = 'S'               THEN                               
       DO;                                                                      
          IF HJ_VIRK_DATO_ÅMD < 20050100             THEN                       
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.LØNNSTILSKUDDNR = 676;                                      
             END;                                                               
          ELSE                                                                  
          IF U3S.YRKE > 10                           THEN                       
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.LØNNSTILSKUDDNR = 671;                                      
             END;                                                               
          ELSE                                                                  
          IF (U3S.UFG < 20         !                                            
              U3S.UFG > 95            )        !                                
             (MOD(U3S.UFG,5 )  ^= 0 ) THEN                                      
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFGNR   = 672;                                              
             END;                                                               
          ELSE                                                                  
          IF U3S.FRIINNTEKT_DATO_ÅMD > 0    THEN                                
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.LØNNSTILSKUDDNR = 679;                                      
             END;                                                               
       END;                                                                     
    /* ---------------------------------------------------------- */            
                                                                                
    /* ---------------------------------------------------------- */            
    /* 2.1 FØDSELSNUMMER EKTEFELLE/PARTNER/SAMBOER                */            
    /* ---------------------------------------------------------- */            
    IF F_FELT_PIC_CHAR11(U3S.FNR_EK) ^= (11)'0' THEN                            
       DO;                                                                      
          IF ^F_NUMERISK(F_FELT_PIC_CHAR11(U3S.FNR_EK)) THEN                    
             DO;                                                                
                FEIL_FUNNET  = '1'B;                                            
                U3S.FNR_EKNR = 200;                                             
             END;                                                               
          ELSE                                                                  
          IF U3S.ATT_UF = 'X'          THEN/*DAGPENGER*/                        
             DO;                                                                
                FEIL_FUNNET  = '1'B;                                            
                U3S.FNR_EKNR = 491;                                             
             END;                                                               
          ELSE                                                                  
          IF ^F_GYLDIG_FNR(U3S.FNR_EK) THEN                                     
             DO;                                                                
                FEIL_FUNNET  = '1'B;                                            
                U3S.FNR_EKNR = 1;                                               
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                FNR_REG.FNR1 = U3S.FNR_EK;                                      
                EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);           
                IF FNR_REG.FNR2 > 0 THEN                                        
                   DO;                                                          
                      U3S.FNR_EKNR   = 203;                                     
                      U3S.FNR_GML_EK = U3S.FNR_EK;                              
                      U3S.FNR_EK     = FNR_REG.FNR2;                            
                   END;                                                         
             END;                                                               
       END; /* KONTROLL FELT 2.1 FNR EKTEFELLE */                               
                                                                                
    FNR13_EK_DEF = KONV_FNR11_FNR13(U3S.FNR_EK);       /*2YK*/                  
                                                                                
    /* ---------------------------------------------------------- */            
    /* 2.3 EKTEFELLES INNTEKT OVER 2G                             */            
    /* ---------------------------------------------------------- */            
    IF VERIFY(U3S.EK_INNT_OVER_2G, 'JN ') ^= 0 THEN                             
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U3S.EK_INNT_OVER_2GNR = 1541;                                         
       END;                                                                     
    /* ---------------------------------------------------------- */            
    /* KRYSSKONTROLL 1.20 & 2.3                                   */            
    /* ---------------------------------------------------------- */            
    IF (HJ_VIRK_DATO_ÅMD > 19980100) THEN                                       
       SELECT(U3S.EK_INNT_OVER_2G);                                             
          WHEN(' ')                                                             
             IF (VERIFY(U3S.SIVILSTAND,'GPW') = 0) THEN                         
                DO;                                                             
                   FEIL_FUNNET        = '1'B;                                   
                   U3S.EK_INNT_OVER_2GNR = 272;                                 
                END;                                                            
          OTHER                                                                 
             IF (VERIFY(U3S.SIVILSTAND,'GPW') ^= 0) THEN                        
                DO;                                                             
                   FEIL_FUNNET        = '1'B;                                   
                   U3S.EK_INNT_OVER_2GNR = 1542;                                
                END;                                                            
       END; /* SELECT */                                                        
    ELSE                                                                        
       DO;  /* VIRKDATO FØR 9802 */                                             
          IF (U3S.EK_INNT_OVER_2G ^= ' ') THEN                                  
             DO;                                                                
                FEIL_FUNNET           = '1'B;                                   
                U3S.EK_INNT_OVER_2GNR = 689;                                    
             END;                                                               
       END; /* VIRKDATO FØR 9802 */                                             
                                                                                
    /* ---------------------------------------------------------- */            
    /* HER SETTES VERDIER INN I MENY_OMR                          */            
    /* ---------------------------------------------------------- */            
    FØDSNUMMER    = U3S.FNR;                                                    
    VIRKNINGSDATO_ÅMD = U3S.VIRK_DATO_ÅMD;                                      
                                                                                
                                                                                
                                                                                
    IF ^FEIL_FUNNET THEN                                                        
       DO;                                                                      
          HJ_UFT_ÅMD      = U3S.UFT_ÅMD;                                        
          ALDER           = F_ALDER(U3S.FNR,U3S.UFT_ÅMD);                       
            /*ALDER2 LAGT INN 9.2000 JD*/                                       
          ALDER2          = F_ALDER(U3S.FNR,U3S.VIRK_DATO_ÅMD);                 
                                                                                
          /* TRUDE 04.04.05  GIKK AN Å REG PI VED ALDER < 17 ÅR */              
          IF U3S.PI   > 0 &                                                     
             ALDER    < 1800 THEN                                               
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.PINR    = 252;                                              
             END;                                                               
                            /* TRUDE TIL HIT*/                                  
          IF  HJ_VIRK_DATO_ÅMD > 19920000 &                                     
              HJ_UFT_ÅMD      < 19920000     THEN                               
               DIV_PARAM_OMR.REGN_1291 = 'J';                                   
                                                                                
          W_FNR_EK       = U3S.FNR_EK;                                          
                                                                                
          IF ALDER < 1600 THEN                                                  
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFT_ÅMDNR = 196;                                            
             END;                                                               
          IF (ALDER  > 1600 & HJ_UFT_ÅMD > 19971231) &                          
              ALDER2 < 1801  THEN                                               
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.FNRNR = 608;                                                
             END;                                                               
          IF ALDER2 < 1801 & HJ_VIRK_DATO_ÅMD > 19981231 THEN                   
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.VIRK_DATO_ÅMDNR = 609;                                      
             END;                                                               
          IF ALDER2 < 1801 & HJ_UFT_ÅMD > 19971231 THEN                         
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFT_ÅMDNR = 610;                                            
             END;                                                               
          IF HJ_UFT_ÅMD > DAGENS_DATO_ÅMD   THEN                                
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U3S.UFT_ÅMDNR = 206;                                            
             END;                                                               
          ELSE;                                                                 
          ALDER           = F_ALDER(U3S.FNR,U3S.VIRK_DATO_ÅMD);                 
                                                                                
 /*         FJERNET 15.3.00                                                     
          IF F_KJØNN(U3S.FNR) = 'K' THEN                                        
             DO IÅR = 1 TO 2;                                                   
                IF U3S.VP_ÅR(IÅR) > 0 THEN                                      
                   DO;                                                          
                      FEIL_FUNNET      = '1'B;                                  
                      U3S.VP_ÅRNR(IÅR) = 47;                                    
                      U3S.FNRNR        = 999;                                   
                   END;                                                         
             END;                                                               
 **************************************** */                                    
                                                                                
          IF ^FEIL_FUNNET &                                                     
              U3S.VP_ÅR(1) > 0 &                                                
              U3S.VP_ÅR(2) > 0 &                                                
              U3S.VP_ÅR(1) = U3S.VP_ÅR(2) THEN                                  
             DO;                                                                
                FEIL_FUNNET    = '1'B;                                          
                U3S.VP_ÅRNR(1) = 124;                                           
                U3S.VP_ÅRNR(2) = 999;                                           
             END;                                                               
                                                                                
             /* ?? HVORFOR MH 9706 */                                           
         IF U3S.YNGSTE_BARN_FÅR > 0   &                                         
            UFT_Å               <  1993 THEN/* 2000-3 */                        
           DO;                                                                  
               U3S.YNGSTE_BARN_FÅRNR = 473;  /* TS 0694*/                       
               FEIL_FUNNET = '1'B;           /*STM FLYTTET */                   
           END;                                                                 
                                                                                
                                                                                
         IF U3S.YNGSTE_BARN_FÅR > 0   &                                         
            U3S.YNGSTE_BARN_FÅR < 1986    THEN   /* 2000-3 */                   
           DO;                                                                  
               U3S.YNGSTE_BARN_FÅRNR = 473;  /* HL 0796*/                       
               FEIL_FUNNET = '1'B;                                              
           END;                                                                 
             /* ?? HVORFOR TIL HER MH9706 */                                    
                                                                                
          IF HJ_UFT_ÅMD > HJ_VIRK_DATO_ÅMD THEN                                 
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U3S.UFT_ÅMDNR      = 41;                                        
                U3S.VIRK_DATO_ÅMDNR = 999;                                      
             END;                                                               
          ELSE                                                                  
          IF ^ F_6MDR(HJ_VIRK_DATO_ÅMD)         THEN                            
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U3S.VIRK_DATO_ÅMDNR = 205;                                      
             END;  /* TEST TRUDE 180105*/                                       
                                                                                
  /*200410 HL REMEDY 252                                                        
          IF ^ F_2MDR(HJ_VIRK_DATO_ÅMD)         THEN                            
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U3S.VIRK_DATO_ÅMDNR = 207;                                      
             END; TRUDE 180105 */                                               
                                                                                
                                                                                
          ELSE                                                                  
          IF ALDER < 1600 THEN                                                  
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U3S.FNRNR          = 50;                                        
                U3S.VIRK_DATO_ÅMDNR = 999;                                      
             END;                                                               
          ELSE                                                                  
           IF U3S.VIRK_DATO_ÅMD < 19730100 & ALDER >= 7000 THEN                 
              DO;                                                               
                 FEIL_FUNNET        = '1'B;                                     
                 U3S.FNRNR          = 51;                                       
                 U3S.VIRK_DATO_ÅMDNR = 999;                                     
              END;                                                              
          ELSE                                                                  
           IF ALDER > 6700 &  U3S.VIRK_DATO_ÅMD > 19910000 THEN                 
              DO;                                                               
                 FEIL_FUNNET        = '1'B;                                     
                 U3S.FNRNR          = 52;                                       
                 U3S.VIRK_DATO_ÅMDNR = 999;                                     
              END;                                                              
           ELSE                                                                 
           IF U3S.SIVILSTAND = 'P'   &                                          
             (U3S.FNR_EK > 0 & F_KJØNN(U3S.FNR)                                 
                                 ^= F_KJØNN(U3S.FNR_EK)) THEN                   
              DO;                                                               
                 FEIL_FUNNET  = '1'B;                                           
                 U3S.FNRNR    = 392;                                            
                 U3S.FNR_EKNR = 999;                                            
              END;                                                              
           ELSE                                                                 
 /*--------------------------------------AB------------*/                       
           IF U3S.FNR           =   U3S.FNR_EK   THEN                           
             DO;                                                                
                IF (VERIFY(U3S.SIVILSTAND,'GPAWV') = 0) THEN                    
                 DO;                                                            
                     FEIL_FUNNET    =   '1'B;                                   
                     U3S.FNR_EKNR   =   208 ;                                   
                 END;                                                           
             END;                                                               
         /*-SIVILSTAND V LAGT INN DES. 2003 JD (SE REMEDY 345) */               
            ELSE                                                                
            IF (VERIFY(U3S.SIVILSTAND,'PAV') ^= 0) &                            
             (U3S.FNR_EK > 0 & F_KJØNN(U3S.FNR)                                 
                                  = F_KJØNN(U3S.FNR_EK)) THEN                   
              DO;                                                               
                 FEIL_FUNNET  = '1'B;                                           
                 U3S.FNRNR    = 16;                                             
                 U3S.FNR_EKNR = 999;                                            
              END;                                                              
            ELSE                                                                
            IF (VERIFY(U3S.SIVILSTAND,'GPAVW') ^= 0) &                          
               (U3S.FNR_EK > 0 ! U3S.NAVN_EK ^= (25)' ') THEN                   
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  U3S.SIVILSTANDNR = 123;                                       
                  U3S.FNR_EKNR = 999;                                           
                  U3S.NAVN_EKNR = 999;                                          
               END;                                                             
            ELSE                                                                
            IF U3S.FNR_EK > 0 & U3S.NAVN_EK = (25)' ' THEN                      
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  U3S.NAVN_EKNR = 118;                                          
               END;                                                             
            ELSE                                                                
            IF U3S.TILL_EK = 'J' THEN                                           
               DO;                                                              
                  IF U3S.NAVN_EK = (25)' ' THEN                                 
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        U3S.NAVN_EKNR = 19;                                     
                        U3S.TILL_EKNR = 999;                                    
                     END;                                                       
                  ELSE                                                          
                  IF U3S.FNR_EK = 0 THEN                                        
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        U3S.FNR_EKNR = 15;                                      
                        U3S.TILL_EKNR = 999;                                    
                     END;                                                       
                                                                                
                                                                                
                  ELSE                                                          
                  IF   (VERIFY(U3S.SIVILSTAND,'AGPWV') ^= 0) THEN               
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        U3S.SIVILSTANDNR = 54;                                  
                        U3S.TILL_EKNR = 999;                                    
                     END;                                                       
               END;                                                             
            ELSE                                                                
               IF (U3S.FNR_EK = 0 ! U3S.NAVN_EK = (25)' ') &                    
                  (VERIFY(U3S.SIVILSTAND,'AGPWV') = 0) THEN                     
                  DO;                                                           
                     FEIL_FUNNET = '1'B;                                        
                     U3S.FNR_EKNR = 18;                                         
                     U3S.NAVN_EKNR = 999;                                       
                     U3S.SIVILSTANDNR = 999;                                    
                  END;                                                          
         END;                                                                   
   END KONTROLL_U3_SØKER;                                                       
 /* ================================================================= */        
   KONTROLL_U3_YP:                                                              
   PROC(FEIL_FUNNET);                                                           
      /* ------------------------------------------------------------ */        
      /* KONTROLL AV YRKESP  INFO                                     */        
      /* ------------------------------------------------------------ */        
     DCL FEIL_FUNNET   BIT(1);                                                  
     DCL VERIFY        BUILTIN;                                                 
                                                                                
     IF (VERIFY(U3Y.VILKÅR_1_2_2A, 'J ') ^= 0 ) THEN                            
        DO;                                                                     
           FEIL_FUNNET   ='1'B;                                                 
           U3Y.VILKÅR_1_2_2ANR = 301;                                           
        END;                                                                    
                                                                                
                                                                                
     IF (VERIFY(U3Y.VILKÅR_1_2_2B, 'J ') ^= 0 ) THEN                            
         DO;                                                                    
            FEIL_FUNNET   ='1'B;                                                
            U3Y.VILKÅR_1_2_2BNR = 302;                                          
         END;                                                                   
                                                                                
     IF ^F_NUMERISK((U3Y.YST_ÅMD)) THEN                                         
        DO;                                                                     
           FEIL_FUNNET    = '1'B;                                               
           U3Y.YST_ÅMDNR = 200;                                                 
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           IF ^F_GYLDIG_DATO(U3Y.YST_ÅMD) THEN                                  
              DO;                                                               
                 FEIL_FUNNET    = '1'B;                                         
                 U3Y.YST_ÅMDNR = 304;                                           
              END;                                                              
           ELSE                                                                 
           IF (U3Y.YST_ÅMD) < 19710100 THEN                                     
              DO;                                                               
                 FEIL_FUNNET    = '1'B;                                         
                 U3Y.YST_ÅMDNR = 305;                                           
              END;                                                              
       END;                                                                     
                                                                                
       IF (VERIFY(U3Y.YSYKDOM, 'JN') ^= 0 ) THEN                                
           DO;                                                                  
              FEIL_FUNNET   ='1'B;                                              
              U3Y.YSYKDOMNR = 306;                                              
           END;                                                                 
                                                                                
                                                                                
       IF ^F_NUMERISK(F_FELT_PIC_CHAR3(U3Y.YUG)) THEN                           
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3Y.YUGNR = 200;                                                   
          END;                                                                  
       ELSE                                                                     
                                                                                
                                                                                
       IF U3Y.YUG < 15 ! U3Y.YUG > 100 THEN                                     
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U3Y.YUGNR = 307;                                                   
          END;                                                                  
                                                                                
                                                                                
                                                                                
    IF  U3Y.KAP_11_7_UTLØST = 'J'          THEN                                 
               DIV_PARAM_OMR.REGN_1291 = ' ';                                   
    ELSE                                                                        
    IF ^(U3Y.KAP_11_7_UTLØST = ' ') THEN                                        
        DO;                                                                     
           FEIL_FUNNET   ='1'B;                                                 
           U3Y.KAP_11_7_UTLØSTNR = 308;                                         
        END;                                                                    
                                                                                
    IF VERIFY(U3Y.YRKE11,'FMUEVSA') ^= 0 THEN                                   
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3Y.YRKE11NR =  309 ;                                                 
       END;                                                                     
                                                                                
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U3Y.AÅI)) THEN                              
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U3Y.AÅINR = 200 ;                                                     
       END;                                                                     
                                                                                
    IF F_FELT_PIC_CHAR11(U3Y.FNR_EK) ^= (11) '0' THEN                           
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U3Y.FNR_EKNR        = 315 ;                                           
       END;                                                                     
                                                                                
    IF F_FELT_PIC_CHAR11(U3Y.FNR_SAMBOER) ^= (11) '0' THEN                      
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U3Y.FNR_SAMBOERNR   = 315 ;                                           
       END;                                                                     
                                                                                
    IF F_FELT_PIC_CHAR11(U3Y.FNR_Y_BARN) ^= (11) '0' THEN                       
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U3Y.FNR_Y_BARNNR    =  315 ;                                          
       END;                                                                     
                                                                                
    IF U3Y.PLEIEBARN ^= ' '  THEN                                               
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U3Y.PLEIEBARNNR     = 315 ;                                           
       END;                                                                     
                                                                                
    IF ^FEIL_FUNNET THEN                                                        
       DO;                                                                      
                                                                                
          IF   (U3Y.YST_ÅMD) > (U3S.VIRK_DATO_ÅMD) !                            
               (U3Y.YST_ÅMD) > (U3S.UFT_ÅMD) THEN                               
             DO;                                                                
                  FEIL_FUNNET    = '1'B;                                        
                  U3Y.YST_ÅMDNR  =  312 ;                                       
              END;                                                              
                                                                                
                                                                                
          IF U3Y.KAP_11_7_UTLØST = 'J' &                                        
             U3Y.YUG > 29              THEN                                     
             DO;                                                                
                 FEIL_FUNNET            = '1'B;                                 
                 U3Y.KAP_11_7_UTLØSTNR  =  313 ;                                
                 U3Y.YUGNR              =  999 ;                                
              END;                                                              
                                                                                
          IF U3Y.KAP_11_7_UTLØST = 'J' &                                        
             U3S.ATT_UF          = 'X' THEN                                     
             DO;                                                                
                                                                                
                 FEIL_FUNNET            = '1'B;                                 
                 U3Y.KAP_11_7_UTLØSTNR  =  398 ;                                
                 U3S.ATT_UFNR           =  999 ;                                
              END;                                                              
                                                                                
           IF U3Y.KAP_11_7_UTLØST = 'J' &                                       
              U3S.UFG > 29              THEN                                    
              DO;                                                               
                                                                                
                                                                                
                 FEIL_FUNNET            = '1'B;                                 
                 U3Y.KAP_11_7_UTLØSTNR  =  313 ;                                
                 U3Y.YUGNR              =  999 ;                                
              END;                                                              
                                                                                
                                                                                
                                                                                
           IF U3Y.YRKE11    = 'F' &                                             
              U3Y.AÅI      ^= 9999999 THEN                                      
              DO;                                                               
                                                                                
                  FEIL_FUNNET     = '1'B;                                       
                  U3Y.AÅINR       =  314;                                       
                  U3Y.YRKE11NR    =  999;                                       
               END;                                                             
            ELSE                                                                
            IF U3Y.YRKE11    = 'A' &                                            
               U3Y.AÅI       = 9999999 THEN                                     
               DO;                                                              
                                                                                
                                                                                
                  FEIL_FUNNET     = '1'B;                                       
                  U3Y.AÅINR       =  316;                                       
                  U3Y.YRKE11NR    =  999;                                       
               END;                                                             
                                                                                
           IF   VERIFY(U3Y.YRKE11,'EMSUV') = 0 &                                
                U3Y.AÅI       = 9999999 THEN                                    
                U3Y.AÅI       = 0;                                              
                                                                                
            IF U3S.YSKADE_TILLEGG = 'J' THEN                                    
               DO;                                                              
                  IF U3S.UFG      = 0 THEN                                      
                     U3S.UFG      = U3Y.YUG;                                    
               END;                                                             
                                                                                
             IF  U3S.UFG           <  U3Y.YUG   THEN                            
                DO;                                                             
                /* -------------------------------------------------- */        
                /* BLANKETTEN SKAL AVVISES DERSOM UFG < YUG.          */        
                /*                                          TS 290894 */        
                /* -------------------------------------------------- */        
                   FEIL_FUNNET        = '1'B;                                   
                   U3Y.YUGNR          = 317 ;                                   
                 END;                                                           
                                                                                
            IF ^(U3Y.VILKÅR_1_2_2A   = ' '  !                                   
                 U3Y.VILKÅR_1_2_2B   = ' '  )  &                                
                 U3S.NORSK_BOSATT = 'J'  THEN                                   
               DO;                                                              
                                                                                
                  FEIL_FUNNET        = '1'B;                                    
                  U3Y.VILKÅR_1_2_2ANR  = 318 ;                                  
                  U3Y.VILKÅR_1_2_2BNR  = 999 ;                                  
               END;                                                             
                                                                                
                                                                                
            ELSE                                                                
            IF ^(U3Y.VILKÅR_1_2_2A  = ' '  !                                    
                U3Y.VILKÅR_1_2_2B  = ' ' ) &                                    
                (U3Y.YUG    ^= U3S.UFG)   THEN                                  
                DO;                                                             
                                                                                
                                                                                
                     FEIL_FUNNET          = '1'B;                               
                     U3Y.YUGNR            = 324 ;                               
                     U3Y.VILKÅR_1_2_2ANR  = 999 ;                               
                     U3Y.VILKÅR_1_2_2BNR  = 999 ;                               
                  END;                                                          
         END;                                                                   
                                                                                
    END KONTROLL_U3_YP;                                                         
