 /*   SIST ENDRET PÅ PROD   2008.11.05 16.23.21 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2008.01.11 14.11.10 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 11.35.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.41.33 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.31 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.01.05  8.52.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.37.35 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.01 11.50.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.10.19  8.15.35 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.09.28  8.07.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.42.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.53.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.04.01  8.43.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.08 13.57.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.02.09 15.08.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.02.09 15.08.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.23  8.19.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.12.21 12.40.53 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.32.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.04  9.52.17 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.18 11.08.39 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 12.54.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.48.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.25 12.11.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.24  9.58.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.15.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.06 10.34.28 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.03.02 10.41.57 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.02.28 11.58.25 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.10.27 11.59.19 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.10.18 12.12.24 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.17 12.07.23 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.04 15.15.38 AV   JDA7339          */        
 /*       SIST ENDRET 15/04-99 09.35.37 AV   JDA7339                  */        
 /*       SIST ENDRET 15/04-99 09.14.34 AV   JDA7339                  */        
 /*       SIST ENDRET 25/01-99 14.42.53 AV   JDA7339                  */        
 /*       SIST ENDRET 25/01-99 14.42.05 AV   JDA7339                  */        
 /*       SIST ENDRET 08/01-99 13.01.33 AV   JDA7339                  */        
 /*       SIST ENDRET 08/01-99 13.00.19 AV   JDA7339                  */        
 /*       SIST ENDRET 25/11-98 10.29.26 AV   JDA7339                  */        
 /*       SIST ENDRET 25/11-98 10.27.31 AV   JDA7339                  */        
 /*       SIST ENDRET 16/06-98 13.23.37 AV   TSB7339                  */        
 /*       SIST ENDRET 10/06-98 09.48.20 AV   TSB7339                  */        
 /*       SIST ENDRET 09/06-98 08.31.57 AV   SPA7339                  */        
 /*       SIST ENDRET 03/06-98 09.39.35 AV   SPA7339                  */        
  /*IDENTIFIKASJON:                                                  */         
  /*    R001U621 - PROSEDYRE I PLI                                   */         
  /*    PROGRAMMERER: HERMAN          JULI 1993                      */         
  /*HENSIKT:                                                         */         
  /*    OPPRETTE PENSJONSSTATUS FOR SØKER FRA TRANSEN                */         
  /* *************************************************************** */         
  /*ENDRET:                                                          */         
  /*ENDRINGEN GJELDER:                                               */         
  /*ENDRET AV:                                                       */         
  /* *************************************************************** */         
  /* *************************************************************** */         
  /*PROGRAMTILKNYTNING:                                              */         
  /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV UFØREPENSJON  */         
  /*    INCLUDES I R001U620 NÅR STATUS_TYPE = A, C, I, K             */         
  /*BRUK:                                                            */         
  /*    CALL OPPRETT_B02_PENSJONSSTATUS_U3_SØKER                     */         
  /* *************************************************************** */         
 OPPRETT_STATUS_U3_SØKER:PROC;                                                  
                                                                                
    DCL ÅR_FØR_UFØRHET   PIC '9999';                                            
    DCL YRK_IND  FIXED BIN(15);                                                 
    DCL M        FIXED BIN(15);                                                 
    DCL VILKÅR_DEF CHAR(2);                                                     
    DCL 1 W_VILKÅR_1_2_2AB DEFINED VILKÅR_DEF,                                  
          3 W_VILKÅR_1_2_2A CHAR(1),                                            
          3 W_VILKÅR_1_2_2B CHAR(1);                                            
    DCL ALDER_VIRK          PIC '999999';                                       
                                                                                
    /* ============================================================== */        
    IF FEIL_MELD_NR = 0 THEN /* AB 01.08.15 */                                  
      PROGRAM_ID = 'R001U621';                                                  
       ALDER_VIRK = F_ALDER(U3S.FNR,U3S.VIRK_DATO_ÅMD); /* JD */                
       B02.TT_GARANTI(SØKER_IND) = 0;                                           
                                                                                
    IF (STATUS_TYPE_SØKER                = 'A' &                                
        B01.STATUS_KODE_HIST (SØKER_IND) = 'O' ) THEN                           
       DO;                                                                      
          /* ***************************************************** */           
          /* NÅR STATUS_TYPE = A OG STATUS_KODE_HIST = O MÅ VI     */           
          /* FØRST BLAKE FELTENE SOM LIGGER I STATUS_SEGMENTENE.   */           
          /* B01 ER FLYTTET OVER TIL B02 I R001U620.               */           
          /* ***************************************************** */           
           B02.STATUS   (SØKER_IND)   = '';                                     
           B02.UFØRPENS (SØKER_IND)   = '';                                     
           DO I = LBOUND(B02.UFØRHIST,2) TO                                     
                  HBOUND(B02.UFØRHIST,2);                                       
              B02.UFØRHIST (SØKER_IND,I) = '';                                  
           END;                                                                 
           B02.YRKEPENS (SØKER_IND)   = '';                                     
           DO I = LBOUND(B02.YRKEHIST,2) TO  HBOUND(B02.YRKEHIST,2);            
              B02.YRKEHIST (SØKER_IND,I) = '';                                  
           END;                                                                 
           B02.ETTEPENS (SØKER_IND)   = '';                                     
           B02.ETTEBARN (SØKER_IND)   = '';                                     
           B02.SPESOPPL (SØKER_IND)   = '';                                     
           B02.EØSINFO  (SØKER_IND)   = '';                                     
           /* TILFØYD 23.04.2004 - TIDLIGERE GLEMT ? */                         
           DO I = LBOUND(B02.TILKN,2) TO                                        
                  HBOUND(B02.TILKN,2);                                          
              B02.TILKN    (SØKER_IND,I)   = '';                                
           END;                                                                 
           B02.FORSI    (SØKER_IND)   = '';                                     
    /* DETTE MÅ IKKE BLANKES : HL */                                            
    /*     B02.ALDERSP  (SØKER_IND)   = '';                                     
           DO I = LBOUND(B02.AFPHIST,2) TO                                      
                  HBOUND(B02.AFPHIST,2);                                        
              B02.AFPHIST  (SØKER_IND,I)   = '';                                
           END;     ************ */                                             
        END;                                                                    
                                                                                
 /* ***************************************************************** */        
 /* STATUS_SEGMENTET                                                  */        
 /* ***************************************************************** */        
                                                                                
    IF (HJ_VIRK_DATO_ÅMD < 19980200  !                                          
        (HJ_VIRK_DATO_ÅMD = B01.VIRK_DATO_ÅMD(SØKER_IND) &                      
         B01.PENSJON_FØR_9802(SØKER_IND) = 'X')) THEN /*R 745, 927*/            
          B02.PENSJON_FØR_9802(SØKER_IND) = 'J';      /*JFA 18.3.05*/           
    ELSE                                                                        
       DO;   /*200010*/                                                         
          B02.PENSJON_FØR_9802(SØKER_IND) = ' ';                                
          B02.RED_GP_3_2_5    (SØKER_IND) = U3S.RED_GP_3_2_5;                   
       END;                                                                     
                                                                                
    B02.EK_INNT_OVER_2G(SØKER_IND) = U3S.EK_INNT_OVER_2G;                       
                                                                                
    IF (U3S.TILL_EK = 'J' & HJ_VIRK_DATO_ÅMD > 19910400) THEN                   
       U3S.TILL_EK = ' ';    /*JD 07.91*/                                       
                                                                                
    /*LAGT INN 12.7.96 HL :*/                                                   
    IF (U3S.UFT_ÅMD < 19910000) THEN                                            
       B02.PENSJONSRETT_FØR_91(SØKER_IND) = 'J';                                
                                                                                
                                                                                
    IF U3S.YSKADE_TILLEGG = 'J' THEN                                            
       DO;                                                                      
          B02.PENSJONSTYPE1(SØKER_IND) = 'Y';                                   
          IF (U3S.UFG          < 15 ) !                                         
             (MOD(U3S.UFG,5 )  ^= 0 ) THEN                                      
             DO;                                                                
   L260:                                                                        
              /* ---------------------------------------------------- */        
              /* UGYLDIG UFØREGRAD ('015','020' ... '100').           */        
              /* ---------------------------------------------------- */        
                    FEIL_VED_LABEL = '260';                                     
                    FEIL_MELD_NR   =  350;                                      
                    GO TO RETUR;                                                
             END;                                                               
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          B02.STATUS.PENSJONSTYPE1(SØKER_IND) = 'U';                            
          IF (U3S.UFG          < 50 ) !                                         
             (MOD(U3S.UFG,5 )  ^= 0 ) THEN                                      
             DO;                                                                
   L261:                                                                        
              /* ---------------------------------------------------- */        
              /* UGYLDIG UFØREGRAD ('050','055' ... '100').           */        
              /* ---------------------------------------------------- */        
                    FEIL_VED_LABEL = '261';                                     
                    FEIL_MELD_NR   =  38;                                       
                    GO TO RETUR;                                                
             END;                                                               
       END;                                                                     
                                                                                
                                                                                
    IF U3S.TILL_EK = 'J' THEN                                                   
       B02.PENSJONSTYPE2(SØKER_IND) = 'F';                                      
    ELSE                                                                        
    IF U3S.ATT_UF = 'X'          THEN          /*DAGPENGER*/                    
       B02.PENSJONSTYPE2(SØKER_IND) = 'A';                                      
    ELSE                                                                        
       B02.PENSJONSTYPE2(SØKER_IND) = 'P';                                      
                                                                                
    IF U3S.TILL_EK = ' ' &                                                      
       B01.PENSJONSTYPE2(SØKER_IND) = 'F' &                                     
       U3S.UFG < 50   THEN                                                      
       DO;                                                                      
          B02.PENSJONSTYPE2(SØKER_IND) = 'P';                                   
          B02.PENSJONSTYPE1(EKTEF_IND) = 'G';                                   
          B02.PENSJONSTYPE2(EKTEF_IND) = ' ';                                   
       END;                                                                     
                                                                                
    HJ_UFT_ÅMD     = U3S.UFT_ÅMD;                                               
    ÅR_FØR_UFØRHET = HJ_UFT_Å - 1;                                              
                                                                                
    IF U3SP.STI_ÅMD_3B > 0          THEN                                        
       HJ_ÅMD = U3SP.STI_ÅMD_3B;                                                
    ELSE                                                                        
       HJ_ÅMD = U3S.UFT_ÅMD;                                                    
                                                                                
    HJ_ÅMD_FIX = HJ_ÅMD;                                                        
                                                                                
    B02.SIVILSTAND(SØKER_IND)           = U3S.SIVILSTAND;                       
    B02.NAVN      (SØKER_IND)           = U3S.NAVN;                             
    B02.SPRÅK     (SØKER_IND)           = U3S.SPRÅK;                            
    B02.TKNR      (SØKER_IND)           = U3S.TKNR;                             
                                                                                
    IF U3S.YRKE                       >   0 THEN                                
       B02.YRKES_KODE(SØKER_IND)      = U3S.YRKE;                               
                                                                                
 /* ***************************************************************** */        
 /* VERNEPLIKTSOPPLYSNINGER                                           */        
 /* ***************************************************************** */        
                                                                                
    DO I = 1 TO HBOUND(U3S.VP_TAB) WHILE (U3S.VP_ÅR(I) > 0);                    
       B02.VERNEPLIKTÅR(SØKER_IND,I) = U3S.VP_ÅR(I);                            
    END;                                                                        
                                                                                
    B02.UFØRPENS.VILKÅR_8_4_3A(SØKER_IND) = U3S.VILKÅR_8_4_3A;                  
    B02.UFØRPENS.UFG          (SØKER_IND) = U3S.UFG;                            
 /*KOMMER I FORB MED NY U3 : - 9803 */                                          
    IF ALDER_UF  > 2600       THEN                                              
       B02.UFØRPENS.GARANTERT_TP (SØKER_IND) = ' ';                             
    ELSE                                                                        
    IF (FNR13_Å < 1941) THEN                                                    
       U3S.GARANTERT_TP = ' ';        /* KONS RF */                             
    ELSE                                                                        
    IF U3S.GARANTERT_TP = ' '      THEN                                         
  L262:                                                                         
       DO;                                                                      
          FEIL_VED_LABEL = '262';                                               
          FEIL_MELD_NR   = 1544;                                                
          GO TO RETUR;                                                          
       END;                                                                     
    ELSE                                                                        
    B02.UFØRPENS.GARANTERT_TP (SØKER_IND) = U3S.GARANTERT_TP;                   
    IF U3S.FRYSP_5ÅR_ARB ^= ' '     !                                           
       U3S.FRYSP_TIDSB   ^= ' '         THEN                                    
  L266:                                                                         
       DO;                                                                      
          FEIL_VED_LABEL = '266';                                               
          FEIL_MELD_NR   = 1545;                                                
          GO TO RETUR;                                                          
       END;                                                                     
    /*********** NY U3 HIT */                                                   
    B02.VIRK_DATO_ÅMD         (SØKER_IND) = HJ_VIRK_DATO_ÅMD;                   
                                                                                
       /* MARTIN FEB 2001 */                                                    
    IF (STATUS_TYPE_SØKER = 'I') & /* SS = 'X' & TIDL UP */                     
       (B01.UFT_ÅMD(SØKER_IND,1) > 0            ) &                             
       (B01.UFT_ÅMD(SØKER_IND,1) ^= U3S.UFT_ÅMD &                               
        B01.PENSJONSTYPE3(SØKER_IND) ^= 'A'     ) &                             
       (U3S.INNTEKT_FØR_UP > 0                  ) THEN                          
 L120: DO;                                                                      
          /* ----------------------------------------------------- */           
          /* DETTE GJELDER PERSONER SOM HAR EN TIDLIGERE AVSLUTTET */           
          /* UFØREPENSJON, I SLIKE TILFELLER SKAL INNTEKTSNIVÅET   */           
          /* FASTSETTES UT FRA FØRSTE UFØRETIDSPUNKT SELV OM DET   */           
          /* HAR VÆRT OPPHØR. DERSOM DET TIDLIGERE INNTEKTSNIVÅ    */           
          /* SKAL JUSTERES, SKAL DETTE GJØRES PÅ ENDRINGSBLANKETT. */           
          /* -> AVKLART MED REG.SEK. V/HULTGREN & AASEBØ FEB 2001. */           
          /*                                    MARTIN 28.02.2001  */           
          /* ----------------------------------------------------- */           
          FEIL_VED_LABEL = '120'; /* TILSVARER FELTNUMMER */                    
          FEIL_MELD_NR   = 340;                                                 
          GO TO RETUR;                                                          
       END;                                                                     
    ELSE                                                                        
       DO;  /* HAR IKKE TIDLIGERE UFØREPERIODER */                              
          IF (U3S.ATT_UF = 'U') THEN                                            
             DO;  /* NY TEST IFBM OPPRETTING IFU */                             
                B02.INNTEKT_FØR_UP(SØKER_IND) =                                 
                   U3S.INNTEKT_FØR_UP / 100;                                    
                B02.INNT_DATO_ÅMD (SØKER_IND) =                                 
                   HJ_UFT_ÅMD;                                                  
             END;                                                               
       END; /* HAR IKKE TIDLIGERE UFØREPERIODER */                              
                                                                                
    B02.UFØRPENS.UTDANNING    (SØKER_IND) = U3S.UTDANNING;                      
    B02.UFØRPENS.YRKESM_ATTF  (SØKER_IND) = U3S.YRKESM_ATTF;                    
                                                                                
    IF U3S.REAKTIVISERING ^= ' '  THEN                                          
  L130:                                                                         
       DO;                                                                      
          FEIL_VED_LABEL = '130';                                               
          FEIL_MELD_NR   = 440;                                                 
          GO TO RETUR;                                                          
       END;                                                                     
                                                                                
     IF U3S.LØNNSTILSKUDD ^= ' '  THEN                                          
   L135:                                                                        
        DO;                                                                     
           FEIL_VED_LABEL = '135';                                              
           FEIL_MELD_NR   = 670;                                                
           GO TO RETUR;                                                         
        END;                                                                    
                                                                                
    IF (HJ_VIRK_DATO_ÅMD > 20040000)  &                                         
        U3S.ATT_UF                 ^= 'A' THEN    /* #713*/                     
  L140:                                                                         
       DO;  /* VIRKDATO ETTER 2003 */                                           
          IF (U3S.FRIINNTEKT_DATO_ÅMD           = 0  &                          
              /* REMEDY 962 */                                                  
              B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1)^= U3S.UFT_ÅMD &                 
              U3S.UNNTAK_VENTETID              ^='S' ) THEN                     
             DO; /*MÅ FYLLES UT JFA */                                          
                FEIL_VED_LABEL = '140';                                         
                FEIL_MELD_NR   = 634;                                           
                GO TO RETUR;                                                    
             END;                                                               
  L150:                                                                         
          IF (U3S.UNNTAK_VENTETID   ^= 'S'                       &              
              /* R962 */                                                        
              HJ_FRIINNTEKT_DATO_ÅMD > 0                         &              
              /* REMEDY 962 */                                                  
              B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1)^= U3S.UFT_ÅMD &                 
              HJ_FRIINNTEKT_DATO_ÅMD < (HJ_VIRK_DATO_ÅMD + 10000)) THEN         
             /* ETT ÅR ETTER VIRK */                                            
       /*    IF (B01.PENSJONSTYPE1(SØKER_IND)    = 'K'     &                    
                 B01.STATUS_KODE_HIST(SØKER_IND) = 'X'     &                    
                 B01.VIRK_DATO_ÅMD(SØKER_IND) = HJ_VIRK_DATO_ÅMD) THEN          
                DO;                                                             
                END;                                                            
             ELSE   */                                                          
             DO;                                                                
                FEIL_VED_LABEL = '150';                                         
          /*    FEIL_MELD_NR   = 632;    */                                     
                FEIL_MELD_NR   = 643;    /* REMEDY 848 */                       
                GO TO RETUR;                                                    
             END;                                                               
                                                                                
          /* -------------------------------------------------------- */        
          /* OPPDATERER FRIINNTEKT I STATUS                           */        
          /* -------------------------------------------------------- */        
     /*   IF (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1) = 0) THEN   */                  
             B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) =                        
                                   U3S.FRIINNTEKT_DATO_ÅMD;                     
     /*   ELSE                                                                  
             DO;                                                                
                B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) =                     
                   U3S.VIRK_DATO_ÅMD + 1;                                       
                                                                                
                U3S.FRIINNTEKT_DATO_ÅMD =                                       
                   HJ_VIRK_DATO_ÅMD + 1;                                        
             END;                                   */                          
          IF (U3S.UNNTAK_VENTETID = 'S') THEN                                   
             B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND) = 'J';                     
          ELSE                                                                  
             B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND) = ' ';                     
       END; /* VIRKDATO ETTER 2003 */                                           
                                                                                
       B02.UFØRPENS.YNGSTE_BARN_FÅR(SØKER_IND) = U3S.YNGSTE_BARN_FÅR;           
                                                          /*EØS*/               
  /*LAGT INN   11.97 JD :*/                                                     
        IF B02.VIRK_DATO_ÅMD(SØKER_IND) > 19981200 &                            
           ALDER_VIRK < 1800  THEN      /* KONS RF */                           
                 DO;                                                            
   L263:                                                                        
              /* ---------------------------------------------------- */        
              /* NEDRE ALDERSGRENSE FOR UFØRPENS ER 18 ÅR             */        
              /* ---------------------------------------------------- */        
                    FEIL_VED_LABEL = '263';                                     
                    FEIL_MELD_NR   =  444;                                      
                    GO TO RETUR;                                                
                 END;                                                           
       IF STATUS_TYPE_SØKER = 'I' ! STATUS_TYPE_SØKER = 'K' THEN                
                /* SØKER HAR UFØREHISTORIKK SOM ALLTID ÅMD OVERFØRES */         
                                                                                
     DO;                                                                        
                                                                                
 /*YS---------------------------------------------------------------*/          
 /*YS  OPPHØRSDATO OG KODE SETTES I UFØRHIST-SEGMENTET              */          
 /*YS  DETTE ER BARE AKTUELT FOR TIDLIGER ENGANGSUTLØSNING . TRUDE  */          
 /*YS---------------------------------------------------------------*/          
                                                                                
                                                                                
          DO I = 1 TO HBOUND(B02.UFØRHIST,2);                                   
             IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I)         > 0 &                 
                B01.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,I)  = 0 THEN             
                DO;                                                             
                                                                                
                   IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) =                       
                       HJ_UFT_ÅMD                       THEN                    
                         DO;                                                    
        L264:                                                                   
                             FEIL_VED_LABEL = '264';                            
                             FEIL_MELD_NR   =  1609;                            
                             GO TO RETUR;                                       
                         END;                                                   
                                                                                
                   ELSE                                                         
                   DO;                                                          
    /*OPPHØRSMND BLE 0. RETTET 200401 HL */                                     
                      B02.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,I)                 
                      = OPPH_ÅR*10000 + OPPH_MN*100 + OPPH_DAG;                 
                      B02.UFØRHIST.OPPHØRSKODE(SØKER_IND,I)    =  'J';          
                      I                =   7 ;  /*0697 HL*/                     
                   END;                                                         
                END;                                                            
          END;                                                                  
                                                                                
 /*YS---------------------------------------------------------------*/          
 /*YS  OPPHØRSDATO OG KODE SETTES I YRKEHIST-SEGMENTET              */          
 /*YS  DETTE ER BARE AKTUELT FOR TIDLIGER ENGANGSUTLØSNING . TRUDE  */          
 /*YS---------------------------------------------------------------*/          
                                                                                
                                                                                
        DO I = LBOUND(B02.YRKEHIST,2) TO HBOUND(B02.YRKEHIST,2);                
                                                                                
             IF B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I)         > 0 &                
                B01.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,I)  = 0 THEN               
                DO;                                                             
                   B02.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,I)                      
                      = HJ_UFT_ÅMD;                                             
                   B02.YRKEHIST.OPPH_KODE(SØKER_IND,I)    =  'J';               
                   I = HBOUND(B01.YRKEHIST,2);                                  
                                                                                
                END;                                                            
          END;                                                                  
                                                                                
          B02.FØRSTE_GANG_REG    (SØKER_IND) = 'N';                             
     END;                                                                       
       ELSE                                                                     
       IF B02.STATUS_KODE_HIST(SØKER_IND)  = 'X'   THEN /*0296 HL*/             
          B02.FØRSTE_GANG_REG    (SØKER_IND) = 'N';                             
       ELSE                                                                     
          B02.FØRSTE_GANG_REG    (SØKER_IND) = 'J';                             
                                                                                
       B02.STATUS_KODE_HIST (SØKER_IND) = ' ';                                  
                                                                                
     DCL TEST_Å   PIC '99';                                                     
     DCL TEST_M   PIC '99';                                                     
     DCL TEST_16_66 PIC '99';                                                   
                                                                                
  IF HJ_VIRK_DATO_ÅMD > 19910000 THEN                                           
    DO;                                                                         
     B02.TT_16_66(SØKER_IND) = (HJ_UFT_Å -(FNR13_Å + 16)) * 12                  
                                + HJ_UFT_M - FNR13_M;                           
    END;                                                                        
  ELSE                                      /* TRUDE 0695*/                     
     DO;                                                                        
       B02.TT_FØR_1967  (SØKER_IND) = U3SP.TT_F67;                              
       B02.TT_ETTER_1966(SØKER_IND) = U3SP.TT_E66_Å * 12 +                      
                                      U3SP.TT_E66_M;                            
     END;                                                                       
                                                                                
     IF B02.TT_16_66(SØKER_IND) > 480     THEN                                  
        B02.TT_16_66(SØKER_IND) = 480;      /*HL 080694*/                       
                                                                                
                                                                                
              /* ---------------------------------------------------- */        
              /* NEDRE ALDERSGRENSE FOR UFØRPENS ER 18 ÅR             */        
              /* ---------------------------------------------------- */        
                                                                                
  /*    IF           (U3S.UFT_ÅMD) > 19971200 &                                 
           ALDER_UF < 1800                THEN                                  
                 DO;                                                            
   L268:                                                                        
                    FEIL_VED_LABEL = '268';                                     
                    FEIL_MELD_NR   =  444;                                      
                    GO TO RETUR;                                                
                 END;                                                           
        /* TIL HIT JD 11.97  */                                                 
 /*BLANKES FOR SIKKERHETS SKYLD :      */                                       
                                                                                
 /* ***************************************************************** */        
 /* SPESIELLE OPPLYSNINGER                                            */        
 /* ***************************************************************** */        
  %SKIP;                                                                        
       IF U3S.NORSK_BOSATT = 'N'  THEN                                          
         DO;                                                                    
            B02.TT_FØR_1967    (SØKER_IND)     = 0;                             
            B02.TT_ETTER_1966  (SØKER_IND)     = 0;                             
            B02.TT_16_66       (SØKER_IND)     = 0;                             
            B02.TT_FRAMT       (SØKER_IND)     = 0;                             
            IF U3SP.TT_FRA1937_ÅR    > 0       !                                
               U3SP.TT_FRA1937_MND   > 0              THEN                      
               B02.TT_16_66(SØKER_IND) = U3SP.TT_FRA1937_ÅR * 12 +              
                                    U3SP.TT_FRA1937_MND;                        
            ELSE                                                                
               DO;                                                              
                  B02.TT_FØR_1967  (SØKER_IND) = U3SP.TT_F67;                   
                  B02.TT_ETTER_1966(SØKER_IND) = U3SP.TT_E66_Å * 12 +           
                                                 U3SP.TT_E66_M;                 
                  B02.TT_FØR_1967  (EKTEF_IND) = U3SP.TT_F67_EK;                
                  IF U3SP.TT_E66_Å_EK > 0               THEN                    
                B02.TT_ETTER_1966(EKTEF_IND) = U3SP.TT_E66_Å_EK * 12 +          
                                               U3SP.TT_E66_M_EK;                
               END;                                                             
                                                                                
           IF U3SP.TT_KONVENSJON_ÅR > 0            THEN                         
              B02.TT_16_66(SØKER_IND) = U3SP.TT_KONVENSJON_ÅR * 12;             
                                                                                
           IF B02.TT_16_66(SØKER_IND) > 480     THEN                            
              B02.TT_16_66(SØKER_IND) = 480;                                    
                                                                                
           /*STM ANG STI_ÅMD FLYTTET HIT.TRUDE 020595*/                         
          IF U3SP.STI_ÅMD_3B > 0         THEN                                   
             B02.UFØRPENS.STI_ÅMD(SØKER_IND) =      (U3SP.STI_ÅMD_3B);          
                                                                                
          /*-----------------------------------------------------*/             
          /*FRAVIK FLYKTN GAV REDUSERT ANT_BUP_ÅR. TRUDE 091092--*/             
          /*-----------------------------------------------------*/             
          /*-----------------------------------------------------*/             
          /*ALL FREMTIDIG TRYGDETID BLE BEREGNET ETTER NYE REGLER*/             
          /*TRUDE 051094 ----------------------------------------*/             
          IF (U3SP.TT_KONVENSJON_ÅR = 0) THEN                                   
             DO; /* REGN FRAMTIDIG TRYGDETID */                                 
          IF U3SP.FRAVIK_FLYKT       = 'J'     !                                
           ( B02.TT_16_66(SØKER_IND) =  0  &         /* TRUDE 051094*/          
             B02.UFØRPENS.STI_ÅMD(SØKER_IND) = 0 ) THEN /*TRUDE 020595*/        
             IF B02.PENSJONSRETT_FØR_91(SØKER_IND) = 'J'     THEN               
                B02.STATUS.TT_FRAMT(SØKER_IND) =                                
                   (ALDER_67.ÅR * 12 + ALDER_67.MND)                            
                    - (HJ_Å * 12 + HJ_M);                                       
             ELSE                                                               
                B02.STATUS.TT_FRAMT(SØKER_IND) =                                
                            (ALDER_67.ÅR * 12) - (HJ_Å * 12 + HJ_M);            
          ELSE                                                                  
             B02.STATUS.TT_FRAMT(SØKER_IND) = F_BEREGN_TT_FRAMT_UTLAND          
                    ((B02.FNR(SØKER_IND)),(HJ_ÅMD_FIX),SØKER_IND);              
             END;/* REGN FRAMTIDIG TRYGDETID */                                 
                                                                                
          B02.SPESOPPL.STATSBORGER(SØKER_IND)   = U3SP.STATSBORGER;             
          B02.SPESOPPL.BOSATT(SØKER_IND)        = U3SP.BOSATT;                  
       B02.SPESOPPL.PENSJONSTRYGDET(SØKER_IND) = U3SP.PENSJONSTRYGDET;          
          B02.SPESOPPL.MINST_20ÅR_BOTID(SØKER_IND) = U3SP.MINST_20_ÅR;          
          B02.SPESOPPL.FRAVIK_BOSATT_KONVENSJON(SØKER_IND) =                    
                                                     U3SP.KONVENSJON;           
          B02.SPESOPPL.FRAVIK_FLYKTN(SØKER_IND) = U3SP.FRAVIK_FLYKT;            
                                                                                
          IF U3SP.OVERKOMP_UTL = 'J'      THEN                                  
             B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = 'J';                       
          ELSE                                                                  
             B02.SPESOPPL.OVERKOMP_UTL(SØKER_IND)  = 'N';                       
          B02.SPESOPPL.IKKE_GP      (SØKER_IND) = U3SP.IKKE_GP;                 
          B02.SPESOPPL.KONVENSJON(SØKER_IND) =  U3SP.BEREGNING_KONV;            
                                                                                
   /*NY U3-BLANKETT 9803 HL :                                                   
                                                                                
          IF U3SP.FRAVIK_8_1_3B = 'J'   !                                       
             U3SP.FRAVIK_8_1_3C = 'J'           THEN    */                      
          IF U3SP.UNNTAK_12_2   = 'J'         THEN                              
 /*          B02.SPESOPPL.FRAVIK_8_1_3(SØKER_IND)  =  'J'; */                   
             B02.SPESOPPL.UNNTAK_12_2 (SØKER_IND)  =  'J';                      
   /* NY U3             */                                                      
          B02.SPESOPPL.FRAVIK_8_1(SØKER_IND) = U3SP.FRAVIK_8_1;                 
          IF U3SP.TT_PÅ     = 'J'    !                                          
             U3SP.TT_LIK_PÅ = 'J'    THEN                                       
             DO;                                                                
                B02.SPESOPPL.TT_PÅ     (SØKER_IND) = 'J';                       
  /*            B02.TT_FØR_1967        (SØKER_IND) =  0 ;                       
                B02.TT_ETTER_1966      (SØKER_IND) =  0 ;                       
                B02.TT_FRAMT           (SØKER_IND) =  0 ;                       
                B02.TT_67_TIL_70       (SØKER_IND) =  0 ;                       
                B02.TT_16_66           (SØKER_IND) =  0 ;   */                  
             END;                                                               
          B02.SPESOPPL.TT_FRAMTIDIG (SØKER_IND) = U3SP.TT_FRAMTIDIG;            
          B02.SPESOPPL.TT_FAKTISK   (SØKER_IND) = U3SP.TT_FAKTISK;              
  /*      B02.SPESOPPL.FRAVIK_5_1(SØKER_IND) = U3SP.FRAVIK_5_1; */              
          B02.SPESOPPL.UNG_UFØR  (SØKER_IND) = U3SP.UNG_UFØR;                   
                                                                                
 /* TILLEGG 0196 HL : */                                                        
                                                                                
          B02.TT_NORDISK_FAKT_MND (SØKER_IND) =                                 
 ((U3EØS.TT_FAKTISK_NORDISK_ÅR * 12) + U3EØS.TT_FAKTISK_NORDISK_MND);           
          B02.PÅ_NORDISK_FAKT (SØKER_IND) = U3EØS.PÅ_FAKTISK_NORDISK;           
                                                                                
          IF ( B02.TT_NORDISK_FAKT_MND(SØKER_IND) +                             
               B02.PÅ_NORDISK_FAKT(SØKER_IND) > 0 ) THEN                        
             B02.NORDISK_KONVENSJON(SØKER_IND) = 'J';                           
          /* TILLEGG 181000 MARTIN (DENNE VAR GLEMT ) */                        
          B02.SPESOPPL.FRAVIK_19_3(SØKER_IND) = U3SP.FRAVIK_19_3;               
  /*EØS : */                                                                    
          B02.KONVENSJON_LAND(SØKER_IND) = U3SP.KONVENSJON_LAND;                
          B02.FRAVIK_BOSATT_EØS(SØKER_IND) = U3SP.FRAVIK_BOSATT_EØS;            
          B02.TP_NORDISK       (SØKER_IND) = U3SP.TP_NORDISK;                   
          B02.TP_NORDISK_LAND  (SØKER_IND) = U3SP.TP_NORDISK_LAND;              
          B02.TT_KONVENSJON_ÅR  (SØKER_IND) = U3SP.TT_KONVENSJON_ÅR;            
  /*EØSINFO : */                                                                
   /* DISSE FELTA ER FJERNA FRA BLANKETTEN - APRIL 2004 MH                      
   /*     B02.GP_ART13_VIRKDATO_ÅMD(SØKER_IND)                                  
             = U3SP.GP_VIRK_NORDISK_ÅMD                                         
                                                                                
           B02.TP_ART15_VIRKDATO_ÅMD(SØKER_IND)                                 
             = U3SP.TP_VIRK_NORDISK_ÅMD  */                                     
                                                                                
          IF (B02.PENSJONSTYPE2(SØKER_IND) = 'A') THEN   /* KONS RF */          
             DO;                                                                
                B02.BEREGN_FOLKETRYGD(SØKER_IND) = 'J';                         
                B02.EØS_8_4_3A(SØKER_IND)        = U3S.VILKÅR_8_4_3A;           
             END;                                                               
          ELSE                                                                  
             DO;                                                                
          B02.BEREGN_FOLKETRYGD(SØKER_IND) =                                    
                                 U3EØS.BEREGN_FOLKETRYGD;                       
          B02.EØS_8_4_3A     (SØKER_IND) = U3EØS.EØS_8_4_3A;                    
             END;                                                               
          B02.TT_PRO_RATA_MND(SØKER_IND) = U3EØS.TT_PRORATA_EØS_MND             
                 + (U3EØS.TT_PRORATA_EØS_ÅR * 12);                              
          B02.TT_TEORETISK_EØS_MND(SØKER_IND) =                                 
                    U3EØS.TT_TEORETISK_EØS_MND                                  
                 + (U3EØS.TT_TEORETISK_EØS_ÅR * 12);                            
          B02.PENSJON_EØS (SØKER_IND)  = U3EØS.PENSJON_EØS;                     
                                                                                
          IF (B02.TT_PRO_RATA_MND(SØKER_IND) +                                  
              B02.TT_TEORETISK_EØS_MND(SØKER_IND) > 0 ) THEN                    
             B02.PRO_RATA_BEREGNING(SØKER_IND) = 'J' ;                          
                                                                                
          /* -------------------------------------------------------- */        
          /* 3.16 POENGÅR I EØSOMRÅDET                                */        
          /* -------------------------------------------------------- */        
          DO I = LBOUND(B02.INNTEKTSÅR_EØS,2) TO                                
                 HBOUND(B02.INNTEKTSÅR_EØS,2);                                  
             B02.INNTEKTSÅR_EØS(SØKER_IND,I) = '0'B;                            
          END;                                                                  
          DO I = 1 TO HBOUND(U3EØS.TAB_EØS);                                    
             IF (U3EØS.EØS_ÅR(I)>0) THEN                                        
                B02.INNTEKTSÅR_EØS(SØKER_IND,U3EØS.EØS_ÅR(I)) = '1'B;           
          END;                                                                  
                                                                                
          /* -------------------------------------------------------- */        
          /* 3.17 POENGÅR IKKE PRO RATA                               */        
          /* -------------------------------------------------------- */        
          DO I = LBOUND(B02.EØS_ÅR_IKKE_PRO_RATA,2) TO                          
                 HBOUND(B02.EØS_ÅR_IKKE_PRO_RATA,2);                            
             B02.EØS_ÅR_IKKE_PRO_RATA(SØKER_IND,I) = '0'B;                      
          END;                                                                  
          DO I = 1 TO HBOUND(U3EØS.IKKE_PRO_TAB);                               
             IF (U3EØS.EØS_ÅR_IKKE_PRO_RATA(I) > 0) THEN                        
                B02.EØS_ÅR_IKKE_PRO_RATA                                        
                   (SØKER_IND,U3EØS.EØS_ÅR_IKKE_PRO_RATA(I)) = '1'B;            
          END;                                                                  
                                                                                
    /* 9803 ******* HIT I NY U3 */                                              
       END;                                                                     
                                                                                
       ELSE                                                                     
                                                                                
          B02.STATUS.TT_FRAMT(SØKER_IND) =                                      
              (ALDER_67.ÅR * 12) - (HJ_Å * 12 + HJ_M);                          
                                                                                
       IF B02.STATUS.TT_FRAMT(SØKER_IND) < 0        THEN                        
          B02.STATUS.TT_FRAMT(SØKER_IND) = 0;                                   
                                                                                
       IF B02.STATUS.TT_FRAMT(SØKER_IND) > 480      THEN                        
          B02.STATUS.TT_FRAMT(SØKER_IND) = 480;  /*HL 0196*/                    
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /* YRKESSKADEOPPLYSNINGER.  ERIK 2.7.87                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
  %SKIP;                                                                        
                                                                                
        IF U3S.YSKADE_TILLEGG = 'J' THEN                                        
           DO;                                                                  
                                                                                
        DO I = LBOUND(B01.YRKEHIST,2) TO HBOUND(B01.YRKEHIST,2);                
                IF B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) = 0 THEN                  
                   DO;                                                          
                      IF (I > 1)  & (B01.YRKEHIST.OPPH_DATO_ÅMD                 
                                    (SØKER_IND,(I-1)) >                         
                                             (U3S.UFT_ÅMD)) THEN                
                         DO;                                                    
                                                                                
         /*  ********************************************* */                   
         /*  Y-UFØRETIDSPUNKT LIGGER FØR OPPHØRSTI_ÅMDDSPUNKT */                
         /*  ********************************************* */                   
    /*OPPHØRSMND BLE 0. RETTET 200401 HL */                                     
                              B02.YRKEHIST.OPPH_DATO_ÅMD(                       
                              SØKER_IND,(I - 1 )) =                             
                           OPPH_ÅR*10000 + OPPH_MN*100 + OPPH_DAG;              
                          END;                                                  
  /* FJERNET 030496 HL :*/                                                      
                                                                                
  /* **********                                                                 
        L264:                                                                   
                             FEIL_VED_LABEL = '264';                            
                             FEIL_MELD_NR   =  1719;                            
                             GO TO RETUR;                                       
                         END;                                                   
      ********************************************** */                         
                      ELSE                                                      
                       DO;                                                      
                          YRK_IND = I;                                          
                          W_VILKÅR_1_2_2A =                                     
                                          U3Y.VILKÅR_1_2_2A;                    
                          W_VILKÅR_1_2_2B =                                     
                                          U3Y.VILKÅR_1_2_2B;                    
                          B02.VILKÅR_1_2_2(SØKER_IND,YRK_IND) =                 
                                                  VILKÅR_DEF;                   
                                    /*    W_VILKÅR_1_2_2AB  */                  
                                                                                
  /* ******************************************************* */                 
  /* HUSK:                                                   */                 
  /* TESTE PÅ OM B02.VILKÅR_1_2_2 = '  '. HVIS JA, SÅ VANLIG */                 
  /* ALDERSKONV.  HVIS NEI, SÅ SPESIELL ALDERSKONV.BEHANDLING*/                 
  /* ERIK .                                                  */                 
  /* ******************************************************* */                 
                                                                                
                          B02.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) =                  
                                                    (U3S.UFT_ÅMD);              
                          B02.YST_ÅMD(SØKER_IND,YRK_IND) =                      
                                                    (U3Y.YST_ÅMD);              
                                                                                
                          B02.YRKEPENS.YSYKDOM(SØKER_IND) =                     
                                          U3Y.YSYKDOM;                          
                          DIV_PARAM_OMR.YSYKDOM  =                              
                                          U3Y.YSYKDOM;                          
                                                                                
                          B02.YRKEPENS.YUG(SØKER_IND) = U3Y.YUG;                
                          B02.YRKEHIST.YUG(SØKER_IND,YRK_IND) =                 
                                          U3Y.YUG;                              
                          B02.KAP_11_7_UTLØST(SØKER_IND,YRK_IND) =              
                                          U3Y.KAP_11_7_UTLØST;                  
                          B02.YRKE11(SØKER_IND,YRK_IND) = U3Y.YRKE11;           
                          B02.YRKEHIST.AÅI(SØKER_IND,YRK_IND)                   
                                                    = U3Y.AÅI;                  
                       END;                                                     
                     I = HBOUND(B01.YRKEHIST,2);                                
                                                                                
                                                                                
                  END;                                                          
              ELSE                                                              
                                                                                
                      IF I > HBOUND(B01.YRKEHIST,2) THEN                        
                                                                                
                       DO;                                                      
                                                                                
 /* ***************************************************************** */        
 /* FEIL, ALLE YRKEPERIODENE ER UTFYLT, IKKE PLASS TIL EN TIL         */        
 /* ***************************************************************** */        
                                                                                
         L267:                                                                  
                          FEIL_VED_LABEL = '267';                               
                          FEIL_MELD_NR   = 1810;                                
                          GO TO RETUR;                                          
                       END;                                                     
                  END;                                                          
            END;                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* PENSJONSGIVENDE INNTEKT                                           */        
 /* HER ÅMD VI TESTE PÅ EN PI-KODE FOR Å SE OM VI HAR FÅTT RAPPORTERT */        
 /* INNTEKT = 0                                                       */        
 /* ***************************************************************** */        
                                                                                
  IF (ÅR_FØR_UFØRHET  > 1966 )  &                                               
     (U3S.PI > 0             )          THEN                                    
     DO;                                                                        
        IF B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = ' ' !                        
           B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F' THEN                     
           DO;                                                                  
              B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'F';                      
              B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) = U3S.PI; /*JD 0405*/            
           END;                                                                 
        ELSE /*KODE M = OMSORG + FORELØPIG INNT */                              
        IF B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'M'   THEN                   
           DO;                                                                  
              B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'M';                      
              B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) = U3S.PI; /*JD 0405*/            
           END;                                                                 
        ELSE                                                                    
        IF (B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'J'  !                      
            B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'K'  !                      
            B01.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'L'  )  &                   
             B01.PI(SØKER_IND,ÅR_FØR_UFØRHET) = 0       THEN                    
           DO;                                                                  
              B02.PI_KODE(SØKER_IND,ÅR_FØR_UFØRHET) = 'M';                      
              B02.PI(SØKER_IND,ÅR_FØR_UFØRHET) = U3S.PI; /*JD 0405*/            
           END;                                                                 
     END;                                                                       
 /* ***************************************************************** */        
 /* UFØREHISTORIKK                                                    */        
 /* ***************************************************************** */        
                                                                                
    DO I = 1 TO HBOUND(B02.UFØRHIST,2);                                         
       IF (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = (U3S.UFT_ÅMD))                   
          THEN                                                                  
 /* ***************************************************************** */        
 /* D.V.S VI HAR EN PERIODE FRA FØR MED SAMME UFTIDSPUNKT             */        
 /* ***************************************************************** */        
                                                                                
         DO;                                                                    
            DIV_PARAM_OMR.REGN_1291 = ' ';    /*HL*/                            
                                                                                
            UF_IND = I;                                                         
            B02.UFØRHIST.UFG(SØKER_IND,I) = U3S.UFG;                            
                                                                                
            IF U3S.VIRK_DATO_ÅMD > 20040000          THEN                       
               /* REMEDY 962 NYTT IF STMT *//*FJERNET 200510 HL*/               
          /*   IF (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = 0) THEN */               
                  B02.UFØRHIST.VIRK_UFØRHIST_ÅMD(SØKER_IND,I)                   
                                          = U3S.VIRK_DATO_ÅMD;                  
 /* JFA */  B02.UFØRHIST.YNGSTE_BARN_FÅR_HIST(SØKER_IND,I) =                    
 /* 22.5.02 */                               U3S.YNGSTE_BARN_FÅR;               
 /*HL : UFKRIT BLE ALLTID SATT > 0 FOR YRKESSKADDE - RETTET 2.4.91*/            
                                                                                
            IF U3S.VILKÅR_8_4_3A = 'J' THEN                                     
               IF U3S.YSKADE_TILLEGG = 'J' THEN                                 
                  IF U3Y.KAP_11_7_UTLØST = 'J'    THEN                          
                     B02.UFKRITERIER(SØKER_IND,I) = 5;                          
                  ELSE                                                          
                     B02.UFKRITERIER(SØKER_IND,I) = 4;                          
               ELSE                                                             
                  B02.UFKRITERIER(SØKER_IND,I) = 2;                             
            ELSE                                                                
               B02.UFKRITERIER(SØKER_IND,I) = 0;                                
            IF B01.BUP_GAR_KODE(SØKER_IND,I) = 'A' THEN                         
               DO;                                                              
                  IF HJ_VIRK_DATO_ÅMD >= TJUEÅRSDATO_ÅMD THEN                   
                     B02.BUP_GAR_KODE(SØKER_IND,I) = 'B';                       
               END;                                                             
            B02.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,I) = 0;                      
            B02.UFØRHIST.OPPHØRSKODE   (SØKER_IND,I) = ' ';                     
                                                                                
            IF U3S.VIRK_DATO_ÅMD > 20040000          THEN                       
               /* REMEDY 962 NYTT IF STMT */                                    
               IF (B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = 0) THEN                  
                  B02.VIRK_UFØRHIST_ÅMD(SØKER_IND,I) =                          
                                            U3S.VIRK_DATO_ÅMD;                  
            B02.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I) =                          
                                U3S.FRIINNTEKT_DATO_ÅMD;                        
            I = 7;                    /*0697 HL*/                               
         END;                                                                   
                                                                                
       ELSE                                                                     
       IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = 0 THEN                            
          DO;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* D.V.S. FINNER FØRSTE LEDIGE PLASS.                                */        
 /* ***************************************************************** */        
                                                                                
              UF_IND = I;                                                       
                                                                                
              B02.UFØRHIST.UFT_ÅMD(SØKER_IND,I) =  (U3S.UFT_ÅMD);               
              B02.UFØRHIST.UFG(SØKER_IND,I) = U3S.UFG;                          
                                                                                
            IF (U3S.VIRK_DATO_ÅMD > 20040000) THEN                              
               B02.UFØRHIST.VIRK_UFØRHIST_ÅMD(SØKER_IND,I)                      
                                          = U3S.VIRK_DATO_ÅMD;                  
                                                                                
 /* JFA */    B02.UFØRHIST.YNGSTE_BARN_FÅR_HIST(SØKER_IND,I) =                  
 /* 22.5.04 */                               U3S.YNGSTE_BARN_FÅR;               
            B02.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I) =                          
                                U3S.FRIINNTEKT_DATO_ÅMD;                        
                                                                                
              IF U3S.VILKÅR_8_4_3A = 'J' THEN                                   
                 IF U3S.YSKADE_TILLEGG = 'J' THEN                               
                    IF U3Y.KAP_11_7_UTLØST = 'J'    THEN                        
                         B02.UFKRITERIER(SØKER_IND,I) = 5;                      
                    ELSE                                                        
                         B02.UFKRITERIER(SØKER_IND,I) = 4;                      
                 ELSE                                                           
                    B02.UFKRITERIER(SØKER_IND,I) = 2;                           
              ELSE;                                                             
                                                                                
 /* ***************************************************************** */        
 /* DETTE ER FØRSTE PERIODE                                           */        
 /* ***************************************************************** */        
                                                                                
            IF (UF_IND = 1                                    !                 
                B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) ^= ' ' ) THEN            
               /* --------------------------------------------------- */        
               /* ENDRET 040100: UNGE UFØRE SOM LÅ PÅ "VENT" NÅR DEI  */        
               /*                OPPHØRTE FIKK ALDRI BUP_GARANTI      */        
               /* --------------------------------------------------- */        
                 CALL UNGE_UFØRE;                                               
                                                                                
 /* ***************************************************************** */        
 /* DET FINNES EN FORRIGE PERIODE                                     */        
 /* ***************************************************************** */        
                                                                                
            IF (UF_IND > 1) THEN                                                
                 DO;                                                            
                    IF B02.UFØRHIST.OPPHØRSDATO_ÅMD(                            
                           SØKER_IND,UF_IND - 1 ) >                             
                                              (U3S.UFT_ÅMD) THEN                
                       DO;                                                      
    /*OPPHØRSMND BLE 0. RETTET 200401 HL */                                     
                           B02.UFØRHIST.OPPHØRSDATO_ÅMD(                        
                            SØKER_IND,UF_IND - 1 ) =                            
                           OPPH_ÅR*10000 + OPPH_MN*100 + OPPH_DAG;              
                       END;                                                     
                    ELSE                                                        
                    IF B02.UFØRHIST.OPPHØRSDATO_ÅMD(                            
                           SØKER_IND,UF_IND - 1 ) = 0  THEN                     
                       DO;                                                      
    /*OPPHØRSMND BLE 0. RETTET 200704 HL */                                     
                           B02.UFØRHIST.OPPHØRSDATO_ÅMD(                        
                            SØKER_IND,UF_IND - 1 ) =                            
                           OPPH_ÅR*10000 + OPPH_MN*100 + OPPH_DAG;              
                       END;                                                     
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* FEIL, UFØRETIDSPUNKTET LIGGER FØR OPPHØRSTI_ÅMDDSPUNKTET.         */        
 /* ***************************************************************** */        
      /* FJERNET 25.11.94 HL :                                                  
  L265:                                                                         
                           DO;                                                  
                              FEIL_VED_LABEL = '265';                           
                              FEIL_MELD_NR   = 1719;                            
                              GO TO RETUR;                                      
                           END;                                                 
             HIT */                                                             
                                                                                
 /* ***************************************************************** */        
 /* HER OVERFØRES BUP-GARANTI OG KODE FRA FORRIGE PERIODE             */        
 /* ***************************************************************** */        
                                                                                
                    B02.BUP_GARANTI(SØKER_IND,I) =                              
                                    B02.BUP_GARANTI(SØKER_IND,(I-1));           
                    B02.BUP_GAR_KODE(SØKER_IND,I) =                             
                                   B02.BUP_GAR_KODE(SØKER_IND,(I-1));           
                  IF B02.BUP_GAR_KODE(SØKER_IND,I) = 'A'                        
                                                                    THEN        
                     DO;                                                        
                        IF HJ_VIRK_DATO_ÅMD >= TJUEÅRSDATO_ÅMD THEN             
                           DO;         /*9811*/                                 
                              B02.BUP_GAR_KODE(SØKER_IND,I) = 'B';              
                              IF HJ_VIRK_DATO_ÅMD > 19880400  THEN              
                                 IF HJ_VIRK_DATO_ÅMD < 19910500  THEN           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.00;        
                                 ELSE                                           
                                 IF HJ_VIRK_DATO_ÅMD < 20080500  THEN           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.30;        
                                 ELSE                                           
                                 IF FNR13_Å > 1940               THEN           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.50;        
                                 ELSE                                           
                                    B02.BUP_GARANTI(SØKER_IND,I) = 3.30;        
                              ELSE                                              
                              IF HJ_VIRK_DATO_ÅMD > 19870400  THEN              
                                 B02.BUP_GARANTI(SØKER_IND,I) = 2.50;           
                              ELSE                                              
                                 B02.BUP_GARANTI(SØKER_IND,I) = 2.00;           
                                                                                
                           END;                                                 
                     END;                                                       
                                                                                
                                                                                
                                                                                
                 END; /*END UF_IND ^= 1*/                                       
                 I = 7;           /*0697 HL*/                                   
              END; /*END UFT = 0 */                                             
           ELSE                                                                 
              DO;                                                               
                                                                                
 /* ***************************************************************** */        
 /* ALLE UFØREPERIODENE ER UTFYLT                                     */        
 /* ***************************************************************** */        
                                                                                
                  IF I = 7 THEN       /*0697 HL*/                               
                     DO;                                                        
                                                                                
 /* ***************************************************************** */        
 /* FEIL, ALLE UFØREPERIODENE ER UTFYLT, IKKE PLASS TIL EN TIL        */        
 /* ***************************************************************** */        
                                                                                
  L270:                                                                         
                          FEIL_VED_LABEL = '270';                               
                          FEIL_MELD_NR   = 1715;                                
                          GO TO RETUR;                                          
                      END;                                                      
              END;                                                              
         END; /*I = 1 TO 7*/                                                    
                                                                                
              /* NY 93 */                                                       
    IF B02.BOSATT(SØKER_IND)         > 0 &                                      
       B02.VIRK_DATO_ÅMD(SØKER_IND)  > 19921200 &                               
       B02.PENSJONSTRYGDET(SØKER_IND) ^= 'J' &                                  
 /*   (B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) = 'B'   !                         
       B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) = 'E')  THEN     */               
       B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) ^= ' '   &                        
       B02.SPESOPPL.UNG_UFØR    (SØKER_IND  ) ^= 'J'   THEN                     
         DO;                                                                    
            DO M = 1 TO HBOUND(B02.UFØRHIST,2);                                 
               B02.BUP_GAR_KODE(SØKER_IND,M) = ' ';                             
               B02.BUP_GARANTI(SØKER_IND,M) = 0;                                
            END;                                                                
          IF B02.UFØRPENS.STI_ÅMD(SØKER_IND) > 0 THEN                           
     L271:                                                                      
              DO;                                                               
                  FEIL_VED_LABEL = '271';                                       
                  FEIL_MELD_NR   =  386;                                        
                  GO TO RETUR;                                                  
              END;                                                              
         END;                                                                   
 /* ***************************************************************** */        
 /* EKTEFELLES STATUS                                                 */        
 /* ***************************************************************** */        
                                                                                
    IF B02.FNR(EKTEF_IND) > 0 THEN                                              
       DO;                                                                      
          B02.SIVILSTAND(EKTEF_IND)   = B02.SIVILSTAND(SØKER_IND);              
          B02.NAVN      (EKTEF_IND)   = B02.NAVN(EKTEF_IND);                    
          B02.SPRÅK     (EKTEF_IND)   = B02.SPRÅK(SØKER_IND);                   
          B02.VIRK_DATO_ÅMD(EKTEF_IND) = (U3S.VIRK_DATO_ÅMD);                   
          /* KS 5/6-84 */                                                       
          B02.PENSJONSTYPE3  (EKTEF_IND) = ' ';                                 
          B02.SUM_YTELSE     (EKTEF_IND) = 0;                                   
          /* ENDRET 22/10-84 AV KARIN */                                        
          B02.FØRSTE_GANG_REG(EKTEF_IND) =                                      
          B02.FØRSTE_GANG_REG(SØKER_IND);                                       
  /*0296 HL : */                                                                
          IF B01.STATUS_KODE_HIST(EKTEF_IND) = 'X'  THEN                        
             B02.FØRSTE_GANG_REG(EKTEF_IND) = 'N';                              
          IF U3S.TILL_EK = 'J' THEN                                             
             DO;                                                                
                B02.STATUS.PENSJONSTYPE1(EKTEF_IND) = 'F';                      
                B02.STATUS.PENSJONSTYPE2(EKTEF_IND) = ' ';                      
              END;                                                              
          ELSE                                                                  
            DO;                                                                 
               B02.STATUS.PENSJONSTYPE1(EKTEF_IND) = 'G';                       
               B02.STATUS.PENSJONSTYPE2(EKTEF_IND) = ' '; /*TRUDE 0594*/        
            END;                                                                
        END;                                                                    
                                                                                
    IF U3S.ATT_UF = 'A' THEN                                                    
       IF (B01.PENSJONSTYPE1(SØKER_IND)    = 'U' !                              
           B01.PENSJONSTYPE1(SØKER_IND)    = 'Y')  &                            
          B01.PENSJONSTYPE3(SØKER_IND)   ^= 'A'    &                            
          B01.VIRK_DATO_ÅMD(SØKER_IND)   ^=                                     
          (U3S.VIRK_DATO_ÅMD)                   &                               
          B01.STATUS_KODE_HIST(SØKER_IND) = ' ' THEN                            
          DO;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* FEIL,SØKEREN HAR UFØRPENSJON FRA FØR.                             */        
 /* ***************************************************************** */        
                                                                                
  L275:                                                                         
             FEIL_VED_LABEL = '275';                                            
             FEIL_MELD_NR   = 1717;                                             
             GO TO RETUR;                                                       
          END;                                                                  
       ELSE                                                                     
  /* DENNE TESTEN ER BEGRENSET I FORB. MED FRAPP. 274. ERIK 16.1.86 */          
          IF B01.PENSJONSTYPE3(SØKER_IND) = 'A'     &                           
             (B01.PENSJONSTYPE1(SØKER_IND)   ^= 'U' &                           
              B01.PENSJONSTYPE1(SØKER_IND)   ^= 'Y') &                          
             B01.STATUS_KODE_HIST(SØKER_IND) = ' ' THEN                         
             DO;                                                                
                                                                                
 /* ***************************************************************** */        
 /* FEIL,SØKEREN HAR ATTFØRING FRA FØR.                               */        
 /* ***************************************************************** */        
                                                                                
 L277:                                                                          
                FEIL_VED_LABEL = '277';                                         
                FEIL_MELD_NR   = 1718;                                          
                GO TO RETUR;                                                    
             END;                                                               
          ELSE                                                                  
             B02.PENSJONSTYPE3(SØKER_IND) = 'A';                                
                                                                                
  RETUR:                                                                        
    END OPPRETT_STATUS_U3_SØKER;                                                
