 /*       SIST ENDRET 23/01-98 09.56.54 AV   SPA7339                  */00000000
 F_DAGS_DATO_PLUSS_1MND:                                                00000010
   PROC RETURNS(PIC'(8)9');                                             00000020
 %SKIP(2);                             /*   */                          00000030
 /*   */                                                                00000040
 /* ***************************************************************** */00000050
 /*                                                                   */00000060
 /* HENTER INN DAGENS DATO OG RETURNERER DATAOEN TILLAGT 1 MÅNED      */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 %SKIP(2);                                                              00000100
   DCL                                                                  00000110
      DATE BUILTIN;                                                     00000120
   DCL                                                                  00000130
      DATO_ÅMD PIC '(8)9',                                              00000140
      DAGENS_DATO_ÅM DEF DATO_ÅMD POS(1) PIC '999999';                  00000150
   DCL                                                                  00000160
      DAGENS_DATO_1MND PIC'99999999',                                   00000170
      DAGENS_DATO_Å DEF DAGENS_DATO_1MND POS(1) PIC'9999',              00000180
      DAGENS_DATO_M DEF DAGENS_DATO_1MND POS(5) PIC'99';                00000190
 %SKIP(2);                                                              00000200
      DATO_ÅMD = DIV_PARAM_OMR.DATO_2000;                               00000210
      DAGENS_DATO_1MND = DATO_ÅMD;                                      00000220
      DAGENS_DATO_M = DAGENS_DATO_M + 1;                                00000230
      IF DAGENS_DATO_M > 12 THEN                                        00000240
         DO;                                                            00000250
            DAGENS_DATO_Å = DAGENS_DATO_Å + 1;                          00000260
            DAGENS_DATO_M = DAGENS_DATO_M - 12;                         00000270
         END;                                                           00000280
      RETURN(DAGENS_DATO_1MND);                                         00000290
   END F_DAGS_DATO_PLUSS_1MND;                                          00000300
