 /*   SIST ENDRET PÅ PROD   2005.06.24 12.44.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.04.23 12.13.03 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.09.12  9.07.21 AV   JDA2970          */        
 /*       SIST ENDRET 25/06-98 13.59.31 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 10.22.43 AV   JDA7339                  */        
 /*       SIST ENDRET 17/06-98 09.46.04 AV   RFA9991                  */        
 /*       SIST ENDRET 07/01-83 09.47.48 AV   FARVIK                   */        
 /******************************************************************* */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014322 - REGN_TT_67_TIL_70_DØD PROSEDYRE I PLI.              */        
 /*    PROGRAMMERER: JAN, JUNI 1982                                   */        
 /*HENSIKT:                                                           */        
 /*    B02.STATUS.TT_67_TIL_70 BLIR OPPDATERT.                     */           
 /*    PROGRAMMET LEGGER TIL TRYGDETID FOR ÅRENE PERSONEN FYLLER 67,  */        
 /*    68 OG 69 ÅR. DETTE ER BARE AKTUELT FOR PERSONER SOM HAR INNTEKT*/        
 /*    OVER GRUNNBELØPET I DISSE ÅRENE.                               */        
 /*    FOR PERSONER FØDT FØR 1904 GJELDER IKKE DENNE REGELEN.         */        
 /*    FOR PERSONER FØDT I 1904, ER DET KUN DET 69. ÅRET SOM SKAL TAS */        
 /*    MED. (1973)                                                    */        
 /*    FOR PERSONER FØDT I 1905, ER DET BARE DET 68. OG 69. ÅRET SOM  */        
 /*    KAN MEDREGNES.                                                 */        
 /*    FOR PERSONER FØDT I 1906 OG SENERE KAN DET 67.,68., OG DET     */        
 /*    69. ÅRET MEDREGNES.                                            */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET INCLUDES I R0014301                                 */        
 /*BRUK:                                                              */        
 /*    CALL REGN_TT_67_TIL_70_DøD;                                    */        
 /* ***************************************************************** */        
 REGN_TT_67_TIL_70_DØD: PROC;                                                   
                                                                                
 DCL                                                                            
    I                                       FIXED BIN(15),                      
    W_FNR_EK                                PIC '(11)9',                        
    W_FNR_EK13                              PIC '(13)9',                        
    W_FNR_EK13_ÅR     DEF W_FNR_EK13 POS(5)   PIC '9999',                       
    W_FNR_EK_ÅRHUNDRE DEF W_FNR_EK POS(7)   PIC '9';                            
 DCL                                                                            
    DETTE_ÅRSTALL                           CHAR (4),                           
    DATETIME                                BUILTIN,                            
    DATETIME_VALUE                          CHAR(17);                           
    %INCLUDE P0019924;   /* INIT G_V TABELL */                                  
    DATETIME_VALUE = DATETIME;                                                  
    DETTE_ÅRSTALL = SUBSTR(DATETIME_VALUE,1,4);                                 
                                                                                
    B02.TT_67_TIL_70(BER_EK_IND) = 0;                                           
    W_FNR_EK                     = B02.RF0PERSN.FNR(BER_EK_IND);                
    W_FNR_EK13   = KONV_FNR11_FNR13(W_FNR_EK);                                  
    IF W_FNR_EK13_ÅR = 1904 THEN                                                
       DO;                                                                      
          IF (B02.PINNTEKT.PI(BER_EK_IND,1973) )  /*200504*/                    
                              > GV_TAB_ARRAY.G_V(1973) THEN                     
             B02.TT_67_TIL_70(BER_EK_IND) = 1;                                  
       END;                                                                     
                                                                                
    ELSE IF W_FNR_EK13_ÅR = 1905   THEN                                         
      DO;                                                                       
         IF (B02.PINNTEKT.PI(BER_EK_IND,1973) )     /*200504 */                 
                                > GV_TAB_ARRAY.G_V(1973) THEN                   
            B02.TT_67_TIL_70(BER_EK_IND) = 1;                                   
         IF (B02.PINNTEKT.PI(BER_EK_IND,1974) )     /*200504 */                 
                                 > GV_TAB_ARRAY.G_V(1974) THEN                  
            B02.TT_67_TIL_70(BER_EK_IND) =                                      
                                B02.TT_67_TIL_70(BER_EK_IND) + 1;               
      END;                                                                      
                                                                                
      ELSE IF W_FNR_EK13_ÅR > 1905  THEN                                        
         DO I = (W_FNR_EK13_ÅR + 67) TO (W_FNR_EK13_ÅR + 69)                    
            WHILE (I < DETTE_ÅRSTALL);                                          
                                        /*  WHILE ( I < 99 ); */                
            IF (B02.PINNTEKT.PI(BER_EK_IND,I) )     /*200504 */                 
                                   > GV_TAB_ARRAY.G_V(I) THEN                   
               B02.TT_67_TIL_70(BER_EK_IND) =                                   
                                      B02.TT_67_TIL_70(BER_EK_IND) + 1;         
         END;                                                                   
                                                                                
 END REGN_TT_67_TIL_70_DØD;                                                     
