 /*   SIST ENDRET PÅ PROD   2004.12.17 14.04.53 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.47.49 AV   JDA2970          */        
 /*       SIST ENDRET 04/05-98 13.14.51 AV   JDA7339                  */        
 /*       SIST ENDRET 12/03-98 10.34.51 AV   SLA9300                  */        
 /*       SIST ENDRET 04/04-97 10.39.07 AV   JDA7339                  */        
 /*********************************************************************/        
 /* IDENTIFIKASJON:                                                   */        
 /*    R0016039  - TILLEGG TIL R0016032/33 SOB9704                    */        
 /* HENSIKT:                                                          */        
 /*    EN PROSEDYRE SOM HENTER FELTER FRA BLANKETT-OMR. V/U3-TRANS.   */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*    LOKAL PROSEDYRE I R0016001                                     */        
 /*********************************************************************/        
                                                                                
    /*----------------------------------------------------------------*/        
    /* YRKE, PRIMÆR- OG SEKUNDÆR-DIAGNOSE LEGGES IKKE UT I B01/B02.   */        
    /* DISSE OPPLYSNINGENE MÅ HENTES DIREKTE PÅ TRANSAKSJONEN.        */        
    /* 3 TYPER UP-BL. FRA 1994 MEDFØRER 3 PROC'ER: UP_OPPDAT/U2_OPPDAT*/        
    /*                                            /U3_OPPDAT          */        
    /*----------------------------------------------------------------*/        
                                                                                
 U3_OPPDAT: PROC;                                                               
                                                                                
 %INCLUDE P001U601;     /* TRANS_OMR UP-BLANKETT U3 NY EØS-ENDRINGER */         
                                                                                
    IF VERIFY(TRANS_OMR.U3S.FNR,'0123456789') = 0 THEN                          
      IF TRANS_OMR.U3S.FNR = B02.PERSON(I).RF0PERSN.FNR THEN                    
      DO;                                                                       
        IF TRANS_OMR.U3S.YRKE > 0 THEN                                          
           REGTPKT.YRKE = TRANS_OMR.U3S.YRKE;                                   
        /*  ENDRET AV SATISH PGA FELT BLIR FJERNET FRA BILDE    **              
        IF TRANS_OMR.U3S.PRIMDIAG > '      ' THEN                               
          DO;                                                                   
            IF TRANS_OMR.U3S.YSKADE_TILLEGG = 'J' THEN                          
               DIAGNOSE.PRIMDIAG_YRKE  = TRANS_OMR.U3S.PRIMDIAG;                
            ELSE                                                                
               DIAGNOSE.PRIMDIAG       = TRANS_OMR.U3S.PRIMDIAG;                
            SEGMENT_TABELL.DIAGNOSE = TRUE;                                     
          END;                                                                  
                                                                                
        IF TRANS_OMR.U3S.SEKUDIAG > '      ' THEN                               
          DO;                                                                   
            IF TRANS_OMR.U3S.YSKADE_TILLEGG = 'J' THEN                          
               DIAGNOSE.SEKUDIAG_YRKE  = TRANS_OMR.U3S.SEKUDIAG;                
            ELSE                                                                
               DIAGNOSE.SEKUDIAG       = TRANS_OMR.U3S.SEKUDIAG;                
            SEGMENT_TABELL.DIAGNOSE = TRUE;                                     
          END;                                                                  
      */                                                                        
      END;                                                                      
                                                                                
 END U3_OPPDAT;                                                                 
