 /*   SIST ENDRET PÅ PROD   2008.05.31 11.24.26 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.56.10 AV   JDA2970          */        
 /*       SIST ENDRET 02/09-98 10.18.19 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*  PROGRAM NAME   :   R001I101                                      */        
 /*  LANGUAGE       : PL/1                                            */        
 /* ***************************************************************** */        
 %SKIP;                                /*  */                                   
 /* ***************************************************************** */        
 /*  PROGRAM       MED I STYRINGEN AV MENYEN VED INNTEKTSOPPDATERING. */        
 /*                                                                   */        
 /*  PROGRAMMET LESER INN DATA FRA INNTEKTSBILDET.                    */        
 /*                                                                   */        
 /*  PROGRAMMETS TRANSKODER ER R0I1,RI1A,RI1B.                        */        
 /*                                                                   */        
 /*  PROGRAMMERER ROLF FARVIK, JUN 1983.                              */        
 /* ***************************************************************** */        
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */        
 /*ENDRET: 08.06.89 AV O.GØYTIL      , ÅR2000 - KUN KOMPILERING.      */        
 /* ******                                                            */        
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */        
 /*    OM FNR ER ENDRET (R0019906).                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
 R001I10:                                                                       
   PROC (COMMAREA_PEKER) OPTIONS(MAIN);                                         
 %PAGE;                                                                         
      %INCLUDE S001I1;     /*  INNTEKTMAPSET1    (BASED) */                     
      %INCLUDE S001IA;     /*  INNTEKTMAPSET1    (BASED) */                     
 %PAGE;                                                                         
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */                    
 %PAGE;                                                                         
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                            
 %PAGE;                                                                         
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */                       
 %PAGE;                                                                         
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */                      
 %PAGE;                                                                         
      %INCLUDE P0019924;   /*  GV_TAB          (BASED) */                       
 %PAGE;                                                                         
      %INCLUDE P0019925;   /*  G_TAB            (BASED) */                      
 %PAGE;                                                                         
 DCL 1 B01     BASED(B01_PEKER)       ,                                         
      %INCLUDE P0019921;   /*  B01              (BASED) */                      
 %PAGE;                                                                         
 DCL 1 B02     BASED(B02_PEKER)       ,                                         
      %INCLUDE P0019921;   /*  B02              (BASED) */                      
 %PAGE;                                                                         
      %INCLUDE P0014009;   /*  POTALL_OPPL              */                      
 %PAGE;                                                                         
 %SKIP(1);                                                                      
   DCL                                                                          
       MAP_MELDING              CHAR(78)      INIT((78)' '),                    
       1  FEIL_STRUC,                                                           
          2  FEIL_NR               FIXED DEC(5),                                
          2  FEIL_MELDING          CHAR     (78),                               
          2  KOM_OMR_PEKER         POINTER;                                     
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
       DCL                                                                      
         ( ADDR , NULL, CSTG , LOW , STG , SUBSTR , ONCODE)  BUILTIN;           
       DCL                                                                      
         PLITDLI ENTRY,                                                         
              BMSMAPBR  PTR;                                                    
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */        
                                                                                
       DCL                                                                      
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );           
                                                                                
       DCL                                                                      
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )               
                                                             POINTER;           
                                                                                
       DCL FATAL_FEIL            CHAR (1) INIT ('S'),                           
                                                                                
           ONKODE                PIC'9999',                                     
                                                                                
           CURSOR_POS            FIXED BIN(15) INIT(-1),                        
                                                                                
           ONK               DEF ONKODE CHAR(4);                                
                                                                                
                                                                                
       DCL INTERN_KOM_PTR        POINTER;                                       
                                                                                
       DCL 1 INTERN_KOM_OMR  BASED (INTERN_KOM_PTR),                            
             2 HOVED_KOM_PTR        POINTER,                                    
             2 FRA_FNR              PIC '(11)9',                                
             2 TIL_FNR              PIC '(11)9';                                
                                                                                
       DCL 1 FNR_REG,                                                           
             2 FNR1              FIXED DEC(11),                                 
             2 FNR2              FIXED DEC(11),                                 
             2 BRUKERID          CHAR (4)     ;                                 
                                                                                
       DCL GRUNN_OMR1            CHAR (1440);                                   
       DCL GRUNN_OMR2            CHAR (1440);                                   
       DCL GRUNN_IDENT           CHAR (8);                                      
       DCL CICSINFO              CHAR (16);                                     
                                                                                
    /* ************************************************************** */        
    /*   OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01                       UNALIGNED,                              
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B);           
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
    /*     ---------------------------------------------------        */        
    /*                                                                */        
    /*                                                                */        
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */        
    /*                                                                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
 %PAGE;                                                                         
      ON ERROR SNAP BEGIN       ;                                               
         ON ERROR SYSTEM        ;                                               
         ONKODE=ONCODE          ;                                               
         FEILKODE = ONK         ;                                               
         DSNAVN = EIBDS         ;                                               
         GO TO FEILBEH          ;                                               
      END;                                                                      
                                                                                
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                                     
                                                                                
 EXEC CICS HANDLE AID  PF1(PF2);                                                
 EXEC CICS HANDLE AID  PF2(PF2);                                                
                                                                                
  KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR);           
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR);         
  KOM_OMR.PEKER_LISTE.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR);              
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);        
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR);          
                                                                                
                                                                                
  ALLOCATE  INTERN_KOM_OMR, POTALL_OPPL;                                        
  ALLOCATE  GV_TAB_RE;                                                          
  ALLOCATE  G_TAB_RE;                                                           
  ALLOCATE  B01, B02;                                                           
  KOM_OMR.GV_PEKER                      = ADDR(GRUNN_OMR1     );                
  KOM_OMR.G_PEKER                       = ADDR(GRUNN_OMR2     );                
  HOVED_KOM_PTR                         = COMMAREA_PEKER;                       
                                                                                
  IF FEIL_MELD_NR = 0 THEN  PROGRAM_ID = 'R001IA01';                            
  DB_STATUS_KODE    = '  '                         ;                            
  POTALL_OPPL       = ''                           ;                            
  GV_TAB_RE         = ''                           ;                            
  G_TAB_RE          = ''                           ;                            
  B01               = ''                           ;                            
  B02               = ''                           ;                            
  FEIL_MELD_NR      = 0                            ;                            
  FNR_REG.BRUKERID  = DIV_PARAM_OMR.CICS_IND       ;                            
                                                                                
   /* CICSINFO  = F_CICSINFO (DIV_PARAM_OMR.CICS_IND); */                       
                                                                                
  GRUNN_IDENT                      = 'P0019924';                                
  CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                                
  GRUNN_IDENT                      = 'P0019925';                                
  CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                                
                                                                                
  /**********    H O V E D S T Y R I N G   S T A R T   *************/           
                                                                                
                                                                                
                                                                                
  IF TRANSKODE = 'R0I1' THEN                                                    
                                                                                
     /***  LESER INN DATA FRA INNTEKTSMENYBILDET.   *************/              
                                                                                
     EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')                        
                                                        SET(BMSMAPBR);          
  ELSE                                                                          
     IF TRANSKODE = 'RI1A' THEN                                                 
        DO;                                                                     
           ALLOCATE S001I01I;                                                   
           ALLOCATE S001I01O;                                                   
           EXEC CICS LOAD PROGRAM('S001I13');                                   
           S001I01I.FRAFNRI       = FRA_FNR;                                    
           S001I01I.TILFNRI       = TIL_FNR;                                    
           S001I01I.STYREKODEI    = STYREKODE;                                  
        END;                                                                    
     ELSE                                                                       
        IF TRANSKODE = 'RI1B' THEN                                              
           DO;                                                                  
              ALLOCATE S001I01I;                                                
              ALLOCATE S001I01O;                                                
              EXEC CICS LOAD PROGRAM('S001I13');                                
              S001I01O.STYREKODEO = STYREKODE;                                  
           END;                                                                 
                                                                                
                                                                                
  IF S001I01I.FUNKSJONSKODEL > 0 THEN                                           
     DO;                                                                        
        FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                                
        CALL OVER_OG_UT(FUNKSJONSKODE);                                         
     END;                                                                       
                                                                                
  IF S001I01I.STYREKODEL          >  0                           THEN           
     STYREKODE                    =  S001I01I.STYREKODEI;                       
                                                                                
                                                                                
  IF S001I01I.STYREKODEI          = 'OI' THEN                                   
     CALL OVERFØR_INNTEKTER;                                                    
  ELSE                                                                          
     IF S001I01I.STYREKODEI       = 'FI' THEN                                   
        CALL FJERN_INNTEKTER;                                                   
     ELSE                                                                       
        IF S001I01I.STYREKODEI    = 'EN' THEN                                   
           CALL ENDRE_NAVN;                                                     
        ELSE                                                                    
           IF S001I01I.STYREKODEI    = 'FS'              THEN                   
              CALL FJERN_FRA_STRYK;                                             
        ELSE                                                                    
           IF S001I01I.STYREKODEI    = 'OO'              THEN                   
              CALL OVERFØRE_OMRPOEN;                                            
           ELSE                                                                 
              DO;                                                               
                 MAP_MELDING         = 'EN AV FELTENE MÅ UTFYLLES';             
                 S001I01I.STYREKODEL = -1;     /* CURSOR POS */                 
                 S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                
                 S001I01O.MELDINGO   = MAP_MELDING;                             
                 EXEC CICS SEND        MAP    ('S001I01')                       
                                       MAPSET ('S001I13') CURSOR ERASE;         
                                                                                
                 EXEC CICS XCTL        PROGRAM  ('R001I101')                    
                                       COMMAREA (KOM_OMR);                      
              END;                                                              
                                                                                
                                                                                
                                                                                
                                                                                
 L999:                                                                          
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     DO;                                                                        
        GO TO FEILBEH;                                                          
     END;                                                                       
                                                                                
  IF FUNKSJONSKODE >  ' ' &                                                     
     FUNKSJONSKODE ^= 'I' THEN                                                  
     DO;                                                                        
        EXEC CICS XCTL PROGRAM('R0010301')                                      
                                       COMMAREA(KOM_OMR);                       
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        TRANSKODE = 'R0I1';                                                     
        EXEC CICS XCTL PROGRAM('R001I101')                                      
                                       COMMAREA(KOM_OMR);                       
     END;                                                                       
                                                                                
                                                                                
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                    
                                                                                
  /**********    H O V E D S T Y R I N G   S L U T T   *************/           
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
 OVERFØR_INNTEKTER:                                                             
  PROC;                                                                         
     FEILMELDING_SATT = '1'B;                                                   
                                                                                
     DO UNTIL (^FEILMELDING_SATT);                                              
                                                                                
        FEILMELDING_SATT = '0'B;                                                
                                                                                
        CALL SJEKK_FNR_1;                                                       
                                                                                
     END;                                                                       
                                                                                
     TRANSKODE = 'R0I2';                                                        
     EXEC CICS LINK PROGRAM('R001I201') COMMAREA(INTERN_KOM_OMR);               
                                                                                
 END OVERFØR_INNTEKTER;                                                         
                                                                                
                                                                                
 FJERN_INNTEKTER:                                                               
  PROC;                                                                         
     FEILMELDING_SATT = '1'B;                                                   
                                                                                
     DO UNTIL (^FEILMELDING_SATT);                                              
                                                                                
        FEILMELDING_SATT = '0'B;                                                
                                                                                
        CALL SJEKK_FNR_2;                                                       
                                                                                
     END;                                                                       
                                                                                
     TRANSKODE = 'R0I3';                                                        
     EXEC CICS LINK PROGRAM('R001I301') COMMAREA(INTERN_KOM_OMR);               
                                                                                
 END FJERN_INNTEKTER;                                                           
                                                                                
                                                                                
 ENDRE_NAVN:                                                                    
  PROC;                                                                         
     FEILMELDING_SATT = '1'B;                                                   
                                                                                
     DO UNTIL (^FEILMELDING_SATT);                                              
                                                                                
        FEILMELDING_SATT = '0'B;                                                
                                                                                
        CALL SJEKK_FNR_2;                                                       
                                                                                
     END;                                                                       
                                                                                
                                                                                
     EXEC CICS LINK PROGRAM('R001I701') COMMAREA(INTERN_KOM_OMR);               
                                                                                
 END ENDRE_NAVN;                                                                
                                                                                
                                                                                
 FJERN_FRA_STRYK:                                                               
  PROC;                                                                         
                                                                                
     FEILMELDING_SATT = '1'B;                                                   
                                                                                
     DO UNTIL (^FEILMELDING_SATT);                                              
                                                                                
        FEILMELDING_SATT = '0'B;                                                
        CALL SJEKK_FNR_2;                                                       
     END;                                                                       
                                                                                
     EXEC CICS LINK PROGRAM('R001I801') COMMAREA(INTERN_KOM_OMR)  ;             
                                                                                
 END FJERN_FRA_STRYK;                                                           
                                                                                
 OVERFØRE_OMRPOEN: PROC;                                                        
                                                                                
     FEILMELDING_SATT = '1'B;                                                   
     FRA_CICS         = '1'B;                                                   
     HENT_FRAM_MAP     = '0'B;                                                  
    /*                                                                          
     DO UNTIL (^FEILMELDING_SATT);                                              
                                                                                
        FEILMELDING_SATT = '0'B;                                                
        CALL SJEKK_FNR_1;                                                       
        CALL SJEKK_FNR_2;                                                       
        CALL SJEKK_ÅR   ;                                                       
     END;                                                                       
                                                                                
     EXEC CICS LINK PROGRAM('R001IA01') COMMAREA(INTERN_KOM_OMR)  ;             
     */                                                                         
                                                                                
     TRANSKODE = 'RIA0';                                                        
     ALLOCATE S001IA1O;                                                         
     S001IA1O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                             
 /*  S001IA1O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ; */                            
     EXEC CICS SEND MAP('S001IA1') MAPSET('S001IA3')                            
                                   ERASE;                                       
                                                                                
     EXEC CICS XCTL PROGRAM('R001IA01') COMMAREA(KOM_OMR)  ;                    
                                                                                
                                                                                
 END OVERFØRE_OMRPOEN;                                                          
                                                                                
                                                                                
 SJEKK_FNR_1:                                                                   
   PROC;                                                                        
   /*   ENDERING   28.06.88   SATISH                */                          
                                                                                
     IF (S001I01I.FRAFNRI = S001I01I.TILFNRI) THEN                              
        DO;                                                                     
           MAP_MELDING        = 'FRA-FNR OG TIL_FNR ER LIKE';                   
           FEILMELDING_SATT   = '1'B;                                           
           S001I01I.TILFNRL   = -1;     /* CURSOR POS       */                  
           S001I01O.TILFNRA   = 'I';                                            
           S001I01O.MELDINGO  = MAP_MELDING;                                    
           S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                       
           S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                         
           EXEC CICS SEND MAP('S001I01')                                        
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA INNTEKTSBILDET.   *************/             
                                                                                
           EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')                  
                                                        SET(BMSMAPBR);          
           IF S001I01I.FUNKSJONSKODEL > 0 THEN                                  
              DO;                                                               
                 FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                       
                                                                                
                 CALL OVER_OG_UT(FUNKSJONSKODE);                                
                                                                                
              END;                                                              
           GO TO RETUR;                                                         
        END;                                                                    
                                                                                
     ELSE                                                                       
     IF ^(S001I01I.FRAFNRL > 0) THEN                                            
        DO;                                                                     
           MAP_MELDING        = 'FRA-FNR MÅ OPPGIS';                            
           FEILMELDING_SATT   = '1'B;                                           
           S001I01I.FRAFNRL   = -1;     /* CURSOR POS       */                  
           S001I01O.FRAFNRA   = 'I';                                            
           S001I01O.MELDINGO  = MAP_MELDING;                                    
           S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                       
           S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                         
           EXEC CICS SEND MAP('S001I01')                                        
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA INNTEKTSBILDET.   *************/             
                                                                                
           EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')                  
                                                        SET(BMSMAPBR);          
           IF S001I01I.FUNKSJONSKODEL > 0 THEN                                  
              DO;                                                               
                 FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                       
                                                                                
                 CALL OVER_OG_UT(FUNKSJONSKODE);                                
                                                                                
              END;                                                              
           GO TO RETUR;                                                         
        END;                                                                    
                                                                                
     ELSE                                                                       
        IF ^F_NUMERISK(S001I01I.FRAFNRI) THEN                                   
           DO;                                                                  
              MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';        
              FEILMELDING_SATT   = '1'B;                                        
              S001I01I.FRAFNRL   = -1; /* CURSOR POS       */                   
              S001I01O.FRAFNRA   = 'I';                                         
              S001I01O.MELDINGO  = MAP_MELDING;                                 
              S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                    
              S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                      
              EXEC CICS SEND MAP('S001I01')                                     
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/            
                                                                                
              EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')               
                                                        SET(BMSMAPBR);          
              IF S001I01I.FUNKSJONSKODEL > 0 THEN                               
                 DO;                                                            
                    FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                    
                                                                                
                    CALL OVER_OG_UT(FUNKSJONSKODE);                             
                                                                                
                 END;                                                           
              GO TO RETUR;                                                      
           END;                                                                 
                                                                                
        ELSE                                                                    
           IF ^F_GYLDIG_FNR(S001I01O.FRAFNRO) THEN                              
              DO;                                                               
                 MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                         
                 FEILMELDING_SATT   = '1'B;                                     
                 S001I01I.FRAFNRL   = -1; /* CURSOR POS       */                
                 S001I01O.FRAFNRA   = 'I';                                      
                 S001I01O.FRAFNRO   = S001I01I.FRAFNRI;                         
                 S001I01O.MELDINGO  = MAP_MELDING;                              
                 S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                 
                 S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                   
                 EXEC CICS SEND MAP('S001I01')                                  
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
              /***  LESER INN FNR FRA INNTEKTSBILDET.   *************/          
                                                                                
                 EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')            
                                                         SET(BMSMAPBR);         
                 IF S001I01I.FUNKSJONSKODEL > 0 THEN                            
                    DO;                                                         
                       FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                 
                                                                                
                       CALL OVER_OG_UT(FUNKSJONSKODE);                          
                                                                                
                    END;                                                        
                 GO TO RETUR;                                                   
              END;                                                              
                                                                                
                                                                                
    FNR_REG.FNR1     = S001I01O.FRAFNRO;                                        
    FNR_REG.BRUKERID = DIV_PARAM_OMR.CICS_IND;                                  
                                                                                
    EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);                       
                                                                                
                                                                                
    IF S001I01I.TILFNRL > 0 &                                                   
       FNR_REG.FNR2 = 0 THEN                                                    
       IF ^F_NUMERISK(S001I01I.TILFNRI) THEN                                    
           DO;                                                                  
              MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';        
              FEILMELDING_SATT   = '1'B;                                        
              S001I01I.TILFNRL   = -1; /* CURSOR POS       */                   
              S001I01O.TILFNRA   = 'I';                                         
              S001I01O.MELDINGO  = MAP_MELDING;                                 
              S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                    
              S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                      
              EXEC CICS SEND MAP('S001I01')                                     
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/            
                                                                                
              EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')               
                                                        SET(BMSMAPBR);          
              IF S001I01I.FUNKSJONSKODEL > 0 THEN                               
                 DO;                                                            
                    FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                    
                                                                                
                    CALL OVER_OG_UT(FUNKSJONSKODE);                             
                                                                                
                 END;                                                           
              GO TO RETUR;                                                      
           END;                                                                 
                                                                                
        ELSE                                                                    
           IF ^F_GYLDIG_FNR(S001I01O.TILFNRO) THEN                              
              DO;                                                               
                 MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                         
                 FEILMELDING_SATT   = '1'B;                                     
                 S001I01I.TILFNRL   = -1; /* CURSOR POS       */                
                 S001I01O.TILFNRA   = 'I';                                      
                 S001I01O.TILFNRO   = S001I01I.TILFNRI;                         
                 S001I01O.MELDINGO  = MAP_MELDING;                              
                 S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                 
                 S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                   
                 EXEC CICS SEND MAP('S001I01')                                  
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
              /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/         
                                                                                
                 EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')            
                                                       SET(BMSMAPBR);           
                 IF S001I01I.FUNKSJONSKODEL > 0 THEN                            
                    DO;                                                         
                       FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                 
                                                                                
                       CALL OVER_OG_UT(FUNKSJONSKODE);                          
                                                                                
                    END;                                                        
                 GO TO RETUR;                                                   
              END;                                                              
                                                                                
    IF FNR_REG.FNR2 > 0 THEN                                                    
       IF S001I01I.TILFNRL > 0 &                                                
                       ^S001I01O.TILFNRO = FNR_REG.FNR2 THEN                    
          DO;                                                                   
             MAP_MELDING = 'FRA-FNR ENDRET TIL ' !!                             
                                                FNR_REG.FNR2   !!               
                         '.TIL-FNR STEMMER IKKE OVERENS MED DETTE.';            
             S001I01I.TILFNRL   = -1;                                           
             S001I01O.TILFNRA   = 'I';                                          
             FEILMELDING_SATT   = '1'B;                                         
             S001I01O.MELDINGO  = MAP_MELDING;                                  
                 S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                 
                 S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                   
             EXEC CICS SEND MAP('S001I01')                                      
                                MAPSET('S001I13')CURSOR ERASE;                  
                                                                                
             /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/          
                                                                                
             EXEC CICS RECEIVE MAP('S001I01')                                   
                                     MAPSET ('S001I13')  SET(BMSMAPBR);         
                                                                                
             IF S001I01I.FUNKSJONSKODEL > 0 THEN                                
                DO;                                                             
                   FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                     
                                                                                
                   CALL OVER_OG_UT(FUNKSJONSKODE);                              
                                                                                
                END;                                                            
                                                                                
             GO TO RETUR;                                                       
          END;                                                                  
       ELSE                                                                     
          S001I01O.TILFNRO   = FNR_REG.FNR2;                                    
                                                                                
    ELSE                                                                        
       IF ^(S001I01I.TILFNRL    >    0   )                    THEN              
          DO;                                                                   
             MAP_MELDING =                                                      
             MAP_MELDING        =  'FRA-FNR FINNES IKKE I FNR-ENDRI' !!         
                                   'NGSREGISTERET. TIL-FNR MÅ OPPGIS.';         
                                                                                
             S001I01I.TILFNRL   = -1;                                           
             FEILMELDING_SATT   = '1'B;                                         
             S001I01O.MELDINGO  = MAP_MELDING;                                  
             S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                     
             S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                       
             EXEC CICS SEND MAP('S001I01')                                      
                                   MAPSET('S001I13')CURSOR ERASE;               
                                                                                
             /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/          
                                                                                
             EXEC CICS RECEIVE MAP('S001I01')                                   
                                     MAPSET ('S001I13')  SET(BMSMAPBR);         
                                                                                
             IF S001I01I.FUNKSJONSKODEL > 0 THEN                                
                DO;                                                             
                   FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                     
                                                                                
                   CALL OVER_OG_UT(FUNKSJONSKODE);                              
                                                                                
                END;                                                            
                                                                                
                                                                                
             GO TO RETUR;                                                       
          END;                                                                  
                                                                                
                                                                                
    IF S001I01I.TILFNRL > 0 &                                                   
       FNR_REG.FNR2 = 0 THEN                                                    
       DO;                                                                      
          FNR_REG.FNR1     = S001I01O.TILFNRO;                                  
                                                                                
          EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);                 
                                                                                
          IF FNR_REG.FNR2 > 0 THEN                                              
             IF ^S001I01O.FRAFNRO = FNR_REG.FNR2 THEN                           
                DO;                                                             
                   MAP_MELDING = 'TIL-FNR ENDRET TIL ' !!                       
                                                FNR_REG.FNR2   !!               
                         '.FRA-FNR STEMMER IKKE OVERENS MED DETTE.';            
                   S001I01I.FRAFNRL   = -1;                                     
                   S001I01O.FRAFNRA   = 'I';                                    
                   FEILMELDING_SATT   = '1'B;                                   
                   S001I01O.MELDINGO  = MAP_MELDING;                            
             S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN;                     
             S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                       
                   EXEC CICS SEND MAP('S001I01')                                
                                            MAPSET('S001I13')ERASE;             
                                                                                
               /***  LESER INN FNR FRA INNTEKTSBILDET.   *************/         
                                                                                
                   EXEC CICS RECEIVE MAP('S001I01')                             
                                     MAPSET ('S001I13')  SET(BMSMAPBR);         
                                                                                
                   IF S001I01I.FUNKSJONSKODEL > 0 THEN                          
                      DO;                                                       
                         FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;               
                                                                                
                         CALL OVER_OG_UT(FUNKSJONSKODE);                        
                                                                                
                      END;                                                      
                                                                                
                   GO TO RETUR;                                                 
                END;                                                            
     END;                                                                       
                                                                                
                                                                                
   FEILMELDING_SATT            =   '0'B;                                        
   FRA_FNR                     =    S001I01O.FRAFNRO;                           
   TIL_FNR                     =    S001I01O.TILFNRO;                           
                                                                                
                                                                                
 RETUR:                                                                         
 END SJEKK_FNR_1;                                                               
                                                                                
                                                                                
 SJEKK_FNR_2:                                                                   
   PROC;                                                                        
     FEILMELDING_SATT   = '0'B;                                                 
     IF ^(S001I01I.FRAFNRL > 0) THEN                                            
        DO;                                                                     
           MAP_MELDING = 'FRA-FNR MÅ OPPGIS';                                   
           FEILMELDING_SATT   = '1'B;                                           
           S001I01I.FRAFNRL   = -1;     /* CURSOR POS       */                  
           S001I01O.FRAFNRA   = 'I';                                            
           S001I01O.MELDINGO  = MAP_MELDING;                                    
                                                                                
           S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                      
           S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                         
           EXEC CICS SEND MAP('S001I01')                                        
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA INNTEKTSBILDET.   *************/             
                                                                                
           EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')                  
                                                        SET(BMSMAPBR);          
           IF S001I01I.FUNKSJONSKODEL > 0 THEN                                  
              DO;                                                               
                 FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                       
                                                                                
                 CALL OVER_OG_UT(FUNKSJONSKODE);                                
                                                                                
              END;                                                              
           GO TO RETUR;                                                         
        END;                                                                    
                                                                                
     ELSE                                                                       
        IF ^F_NUMERISK(S001I01I.FRAFNRI) THEN                                   
           DO;                                                                  
              MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';        
              FEILMELDING_SATT   = '1'B;                                        
              S001I01I.FRAFNRL   = -1; /* CURSOR POS       */                   
              S001I01O.FRAFNRA   = 'I';                                         
              S001I01O.MELDINGO  = MAP_MELDING;                                 
              S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                   
              S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                      
              EXEC CICS SEND MAP('S001I01')                                     
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/            
                                                                                
              EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')               
                                                        SET(BMSMAPBR);          
              IF S001I01I.FUNKSJONSKODEL > 0 THEN                               
                 DO;                                                            
                    FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                    
                                                                                
                    CALL OVER_OG_UT(FUNKSJONSKODE);                             
                                                                                
                 END;                                                           
              GO TO RETUR;                                                      
           END;                                                                 
                                                                                
        ELSE                                                                    
           IF ^F_GYLDIG_FNR(S001I01O.FRAFNRO) THEN                              
              DO;                                                               
                 MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                         
                 FEILMELDING_SATT   = '1'B;                                     
                 S001I01I.FRAFNRL   = -1; /* CURSOR POS       */                
                 S001I01O.FRAFNRA   = 'I';                                      
                 S001I01O.FRAFNRO   = S001I01I.FRAFNRI;                         
                 S001I01O.MELDINGO  = MAP_MELDING;                              
                 S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                
                 S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                   
                 EXEC CICS SEND MAP('S001I01')                                  
                                     MAPSET('S001I13')ERASE CURSOR;             
                                                                                
              /***  LESER INN FNR FRA INNTEKTSBILDET.   *************/          
                                                                                
                 EXEC CICS RECEIVE MAP('S001I01') MAPSET ('S001I13')            
                                                      SET(BMSMAPBR);            
                 IF S001I01I.FUNKSJONSKODEL > 0 THEN                            
                    DO;                                                         
                       FUNKSJONSKODE = S001I01I.FUNKSJONSKODEI;                 
                                                                                
                       CALL OVER_OG_UT(FUNKSJONSKODE);                          
                                                                                
                    END;                                                        
                 GO TO RETUR;                                                   
              END;                                                              
                                                                                
           ELSE                                                                 
              DO;                                                               
                 FNR_REG.FNR1     = S001I01O.FRAFNRO;                           
                                                                                
                 EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);          
                                                                                
                 IF FNR_REG.FNR2 > 0 THEN                                       
                    DO;                                                         
                       MAP_MELDING = S001I01I.FRAFNRI     !!                    
                           ' ER ET FØDSELSNUMMER SOM ER ENDRET' !!              
                                               '.TRYKK ENTER!';                 
                       FRA_FNR            = FNR_REG.FNR2;                       
                       S001I01O.FRAFNRO   = FRA_FNR     ;                       
                       S001I01O.MELDINGO  = MAP_MELDING;                        
                       S001I01O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;          
                       S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;             
                       EXEC CICS SEND MAP('S001I01')                            
                                               MAPSET('S001I13')ERASE;          
                                                                                
                       EXEC CICS RECEIVE MAP('S001I01')                         
                                      MAPSET ('S001I13')SET(BMSMAPBR);          
                                                                                
                       GO TO RETUR;                                             
                    END;                                                        
                 ELSE                                                           
                       FRA_FNR = S001I01O.FRAFNRO;                              
              END;                                                              
                                                                                
                                                                                
 RETUR:                                                                         
 END SJEKK_FNR_2;                                                               
                                                                                
                                                                                
                                                                                
  OVER_OG_UT:                                                                   
     PROC(KODE);                                                                
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    TAR XCTL TIL PROGRAM R0010301.                                */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL OVER_OG_UT(FUNKSJONSKODE);                               */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
                                                                                
     DCL KODE                 CHAR (1);                                         
                                                                                
                                                                                
     FUNKSJONSKODE = KODE;                                                      
                                                                                
     EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);                      
                                                                                
  END OVER_OG_UT;                                                               
                                                                                
                                                                                
                                                                                
                                                                                
  PF2:                                                                          
                                                                                
     MAP_MELDING              = 'TRANSAKSJONEN FORKASTET';                      
     FEILMELDING_SATT         = '1'B;                                           
     S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                        
     S001I01O.MELDINGO        = MAP_MELDING;                                    
     S001I01O.CICS_INFOO      = DIV_PARAM_OMR.CICS_NAVN ;                       
     S001I01O.ROLLEO =  DIV_PARAM_OMR.ATK_ROLLE ;                               
     EXEC CICS SEND MAP('S001I01')                                              
                                       MAPSET('S001I13') CURSOR ERASE;          
                                                                                
     TRANSKODE = 'R0I1';                                                        
     EXEC CICS XCTL PROGRAM('R001I101') COMMAREA(KOM_OMR);                      
                                                                                
                                                                                
                                                                                
  FEILBEH:                                                                      
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                                   
     IF FEIL_MELD_NR = 0 THEN                                                   
        DO;                                                                     
           S001I01O.MELDINGO =                                                  
              'F E I L  H A R  O P P S T Å T T ! ! !.' !!                       
              'FEILMELDNR. : ' !! FEIL_MELD_NR;                                 
                                                                                
            EXEC CICS SEND MAP('S001I01')                                       
                          MAPSET('S001I13');                                    
        END;                                                                    
     EXEC CICS RECEIVE MAP('S001I01')                                           
                                    MAPSET('S001I13') SET(BMSMAPBR);            
                                                                                
                                                                                
     EXEC CICS SYNCPOINT ROLLBACK;                                              
                                                                                
     EXEC CICS SEND MAP('S001013') MAPSET('S001013')                            
                                                   MAPONLY  ERASE  ;            
                                                                                
     /*  SKRIVER SKJERMBILDE MED SPØRSMÅL OM FUNKSJONSKODE */                   
                                                                                
     TRANSKODE = 'R030';                                                        
                                                                                
     EXEC CICS RETURN TRANSID  (TRANSKODE)                                      
                                      COMMAREA (KOM_OMR  )         ;            
                                                                                
                                                                                
                                                                                
  ABEND:                                                                        
     EXEC CICS ABEND ABCODE(FEIL);                                              
                                                                                
  %INCLUDE R0019904;             /*  FNR-KONTROLL                 */            
                                                                                
  %INCLUDE R0019910;             /*  NUMERISK KONTROLL            */            
                                                                                
  %INCLUDE R0019912;             /*  NUM-> CHAR                   */            
                                                                                
  %INCLUDE R0019956;             /*  BER_G_CICS                   */            
                                                                                
 /* %INCLUDE R0019960;                 F_CICSINFO                   */          
                                                                                
  END R001I10;                                                                  
