 /*   SIST ENDRET PÅ PROD   2000.02.18 14.34.35 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.27 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.46.45 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO11  UNDERPROGRAM SOM BRUKES AV R001NO10    */        
 /*                            KONTROLL AP-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : OKT 1986                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NO11                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R0010502   BLANK TRANSOMR                                      */        
 /*    R0010503   KONTR AP SØKER                                      */        
 /*    R0010504   KONTR AP BARN                                       */        
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR AP OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P105_BEHANDLE_AP: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P0010501;                      /* TRANSOMRÅDE AP */                   
                                                                                
                                                                                
          CALL BLANK_AP_SØKER;                         /* R0010502 */           
          CALL BLANK_AP_BARN;                          /* R0010502 */           
          CALL BLANK_AP_MELDNR;                        /* R0010502 */           
          CALL BLANK_AP_SPES;                          /* R0010502 */           
          CALL OVERF_AP_BLANKETT;                                               
          CALL KONTROLL_AP_SØKER(FEIL_FUNNET);         /* R0010503 */           
                                                                                
          IF ^FEIL_FUNNET                         &                             
             F_FELT_PIC_CHAR2(APS.BT_ANT) ^= '00' THEN                          
             DO;                                                                
                CALL OVERF_AP_BARN;                                             
                CALL KONTROLL_AP_BARN(FEIL_FUNNET);    /* R0010504 */           
             END;                                                               
                                                                                
          IF APS.NORSK_BOSATT = 'N'   THEN                                      
             DO;                                                                
                FEIL_I_BOSATT = TRUE;                                           
                FEIL_FUNNET   = TRUE;                                           
             END;                                                               
                                                                                
          IF FEIL_FUNNET      THEN                                              
             CALL FINN_FEIL_AP;                                                 
                                                                                
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL AP TRANSOMRÅDE FOR AP SØKER.                      */        
 /* ***************************************************************** */        
 OVERF_AP_BLANKETT:PROC;                                                        
                                                                                
    DCL HJELPEDATO   PIC '(8)9';                                                
                                                                                
          APS.REGDATO_ÅMD  =  BLANKETT_RECORD.TRANS_DATO_ÅMD;                   
          APS.TERMID       = DIV_PARAM_OMR.TERMINAL_NR;                         
          HJELPEDATO        = AP_BLANKETT.VIRK_DATO_ÅMD / 100;                  
          APS.VIRK_DATO_ÅMD = HJELPEDATO * 100;                                 
          APS.FNR          =  BLANKETT_RECORD.FNR;                              
          APS.NAVN         =  BLANKETT_RECORD.NAVN;                             
          APS.TKNR         =  BLANKETT_RECORD.TKNR;                             
          APS.TILL_EK      =  AP_BLANKETT.EKTEFELLETILLEGG;                     
          APS.SIVILSTAND   =  AP_BLANKETT.SIVILSTAND;                           
          APS.SPRÅK        =  AP_BLANKETT.SPRÅK;                                
                                                                                
          IF F_FELT_PIC_CHAR3 (AP_BLANKETT.ANT_BARN) ^= '   '    THEN           
             APS.BT_ANT    =  AP_BLANKETT.ANT_BARN;                             
                                                                                
          APS.NORSK_BOSATT =  AP_BLANKETT.NORSK_BOSATT;                         
                                                                                
          IF F_FELT_PIC_CHAR5 (AP_BLANKETT.FAI) ^= '     '       THEN           
             APS.FAI       =  AP_BLANKETT.FAI * 100;                            
                                                                                
          IF F_FELT_PIC_CHAR3 (AP_BLANKETT.APD) ^= '   '         THEN           
             APS.APD       =  AP_BLANKETT.APD;                                  
                                                                                
          IF F_FELT_PIC_CHAR11 (AP_BLANKETT.FNR_EK) ^= (11)' '   THEN           
             APS.FNR_EK    =  AP_BLANKETT.FNR_EK;                               
                                                                                
          APS.NAVN_EK      =  AP_BLANKETT.NAVN_EK;                              
          APS.EK_INNT      =  AP_BLANKETT.EK_INNT;                              
                                                                                
                                                                                
    END OVERF_AP_BLANKETT;                                                      
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL AP TRANSOMRÅDE FOR AP BARN.                       */        
 /* ***************************************************************** */        
 OVERF_AP_BARN:PROC;                                                            
                                                                                
                                                                                
          DO I = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                               
                               (AP_BLANKETT.FNR_BARN (I)) ^= (11)' ');          
             APB.FNR_BARN(I) = AP_BLANKETT.FNR_BARN(I);                         
             APB.RBT_BARN(I) = AP_BLANKETT.RED_BT(I);                           
          END;                                                                  
                                                                                
                                                                                
    END OVERF_AP_BARN;                                                          
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */        
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */        
 /* ***************************************************************** */        
 FINN_FEIL_AP:PROC;                                                             
                                                                                
    DCL ANT_BARN              FIXED BIN (15);                                   
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF APS.FNRNR ^= 0 &                                                   
             APS.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF APS.TKNRNR ^= 0 &                                                  
             APS.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.TKNRNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF APS.NAVNNR ^= 0 &                                                  
             APS.NAVNNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.NAVNNR;                             
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.SPRÅKNR ^= 0 &                                                 
             APS.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.SPRÅKNR;                            
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.SIVILSTANDNR ^= 0 &                                            
             APS.SIVILSTANDNR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.SIVILSTANDNR;                       
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.TILL_EKNR ^= 0 &                                               
             APS.TILL_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.TILL_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.NORSK_BOSATTNR ^= 0 &                                          
             APS.NORSK_BOSATTNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.NORSK_BOSATTNR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.BT_ANTNR ^= 0 &                                                
             APS.BT_ANTNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.BT_ANTNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.FAINR ^= 0 &                                                   
             APS.FAINR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.FAINR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.APDNR ^= 0 &                                                   
             APS.APDNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.APDNR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.VIRK_DATO_ÅMDNR ^= 0 &                                         
             APS.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.FNR_EKNR ^= 0 &                                                
             APS.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.FNR_EKNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.NAVN_EKNR ^= 0 &                                               
             APS.NAVN_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.NAVN_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF APS.EK_INNTNR ^= 0 &                                               
             APS.EK_INNTNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = APS.EK_INNTNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
          DO ANT_BARN = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                        
                                   (APB.FNR_BARN(ANT_BARN)) ^= (11)'0');        
                                                                                
             IF APB.FNR_BARNNR(ANT_BARN) ^= 0   &                               
                APB.FNR_BARNNR(ANT_BARN) ^= 999 THEN                            
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = APB.FNR_BARNNR(ANT_BARN);            
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
             IF APB.RBT_BARNNR(ANT_BARN) ^= 0   &                               
                APB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                            
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = APB.RBT_BARNNR(ANT_BARN);            
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
          END;                                                                  
                                                                                
                                                                                
                                                                                
    END FINN_FEIL_AP;                                                           
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0010502;          /*     BLANK AP TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R0010503;          /*     KONTR AP SØKER      */                      
 %PAGE;                                                                         
 %INCLUDE R0010504;          /*     KONTR AP BARN       */                      
                                                                                
                                                                                
 END P105_BEHANDLE_AP;                                                          
                                                                                
                                                                                
