 /*   SIST ENDRET PÅ PROD   2006.04.07  9.56.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.37.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.08 13.18.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.10.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.58.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.14.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.05.08 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.54 AV   JDA7339          */        
 /*       SIST ENDRET 26/03-99 13.24.06 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.12.31 AV   JDA7339                  */        
 /*       SIST ENDRET 30/11-98 13.06.13 AV   JDA7339                  */        
 /*       SIST ENDRET 30/11-98 13.05.31 AV   JDA7339                  */        
 /*       SIST ENDRET 28/08-98 15.56.53 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.40.46 AV   HLA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NU16  UNDERPROGRAM SOM BRUKES AV R001NO10.   */        
 /*                            KONTROLL EN-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  :      HERMAN                                      */        
 /*  PROGRAMMET BLE LAGET : OKTOBER 1997                              */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NU16                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R001UE02   BLANK EN TRANSOMRÅDE                                */        
 /*    R001UE03   KONTR EN SØKER                                      */        
 /*    R001UE05   KONTR KAP 7,8,10                                    */        
 /*    FUNKSJONER SOM BLIR BRUKT ER INKLUDERT I HOVEDPROGRAMMET.      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR EN OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P114_BEHANDLE_EN: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P001UE01;                               /* TRANSOMR EN */             
                                                                                
    DCL ANTALL_FEIL_SKREVET   FIXED DEC (3);                                    
    DCL HJ_DATO               PIC '(8)9' INIT (0);                              
                                                                                
                                                                                
          FEIL_I_BOSATT = '0'B;                                                 
          FEIL_BLANKETT = '0'B;                                                 
          FEIL_FUNNET   = '0'B;                                                 
          CALL BLANK_EN_SØKER;                        /* R001UE02 */            
          CALL BLANK_EN_KAP7;                         /* R001UE02 */            
          CALL BLANK_EN_KAP8;                         /* R001UE02 */            
          CALL BLANK_EN_KAP10;                        /* R001UE02 */            
          CALL BLANK_EN_KAP11;                        /* R001UE02 */            
          CALL BLANK_EN_MELDNR;                       /* R001UE02 */            
          CALL BLANK_EN_INNTEKT;                      /* R001UE02 */            
          CALL BLANK_EN_SPES;                         /* R001UE02 */            
          CALL OVERFØR_EN_BLANKETT;                                             
          CALL KONTROLL_EN_SØKER(FEIL_FUNNET);        /* R001UE03 */            
          CALL KONTROLL_EN_KAP7(FEIL_FUNNET);         /* R001UE05 */            
          CALL KONTROLL_EN_KAP8(FEIL_FUNNET);         /* R001UE05 */            
          CALL KONTROLL_EN_KAP10(FEIL_FUNNET);        /* R001UE05 */            
                                                                                
          IF FEIL_FUNNET     THEN                                               
             DO;                                                                
                CALL FINN_FEIL_EN;                                              
             END;                                                               
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   PROSEDYRE FOR Å OVERFØRE VERDIER FRA INPUT_RECORDEN             */        
 /*   TIL EN_TRANS_OMR I KOM_OMR.                                     */        
 /* ***************************************************************** */        
 OVERFØR_EN_BLANKETT:                                                           
   PROC;                                                                        
                                                                                
     DCL HJELPEDATO    PIC '(8)9';                                              
                                                                                
          ENS.REGDATO_ÅMD        = BLANKETT_RECORD.TRANS_DATO_ÅMD;              
          ENS.TERMID             = DIV_PARAM_OMR.TERMINAL_NR;                   
          ENS.FNR                = BLANKETT_RECORD.FNR;                         
          ENS.TKNR               = BLANKETT_RECORD.TKNR;                        
          ENS.SPRÅK              = EN_BLANKETT.SPRÅK;                           
          HJELPEDATO             = EN_BLANKETT.VIRK_DATO_ÅMD / 100;             
          ENS.VIRK_DATO_ÅMD      = HJELPEDATO * 100;                            
          ENS.NAVN_NYTT          = EN_BLANKETT.NAVN_NYTT;                       
          ENS.NAVN_NYTT_EK       = EN_BLANKETT.NAVN_NYTT_EK;                    
                                                                                
          ENS.NAVN_EK            = EN_BLANKETT.NAVN_EK;                         
          ENS.SKILSMISSE         = EN_BLANKETT.SKILSMISSE;                      
          IF ENS.SKILSMISSE      = 'X'             THEN                         
             ENS.SIVILSTAND      = ' ';                                         
          ELSE                                                                  
             ENS.SIVILSTAND      = EN_BLANKETT.SIVILSTAND;                      
          IF F_FELT_PIC_CHAR11(EN_BLANKETT.FNR_EK) ^= (11)' '   THEN            
             ENS.FNR_EK          = EN_BLANKETT.FNR_EK;                          
     /*HL 9712 :                                       ** */                    
          ELSE                                                                  
             ENS.SIVILSTAND      = ' ';                                         
                                                                                
          IF VERIFY(ENS.SIVILSTAND,'GPWV') ^= 0   THEN                          
             ENS.SIVILSTAND      = ' ';                                         
          ENS.FLYTTET_FRA        = EN_BLANKETT.FLYTTET_FRA;                     
          ENS.FLYTTET_SAMMEN     = EN_BLANKETT.FLYTTET_SAMMEN;                  
          ENS.OPPHØR_SAMBO       = EN_BLANKETT.OPPHØR_SAMBO;                    
          ENS.EK_INNT_OVER_2G    = EN_BLANKETT.EK_INNT_OVER_2G;                 
          ENS.RED_GP_3_2_5       =  EN_BLANKETT.RED_GP_3_2_5;                   
          EN_INNTEKT.MINST_4G    = EN_BLANKETT.MINST_4G;                        
                                                                                
          IF F_FELT_PIC_CHAR5(EN_BLANKETT.FAI) ^= (5)' '        THEN            
             ENK7.FAI            = EN_BLANKETT.FAI * 100;                       
          ELSE                                                                  
             ENK7.FAI            = 9999999;                                     
                                                                                
                                                                                
          IF F_FELT_PIC_CHAR7                                                   
             (EN_BLANKETT.INNTEKT_FØR_UP) ^= (7)' '        THEN                 
             ENK8.INNTEKT_FØR_UP = EN_BLANKETT.INNTEKT_FØR_UP;                  
          ELSE                                                                  
             ENK8.INNTEKT_FØR_UP = 0;                                           
                                                                                
          IF F_FELT_PIC_CHAR8                                                   
             (EN_BLANKETT.INNT_DATO_ÅMD) ^= (8)' '       THEN                   
             DO;                                                                
                  HJ_DATO   =     EN_BLANKETT.INNT_DATO_ÅMD / 100;              
                  ENK8.INNT_DATO_ÅMD = HJ_DATO * 100;                           
             END;                                                               
          ELSE                                                                  
             ENK8.INNT_DATO_ÅMD = 0;                                            
                                                                                
          ENK8.REAKTIVISERING    = EN_BLANKETT.REAKTIVISERING;                  
          ENK8.UNNTAK_VENTETID   = EN_BLANKETT.UNNTAK_VENTETID;                 
          ENK8.FRYSP_5ÅR_ARB     = EN_BLANKETT.FRYSP_5ÅR_ARB;                   
          ENK8.FRYSP_TIDSB       = EN_BLANKETT.FRYSP_TIDSB;                     
          ENK8.LØNNSTILSKUDD     = EN_BLANKETT.LØNNSTILSKUDD;                   
                                                                                
          IF F_FELT_PIC_CHAR3(EN_BLANKETT.UFG       ) ^= (3)' ' THEN            
             ENK8.UFG            = EN_BLANKETT.UFG;                             
          ELSE                                                                  
             ENK8.UFG            = 999;                                         
                                                                                
          ENK11.YUG            = 999;                                           
                                                                                
          IF F_FELT_PIC_CHAR5                                                   
                (EN_BLANKETT.FORVENTET_INNT) ^= (5)' '  THEN                    
             ENK10.FORVENTET_INNT =                                             
                       EN_BLANKETT.FORVENTET_INNT * 100;                        
          ELSE                                                                  
             ENK10.FORVENTET_INNT = 9999999;                                    
                                                                                
          ENK10.O_TIL_PENSJON    = EN_BLANKETT.O_TIL_PENSJON;                   
          ENK10.FRADRAG_2G    = EN_BLANKETT.FRADRAG_2G;                         
                                                                                
  IF F_FELT_PIC_CHAR8(EN_BLANKETT.FRAML_DATO_ÅMD) ^= (8)' ' THEN                
             ENK10.FRAML_DATO_ÅMD = EN_BLANKETT.FRAML_DATO_ÅMD;                 
                                                                                
          ENK10.OPPHØR_EO        = EN_BLANKETT.OPPHØR_EO;                       
                                                                                
  /* DISSE FELTENE BLIR INNTIL VIDERE BARE FYLT UT MED NIERE : */               
                                                                                
      EN_INNTEKT.PENSJONSINNT_SØKER = EN_BLANKETT.PENSJONSINNT_SØKER;           
      EN_INNTEKT.ARBEIDSINNT_SØKER  = EN_BLANKETT.ARBEIDSINNT_SØKER;            
      EN_INNTEKT.PENSJONSINNT_EK    = EN_BLANKETT.PENSJONSINNT_EK;              
      EN_INNTEKT.ARBEIDSINNT_EK     = EN_BLANKETT.ARBEIDSINNT_EK;               
                                                                                
      EN_SPES.STATSBORGER           = EN_BLANKETT.STATSBORGER;                  
      EN_SPES.BOSTED                = EN_BLANKETT.BOSTED;                       
      EN_SPES.TP_NORDISK            = EN_BLANKETT.TP_NORDISK;                   
      EN_SPES.TP_NORDISK_LAND       = EN_BLANKETT.TP_NORDISK_LAND;              
      EN_SPES.PENSJON_EØS           = EN_BLANKETT.PENSJON_EØS;                  
                                                                                
 /*TRE NYE FELT SOM IKKE OVERFØRES - 9901 : */                                  
                                                                                
      EN_SPES.INNT_PRØVET_EØS_PENS  = ' ';                                      
      EN_SPES.TT_EØS_ANT_ÅR         = 99;                                       
      EN_SPES.TT_EØS_ANT_MND        = 99;                                       
                                                                                
    END OVERFØR_EN_BLANKETT;                                                    
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRENE NÅR DET */        
 /*   ER FEIL I DEN OVERFØRTE TRANSEN.                                */        
 /* ***************************************************************** */        
 FINN_FEIL_EN:PROC;                                                             
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF ENS.FNRNR ^= 0   &                                                 
             ENS.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF ENS.TKNRNR ^= 0   &                                                
             ENS.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.TKNRNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF ENS.SPRÅKNR ^= 0 &                                                 
             ENS.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.SPRÅKNR;                            
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.VIRK_DATO_ÅMDNR ^= 0  &                                        
             ENS.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.NAVN_NYTTNR ^= 0   &                                           
             ENS.NAVN_NYTTNR ^= 999 THEN                                        
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.NAVN_NYTTNR;                        
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.NAVN_NYTT_EKNR ^= 0   &                                        
             ENS.NAVN_NYTT_EKNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.NAVN_NYTT_EKNR;                     
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.FNR_EKNR ^= 0   &                                              
             ENS.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.FNR_EKNR;                           
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.NAVN_EKNR ^= 0   &                                             
             ENS.NAVN_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.NAVN_EKNR;                          
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
    /* TEST PAA SIVILSTAND LAGT INN OKTOBER 2002 JD */                          
          IF ENS.SIVILSTANDNR ^= 0   &                                          
             ENS.SIVILSTANDNR ^= 999 THEN                                       
             DO;                                                                
                IF VERIFY(ENS.SIVILSTAND,'EAS') = 0 THEN   /*0903 TS*/          
                   ENS.SIVILSTANDNR = 640;                                      
                                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.SIVILSTANDNR;                       
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
          IF ENS.SKILSMISSENR ^= 0   &                                          
             ENS.SKILSMISSENR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.SKILSMISSENR;                       
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.FLYTTET_FRANR ^= 0   &                                         
             ENS.FLYTTET_FRANR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.FLYTTET_FRANR;                      
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.FLYTTET_SAMMENNR ^= 0   &                                      
             ENS.FLYTTET_SAMMENNR ^= 999 THEN                                   
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.FLYTTET_SAMMENNR;                   
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.OPPHØR_SAMBONR ^= 0   &                                        
             ENS.OPPHØR_SAMBONR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.OPPHØR_SAMBONR;                     
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.EK_INNT_OVER_2GNR ^= 0   &                                     
             ENS.EK_INNT_OVER_2GNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.EK_INNT_OVER_2GNR;                  
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENS.RED_GP_3_2_5NR ^= 0 &                                          
             ENS.RED_GP_3_2_5NR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENS.RED_GP_3_2_5NR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF EN_INNTEKT.MINST_4GNR ^= 0   &                                     
             EN_INNTEKT.MINST_4GNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = EN_INNTEKT.MINST_4GNR;                  
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK7.FAINR ^= 0   &                                                
             ENK7.FAINR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK7.FAINR;                             
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
          IF ENK8.UFGNR ^= 0   &                                                
             ENK8.UFGNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK8.UFGNR;                             
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK8.REAKTIVISERINGNR ^= 0   &                                     
             ENK8.REAKTIVISERINGNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK8.REAKTIVISERINGNR;                  
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK8.UNNTAK_VENTETID ^= 0   &                                      
             ENK8.UNNTAK_VENTETIDNR ^= 999 THEN                                 
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK8.UNNTAK_VENTETIDNR;                 
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK8.FRYSP_5ÅR_ARBNR ^= 0   &                                      
             ENK8.FRYSP_5ÅR_ARBNR ^= 999 THEN                                   
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK8.FRYSP_5ÅR_ARBNR;                   
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK8.FRYSP_TIDSBNR ^= 0   &                                        
             ENK8.FRYSP_TIDSBNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK8.FRYSP_TIDSBNR;                     
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK8.LØNNSTILSKUDDNR ^= 0   &                                      
             ENK8.LØNNSTILSKUDDNR ^= 999 THEN                                   
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK8.LØNNSTILSKUDDNR;                   
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK10.FORVENTET_INNTNR ^= 0   &                                    
             ENK10.FORVENTET_INNTNR ^= 999 THEN                                 
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK10.FORVENTET_INNTNR;                 
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK10.O_TIL_PENSJONNR ^= 0   &                                     
             ENK10.O_TIL_PENSJONNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK10.O_TIL_PENSJONNR;                  
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK10.FRADRAG_2GNR ^= 0   &                                        
             ENK10.FRADRAG_2GNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK10.FRADRAG_2GNR;                     
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK10.FRAML_DATO_ÅMDNR ^= 0  &                                     
             ENK10.FRAML_DATO_ÅMDNR ^= 999 THEN                                 
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK10.FRAML_DATO_ÅMDNR;                 
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF ENK10.OPPHØR_EONR ^= 0   &                                         
             ENK10.OPPHØR_EONR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = ENK10.OPPHØR_EONR;                      
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
    END FINN_FEIL_EN;                                                           
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001UE02;          /*     BLANK EN TRANSOMR   */                      
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001UE03;          /*     KONTR EN SØKER      */                      
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001UE05;          /*     KONTR EN KAP.7,8,10 */                      
                                                                                
                                                                                
 END P114_BEHANDLE_EN;                                                          
