 /*   SIST ENDRET PÅ PROD   2007.07.30 13.57.31 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2005.01.06 11.36.26 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.21.11 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.58.09 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.05.12 12.58.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.09.17  8.28.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.28 14.50.48 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.01  9.14.49 AV   JDA7339          */        
 /*       SIST ENDRET 12/10-99 09.31.54 AV   JDA7339                  */        
 /*       SIST ENDRET 12/10-99 09.30.10 AV   JDA7339                  */        
 /*       SIST ENDRET 06/10-99 08.40.21 AV   JDA7339                  */        
 /*       SIST ENDRET 19/08-98 09.29.35 AV   TSB7339                  */        
 /*       SIST ENDRET 20/07-98 13.12.42 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 13.21.51 AV   JDA7339                  */        
 /*       SIST ENDRET 11/06-98 08.50.01 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*      R0011620                                                     */        
 /*      PROGRAMMERER: HELEN,MAI 1982.                                */        
 /* HENSIKT:                                                          */        
 /*      KONTROLLERER DØDSTRANS MOT STATUS FOR FAMILIEN I BASEN.      */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*      KALLES OPP AV 3520                                           */        
 /* BRUK:                                                             */        
 /*      EXEC CICS XCTL PROGRAM ('R0011620') COMMAREA (KOM_OMR)       */        
 /* ***************************************************************** */        
 /* - ENDRET 8/6-84 AV KARIN                                          */        
 /*      ENDRINGEN GJELDER REDUSERT BT.                               */        
 /* - ENDRET 20/8-84 AV KARIN                                         */        
 /*      ENDRINGEN GJELDER VIRKNINGSDATO FOR RESTEN AV FAMILIEN NÅR   */        
 /*      AVDØDE ER FORSØRGET EKTEFELLE ELLER FORSØRGET BARN,          */        
 /*      SKAL DA VÆRE : DØDSDATO + 1MND                               */        
 /* - ENDRET 12.2.85 AV HERMAN                                        */        
 /*      PENSJONIST SOM FORSØRGER EKTEFELLE FIKK FEIL TRANSTYPE.      */        
 /*      SE FEILMELDING NR 173                                        */        
 /* - ENDRET 27/2-85 AV KARIN                                         */        
 /*      ENDRINGEN GJELDER VIRKNINGSDATO FOR RESTEN AV FAMILIEN NÅR   */        
 /*      AVDØDE ER FORSØRGET EKTEFELLE ELLER FORSØRGET BARN,          */        
 /*      SKAL DA VÆRE : DØDSDATO + 1MND                               */        
 /*      DETTE BLE FEIL NÅR DØDSDATO I DESEMBER. VIRKDATO_ÅM SKAL     */        
 /*      DA VÆRE DØDSDATO_ÅM + 100 - 11.                              */        
 /* ***************************************************************** */        
 KONXO1:PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                    
    DCL COMMAREA_PEKER     PTR;                                                 
    /* -------------------------------------------------------------- */        
    %INCLUDE P0011601; /* TRANS_OMR FOR O1 BASED ON TRANS_PEKER       */        
    %INCLUDE P0019906; /* TRANS_OPPL_OMR   BASED ON TRANS_OPPL_PEKER  */        
    %INCLUDE P0019908; /* KOM_OMR          BASED ON COMMAREA_PEKER    */        
    %INCLUDE P0019910; /* STYRINGS_OMR     BASED ON STYRINGS_PEKER    */        
    %INCLUDE P0019912; /* DIV_PARAM_OMR    BASED ON DIV_PARAM_PEKER   */        
    /* -------------------------------------------------------------- */        
    DCL  1  B01 BASED(B01_PEKER), %INCLUDE P0019921;                            
    DCL  1  B02 BASED(B02_PEKER), %INCLUDE P0019921;                            
                                                                                
    /* -------------------------------------------------------------- */        
    /* HJELPEFELT.                                                    */        
    /* -------------------------------------------------------------- */        
    DCL                                                                         
       (                                                                        
        ADDR,                                                                   
        VERIFY                                                                  
       )                                  BUILTIN,                              
       (                                                                        
        AVD_FORS_EK_IND,                                                        
        AVD_FORS_IND,                                                           
        AVDØD_IND,                                                              
        BARN_IND,                                                               
        FORS_EK_IND,                                                            
        FORS_IND,                                                               
        I,                                                                      
        J,                                                                      
        K,                                                                      
        NY_YNG_BARN_IND,                                                        
        YB                                                                      
       )                                 FIXED BIN(15),                         
       (                                                                        
         SEKSTISJU_ÅRSDATO                                                      
       )                                 PIC  '( 6)9',                          
       (                                                                        
        HJ_DØDSDATO_ÅMD                                                         
       )                                 PIC  '( 8)9',                          
       (                                                                        
        T_FNR                                                                   
       )                                 PIC  '(11)9',                          
       (                                                                        
        T_FNR13                                                                 
       )                                 PIC  '(13)9';                          
    DCL                                                                         
      1 FNR13             DEF        T_FNR13,                                   
        2 DG13            PIC        '99',                                      
        2 MN13            PIC        '99',                                      
        2 ÅR13            PIC        '9999',                                    
        2 PERSNR,                                                               
          3 ÅRHUNDRE13    PIC       '999',                                      
          3 REST13        PIC        '99';                                      
    DCL  HJ_DØDSDATO_ÅR_RE POS(1) DEF HJ_DØDSDATO_ÅMD PIC '9999';               
    DCL  HJ_DØDSDATO_ÅM    POS(1) DEF HJ_DØDSDATO_ÅMD PIC '999999';             
                                                                                
    /* ============================================================== */        
    /* HJELPEFELT INITIERES.                                          */        
    /* ============================================================== */        
    IF (FEIL_MELD_NR = 0) THEN                                                  
       PROGRAM_ID = 'R0011620';                                                 
    I               = 0;                                                        
    J               = 0;                                                        
    K               = 0;                                                        
    FORS_IND        = 0;                                                        
    NY_YNG_BARN_IND = 0;                                                        
    AVD_FORS_IND    = 0;                                                        
                                                                                
    AVDØD_IND       = SØKER_IND;                                                
    T_FNR           = O1.FNR_DØD;                                               
    T_FNR13         = KONV_FNR11_FNR13(T_FNR);                                  
                                                                                
    /* REGNER UT ÅR OG MND VEDKOMMENDE FYLLER 67 ÅR (HHÅÅMM).         */        
    SEKSTISJU_ÅRSDATO = (ÅR13 + 67) * 100 + MN13;                               
                                                                                
    /* DØDSDATO ER FLYTTET INN I VIRKNINGSDATO I R0011603  */                   
    HJ_DØDSDATO_ÅMD = O1.DØDSDATO_ÅMD;                                          
                                                                                
    IF (ÅR13           < 1924   !                                               
        HJ_DØDSDATO_ÅM < 199100 ) THEN                                          
       B02.PENSJONSRETT_FØR_91 = 'J';                                           
                                                                                
    B02.GP_REDUKSJON_KODE (AVDØD_IND) = ' ';                                    
                                                                                
    IF B01.FNR(AVDØD_IND) = 0 THEN                                              
       DO;  /* AVDØD ER IKKE I BASEN. */                                        
          B02.FNR              (AVDØD_IND)  =  O1.FNR_DØD;                      
          B02.TKNR             (AVDØD_IND)  =  O1.TKNR_DØD;                     
          B02.SPRÅK            (AVDØD_IND)  =  ' ';                             
          B02.DØDSDATO_ÅMD     (AVDØD_IND)  =  O1.DØDSDATO_ÅMD;                 
          B02.VIRK_DATO_ÅMD    (AVDØD_IND)  =  VIRKNINGSDATO_ÅMD;               
                                                                                
          B02.PENSJONSTYPE1    (AVDØD_IND)  = 'D';                              
          B02.FØRSTE_GANG_REG  (AVDØD_IND)  = 'J';                              
          B02.STATUS_KODE_HIST (AVDØD_IND)  = 'X';                              
          TRANSTYPE = 65;                                                       
       END; /* AVDØD ER IKKE I BASEN. */                                        
    ELSE                                                                        
       DO;  /* AVDØDE ER I BASEN */                                             
          IF (B01.DØDSDATO_ÅMD(AVDØD_IND) > 0 &                                 
              B01.DØDSDATO_ÅMD(AVDØD_IND) ^= O1.DØDSDATO_ÅMD) THEN              
             DO;  /* HAR ANNEN DØDSDATO - SEND KORREKSJON TIL RTV */            
 L100:                                                                          
                FEIL_VED_LABEL = '100';                                         
                FEIL_MELD_NR   = 1709;                                          
                GO TO L999;                                                     
             END; /* HAR ANNEN DØDSDATO - SEND KORREKSJON TIL RTV */            
          B02.PENSJONSTYPE2(AVDØD_IND) = ' ';                                   
          IF (AVDØD_IND < 3) THEN                                               
             DO;  /* AVDØDE ER IKKE PÅ BARNEPLASS */                            
                B02.PERSON(AVDØD_IND)           = B01.PERSON(AVDØD_IND);        
                B02.DØDSDATO_ÅMD(AVDØD_IND)     = O1.DØDSDATO_ÅMD;              
                B02.VIRK_DATO_ÅMD(AVDØD_IND)    = VIRKNINGSDATO_ÅMD;            
                B02.PENSJONSTYPE1(AVDØD_IND)    = 'D';                          
                B02.STATUS_KODE_HIST(AVDØD_IND) = 'X';                          
                B02.SUM_YTELSE(AVDØD_IND)       = 0;                            
                IF (STATUS_TYPE = 'A' !                                         
                    STATUS_TYPE = 'I' ) THEN                                    
                   DO; /* AVDØDE HAR IKKE PENSJONSSTATUS. */                    
                      TRANSTYPE = 65;                                           
                      /* -------------------------------------------- */        
                      /* ENDRET 14.2.85  HL :                         */        
                      /*    NÅR STATUS_TYPE = 'I', SÅ SKAL            */        
                      /*    FØRSTE_GANG_REG VÆRE 'N'                  */        
                      /* RETTET TILBAKE 991201                        */        
                      /* -------------------------------------------- */        
                      IF (STATUS_TYPE = 'I') THEN                               
                         B02.FØRSTE_GANG_REG(AVDØD_IND) = 'N';                  
                      ELSE                                                      
                         B02.FØRSTE_GANG_REG(AVDØD_IND) = 'J';                  
                   END; /* AVDØDE HAR IKKE PENSJONSSTATUS. */                   
                ELSE                                                            
                   DO;  /* AVDØDE HAR PENSJONSSTATUS */                         
                      B02.FØRSTE_GANG_REG(AVDØD_IND) = 'N';                     
                      IF (B01.YRKEPENS.YUG(AVDØD_IND) > 0) THEN                 
                         B02.DØD_AV_YRKESSKADE (AVDØD_IND) = 'J';               
                      DO I = 1 TO 13                                            
                               WHILE(B01.FNR_TILKN(AVDØD_IND,I) > 0);           
                         IF (B01.TILKNYTNINGSKODE(AVDØD_IND,I)='L' !            
                             B01.TILKNYTNINGSKODE(AVDØD_IND,I)='V' !            
                             B01.TILKNYTNINGSKODE(AVDØD_IND,I)='W' )THEN        
                             /* AVDØDE ER TILKNYTTET FORSØRGET BARN  */         
                             DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);             
                                IF B01.FNR(J) =                                 
                                         B01.FNR_TILKN(AVDØD_IND,I) THEN        
                                   DO;  /* FLYTT BARNET TIL B02 */              
                                      B02.PERSON(J)= B01.PERSON(J);             
                                      B02.STATUS_KODE_HIST(J) = 'O';            
                                      B02.VIRK_DATO_ÅMD(J) =                    
                                         VIRKNINGSDATO_ÅMD;                     
                                IF B01.YRKEPENS.YUG (AVDØD_IND) > 0 THEN        
                                     B02.DØD_AV_YRKESSKADE (J)    = 'Y';        
                                   END; /* FLYTT BARNET TIL B02 */              
                             END; /* DO J = 3 TO 14 */                          
                      END; /* DO I = 1 TO 13 */                                 
                    IF (B01.STATUS.SIVILSTAND(AVDØD_IND) = 'V' !                
                        B01.STATUS.SIVILSTAND(AVDØD_IND) = 'A') &               
                        B01.RF0PERSN.FNR(EKTEF_IND) = 0  THEN                   
                          TRANSTYPE = 54;                                       
                    ELSE                                                        
                    IF B01.STATUS.SIVILSTAND(AVDØD_IND) = 'G' !                 
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'W' !                 
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'V' !                 
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'P' !                 
                       B01.STATUS.SIVILSTAND(AVDØD_IND) = 'A' THEN              
                       DO;  /* DØD "GIFT" OG KOBLET TIL "EKTEFELLE"   */        
                          IF B01.RF0PERSN.FNR(EKTEF_IND) = 0  THEN              
                             DO;                                                
  L110:  /*EKTEFELLEN ER AV EN ELLER ANNEN GRUNN IKKE INNLEST */                
                                FEIL_VED_LABEL = '110';                         
                                FEIL_MELD_NR   = 1727;                          
                                GO TO L999;                                     
                             END;                                               
    /*                    TRANSTYPE = 53              */                        
                          TRANSTYPE = 18;          /*9803 HL*/                  
                          B02.PENSJONSTYPE2(AVDØD_IND) = ' ';                   
                          CALL FLYTT_B01_TIL_B02(EKTEF_IND);                    
                       /* B02.VIRKDATO(EKTEF) ER NÅ = DØDSDATO */               
                                                                                
                          B02.ARBEIDSINNTEKT_EK(EKTEF_IND) = 0;                 
                          B02.PENSJONSINNTEKT_EK(EKTEF_IND) = 0;                
                          B02.EK_INNT_OVER_2G   (EKTEF_IND) = ' ';              
                          B02.RED_GP_3_2_5      (EKTEF_IND) = ' ';              
                          B02.GP_REDUKSJON_KODE (EKTEF_IND) = ' ';              
                                                                                
 /* RULLERING AV EKTEFELLES INNTEKTER - 9802 HL */                              
    IF B02.ALDERSP.FAI(EKTEF_IND) > 0   THEN                                    
       CALL RULL_FAI(B02.G_DATO_ÅMD(EKTEF_IND),                                 
                     B02.VIRK_DATO_ÅMD(EKTEF_IND),                              
                     B02.ALDERSP.FAI(EKTEF_IND));                               
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) > 0  THEN                           
       B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) =                                   
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.PENSJONSINNTEKT(EKTEF_IND));                         
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) > 0  THEN                            
       B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) =                                    
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND));                          
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) > 0  THEN                        
       B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) =                                
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                  B02.VIRK_DATO_ÅMD(EKTEF_IND),                                 
                  B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND));                     
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) > 0  THEN                         
       B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) =                                 
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND));                       
                                                                                
                          IF B01.PENSJONSTYPE1 (AVDØD_IND) = 'F' THEN           
                             DO;  /* PENSJONSTYPE1 = F */                       
 /*HL*/  B02.VIRK_DATO_ÅMD(EKTEF_IND) = VIRKNINGSDATO_ÅMD;                      
                                B02.PENSJONSTYPE2(EKTEF_IND) = 'P';             
                                TRANSTYPE = 17;                                 
                                                                                
                               IF B01.ANTALL_BARN(EKTEF_IND) > 0 THEN           
                                DO;                                             
                                 DO I = 1 TO 13 WHILE                           
                                  (B01.FNR_TILKN (EKTEF_IND, I) > 0);           
                 IF B01.TILKNYTNINGSKODE(EKTEF_IND,I) = 'L'  !                  
  /*HL*/            B01.TILKNYTNINGSKODE(EKTEF_IND,I) = 'V'  !                  
                    B01.TILKNYTNINGSKODE(EKTEF_IND,I) = 'W' THEN                
                                                                                
                                  DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);        
 /*HL*/      B02.VIRK_DATO_ÅMD(J) = VIRKNINGSDATO_ÅMD;                          
                                /* B02.PENSJONSTYPE2(J)     =                   
                                                B01.PENSJONSTYPE2(J) */         
                                  END;                                          
                                 END;                                           
                                END;                                            
                             END; /* PENSJONSTYPE1 = F */                       
                                                                                
                          IF FEIL_MELD_NR > 0 THEN                              
                             GO TO L999;                                        
                          ELSE                                                  
                             PROGRAM_ID = 'R0011620';                           
                       IF B01.SIVILSTAND(EKTEF_IND) = 'V'  THEN                 
                          B02.SIVILSTAND(EKTEF_IND) = 'U';                      
                       ELSE                                                     
                          B02.SIVILSTAND(EKTEF_IND) = 'E';                      
                       B02.FØRSTE_GANG_REG  (EKTEF_IND)  = 'N';                 
                                                                                
                    IF B01.YRKEPENS.YUG (AVDØD_IND) > 0      THEN               
                       B02.DØD_AV_YRKESSKADE (EKTEF_IND) = 'Y';                 
                          CALL OPPHØR_KOBLING_AVDØD;                            
                          /* IKKE LENGER REDUSERT BARNETILL */                  
                                                                                
                          DO I = 3 TO 14 WHILE (B02.FNR(I) > 0);                
                             IF B01.PENSJONSTYPE2(I) = 'R' THEN                 
                                TRANSTYPE = 47;                                 
                             B02.PENSJONSTYPE2(I) = ' ';                        
                          END;                                                  
 /* ***************************************************************** */        
 /* FINNER TRANSTYPE.                                                 */        
 /* ***************************************************************** */        
                                                                                
                          IF B01.PENSJONSTYPE2(AVDØD_IND) = 'S' THEN            
                                                                                
 /* ***************************************************************** */        
 /* AVDØDE ER EN AV TO PENSJONISTER.                                  */        
 /* ***************************************************************** */        
                                                                                
                             DO;                                                
                              B02.PENSJONSTYPE2(EKTEF_IND) = 'P';               
                              B02.EK_INNT_OVER_2G(EKTEF_IND) = ' ';             
                          B02.RED_GP_3_2_5      (EKTEF_IND) = ' ';              
                          B02.GP_REDUKSJON_KODE (EKTEF_IND) = ' ';              
                                                                                
 /*AFP : TT OVERFØRES IKKE FOR AFP : */                                         
                                                                                
 /*AFP*/                     IF B02.PENSJONSTYPE1(EKTEF_IND) ^= 'K' &           
 /*AFP*/                       B02.PENSJONSTYPE1(SØKER_IND) ^= 'K' THEN         
 /*HL0793*/                     IF O1.DØDSDATO_ÅMD < 19910000 THEN              
                                B02.TT_GARANTI   (EKTEF_IND) =                  
                                                 B02.TT_ANV(SØKER_IND);         
                                                                                
                                TRANSTYPE = 18;                                 
                             END;                                               
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* AVDØDE ER EN IKKE-FORSØRGET EKTEFELLE.                            */        
 /* ***************************************************************** */        
                                                                                
                       IF B01.PENSJONSTYPE1(AVDØD_IND) = 'G'  &                 
   /*20030129 HL - HAR EKTEFELLEN HATT REDUSERT GP ? : */                       
                          B01.GP_REDUKSJON_KODE(EKTEF_IND) = ' ' THEN           
                          TRANSTYPE = 53;                                       
                       ELSE                                                     
                          TRANSTYPE = 18;     /*  9803 HL*/                     
                                                                                
  /*                      IF B01.PENSJONSTYPE2(AVDØD_IND) = 'P'  !*/            
                          IF B01.PENSJONSTYPE1(EKTEF_IND) = 'G'  !              
 /*REMEDY 700 - 200501*/     B01.PENSJONSTYPE1(EKTEF_IND) = 'F'  !              
 /* TILLEGG 12.2.85 HL */    B01.PENSJONSTYPE2(AVDØD_IND) = 'F' THEN            
                                                                                
 /* ***************************************************************** */        
 /* AVDØDE HAR EKTEFELLE UTEN PENSJON.                                */        
 /* ***************************************************************** */        
                                                                                
                             DO;                                                
                                TRANSTYPE = 54;                                 
                                B02.SIVILSTAND(EKTEF_IND) = 'E';                
                                        /* TRUDE 220995*/                       
                                IF B01.PENSJONSTYPE2(EKTEF_IND) = 'N'           
                                                                THEN            
                                      TRANSTYPE = 18;                           
                                        /*TRUDE 220995*/                        
                                                                                
                             END;                                               
                          CALL                                                  
                              AJOURFØR_HIST_AVDØDE_I_STATUS(AVDØD_IND);         
                                                                                
                           IF O1.FNR_EK  > 0    THEN                            
                                                                                
 /* ***************************************************************** */        
 /* EKTEFELLE HAR AUTOMATISKE ETTERLATTE RETTIGHETER.                 */        
 /* ***************************************************************** */        
                                                                                
                             DO;                                                
                                IF (B01.PENSJONSTYPE1(EKTEF_IND) = 'A'!         
                                    B01.PENSJONSTYPE1(EKTEF_IND) = 'U'!         
                                    B01.PENSJONSTYPE1(EKTEF_IND) = 'Y')         
                                  & B01.PENSJONSTYPE2(EKTEF_IND) = 'S'          
                                                                THEN            
                                   DO;                                          
                                        /* TS 0896 UFG MÅ VÆRE 100*/            
                                IF (B01.PENSJONSTYPE1(EKTEF_IND) = 'U'!         
                                    B01.PENSJONSTYPE1(EKTEF_IND) = 'Y')&        
                                    B01.UFØRPENS.UFG(EKTEF_IND) <  100 &        
                                    O1.PI_DØD ^= '9999999'    THEN              
                                       DO;                                      
    L115:                                                                       
                                          FEIL_VED_LABEL = '115';               
                                          FEIL_MELD_NR   = 1750;                
                                          GO TO L999;                           
                                       END;                                     
                                       /* TS 0896 TIL HIT*/                     
                                                                                
                                      B02.PENSJONSTYPE2(EKTEF_IND) =            
                                                                  'E';          
   B02.ETTEPENS.SPT_1291(EKTEF_IND) = B02.UFØRPENS.SPT_1291(AVDØD_IND);         
   B02.ETTEPENS.OPT_1291(EKTEF_IND) = B02.UFØRPENS.OPT_1291(AVDØD_IND);         
   B02.ETTEPENS.PÅ_1291(EKTEF_IND)  = B02.UFØRPENS.PÅ_1291(AVDØD_IND);          
                                      CALL                                      
                                         KOBLE_TO_PERSONER(AVDØD_IND,           
                                                           EKTEF_IND);          
                                   END;                                         
                                ELSE                                            
                                                                                
                                   IF O1.PI_DØD ^= '9999999'    THEN            
                                                                                
 /*O1.PI_DØD = 999999 BETYR AT DØDSMELDINGEN ER GENERERT AV EP-SØKNAD*/         
                                                                                
                                      IF B01.PENSJONSTYPE1(SØKER_IND)           
                                                     = 'K' THEN                 
                                        DO;                                     
                                         FEIL_VED_LABEL = '120';                
                                         FEIL_MELD_NR   = 1736;                 
                                        END;                                    
         ELSE                                                                   
                                                                                
                                       DO;                                      
   L120:                                                                        
                                         FEIL_VED_LABEL = '120';                
                                         FEIL_MELD_NR   = 1406;                 
                                         GO TO L999;                            
                                       END;                                     
                             END;                                               
                       END;                                                     
                     ELSE                                                       
                        DO;  /* AVDØDE ER ETTERLATT ELLER SKILT. */             
                           TRANSTYPE = 54;                                      
                           CALL OPPHØR_KOBLING_AVDØD;                           
                           CALL AJOURFØR_HIST_AVDØDE_I_STATUS                   
                                   (AVDØD_IND);                                 
                        END; /* AVDØDE ER ETTERLATT ELLER SKILT. */             
                 END; /* AVDØDE HAR PENSJONSSTATUS.*/                           
             END; /* AVDØDE ER IKKE PÅ BARNEPLASS */                            
                                                                                
 /* ***************************************************************** */        
 /* AVDØDE ER PÅ BARNEPLASS OG MÅ DERFOR HA PENSJONSSTATUS.           */        
 /* ***************************************************************** */        
                                                                                
        ELSE                                                                    
           DO;                                                                  
                                                                                
 /* ***************************************************************** */        
 /* AVDØD_IND ER NÅ DEN RIKTIGE BARNEINDEKS.                       */           
 /* ***************************************************************** */        
                                                                                
              IF B01.PENSJONSTYPE1(AVDØD_IND) = 'L' THEN                        
                                                                                
 /* ***************************************************************** */        
 /* AVDØDE ER FORSØRGET BARN. BARNET KAN BARE VÆRE KNYTTET TIL        */        
 /* FORSØRGEREN I TILKNYTNINGS SEGMENT(1).                            */        
 /* ***************************************************************** */        
                                                                                
                 DO;                                                            
                    IF B01.FNR_TILKN(AVDØD_IND,1) = B01.FNR(1)  THEN            
                       DO;                                                      
                          FORS_IND = 1;                                         
                          FORS_EK_IND = 2;                                      
                       END;                                                     
                    ELSE                                                        
                       DO;                                                      
                          FORS_IND = 2;                                         
                          FORS_EK_IND = 1;                                      
                       END;                                                     
                                                                                
 /* ***************************************************************** */        
 /* BARNA BLIR FLYTTET SAMTIDIG MED FORELDRE.                         */        
 /* ***************************************************************** */        
                                                                                
                    CALL                                                        
                        FLYTT_B01_TIL_B02(FORS_IND);                            
                    IF FEIL_MELD_NR > 0 THEN                                    
                       GO TO L999;                                              
                    ELSE                                                        
                       PROGRAM_ID = 'R0011620';                                 
                    IF B01.FNR(FORS_EK_IND) > 0  THEN                           
                       DO;                                                      
                          CALL                                                  
                              FLYTT_B01_TIL_B02(FORS_EK_IND);                   
                          IF FEIL_MELD_NR > 0 THEN                              
                             GO TO L999;                                        
                          ELSE                                                  
                             PROGRAM_ID = 'R0011620';                           
                       END;                                                     
                                                                                
 /* ***************************************************************** */        
 /* BARNET BLIR SLETTET OG TILKNYT.SEGMENT TIL FORSØRGEREN OPPDATERES.*/        
 /* ***************************************************************** */        
                                                                                
                    CALL                                                        
                        AJOURFØR_HIST_AVDØDE_I_STATUS(AVDØD_IND);               
                    CALL                                                        
                        OPPHØR_KOBLING_AVDØD;                                   
                    B02.ANTALL_BARN(FORS_IND) =                                 
                                          B02.ANTALL_BARN(FORS_IND) - 1;        
                    TRANSTYPE = 19;                                             
                 END;                                                           
              ELSE                                                              
                 IF B01.PENSJONSTYPE1(AVDØD_IND) = 'N' !                        
                    B01.PENSJONSTYPE1(AVDØD_IND) = 'B' THEN                     
                                                                                
 /* ***************************************************************** */        
 /* BARNET ER ETTERLATT - EN AV FORELDRENE DØD.                       */        
 /* ***************************************************************** */        
                                                                                
                    DO;                                                         
                       IF B01.FNR(1) > 0 THEN                                   
                          DO;                                                   
                             AVD_FORS_IND    = 1;                               
                             AVD_FORS_EK_IND = 2;                               
                          END;                                                  
                       ELSE                                                     
                          DO;                                                   
                             AVD_FORS_IND    = 2;                               
                             AVD_FORS_EK_IND = 1;                               
                          END;                                                  
                       CALL                                                     
                           FLYTT_B01_TIL_B02(3);                                
                       IF FEIL_MELD_NR > 0 THEN                                 
                          GO TO L999;                                           
                       ELSE                                                     
                          PROGRAM_ID = 'R0011620';                              
                                                                                
 /* ***************************************************************** */        
 /* BARNET ER FLYTTET SAMMEN MED ØVRIGE BARN.                         */        
 /* ***************************************************************** */        
                       B02.PERSON  (AVD_FORS_IND)  =                            
                                     B01.PERSON(AVD_FORS_IND);                  
                       IF B01.PENSJONSTYPE1(AVDØD_IND) = 'B' THEN               
                          B02.PERSON  (AVD_FORS_EK_IND)  =                      
                                     B01.PERSON(AVD_FORS_EK_IND);               
                       CALL                                                     
                           AJOURFØR_HIST_AVDØDE_I_STATUS(AVDØD_IND);            
                       CALL                                                     
                           OPPHØR_KOBLING_AVDØD;                                
                                                                                
                       IF B01.PENSJONSTYPE2(AVDØD_IND) = 'P' &                  
                         (B01.PENSJONSTYPE1(AVDØD_IND) = 'B' !                  
                          B01.PENSJONSTYPE1(AVDØD_IND) = 'N')  THEN             
                          DO; /* BARNET ER YNGSTE BARN */                       
                             IF (B01.ANTALL_BARN(AVDØD_IND) > 1) THEN           
                                DO;/* ------------------------------- */        
                                   /* BARNET ER TILKNYTTET ØVRIGE     */        
                                   /* BARN                            */        
                                   /* ------------------------------- */        
                                   TRANSTYPE = 37;                              
                                   /* ------------------------------- */        
                                   /* BARNA UNDERSØKES FOR Å FINNE    */        
                                   /* NYTT YNGSTE BARN I KULLET       */        
                                   /* ------------------------------- */        
                                   NY_YNG_BARN_IND = 4;                         
                                   IF B01.ANTALL_BARN(AVDØD_IND) >              
                                                                 2 THEN         
                                      DO I = 5 TO 14 WHILE (                    
                                                     B02.FNR(I) > 0);           
                                         /* ------------------------- */        
                                         /* VI SNUR FNR FOR Å FINNE   */        
                                         /* HVEM SOM NÅ ER DET YNGSTE */        
                                         /* BARNET                    */        
                                         /* ------------------------- */        
                                         /* OMARBEIDET JUNI 2004, VI  */        
                                         /* TOK IKKE HENSYN TIL ÅR-   */        
                                         /* HUNDRE - MARTIN           */        
                                         /* ------------------------- */        
                                             YB = NY_YNG_BARN_IND;              
                          IF (KONV_FNR11_HÅMDPNR((B02.FNR(YB))) >               
                              KONV_FNR11_HÅMDPNR((B02.FNR(I ))) ) THEN          
                                                NY_YNG_BARN_IND = I;            
                                          END;                                  
                                                                                
 /* ***************************************************************** */        
 /* PENSJONSKODER ,ANTALL BARN OPPDATERES.                            */        
 /* ***************************************************************** */        
                                       B02.PENSJONSTYPE2(                       
                                              NY_YNG_BARN_IND)                  
                                                                = 'P';          
                                       B02.ANTALL_BARN(                         
                                            NY_YNG_BARN_IND) =                  
                                              B01.ANTALL_BARN(                  
                                                       AVDØD_IND) - 1;          
                                       B02.FØRSTE_GANG_REG                      
                                           (NY_YNG_BARN_IND) = 'N';             
                                                                                
 /* ***************************************************************** */        
 /* BARNET KOBLES TIL AVDØDE FORSØRGEREN.                             */        
 /* ***************************************************************** */        
                                                                                
                                       CALL                                     
                                           KOBLE_TO_PERSONER (                  
                                                       NY_YNG_BARN_IND,         
                                                          AVD_FORS_IND);        
                                       IF B01.PENSJONSTYPE1(AVDØD_IND) =        
                                                              'B' THEN          
                                          CALL                                  
                                              KOBLE_TO_PERSONER (               
                                                       NY_YNG_BARN_IND,         
                                                      AVD_FORS_EK_IND);         
                                                                                
 /* ***************************************************************** */        
 /* ØVRIGE BARN KOBLES TIL NY YNGSTE BARN OG KOBLING TIL AVDØDE       */        
 /* BARN OPPHØRER.                                                    */        
 /* ***************************************************************** */        
                                                                                
                                       DO I = 4 TO 14 WHILE (                   
                                                  B02.FNR(I) > 0);              
                                          IF B02.PENSJONSTYPE2(I) =             
                                                              'Ø' THEN          
                                             DO;                                
                                                BARN_IND = I;                   
                                                CALL                            
                                                    KOBLE_TO_PERSONER           
                                                             (BARN_IND,         
                                                       NY_YNG_BARN_IND);        
                                                B02.FØRSTE_GANG_REG             
                                                (NY_YNG_BARN_IND) = 'N';        
                                             END;                               
                                                                                
 /* ***************************************************************** */        
 /* BARNET ER NÅ KOBLET TIL NY YNGSTE BARN MED 'P' .                  */        
 /* ***************************************************************** */        
                                                                                
                                       END;                                     
                                    END;                                        
                                 ELSE                                           
                                                                                
 /* ***************************************************************** */        
 /* DET ER IKKE FLERE BARN.                                           */        
 /* ***************************************************************** */        
                                                                                
                                   TRANSTYPE = 56;                              
                          END;                                                  
                       ELSE                                                     
                                                                                
 /* ***************************************************************** */        
 /* BARNET IKKE YNGSTE BARN.YNGSTE BARN HAR INDEKS = 3.               */        
 /* ANTALL BARN OPPDATERES .                                          */        
 /* ***************************************************************** */        
                                                                                
                          DO;                                                   
                             TRANSTYPE = 37;                                    
                             B02.ANTALL_BARN(3) = B01.ANTALL_BARN(3) -1;        
                             DO I = 3 TO 14 WHILE                               
                                (B02.FNR(I) > 0);                               
                                 B02.FØRSTE_GANG_REG(I) = 'N';                  
                             END;                                               
                          END;                                                  
                    END;                                                        
           END;                                                                 
    END;                                                                        
    /* V ELLER W FLYTTES INN I FORSØRGET BARN PENSJONSTYPE 2--JD 0302 */        
     IF (B01.ANTALL_BARN(EKTEF_IND) > 0) THEN                                   
        DO;                                                                     
           DO I = 1 TO 13 WHILE(B01.FNR_TILKN (EKTEF_IND, I) > 0);              
              IF (B01.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) = 'L' !               
                  B01.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) = 'V' !               
                  B01.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) = 'W' ) THEN          
                                                                                
              DO J = 3 TO 14 WHILE (B01.FNR(J) > 0);                            
           /*    B02.VIRK_DATO_ÅMD(J) = VIRKNINGSDATO_ÅMD */                    
                 B02.PENSJONSTYPE2(J) = B01.PENSJONSTYPE2(J);                   
              END;                                                              
            END;                                                                
        END;                                                                    
    /* -------------------------------------------------------------- */        
 L999:                                                                          
    EXEC CICS RETURN;                                                           
    /* -------------------------------------------------------------- */        
    %INCLUDE R0011622; /* AJOURFØR_HISTORIKK_OM_AVDØDE_I_STATUS */              
    %INCLUDE R0019902; /* F_KJØNN                               */              
    %INCLUDE R0019924; /* KOBLE_TO_PERSONER                     */              
    %INCLUDE R0019926; /* FLYTT_B01_TIL_B02                     */              
    %INCLUDE R0019930; /* OPPHØR_KOBLING_AVDØD                  */              
    %INCLUDE R0019949; /* F_BEREGN_TT_FRAMT                     */              
    %INCLUDE R0019967; /* RULL_FAI                              */              
    %INCLUDE R0019968; /* F_RULL_FORSI                          */              
    %INCLUDE R0019975; /* KONV_FNR11_HÅMDPNR                    */              
    %INCLUDE R0019995; /* KONV_FNR11_FNR13    2000-3            */              
    /* -------------------------------------------------------------- */        
 END KONXO1;                                                                    
