 /*   SIST ENDRET PÅ PROD   2008.11.05 16.23.27 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   1999.12.15 11.51.38 AV   JDA7339          */        
 /*       SIST ENDRET 04/05-98 12.58.25 AV   JDA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014159 - PROSEDYRE I PLI                                     */        
 /*    PROGRAMMERER:    HERMAN - AUGUST 1997                          */        
 /* *****************************************                         */        
 /*HENSIKT:                                                           */        
 /*    PROSEDYREN BEHANDLER . DØD FØR 2601 ÅR                         */        
 /*                         . UFØR FØR 2601 ÅR, MEN SOM VENTET PÅ     */        
 /*                           RETT TIL GARANTERT SPT                  */        
 /* ****************************************************************  */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYREN INCLUDES I R0014141 (CALL I 4152)                   */        
 /*BRUK:                                                              */        
 /*    CALL UNGE_DØDE_B_E                                             */        
 /*    VIRK_ÅM                                                        */        
 /*    FNR_ÅR                                                         */        
 /*    ALDER (ENTEN ALDER VED DØD, ELLER ALDER VED UFØRHET)           */        
 /*    RETUR_POENG : RETURNERES FOR TYPE 'B'                          */        
 /*    RETUR_KODE  : KODE = 'E' RETURNERES FOR TYPE 'E'               */        
 /* ***************************************************************** */        
 UNGE_DØDE_B_E: PROC(VIRK_ÅM,FNR_ÅR,ALDER,RETUR_POENG,RETUR_KODE);              
   DCL VIRK_ÅM                         PIC      '(6)9';  /*2000*/               
   DCL FNR_ÅR                          PIC      '9999';                         
   DCL ALDER                           PIC    'S99999';                         
   DCL RETUR_POENG                     FIXED DEC (3,2);                         
   DCL RETUR_KODE                      CHAR        (1);                         
                                                                                
   RETUR_POENG = 0;                                                             
   IF VIRK_ÅM > 199706                 THEN          /*2000*/                   
      DO;                                                                       
         IF FNR_ÅR < 1941                     THEN   /*2000*/                   
            DO;                                                                 
               IF ALDER < 2601                   THEN                           
                  IF FNR_ÅR > 1930                   THEN /*2000*/              
                     RETUR_KODE  = 'E';                                         
                  ELSE                                                          
                  IF ALDER < 2401                  THEN                         
                     IF FNR_ÅR > 1925                THEN  /*2000*/             
                        RETUR_KODE  = 'E';                                      
                     ELSE                                                       
                     IF ALDER < 2201                  THEN                      
                        IF FNR_ÅR > 1922                  THEN                  
                           RETUR_KODE  = 'E';                                   
            END;                                                                
         ELSE      /*FNR_ÅR > 1940*/                                            
            DO;                                                                 
               IF ALDER < 2601                   THEN                           
                  IF VIRK_ÅM > 200804       THEN                                
                     RETUR_POENG = 3.50;                                        
                  ELSE                                                          
                     RETUR_POENG = 3.30;                                        
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO 9705 ELLER 9706 :*/                                         
   IF VIRK_ÅM > 199704               THEN         /*2000*/                      
      DO;                                                                       
         IF FNR_ÅR < 1943                 THEN     /*2000*/                     
            DO;                                                                 
               IF ALDER < 2401                THEN                              
                  DO;                                                           
                     IF FNR_ÅR > 1925              THEN  /*2000*/               
                        RETUR_KODE  = 'E';                                      
                     ELSE                                                       
                     IF ALDER < 2201                      THEN                  
                        IF FNR_ÅR > 1922              THEN  /*2000*/            
                           RETUR_KODE = 'E';                                    
                  END;                                                          
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               IF ALDER < 2401                THEN                              
                  RETUR_POENG = 3.30;                                           
                                                                                
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO ER 199205-199704*/                                          
   IF VIRK_ÅM > 199204               THEN     /*2000*/                          
      DO;                                                                       
         IF FNR_ÅR < 1943                 THEN  /*2000*/                        
            DO;                                                                 
               IF ALDER < 2401                THEN                              
                  DO;                                                           
                     IF FNR_ÅR > 1925             THEN   /*2000*/               
                        RETUR_KODE  = 'E';                                      
                     ELSE                                                       
                     IF ALDER < 2201                      THEN                  
                        IF FNR_ÅR > 1922              THEN  /*2000*/            
                           RETUR_KODE  = 'E';                                   
                  END;                                                          
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               IF ALDER < 2401                THEN                              
                  RETUR_POENG = 3.30;                                           
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO ER 199201-199204*/                                          
   IF VIRK_ÅM > 199200               THEN  /*2000*/                             
      DO;                                                                       
         IF FNR_ÅR < 1945                THEN      /*2000*/                     
            DO;                                                                 
               IF ALDER < 2201                THEN                              
                  DO;                                                           
                     IF FNR_ÅR > 1922              THEN  /*2000*/               
                        RETUR_KODE  = 'E';                                      
                  END;                                                          
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               IF ALDER < 2201                THEN                              
                  RETUR_POENG = 3.30;                                           
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO ER 199101-199112*/                                          
   IF VIRK_ÅM > 199100                 THEN/*2000*/                             
      DO;                                                                       
         IF FNR_ÅR < 1945                THEN      /*2000*/                     
            DO;                                                                 
               IF ALDER < 2201                 THEN                             
                  DO;                                                           
                     IF FNR_ÅR > 1922               THEN /*2000*/               
                        RETUR_KODE  = 'E';                                      
                  END;                                                          
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               IF ALDER < 2201                 THEN                             
                  IF VIRK_ÅM > 199104              THEN  /*2000*/               
                     RETUR_POENG = 3.30;                                        
                  ELSE                                                          
                     RETUR_POENG = 3.00;                                        
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO 198907-199012 :*/                                           
   IF VIRK_ÅM > 198906               THEN        /*2000*/                       
      DO;                                                                       
         IF FNR_ÅR < 1945                THEN    /*2000*/                       
            DO;                                                                 
               IF ALDER < 2201                 THEN                             
                  DO;                                                           
                     IF FNR_ÅR > 1922              THEN    /*2000*/             
                        RETUR_KODE  = 'E';                                      
                  END;                                                          
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               IF ALDER < 2201                 THEN                             
                  RETUR_POENG = 3.00;                                           
            END;                                                                
      END;                                                                      
   ELSE /*VIRKDATO FRA 198901 TIL 198906*/                                      
   IF VIRK_ÅM > 198900                THEN     /*2000*/                         
      DO;                                                                       
         IF FNR_ÅR > 1944       &              /*2000*/                         
            ALDER < 2201                       THEN                             
               RETUR_POENG = 3.00;                                              
      END;                                                                      
   ELSE /*VIRKDATO FRA 198805 TIL 198812*/                                      
   IF VIRK_ÅM > 198804                THEN     /*2000*/                         
      DO;                                                                       
         IF FNR_ÅR > 1945       &          /*2000*/                             
            ALDER < 2101                       THEN                             
               RETUR_POENG = 3.00;                                              
      END;                                                                      
   ELSE /*VIRKDATO FRA 198705 TIL 198804*/                                      
   IF VIRK_ÅM > 198704                THEN     /*2000*/                         
      DO;                                                                       
         IF FNR_ÅR > 1945       &   /*2000*/                                    
            ALDER < 2101                       THEN                             
               RETUR_POENG = 2.50;                                              
      END;                                                                      
   ELSE /*VIRKDATO FRA 198401 TIL 198704*/                                      
   IF VIRK_ÅM > 198400                  THEN   /*2000*/                         
      DO;                                                                       
         IF FNR_ÅR > 1945       &             /*2000*/                          
            ALDER < 2101                       THEN                             
               RETUR_POENG = 2.00;                                              
      END;                                                                      
   ELSE /*VIRKDATO FRA 198105 TIL 198312*/                                      
   IF VIRK_ÅM > 198104                THEN     /*2000*/                         
      DO;                                                                       
         IF FNR_ÅR > 1946       &              /*2000*/                         
            ALDER < 2001                       THEN                             
               RETUR_POENG = 2.00;                                              
      END;                                                                      
 END UNGE_DØDE_B_E;                                                             
