 /*   SIST ENDRET PÅ PROD   2008.05.31 11.10.52 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2000.04.12 10.12.50 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.50 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.56.47 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.40.38 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NN15  UNDERPROGRAM SOM BRUKES AV R001NO10.   */        
 /*                            KONTROLL F7-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */        
 /*  PROGRAMMET BLE LAGET : MARS 1991                                 */        
 /*  ENDRINGSDATO :                                                   */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NN15                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    RXX1NC02   BLANK F7 TRANSOMR                                   */        
 /*    RXX1NC03   KONTR F7 SØKER                                      */        
 /*    RXX1NC04   KONTR F7 BARN                                       */        
 /*    RXX1NC05   KONTR F7 EK_INNTEKT                                 */        
 /*    FUNKSJONER SOM BRUKES ER INKLUDERT I HOVEDPROGRAMMET.          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR F7 OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
 P112_BEHANDLE_F7: PROC;                                                        
                                                                                
    %INCLUDE P001NC01;                          /* TRANSOMR F7 */               
                                                                                
    /* ============================================================== */        
                                                                                
    CALL BLANK_F7_SØKER;                       /* RXX1NC02 */                   
    CALL BLANK_F7_SØKER2;                      /* RXX1NC02 */                   
    CALL BLANK_F7_MELDNR;                      /* RXX1NC02 */                   
    CALL BLANK_F7_BARN;                        /* RXX1NC02 */                   
    CALL OVERFØR_F7_BLANKETT; /* INTERN   */                                    
    CALL KONTROLL_F7_SØKER(FEIL_FUNNET);       /* RXX1NC03 */                   
                                                                                
    IF ^FEIL_FUNNET                         &                                   
       F_FELT_PIC_CHAR2(F7S.BT_ANT) ^= '00' THEN                                
       DO;                                                                      
          CALL OVERF_F7_BARN;                                                   
          CALL KONTROLL_F7_BARN(FEIL_FUNNET);   /* RXX1NC04 */                  
       END;                                                                     
                                                                                
    IF F7S.TILL_EK = 'J'   THEN                                                 
       CALL KONTROLL_ARBEIDSINNTEKT (F7S.VIRK_DATO_ÅMD);                        
                                                                                
    IF FEIL_FUNNET  THEN                                                        
       CALL FINN_FEIL_F7;                                                       
                                                                                
    /* ************************************************************** */        
    OVERFØR_F7_BLANKETT:PROC;                                                   
       /* *********************************************************** */        
       /* PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORD TIL     */        
       /* F7_TRANS_OMR I KOM_OMR FOR F7_SØKER.                        */        
       /* *********************************************************** */        
                                                                                
       DCL HJELPEDATO    PIC '(8)9';                                            
                                                                                
       F7S.REGDATO_ÅMD  = BLANKETT_RECORD.TRANS_DATO_ÅMD;                       
       F7S.TERMID       = DIV_PARAM_OMR.TERMINAL_NR;                            
       F7S.FNR          = BLANKETT_RECORD.FNR;                                  
       F7S.TKNR         = BLANKETT_RECORD.TKNR;                                 
       F7S.TILL_EK      = F7_BLANKETT.EKTEFELLE_TILL;                           
                                                                                
       IF F_FELT_PIC_CHAR2(F7_BLANKETT.BT_ANT) ^= '  '   THEN                   
             F7S.BT_ANT    = F7_BLANKETT.BT_ANT;                                
                                                                                
       HJELPEDATO        = F7_BLANKETT.VIRK_DATO_ÅMD / 100;                     
       F7S.VIRK_DATO_ÅMD = HJELPEDATO * 100;                                    
                                                                                
       IF F_FELT_PIC_CHAR11(F7_BLANKETT.FNR_EK) ^= (11)' '  THEN                
             F7S.FNR_EK    = F7_BLANKETT.FNR_EK;                                
                                                                                
       IF F_FELT_PIC_CHAR7(F7_BLANKETT.PENSJONSINNTEKT) ^= (7)' ' THEN          
             F7S.PENSJONSINNTEKT = F7_BLANKETT.PENSJONSINNTEKT;                 
                                                                                
       IF F_FELT_PIC_CHAR7(F7_BLANKETT.ARBEIDSINNTEKT) ^= (7)' ' THEN           
             F7S.ARBEIDSINNTEKT  = F7_BLANKETT.ARBEIDSINNTEKT;                  
                                                                                
       IF F_FELT_PIC_CHAR7(F7_BLANKETT.PENSJONSINNTEKT_EK)^= (7)' ' THEN        
             F7S.PENSJONSINNTEKT_EK = F7_BLANKETT.PENSJONSINNTEKT_EK;           
                                                                                
       IF F_FELT_PIC_CHAR7(F7_BLANKETT.ARBEIDSINNTEKT_EK)^= (7)' ' THEN         
             F7S.ARBEIDSINNTEKT_EK  = F7_BLANKETT.ARBEIDSINNTEKT_EK;            
    END OVERFØR_F7_BLANKETT;                                                    
    /* ************************************************************** */        
    OVERF_F7_BARN:PROC;                                                         
       /* *********************************************************** */        
       /* PROSEDYREN OVERFØRER OPPL. OM BARN FRA SKJERMBILDET TIL     */        
       /*    F7_TRANS_OMR I KOM_OMR.                                  */        
       /* *********************************************************** */        
       DO I = 1 TO 8 WHILE(F_FELT_PIC_CHAR11                                    
                           (F7_BLANKETT.FNR_BARN(I)) ^= (11)' ');               
                                                                                
          F7B.FNR_BARN(I) = F7_BLANKETT.FNR_BARN(I);                            
          F7B.FELLES_BARN(I) = F7_BLANKETT.FELLES_BARN(I);                      
       END;                                                                     
    END OVERF_F7_BARN;                                                          
    /* ************************************************************** */        
    FINN_FEIL_F7:PROC;                                                          
       /* *********************************************************** */        
       /*  PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRENE    */        
       /*  NÅR DET ER FEIL I DEN OVERFØRTE RECORDEN.                  */        
       /* *********************************************************** */        
       DCL ANT_BARN              FIXED BIN (15);                                
                                                                                
       FEIL_IND = 1;                                                            
                                                                                
       IF F7S.FNRNR ^= 0   &                                                    
          F7S.FNRNR ^= 999 THEN                                                 
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.FNRNR;                                 
             FEIL_IND = FEIL_IND + 1;                                           
          END;                                                                  
                                                                                
       IF F7S.TKNRNR ^= 0   &                                                   
          F7S.TKNRNR ^= 999 THEN                                                
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.TKNRNR;                                
             FEIL_IND = FEIL_IND + 1;                                           
          END;                                                                  
                                                                                
       IF F7S.TILL_EKNR ^= 0   &                                                
          F7S.TILL_EKNR ^= 999 THEN                                             
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.TILL_EKNR;                             
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
       IF F7S.BT_ANTNR ^= 0   &                                                 
          F7S.BT_ANTNR ^= 999 THEN                                              
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.BT_ANTNR;                              
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
       IF F7S.VIRK_DATO_ÅMDNR ^= 0  &                                           
          F7S.VIRK_DATO_ÅMDNR ^= 999 THEN                                       
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.VIRK_DATO_ÅMDNR;                       
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
       IF F7S.FNR_EKNR ^= 0   &                                                 
          F7S.FNR_EKNR ^= 999 THEN                                              
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.FNR_EKNR;                              
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
                                                                                
       IF F7S.PENSJONSINNTEKTNR ^= 0   &                                        
          F7S.PENSJONSINNTEKTNR ^= 999 THEN                                     
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.PENSJONSINNTEKTNR;                     
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
       IF F7S.ARBEIDSINNTEKTNR ^= 0   &                                         
          F7S.ARBEIDSINNTEKTNR ^= 999 THEN                                      
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.ARBEIDSINNTEKTNR;                      
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
       IF F7S.PENSJONSINNTEKT_EKNR ^= 0   &                                     
          F7S.PENSJONSINNTEKT_EKNR ^= 999 THEN                                  
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.PENSJONSINNTEKT_EKNR;                  
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
       IF F7S.ARBEIDSINNTEKT_EKNR ^= 0   &                                      
          F7S.ARBEIDSINNTEKT_EKNR ^= 999 THEN                                   
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = F7S.ARBEIDSINNTEKT_EKNR;                   
             IF FEIL_IND ^= 3  THEN                                             
                FEIL_IND = FEIL_IND + 1;                                        
          END;                                                                  
                                                                                
                                                                                
       DO BT_ANT   = 1 TO 8;                                                    
          IF F7B.FNR_BARNNR(BT_ANT)^= 0  &                                      
             F7B.FNR_BARNNR(BT_ANT) ^= 999 THEN                                 
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = F7B.FNR_BARNNR(BT_ANT);                 
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF F7B.FELLES_BARNNR(BT_ANT) ^= 0 &                                   
             F7B.FELLES_BARNNR(BT_ANT) ^= 999 THEN                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = F7B.FELLES_BARNNR(BT_ANT);              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
       END;                                                                     
    END FINN_FEIL_F7;                                                           
    /* ************************************************************** */        
    KONTROLL_ARBEIDSINNTEKT: PROC(W_VIRK_DATO_HÅMD);                            
       DCL W_VIRK_DATO_HÅMD   PIC '99999999';        /*2000*/                   
       DCL GRUNN_B       FIXED DEC (5) INIT (0);                                
                                                                                
       DO J = 1 TO 65;                                                          
          IF W_VIRK_DATO_HÅMD >= PERIODE_START_ÅMD(J) &                         
             W_VIRK_DATO_HÅMD <= PERIODE_SLUTT_ÅMD(J) THEN                      
             DO;                                                                
                GRUNN_B           = G_TAB_PERIODE.GRUNNBELØP(J);                
                J                 = 99;                                         
             END;                                                               
       END;                                                                     
                                                                                
       IF ^FEIL_FUNNET &                                                        
          GRUNN_B > 0  THEN                                                     
          DO;                                                                   
             IF (F7S.ARBEIDSINNTEKT_EK +                                        
                 F7S.PENSJONSINNTEKT_EK )  > GRUNN_B  THEN                      
                DO;                                                             
                   FEIL_FUNNET = '1'B;                                          
                   F7S.PENSJONSINNTEKT_EKNR =  '385';                           
                   F7S.ARBEIDSINNTEKT_EKNR =   '387';                           
               END;                                                             
          END;                                                                  
    END KONTROLL_ARBEIDSINNTEKT;                                                
    /* ************************************************************** */        
    /*          E K S T E R N E    P R O C E D U R E R                */        
    /* ************************************************************** */        
    %INCLUDE R001NC02;          /*     BLANK F7 TRANSOMR   */                   
    %INCLUDE R001NC03;          /*     KONTR F7 SØKER      */                   
    %INCLUDE R001NC04;          /*     KONTR F7 BARN       */                   
 END P112_BEHANDLE_F7;                                                          
