 /*   SIST ENDRET PÅ PROD   2006.05.10 13.07.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.20 11.07.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.46.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.34.44 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.17.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.05.25 10.44.59 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.05.25 10.44.37 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.05.06 11.08.18 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.03.15 12.06.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.12 13.47.21 AV   JDA2970          */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R0018010  - HOVEDPROGRAM                         */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : PATHAK S.                                        */        
 /*  PROGRAMMET BLE LAGET :                                                     
 /*  ENDRINGSDATO:                                                    */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* *****************  ********************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  PROGRAMMET SKRIVER UT OPPLYSNINGER I HENHOLD TIL LOVEN OM        */        
 /*                     SPORBARHET                                    */        
 /*                                                                   */        
 /*   - SENDER SKJERM-BILDE   MED ALLE OPPLYSNINGER FOR ET FNR        */        
 /*   - NØKKEL ER FNR.                                                */        
 /*                                                                   */        
 /*  PROGRAMMET ER DEL AV ADMINISTRASJONS-RUTINA                      */        
 /*                                                                   */        
 /*                                                                   */        
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE = RD81.        */        
 /*  DENNE TRANSKODE SETTES I R0010420                                */        
 /*                                                                   */        
 /*  PF7 OG PF4  FOR BLADNING                                         */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001D81: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                  
                                                                                
   DCL PLITDLI             ENTRY;                                               
   DCL  1  COMMAREA_PEKER   POINTER;                                            
   DCL KOM_OMR_PEKER          POINTER,                                          
       LOKAL_KOM_PTR            POINTER,                                        
         BMSMAPBR               POINTER,                                        
         IO_PEKER               POINTER;                                        
   %PAGE;                                                                       
   %INCLUDE P0019906;     /* TRANS_OPPL_OMRÅDE   */                             
                                                                                
   %PAGE;                                                                       
   %INCLUDE P0019908;     /*     KOM_OMR   */                                   
                                                                                
   %PAGE;                                                                       
   %INCLUDE P0019910;     /*  STYRING-OMRÅDE (BASED) */                         
                                                                                
   %PAGE;                                                                       
   %INCLUDE P0019912;     /* DIV-PARAM-OM  */                                   
                                                                                
   %PAGE;                                                                       
   %INCLUDE S001D8;    /*     MAPSETTET   */                                    
                                                                                
   %INCLUDE  P0019913;           /* LOKAL - KOM - OMRÅDE   */                   
                                                                                
   %PAGE;                                                                       
      %INCLUDE DFHBMSCA;                                                        
                                                                                
   DCL 01 DR0PERSN   BASED (IO_PEKER), /* ROOT    DR0PERSN  */                  
   %INCLUDE P0018011;                                                           
                                                                                
   DCL 01 IP_INFO BASED (IO_PEKER), /* PINNTEKT    */                           
   %INCLUDE P0018012 ;                                                          
                                                                                
   DCL 01 SB_INFO     BASED (IO_PEKER), /* SBDATE      */                       
   %INCLUDE P0018013 ;                                                          
                                                                                
   DCL 01 FNR_INFO    BASED (IO_PEKER), /* FNRENDR     */                       
   %INCLUDE P0018014 ;                                                          
                                                                                
   DCL 01 TRANS_INFO  BASED (IO_PEKER), /* TRANSHIST */                         
   %INCLUDE P0018015 ;                                                          
                                                                                
  DCL  1 Z_LINE,                                                                
         2 TEXT1                   CHAR (2) INIT ('Z '),                        
         2 F1                      CHAR (2) INIT ('  '),                        
         2 TEXT2                   CHAR (32) INIT                               
               ('                                 '),                           
         2 F11                     CHAR (2) INIT ('  '),                        
         2 SK_DATO                 PIC 'ZZZZ.ZZ.ZZ',                            
         2 F2                      CHAR (4) INIT ('    '),                      
         2 TEXT3                   CHAR (08) INIT ('IDENT:  '),                 
         2 IDENT                   CHAR (8)  INIT ('        '),                 
         2 REST                    CHAR (05) INIT ((05)' '),                    
     1 Z_DEF DEF Z_LINE            CHAR (73);                                   
                                                                                
  DCL  1 SB_LINE,                                                               
         2 TEXT1                   CHAR (2) INIT ('SB'),                        
         2 F1                      CHAR (2) INIT ('  '),                        
         2 TEXT2                   CHAR (20) INIT                               
                                ('PENSJONSBREV DATO : '),                       
         2 SK_DATO                 PIC 'ZZZZ.ZZ.ZZ',                            
         2 F2                      CHAR (4) INIT ('    '),                      
         2 TEXT3                   CHAR (10) INIT ('IDENT:    '),               
         2 IDENT                   CHAR (8)  INIT ('        '),                 
         2 REST                    CHAR (17) INIT ((17)' '),                    
     1 SB_DEF DEF SB_LINE          CHAR (73);                                   
                                                                                
  DCL  1 FN_LINE,                                                               
         2 TEXT1                   CHAR (2) INIT ('FN'),                        
         2 F1                      CHAR (2) INIT ('  '),                        
         2 TEXT2                   CHAR (25) INIT                               
                                ('FØDSELSNUMMER ENDRET FRA  '),                 
         2 FN_FRA                  PIC '(11)9'     ,                            
         2 F2                      CHAR (2) INIT ('  '),                        
         2 TEXT3                   CHAR (08) INIT ('TIL  :  '),                 
         2 FN_TIL                  PIC '(11)9'     ,                            
         2 F3                      CHAR (2) INIT ('  '),                        
         2 IDENT                   CHAR (8)  INIT ('        '),                 
         2 REST                    CHAR (2) INIT ('  '),                        
     1 FN_DEF DEF FN_LINE          CHAR (73);                                   
                                                                                
  DCL  1 FN_LINE2 ,                                                             
         2 FN2_T1                  CHAR (2) INIT ('FN'),                        
         2 F1                      CHAR (2) INIT ('  '),                        
         2 FN2_T2                  CHAR (56) INIT                               
         ('                                                        '),          
         2 F3                      CHAR (03) INIT ('  '),                       
         2 FN2_IDENT               CHAR (8)  INIT ('        '),                 
         2 REST                    CHAR (2) INIT ('  '),                        
     1 FN_DEF2 DEF FN_LINE2          CHAR (73);                                 
                                                                                
                                                                                
  DCL  1 IN_HEAD,                                                               
         2 TEXT1                   CHAR (2) INIT ('..'),                        
         2 F1                      CHAR (1) INIT ('  '),                        
         2 T2                      CHAR (10) INIT  (' END. INNT'),              
         2 F2                      CHAR (1) INIT ('  '),                        
         2 T3                      CHAR (10)INIT   ('   DATO   '),              
         2 F3                      CHAR (1) INIT (' '),                         
         2 T4                      CHAR (4) INIT (' ÅR '),                      
         2 F4                      CHAR (1) INIT (' '),                         
         2 T5                      CHAR (4) INIT ('TYPE'),                      
         2 F5                      CHAR (1) INIT (' '),                         
         2 T6                      CHAR (5) INIT ('MERKE'),                     
         2 F6                      CHAR (1) INIT (' '),                         
         2 T7                      CHAR (5) INIT ('KOMM.'),                     
         2 F7                      CHAR (1) INIT (' '),                         
         2 T8                      CHAR (8) INIT ('  IDENT '),                  
         2 F8                      CHAR (2) INIT (' '),                         
         2 T9                      CHAR (2) INIT ('FI'),                        
         2 F9                      CHAR (2) INIT (' '),                         
         2 T10                     CHAR (12) INIT ('   TIL FNR  '),             
     1 IN_HEAD_DEF DEF IN_HEAD          CHAR (73);                              
                                                                                
  DCL  1 IN_LINE,                                                               
         2 TEXT1                   CHAR (2) INIT ('IN'),                        
         2 F1                      CHAR (1) INIT (' '),                         
         2 BELØP                PIC 'ZZ.ZZZ.Z99' ,                              
         2 F2                      CHAR (1) INIT (' '),                         
         2 DATO                 PIC '9999.99.99' ,                              
         2 F3                      CHAR (1) INIT ('  '),                        
         2 ÅR                   PIC '9999' ,                                    
         2 F4                      CHAR (3) INIT ('   '),                       
         2 TYPEI                   CHAR (1) INIT (' '),                         
         2 F5                      CHAR (5) INIT ('    '),                      
         2 MERKE                   CHAR (1) INIT (' '),                         
         2 F6                      CHAR (3) INIT ('  '),                        
         2 KOMMUNE              PIC '9999' ,                                    
         2 F7                      CHAR (2) INIT ('  '),                        
         2 IDENT                   CHAR (8) INIT (' '),                         
         2 F8                      CHAR (1) INIT ('  '),                        
         2 F_KODE                  CHAR (2) INIT ('  '),                        
         2 F9                      CHAR (1) INIT ('  '),                        
         2 TIL_FNR              PIC '999999B999B99' ,                           
     1 IN_DEF DEF IN_LINE          CHAR (73);                                   
                                                                                
  DCL  1 TR_LINE,                                                               
         2 GB                      CHAR (2) INIT ('  '),                        
         2 F0                      CHAR (6) INIT ('    '),                      
         2 F1                      CHAR (6) INIT ('    '),                      
         2 REGDATO              PIC '9999.99.99' ,                              
         2 F2                      CHAR (5) INIT ('    '),                      
         2 VIRKDATO                PIC '9999.99' ,                              
         2 F3                      CHAR (5) INIT ('    '),                      
         2 IDENT                   CHAR (8)  INIT ('        '),                 
         2 REST                    CHAR (24) INIT ((24)' '),                    
     1 TR_DEF DEF TR_LINE          CHAR (73);                                   
  DCL  1 TR_HEAD,                                                               
         2 T1                        CHAR (4) INIT ('TYPE'),                    
         2 F0                      CHAR (5) INIT ('     '),                     
         2 F1                      CHAR (5) INIT ('     '),                     
         2 T2                    CHAR (10) INIT (' REG.DATO '),                 
         2 F2                      CHAR (5) INIT ('    '),                      
         2 T3                    CHAR (10) INIT ('VIRK.DATO '),                 
         2 F3                      CHAR (5) INIT ('    '),                      
         2 IDENT                   CHAR (8)  INIT (' IDENT  '),                 
         2 REST                    CHAR (21) INIT ((21)' '),                    
     1 TR_HEAD_DEF DEF TR_HEAD          CHAR (73);                              
                                                                                
                                                                                
                                                                                
 /*  DCL 1 W_OMR  BASED (EKSTRA_PEKER3), */                                     
  DCL 1 W_OMR ,                                                                 
       2 ACC_SIDE         PIC  '99',                                            
       2 MAP_SIDE         PIC  '99',                                            
       2 NY_KODE          PIC '9',                                              
       2 W_FNR          PIC '(11)9'   INIT (0),                                 
       2 W_TKNR         PIC '(4)9'   INIT (0),                                  
       2 W_NAVN         CHAR (23),                                              
       2 W_SKJERMET     CHAR (1),                                               
       2 ACC_PAGE    (10),                                                      
         3 LINJE_XX (20),                                                       
         4  DATOTID                    DEC   FIXED (15),                        
         4  VT_KEY                     DEC   FIXED ( 9),                        
         4  GR_KODE                         CHAR  ( 2),                         
         4  F_ATRI                          CHAR  ( 1),                         
         4  H_ATRI                          CHAR  ( 1),                         
         4 LINJE                            CHAR(77);                           
   /*  FLYTTE TIL DIV_PARA_METER                                                
      DCL 1 DR_SAVE,                                                            
         4  DATOTID                    DEC   FIXED (15),                        
         4  VT_KEY                     DEC   FIXED ( 9),                        
         4  GR_KODE                         CHAR  ( 2);                         
    */                                                                          
  DCL                                                                           
      QUENAME  CHAR(8),                                                         
        TERMID CHAR(4) DEF QUENAME POS(1),                                      
        REST   CHAR(4) DEF QUENAME POS(5);                                      
                                                                                
  DCL                                                                           
       L_IND BIN FIXED (15) INIT (0),                                           
       S_IND BIN FIXED (15) INIT (0),                                           
       P_KODE         PIC '9'      INIT (0),                                    
       T_KODE         PIC '9'      INIT (0),                                    
       PP             PIC '99'    INIT (0),                                     
       W_PI           PIC 'ZZZZZZZZ'  INIT (0),                                 
       W_PI_CH        CHAR (8)      ,                                           
       LENGTH                  FIXED BIN(15),                                   
       TRANSKODE_VED_START     CHAR(4),                                         
       DR_KODE                    CHAR( 1),                                     
       W_ÅR           PIC '9999'       INIT (0),                                
       W_FRAFNR       PIC '(11)9'      INIT (0),                                
       W_TILFNR       PIC '(11)9'      INIT (0),                                
       PIC_11         PIC '(11)9'      INIT (0),                                
       PIC_BIN        PIC '(11)9'      INIT (0),                                
       W_KOMMNR       PIC '9999'       INIT (0),                                
       INDEX_1                 FIXED BIN(15),                                   
       B_ART                   FIXED BIN(15) INIT ('00000011'B),                
       PIC_4                   PIC'(4)9',                                       
       PN                         DEC   FIXED ( 2),                             
       LN                         DEC   FIXED ( 2),                             
       W_DATO        PIC 'ZZZZ.ZZ.ZZ',                                          
       V_DATO        PIC 'ZZZZ.ZZ.ZZ';                                          
                                                                                
 DCL   W_DATO15       PIC '(15)9'      INIT (0),                                
       W_DATO15X DEF W_DATO15    CHAR (14) ;                                    
 DCL                                                                            
    VERIFY              BUILTIN,                                                
    CURSOR_POS           FIXED BIN(15) INIT(-1);                                
                                                                                
 DCL X_LINE                CHAR(73);                                            
 DCL TEST_DATO             CHAR(8) INIT ('ABCDEFGH');                           
                                                                                
   %INCLUDE  P0012002;                                                          
                                                                                
 /* ------------------------------------------------------------------*/        
 /* HSSR PARAMETERE                                                   */        
 /*-------------------------------------------------------------------*/        
    DCL                                                                         
        GN                   CHAR      ( 4)   INIT ('GN  '     )       ,        
        GHU                  CHAR      ( 4)   INIT ('GHU '     )       ,        
        GETT                 CHAR      ( 4)   INIT ('GHU '     )       ,        
        GNP                  CHAR      ( 4)   INIT ('GNP '     )       ,        
        TALL                 FIXED BIN (31)   INIT ( 0         )       ,        
        TRE                  FIXED BIN (31)   INIT ( 3         )       ,        
        FIRE                 FIXED BIN (31)   INIT ( 4         )       ,        
        W01_OPEN              CHAR      ( 5)    INIT ('OPEN '),                 
        W01_CLOSE             CHAR      ( 5)    INIT ('CLOSE'),                 
        SSA_DR0PERSN_UQUAL   CHAR      ( 9)   INIT ('DR0PERSN ')       ;        
                                                                                
 /*-------------------------------------------------------------------*/        
 /*     SSA                                                           */        
 /*-------------------------------------------------------------------*/        
  DCL 1 SSA2_DR0PERSN          STATIC,                                          
        2    HDEL                        CHAR (17)    INIT                      
           ('DR0PERSN(FNR     ')                ,                               
        2    REL_OP                      CHAR (2)     INIT (' =')     ,         
        2    PKEY              FIXED     DEC  (11)    INIT ( 0  )     ,         
        2    HP                          CHAR (1)     INIT (')' )     ;         
 /*-------------------------------------------------------------------*/        
  DCL 1 SSA1_DR0PERSN          STATIC,                                          
        2    HDEL                        CHAR (19)    INIT                      
           ('DR0PERSN*P(FNR     ')                ,                             
        2    REL_OP                      CHAR (2)     INIT (' =')     ,         
        2    PKEY              FIXED     DEC  (11)    INIT ( 0  )     ,         
        2    HP                          CHAR (1)     INIT (')' )     ;         
 /*-------------------------------------------------------------------*/        
 /* PCB-OMRÅDER                                                       */        
 /*-------------------------------------------------------------------*/        
    DCL 1  DR3     BASED    (DR3_PCB_PEKER),                                    
    %INCLUDE P0012003;                                 /* PCB-OMRÅDE  */        
 /*-------------------------------------------------------------------*/        
 /*   HJELPE-VARIABLE                                                 */        
 /*-------------------------------------------------------------------*/        
                                                                                
    DCL                                                                         
        END_OF_BASE          BIT          ( 1) INIT ('0'B),                     
        SEGM_NAVN            CHAR        (  8) INIT (''  ),                     
        IO_AREA              CHAR        (360) INIT (''  );                     
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
       DCL                                                                      
      (DATE, ADDR, CSTG,  STG, SUBSTR, UNSPEC,                                  
         MIN, LOW, ONCODE, NULL )  BUILTIN;                                     
                                                                                
     DCL                                                                        
       W01_PSB_NAVN                CHAR (8)       INIT('        '),             
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),                 
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
                                                                                
                                                                                
   %INCLUDE DLIUIB;                                                             
  /* **************************************************************** */        
  /*     DLI CALL-PARAMETRE                                           */        
  /* **************************************************************** */        
                                                                                
     DCL 1  W01_DLI_PARAM,                                                      
            2   W02_PARM_CT_1      FIXED BIN (31)  INIT ( 1 ),                  
            2   W02_PARM_CT_3      FIXED BIN (31)  INIT ( 3 ),                  
            2   W02_PARM_CT_4      FIXED BIN (31)  INIT ( 4 );                  
     DCL                                                                        
        FEILMELDING_SATT            BIT  (1)   INIT ('0'B),                     
        FEIL_DB               BIT       ( 1)    INIT ('0'B   );                 
                                                                                
    DCL  W_AKSJON     CHAR (2) INIT ('  ');                                     
  DCL  1 MAP_STRUC,                                                             
       2 MAP_MELDING_NR         CHAR   (5),                                     
       2 MAP_MELDING            CHAR      (78);                                 
  /* ************************************************************** */          
  /*                                                                */          
  /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */          
  /*     ---------------------------------------------------        */          
  /*                                                                */          
  /* ************************************************************** */          
   TERMID    = EIBTRMID;                                                        
   REST     = 'COMA';                                                           
                                                                                
   IF EIBCALEN = 0 THEN                                                         
      EXEC CICS READQ TS  QUEUE(QUENAME)  SET(COMMAREA_PEKER)                   
                                      LENGTH(LENGTH);                           
                                                                                
    EXEC CICS DELETEQ TS QUEUE(QUENAME) NOHANDLE;                               
                                                                                
                                                                                
                                                                                
    EXEC CICS HANDLE AID  PF7(PF7)  PF8(PF8)                                    
                    PF1(PF1)         PF3(PF3) ENTER(ENTER);                     
                                                                                
    ALLOCATE PCB_UIB_PEKER_OMR;                                                 
                                                                                
          KOM_OMR.TRANS_LISTE_PEKER =  ADDR(KOM_OMR.TRANS_LISTE_OMR);           
          KOM_OMR.TRANS_OPPL_PEKER =  ADDR(KOM_OMR.TRANS_OPPL_OMR);             
          KOM_OMR.TRANS_PEKER      =  ADDR(KOM_OMR.TRANS_OMR);                  
          KOM_OMR.STYRINGS_PEKER   =  ADDR(KOM_OMR.STYRINGS_OMR);               
          KOM_OMR.DIV_PARAM_PEKER  =  ADDR(KOM_OMR.DIV_PARAM_OMR);              
          KOM_OMR.PCB_UIB_PEKER    =  ADDR(PCB_UIB_PEKER_OMR);                  
          KOM_OMR.EKSTRA_PEKER3    =  ADDR(W_OMR);                              
          ATK_KOM_PTR           = ADDR  (KOM_OMR.ATK_COM_OMR  ) ;               
          IO_PEKER = ADDR(IO_AREA);                                             
                                                                                
      TRANSKODE_VED_START  = TRANSKODE;                                         
   /*  -------- HOVED ----------------------- */                                
    IF PROGRAM_ID = 'R0010420' !                                                
       TRANS_OPPL_OMR.TRANSKODE = 'RD80'  THEN                                  
       DO;                                                                      
          ALLOCATE LOKAL_KOM_OMR    ;                                           
          ALLOCATE S001D81O  ;                                                  
          ALLOCATE S001D81I  ;                                                  
          EXEC CICS LOAD PROGRAM ('S001D83')      ;                             
                                                                                
          S001D81I.SFNRL   =  CURSOR_POS;                                       
          S001D81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                      
          S001D81O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                     
          EXEC CICS SEND MAP('S001D81') MAPSET('S001D83')                       
                                    ERASE   CURSOR;                             
                               /*   MAPONLY CURSOR;   */                        
          ACC_SIDE = 1;                                                         
          MAP_SIDE = 1;                                                         
          NY_KODE = 0;                                                          
          PIC_11          = SEARCH_FNR;                                         
          S001D81I.SFNRI  = PIC_11    ;                                         
          PIC_BIN = S001D81I.SFNRL ;                                            
          S001D81I.SFNRL  = B_ART;                                              
                                                                                
       END;                                                                     
                                                                                
   STYRINGS_OMR.FUNKSJONSKODE = 'F';                                            
  REC_MAP:                                                                      
    IF  PROGRAM_ID = 'R0018010' &      /* DETTE PROGRAM  */                     
        TRANS_OPPL_OMR.TRANSKODE ^= 'RD80'  THEN                                
        DO;                                                                     
            EXEC CICS RECEIVE MAP('S001D81') MAPSET('S001D83')                  
                                         SET  (BMSMAPBR);                       
                                                                                
            S001D81O.MELDINGO  = '';                                            
   NEST_KONTROLL:                                                               
                                                                                
                                                                                
            IF S001D81I.FUNKSJONSKODEL > 0 &                                    
               VERIFY(S001D81I.FUNKSJONSKODEI,'RVEFZIAX') = 0 THEN              
                                                                                
             DO;                                                                
                FUNKSJONSKODE = S001D81I.FUNKSJONSKODEI;                        
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);         
             END;                                                               
   /*    ELSE                                                                   
            IF S001D81I.FUNKSJONSKODEL > 0 &                                    
               VERIFY(S001D81I.FUNKSJONSKODEI,'B') = 0 THEN                     
                                                                                
             DO;                                                                
                FUNKSJONSKODE = S001D81I.FUNKSJONSKODEI;                        
                EXEC CICS XCTL PROGRAM ('R0018020') COMMAREA (KOM_OMR);         
             END;                                                               
      */                                                                        
         END;                                                                   
                                                                                
    IF  PROGRAM_ID = 'R0018010'  !                                              
        TRANS_OPPL_OMR.TRANSKODE = 'RD80'  THEN                                 
        DO;                                                                     
             SELECT (W_AKSJON );                                                
               WHEN ('NY','  ')                                                 
                DO;                                                             
                   NY_KODE = 0;                                                 
                   CALL P005_NYFNR;                                             
                   CALL P010_SJEKK_FNR;                                         
                   IF FEILMELDING_SATT = '1'B  THEN                             
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   FEIL_DB = '0'B;                                              
                   CALL P020_DATABASE (W01_OPEN);                               
                   IF FEIL_DB = '1'B    THEN                                    
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   FEIL_DB = '0'B;                                              
                                                                                
                   CALL P50_LES_DATABASE  ;                                     
                                                                                
                   IF FEIL_DB = '1'B    THEN                                    
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   CALL P020_DATABASE (W01_CLOSE);                              
                   IF FEIL_DB = '1'B    THEN                                    
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   ACC_SIDE   = S_IND;                                          
                   MAP_SIDE = 1;                                                
                                                                                
                   CALL P090_SEND_BILDE;                                        
                                                                                
                   FEIL_DB  = '0'B;                                             
                   NY_KODE = 1;                                                 
                                                                                
                                                                                
                END;                                                            
                                                                                
               WHEN('RF')                                                       
                DO;                                                             
                                                                                
                   CALL P8_NESTESIDE;                                           
                   IF FEILMELDING_SATT = '1'B    THEN                           
                      DO;                                                       
                      CALL P120_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                   CALL P090_SEND_BILDE;                                        
                END;                                                            
                                                                                
               WHEN('RB')                                                       
                DO;                                                             
                                                                                
                   CALL P7_TILBAKE;                                             
                   IF FEILMELDING_SATT = '1'B    THEN                           
                      DO;                                                       
                      CALL P120_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                   CALL P090_SEND_BILDE;                                        
                END;                                                            
                                                                                
                                                                                
                                                                                
               WHEN('XX')                                                       
                DO;                                                             
                   PROGRAM_ID    =  'R0010301';                                 
                   TRANS_OPPL_OMR.TRANSKODE = 'RD02';                           
                   EXEC CICS XCTL PROGRAM('R0010420')                           
                                  COMMAREA (KOM_OMR);                           
                END;                                                            
               OTHERWISE                                                        
                DO;                                                             
                   S001D81O.MELDINGO = 'UGYLDIG KODE';                          
                END;                                                            
                                                                                
            END;                                                                
     END;                                                                       
                                                                                
                                                                                
  M99_RETUR:                                                                    
      PROGRAM_ID               =  'R0018010';                                   
      TRANS_OPPL_OMR.TRANSKODE = 'RD02';                                        
    IF NY_KODE = 1 THEN                                                         
        GOTO REC_MAP;                                                           
                                                                                
      EXEC CICS RETURN TRANSID(TRANSKODE)                                       
                             COMMAREA(KOM_OMR);                                 
  /*  ************************************************************ */           
  /*  RULLERING AV BILDE                                           */           
  /*  ************************************************************ */           
   PF8:                                                                         
       W_AKSJON       = 'RF';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
   PF7:                                                                         
       W_AKSJON       = 'RB';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
  /* PF12:                                                                      
       W_AKSJON       = '  ';                                                   
       MAP_MELDING   = (78)' ';                                                 
       DR_KODE = ' ';                                                           
       EXEC CICS SEND MAP('S001D81') MAPSET('S001D83')                          
                DATAONLY ERASEAUP CURSOR;                                       
                                                                                
       S001D81I.SFNRI  = SEARCH_FNR;                                            
       S001D81I.SFNRL  = B_ART;                                                 
                                                                                
         GOTO   NEST_KONTROLL;                                                  
  */                                                                            
   ENTER:                                                                       
       W_AKSJON       = '  ';                                                   
       MAP_MELDING   = (78)' ';                                                 
       CALL KONTROLL_MAP;                                                       
       IF DR_KODE = 'J'  THEN                                                   
          DO;                                                                   
            DIV_PARAM_OMR.SEARCH_FNR = W_FNR;                                   
            CALL  FORBEREDE_TRANS;                                              
            IF MAP_MELDING ^= (78) ' ' THEN                                     
               DO;                                                              
                  CALL MAP_SEND;                                                
                                                                                
               END;                                                             
             ELSE                                                               
              CALL  BYGG_TRANS;                                                 
            IF MAP_MELDING ^= (78) ' ' THEN                                     
               DO;                                                              
                   CALL MAP_SEND;                                               
                                                                                
               END;                                                             
      RETURN:                                                                   
               EXEC CICS RETURN TRANSID(TRANS_OPPL_OMR.TRANSKODE)               
                                                  COMMAREA(KOM_OMR);            
                                                                                
          END;                                                                  
       ELSE                                                                     
         GOTO   NEST_KONTROLL;                                                  
   PF3:                                                                         
       W_AKSJON       = 'XX';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
   PF1:                                                                         
      EXEC CICS SEND MAP ('S001D82') MAPSET ('S001D83')                         
                MAPONLY ERASE ;                                                 
      TRANS_OPPL_OMR.TRANSKODE = 'RD80' ;                                       
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                    
  /***********************************************/                             
  /*  FOR SETTING THE SWITCHES OF FOR NY PERSON  */                             
  /**********************************************/                              
                                                                                
  P005_NYFNR: PROC;                                                             
      CALL P091_BLANKING_RUTIN;                                                 
       FEILMELDING_SATT  = '0'B  ;                                              
                                                                                
       MAP_SIDE = 1;                                                            
       ACC_SIDE = 1;                                                            
                                                                                
          IF S001D81I.SFNRL > 0           THEN                                  
             DO;                                                                
                SEARCH_FNR     =   S001D81I.SFNRI;                              
                PIC_11         =   S001D81I.SFNRI;                              
             END;                                                               
          ELSE                                                                  
          IF SEARCH_FNR > 0  THEN                                               
             DO;                                                                
                PIC_11          = SEARCH_FNR;                                   
                S001D81I.SFNRI  = PIC_11    ;                                   
                S001D81I.SFNRL  = 3; /* FOR ACTVITER INPUT FELT  */             
             END;                                                               
  END P005_NYFNR;                                                               
                                                                                
                                                                                
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SJEKKER OM FNR GYLDIG.                                        */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL P010_SJEKK_FNR;                                          */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
   P010_SJEKK_FNR: PROC;                                                        
                                                                                
      ATK_KOM_OMR.ACF2_F_KODE               =   ' ';                            
      IF ^(S001D81I.SFNRL > 0)  THEN                                            
         DO;                                                                    
            MAP_MELDING        =  'FNR MÅ OPPGIS  !!  ';                        
            FEILMELDING_SATT   =  '1'B;                                         
         END;                                                                   
                                                                                
                                                                                
      ELSE IF ^F_NUMERISK(S001D81I.SFNRI)        THEN                           
           DO;                                                                  
              MAP_MELDING        = 'TEGN SOM IKKE ER NUMERISK ' !!              
                                       'I FØDSELSNR. ! '             ;          
              FEILMELDING_SATT   = '1'B;                                        
           END;                                                                 
                                                                                
                                                                                
      ELSE IF ^F_GYLDIG_FNR(S001D81I.SFNRI) THEN                                
           DO;                                                                  
              MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                            
              FEILMELDING_SATT   = '1'B;                                        
                                                                                
           END;                                                                 
      ELSE                                                                      
         DO;                                                                    
             SEARCH_FNR     =   S001D81I.SFNRI;                                 
             PIC_11         =   S001D81I.SFNRI;                                 
          END;                                                                  
                                                                                
 END P010_SJEKK_FNR;                                                            
                                                                                
 /* ************************************************* */                        
 /*  LESER REG (DATA BASED)                           */                        
 /*                                                   */                        
 /*                                                   */                        
 /* ************************************************* */                        
                                                                                
 P020_DATABASE: PROC  (DB_FUNK);                                                
                                                                                
                                                                                
   DCL DB_FUNK        CHAR (5);                                                 
                                                                                
       W01_PSB_NAVN  = DIV_PARAM_OMR.PSB_NAVN;                                  
       W01_PSB_NAVN  = 'B001D001';                                              
     IF DB_FUNK = 'OPEN '                         THEN                          
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_3,                
                                                  W01_PCB_FUNCTION,             
                                                  W01_PSB_NAVN,                 
                                                  UIBPTR);                      
                                                                                
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN               
             DO;                                                                
   L120 :                                                                       
                MAP_MELDING      =                                              
                 'DB-FEIL PÅ ÅPNINGSKALLET, KODE:' !!                           
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);                    
                MAP_MELDING_NR   = 500                     ;                    
                FEIL_VED_LABEL   = 'L120'                  ;                    
                FEIL_DB = '1'B;                                                 
                                                                                
             END;                                                               
           ELSE                                                                 
             DO;                                                                
                END_OF_BASE = '0'B;                                             
                PCB_UIB_PEKER_OMR.PCB_PEKER  =  UIBPCBAL   ;                    
                PCB_UIB_PEKER_OMR.UIB_PEKER  =  UIBPTR     ;                    
             END;                                                               
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_1,                
                                                  W01_TERM_FUNCTION);           
        END;                                                                    
                                                                                
 END P020_DATABASE;                                                             
                                                                                
  P7_TILBAKE: PROC;                                                             
                                                                                
     FEILMELDING_SATT   = '0'B;                                                 
     IF  MAP_SIDE > 1 THEN                                                      
        DO;                                                                     
           MAP_SIDE = MAP_SIDE - 1;                                             
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
                                                                                
           MAP_MELDING = 'DETTE ER FØRSTE SIDE     ';                           
           FEILMELDING_SATT   = '1'B;                                           
        END;                                                                    
                                                                                
  END P7_TILBAKE;                                                               
                                                                                
  P8_NESTESIDE: PROC;                                                           
                                                                                
                                                                                
     MAP_MELDING = '                                         ';                 
     FEILMELDING_SATT   = '0'B;                                                 
     MAP_SIDE = MAP_SIDE + 1;                                                   
     IF MAP_SIDE > ACC_SIDE THEN                                                
        DO;                                                                     
           MAP_MELDING = 'HAR IKKE MERE INFORMASJON';                           
           FEILMELDING_SATT   = '1'B;                                           
           MAP_SIDE = ACC_SIDE;                                                 
                                                                                
        END;                                                                    
                                                                                
                                                                                
  END P8_NESTESIDE;                                                             
                                                                                
  P110_FEILMELD: PROC;                                                          
                                                                                
          EXEC CICS SEND MAP('S001D81') MAPSET('S001D83')                       
                                    ERASE         ;                             
                                                                                
                                                                                
        S001D81I.SFNRL       =  CURSOR_POS;                                     
        S001D81O.MELDINGO  =  MAP_MELDING;                                      
        S001D81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                        
        S001D81O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                       
                                                                                
        EXEC CICS SEND MAP  ('S001D81')  MAPSET('S001D83')                      
                                                                                
                                  CURSOR DATAONLY  ;                            
                                                                                
                                                                                
        FEILMELDING_SATT = '0'B;                                                
        S001D81O.MELDINGO  =  (69)' ';                                          
                                                                                
  END P110_FEILMELD;                                                            
                                                                                
  P120_FEILMELD: PROC;                                                          
                                                                                
        PIC_11          = SEARCH_FNR;                                           
        S001D81I.SFNRI  = PIC_11    ;                                           
        S001D81I.SFNRL       =  CURSOR_POS;                                     
        S001D81O.MELDINGO  =  MAP_MELDING;                                      
        S001D81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                        
        S001D81O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                       
        EXEC CICS SEND MAP  ('S001D81')  MAPSET('S001D83')                      
                                                                                
                                  CURSOR DATAONLY  ;                            
                                                                                
                                                                                
        FEILMELDING_SATT = '0'B;                                                
        S001D81O.MELDINGO  =  (69)' ';                                          
                                                                                
  END P120_FEILMELD;                                                            
                                                                                
                                                                                
  P99_DATOREVERSE:  PROC(X_DATO);                                               
 DCL   X_DATO      PIC '(8)9';                                                  
 DCL   1 WÅRMND_DEF,                                                            
         2 WÅR             PIC '9999',                                          
         2 WMND            PIC '99',                                            
         2 WDD             PIC '99';                                            
 DCL   1 WÅRMND DEF WÅRMND_DEF  PIC '99999999';                                 
                                                                                
 DCL   1 WDMNÅR_DEF,                                                            
         2 WDD             PIC '99',                                            
         2 WMND            PIC '99',                                            
         2 WÅR             PIC '9999';                                          
 DCL   1 WDMNÅR DEF WDMNÅR_DEF  PIC '99999999';                                 
                                                                                
        WÅRMND  =    X_DATO;                                                    
        WDMNÅR_DEF.WÅR     =  WÅRMND_DEF.WÅR;                                   
        WDMNÅR_DEF.WMND    =  WÅRMND_DEF.WMND;                                  
        WDMNÅR_DEF.WDD      =  WÅRMND_DEF.WDD  ;                                
        X_DATO   =   WDMNÅR;                                                    
  END P99_DATOREVERSE;                                                          
 /*  ********************************************************** */              
 P50_LES_DATABASE: PROC ;                                                       
    SSA1_DR0PERSN.PKEY  = PIC_11;                                               
                                                                                
    GETT                    = GHU;                                              
    TALL                    = FIRE;                                             
    CALL P200_LES_DB  ;                                                         
    /* ROT FINNES IKKE I DB      */                                             
    IF DR3.STATUS_KODE   =  'GE'    !                                           
       DR3.STATUS_KODE   =  'GB'     THEN                                       
       DO;                                                                      
           FEIL_DB    =  '1'B;                                                  
           MAP_MELDING = 'DETTE FNR FINNES IKKE I DATBASEN';                    
       END;                                                                     
                                                                                
    GETT    =    GNP  ;                                                         
    TALL = TRE;                                                                 
                                                                                
    DO WHILE (^END_OF_BASE);                                                    
                                                                                
       SELECT (SEGM_NAVN);                                                      
          WHEN ('DR0PERSN')                                                     
              DO;                                                               
                  W_FNR   = DR0PERSN.FNR;                                       
                  W_NAVN  = DR0PERSN.NAVN;                                      
                  W_TKNR  = DR0PERSN.TKNR;                                      
                  W_SKJERMET = DR0PERSN.PERSN_KODE;                             
                  CALL ATK_KONTROLL;                                            
                  S_IND = 1;                           /* SIDE INDEX  */        
                  L_IND  = 0;                          /* LINJE IND   */        
                  P_KODE = 0;                                                   
                  T_KODE = 0;                                                   
              END;                                                              
          WHEN ('SBDATE  ')                                                     
              DO;                                                               
                  CALL P99_LINJE_SIFT;                                          
                  IF SB_INFO.Z_INFO = 'ZS' !                                    
                     SB_INFO.Z_INFO = 'ZR'  THEN                                
                     DO;                                                        
                        ACC_PAGE.GR_KODE (S_IND,L_IND) = 'ZB';                  
                        ACC_PAGE.DATOTID(S_IND,L_IND) = SB_DATO;                
                        ACC_PAGE.VT_KEY (S_IND,L_IND) = 0         ;             
                                                                                
                        IF SB_INFO.Z_INFO = 'ZS' THEN                           
                           Z_LINE.TEXT2 =                                       
                                    '*** STATUS OG TRANSER ER FJERNET';         
                        IF SB_INFO.Z_INFO = 'ZR' THEN                           
                           Z_LINE.TEXT2 =                                       
                                    '*****   ROT      ER FJERNET     ';         
                        Z_LINE.SK_DATO  = SB_INFO.REG_DATO;                     
                                                                                
                        Z_LINE.IDENT    = SB_INFO.BRUKER_ID;                    
                                                                                
                        ACC_PAGE.LINJE(S_IND,L_IND) = Z_DEF;                    
                     END;                                                       
                  ELSE                                                          
                     DO;                                                        
                        ACC_PAGE.GR_KODE (S_IND,L_IND) = 'SB';                  
                        ACC_PAGE.DATOTID(S_IND,L_IND) = SB_DATO;                
                        ACC_PAGE.VT_KEY (S_IND,L_IND) = 0         ;             
                                                                                
                                                                                
                        SB_LINE.SK_DATO  = SB_INFO.REG_DATO;                    
        /*        SB_LINE.SK_DATO  = TEST_DATO ;      ABEND TEST    */          
                        SB_LINE.IDENT    = SB_INFO.BRUKER_ID;                   
                        ACC_PAGE.LINJE(S_IND,L_IND) = SB_DEF;                   
                     END;                                                       
              END;                                                              
                                                                                
          WHEN ('FNEDATE ')                                                     
              DO;                                                               
                  CALL P99_LINJE_SIFT;                                          
                  ACC_PAGE.GR_KODE (S_IND,L_IND) = 'FN';                        
                  ACC_PAGE.DATOTID(S_IND,L_IND) = FN_DATOTID;                   
                  ACC_PAGE.VT_KEY (S_IND,L_IND) = 0         ;                   
                                                                                
                  IF FNR_INFO.F_KODE1 = 'R'  &                                  
                     FNR_INFO.F_KODE2 = 'F'  THEN                               
                    DO                                                          
                     FN2_T2 =                                                   
          ' ROT ER NÅ FJERNET PGA AT ALLE INNTEKTER BLI FJERNET  ';             
                       FN2_IDENT = FNR_INFO.BRUKER_ID;                          
                       ACC_PAGE.LINJE(S_IND,L_IND) = FN_DEF2;                   
                    END;                                                        
                  ELSE                                                          
                  IF FNR_INFO.F_KODE1 = 'F'  &                                  
                     FNR_INFO.F_KODE2 = 'R'  THEN                               
                    DO                                                          
                     FN2_T2 =                                                   
          ' ROT ER NÅ FJERNET PGA AT ALLE INNTEKTER ER OVERFØRT   ';            
                       FN2_IDENT = FNR_INFO.BRUKER_ID;                          
                       ACC_PAGE.LINJE(S_IND,L_IND) = FN_DEF2;                   
                    END;                                                        
                  ELSE                                                          
                  IF FNR_INFO.F_KODE1 = 'Z'  &                                  
                     FNR_INFO.F_KODE2 = 'R'  THEN                               
                    DO                                                          
                     FN2_T2 =                                                   
          ' ALLE SEGMENTER  BLIR FJERNET  MED Z RUTIN             ';            
                       FN2_IDENT = FNR_INFO.BRUKER_ID;                          
                       ACC_PAGE.LINJE(S_IND,L_IND) = FN_DEF2;                   
                    END;                                                        
                  ELSE                                                          
                  IF FNR_INFO.F_KODE1 = 'Z'  &                                  
                     FNR_INFO.F_KODE2 = 'S'  THEN                               
                    DO                                                          
                     FN2_T2 =                                                   
          ' STATUS OG BLANKETTER BLIR FJERNET MED Z RUTIN         ';            
                       FN2_IDENT = FNR_INFO.BRUKER_ID;                          
                       ACC_PAGE.LINJE(S_IND,L_IND) = FN_DEF2;                   
                    END;                                                        
                  ELSE                                                          
                    DO                                                          
                       FN_FRA     =    FNR_INFO.FRA_FNR;                        
                       FN_TIL     =    FNR_INFO.TIL_FNR;                        
                       FN_LINE.IDENT = FNR_INFO.BRUKER_ID;                      
                       ACC_PAGE.LINJE(S_IND,L_IND) = FN_DEF;                    
                    END;                                                        
                                                                                
              END;                                                              
          WHEN ('PINNTEKT')                                                     
              DO;                                                               
                 CALL P99_LINJE_SIFT;                                           
                 ACC_PAGE.GR_KODE (S_IND,L_IND) = 'PI';                         
                 ACC_PAGE.DATOTID(S_IND,L_IND) = INN_DATOTID;                   
                 ACC_PAGE.VT_KEY (S_IND,L_IND) = 0         ;                    
                                                                                
                 BELØP     = PI ; /*  * 100; SP  */                             
                 ÅR    = PI_ÅR;                                                 
                 IN_LINE.KOMMUNE  = PI_KOMMNR;                                  
                 IN_LINE.TYPEI    = PI_TYPE  ;                                  
                 IN_LINE.MERKE    = PI_MERKE ;                                  
                 IN_LINE.IDENT    = IP_INFO.BRUKER_ID;                          
                 IN_LINE.F_KODE   = IP_INFO.FJERNING_KODE;                      
                 W_TILFNR         = IP_INFO.FNRTIL       ;                      
                 IN_LINE.TIL_FNR  = W_TILFNR             ;                      
                                                                                
                 W_DATO15 =  INN_DATOTID;                                       
                 W_DATO15 = 999999999999999 - W_DATO15;                         
                 W_DATO =  SUBSTR(W_DATO15X,1,8);                               
          /*     CALL P99_DATOREVERSE (W_DATO); */                              
                                                                                
                 IN_LINE.DATO =  W_DATO               ;                         
                                                                                
                 ACC_PAGE.LINJE(S_IND,L_IND) =  IN_DEF;                         
                                                                                
              END;                                                              
                                                                                
                                                                                
          WHEN ('TRANHIST')                                                     
              DO;                                                               
                  CALL P99_LINJE_SIFT;                                          
                 ACC_PAGE.GR_KODE(S_IND,L_IND) = GRBLKODE;                      
                 ACC_PAGE.DATOTID(S_IND,L_IND) = TRANS_DATOTID;                 
                 ACC_PAGE.VT_KEY(S_IND,L_IND) = VTP_KEY;                        
                 ACC_PAGE.F_ATRI(S_IND,L_IND) =  DFHBMUNP;                      
                                                                                
                                                                                
                 TR_LINE.GB        =  TRANS_INFO.GRBLKODE;                      
                 TR_LINE.REGDATO   = TRANS_INFO.REGDATO_ÅMD ;                   
                 TR_LINE.VIRKDATO  = TRANS_INFO.VIRK_DATO_ÅMD /100;             
                 TR_LINE.IDENT     = TRANS_INFO.BRUKER_ID;                      
                                                                                
                 ACC_PAGE.LINJE(S_IND,L_IND) = TR_DEF;                          
              END;                                                              
             OTHERWISE;                                                         
           END;     /* END SELECT   */                                          
       CALL P200_LES_DB ;                                                       
                                                                                
    END;                              /*  OF WHILE (^END_OF_BASE) */            
                                                                                
 END P50_LES_DATABASE;                                                          
 /*-------------------------------------------------------------------*/        
 /*                                                                   */        
 /* MODUL FOR LESING AV DB.    (   GU / GN )                          */        
 /*                                                                   */        
 /*-------------------------------------------------------------------*/        
                                                                                
 P200_LES_DB: PROC;                                                             
                                                                                
    CALL PLITDLI                                (TALL                ,          
                                                 GETT                ,          
                                                 DR3                 ,          
                                                 IO_AREA             ,          
                                                 SSA1_DR0PERSN);                
                                                                                
    IF DR3.STATUS_KODE   =  '  '    !                                           
       DR3.STATUS_KODE   =  'GK'    !                                           
       DR3.STATUS_KODE   =  'GA'    THEN                                        
       DO;                                                                      
           SEGM_NAVN          =                 DR3.SEGM_NAVN       ;           
       END;                                                                     
    ELSE                                                                        
    IF DR3.STATUS_KODE   =  'GB'    !                                           
       DR3.STATUS_KODE   =  'GE'    THEN                                        
       DO;                                                                      
           MAP_MELDING = (75)' ' ;                                              
           END_OF_BASE = '1'B;                                                  
       END;                                                                     
                                                                                
    ELSE                                                                        
       DO;                                                                      
          MAP_MELDING  =   'FEIL VED LES I P200_LES_DB:    ' !!                 
                    'DL1-STATUS-KODE : ' !! DR3.STATUS_KODE   ;                 
                                                                                
            END_OF_BASE = '1'B;                                                 
       END;                                                                     
                                                                                
 END P200_LES_DB;                                                               
                                                                                
                                                                                
  P090_SEND_BILDE: PROC;                                                        
                                                                                
    /* *  TOMMING AV SKJERM   *  */                                             
                                                                                
         DO P = 1 TO 20;                                                        
            S001D81O.TEXTO(P) = (73) ' ' ;                                      
            S001D81O.VALGO(P) =  ' ';                                           
            S001D81O.VALGA(P) =  DFHBMPRF;                                      
            S001D81O.TEXTA(P) =  DFHBMPRO;                                      
         END;                                                                   
                                                                                
                                                                                
    /* *   MOVING DATA FRAM  WORKING OMR TO SCREEN *  */                        
                                                                                
      PP    = MAP_SIDE;                                                         
                                                                                
      DO PL = 1 TO 20;                                                          
         IF ACC_PAGE.GR_KODE (PP,PL) ^= '  ' THEN                               
            DO;                                                                 
               S001D81O.TEXTO (PL)  = ACC_PAGE.LINJE(PP,PL);                    
               S001D81O.TEXTA (PL)  = ACC_PAGE.H_ATRI(PP,PL);                   
               S001D81O.VALGA(PL)   = ACC_PAGE.F_ATRI(PP,PL);                   
            END;                                                                
         ELSE                                                                   
                                                                                
           PL = 20;                                                             
      END;                                                                      
                                                                                
                                                                                
        S001D81O.SFNRO       =  W_FNR;                                          
        S001D81I.SFNRL       =  CURSOR_POS;                                     
        S001D81O.NAVNO       =  W_NAVN;                                         
        S001D81O.TKNRO       =  W_TKNR;                                         
        S001D81O.SKJERMETO   =  W_SKJERMET;                                     
        S001D81O.MELDINGO  =  MAP_MELDING;                                      
        S001D81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                        
        S001D81O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                       
        IF   NY_KODE =  0   THEN                                                
        EXEC CICS SEND MAP('S001D81') MAPSET('S001D83') DATAONLY;               
 /*             DATAONLY ERASEAUP CURSOR; */                                    
        ELSE                                                                    
        EXEC CICS SEND MAP('S001D81') MAPSET('S001D83')                         
                                  CURSOR  DATAONLY;                             
  /*       FROM (S001D81O) CURSOR;                */                            
                                                                                
  END P090_SEND_BILDE;                                                          
                                                                                
                                                                                
                                                                                
  P091_BLANKING_RUTIN:  PROC;                                                   
                                                                                
      DO PN = 1 TO 10;                                                          
         DO LN = 1 TO 20;                                                       
                                                                                
            ACC_PAGE.GR_KODE (PN, LN) = '  ';                                   
            ACC_PAGE.VT_KEY  (PN, LN) = 0   ;                                   
            ACC_PAGE.DATOTID (PN, LN) = 0   ;                                   
            ACC_PAGE.F_ATRI  (PN, LN) =  DFHBMPRF;                              
            ACC_PAGE.H_ATRI  (PN, LN) =  DFHBMPRO;                              
            ACC_PAGE.LINJE   (PN, LN)  = (73)' ';                               
         END;                                                                   
      END;                                                                      
                                                                                
  END P091_BLANKING_RUTIN  ;                                                    
                                                                                
  P99_LINJE_SIFT: PROC;                                                         
      L_IND = L_IND + 1;                                                        
      IF SEGM_NAVN = 'PINNTEKT'   THEN                                          
         DO;                                                                    
            IF L_IND > 19  THEN                                                 
               DO;                                                              
                  S_IND = S_IND + 1;                                            
                  L_IND = 1;                                                    
               END;                                                             
            IF P_KODE = 0 THEN                                                  
               DO;                                                              
                 ACC_PAGE.GR_KODE (S_IND,L_IND) = 'XX';                         
                 ACC_PAGE.LINJE(S_IND,L_IND) = IN_HEAD_DEF;                     
                 ACC_PAGE.H_ATRI (S_IND,L_IND) = DFHPROTI;                      
                 L_IND = L_IND  + 1;                                            
                 P_KODE = 1;                                                    
               END;                                                             
         END;                                                                   
      ELSE                                                                      
                                                                                
      IF SEGM_NAVN = 'TRANHIST' THEN                                            
         DO;                                                                    
            IF L_IND > 19  THEN                                                 
               DO;                                                              
                  S_IND = S_IND + 1;                                            
                  L_IND = 1;                                                    
               END;                                                             
                                                                                
            IF T_KODE = 0 THEN                                                  
               DO;                                                              
                  ACC_PAGE.GR_KODE (S_IND,L_IND) = 'XX';                        
                  ACC_PAGE.LINJE(S_IND,L_IND) = TR_HEAD_DEF;                    
                  ACC_PAGE.H_ATRI (S_IND,L_IND) = DFHPROTI;                     
                   L_IND = L_IND  + 1;                                          
                   T_KODE = 1;                                                  
               END;                                                             
         END;                                                                   
      ELSE                                                                      
      IF L_IND > 20 THEN                                                        
         DO;                                                                    
            S_IND = S_IND + 1;                                                  
             L_IND = 1;                                                         
         END;                                                                   
  END P99_LINJE_SIFT;                                                           
                                                                                
  /* ****************************************************** */                  
  /* KONTROLL INPUT FOR BLANKET                            */                   
  /* ******************************************************* */                 
  KONTROLL_MAP: PROC;                                                           
     DR_KODE = ' ';                                                             
     DO P = 1 TO 20;                                                            
          IF S001D81O.VALGO(P) =  'S' THEN                                      
            DO;                                                                 
                TRANS_OPPL_OMR.DATOTID =                                        
                              ACC_PAGE.DATOTID(MAP_SIDE, P);                    
                                                                                
                TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD  =                             
                                 ACC_PAGE.VT_KEY(MAP_SIDE, P);                  
                TRANS_OPPL_OMR.BLANKETTYPE =                                    
                                  ACC_PAGE.GR_KODE( MAP_SIDE, P);               
                DR_KODE = 'J';                                                  
                P = 21;                                                         
                LEAVE;                                                          
            END;                                                                
                                                                                
     END;                                                                       
   FEIL_DB = '0'B;                                                              
  END KONTROLL_MAP;                                                             
                                                                                
                                                                                
 FORBEREDE_TRANS:                                                               
   PROC;                                                                        
                                                                                
     INDEX_1 = 1;                                                               
     DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                            
     PIC_11 = DIV_PARAM_OMR.SEARCH_FNR;                                         
     CALL P020_DATABASE (W01_OPEN );                                            
     CALL SJEKK_MELDING;                                                        
                                                                                
     TRANS_OPPL_OMR.FØDSNUMMER     = PIC_11;                                    
     DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '1'B;                                
                                                                                
     /*******    LES TRANS        ********* */                                  
     EXEC CICS LINK PROGRAM ('R0018021') COMMAREA(KOM_OMR);                     
                                                                                
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                                     
        DO;                                                                     
           PIC_4 = DIV_PARAM_OMR.FEIL_MELD_NR;                                  
           MAP_MELDING = 'FEIL MED DATABASEN PÅ FØRSTE KALL ' !!                
                          PIC_4 !! ' ' !! DIV_PARAM_OMR.FEIL_VED_LABEL          
                                !! ' ' !! DIV_PARAM_OMR.PROGRAM_ID;             
        END;                                                                    
                                                                                
     ELSE IF TRANS_OPPL_OMR.FØDSNUMMER = 0 THEN                                 
        MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER: ' !! PIC_11 !!               
                      ' ER IKKE I DATABASEN';                                   
                                                                                
      ELSE IF TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 0 THEN                         
         MAP_MELDING = 'DET FINNES INGEN TRANSAKSJONER TIL ' !!                 
                       'PERSONEN MED FNR: ' !! PIC_11;                          
                                                                                
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 !                                        
        TRANS_OPPL_OMR.FØDSNUMMER = 0  !                                        
        TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 0  THEN                              
           CALL P020_DATABASE ('CLOSE');                                        
                                                                                
    TRANS_OPPL_OMR.TRANSKODE = TRANSKODE_VED_START;                             
                                                                                
       PROGRAM_ID = 'R0018010' ;                                                
                                                                                
 END FORBEREDE_TRANS;                                                           
                                                                                
 SJEKK_MELDING:                                                                 
   PROC;                                                                        
     IF MAP_MELDING ^= (78) ' ' THEN                                            
         CALL MAP_SEND;                                                         
 END SJEKK_MELDING;                                                             
 /* ********************************************* */                            
 /*   BYGGE TRANS FOR QUALIFY ...............     */                            
 /* ********************************************* */                            
                                                                                
 BYGG_TRANS:                                                                    
    PROC;                                                                       
                                                                                
                                                                                
     %INCLUDE P0019913;          /* LOKAL - KOM - OMRÅDE   */                   
                                                                                
     DCL                                                                        
         LOKAL_KOM_PTR            POINTER,                                      
         SEARCH_FNR_VED_START     FIXED DEC(11),                                
         SLUTT                    BIT(1) INIT('0'B);                            
                                                                                
     ALLOCATE LOKAL_KOM_OMR;                                                    
                                                                                
     HOVED_KOM_OMR_PTR  = NULL;                                                 
     FNR_ARRAY          = 0;                                                    
     FNR_ARRAY_IND      = 1;                                                    
     FNR_ARRAY_ANT      = 0;                                                    
     TRANS_ANT          = 1;                                                    
                                                                                
     W01_NORSK_BOSATT   = '0'B;                                                 
     W01_YSKADE         = '0'B;                                                 
     DO  I = 1 TO 40;                                                           
       TRANS_LISTE.TRANS_OPPL_PTR(I)  = NULL;                                   
       TRANS_LISTE.TRANS_PTR     (I)  = NULL;                                   
     END;                                                                       
                                                                                
                                                                                
                                                                                
     DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '0'B;                                
     HOVED_KOM_OMR_PTR    = COMMAREA_PEKER;                                     
     SEARCH_FNR_VED_START = SEARCH_FNR;                                         
                                                                                
      /**  BYGGE OPP TRANS_LISTE OG FNR_ARRAY                    **/            
                                                                                
       IF ^DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS  THEN                            
          EXEC CICS LINK PROGRAM('R0010411') COMMAREA (LOKAL_KOM_OMR);          
                                                                                
       KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);                 
                                                                                
           DO;                                                                  
              CALL P020_DATABASE ('CLOSE');                                     
              ANTALL_TRANS_I_TRANS_LISTE  = TRANS_ANT;                          
              SLUTT      = '1'B;                                                
           END;                                                                 
                                                                                
                                                                                
     SEARCH_FNR  = SEARCH_FNR_VED_START;                                        
                                                                                
    /** HOVED-KOM_OMR TIL TS,   KONTROLL TIL UTLISTINGSPROGRAMMET  **/          
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                                       
                                                                                
                                                                                
    EXEC CICS WRITEQ TS QUEUE(QUENAME) FROM(KOM_OMR) MAIN;                      
    EXEC CICS XCTL PROGRAM('R0018012') COMMAREA (LOKAL_KOM_OMR);                
                                                                                
                                                                                
 END BYGG_TRANS;                                                                
 MAP_SEND:                                                                      
   PROC;                                                                        
     SELECT (TRANSKODE);                                                        
       WHEN('RD02')                                                             
         DO;                                                                    
            S001D81I.SFNRL   =  CURSOR_POS;                                     
            ATK_KOM_OMR.ACF2_F_KODE              =   ' ';                       
            S001D81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                    
            S001D81O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                   
                                                                                
            EXEC CICS SEND MAP('S001D81') MAPSET('S001D83')                     
                                      ERASE   CURSOR;                           
         END;                                                                   
       OTHERWISE                                                                
         DO;                                                                    
                 S001D81I.SFNRL   =  CURSOR_POS;                                
                 S001D81O.MELDINGO        = SUBSTR(MAP_MELDING,1,69);           
                 EXEC CICS SEND MAP('S001D81') MAPSET('S001D83');               
                 MAP_MELDING = (78)' ';                                         
         END;                                                                   
      END;  /*  SELECT   */                                                     
   END MAP_SEND;                                                                
   /* *************************************************     */                  
   /* ACF2 KONTROLL                                         */                  
   /* *************************************************     */                  
                                                                                
   ATK_KONTROLL: PROC;                                                          
                                                                                
     DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                            
     BO_TKNR = W_TKNR ;                                                         
     CALL  KONTROLL_ACF2;                                                       
     IF FEIL_MELD_NR >  0  THEN                                                 
        DO;                                                                     
           END_OF_BASE = '1'B   ;                                               
           FEIL_DB     = '1'B   ;                                               
           MAP_MELDING    =  ACF2_FEIL(FEIL_MELD_NR);                           
        END;                                                                    
     ELSE                                                                       
        IF W_SKJERMET = 'S'  THEN                                               
           DO;                                                                  
             FUNKSJONSKODE   = 'M';                                             
             CALL  KONTROLL_ACF2;                                               
             IF FEIL_MELD_NR >  0  THEN                                         
                DO;                                                             
                   END_OF_BASE = '1'B   ;                                       
                   FEIL_DB     = '1'B   ;                                       
                   MAP_MELDING    =  ACF2_FEIL(FEIL_MELD_NR);                   
                END;                                                            
           END;                                                                 
     FUNKSJONSKODE   = 'F';                                                     
   END  ATK_KONTROLL;                                                           
                                                                                
                                                                                
                                                                                
     %INCLUDE R0019904;     /*   F_GYLDIG_FNR                    */             
     %INCLUDE R0019910;     /*   F_NUMERISK                      */             
     %INCLUDE R0019956;     /*   P9956_BER_G_CICS                */             
     %INCLUDE  R0019998;   /* ATK FEIL_MELD                      */             
     %INCLUDE  R0019999;   /* ATK KONTROLL                       */             
                                                                                
 END R001D81;                                                                   
