 /*   SIST ENDRET PÅ PROD   2008.09.01  9.56.56 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2008.07.08 10.59.08 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2008.06.18 13.31.05 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 13.57.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.59.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.02.05  9.56.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.05  9.49.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.25 13.22.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.26  8.32.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.14 10.49.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.29.23 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.07 13.33.28 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.07 13.24.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.24 12.44.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.22.28 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.18 15.37.58 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.04 14.30.19 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.02 12.28.57 AV   JDA7339          */        
 /*       SIST ENDRET 26/03-99 13.25.10 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.12.58 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.40.26 AV   JDA7339                  */        
 /*IDENTIFIKASJON:                                                   */         
 /*    R0014011 - UNDERPROGRAM I PLI                                 */         
 /*    PROGRAMMERER:           HERMAN LARSSEN APRIL 1991             */         
 /*HENSIKT:                                                          */         
 /*    BEREGNE FORSØRGINGSTILLEGG - LOVGIVNING PR 1.5.91             */         
 /*    PROGRAMMET KALLES OPP NÅR DET KREVES FORSØRGINGSTILLEGG       */         
 /*    FOR EKTEFELLE OG/ELLER BARN, OG FT_SKAL_BEREGNES I FORSI      */         
 /*    ER SATT TIL 'J' (BLANKETT MED INNTEKTER ER REGISTRERT) ,      */         
 /*    ELLER FT_SKAL BEREGNES = N (GRUNNBELØPET ER BLITT HØYERE      */         
 /*    ENN DET VAR PR. APRIL 1991).                                  */         
 /*                                                                  */         
 /*    BEREGNER :                                                    */         
 /*        FULLT FORSØRGINGSTILLEGG                                  */         
 /*        INNTEKTS-REDUSERT FORSØRGINGSTILLEGG                      */         
 /*        GARANTITILLEGG                                            */         
 /*    OPPDATERER :                                                  */         
 /*        ET OG BT I ALDERSP OG UFØRPENS                            */         
 /*        BT_SÆRBARN OG GARANTITILLEGG I FORSI                      */         
 /*        SUM_YTELSE                                                */         
 /*        DIV_PARAM_OMR.FOLKETRYGD                                  */         
 /*        TILKNYTNINGSKODE OG FT_FØR_91 I TILKN                     */         
 /*        BLANKER KODEN FT_FØR_91 I TILKN, HVIS GARANTI FOR DENNE   */         
 /*                FORSØRGEDE GÅR I NULL.                            */         
 /*        BLANKER FT_SKAL_BEREGNES HVIS DET IKKE ER FORSØRGEDE IGJEN*/         
 /*                SETTER DA FT_SKAL_BEREGNES = 'D'.                 */         
 /*                                                                  */         
 /*                                                                  */         
 /*PROGRAMTILKNYTNING:                                               */         
 /*    INKLUDERES I 4001                                             */         
 /*PARAMETER : INDEKS_I_B02                                          */         
 /* **************************************************************** */         
 FORSØRG:                                                                       
 PROC (IND);                                                                    
 DCL ALDER_EK_ÅM        PIC              '(5)9';                                
 DCL ANT_REDU          FIXED DEC (3)   INIT (0);                                
 DCL ANT_TT_RED        FIXED DEC (3)   INIT (0);                                
 DCL ANT_V             FIXED DEC (3)   INIT (0);                                
 DCL ANT_W             FIXED DEC (3)   INIT (0);                                
 DCL BARN_0591         FIXED DEC (3)   INIT (0);                                
 DCL BARN_FULL         FIXED DEC (3)   INIT (0);                                
 DCL BT_PROSENT        FIXED DEC (3,2) INIT (0);    /*KONSTS*/                  
 DCL BT_PROSENT_RED    FIXED DEC (5,3) INIT (0);    /*KONSTS*/                  
 DCL BT_V              FIXED DEC (7)   INIT (0);                                
 DCL BT_W              FIXED DEC (7)   INIT (0);                                
 DCL EK_0591           CHAR      (1)   INIT (' ');                              
 DCL W_FOLKTRYGD       FIXED DEC (7)   INIT (0);                                
 DCL FOLKETRYGD_ÅR     FIXED DEC (7)   INIT (0);                                
 DCL FOLKETRYGD_EK     FIXED DEC (7)   INIT (0);                                
 DCL FOLKETRYGD_EK_ÅR  FIXED DEC (7)   INIT (0);                                
 DCL FORDELINGS_INNT   FIXED DEC (7)   INIT (0);                                
 DCL FRADRAG           FIXED DEC (7)   INIT (0);                                
 DCL FRADRAG_ET        FIXED DEC (7)   INIT (0);                                
 DCL FRIBELØP          FIXED DEC (7)   INIT (0);                                
 DCL FRIBELØP_V        FIXED DEC (7)   INIT (0);                                
 DCL FRIBELØP_W        FIXED DEC (7)   INIT (0);                                
 DCL FULL_ET           FIXED DEC (7)   INIT (0);                                
 DCL FULL_BT           FIXED DEC (7)   INIT (0);                                
 DCL FULL_TT           FIXED DEC (3)   INIT (0);                                
 DCL FULL_TT_BT        FIXED DEC (5)   INIT (0);                                
 DCL FULL_V            FIXED DEC (7)   INIT (0);                                
 DCL FULL_W            FIXED DEC (7)   INIT (0);                                
 DCL GARANTI_BARN      FIXED DEC (3)   INIT (0);                                
 DCL GARANTI_BT        FIXED DEC (7)   INIT (0);                                
 DCL GARANTI_BT_V      FIXED DEC (7)   INIT (0);                                
 DCL GARANTI_BT_W      FIXED DEC (7)   INIT (0);                                
 DCL GARANTI_EK        FIXED DEC (7)   INIT (0);                                
 DCL GARANTI_SUM       FIXED DEC (7)   INIT (0);                                
 DCL GARANTI_PENSJON   FIXED DEC (7)   INIT (0);                                
 DCL GARANTITILLEGG_EK FIXED DEC (7)   INIT (0);                                
 DCL GARANTITILLEGG    FIXED DEC (7)   INIT (0);                                
 DCL GRAD              FIXED DEC (3);                                           
 DCL W_GRAD            FIXED DEC (7,3);                                         
 DCL HJELPEFELT       FIXED DEC (13,4) INIT (0);                                
 DCL HJELP1           FIXED DEC (13,4) INIT (0);                                
 DCL HJELP2           FIXED DEC (13,4) INIT (0);                                
 DCL HJELP3           FIXED DEC (13,4) INIT (0);                                
 DCL HJELP4           FIXED DEC (13,4) INIT (0);                                
 DCL HJELP5           FIXED DEC (13,4) INIT (0);                                
 DCL HJELP6           FIXED DEC (13,4) INIT (0);                                
 DCL HJELP_BT_V       FIXED DEC (13,4) INIT (0);                                
 DCL HJELP_BT_W       FIXED DEC (13,4) INIT (0);                                
 DCL IND               FIXED BIN (15);                                          
 DCL IND_EK            FIXED BIN (15);                                          
 DCL INNTEKT           FIXED DEC (7)   INIT (0);                                
 DCL INNTEKT_V         FIXED DEC (7)   INIT (0);                                
 DCL INNTEKT_W         FIXED DEC (7)   INIT (0);                                
 DCL INNTEKT_EK        FIXED DEC (7)   INIT (0);                                
 DCL JA                     CHAR (1)  INIT ('J');                               
 DCL K                 FIXED BIN (15) INIT  (0);                                
 DCL MINSTE_GP         FIXED DEC (7)   INIT (0);                                
 DCL MINSTE_ST         FIXED DEC (7)   INIT (0);                                
 DCL MINSTEPENSJON     FIXED DEC (7)   INIT (0);                                
 DCL OMREGNET_GAR      FIXED DEC (7)   INIT (0);                                
 DCL REDUSERT_EK       FIXED DEC (7)   INIT (0);                                
 DCL REDUSERT_SB       FIXED DEC (7)   INIT (0);                                
 DCL REDUSERT_FB       FIXED DEC (7)   INIT (0);                                
 DCL REDUSERT_TOT      FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJON_ET      FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJON_BT      FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJON_FB      FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJON_SB      FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJON_BARN    FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJON_TOT     FIXED DEC (7)   INIT (0);                                
 DCL REDUKSJONS_BELØP  FIXED DEC (7)   INIT (0);                                
 DCL RETUR_ET          FIXED DEC (7)   INIT (0);                                
 DCL RETUR_BT          FIXED DEC (7)   INIT (0);                                
 DCL RETUR_SB          FIXED DEC (7)   INIT (0);                                
 DCL RETUR_FB          FIXED DEC (7)   INIT (0);                                
 DCL REGN_GARANTI      CHAR      (1)   INIT (' ');                              
 DCL TILLEGG_FØR       FIXED DEC (7)   INIT (0);                                
 DCL TILLEGG_ETTER     FIXED DEC (7)   INIT (0);                                
 DCL TILLEGGS_INNT     FIXED DEC (7)   INIT (0);                                
 DCL TILLEGGSINNT_V    FIXED DEC (7)   INIT (0);                                
 DCL TILLEGGSINNT_W    FIXED DEC (7)   INIT (0);                                
 DCL TILLEGG_V         FIXED DEC (3)   INIT (0);                                
 DCL TILLEGG_W         FIXED DEC (3)   INIT (0);                                
 DCL TOTALT_W          FIXED DEC (3)   INIT (0);                                
 DCL TOTALT_V          FIXED DEC (3)   INIT (0);                                
 DCL TP_DIFF           FIXED DEC (7)   INIT (0);                                
 DCL TP_ETTER92        FIXED DEC (7)   INIT (0);                                
 DCL TP_NY             FIXED DEC (7)   INIT (0);                                
 DCL TP1               FIXED DEC (7)   INIT (0);                                
 DCL TP2               FIXED DEC (7)   INIT (0);                                
 DCL TT_BARN           FIXED DEC (3)   INIT (0);                                
 DCL TT_FAKTOR         FIXED DEC (3)   INIT (0);                                
 DCL W_BT             FIXED DEC (13,4) INIT (0);                                
 DCL W_TP_GARANTI      FIXED DEC (7)   INIT (0);                                
 DCL ÅFT_BT            FIXED DEC (7)   INIT (0);                                
 DCL ÅFT_ET            FIXED DEC (7)   INIT (0);                                
 DCL ÅFT_FORS_TILLEGG  FIXED DEC (7)   INIT (0);                                
 DCL ÅFT_FRADRAG       FIXED DEC (7)   INIT (0);                                
 DCL ÅFT_TILLEGG       FIXED DEC (7)   INIT (0);                                
 DCL PROSENT_ST        FIXED DEC (5,2) INIT (0);                                
 DCL ST_PROSENT_E      FIXED DEC (5,2) INIT (0); /*TRUDE 080708*/               
                                                                                
                                                                                
 /* FINNE INDEX FOR EKTEFELLE ELLER SAMBOER : */                                
                                                                                
 IND_EK = 3 - IND;                                                              
                                                                                
 /* ******                                                                      
 DO I = 3 TO 13 WHILE (B02.FNR_TILKN(IND,I) > 0);                               
    IF B02.TILKNYTNINGSKODE(IND,I) = 'S'             THEN                       
       DO J = 3 TO 14 WHILE (B02.FNR(J) > 0);                                   
          IF B02.FNR_TILKN(IND,I) = B02.FNR(J)       THEN                       
             DO;                                                                
                IND_EK = J ;                                                    
                J      = 14;                                                    
             END;                                                               
       END;                                                                     
 END;                                                                           
                                                                                
  ************** */                                                             
                                                                                
 /*F  B02.VIRK_DATO_ÅM(IND) > 9400  THEN                   */                   
  IF  W_VIRK_DATO_ÅMD     > 20080499  THEN                                      
      PROSENT_ST  = 79.33;                                                      
  ELSE                                                                          
  IF  W_VIRK_DATO_ÅMD     > 19940000  THEN     /*2000*/                         
      PROSENT_ST  = ST_PROSENT_ENSLIG;  /*HL 20080825*/                         
  ELSE                                                                          
      PROSENT_ST  = ST_PROSENT_SAMST;                                           
                                                                                
                                                                                
 /* ******************************************************** */                 
 /*             HOVED-PROSEDYRE                              */                 
 /*                                                          */                 
 /*   OPPDATERER RETUR_ET, RETUR_BT OG B02.BT_SÆRKULL        */                 
 /* ******************************************************** */                 
                                                                                
 B02.GARANTITILLEGG_EK     (IND) = 0;                                           
 B02.GARANTITILLEGG_BARN   (IND) = 0;                                           
 B02.GARANTITILLEGG_SÆRBARN(IND) = 0;                                           
 B02.BT_SÆRBARN            (IND) = 0;                                           
                                                                                
 IF (B02.ANTALL_BARN(IND)    = 0     &                                          
     B02.PENSJONSTYPE2(IND) ^= 'F'     )   !                                    
     G < 35500                             THEN                                 
       DO;                                                                      
          B02.FORSI(IND)            = '';                                       
          B02.FT_SKAL_BEREGNES(IND) = 'D';                                      
                                                                                
          IF (B02.PENSJONSTYPE1(IND) = 'A' !                                    
              B02.PENSJONSTYPE1(IND) = 'K' ) THEN                               
             B02.AP_ET_NETTO(IND) = 0;                                          
 /*HVORFOR SKAL FORSI BLANKES ?????? I B01 : */                                 
                                                                                
      /*  IF B01.FT_SKAL_BEREGNES(IND) ^= ' ' THEN    */                        
      /*     DO;                                      */                        
      /*         B01.FORSI(IND)            = '';      */                        
      /*        B01.FT_SKAL_BEREGNES(IND) = 'D';      */                        
      /*     END;                                     */                        
                                                                                
 /*HAR FJERNET BLANKINGEN 5.8.96 HL */                                          
                                                                                
          GO TO P99;                                                            
       END;                                                                     
                                                                                
 CALL P1_REGN_YTELSER;                                                          
 CALL P2_TELL_FORSØRGEDE;                                                       
 CALL P3_REGN_INNT_FRIBELØP;                                                    
                                                                                
 /*9812 : */                                                                    
 IF (DIV_PARAM_OMR.TT_TEORETISK > 0    &                                        
     B02.PENSJONSTYPE1  (IND)   = 'U'    )   !                                  
    (B02.TT_PRO_RATA_MND(IND)   > 0    &                                        
     B02.PENSJONSTYPE1  (IND)   = 'A'    )   THEN                               
 /*TILLEGGSTEST 20030207 HL : */                                                
 IF  B02.PENSJONSTYPE2  (IND)   = 'F'        THEN                               
    CALL P0_EØS;                                                                
                                                                                
 IF REGN_GARANTI = ' '   THEN   /*INGEN FORSØRGET FØR 0591*/                    
    IF B02.FT_SKAL_BEREGNES(IND) = 'J'         THEN                             
       CALL P5_REGN_REDUKSJON;                                                  
    ELSE;                                                                       
 ELSE  /* DET SKAL REGNES GARANTI*/                                             
 IF B02.FT_SKAL_BEREGNES(IND) ^= 'J'        THEN                                
    DO;                                                                         
       CALL P4_REGN_GARANTISUM;                                                 
       IF (GARANTI_SUM   > W_FOLKTRYGD     )     &                              
          ((GARANTI_BT + GARANTI_EK) > 0)   THEN                                
          DO;                                                                   
             GARANTITILLEGG = GARANTI_SUM - W_FOLKTRYGD;                        
             B02.GARANTITILLEGG_BARN(IND) = GARANTITILLEGG                      
                 * GARANTI_BT / (GARANTI_BT + GARANTI_EK) + 0.5;                
             B02.GARANTITILLEGG_EK(IND) = GARANTITILLEGG                        
                 - B02.GARANTITILLEGG_BARN(IND);                                
             B02.SUM_YTELSE(IND) = B02.SUM_YTELSE(IND) +                        
                                    GARANTITILLEGG;                             
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
             B02.GARANTITILLEGG_BARN(IND) = 0;                                  
             B02.GARANTITILLEGG_EK(IND)   = 0;                                  
          END;                                                                  
    END;                                                                        
 ELSE                                                                           
    DO;                                                                         
       CALL P4_REGN_GARANTISUM;                                                 
       CALL P5_REGN_REDUKSJON;                                                  
       IF GARANTI_SUM < REDUKSJONS_BELØP     THEN                               
          DO I = 1 TO 13 WHILE(B02.FNR_TILKN(IND,I) > 0);                       
             DO J = 1 TO 14 UNTIL                                               
                  (B02.FNR_TILKN(IND,I) = B02.FNR(J));                          
             END;                                                               
             B02.GAMMEL_FT_KODE(J) = B02.FT_FØR_91(IND,I);                      
             B02.FT_FØR_91(IND,I) = ' ';                                        
               /* PROBLEMER MED VIRK_DATO=G_DATO FOR VIRK > G_DATO */           
               /* TRUDE, 280992.NY TEST PÅ OM VIRK_DATO< G_DATO    */           
       /*2000 : */                                                              
             IF B02.VIRK_DATO_ÅMD(IND) < B02.G_DATO_ÅMD(IND) THEN               
               DO;                                                              
                B02.VIRK_DATO_ÅMD(J)   =  B02.G_DATO_ÅMD(IND);                  
                B02.VIRK_DATO_ÅMD(IND) =  B02.G_DATO_ÅMD(IND);                  
                B02.VIRK_DATO_ÅMD(IND_EK) =  B02.G_DATO_ÅMD(IND);               
               END;                                                             
          END;                                                                  
       ELSE                                                                     
          CALL P6_GARANTITILLEGG;                                               
    END;                                                                        
 /* ******************************************************** */                 
 /*              SLUTT PÅ HOVEDPROSEDYRA                     */                 
 /* ******************************************************** */                 
                                                                                
                                                                                
 /* ****************************************************** */                   
 /* SÆRRUTINE FOR EØS-SAKER     9812                       */                   
 /* ****************************************************** */                   
                                                                                
 P0_EØS : PROC;                                                                 
                                                                                
    DCL TT_ANVENDT         FIXED DEC(3) INIT(0);                                
    DCL TT_ANV_TEORETISK         FIXED DEC(3) INIT(0);                          
    DCL TT_FAKTISK_NORSK   FIXED DEC(3) INIT(0);                                
    DCL PRO_RATA_SUM       FIXED DEC(3) INIT(0);                                
    DCL GRUNNPENSJON       FIXED DEC(7) INIT(0);                                
                                                                                
    HJELP1 = PROSENT_ST * 2 / 100;                                              
    TT_ANVENDT       = B02.TT_ANV(IND);                                         
    IF B02.PENSJONSTYPE1(IND) = 'A'        THEN                                 
       DO;                                                                      
          TT_ANV_TEORETISK = TT_ANVENDT;                                        
          IF B02.TT_16_66(IND) > 0          THEN                                
             TT_FAKTISK_NORSK = B02.TT_16_66(IND);                              
          ELSE                                                                  
             TT_FAKTISK_NORSK = B02.TT_ANV(IND) * 12;                           
          PRO_RATA_SUM     = TT_FAKTISK_NORSK     +                             
                             B02.TT_PRO_RATA_MND(IND);                          
          GRUNNPENSJON      = B02.ALDERSP.AP_GP_NETTO(IND);                     
       END;                                                                     
    ELSE /*UP*/                                                                 
       DO;                                                                      
          TT_ANV_TEORETISK = DIV_PARAM_OMR.TT_TEORETISK;                        
      /*  TT_FAKTISK_NORSK = DIV_PARAM_OMR.TT_NORSK_FAKTISK */                  
          TT_FAKTISK_NORSK = B02.TT_FAKTISK_NORSK_MND(IND);                     
          PRO_RATA_SUM     = TT_FAKTISK_NORSK +                                 
                             B02.TT_PRO_RATA_MND(IND);                          
          GRUNNPENSJON     = B02.UFØRPENS.GP(IND);                              
       END;                                                                     
                                                                                
    IF PRO_RATA_SUM   > 480                THEN                                 
       PRO_RATA_SUM   = 480;                                                    
                                                                                
    IF B02.BEREGN_FOLKETRYGD(IND) = 'N'   THEN                                  
       DO;                                                                      
          FULL_ET    = G * 0.5 * TT_ANV_TEORETISK                               
                       * TT_FAKTISK_NORSK                                       
                       / (PRO_RATA_SUM * 40 * 12);                              
          IF B02.INNT_PRØVET_EØS_PENS(IND) = 'J'        THEN                    
             DO;                                                                
                FRIBELØP_W =  G * (1.75 + HJELP1)                               
                             * TT_FAKTISK_NORSK                                 
                             /  PRO_RATA_SUM;                                   
                INNTEKT_W = W_FOLKTRYGD * 12 +                                  
                            (B02.ARBEIDSINNTEKT(IND) * 100  +                   
                             B02.PENSJONSINNTEKT(IND) * 100)                    
                            * TT_FAKTISK_NORSK                                  
                            / PRO_RATA_SUM;                                     
             END;                                                               
          ELSE /*IKKE INNTEKTSPRØVET PENSJON FRA EØS-LAND*/                     
             FRIBELØP_W =  G * (1.75 + HJELP1)                                  
                          * TT_ANV_TEORETISK * TT_FAKTISK_NORSK                 
                          / (PRO_RATA_SUM * 40);                                
           /*INNTEKT BLIR IKKE REGNET OM IGJEN - ER ALLEREDE OK*/               
       END;                                                                     
    ELSE /*DA ER BEREGN_FOLKETRYGD = 'J' */                                     
       DO;                                                                      
          IF B02.GUNSTIGSTE_ALTERNATIV(IND) = '2' /*EØS VINNER*/ THEN           
             DO;                                                                
                /*ET SKAL REGNES ETTER NORSKE RETTIGHETER - IKKE EØS */         
                FULL_ET = B02.ALTERNATIV_GP(IND) * 0.5;                         
                IF B02.INNT_PRØVET_EØS_PENS(IND) = 'J'        THEN              
                   DO;                                                          
                      FRIBELØP_W =  G * (1.75 + HJELP1)                         
                                           * TT_FAKTISK_NORSK                   
                                   / PRO_RATA_SUM ;                             
                      INNTEKT_W = W_FOLKTRYGD * 12 +                            
                                  (B02.ARBEIDSINNTEKT(IND) * 100  +             
                                   B02.PENSJONSINNTEKT(IND) * 100)              
                                  * TT_FAKTISK_NORSK                            
                                  / PRO_RATA_SUM;                               
                   END;                                                         
                ELSE /*IKKE INNTEKTSPRØVET EØS-PENSJON*/                        
                      FRIBELØP_W =  G * (1.75 + HJELP1)                         
                              * TT_ANVENDT / 40;                                
           /*INNTEKT BLIR IKKE REGNET OM IGJEN - ER ALLEREDE OK*/               
             END;                                                               
          ELSE /*NORSK/NORDISK VINNER*/                                         
             DO;                                                                
                FULL_ET = GRUNNPENSJON * 0.5;                                   
                IF B02.INNT_PRØVET_EØS_PENS(IND) = 'J'        THEN              
                   DO;                                                          
                      FRIBELØP_W =  G * (1.75 + HJELP1)                         
                                   * TT_FAKTISK_NORSK                           
                                   / PRO_RATA_SUM;                              
                      IF B02.ALTERNATIV_SUM_PENSJON(IND) > 0    THEN            
                         W_FOLKTRYGD = B02.ALTERNATIV_SUM_PENSJON(IND);         
                      INNTEKT_W = W_FOLKTRYGD * 12 +                            
                            (B02.ARBEIDSINNTEKT(IND) * 100  +                   
                             B02.PENSJONSINNTEKT(IND) * 100)                    
                            * TT_FAKTISK_NORSK                                  
                            / PRO_RATA_SUM;                                     
                   END;                                                         
                ELSE /*IKKE INNTEKTSPRØVET EØS_PENSJON*/                        
                      FRIBELØP_W =  G * (1.75 + HJELP1)                         
                          * TT_ANVENDT / 40;                                    
             END;                                                               
       END;                                                                     
    DIV_PARAM_OMR.FRIBELØP_MINSTE    (IND) = FRIBELØP_W;                        
    DIV_PARAM_OMR.FRIBELØP_FELLESBARN(IND) = FRIBELØP_W;                        
    DIV_PARAM_OMR.FOLKETRYGD(IND) = W_FOLKTRYGD * 12;                           
 END P0_EØS;                                                                    
                                                                                
 /* ****************************************************** */                   
 /* RUTINE FOR Å SUMMERE OPP FULLE YTELSER :               */                   
 /* OPPDATERER: DIV_PARAM_OMR.FOLKETRYGD(    )             */                   
 /* ****************************************************** */                   
                                                                                
 P1_REGN_YTELSER : PROC;                                                        
                                                                                
 IF W_VIRK_DATO_ÅMD    < 19980500  THEN  /* HL 9805     */                      
    DO;                                                                         
       BT_PROSENT = 0.25;                                                       
       BT_PROSENT_RED = 0.125;                                                  
    END;                                                                        
 ELSE                                                                           
 IF  W_VIRK_DATO_ÅMD   < 20020500  THEN  /* JD 03.2002  */                      
    DO;                                                                         
       BT_PROSENT = 0.30;                                                       
       BT_PROSENT_RED = 0.15;                                                   
    END;                                                                        
 ELSE                                                                           
    DO;                                                                         
       BT_PROSENT = 0.40;                                                       
       BT_PROSENT_RED = 0.20;                                                   
    END;                                                                        
                                                                                
 IF B02.YRKEPENS.YUG(IND)  > 0      THEN                                        
    TT_FAKTOR = 40;                                                             
 ELSE                                                                           
    TT_FAKTOR = B02.TT_ANV(IND);                                                
                                                                                
 IF TT_FAKTOR ^= 40             THEN                                            
    DO;                                                                         
       DO I = 3 TO 14;                                                          
          IF B02.PENSJONSRETT_FØR_91(I) = 'J'   &                               
             B02.STATUS_KODE_HIST(I) = ' '      THEN                            
             FULL_TT = FULL_TT + 1;                                             
       END;                                                                     
    END;                                                                        
 ELSE                                                                           
    FULL_TT = B02.ANTALL_BARN(IND);                                             
                                                                                
 FULL_TT_BT  = G * BT_PROSENT  * FULL_TT / 12 + 0.5;                            
                                                                                
 IF (B02.ANTALL_BARN(IND) - FULL_TT) > 0  THEN                                  
   DO;                                                                          
      FULL_BT = G * BT_PROSENT * (B02.ANTALL_BARN(IND) - FULL_TT)*              
                TT_FAKTOR / (40 * 12) + 0.5;                                    
   END;                                                                         
  FULL_BT = FULL_BT + FULL_TT_BT;                                               
                                                                                
 /*FULL_BT    = G * 0.25 * B02.ANTALL_BARN(IND) * B02.TT_ANV(IND)               
                          / (40 * 12) + 0.5;   TRUDE*/                          
       /* TIL HIT , TRUDE  */                                                   
                                                                                
 IF B02.PENSJONSTYPE2(IND) = 'F'  THEN                                          
  DO;                                                                           
    IF W_VIRK_DATO_ÅMD    < 19970500  THEN  /*HL 9803 */                        
       FULL_ET    = G * 0.5  * B02.TT_ANV(IND) / (40 * 12) + 0.5;               
    ELSE                                                                        
       FULL_ET    = G * 0.5  * TT_FAKTOR / (40 * 12) + 0.5;/*9803*/             
  END;                                                                          
                                                                                
 SELECT (B02.PENSJONSTYPE1(IND));                                               
                                                                                
    WHEN ('A', 'K')                                                             
       DO;                                                                      
            /*-------------------------------------------------------*/         
            /* ENDRET FRA 270892. GRAD SKAL VÆRE I FORHOLD TIL       */         
            /* BRUTTO OG NETTO YTELSE.  TRUDE                        */         
            /* SKAL VI BRUKE DESIMALER PÅ GRADEN ???                 */         
            /* ENDRET FRA 121092. NETTO_GP ^= GP                     */         
            /*-------------------------------------------------------*/         
          /* GRAD = 100;  */                                                    
          IF B02.ALDERSP.APD(IND) = 0   THEN                                    
            DO;                                                                 
             IF B02.AP_GP_NETTO(IND) ^=  B02.ALDERSP.GP(IND)  THEN              
               DO;                                                              
                 W_GRAD = B02.AP_GP_NETTO(IND) * 100 /                          
                                        B02.ALDERSP.GP(IND);                    
                 GRAD   = W_GRAD + 1;                                           
               END;                                                             
             ELSE                                                               
                 GRAD  = 100;                                                   
                                                                                
            END;    /* ENDRET TIL HIT TRUDE */                                  
          ELSE                                                                  
             GRAD = B02.ALDERSP.APD(IND);                                       
          TP_ETTER92 =  B02.AP_TP_NETTO(IND) +                                  
          /* MARTIN     B02.ALDERSP.ST(IND) + 121000 */                         
                        B02.AP_ST_NETTO(IND) +                                  
                        B02.TP_NETTO(IND);                                      
          W_FOLKTRYGD = B02.AP_GP_NETTO(IND) +                                  
                        B02.GT_TILLEGG_LOV92(IND) +                             
                        TP_ETTER92                +                             
                        B02.ALDERSP.VT_GP(IND) +                                
                        B02.ALDERSP.VT_TP(IND);                                 
          IF B02.GARANTI_TP(IND) > 0             THEN                           
             IF B02.PENSJONSTYPE2(IND) ^= 'E'    THEN                           
                DO;                                                             
                   TP_NY =                                                      
                        B02.AP_TP_NETTO(IND) +                                  
                        B02.GT_TILLEGG_LOV92(IND) +                             
          /* MARTIN     B02.ALDERSP.ST(IND) + 121000 */                         
                        B02.AP_ST_NETTO(IND) +                                  
                        B02.ALDERSP.VT_TP(IND) +                                
                        B02.TP_NETTO(IND);                                      
                                                                                
                   IF B02.GARANTI_TP(IND) > TP_NY        THEN                   
                      W_TP_GARANTI = B02.GARANTI_TP(IND);                       
                END;                                                            
       END;                                                                     
                                                                                
    WHEN ('U', 'Y')                                                             
       DO;                                                                      
          GRAD = B02.UFØRPENS.UFG(IND);                                         
          TP_ETTER92 =  B02.UFØRPENS.TP(IND) +                                  
                        B02.UFØRPENS.ST(IND) +                                  
                        B02.YRKEPENS.TP(IND) +                                  
                        B02.ETTEPENS.ST(IND) +                                  
                        B02.TP_NETTO(IND);                                      
          W_FOLKTRYGD = B02.UFØRPENS.GP(IND) +                                  
                        B02.GT_TILLEGG_LOV92(IND) +                             
                        TP_ETTER92            +                                 
                        B02.UFØRPENS.ÅFT(IND) +                                 
                        B02.YRKEPENS.GP(IND) +                                  
                        B02.GP_NETTO(IND);                                      
          IF B02.GARANTI_TP(IND) > 0             THEN                           
             IF B02.PENSJONSTYPE2(IND) ^= 'E'    THEN                           
                DO;                                                             
                   TP_NY =                                                      
                        B02.UFØRPENS.TP(IND) +                                  
                        B02.GT_TILLEGG_LOV92(IND) +                             
                        B02.UFØRPENS.ST(IND) +                                  
                        B02.UFØRPENS.ÅFT(IND) +                                 
                        B02.YRKEPENS.TP(IND) +                                  
                        B02.TP_NETTO(IND);                                      
                                                                                
                   IF B02.GARANTI_TP(IND) > TP_NY        THEN                   
                      W_TP_GARANTI = B02.GARANTI_TP(IND);                       
                END;                                                            
       END;                                                                     
                                                                                
    OTHERWISE;                                                                  
                                                                                
 END;  /*SELECT*/                                                               
                                                                                
 IF W_TP_GARANTI > 0               THEN                                         
    W_FOLKTRYGD = W_FOLKTRYGD - TP_NY + W_TP_GARANTI;                           
                                                                                
 DIV_PARAM_OMR.FOLKETRYGD(IND) = W_FOLKTRYGD * 12;                              
                                                                                
                                                                                
 /* FJERNET TEST PÅ PT2 - HL 0295 : */                                          
                                                                                
 /*  IF B02.PENSJONSTYPE2(IND) = 'S'        THEN   */                           
 SELECT (B02.PENSJONSTYPE1(IND_EK));                                            
                                                                                
    WHEN ('A', 'K')                                                             
       DO;                                                                      
          FOLKETRYGD_EK =  B02.AP_GP_NETTO(IND_EK) +                            
                           B02.GT_TILLEGG_LOV92(IND_EK) +                       
                           B02.AP_TP_NETTO(IND_EK) +                            
      /* MARTIN 121000     B02.ALDERSP.ST(IND_EK) + */                          
                           B02.AP_ST_NETTO(IND_EK) +                            
                           B02.ALDERSP.VT_GP(IND_EK) +                          
                           B02.ALDERSP.VT_TP(IND_EK);                           
                                                                                
  /*      IF B02.PENSJONSTYPE2(IND_EK) = 'N' THEN    TRUDE 240303*/             
  /*                     FOLKETRYGD_EK =  0;                     */             
          ALDER_EK_ÅM = F_ALDER((B02.FNR(IND_EK)),(W_VIRK_DATO_ÅMD));           
          IF ALDER_EK_ÅM                >  6500  &                              
            (B02.PENSJONSTYPE3(IND_EK) = 'K'  !                                 
             B02.PENSJONSTYPE3(IND_EK) = 'S'   )  THEN                          
                         FOLKETRYGD_EK =  0;                                    
       END;                                                                     
                                                                                
    WHEN ('U', 'Y')                                                             
       DO;                                                                      
          FOLKETRYGD_EK =  B02.UFØRPENS.GP(IND_EK) +                            
                           B02.GT_TILLEGG_LOV92(IND_EK) +                       
                           B02.UFØRPENS.TP(IND_EK) +                            
                           B02.UFØRPENS.ST(IND_EK) +                            
                           B02.UFØRPENS.ÅFT(IND_EK) +                           
                           B02.YRKEPENS.GP(IND_EK) +                            
                           B02.YRKEPENS.TP(IND_EK);                             
       END;                                                                     
                                                                                
    OTHERWISE;                                                                  
                                                                                
 END;  /*SELECT*/                                                               
                                                                                
 FOLKETRYGD_EK_ÅR  =  FOLKETRYGD_EK * 12;                                       
 DIV_PARAM_OMR.FOLKETRYGD(IND_EK) = FOLKETRYGD_EK_ÅR;                           
                                                                                
 /*  TT_FAKTOR = B02.TT_ANV(IND)- FLYTTES FØRST I PROSEDYREN.TRUDE*/            
                                                                                
 END P1_REGN_YTELSER;                                                           
                                                                                
 P2_TELL_FORSØRGEDE : PROC;                                                     
                                                                                
  /*REGNER OGSÅ GARANTI BARNETILLEGG, FORDELT PÅ V/W      */                    
  /*OPPDATERE KODER, NÅR DETTE IKKE KAN VÆRE GJORT FRA FØR*/                    
  /*FT_FØR_91 FOR FORSØRGET EKTEFELLE (F) OG BARN (R,L)   */                    
  /*TILKNYTNINGSKODE FOR BARN (W)                         */                    
  /*PENSJONSTYPE2    FOR BARN (W)                         */                    
                                                                                
 IF B02.FT_SKAL_BEREGNES(IND) = 'N'         THEN                                
 /* B01.FT_SKAL_BEREGNES(IND) = ' '         THEN       */                       
    DO;                                                                         
       IF B02.PENSJONSTYPE1(IND_EK) = 'F'    THEN                               
          DO J = 1 TO 13 WHILE(B02.FNR_TILKN(IND,J) > 0);                       
             IF B02.FNR(IND_EK)= B02.FNR_TILKN(IND,J) THEN                      
                DO;                                                             
                   B02.FT_FØR_91(IND,J)   = 'F';                                
                   J=13;                                                        
                END;                                                            
          END;                                                                  
       DO I = 3 TO 14 WHILE(B02.FNR(I) > 0);                                    
          DO J = 1 TO 13 WHILE(B02.FNR_TILKN(IND,J) > 0);                       
             IF B02.FNR(I) = B02.FNR_TILKN(IND,J)   THEN                        
               DO;                                                              
                 IF B02.FT_FØR_91(IND,J) = ' '     THEN                         
                   DO;                                                          
                      IF B02.PENSJONSTYPE2(I)         = 'R'   &                 
                         B02.PENSJONSTYPE2(IND_EK)    = 'M'   THEN              
                         DO;                                                    
                            B02.FT_FØR_91(IND,J)      = 'R';                    
                            B02.TILKNYTNINGSKODE(IND,J)   = 'W';                
                            B02.PENSJONSTYPE2(I)   = 'W';                       
                         END;                                                   
                      ELSE                                                      
                      IF B02.PENSJONSTYPE1(I)         = 'L'   THEN              
                         DO;                                                    
                            B02.FT_FØR_91(IND,J)   = 'L';                       
                            B02.TILKNYTNINGSKODE(IND,J)   = 'W';                
                            B02.PENSJONSTYPE2(I)   = 'W';                       
                         END;                                                   
                   END;                                                         
                 J=13;                                                          
               END;                                                             
          END;                                                                  
       END;                                                                     
    END;                                                                        
                                                                                
 /*OPPTELLING AV FORSØRGEDE FØR OG ETTER 0591*/                                 
                                                                                
                                                                                
 DO I = 1 TO 13 WHILE (B02.FNR_TILKN(IND,I) > 0);                               
                                                                                
    IF B02.FT_FØR_91(IND,I) = 'F'               THEN                            
       DO;                                                                      
          REGN_GARANTI = 'J';                                                   
          EK_0591      = 'J';                                                   
       END;                                                                     
    ELSE                                                                        
    IF B02.FT_FØR_91(IND,I) = 'L'               THEN                            
       DO;                                                                      
          REGN_GARANTI = 'J';                                                   
          BARN_FULL = BARN_FULL + 1;                                            
          BARN_0591 = BARN_0591 + 1;                                            
          IF  B02.ANTALL_BARN(IND) > FULL_TT     THEN                           
             CALL P2_TT_BARN;                                                   
          ELSE                                                                  
             TT_BARN = 40;                                                      
          IF B02.TILKNYTNINGSKODE(IND,I) = 'W'  THEN                            
             DO;                                                                
                ANT_W = ANT_W + 1;                                              
                HJELP_BT_W = HJELP_BT_W +                                       
                          34100 * TT_BARN/40 * BT_PROSENT * GRAD/100;           
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                ANT_V = ANT_V + 1;                                              
                HJELP_BT_V = HJELP_BT_V +                                       
                          34100 * TT_BARN/40 * BT_PROSENT * GRAD/100;           
             END;                                                               
       END;                                                                     
    ELSE                                                                        
    IF B02.FT_FØR_91(IND,I) = 'R'               THEN                            
       DO;                                                                      
          REGN_GARANTI = 'J';                                                   
          ANT_REDU  = ANT_REDU  + 1;                                            
          BARN_0591 = BARN_0591 + 1;                                            
          IF  B02.ANTALL_BARN(IND) > FULL_TT     THEN                           
             CALL P2_TT_BARN;                                                   
          ELSE                                                                  
             TT_BARN = 40;                                                      
          IF B02.TILKNYTNINGSKODE(IND,I) = 'W'  THEN                            
             DO;                                                                
                ANT_W = ANT_W + 1;                                              
                HJELP_BT_W = HJELP_BT_W +                                       
                  34100 * TT_BARN/40 * BT_PROSENT_RED * GRAD/100;               
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                ANT_V = ANT_V + 1;                                              
                HJELP_BT_V = HJELP_BT_V +                                       
                  34100 * TT_BARN/40 * BT_PROSENT_RED * GRAD/100;               
             END;                                                               
       END;                                                                     
    ELSE                                                                        
    IF B02.TILKNYTNINGSKODE(IND,I) = 'W'  THEN                                  
       TILLEGG_W = TILLEGG_W + 1;                                               
    ELSE                                                                        
    IF B02.TILKNYTNINGSKODE(IND,I) = 'V'  THEN                                  
       TILLEGG_V = TILLEGG_V + 1;                                               
                                                                                
 END;                                                                           
                                                                                
 GARANTI_BT_V = HJELP_BT_V / 12 + 0.5;                                          
 GARANTI_BT_W = HJELP_BT_W / 12 + 0.5;                                          
 TOTALT_W = ANT_W + TILLEGG_W;                                                  
 TOTALT_V = ANT_V + TILLEGG_V;                                                  
                                                                                
 IF (TOTALT_W + TOTALT_V) > 0      THEN                                         
    DO;                                                                         
       BT_W = FULL_BT * TOTALT_W / ( TOTALT_W + TOTALT_V) + 0.5;                
       BT_V = FULL_BT - BT_W;                                                   
    END;                                                                        
                                                                                
 P2_TT_BARN : PROC;                                                             
                                                                                
       DO K = 3 TO 14 UNTIL (B02.FNR(K) = B02.FNR_TILKN(IND,I));                
       END;                                                                     
       IF B02.PENSJONSRETT_FØR_91(K) = 'J'      THEN                            
          TT_BARN             = 40;                                             
       ELSE                                                                     
          TT_BARN             = B02.TT_ANV(IND);                                
                                                                                
 END P2_TT_BARN;                                                                
                                                                                
 END P2_TELL_FORSØRGEDE;                                                        
                                                                                
                                                                                
 /* ******************************************************** */                 
 /*PROSEDYRE FOR Å BEREGNE INNTEKT OG FRIBELØP               */                 
 /*                                                          */                 
 /* REGNER : INNTEKT, INNTEKT_EK, INNTEKT_V, INNTEKT_W,      */                 
 /*          FRIBELØP_V, FRIBELØP_W                          */                 
 /* ******************************************************** */                 
                                                                                
 P3_REGN_INNT_FRIBELØP : PROC;                                                  
                                                                                
 INNTEKT       = B02.ARBEIDSINNTEKT(IND) * 100 +                                
                 B02.PENSJONSINNTEKT(IND) * 100 + W_FOLKTRYGD * 12;             
 INNTEKT_EK    = B02.ARBEIDSINNTEKT_EK(IND) * 100 +                             
                 B02.PENSJONSINNTEKT_EK(IND) * 100;                             
 IF INNTEKT_EK > G   THEN                                                       
    INNTEKT_EK = INNTEKT_EK + FOLKETRYGD_EK_ÅR - G;                             
 ELSE                                                                           
    INNTEKT_EK = FOLKETRYGD_EK_ÅR;                                              
                                                                                
 IF TOTALT_V > 0            THEN                                                
    DO;                                                                         
       IF B02.PENSJONSTYPE2(IND) = 'F'             &                            
          B02.SIVILSTAND   (IND) = 'A'             THEN                         
          DO;                                                                   
 /*          HJELPEFELT = G * (1.75 + (PROSENT_ST * 2 /100)                     
                        + 0.25 * TOTALT_V)                                      
                       * TT_FAKTOR / 40 + 0.5;                */                
             HJELP2     = PROSENT_ST * 2 /100;                                  
             IF TOTALT_V > 1            THEN       /*9805*/                     
                HJELP3     = BT_PROSENT * (TOTALT_V - 1);                       
             HJELP4     = 2 + HJELP2 + HJELP3;                                  
             HJELP5     = G * HJELP4;                                           
             HJELP6     = HJELP5 * TT_FAKTOR/ 40 + 0.5;                         
                                                                                
             FULL_V = FULL_ET + BT_V;                                           
             FULL_W = BT_W;                                                     
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
 /*          HJELPEFELT = G * (1 + (ST_PROSENT_E / 100)                         
                        + 0.25 * TOTALT_V)                                      
                        * TT_FAKTOR / 40 + 0.5;        */                       
             IF  W_VIRK_DATO_ÅMD   > 20080499  THEN  /* TS 19.06.2008*/         
                 ST_PROSENT_E = 79.33;                                          
             ELSE                                                               
                 ST_PROSENT_E = ST_PROSENT_ENSLIG;  /*HL 20080825*/             
             HJELP2     = ST_PROSENT_E /100;                                    
             IF TOTALT_V > 1            THEN       /*9805*/                     
                HJELP3     = BT_PROSENT * (TOTALT_V - 1);                       
             HJELP4     = 1.50 + HJELP2 + HJELP3;                               
                                                                                
   /* OBS OBS  LEGGES INN ETTER OMREGNINGEN  :                 */               
   /*                                                          */               
             IF  W_VIRK_DATO_ÅMD   > 20020499  THEN  /* HL 03.2002  */          
                HJELP4 = HJELP4 + 0.35;                                         
             ELSE                                                               
             IF G > 35500 THEN            /*  LOVENDRING 1.5.92*/               
                HJELP4 = HJELP4 + 0.25;                                         
             HJELP5     = G * HJELP4;                                           
             HJELP6     = HJELP5 * TT_FAKTOR/ 40 + 0.5;                         
             FULL_V = BT_V;                                                     
             FULL_W = BT_W + FULL_ET;                                           
          END;                                                                  
       FRIBELØP_V = HJELP6;                                                     
       DIV_PARAM_OMR.FRIBELØP_SÆRBARN(IND) = FRIBELØP_V;                        
    END;                                                                        
 ELSE                                                                           
    FULL_W = BT_W + FULL_ET;                                                    
                                                                                
 IF TOTALT_W > 0 !                                                              
    FULL_ET  > 0             THEN                                               
    DO;                                                                         
 /*    HJELPEFELT = G * (1.75 + (ST_PROSENT_SAMST * 2 /100)                     
                     + 0.25 * TOTALT_W)                                         
                    * TT_FAKTOR / 40 + 0.5;                   */                
             HJELP2     = PROSENT_ST * 2 /100;                                  
             HJELP3     = BT_PROSENT * TOTALT_W;                                
             HJELP4     = 1.75 + HJELP2 + HJELP3;                               
             HJELP5     = G * HJELP4;                                           
             HJELP6     = HJELP5 * TT_FAKTOR/ 40 + 0.5;                         
       FRIBELØP_W = HJELP6;                                                     
       DIV_PARAM_OMR.FRIBELØP_FELLESBARN(IND) = FRIBELØP_W;                     
    END;                                                                        
                                                                                
 IF FRIBELØP_V > 0             &                                                
    FRIBELØP_W > 0             &                                                
    INNTEKT > FRIBELØP_V       &                                                
    INNTEKT > FRIBELØP_W             THEN                                       
    DO;                                                                         
       IF FRIBELØP_W > FRIBELØP_V                 THEN                          
             FORDELINGS_INNT = INNTEKT - FRIBELØP_W;                            
       ELSE                                                                     
             FORDELINGS_INNT = INNTEKT - FRIBELØP_V;                            
                                                                                
       HJELPEFELT      = FORDELINGS_INNT * FULL_V  /                            
                         (FULL_V + FULL_W) + 0.5;                               
       TILLEGGSINNT_V  = HJELPEFELT;                                            
       TILLEGGSINNT_W  = FORDELINGS_INNT - TILLEGGSINNT_V;                      
       INNTEKT_V = INNTEKT + TILLEGGSINNT_V - FORDELINGS_INNT;                  
       INNTEKT_W = INNTEKT + TILLEGGSINNT_W - FORDELINGS_INNT;                  
    END;                                                                        
                                                                                
 ELSE                                                                           
    DO;                                                                         
       INNTEKT_V = INNTEKT;                                                     
       INNTEKT_W = INNTEKT;                                                     
    END;                                                                        
  /* **********                                                                 
 IF FRIBELØP_V > FRIBELØP_W THEN                                                
    IF FRIBELØP_W > 0          THEN                                             
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_W;                              
    ELSE                                                                        
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_V;                              
 ELSE                                                                           
    IF FRIBELØP_V > 0          THEN                                             
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_V;                              
    ELSE                                                                        
       DIV_PARAM_OMR.FRIBELØP_MINSTE = FRIBELØP_W;                              
               ****** SLIK VAR DET . TRUDE 031091   *********   */              
  /* ********** LAGET INDEX PÅ FRIBELØPENE :   TRUDE,031091  */                 
                                                                                
 IF FRIBELØP_V > FRIBELØP_W THEN                                                
    IF FRIBELØP_W > 0          THEN                                             
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_W;                         
    ELSE                                                                        
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_V;                         
 ELSE                                                                           
    IF FRIBELØP_V > 0          THEN                                             
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_V;                         
    ELSE                                                                        
       DIV_PARAM_OMR.FRIBELØP_MINSTE(IND) = FRIBELØP_W;                         
                 /* TIL HIT 3.10.91  TRUDE */                                   
 END P3_REGN_INNT_FRIBELØP;                                                     
                                                                                
 /* ******************************************************** */                 
 /*PROSEDYRE FOR Å BEREGNE GARANTERT      FORSØRGINGSTILLEGG */                 
 /* ******************************************************** */                 
                                                                                
 P4_REGN_GARANTISUM : PROC;                                                     
                                                                                
 HJELPEFELT  = 0;                                                               
 IF W_TP_GARANTI > 0           THEN                                             
    GARANTI_PENSJON = (W_FOLKTRYGD - W_TP_GARANTI) * 34100/G + 1                
                       + W_TP_GARANTI;                                          
 ELSE                                                                           
 /* IF B02.GT_LOV92(IND) > TP_ETTER92   THEN   */                               
 IF B02.GT_LOV92(IND) > 0             THEN                                      
    DO;                                                                         
       TP1 = B02.GT_LOV92(IND) * 341/355 + 0.5;                                 
       TP2 = TP_ETTER92 * 34100/G + 0.5;                                        
       IF B02.TP_NETTO(IND) < B02.TP_BRUTTO(IND) THEN                           
          TP1 = TP1 - (B02.TP_BRUTTO(IND) - B02.TP_NETTO(IND))                  
                                  * 34100/G;                                    
       ELSE                                                                     
                                                                                
 /*TILLEGG 18.9.92 HL */                                                        
                                                                                
       IF B02.YRKEPENS.TP(IND) > 0             THEN                             
          TP1 = (B02.GT_LOV92(IND) - B02.YRKEPENS.TP(IND)) * 341/355            
                + B02.YRKEPENS.TP(IND) * 34100/G  + 0.5;                        
 /*HIT HL */                                                                    
       ELSE /*HL 6.9.93*/                                                       
       IF B02.AP_TP_NETTO(IND) < B02.ALDERSP.TP(IND)   THEN                     
          TP1 = B02.GT_LOV92(IND) * 341/355 * GRAD/100 + 0.5;                   
 /*       TP1 = TP1 - (B02.ALDERSP.TP(IND) - B02.AP_TP_NETTO(IND))              
                                  * 34100/G;                  */                
 /*GARANTIEN PÅ TP SKAL VÆRE DIFFERANSEN MELLOM GT_LOV92 OG   */                
 /*BRUTTO TP (BRUTTO_TP OMREGNET ETTER G=34100), MED FRADRAG  */                
 /*AV DET BELØP SOM FAKTISK ER TRUKKET I TILLEGGSPENSJONEN    */                
 /*       TP_TREKK = B02.ALDERSP.TP(IND) - B02.AP_TP_NETTO(IND);*/              
 /*       TP_DIFF  = TP1 - (TP_ETTER92 * 34100/G) - TP_TREKK;   */              
                                                                                
     /*HIT HL */                                                                
                                                                                
       IF TP1 > TP2 THEN                                                        
          GARANTI_PENSJON = (W_FOLKTRYGD - TP_ETTER92 -                         
                B02.GT_TILLEGG_LOV92(IND)) * 34100/G + TP1 + 1;                 
       ELSE                                                                     
          GARANTI_PENSJON = W_FOLKTRYGD * 34100/G + 1;                          
    END;                                                                        
 ELSE                                                                           
    DO;                                                                         
       GARANTI_PENSJON = W_FOLKTRYGD * 34100 / G + 1;                           
       B02.GT_TILLEGG_LOV92(IND) = 0;                                           
    END;                                                                        
                                                                                
 GARANTI_BARN = BARN_FULL + ANT_REDU;                                           
                                                                                
 IF ANT_REDU > 3 THEN                                                           
    DO;                                                                         
       BARN_FULL = BARN_FULL + ANT_REDU - 3;                                    
       ANT_REDU  = 3;                                                           
    END;                                                                        
                                                                                
 IF TT_FAKTOR ^= 40             THEN                                            
    DO;                                                                         
 /********** HL                                                                 
                                                                                
       DO I = 3 TO 14;                                                          
          IF B02.PENSJONSRETT_FØR_91(I) = 'J'   THEN                            
             FULL_TT = FULL_TT + 1;                                             
       END;                                                                     
                                                                                
  ********** */                                                                 
       ANT_TT_RED = GARANTI_BARN - FULL_TT;                                     
    END;                                                                        
                                                                                
 CALL BT_ET;                                                                    
                                                                                
 GARANTI_BT = W_BT / 12 + 0.5;                                                  
 GARANTI_EK = HJELPEFELT / (40 * 12 * 100) + 0.5;                               
                                                                                
                                                                                
 /* ******************************************************** */                 
 /*BEREGNINGEN AV ET TILLEGG TIL ÅFT - FOR Å FINNE KORREKT   */                 
 /*            UTBETALING I APRIL 1991    :                  */                 
 /* ******************************************************** */                 
                                                                                
 IF RETT_TIL_ÅFT(IND) = 'J'   THEN                                              
    DO;                                                                         
       GRAD = 100;                                                              
       CALL BT_ET;                                                              
       ÅFT_BT = W_BT / 12 + 0.5;                                                
       ÅFT_ET = HJELPEFELT / (40 * 12 * 100) + 0.5;                             
       ÅFT_FORS_TILLEGG = ÅFT_ET + ÅFT_BT - GARANTI_BT - GARANTI_EK;            
       IF B02.PENSJONSTYPE2(IND) = 'S' THEN                                     
          DO;                                                                   
             MINSTE_ST = 34100 * PROSENT_ST * TT_FAKTOR                         
                          / (100 * 40 * 12) + 0.5;                              
             MINSTE_GP = 34100 * 0.75 / 12 + 0.5;                               
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
             MINSTE_ST = 34100 * ST_PROSENT_E * TT_FAKTOR                       
                          / (100 * 40 * 12) + 0.5;                              
             MINSTE_GP = 34100 / 12 + 0.5;                                      
          END;                                                                  
       MINSTEPENSJON = MINSTE_GP + MINSTE_ST;                                   
       IF GARANTI_PENSJON > MINSTEPENSJON        THEN                           
          ÅFT_FRADRAG = GARANTI_PENSJON - MINSTEPENSJON;                        
       ELSE                                                                     
          ÅFT_FRADRAG = 0;                                                      
       ÅFT_TILLEGG = ÅFT_FORS_TILLEGG - ÅFT_FRADRAG;                            
       IF ÅFT_TILLEGG < 0     THEN                                              
          ÅFT_TILLEGG = 0;                                                      
    END;                                                                        
                                                                                
 /* ******************************************************** */                 
 /*BEREGNINGEN AV BT/ET - GARANTI                            */                 
 /* ******************************************************** */                 
                                                                                
 BT_ET : PROC;                                                                  
                                                                                
    IF ANT_TT_RED  > 0               THEN                                       
       IF ANT_REDU > 0               THEN                                       
          IF ANT_TT_RED  > ANT_REDU  THEN                                       
                                                                                
             W_BT = ((ANT_REDU * 34100 *                                        
                              BT_PROSENT_RED * TT_FAKTOR/40) +                  
                    ((ANT_TT_RED - ANT_REDU) * 34100 * BT_PROSENT *             
                       TT_FAKTOR/40)                              +             
                    ((GARANTI_BARN - ANT_TT_RED)                                
                     * 34100 * BT_PROSENT)) * GRAD / 100;                       
          ELSE                                                                  
                                                                                
             W_BT = ((ANT_TT_RED * 34100 *                                      
                               BT_PROSENT_RED * TT_FAKTOR/40)  +                
                    (ANT_REDU - ANT_TT_RED) * 34100 * BT_PROSENT_RED +          
                    ((GARANTI_BARN - ANT_REDU)                                  
                     * 34100 * BT_PROSENT)) * GRAD / 100;                       
                                                                                
       ELSE                                                                     
                                                                                
          W_BT = ((ANT_TT_RED * 34100 * BT_PROSENT * TT_FAKTOR/40)  +           
                 ((GARANTI_BARN - ANT_TT_RED)                                   
                  * 34100 * BT_PROSENT)) * GRAD / 100;                          
                                                                                
    ELSE                                                                        
                                                                                
       W_BT = ((ANT_REDU * 34100 * BT_PROSENT_RED )    +                        
                 ((GARANTI_BARN - ANT_REDU)                                     
                  * 34100 * BT_PROSENT)) * GRAD / 100;                          
                                                                                
    IF EK_0591 = 'J'                          THEN                              
       HJELPEFELT = 34100 * B02.TT_ANV(IND) * GRAD * 0.5;                       
                                                                                
 END BT_ET;                                                                     
                                                                                
   /*GARANTI_SUM ER MÅNEDSBELØP*/                                               
                                                                                
 GARANTI_SUM = GARANTI_PENSJON + GARANTI_EK + GARANTI_BT                        
               + ÅFT_TILLEGG;                                                   
                                                                                
 END P4_REGN_GARANTISUM;                                                        
                                                                                
 /* ******************************************************** */                 
 /*      PROSEDYRE FOR Å BEREGNE REDUKSJONSBELØPET           */                 
 /*                                                          */                 
 /* REGNER     : REDUKSJON_ET, REDUKSJON_FB, REDUKSJON_SB    */                 
 /* REGNER     : RETUR_ET, RETUR_FB OG RETUR_SB              */                 
 /* OPPDATERER : B02.ET, B02.BT, B02.SB OG B02.SUM_YTELSE    */                 
 /*              MED RETUR-BELØPENE                          */                 
 /* ******************************************************** */                 
                                                                                
 P5_REGN_REDUKSJON : PROC;                                                      
                                                                                
                                                                                
 IF B02.ANTALL_BARN(IND) = 0        THEN /*BARE RETUR_ET*/                      
    CALL P51_EK;                                                                
 ELSE                                                                           
    DO;                                                                         
       IF B02.PENSJONSTYPE2(IND) = 'F'           THEN                           
          IF TOTALT_V > 0                           THEN                        
             IF B02.SIVILSTAND(IND) = 'A'              THEN                     
                CALL P52_EK_V;                                                  
             ELSE                                                               
                DO;                                                             
                   CALL P55_V;                                                  
                   IF TOTALT_W > 0                           THEN               
                      CALL P53_EK_W;                                            
                   ELSE                                                         
                      CALL P51_EK;                                              
                END;                                                            
          ELSE                                                                  
          IF TOTALT_W > 0                           THEN                        
             CALL P53_EK_W;                                                     
          ELSE                                                                  
             CALL P51_EK;                                                       
       ELSE                                                                     
       IF TOTALT_W > 0                           THEN                           
          DO;                                                                   
             CALL P54_W;                                                        
             IF TOTALT_V > 0                        THEN                        
                CALL P55_V;                                                     
          END;                                                                  
       ELSE                                                                     
       IF TOTALT_V > 0                           THEN                           
          CALL P55_V;                                                           
                                                                                
    END;                                                                        
                                                                                
    /* IKKE RETT TIL ÅFT_TILLEGG NÅR BT OSV. = 0     */                         
    /* PENSJONSKTR 23.09.96 I TELF. TRUDE            */                         
                                                                                
    IF (RETUR_SB + RETUR_FB + RETUR_ET )  = 0 THEN                              
      DO;                                                                       
        GARANTI_SUM  = GARANTI_SUM - ÅFT_TILLEGG;                               
        ÅFT_TILLEGG  = 0;                                                       
      END;                                                                      
    /* TRUDE 24.09.96 */                                                        
                                                                                
    REDUKSJONS_BELØP = W_FOLKTRYGD + REDUKSJON_ET + REDUKSJON_FB                
                       + REDUKSJON_SB;                                          
                                                                                
   IF (RETUR_SB = BT_V)   &                                                     
      (BT_V > 0 )    THEN DIV_PARAM_OMR.FULLT_BT_V  = JA;                       
   IF (RETUR_FB = BT_W)   &                                                     
      (BT_W > 0 )    THEN DIV_PARAM_OMR.FULLT_BT_W  = JA;                       
   IF (RETUR_ET = FULL_ET)   &                                                  
      (FULL_ET > 0 )    THEN DIV_PARAM_OMR.FULLT_ET = JA;                       
                                                                                
   B02.BT_SÆRBARN(IND)  = RETUR_SB;                                             
   B02.SUM_YTELSE (IND) = B02.SUM_YTELSE (IND) + RETUR_SB;                      
                                                                                
 SELECT (B02.PENSJONSTYPE1(IND));                                               
                                                                                
   WHEN ('A','K')                                                               
      DO;                                                                       
         B02.SUM_YTELSE(IND) = B02.SUM_YTELSE(IND)                              
               - B02.ALDERSP.ET (IND) - B02.ALDERSP.BT(IND)                     
               + RETUR_ET             + RETUR_FB;                               
         B02.ALDERSP.ET(IND)           = FULL_ET;                               
         B02.ALDERSP.AP_ET_NETTO (IND) = RETUR_ET;                              
         B02.ALDERSP.BT (IND) = RETUR_FB;                                       
      END;                                                                      
                                                                                
   WHEN ('U','Y')                                                               
      DO;                                                                       
         B02.SUM_YTELSE (IND) = B02.SUM_YTELSE (IND)                            
               - B02.UFØRPENS.ET (IND) - B02.UFØRPENS.BT(IND)                   
                                       - B02.YRKEPENS.BT(IND)                   
               + RETUR_ET             + RETUR_FB;                               
         B02.UFØRPENS.ET(IND) = RETUR_ET;                                       
         B02.UFØRPENS.BT(IND) = RETUR_FB;                                       
         B02.YRKEPENS.BT(IND) = 0;                                              
      END;                                                                      
                                                                                
 END; /*SELECT*/                                                                
                                                                                
 P51_EK : PROC;      /*RETUR_ET OG REDUKSJON_ET*/                               
                                                                                
  IF INNTEKT_W > FRIBELØP_W            THEN                                     
     DO;                                                                        
        FRADRAG = (INNTEKT_W - FRIBELØP_W) * 0.5;                               
        FRADRAG = FRADRAG / 12;                                                 
        IF FULL_ET    > FRADRAG         THEN                                    
           RETUR_ET = FULL_ET - FRADRAG;                                        
     END;                                                                       
  ELSE                                                                          
     RETUR_ET = FULL_ET;                                                        
                                                                                
  IF EK_0591 = 'J'     THEN                                                     
     REDUKSJON_ET = RETUR_ET;                                                   
                                                                                
 END P51_EK;                                                                    
                                                                                
 P52_EK_V : PROC;/*RETUR_EK,RETUR_SB,REDUKSJON_EK OG REDUKSJON_SB*/             
                 /*EKTEFELLETILLEGGET REGNES SAMMEN MED SÆRK.BARN*/             
                                                                                
  IF INNTEKT_V > FRIBELØP_V          THEN                                       
     DO;                                                                        
        FRADRAG = (INNTEKT_V - FRIBELØP_V) / (12 * 2);                          
        TILLEGG_FØR  = FULL_ET + BT_V;                                          
        IF TILLEGG_FØR  > FRADRAG         THEN                                  
           DO;                                                                  
              HJELPEFELT = FRADRAG * FULL_ET /                                  
                                (FULL_ET + BT_V) + 0.5;                         
              FRADRAG_ET = HJELPEFELT;                                          
              RETUR_ET = FULL_ET - FRADRAG_ET;                                  
              RETUR_SB = BT_V - FRADRAG + FRADRAG_ET;                           
           END;                                                                 
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        RETUR_ET = FULL_ET;                                                     
        RETUR_SB = BT_V;                                                        
     END;                                                                       
                                                                                
  IF EK_0591 = 'J'                            THEN                              
     REDUKSJON_ET = RETUR_ET;                                                   
                                                                                
  IF TILLEGG_V > 0 THEN                                                         
     DO;                                                                        
        HJELPEFELT   = RETUR_SB * ANT_V / TOTALT_V + 0.5;                       
        REDUKSJON_SB = HJELPEFELT;                                              
     END;                                                                       
  ELSE                                                                          
     REDUKSJON_SB = RETUR_SB;                                                   
                                                                                
 END P52_EK_V;                                                                  
                                                                                
 P53_EK_W : PROC;/*RETUR_ET,RETUR_FB,REDUKSJON_EK OG REDUKSJON_FB*/             
                 /*EKTEFELLETILLEGGET REGNES SAMMEN MED FELLESBARN*/            
                                                                                
  IF INNTEKT_W > FRIBELØP_W          THEN                                       
     DO;                                                                        
        FRADRAG = (INNTEKT_W - FRIBELØP_W) / (12 * 2);                          
        TILLEGG_FØR  = FULL_ET + BT_W;                                          
        IF TILLEGG_FØR  > FRADRAG         THEN                                  
           DO;                                                                  
              HJELPEFELT = FRADRAG * FULL_ET /                                  
                                (FULL_ET + BT_W) + 0.5;                         
              FRADRAG_ET = HJELPEFELT;                                          
              RETUR_ET = FULL_ET - FRADRAG_ET;                                  
              RETUR_FB = BT_W - FRADRAG + FRADRAG_ET;                           
           END;                                                                 
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        RETUR_ET = FULL_ET;                                                     
        RETUR_FB = BT_W;                                                        
     END;                                                                       
                                                                                
  IF EK_0591 = 'J'                            THEN                              
     REDUKSJON_ET = RETUR_ET;                                                   
                                                                                
  IF TILLEGG_W > 0 THEN                                                         
     DO;                                                                        
        HJELPEFELT   = RETUR_FB * ANT_W / TOTALT_W + 0.5;                       
        REDUKSJON_FB = HJELPEFELT;                                              
     END;                                                                       
  ELSE                                                                          
     REDUKSJON_FB = RETUR_FB;                                                   
                                                                                
 END P53_EK_W;                                                                  
                                                                                
 P54_W : PROC; /* RETUR_FB OG REDUKSJON_FB */                                   
               /* FELLESBARN, IKKE TILLEGG EKTEFELLE*/                          
                                                                                
  FRADRAG = (INNTEKT_W + INNTEKT_EK - FRIBELØP_W)/(12 * 2);                     
  IF FRADRAG > 0              THEN                                              
     IF BT_W > FRADRAG              THEN                                        
        RETUR_FB = BT_W - FRADRAG;                                              
     ELSE;                                                                      
                                                                                
  ELSE RETUR_FB = BT_W;                                                         
                                                                                
  IF TILLEGG_W > 0 THEN                                                         
     DO;                                                                        
        HJELPEFELT   = RETUR_FB * ANT_W / TOTALT_W + 0.5;                       
        REDUKSJON_FB = HJELPEFELT;                                              
     END;                                                                       
  ELSE                                                                          
     REDUKSJON_FB = RETUR_FB;                                                   
                                                                                
 END P54_W;                                                                     
                                                                                
 P55_V : PROC; /* RETUR_SB OG REDUKSJON_SB */                                   
               /* SÆRKULLSBARN */                                               
                                                                                
  IF INNTEKT_V > FRIBELØP_V          THEN                                       
     DO;                                                                        
        FRADRAG = (INNTEKT_V - FRIBELØP_V)/(12 * 2);                            
        IF BT_V > FRADRAG              THEN                                     
           RETUR_SB = BT_V - FRADRAG;                                           
     END;                                                                       
  ELSE                                                                          
     RETUR_SB = BT_V;                                                           
                                                                                
  IF TILLEGG_V > 0 THEN                                                         
     DO;                                                                        
        HJELPEFELT   = RETUR_SB * ANT_V / TOTALT_V + 0.5;                       
        REDUKSJON_SB = HJELPEFELT;                                              
     END;                                                                       
  ELSE                                                                          
     REDUKSJON_SB = RETUR_SB;                                                   
                                                                                
 END P55_V;                                                                     
                                                                                
 END P5_REGN_REDUKSJON;                                                         
                                                                                
                                                                                
 /* ******************************************************** */                 
 /*PROSEDYRE FOR Å BEREGNE OG FORDELE GARANTITILLEGGET       */                 
 /*                                                          */                 
 /* REGNER: B02.GARANTITILLEGG_EK, B02.GARANTITILLEGG_BARN OG*/                 
 /*         B02.GARANTITILLEGG_SÆRBARN                      */                  
 /* ******************************************************** */                 
                                                                                
 P6_GARANTITILLEGG : PROC;                                                      
                                                                                
  GARANTITILLEGG       = GARANTI_SUM - REDUKSJONS_BELØP;                        
  B02.SUM_YTELSE (IND) =  B02.SUM_YTELSE(IND) + GARANTITILLEGG;                 
  IF ÅFT_TILLEGG > 0        THEN                                                
     DO;                                                                        
        IF ÅFT_TILLEGG > GARANTITILLEGG    THEN                                 
           DO;                                                                  
              B02.ÅFT(IND)   = B02.ÅFT(IND) + GARANTITILLEGG;                   
              GARANTITILLEGG = 0;                                               
           END;                                                                 
        ELSE                                                                    
           DO;                                                                  
              B02.ÅFT(IND)   = B02.ÅFT(IND) + ÅFT_TILLEGG;                      
              GARANTITILLEGG = GARANTITILLEGG - ÅFT_TILLEGG;                    
           END;                                                                 
     END;                                                                       
  REDUSERT_EK = GARANTI_EK - REDUKSJON_ET;                                      
                                                                                
 /*NY BEREGNING AV FORDELING AV GARANTI - HL 25.9.92 : */                       
                                                                                
 /* ********************************                                            
  IF BARN_0591 > 0 THEN                                                         
     HJELPEFELT  = GARANTI_BT * ANT_W/BARN_0591 + 0.5                           
                   - REDUKSJON_FB                                               
  ELSE                                                                          
     HJELPEFELT = 0                                                             
  REDUSERT_FB = HJELPEFELT                                                      
  REDUSERT_SB = GARANTI_BT - REDUKSJON_SB - REDUSERT_FB - REDUKSJON_FB          
                                                                                
    ************************************************* */                        
                                                                                
  REDUSERT_FB = GARANTI_BT_W - REDUKSJON_FB;                                    
  REDUSERT_SB = GARANTI_BT_V - REDUKSJON_SB;                                    
                                                                                
 /* HIT HL */                                                                   
                                                                                
  REDUSERT_TOT = REDUSERT_EK + REDUSERT_FB + REDUSERT_SB;                       
  IF REDUSERT_EK > 0                  THEN                                      
     DO;                                                                        
        B02.GARANTITILLEGG_EK(IND) =                                            
            GARANTITILLEGG * REDUSERT_EK/REDUSERT_TOT + 0.5;                    
        IF REDUSERT_FB > 0               THEN                                   
           IF REDUSERT_SB > 0            THEN                                   
              DO;                                                               
                 B02.GARANTITILLEGG_BARN(IND)= GARANTITILLEGG                   
                  * REDUSERT_FB/REDUSERT_TOT + 0.5;                             
                 B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG               
                           - B02.GARANTITILLEGG_EK(IND)                         
                           - B02.GARANTITILLEGG_BARN(IND);                      
              END;                                                              
           ELSE                                                                 
              B02.GARANTITILLEGG_BARN(IND) = GARANTITILLEGG                     
                           - B02.GARANTITILLEGG_EK(IND);                        
        ELSE                                                                    
        IF REDUSERT_SB > 0 THEN                                                 
           B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG                     
                           - B02.GARANTITILLEGG_EK(IND);                        
     END;                                                                       
  ELSE                                                                          
     IF REDUSERT_FB > 0               THEN                                      
        IF REDUSERT_SB > 0            THEN                                      
           DO;                                                                  
              B02.GARANTITILLEGG_BARN(IND)= GARANTITILLEGG                      
                  * REDUSERT_FB/REDUSERT_TOT + 0.5;                             
              B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG                  
                           - B02.GARANTITILLEGG_BARN(IND);                      
           END;                                                                 
        ELSE                                                                    
           B02.GARANTITILLEGG_BARN(IND) = GARANTITILLEGG;                       
     ELSE                                                                       
        B02.GARANTITILLEGG_SÆRBARN(IND) = GARANTITILLEGG;                       
                                                                                
 END P6_GARANTITILLEGG;                                                         
                                                                                
 P99 :                                                                          
                                                                                
                                                                                
 END FORSØRG;                                                                   
