 /*       SIST ENDRET 04/05-98 14.12.24 AV   JDA7339                  */00000000
 /*       SIST ENDRET 19/01-98 11.22.55 AV   SPA7339                  */00000010
                                                                        00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R00104AP  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000070
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000080
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*HENSIKT:                                                           */00000120
 /* **********                                                        */00000130
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000140
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000150
 /*    FORHÅND.                                                       */00000160
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*PROGRAMTILKNYTTING:                                                */00000200
 /* ********************                                              */00000210
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000220
 /*                                                                   */00000230
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000240
 /*    BRUK :                                                         */00000250
 /*    EXEC CICS XCTL PROGRAM ('R00104AP') COMMAREA(KOM_OMR);         */00000260
 /*    PROGRAMMET INCLUDER :                                          */00000270
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    AP       */00000280
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       AP       */00000290
 /* ***************************************************************** */00000300
 /*DATASETTOPPLYSNINGER:                                              */00000310
 /* ***********************                                           */00000320
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
 /*FEILMELDINGER:                                                     */00000360
 /* *******************                                               */00000370
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000380
 /*                                                                   */00000390
 /* ***************************************************************** */00000400
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000410
                                                                        00000420
          %INCLUDE P0019906;                                            00000430
          %INCLUDE P0019908;                                            00000440
          %INCLUDE P0019910;                                            00000450
          %INCLUDE P0019912;                                            00000460
          %INCLUDE P0019913;                                            00000470
                                                                        00000480
 DCL                                                                    00000490
      (CSTG, ADDR)                   BUILTIN;                           00000500
 DCL  COMMAREA_PEKER         PTR,                                       00000510
      LOKAL_KOM_PTR          PTR;                                       00000520
                                                                        00000530
                                                                        00000540
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000550
 DCL                                                                    00000560
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000570
    DFHBMUNP             CHAR(1) INIT(' '),                             00000580
    DFHBMBRY             CHAR(1) INIT('H'),                             00000590
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000600
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000610
    MELDING6O            CHAR(10),                                      00000620
    YMELDING6O           CHAR(10);                                      00000630
                                                                        00000640
          %INCLUDE S001F1  ;                                            00000650
          %INCLUDE P0010501;                                            00000660
                                                                        00000670
                                                                        00000680
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000690
                                                                        00000700
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000710
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000720
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000730
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000740
                                                                        00000750
                                                                        00000760
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000770
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000780
                                                                        00000790
                                                                        00000800
           CALL OVERFØR_APSØKER_MAP;                /* R0010506 */      00000810
           IF APS.NORSK_BOSATT = 'N' THEN                               00000820
              DO;                                                       00000830
                 CALL TEKST_SPES;                   /* R0010507 */      00000840
                 CALL OVERFØR_APSPES_MAP;           /* R0010506 */      00000850
              END;                                                      00000860
           IF APS.BT_ANT > 0 THEN                                       00000870
              DO;                                                       00000880
                 CALL TEKST_BARN;                   /* R0010507 */      00000890
                 CALL OVERFØR_APBARN_MAP;           /* R0010506 */      00000900
              END;                                                      00000910
           S001051O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000920
                                                                        00000930
       /*  FREE TRANS_OMR,TRANS_OPPL_OMR;  */                           00000940
                                                                        00000950
      EXEC CICS RETURN;                                                 00000960
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000970
      PROC(FIXED_DEC_5);                                                00000980
                                                                        00000990
      DCL                                                               00001000
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001010
                                                                        00001020
   END SKRIV_FEIL;                                                      00001030
                                                                        00001040
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001050
                                                                        00001060
           DCL                                                          00001070
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001080
                                                                        00001090
        END SKRIV_FEIL_YP;                                              00001100
                                                                        00001110
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001120
                                                                        00001130
           DCL                                                          00001140
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001150
                                                                        00001160
        END SKRIV_FEIL_SP;                                              00001170
                                                                        00001180
          %INCLUDE R0019912;                                            00001190
          %INCLUDE R0010506;                                            00001200
          %INCLUDE R0010507;                                            00001210
          %INCLUDE R0019988;                       /* KONV_HÅMD-ÅMD  */ 00001220
          %INCLUDE R0019989;                       /* KONV_HÅMD-MÅ   */ 00001230
                                                                        00001240
 END R001041;                                                           00001250
