 /*   SIST ENDRET PÅ PROD   2001.02.07 12.57.34 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.05.03 13.11.34 AV   JDA7339          */        
 /*       SIST ENDRET 25/08-99 08.31.22 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.25.37 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.24.44 AV   JDA7339                  */        
 /*       SIST ENDRET 22/12-98 08.51.06 AV   JDA7339                  */        
 /*       SIST ENDRET 22/12-98 08.49.05 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.58.45 AV   JDA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014165 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN PLUKKER UT ET ANTALL POENG GITT I VARIABELEN ANTALL    */        
 /*    BESTE FRA POENGREKKEN INNENFOR STARTÅR OG SLUTTÅR OG REGNER    */        
 /*    UT SPT OG OPT.                                                 */        
 /*    RUTINEN TELLER OGSÅ OPP ANTALL ÅR HVOR DET ER GODSKREVET POENG */        
 /*BRUK   :                                                           */        
 /*    CALL PLUKK_UT_BESTE_POENG(    )                                */        
 /*                                                                   */        
 /*    PROGRAMMET INCLUDES I R0014153 OG R0014156 OG 4470             */        
 /*                                                                   */        
 /* ***************************************************************** */        
 PLUKK_UT_BESTE_POENG:PROC(START_ÅR,SLUTT_ÅR,ANTALL_BESTE,POREKKE,W_ÅR);        
                                                                                
    %INCLUDE P0014001;   /*      POREKKE                             */         
    %INCLUDE P0014002;   /*      W_POREKKE                           */         
                                                                                
    DCL    (I,J)                 FIXED BIN(15);                                 
    DCL    K                     FIXED BIN(15) INIT (0);                        
    DCL                                                                         
       START_ÅR                  FIXED DEC(5),       /*2000*/                   
       SLUTT_ÅR                  FIXED DEC(5);       /*2000*/                   
    DCL                                                                         
       ANTALL_BESTE              FIXED DEC(3);                                  
    DCL                                                                         
       SUM_OPT                   FIXED DEC(5,3) INIT(0),                        
       SUM_SPT                   FIXED DEC(7,3) INIT(0);                        
    DCL                                                                         
       BESTE_POENG(20)           FIXED DEC(5,3),                                
       SEKSTINIÅR                   FIXED DEC(5);    /*2000*/                   
    DCL                                                                         
       RUNDING                   FIXED DEC(5,3) INIT(0.005),                    
       W_ÅR                      PIC '(4)9',        /*2000*/                    
       W_FELT                    CHAR(1);                                       
    DCL POENG_FØR92              FIXED DEC (3)  INIT (0);                       
                                                                                
  SUM_OPT              = 0;                                                     
  SUM_SPT              = 0;                                                     
                                                                                
  BESTE_POENG(*)       = 0;  /* INITITERT220699 TS*/                            
                                                                                
    W_POREKKE.TYPE      = POREKKE.TYPE;                                         
    W_POREKKE.SPT       = POREKKE.SPT;                                          
    W_POREKKE.OPT       = POREKKE.OPT;                                          
    W_POREKKE.PÅ        = POREKKE.PÅ;                                           
                                                                                
    SEKSTINIÅR = W_ÅR + 69;                                                     
                                                                                
                                                                                
    DO I = 1963 TO 2060 UNTIL(I = SEKSTINIÅR);        /*2000*/                  
       W_POREKKE.POENG(I) = POREKKE.POENG(I);                                   
       W_POREKKE.KODE (I) = POREKKE.KODE (I);                                   
       W_POREKKE.UFG  (I) = POREKKE.UFG  (I);                                   
    END;                                                                        
 %SKIP(3);                                                                      
                                                                                
  /*LOVENDRING : TP-PROSENTEN GÅR NED TIL 42 FOR ÅR ETTER 1991 : */             
                                                                                
  IF START_ÅR < 1992          THEN                    /*2000*/                  
     DO J = START_ÅR TO 1991 ;                        /*2000*/                  
  /*    IF POREKKE.KODE (J) ^= 'U56'  & 9812 FJERNET 9902*/                     
        IF POREKKE.POENG(J) > 0       THEN                                      
           POENG_FØR92 = POENG_FØR92 + 1;                                       
     END;                                                                       
  POREKKE.PÅ_ETTER91 = POREKKE.PÅ - POENG_FØR92;                                
                                                                                
  DO I = 1 TO ANTALL_BESTE;                                                     
     DO J = START_ÅR TO SLUTT_ÅR;                                               
        IF W_POREKKE.POENG(J) > BESTE_POENG(I) THEN                             
           DO;                                                                  
              BESTE_POENG(I) = W_POREKKE.POENG(J);                              
              BESTE_POENG(I) = W_POREKKE.POENG(J);                              
              K              = J;                                               
           END;                                                                 
     END;                                                                       
     IF K > 0  THEN                                                             
        DO;                                                                     
           IF W_POREKKE.POENG(K) > 4.00 THEN                                    
 /*                                                                   */        
 /*     BARE POENG OPP TIL 4.00 BLIR DET GITT OVERKOMPENSASJON FOR    */        
 /*                                                                   */        
              SUM_OPT = SUM_OPT + 4.00;                                         
           ELSE                                                                 
              SUM_OPT = SUM_OPT + W_POREKKE.POENG(K);                           
           SUM_SPT = SUM_SPT + W_POREKKE.POENG(K);                              
           W_POREKKE.POENG(K) = 0;                                              
        END;                                                                    
  END;                                                                          
                                                                                
  IF DIV_PARAM_OMR.REGN_PRO_RATA(IND) = 'J'     THEN                            
     DO;                                                                        
    /*  POREKKE.SPT = SUM(BESTE_POENG) / ANTALL_BESTE + RUNDING */              
        POREKKE.SPT = SUM_SPT / ANTALL_BESTE + RUNDING;                         
        POREKKE.OPT = SUM_OPT / ANTALL_BESTE + RUNDING;                         
     END;                                                                       
  ELSE                                                                          
  IF POREKKE.PÅ > 0     THEN                                                    
     DO;                                                                        
        IF POREKKE.PÅ < 20    THEN                                              
           DO;                                                                  
           /* POREKKE.SPT = SUM(BESTE_POENG) / POREKKE.PÅ + RUNDING */          
              POREKKE.SPT = SUM_SPT / POREKKE.PÅ + RUNDING;                     
              POREKKE.OPT = SUM_OPT / POREKKE.PÅ + RUNDING;                     
           END;                                                                 
        ELSE                                                                    
           DO;                                                                  
           /* POREKKE.SPT = SUM(BESTE_POENG) / 20 + RUNDING */                  
              POREKKE.SPT = SUM_SPT / 20 + RUNDING;                             
              POREKKE.OPT = SUM_OPT / 20 + RUNDING;                             
           END;                                                                 
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
        POREKKE.SPT = 0;                                                        
        POREKKE.OPT = 0;                                                        
     END;                                                                       
                                                                                
                                                                                
  IF B02.VIRK_DATO_ÅMD(IND) > 19910000 &           /*2000*/                     
     B02.OVERKOMP_UTL(IND) = 'N' THEN                                           
     POREKKE.OPT = 0;                                                           
                                                                                
                                                                                
                                                                                
  END PLUKK_UT_BESTE_POENG;                                                     
