 /*       SIST ENDRET 04/05-98 14.27.52 AV   JDA7339                  */00000000
 /*       SIST ENDRET 16/01-98 13.17.28 AV   SPA7339                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0013301 - HOVEDPROGRAM I CICS/PLI                             */00000040
 /*    PROGRAMMERER: KRISTENSEN, FEB 1982                             */00000050
 /*HENSIKT:                                                           */00000060
 /*    PROGRAMMET SJEKKER HVILKEN BLANKETTYPE EN HAR OG GIR KONTROLL  */00000070
 /*    TIL DET AKTUELLE DIALOGPROGRAM SOM SENDER UT TRANSAKSJONS-     */00000080
 /*    BILDET MED FEILMELDINGER.                                      */00000090
 /*PROGRAMTILKNYTNING:                                                */00000100
 /*    PROGRAMMET BLIR LINKET FRA R0013501 ELLER R0013601.            */00000110
 /*BRUK:                                                              */00000120
 /*    EXEC CICS LINK PROGRAM('R0013301') COMMAREA(KOM_OMR);          */00000130
 /* ***************************************************************** */00000140
 R001330:                                                               00000150
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000160
 %PAGE;                                                                 00000170
 %INCLUDE P0019906;         /*  TRANS-OPPL-OMR   */                     00000180
 %PAGE;                                                                 00000190
 %INCLUDE P0019908;         /*  KOM_OMR          */                     00000200
 %PAGE;                                                                 00000210
   DCL                                                                  00000220
        COMMAREA_PEKER       PTR;                                       00000230
                                                                        00000240
   DCL (SUSBTR )                  BUILTIN;                              00000250
 %SKIP(3);                                                              00000260
                                                                        00000270
                                                                        00000280
    TRANS_OPPL_OMR.TRANSKODE = TRANS_OPPL_OMR.TRANS_RETURKODE;          00000290
                                                                        00000300
      SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                               00000310
         WHEN('AP')                                                     00000320
            EXEC CICS XCTL PROGRAM('R0010501') COMMAREA(KOM_OMR);       00000330
         WHEN('A1')                                                     00000340
                 EXEC CICS XCTL PROGRAM('R001N501') COMMAREA(KOM_OMR);  00000350
         WHEN('AF')                                                     00000360
            EXEC CICS XCTL PROGRAM('R0011901') COMMAREA(KOM_OMR);       00000370
         WHEN('KF')                                                     00000380
            EXEC CICS XCTL PROGRAM('R001UJ01') COMMAREA(KOM_OMR);       00000390
         WHEN('UF')                                                     00000400
            EXEC CICS XCTL PROGRAM('R0011831') COMMAREA(KOM_OMR);       00000410
         WHEN('UP')                                                     00000420
            EXEC CICS XCTL PROGRAM('R0010601') COMMAREA(KOM_OMR);       00000430
         WHEN('U2')                                                     00000440
            EXEC CICS XCTL PROGRAM('R001N601') COMMAREA(KOM_OMR);       00000450
         WHEN('U3')                                                     00000460
            EXEC CICS XCTL PROGRAM('R001U601') COMMAREA(KOM_OMR);       00000470
         WHEN('US')                                                     00000480
            EXEC CICS XCTL PROGRAM('R0010701') COMMAREA(KOM_OMR);       00000490
         WHEN('EP')                                                     00000500
            EXEC CICS XCTL PROGRAM('R0010801') COMMAREA(KOM_OMR);       00000510
         WHEN('E3')                                                     00000520
            EXEC CICS XCTL PROGRAM('R001N801') COMMAREA(KOM_OMR);       00000530
         WHEN('EE')                                                     00000540
            EXEC CICS XCTL PROGRAM('R001U801') COMMAREA(KOM_OMR);       00000550
         WHEN('EF')                                                     00000560
            EXEC CICS XCTL PROGRAM('R0010901') COMMAREA(KOM_OMR);       00000570
         WHEN('E4')                                                     00000580
            EXEC CICS XCTL PROGRAM('R001N901') COMMAREA(KOM_OMR);       00000590
         WHEN('FB')                                                     00000600
            EXEC CICS XCTL PROGRAM('R0011001') COMMAREA(KOM_OMR);       00000610
         WHEN('BP')                                                     00000620
            EXEC CICS XCTL PROGRAM('R0011101') COMMAREA(KOM_OMR);       00000630
         WHEN('B6')                                                     00000640
            EXEC CICS XCTL PROGRAM('R001NB01') COMMAREA(KOM_OMR);       00000650
         WHEN('FT')                                                     00000660
            EXEC CICS XCTL PROGRAM('R0011201') COMMAREA(KOM_OMR);       00000670
         WHEN('F7')                                                     00000680
            EXEC CICS XCTL PROGRAM('R001NC01') COMMAREA(KOM_OMR);       00000690
         WHEN('FO')                                                     00000700
            EXEC CICS XCTL PROGRAM('R001UC01') COMMAREA(KOM_OMR);       00000710
                                                                        00000720
         WHEN('TG')                                                     00000730
            EXEC CICS XCTL PROGRAM('R0011301') COMMAREA(KOM_OMR);       00000740
         WHEN('E1')                                                     00000750
            EXEC CICS XCTL PROGRAM('R0011401') COMMAREA(KOM_OMR);       00000760
         WHEN('EN')                                                     00000770
            EXEC CICS XCTL PROGRAM('R001UE01') COMMAREA(KOM_OMR);       00000780
         WHEN('E2')                                                     00000790
            EXEC CICS XCTL PROGRAM('R0011501') COMMAREA(KOM_OMR);       00000800
         WHEN('O1')                                                     00000810
            EXEC CICS XCTL PROGRAM('R0011601') COMMAREA(KOM_OMR);       00000820
         WHEN('O2')                                                     00000830
            EXEC CICS XCTL PROGRAM('R0011701') COMMAREA(KOM_OMR);       00000840
         WHEN('NI')                                                     00000850
            EXEC CICS XCTL PROGRAM('R001I401') COMMAREA(KOM_OMR);       00000860
         OTHERWISE                                                      00000870
            ;                                                           00000880
        END;                                                            00000890
   END R001330;                                                         00000900
