 /*   SIST ENDRET PÅ PROD   2002.09.23 13.06.49 AV   JDA2970          */        
 /*       SIST ENDRET 20/05-99 10.54.49 AV   JDA7339                  */        
 /*       SIST ENDRET 20/05-99 10.53.53 AV   JDA7339                  */        
 /*       SIST ENDRET 30/07-98 09.25.38 AV   JDA7339                  */        
 /*       SIST ENDRET 06/07-98 14.23.05 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*     R0019939 - PROSEDYRE I PLI                                    */        
 /*     PROGRAMMERER: JAN, APRIL 1982                                 */        
 /* HENSIKT:                                                          */        
 /*     DENNE RUTINEN OPPHØRER BARNEPENSJON.                          */        
 /*     YNGSTE OG ØVRIGE BARN ER FLYTTET TIL B02                      */        
 /*     AVDØDE FORELDRE ER IKKE PÅ PLASS I B02                        */        
 /*     IND ER MF.INDEKS PÅ DET BARNET DET ER OPPHØR FOR.             */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*     KALLES OPP AV PROGRAM R0011720.                               */        
 /* BRUK:                                                             */        
 /*     CALL BARNEPENSJON_OPPHØRER(IND)                               */        
 /* ***************************************************************** */        
 BARNEPENSJON_OPPHØRER:PROC(IND);                                               
 /* ***************************************************************** */        
 /* DEKLARASJONER                                                     */        
 /* ***************************************************************** */        
   DCL                                                                          
      NY_YNG_BARN_IND FIXED BIN(15),                                            
      IND             FIXED BIN(15),                                            
      I               FIXED BIN(15),                                            
      J               FIXED BIN(15),                                            
      K               FIXED BIN(15);                                            
   DCL  HJELPEDATO1   PIC '(8)9';                                               
   DCL                                                                          
      1 HJ_DATO_YNG1 DEF HJELPEDATO1,                                           
        2 HJ_DAG1     PIC '99',                                                 
        2 HJ_MND1     PIC '99',                                                 
        2 HJ_ÅR1      PIC '9999';                                               
   DCL  HJELPEDATO2   PIC '(8)9';                                               
   DCL                                                                          
      1 HJ_DATO_YNG2 DEF HJELPEDATO2,                                           
        2 HJ_DAG2     PIC '99',                                                 
        2 HJ_MND2     PIC '99',                                                 
        2 HJ_ÅR2      PIC '9999';                                               
   DCL                                                                          
      T_FNR           PIC '(11)9';                                              
   DCL                                                                          
      T_FNR13         PIC '(13)9';                                              
   DCL                                                                          
      1 NR DEF T_FNR13,                                                         
        2 DG          PIC '99',                                                 
        2 MN          PIC '99',                                                 
        2 ÅR          PIC '9999',                                               
        2 PERSNR      PIC '99999';                                              
                                                                                
    /* ============================================================== */        
    PROGRAM_ID = 'R0019939';                                                    
                                                                                
    /* REMEDY 121 - VI NULLET IKKE UT 2 STMT */                                 
    B02.SUM_YTELSE(IND) = 0;                                                    
    B02.ETTEBARN(IND)   = '';                                                   
                                                                                
    IF (B01.PENSJONSTYPE1(IND) ^= 'B' &                                         
        B01.PENSJONSTYPE1(IND) ^= 'N' ) THEN                                    
       DO; /* DERSOM BARNET IKKE HAR PENSJON FRA FØR */                         
 L100:                                                                          
          FEIL_VED_LABEL = '100';                                               
          FEIL_MELD_NR = 1605;                                                  
          GO TO L999;                                                           
       END; /* DERSOM BARNET IKKE HAR PENSJON FRA FØR */                        
                                                                                
    DO I = 1 TO 2;                                                              
       IF B01.FNR(I) > 0 THEN                                                   
          DO;  /* HER FLYTTES EN ELLER BEGGE FORELDRENE */                      
             B02.PERSON(I)        = B01.PERSON(I);                              
             B02.VIRK_DATO_ÅMD(I) = HJ_VIRK_DATO_ÅMD;                           
          END; /* HER FLYTTES EN ELLER BEGGE FORELDRENE */                      
    END; /* DO I = 1 TO 2 */                                                    
                                                                                
    /* YNGSTE OG ØVRIGE BARN ER FLYTTET I B02 I PROGRAM R0011720      */        
                                                                                
    IF IND = 3 THEN                                                             
       DO;  /* DET ER DET YNGSTE BARNET SOM OPPHØRER */                         
                                                                                
          /* DISKONEKTER YNGSTE BARN OG FORELDRENE */                           
          IF B01.FNR(1) > 0 THEN                                                
             CALL OPPHØR_KOBLING_TO_PERSONER(1,3);                              
          IF B01.FNR(2) > 0 THEN                                                
             CALL OPPHØR_KOBLING_TO_PERSONER(2,3);                              
                                                                                
          IF B01.ANTALL_BARN(IND) > 1 THEN                                      
             DO;  /* DET ER FLERE BARN I KULLET */                              
                TRANSTYPE = 35;                                                 
                /* FINNER BARNET SOM NÅ ER YNGST */                             
                DO I = 4 TO 14 WHILE (B01.FNR(I) > 0);                          
                   T_FNR   = B01.FNR(I);                                        
                   T_FNR13 = KONV_FNR11_FNR13(T_FNR);                           
                   HJ_ÅR2  = ÅR;                                                
                   HJ_MND2 = MN;                                                
                   HJ_DAG2 = DG;                                                
                   IF HJELPEDATO1 < HJELPEDATO2 THEN                            
                      DO;                                                       
                         HJ_DATO_YNG1    = HJ_DATO_YNG2;                        
                         NY_YNG_BARN_IND = I;                                   
                      END;                                                      
                END;                                                            
                                                                                
                B02.PENSJONSTYPE2(NY_YNG_BARN_IND) = 'P';                       
                B02.FØRSTE_GANG_REG(NY_YNG_BARN_IND) = 'N';                     
                B02.ANTALL_BARN(NY_YNG_BARN_IND) = B02.ANTALL_BARN(3)-1;        
                                                                                
                /* KONEKTER NY-YNGSTE-BARN TIL AKTUELLE FORELDRE */             
                IF (B01.FNR(1) > 0) THEN                                        
                   CALL KOBLE_TO_PERSONER(NY_YNG_BARN_IND,1);                   
                IF (B01.FNR(2) > 0) THEN                                        
                    CALL KOBLE_TO_PERSONER(NY_YNG_BARN_IND,2);                  
                                                                                
                /* DISKONEKTER NY_YNGSTE_BARN OG YNGSTE_BARN. */                
                CALL OPPHØR_KOBLING_TO_PERSONER(NY_YNG_BARN_IND,3);             
                                                                                
                /* DISKONEKTER YNGSTE_BARN OG ØVRIGE BARN */                    
                DO K = 4 TO 14 WHILE (B01.FNR (K) > 0);                         
                   CALL OPPHØR_KOBLING_TO_PERSONER(K,3);                        
                END;                                                            
                                                                                
                /* KONEKTER NY-YNGSTE-BARN TIL ØVRIGE BARN */                   
                DO K = 4 TO 14 WHILE (B01.FNR (K) > 0);                         
                   IF K ^= NY_YNG_BARN_IND THEN                                 
                      DO;                                                       
                         CALL KOBLE_TO_PERSONER(NY_YNG_BARN_IND,K);             
                         B02.FØRSTE_GANG_REG(NY_YNG_BARN_IND) = 'N';            
                      END;                                                      
                END;                                                            
             END; /* DET ER FLERE BARN I KULLET */                              
          ELSE                                                                  
             /* IKKE FLERE BARN I KULLET */                                     
             TRANSTYPE = 55;                                                    
                                                                                
 /* ***************************************************************** */        
 /* DERSOM FORELDRENE IKKE ER TILKNYTTA FLERE PERSONER FJERNES        */        
 /* SPESDØD-SEGMENTET                                                 */        
 /* ***************************************************************** */        
                                                                                
          IF B01.FNR_TILKN(1,1) = 0  THEN                                       
             DO;                                                                
                B02.SPESOPPL.STATSBORGER(1)   = 0;                              
                B02.SPESOPPL.OVERKOMP_UTL(1)  = ' ';                            
                B02.SPESOPPL.FRAVIK_FLYKTN(1) = ' ';                            
                B02.SPESOPPL.BOSATT(1)        = 0;                              
                B02.SPESOPPL.TRYGDET_DØD(1)   = ' ';                            
             END;                                                               
          IF B01.FNR_TILKN(2,1) = 0  THEN                                       
             DO;                                                                
                B02.SPESOPPL.STATSBORGER(2)   = 0;                              
                B02.SPESOPPL.OVERKOMP_UTL(2)  = ' ';                            
                B02.SPESOPPL.FRAVIK_FLYKTN(2) = ' ';                            
                B02.SPESOPPL.BOSATT(2)        = 0;                              
                B02.SPESOPPL.TRYGDET_DØD(2)   = ' ';                            
             END;                                                               
         END;                                                                   
      ELSE                                                                      
         DO;  /* IKKE YNGSTE BARN SOM OPPHØRER */                               
            B02.ANTALL_BARN(3) = B02.ANTALL_BARN(3) - 1;                        
            CALL OPPHØR_KOBLING_TO_PERSONER(IND,3);                             
            DO K = 3 TO 14 WHILE (B01.FNR (K) > 0);                             
               B02.FØRSTE_GANG_REG(K) = 'N';                                    
            END;                                                                
            TRANSTYPE                     = 35;                                 
         END; /* IKKE YNGSTE BARN SOM OPPHØRER */                               
                                                                                
      B02.VIRK_DATO_ÅMD(IND)      = HJ_VIRK_DATO_ÅMD;                           
      B02.FØRSTE_GANG_REG(IND)   = 'N';                                         
      B02.ANTALL_BARN(IND)        = 0;                                          
                                                                                
      IF B01.PENSJONSTYPE3(IND) = 'U' THEN                                      
         DO;  /* UFØR BARNEPENSJONIST BLIR BARE UFØR */                         
            B02.PENSJONSTYPE1(IND)      = 'U';                                  
            B02.PENSJONSTYPE2(IND)      = 'P';                                  
            B02.PENSJONSTYPE3(IND)      = ' ';                                  
            DO I = 1 TO 13 WHILE(B01.FNR_TILKN(IND,I) > 0);                     
               B02.TILKN.FNR_TILKN(IND,I)    = 0;                               
            END;                                                                
            TRANSTYPE = 21;                                                     
         END; /* UFØR BARNEPENSJONIST BLIR BARE UFØR */                         
      ELSE                                                                      
         DO;  /* HAR IKKE REGISTRERT UFØR PÅ EX BARNEPENSJONIST */              
            B02.STATUS_KODE_HIST(IND)   = 'O';                                  
            B02.PENSJONSTYPE2(IND)      = ' ';                                  
         END; /* HAR IKKE REGISTRERT UFØR PÅ EX BARNEPENSJONIST */              
 L999:                                                                          
    EXEC CICS PURGE MESSAGE;                                                    
 END BARNEPENSJON_OPPHØRER;                                                     
