 /*   SIST ENDRET PÅ PROD   2004.02.10 12.04.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.07 13.58.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.40.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.32.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 13.01.34 AV   JDA2970          */        
 /*       SIST ENDRET 02/09-98 11.17.31 AV   SPA7339                  */        
 /*       SIST ENDRET 22/06-98 10.35.01 AV   JDA7339                  */        
 /*       SIST ENDRET 05/06-98 07.09.40 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*ENDRINGSDATO : 23/2-84                                             */        
 /*ENDRINGEN GJELDER : I VISSE TILFELLER HAR VI IKKE OPPLYSNINGER OM  */        
 /*                    AVDØD EKTEFELLE. STYRINGEN AV BILDEFREKVENSEN  */        
 /*                    ER NÅ LAGT OPP TIL OGSÅ Å TAKLE DETTE.         */        
 /*ENDRINGEN BLE UTFØRT AV KARIN                                      */        
 /* ***************************************************************** */        
 R00108:                                                                        
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                          
 %PAGE;                                                                         
 %INCLUDE S00108;    /*  ETTERLATT EKTEFELLE-MAPSETTET   */                     
 %PAGE;                                                                         
 %INCLUDE S00120;    /*  YRKESSKADE-MAPSETTET   */                              
 %PAGE;                                                                         
 %INCLUDE P0010801;  /*  TRANS_OMR FOR ETTERLATTEPENSJON       */               
 %PAGE;                                                                         
 /* NCLUDE P0019903;    STATSBORGERTABELLEN 2000-3     */                       
 %PAGE;                                                                         
 %INCLUDE P0019906;  /*  TRANS_OPPL_OMRÅDE (BASED)    */                        
 %PAGE;                                                                         
 %INCLUDE P0019908;  /*  KOM-OMRÅDE (BASED)           */                        
 %PAGE;                                                                         
 %INCLUDE P0019910;  /*  STYRINGS_OMRÅDE (BASED)      */                        
 %PAGE;                                                                         
 %INCLUDE P0019912;  /*  DIV_OMRÅDE (BASED)      */                             
 %PAGE;                                                                         
 %INCLUDE DFHBMSCA;                                                             
 %PAGE;                                                                         
   DCL                                                                          
      (BMSMAPBR,COMMAREA_PEKER)             PTR;                                
   DCL                                                                          
      (UNSPEC, DATE,ADDR,CSTG,ONCODE,VERIFY,SUBSTR) BUILTIN;                    
   DCL                                                                          
      FEIL_FUNNET                           BIT (1),                            
      ONKODE                                PIC'9999',                          
      CURSOR_POS                            FIXED BIN(15) INIT(-1),             
      ONK DEF ONKODE                        CHAR(4),                            
      FEILKODE                              CHAR(4),                            
      DSNAVN                                CHAR(8),                            
      ANT_FEIL_SKREVET                      FIXED DEC (3);                      
   DCL                                                                          
      TYPE                                  CHAR(1),                            
      DATO                                  PIC'(8)9'; /* 2000-3 */             
  DCL                                                                           
      1 DAGENS_DATO DEF DATO,                                                   
        2 AAR           PIC'9999',                                              
        2 MND           PIC'99',                                                
        2 DAG           PIC'99';                                                
                                                                                
                                                                                
 %PAGE;                                                                         
      ON ERROR SNAP BEGIN;                                                      
         ON ERROR SYSTEM;                                                       
         ONKODE = ONCODE;                                                       
         FEILKODE = ONK;                                                        
         DSNAVN   = EIBRCODE;                                                   
         GO TO  FEILBEH ;                                                       
      END;                                                                      
                                                                                
 FEILKODE   = 'FEIL'    ;                                                       
 DSNAVN     = '        ';                                                       
                                                                                
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                                     
                                                                                
 EXEC CICS HANDLE AID PF1(PF1) PF2(PF2)  PF7(PF7)  PF8(PF8);                    
                                                                                
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);            
 DATO                                 = DATO_2000;                              
                                                                                
 IF FRA_CICS THEN                                                               
  DO;                                                                           
    KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);        
    KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);             
    KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);          
    ATK_KOM_PTR           = ADDR  (KOM_OMR.ATK_COM_OMR  ) ;                     
  END;                                                                          
                                                                                
 SEND_MAP:                                                                      
 IF HENT_FRAM_MAP  THEN                                                         
    DO;                                                                         
        IF  TRANSKODE  = 'R085'  THEN                                           
           DO;                                                                  
              EXEC CICS SEND MAP('S001201') MAPSET('S001203') MAPONLY           
                                                 SET (BMSMAPBR);                
              ALLOCATE S001201O;                                                
              S001201O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                   
           END;                                                                 
        ELSE                                                                    
           DO;                                                                  
              EXEC CICS SEND MAP('S001081') MAPSET('S001083')                   
                           MAPONLY SET (BMSMAPBR);                              
              ALLOCATE S001081O;                                                
              S001081O.CICS_INFOO = CICS_NAVN;                                  
           END;                                                                 
    END;                                                                        
                                                                                
 RECEIVE_MAP:                                                                   
                                                                                
 IF ^HENT_FRAM_MAP THEN                                                         
    DO;                                                                         
                                                                                
       IF TRANSKODE ^= 'R085'  THEN                                             
          EXEC CICS RECEIVE MAP('S001081')                                      
                                    MAPSET('S001083') SET(BMSMAPBR);            
       ELSE                                                                     
          EXEC CICS RECEIVE MAP('S001201')                                      
                                    MAPSET('S001203') SET(BMSMAPBR);            
                                                                                
       CALL BLANK_EP_MELDNR;                                                    
       CALL BLANK_EPY_MELDNR;                                                   
       FEIL_MELD_NR = 0;                                                        
                                                                                
    END;                                                                        
                                                                                
 IF TRANSKODE = 'R085' THEN                                                     
    DO;                                                                         
                                                                                
       IF S001201I.FUNKSJONSKODEL > 0 THEN                                      
          DO;                                                                   
             FUNKSJONSKODE = S001201I.FUNKSJONSKODEI;                           
             EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);              
          END;                                                                  
                                                                                
       IF S001201I.STYRE_KODEL > 0 THEN                                         
          DO;                                                                   
             STYREKODE = S001201I.STYRE_KODEI;                                  
             TRANSKODE = 'R041';                                                
             EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);              
          END;                                                                  
    END;                                                                        
 ELSE                                                                           
    DO;                                                                         
       IF S001081I.FUNKSJONSKODEL > 0 THEN                                      
          DO;                                                                   
             FUNKSJONSKODE = S001081I.FUNKSJONSKODEI;                           
             EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);              
          END;                                                                  
                                                                                
       IF S001081I.STYRE_KODEL > 0 THEN                                         
          DO;                                                                   
             STYREKODE = S001081I.STYRE_KODEI;                                  
             TRANSKODE = 'R041';                                                
             EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);              
          END;                                                                  
    END;                                                                        
                                                                                
 IF STYREKODE ^= 'EP'  &  FRA_CICS THEN                                         
    TRANSKODE  = 'R041';                                                        
 ELSE                                                                           
    DO;                                                                         
       TRANS_RETURKODE = TRANSKODE;                                             
                                                                                
   SELECT (TRANSKODE);                                                          
    WHEN('R080')                                                                
       DO;                                                                      
          CALL BLANK_EP_SØKER;                                                  
          CALL BLANK_EP_SPES_SØKER;                                             
          CALL BLANK_EP_SPES_AVDØDE;                                            
          CALL BLANK_EP_MELDNR;                                                 
          CALL BLANK_YP_ETTERL;                                                 
          CALL BLANK_EPY_MELDNR;                                                
          CALL OVERFØR_EP_SØKER;                                                
          CALL KONTROLL_EP_SØKER(FEIL_FUNNET);                                  
       END;                                                                     
    WHEN('R081')                                                                
       DO;                                                                      
         CALL BLANK_EP_MELDNR;                                                  
                                                                                
         /* FOR PF7/PF8 FUNKSJON    SATISH 28.07.2003                           
         IF FUNKSJONSKODE ^= 'V' THEN                                           
            DO;                                                                 
               CALL BLANK_EP_SPES_SØKER;                                        
               CALL BLANK_EP_SPES_AVDØDE;                                       
            END;                                                                
         OPPTIL HIT    */                                                       
                                                                                
         CALL OVERFØR_EP_SØKER;                                                 
         CALL KONTROLL_EP_SØKER(FEIL_FUNNET);                                   
       END;                                                                     
    WHEN('R082')                                                                
       /* SØKER: BOSATT = N, AVDØDE: BOSATT ^= N  */                            
       DO;                                                                      
         CALL BLANK_EP_MELDNR;                                                  
         CALL BLANK_EP_SPES_AVDØDE;                                             
         CALL OVERFØR_EP_SØKER;                                                 
         CALL OVERFØR_EP_SPES_SØKER;                                            
         CALL KONTROLL_EP_SØKER(FEIL_FUNNET);                                   
         IF EPS.NORSK_BOSATT = 'J' THEN                                         
            CALL BLANK_EP_SPES_SØKER;                                           
         ELSE                                                                   
            CALL KONTROLL_EP_SPES(FEIL_FUNNET);                                 
       END;                                                                     
    WHEN('R083')                                                                
       DO;                                                                      
       /* SØKER: BOSATT = J, AVDØDE: BOSATT = N  */                             
          CALL BLANK_EP_MELDNR;                                                 
          CALL BLANK_EP_SPES_SØKER;                                             
          CALL OVERFØR_EP_SØKER;                                                
          CALL OVERFØR_EP_SPES_AVDØDE;                                          
          CALL KONTROLL_EP_SØKER(FEIL_FUNNET);                                  
          IF EPS.NORSK_BOSATT_EK = 'J' !                                        
             EPS.NORSK_BOSATT_EK = ' ' THEN                                     
             CALL BLANK_EP_SPES_AVDØDE;                                         
          ELSE                                                                  
             CALL KONTROLL_EP_SPES_EK(FEIL_FUNNET);                             
       END;                                                                     
    WHEN('R084')                                                                
       DO;                                                                      
       /* SØKER: BOSATT = N, AVDØDE: BOSATT = N  */                             
          CALL BLANK_EP_MELDNR;                                                 
          CALL OVERFØR_EP_SØKER;                                                
          CALL OVERFØR_EP_SPES_SØKER;                                           
          CALL OVERFØR_EP_SPES_AVDØDE;                                          
          CALL KONTROLL_EP_SØKER(FEIL_FUNNET);                                  
          IF EPS.NORSK_BOSATT = 'J' THEN                                        
             CALL BLANK_EP_SPES_SØKER;                                          
          ELSE                                                                  
             CALL KONTROLL_EP_SPES(FEIL_FUNNET);                                
          IF EPS.NORSK_BOSATT_EK = 'J' !                                        
             EPS.NORSK_BOSATT_EK = ' ' THEN                                     
             CALL BLANK_EP_SPES_AVDØDE;                                         
          ELSE                                                                  
             CALL KONTROLL_EP_SPES_EK(FEIL_FUNNET);                             
       END;                                                                     
    WHEN('R085')                                                                
       DO;                                                                      
          CALL BLANK_EP_MELDNR;                                                 
          CALL BLANK_EPY_MELDNR;                                                
          CALL OVERFØR_YP_SØKER;                                                
          CALL KONTROLL_EP_YRKESSKADE(FEIL_FUNNET);                             
       END;                                                                     
    OTHERWISE;                                                                  
       /* INGEN UTGANG DA CICS IKKE GODTAR UGYLDIGE TRANSAKSJONSKODER */        
    END;          /* END SELECT   */                                            
                                                                                
    IF EPS.NORSK_BOSATT = 'N' & ^FEIL_FUNNET THEN                               
       DO;                                                                      
          TRANSKODE              = 'R082';                                      
          IF EPS.NORSK_BOSATT_EK = 'N' THEN                                     
             TRANSKODE           = 'R084';                                      
       END;                                                                     
    ELSE                                                                        
       IF EPS.NORSK_BOSATT_EK    = 'N' & ^FEIL_FUNNET THEN                      
          TRANSKODE              = 'R083';                                      
                                                                                
    IF (TRANSKODE = 'R082' ! TRANSKODE = 'R083' ! TRANSKODE = 'R084') &         
       EPS.NORSK_BOSATT = 'J' & (EPS.NORSK_BOSATT_EK = 'J' ! EPS.               
       NORSK_BOSATT_EK  = ' ') THEN                                             
       TRANSKODE        = 'R081';                                               
    ELSE                                                                        
       IF (TRANSKODE = 'R083' ! TRANSKODE = 'R084') &                           
          EPS.NORSK_BOSATT = 'N' & (EPS.NORSK_BOSATT_EK = 'J' !                 
          EPS.NORSK_BOSATT_EK = ' ') THEN                                       
          TRANSKODE = 'R082';                                                   
    ELSE                                                                        
       IF (TRANSKODE = 'R082' ! TRANSKODE = 'R084') &                           
             EPS.NORSK_BOSATT = 'J' & EPS.NORSK_BOSATT_EK = 'N' THEN            
             TRANSKODE = 'R083';                                                
    ELSE                                                                        
       IF (TRANSKODE = 'R082' ! TRANSKODE = 'R083') &                           
                EPS.NORSK_BOSATT = 'N' & EPS.NORSK_BOSATT_EK = 'N' THEN         
                TRANSKODE = 'R084';                                             
                                                                                
        IF TRANS_RETURKODE = 'R085' THEN                                        
           TRANSKODE       = 'R085';                                            
                                                                                
 IF FEIL_FUNNET ! HENT_FRAM_MAP ! FRA_UTEN_DIALOG !                             
    TRANS_RETURKODE ^= TRANSKODE THEN                                           
    DO;                                                                         
                                                                                
       IF TRANSKODE ^= 'R085'  THEN                                             
          DO;                                                                   
             IF TRANSKODE = 'R080' THEN                                         
                TRANSKODE = 'R081';                                             
             CALL BLANK_EP_MAP;                                                 
             CALL OVERFØR_EPSØKER_MAP;                                          
          END;                                                                  
                                                                                
       SELECT (TRANSKODE);                                                      
          WHEN ('R081')                                                         
             DO;                                                                
                CALL FJERN_TEKST_SPES_SØKER;                                    
                CALL FJERN_TEKST_SPES_AVDØDE;                                   
                CALL BLOKKERE_EPSPES_SØKER;                                     
                CALL BLOKKERE_EPSPES_AVDØDE;                                    
             END;                                                               
          WHEN ('R082')                                                         
             DO;                                                                
                CALL TEKST_SPES_SØKER;                                          
                CALL OVERFØR_EPSPES_SØKER_MAP;                                  
                CALL FJERN_TEKST_SPES_AVDØDE;                                   
                CALL BLOKKERE_EPSPES_AVDØDE;                                    
             END;                                                               
          WHEN ('R083')                                                         
             DO;                                                                
                CALL TEKST_SPES_AVDØDE;                                         
                CALL OVERFØR_EPSPES_AVDØDE_MAP;                                 
                CALL FJERN_TEKST_SPES_SØKER;                                    
                CALL BLOKKERE_EPSPES_SØKER;                                     
             END;                                                               
          WHEN ('R084')                                                         
             DO;                                                                
                CALL TEKST_SPES_SØKER;                                          
                CALL TEKST_SPES_AVDØDE;                                         
                CALL OVERFØR_EPSPES_SØKER_MAP;                                  
                CALL OVERFØR_EPSPES_AVDØDE_MAP;                                 
             END;                                                               
          WHEN ('R085')                                                         
             DO;                                                                
                CALL BLANK_YP_MAP;                                              
                CALL OVERFØR_EPY_MAP;                                           
             END;                                                               
          OTHERWISE;                                                            
       END;                                                                     
                                                                                
      IF HENT_FRAM_MAP THEN                                                     
         IF TRANSKODE ^= 'R085' THEN                                            
            EXEC CICS SEND MAP('S001081') MAPSET('S001083')                     
                                          ERASE CURSOR;                         
         ELSE                                                                   
            EXEC CICS SEND MAP('S001201') MAPSET('S001203')                     
                                          ERASE CURSOR;                         
      ELSE                                                                      
         IF TRANSKODE ^= 'R085' THEN                                            
            EXEC CICS SEND MAP('S001081') MAPSET('S001083') ERASEAUP            
                                                DATAONLY CURSOR;                
         ELSE                                                                   
            EXEC CICS SEND MAP('S001201') MAPSET('S001203') ERASEAUP            
                                                DATAONLY CURSOR;                
      FEIL_MELD_NR  = 666;/* => FEIL_FUNNET ER SATT. */                         
      HENT_FRAM_MAP = '0'B;                                                     
                                                                                
      IF  FRA_CICS THEN                                                         
         EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                 
      ELSE                                                                      
         GOTO RECEIVE_MAP;                                                      
    END;            /*   END     TRANS_RETURKODE ^= TRANSKODE     */            
   ELSE                                                                         
      DO;                                                                       
                                                                                
         /*------------------------------------------------------*/             
         /* KONTROLLEN FOR ETTERLATT-EKTEFELLE-BILDET ER FERDIG. */             
         /* DERSOM DET ER YRKESSKADE PREUTFYLLES YRKESSKADE-     */             
         /* BILDET OG SENDES UT.                                 */             
         /*------------------------------------------------------*/             
                                                                                
         IF TRANSKODE          ^= 'R085' &                                      
            EPS.YSKADE_TILLEGG  = 'J'    THEN                                   
            DO;                                                                 
                                                                                
               ALLOCATE S001201O;                                               
               S001201O.CICS_INFOO = CICS_NAVN;                                 
               S001201O.FNRO    = F_FELT_PIC_CHAR11(EPS.FNR_EK);                
               S001201O.TKNRO   = F_FELT_PIC_CHAR4(EPS.TKNR);                   
               S001201O.NAVNO   = EPS.NAVN_EK;                                  
               S001201O.VIRK_DATOO =                                            
                           KONV_HÅMD_MÅ(EPS.VIRK_DATO_ÅMD);                     
                                                                                
               IF EPS.SIVILSTAND = 'U' THEN                                     
                  S001201O.FNR_SAMBOERO =                                       
                                  F_FELT_PIC_CHAR11(EPS.FNR);                   
               ELSE                                                             
                  S001201O.FNR_EKO =                                            
                                  F_FELT_PIC_CHAR11(EPS.FNR);                   
                                                                                
               /*----------------------------------------------------*/         
               /* OVERFØRER DATA TIL MAP HVIS VENTETRANS-BEHANDLING  */         
               /*----------------------------------------------------*/         
                                                                                
               IF FUNKSJONSKODE     = 'V'      THEN                             
                  CALL OVERFØR_EPY_MAP;                                         
                                                                                
               EXEC CICS SEND MAP('S001201') MAPSET('S001203') ERASE;           
                                                                                
               TRANSKODE     = 'R085';                                          
               HENT_FRAM_MAP = '0'B;                                            
                                                                                
               IF FRA_CICS                     THEN                             
                  EXEC CICS RETURN TRANSID(TRANSKODE)                           
                                   COMMAREA(KOM_OMR);                           
               ELSE                                                             
                  GOTO RECEIVE_MAP;                                             
            END;                                                                
                                                                                
                                                                                
         IF TRANSKODE       = 'R080' THEN                                       
            TRANS_RETURKODE = 'R081';                                           
         ELSE                                                                   
            TRANS_RETURKODE = TRANSKODE;                                        
         IF  FRA_CICS  THEN                                                     
            DO;                                                                 
               BLANKETTYPE  = STYREKODE;                                        
               TRANSKODE    = 'R042';                                           
            END;                                                                
      END;                   /*  END ELSE     */                                
  END;                   /*  ELSE STYREKODE ^= 'EP'       */                    
                                                                                
  CALL UTGANG;                                                                  
                                                                                
  UTGANG: PROC;                                                                 
    IF FRA_CICS THEN                                                            
       EXEC CICS XCTL PROGRAM('R0010401') COMMAREA(KOM_OMR);                    
    ELSE                                                                        
       EXEC CICS RETURN;                                                        
  END UTGANG;                                                                   
                                                                                
  FEILBEH:                                                                      
                                                                                
     EXEC CICS HANDLE CONDITION ERROR(ABEND);                                   
      IF FEIL_MELD_NR = 0 THEN /* AB 01.08.16 */                                
         PROGRAM_ID = 'R0010801';                                               
                                                                                
     ALLOCATE S001081O;                                                         
     S001081O.CICS_INFOO = CICS_NAVN;                                           
                                                                                
     S001081O.MELDING2O =                                                       
              'F E I L  H A R  O P P S T Å T T ! ! !.';                         
                                                                                
     S001081O.MELDING3O =                                                       
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                                
                                                                                
     S001081O.MELDING4O =                                                       
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE         
                                         !! '. DATASETT : ' !! DSNAVN;          
                                                                                
     S001081O.MELDING5O =                                                       
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                        
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';                       
                                                                                
     S001081O.MELDING6O =                                                       
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';                   
                                                                                
                                                                                
     EXEC CICS SEND MAP('S001081')                                              
                                                 MAPSET('S001083');             
                                                                                
     EXEC CICS RECEIVE MAP('S001081')                                           
                                    MAPSET('S001083') SET(BMSMAPBR);            
                                                                                
                                                                                
     EXEC CICS SYNCPOINT ROLLBACK;                                              
                                                                                
                                                                                
     TERMINERINGS_IND = 'F';                                                    
                                                                                
     TRANSKODE  = 'R041';                                                       
                                                                                
     CALL UTGANG;                                                               
                                                                                
  ABEND:                                                                        
     EXEC CICS ABEND ABCODE(FEIL);                                              
                                                                                
  PF1:                                                                          
                                                                                
 /* LEGGER UNDERKJENT TRANS UT PÅ VENTEDATABASE HVIS GYLDIG     */              
 /* FNR OG VIRKNINGSDATO,ELLERS FORKASTES TRANSAKSJONEN.        */              
     IF ^(EPS.FNRNR = 1          !                                              
          EPS.FNRNR = 200        !                                              
          EPS.VIRK_DATO_ÅMDNR = 9 !                                             
          EPS.VIRK_DATO_ÅMDNR = 200) THEN                                       
                                                                                
        DO;                                                                     
                                                                                
           IF FØDSNUMMER    = 0   THEN                                          
                                                                                
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER FORKASTET.           */              
                                                                                
              DO;                                                               
                 FEIL_MELD_NR  = 0;                                             
                 S001081O.MELDING6O =                                           
                         'REGISTERINGEN ER IKKE AVSLUTTET MED "ENTER"'!!        
                         '.TRANSAKSJONEN ER FORKASTET.';                        
                                                                                
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                                                                                
                 SEARCH_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;                       
                 IF FRA_CICS THEN                                               
                    BLANKETTYPE = STYREKODE;                                    
                                                                                
                                                                                
                 IF FEIL_MELD_NR = 666 &      /*BLANKETTKONTROLLFEIL*/          
                    ^FRA_MED_DIALOG     THEN  /*IKKE BASEKONTROLLFEIL*/         
                    FUNKSJONSKODE = 'B';                                        
                                                                                
                 IF EPS.NORSK_BOSATT = 'N' THEN                                 
                    DO;                                                         
                       CALL BLANK_EP_MELDNR;                                    
                       CALL OVERFØR_EPSPES_SØKER_MAP;                           
                    END;                                                        
                                                                                
                 IF EPS.NORSK_BOSATT_EK = 'N' THEN                              
                    DO;                                                         
                       CALL BLANK_EP_MELDNR;                                    
                       CALL OVERFØR_EPSPES_AVDØDE_MAP;                          
                    END;                                                        
                                                                                
                 EXEC CICS LINK PROGRAM('R0010490') COMMAREA(KOM_OMR);          
                                                                                
 /* SKRIVER MELDING OM AT TRANSAKSJONEN ER LAGT UT PÅ VENTEBASE.*/              
                                                                                
                 S001081O.MELDING6O =                                           
                         'TRANSAKSJONEN ER LAGT UT PÅ VENTEREGISTER.';          
              END;                                                              
                                                                                
           IF TRANSKODE ^= 'R085' THEN                                          
              DO;                                                               
                                                                                
                 EXEC CICS SEND MAP('S001081') MAPSET('S001083')                
                                               DATAONLY;                        
                 /* DUMMY SEND-KALL.                              */            
                                                                                
                 EXEC CICS SEND MAP('S001081') MAPSET('S001083');               
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                                                                                
                 S001201O.YMELDING6O  =  S001081O.MELDING6O;                    
                                                                                
                 EXEC CICS SEND MAP('S001201') MAPSET('S001203')                
                                               DATAONLY;                        
                 /* DUMMY SEND-KALL.                              */            
                                                                                
                 EXEC CICS SEND MAP('S001201') MAPSET('S001203');               
              END;                                                              
                                                                                
           EXEC CICS DELAY INTERVAL(005);                                       
                                                                                
           TERMINERINGS_IND = 'F';                                              
                                                                                
           TRANSKODE  = 'R041';                                                 
                                                                                
           CALL UTGANG;                                                         
                                                                                
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           TERMINERINGS_IND = 'F';                                              
                                                                                
           TRANSKODE = 'R041';                                                  
                                                                                
           S001081O.MELDING6O =                                                 
   'NB** TRANSAKSJONEN ER FORKASTET P.G.A. UGYLDIG FNR EL. VDATO **NB';         
                                                                                
                                                                                
           IF TRANSKODE ^= 'R085'  THEN                                         
              DO;                                                               
                 EXEC CICS SEND MAP('S001081') MAPSET('S001083')                
                                                           DATAONLY;            
                 /* DUMMY SEND-KALL.                            */              
                                                                                
                 EXEC CICS SEND MAP('S001081')                                  
                                MAPSET('S001083');                              
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                 S001201O.YMELDING6O  =  S001081O.MELDING6O;                    
                                                                                
                 EXEC CICS SEND MAP('S001201') MAPSET('S001203')                
                                                           DATAONLY;            
                 /* DUMMY SEND-KALL.                            */              
                                                                                
                 EXEC CICS SEND MAP('S001201')                                  
                                MAPSET('S001203');                              
              END;                                                              
                                                                                
           EXEC CICS DELAY INTERVAL(005);                                       
           CALL UTGANG;                                                         
        END;                                                                    
                                                                                
                                                                                
  PF2:                                                                          
     TERMINERINGS_IND   = 'F';                                                  
                                                                                
     S001081O.MELDING6O =                                                       
      'NBNBNBNBNB***    TRANSAKSJONEN ER FORKASTET.    ***NBNBNBNBNB';          
                                                                                
       IF TRANSKODE ^= 'R085' THEN                                              
         DO;                                                                    
           EXEC CICS SEND MAP('S001081') MAPSET('S001083')                      
                                                      DATAONLY ;                
           /* DUMMY SEND-KALL.                              */                  
                                                                                
           EXEC CICS SEND MAP('S001081')                                        
                                    MAPSET('S001083');                          
         END;                                                                   
       ELSE                                                                     
         DO;                                                                    
           S001201O.YMELDING6O  =  S001081O.MELDING6O;                          
                                                                                
           EXEC CICS SEND MAP('S001201') MAPSET('S001203')                      
                                                      DATAONLY ;                
           /* DUMMY SEND-KALL.                              */                  
                                                                                
           EXEC CICS SEND MAP('S001201')                                        
                                    MAPSET('S001203');                          
         END;                                                                   
                                                                                
     EXEC CICS DELAY INTERVAL(005);                                             
                                                                                
                                                                                
     TRANSKODE = 'R041';                                                        
                                                                                
     CALL UTGANG;                                                               
  PF7:                                                                          
       IF TRANSKODE = 'R085' THEN                                               
          DO;                                                                   
            IF EPS.NORSK_BOSATT_EK  = 'N' &                                     
               EPS.NORSK_BOSATT = 'N'  THEN                                     
               TRANSKODE = 'R084';                                              
            ELSE                                                                
            IF EPS.NORSK_BOSATT_EK  = 'N' &                                     
               EPS.NORSK_BOSATT = 'J'  THEN                                     
               TRANSKODE = 'R083';                                              
            ELSE                                                                
            IF EPS.NORSK_BOSATT_EK  = 'J' &                                     
               EPS.NORSK_BOSATT = 'N'  THEN                                     
               TRANSKODE = 'R082';                                              
            ELSE                                                                
               TRANSKODE = 'R081';                                              
          END;                                                                  
                                                                                
       HENT_FRAM_MAP = '1'B;                                                    
       GOTO SEND_MAP;                                                           
                                                                                
  PF8:                                                                          
     IF FEIL_FUNNET    = '0'B THEN                                              
       DO;                                                                      
                                                                                
          IF (TRANSKODE = 'R080' !                                              
              TRANSKODE = 'R081' ) &                                            
            ( EPS.NORSK_BOSATT = 'J' !                                          
              EPS.NORSK_BOSATT_EK = 'J') THEN                                   
              TRANSKODE = 'R085';                                               
          ELSE                                                                  
          IF (TRANSKODE = 'R082' !                                              
              TRANSKODE = 'R083' ) &                                            
              EPS.YSKADE_TILLEGG = 'J' THEN                                     
              TRANSKODE = 'R085';                                               
                                                                                
     END;                                                                       
     HENT_FRAM_MAP = '1'B;                                                      
                                                                                
     GOTO SEND_MAP;                                                             
                                                                                
 %PAGE;                                                                         
      %INCLUDE R0010802;               /* BLANK ARBEIDSOMRÅDE */                
 %PAGE;                                                                         
      %INCLUDE R0010803;               /* KONTROLL AV SØKERDELEN */             
 %PAGE;                                                                         
      %INCLUDE R0010805;               /* KONTROLL AV SPESIELLE */              
 %PAGE;                                                                         
      %INCLUDE R0010806;               /* ARBEIDSOMRÅDE -> MAP */               
 %PAGE;                                                                         
      %INCLUDE R0010807;               /* FORTEKTSTER OG ATTRIBUTTER*/          
 %PAGE;                                                                         
      %INCLUDE R0010809;               /* MAP -> ARBEIDSOMRÅDE */               
 %PAGE;                                                                         
      %INCLUDE R0010608;               /* BEREGN TT UF */                       
 %PAGE;                                                                         
      %INCLUDE R0019901;               /*  TESTER OM DATO ER GYLDIG */          
 %PAGE;                                                                         
      %INCLUDE R0019902;               /*  FINNE KJØNN     */                   
 %PAGE;                                                                         
      %INCLUDE R0019903;               /* EKTEFELLES ALDER GYLDIG */            
 %PAGE;                                                                         
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL */              
 %PAGE;                                                                         
      %INCLUDE R0019905;               /* BEREGNER ALDER */                     
 %PAGE;                                                                         
      %INCLUDE R0019907;               /* TABELLSØKING */                       
 %PAGE;                                                                         
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1 */                
 %PAGE;                                                                         
      %INCLUDE R0019910;               /* NUMERISK KONTROLL */                  
 %PAGE;                                                                         
      %INCLUDE R0019911;               /*  DATO KONTROLL  */                    
 %PAGE;                                                                         
      %INCLUDE R0019912;  /* KONVERTERING CHAR ==> PIC / PIC ==> CHAR */        
 %PAGE;                                                                         
      %INCLUDE R0019944;               /* SKRIV_FEIL      */                    
 %PAGE;                                                                         
      %INCLUDE R0019953;               /* DAGENS DATO + 40 DAGER */             
 %PAGE;                                                                         
      %INCLUDE R0019963;               /* SKRIV_FEIL_YP   */                    
 %PAGE;                                                                         
      %INCLUDE R0019995;               /* KONV_FNR11_FNR13       */             
 %PAGE;                                                                         
      %INCLUDE R0019983;               /* KONV_ÅMD_HÅMD  2000-3  */             
 %PAGE;                                                                         
      %INCLUDE R0019985;               /* KONV_DMÅ_HÅMD  2000-3  */             
 %PAGE;                                                                         
      %INCLUDE R0019984;               /* KONV_MÅ_HÅMD  2000-3  */              
 %PAGE;                                                                         
      %INCLUDE R0019989;               /* KONV_HÅMD_MÅ  2000-3  */              
 %PAGE;                                                                         
      %INCLUDE R0019988;               /* KONV_HÅMD_ÅMD 2000-3  */              
 %PAGE;                                                                         
      %INCLUDE R0019990;               /* KONV_HÅMD_DMÅ 2000-3  */              
      %INCLUDE R0019945;               /* ATK_TILLGANG_KONTROLL   */            
      %INCLUDE R0019999;               /* KONTROLL_ACF2           */            
   END R00108;                                                                  
