 /*   SIST ENDRET PÅ PROD   2004.12.17 15.28.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.25.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.09.13 11.56.48 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.08.27 11.27.13 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.07.07 13.04.00 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.37.05 AV   JDA7339          */        
 /*       SIST ENDRET 04/09-98 07.47.25 AV   HLA7339                  */        
 /*       SIST ENDRET 04/09-98 07.38.03 AV   HLA7339                  */        
 /*       SIST ENDRET 09/12-97 10.52.17 AV   SPA7339                  */        
 /*       SIST ENDRET 26/11-97 11.45.11 AV   SPA7339                  */        
  /* **************************************************************** */        
  /*IDENTIFIKASJON:                                                   */        
  /*    R0013110 - HOVEDPROGRAM I PLI                                 */        
  /*                                                                  */        
  /*    PROGRAMMERER: S. LUNDEBY , SFK , FEBRUAR  1982                */        
  /*                                                                  */        
  /*HENSIKT:                                                          */        
  /*    LESER INNTEKT , PENSJONSHISTORIKK                             */        
  /*    OG STATUS RECORD FRA DATABASEN OG INN I B01 .                 */        
  /*                                                                  */        
  /*    PERSON-STATUSENE  A,B,C,D,F,G,H ELLER  I  SETTES .            */        
  /*                                                                  */        
  /*PROGRAMTILKNYTNING:                                               */        
  /*                                                                  */        
  /*BRUKER                                                            */        
  /*                                                                  */        
  /* N B !!                                                           */        
  /*    VED UTVIDELSE AV TABELLEN VENTØVR MÅ EN UNDER LESING AV       */        
  /*    ALDERSP LEGGE INN DET NYE ANTALL VENTØVR I B01/B02 .          */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
  R001311 :                                                                     
    PROC            (COMMAREA_PEKER)                                            
           OPTIONS  (MAIN);                                                     
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019908;                              /* KOM_OMR        */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */        
                                                                                
    %PAGE;                                                                      
       DCL 1 B01              BASED (B01_PEKER),                                
    %INCLUDE P0019921;                              /* B01            */        
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL                                                                      
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                         
       DCL                                                                      
         PLITDLI ENTRY;                                                         
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
       DCL                                                                      
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );           
       DCL                                                                      
           COMMAREA_PEKER            POINTER;                                   
       DCL                                                                      
           W01_HJELPE_PTR            POINTER;                                   
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_OMR                   UNALIGNED,                              
              2   W02_I                 FIXED  BIN  (15),                       
              2   W02_EOAFP_TELLER      FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_UFHIST_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_UFGRAD_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_YSHIST_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_YSGRAD_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_TILKNY_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_VENTØV_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_AFPHIS_TELLER     FIXED  BIN  (15)     INIT ( 0 ),        
              2   W02_ANT_GANGER_I_WAIT FIXED  BIN  (15)     INIT ( 0 ),        
              2   B                            CHAR (1);                        
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   INNTEKTS-SEGMENTET                                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL 1 W01_PINT                UNALIGNED,                                 
    %INCLUDE P0019928;                              /* INNTEKTS-SEGM. */        
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_DLI_PARAM,                                                    
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),             
              2   W02_GHU                 CHAR (4)   INIT ('GHU '),             
              2   W02_REPL                CHAR (4)   INIT ('REPL'),             
              2   W02_ISRT                CHAR (4)   INIT ('ISRT'),             
              2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),                  
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                  
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                  
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),                  
              2   W02_PERSONEN_ER_SPERRET BIT  (1)   INIT ('1'B),               
              2   W02_MER_DATA            BIT  (1)   INIT ('1'B),               
              2   W02_SS_ER_DØD           BIT  (1)   INIT ('0'B),               
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');          
                                                                                
       DCL    W01_IO                 CHAR (150)      INIT ( '' );               
       DCL    W01_HJELPE_IO          CHAR (150) BASED (W01_HJELPE_PTR);         
       DCL    W_BKTYPE               CHAR (2);                                  
                                                                                
       DCL 1  W01_STATUS      UNALIGNED,                                        
       %INCLUDE P0019930;                            /* STATUS_SEGM */          
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL    SSA_UQUAL                          CHAR (9) INIT ((9)' ');        
                                                                                
       DCL 1  SSA1_RF0PERSN                ,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('RF0PERSN(FNR     '),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA1_STATUS                  ,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('STATUS  (STATKODE'),                                       
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    KODE                          CHAR (1)   INIT (' ' ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA2_STATUS                  ,                                    
              2    HDEL                          CHAR (19)  INIT                
                   ('STATUS  *F(STATKODE'),                                     
              2    REL_OP                        CHAR (2)   INIT (' ='),        
              2    KODE                          CHAR (1)   INIT ('N' ),        
              2    HP                            CHAR (1)   INIT (')' );        
                                                                                
       DCL 1  SSA1_TRANHIST                ,                                    
              2    HDEL                          CHAR (17)  INIT                
                   ('TRANHIST(VIRKDATO'),                                       
              2    REL_OP                        CHAR (2)   INIT ('=>'),        
              2    VTP               FIXED       DEC  (8)   INIT (0),           
              2    HP                            CHAR (1)   INIT (')');         
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */        
                                                                                
    %PAGE;                                                                      
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                           
    %INCLUDE P0012003;                         /* PCB                 */        
                                                                                
       DCL   HJELPEDATO       PIC '(8)9';                                       
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
    /*     ---------------------------------------------------        */        
    /*                                                                */        
    /*                                                                */        
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */        
    /*                                                                */        
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */        
    /*      INITIERINGS-KALL   I     R0012001 .                       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    DB_STATUS_KODE                          =   '  ';                           
    IF FEIL_MELD_NR = 0 THEN PROGRAM_ID     =   'R0013110';                     
    UIBPTR                                  =    UIB_PEKER;                     
                                                                                
    /* ********************************************************** */            
    /*        SJEKKER ROT-SEGM FINNES FRA FØR.                    */            
    /* ********************************************************** */            
                                                                                
    IF    SEARCH_FNR                     =    0                 THEN            
      DO;                                                                       
        IF  TRANS_OPPL_OMR.BLANKETTYPE  ^=    'EP'   &                          
            TRANS_OPPL_OMR.BLANKETTYPE  ^=    'E3'   &                          
            TRANS_OPPL_OMR.BLANKETTYPE  ^=    'EE'   &                          
            TRANS_OPPL_OMR.BLANKETTYPE  ^=    'BP'   &                          
            TRANS_OPPL_OMR.BLANKETTYPE  ^=    'B6'   &                          
            TRANS_OPPL_OMR.BLANKETTYPE  ^=    'FB'   &                          
            TRANS_OPPL_OMR.BLANKETTYPE  ^=    'F5'              THEN            
          DO;                                                                   
            /* ********************************************** */                
            /* NULL I FNR . KJØRING AVBRYTES                  */                
            /* ********************************************** */                
  L100:                                                                         
            FEIL_MELD_NR                 =   498;                               
            FEIL_VED_LABEL               =  '100';                              
          END;                                                                  
        GO TO L999;                                                             
      END;                                                                      
                                                                                
    /* ********************************************************** */            
    /* KALLER PROGRAMMET FOR Å SJEKKE OG EVT. SPERRE ROT-SEGM.    */            
    /* ********************************************************** */            
                                                                                
    EXEC CICS LINK PROGRAM ('R0015601')  COMMAREA (KOM_OMR);                    
                                                                                
                                                                                
    IF FEIL_MELD_NR      >  0            THEN                                   
       DO;                                                                      
          /* **************************************** */                        
          /*  FEIL VED SPERRE-BEHANDLING              */                        
          /* **************************************** */                        
                                                                                
          GO TO L999;                                                           
       END;                                                                     
    ELSE                                                                        
                                                                                
       PROGRAM_ID   =   'R0013110';                                             
                                                                                
                                                                                
    /* ********************************************************** */            
    /* BEHANDLING AV ROT OK. SJEKKER I B01 OM PERSONEN FINNES I DB*/            
    /* ********************************************************** */            
                                                                                
    IF B01.RF0PERSN.FNR (POS_I_B01)   >  0            THEN                      
       DO;                                                                      
                                                                                
          SSA1_RF0PERSN.PKEY                  =    SEARCH_FNR;                  
                                                                                
          /* *********************************************** */                 
          /*  LESER SEGMENTENE UNDER ROT   -->    B01        */                 
          /* *********************************************** */                 
                                                                                
          CALL P10_LES_SEGM;                                                    
                                                                                
          DO WHILE ( W02_MER_DATA );                                            
                                                                                
            IF FEIL_MELD_NR      >  0            THEN                           
               GO TO L999;                                                      
                                                                                
            SELECT ( RF1.SEGM_NAVN );                                           
              WHEN ('PINNTEKT')                                                 
                /* ***************************************** */                 
                /*   LEGGER  INNTEKTS-OPPLYSNINGENE I  B 0 1 */                 
                /*   ENDRET 19.02.91 AV O.G._X_INNT_SEGMENT  */                 
                /*   VED 'X': INNTEKT AKKUMULERES I 'POS+12' */                 
                /*            MEN 'POS < 3' PGA. POS_MAX=14  */                 
                /* ***************************************** */                 
                DO;                                                             
                  SUBSTR ( ADDR          ( W01_PINT )                           
                  -> W01_HJELPE_IO,1,STG ( W01_PINT )) =  W01_IO;               
                                                                                
                  IF W01_PINT.W02_PI_TYPE  = 'X'                   THEN         
                     IF POS_I_B01 <  3                    THEN                  
                       DO;                                                      
                        B01.PINNTEKT.PI ((POS_I_B01 + 12), W02_PI_ÅR)           
                                                             = W02_PI;          
                        B01.TP_GAR_KODE(POS_I_B01 + 12) = 'I';                  
                       END;                                                     
                     ELSE;                                                      
                  ELSE                                                          
                  DO;                                                           
                        B01.PINNTEKT.PI(POS_I_B01 , W02_PI_ÅR) =                
                             B01.PINNTEKT.PI (POS_I_B01 , W02_PI_ÅR) +          
                                                      W02_PI;                   
      /*              B01.PI_KODE (POS_I_B01 , W02_PI_ÅR)  = 'O';*/             
      /*          END;                                           */             
                  IF W01_PINT.W02_PI_TYPE  = 'J' !                              
                     W01_PINT.W02_PI_TYPE  = 'K' !                              
                     W01_PINT.W02_PI_TYPE  = 'L'          THEN                  
                     IF POS_I_B01 <  3                    THEN                  
                       DO;                                                      
                        IF B01.PI_KODE(POS_I_B01,W02_PI_ÅR) = 'F' THEN          
                              B01.PI_KODE(POS_I_B01,W02_PI_ÅR) = 'M';           
                        ELSE                                                    
                              B01.PI_KODE(POS_I_B01,W02_PI_ÅR) =                
                                               W01_PINT.W02_PI_TYPE;            
                       END;                                                     
                     ELSE;                                                      
                  ELSE                                                          
                  IF B01.PI_KODE (POS_I_B01 , W02_PI_ÅR) = 'J' !                
                     B01.PI_KODE (POS_I_B01 , W02_PI_ÅR) = 'K' !                
                     B01.PI_KODE (POS_I_B01 , W02_PI_ÅR) = 'L'  THEN            
                     IF  W01_PINT.W02_PI_TYPE           = 'A ' THEN             
                       B01.PI_KODE (POS_I_B01 , W02_PI_ÅR) = 'M';               
                     ELSE;                                                      
                  ELSE                                                          
                  IF  W01_PINT.W02_PI_TYPE           = 'A ' THEN                
                     B01.PI_KODE (POS_I_B01 , W02_PI_ÅR) = 'F';                 
                  ELSE                                                          
                     B01.PI_KODE (POS_I_B01 , W02_PI_ÅR) = 'O';                 
                END;                                                            
                  CALL    P10_LES_SEGM;                                         
              END;                                                              
                                                                                
              WHEN ('TILBERPO')                                                 
                /* ****************************************** */                
                /*   TILLEGGSOPPLYSNINGER FOR                 */                
                /*   POENGBEREGNINGEN         ->   B 0 1      */                
                /* ****************************************** */                
                DO;                                                             
                  SUBSTR (ADDR (B01.TILBERPO   ( POS_I_B01))                    
                       -> W01_HJELPE_IO,1,STG  ( B01.TILBERPO (                 
                              POS_I_B01 ))) =    W01_IO;                        
                                                                                
                  CALL    P10_LES_SEGM;                                         
                END;                                                            
                                                                                
              WHEN ('EOAFP   ')                                                 
                /* ****************************************** */                
                /*   TILLEGGSOPPLYSNINGER FOR                 */                
                /*   POENGBEREGNINGEN         ->   B 0 1      */                
                /* ****************************************** */                
                DO;                                                             
                  W02_EOAFP_TELLER    =   W02_EOAFP_TELLER + 1;                 
                  SUBSTR (ADDR (B01.EOAFP(POS_I_B01, W02_EOAFP_TELLER))         
                                                                                
                       -> W01_HJELPE_IO,1,STG ( B01.EOAFP(POS_I_B01,            
                                        W02_EOAFP_TELLER ))) =  W01_IO;         
                                                                                
                  CALL    P10_LES_SEGM;                                         
                                                                                
                END;                                                            
              WHEN ('STATUS  ')                                                 
                /* ***************************************** */                 
                /* HVIS FORESP. ELLER ØNSKET_STATUS ER SATT  */                 
                /* ----------------------------------------- */                 
                /*                                           */                 
                /*     KALLES EN PROC SOM LESER INN ØNSKET   */                 
                /*     STATUS-SEGM. MED UNDERLIGGENDE SEGM.  */                 
                /*                                           */                 
                /*                                           */                 
                /* HVIS IKKE :                               */                 
                /* -----------                               */                 
                /*                                           */                 
                /*     KALLES EN PROC SOM LESER INN STATUS   */                 
                /*     I RELASJON TIL VIRKDATO I TRANSEN     */                 
                /*     OG SETTER :                           */                 
                /*                                           */                 
                /*         STATUS_TYPE =  A,B,C,D,F,G,H,I    */                 
                /*                                           */                 
                /* ***************************************** */                 
                DO;                                                             
                  IF  FUNKSJONSKODE    =      'F'   !                           
                      ØNSKET_STATUS   ^=      ' '   THEN                        
                      CALL P50_BEHANDLE_STATUS_FORESPØRSEL;                     
                  ELSE                                                          
                      CALL P30_BEHANDLE_STATUS;                                 
                END;                                                            
                                                                                
              OTHERWISE                                                         
                /* ****************************************** */                
                /*   SLUTT PÅ AKTUELLE DATA                   */                
                /* ****************************************** */                
                DO;                                                             
                  W02_MER_DATA                  =   '0'B;                       
                END;                                                            
                                                                                
            END;   /* SELECT :     SEGM-NAVN             */                     
                                                                                
          END;     /* DO WHILE (MER_DATA)                */                     
                                                                                
       END;        /* IF B01.RF0PERSN.FNR (POS_I_B01)    */                     
                                                                                
       /* ********************************************** */                     
       /*      SJEKKER OM STATUS_TYPE ER SATT .          */                     
       /* ********************************************** */                     
                                                                                
       IF STATUS_TYPE         =    ' '     THEN                                 
          STATUS_TYPE         =    'A';                                         
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /* ************************************************************** */        
    /* **********                                       ************* */        
    /* ******        INTERNE    PROCEDURER                  ********* */        
    /* **********                                       ************* */        
    /* ************************************************************** */        
    /* ************************************************************** */        
                                                                                
     %PAGE;                                                                     
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE NESTE SEGMENT ( GN    UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P10_LES_SEGM :                                                              
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( RF1.STATUS_KODE );                                           
            WHEN ( '  ' , 'GA' , 'GK' )                                         
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GE' , 'GB' )                                                
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L150:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '150';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L160:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '160';                                
        END;                                                                    
    END P10_LES_SEGM;                                                           
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE NESTE SEGMENT (GN  KVAL. PÅ ROT UKVAL.NESTE */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P20_LES_SEGM_KVAL :                                                         
      PROC ;                                                                    
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN,                 
                                                 SSA_UQUAL);                    
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( RF1.STATUS_KODE );                                           
            WHEN ( '  ' )                                                       
              W02_MER_DATA                 =    '1'B;                           
            WHEN ( 'GA' , 'GB' , 'GE' , 'GK' )                                  
              W02_MER_DATA                 =    '0'B;                           
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L170:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '170';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L180:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '180';                                
        END;                                                                    
    END P20_LES_SEGM_KVAL;                                                      
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å BEHANDLE :                                     */        
    /* ---------------------------                                    */        
    /*                                                                */        
    /*        STATUS   OPPLYSNINGENE        ->  B 0 1 .               */        
    /*        SYSTEM - STATUS'EN SETTES LIK :   A,B,C,D,F,G,H,I       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P30_BEHANDLE_STATUS :                                                       
      PROC;                                                                     
                                                                                
      SUBSTR (ADDR ( W01_STATUS )                                               
              ->     W01_HJELPE_IO,1,STG ( W01_STATUS ))  =  W01_IO ;           
                                                                                
      /* ******************************************************  */             
      /*FOR Å FÅ BORT DAGER             :           9912        */              
      /* ******************************************************  */             
                                                                                
      HJELPEDATO = W01_STATUS.VIRK_DATO_ÅMD / 100;                              
      HJELPEDATO = HJELPEDATO * 100;                                            
      W01_STATUS.VIRK_DATO_ÅMD =  HJELPEDATO;                                   
                                                                                
                                                                                
      IF TRANS_OPPL_OMR.BLANKETTYPE = 'AU'  THEN                                
                                                                                
          DIV_PARAM_OMR.TRANS_VIRKDATO_ÅMD  =                                   
                                         W01_STATUS.VIRK_DATO_ÅMD;              
                                                                                
      IF DIV_PARAM_OMR.TRANS_VIRKDATO_ÅMD  >=                                   
                                         HJELPEDATO               THEN          
         DO;                                                                    
            /* ****************************************************** */        
            /*     NY VIRK.DATO  >=  VIRK.DATO TIL    :               */        
            /*                                                        */        
            /*         SISTE STATUS  /  NEST SISTE STATUS             */        
            /* ****************************************************** */        
                                                                                
            IF W01_STATUS.STATUS_KODE          =   'S'      THEN                
                                                                                
               /* ************************************************* */          
               /*  NY VTP   >=   VTP    SISTE STATUS                */          
               /* ************************************************* */          
                                                                                
               IF W01_STATUS.STATUS_KODE_HIST     =   'X'      THEN             
                  DO;                                                           
                     /* ******************************************* */          
                     /* NY VTP   >=   VTP  SISTE STATUS             */          
                     /*                                             */          
                     /*  HISTORISK TILFELLE :  SJEKKER OM     D Ø D */          
                     /*  --------------------  OG OPPGITT SOM D Ø D */          
                     /* ******************************************* */          
                                                                                
                     IF W01_STATUS.DØDSDATO_ÅMD     >    0        THEN          
                                                                                
                        IF DIV_PARAM_OMR.DØD                      THEN          
                           DO;                                                  
                              /* *********************************** */         
                              /* PERSONEN ER: DØD OG OPPGITT SOM DØD */         
                              /* *********************************** */         
                                                                                
                              STATUS_TYPE            =    'I';                  
                              CALL P40_LES_STATUS_OMR_TIL_B01;                  
                           END;                                                 
                        ELSE                                                    
                           DO;                                                  
                              /* *********************************** */         
                              /*  PERSONEN ER:  DØD  OG              */         
                              /*                IKKE OPPGITT SOM DØD */         
                              /* *********************************** */         
                                                                                
                              STATUS_TYPE    =     'H' ;                        
                              W02_MER_DATA   =     '0'B;                        
                           END;                                                 
                     ELSE                                                       
                        DO;                                                     
                           /* ************************************ */           
                           /* PERSONEN ER : ET AVSLUTTET UFØRE-    */           
                           /*               TILFELLE               */           
                           /*                                      */           
                           /* HVIS GIFT   : PT1 = 'A' ! 'G' ! 'F'  */           
                           /*               STATUS_TYPE = B.       */           
                           /* ************************************ */           
                                                                                
                           IF (W01_STATUS.PENSJONSTYPE1 = 'A' !                 
                               W01_STATUS.PENSJONSTYPE1 = 'G' !                 
                               W01_STATUS.PENSJONSTYPE1 = 'F' ) THEN            
                                                                                
                              STATUS_TYPE              =  'B'       ;           
                           ELSE                                                 
                              STATUS_TYPE              =  'I'       ;           
                                                                                
                           CALL  P40_LES_STATUS_OMR_TIL_B01         ;           
                        END;                                                    
                  END;                                                          
               ELSE                                                             
                  IF W01_STATUS.STATUS_KODE_HIST   =  'O'       THEN            
                     DO;                                                        
                        /* ************************************* */             
                        /* NY VTP   >=   VTP   SISTE STATUS      */             
                        /*                                       */             
                        /*  HISTORISK TILFELLE .                 */             
                        /* ************************************* */             
                                                                                
                        STATUS_TYPE         =       'A';                        
                        CALL  P40_LES_STATUS_OMR_TIL_B01;                       
                     END;                                                       
                  ELSE                                                          
                     DO;                                                        
                        /* ************************************* */             
                        /* NY VTP   >=   VTP   SISTE STATUS      */             
                        /*                                       */             
                        /* IKKE HISTORISK TILFELLE .             */             
                        /* -------------------------             */             
                        /* ************************************* */             
                                                                                
                        STATUS_TYPE         =       'B';                        
                        CALL  P40_LES_STATUS_OMR_TIL_B01;                       
                     END;                                                       
            ELSE                                                                
               DO;                                                              
                  /* ********************************************* */           
                  /*  NY VTP  >=   VTP        NEST SISTE STATUS    */           
                  /*    ):   DET FINNES INGEN      SISTE STATUS    */           
                  /*                                               */           
                  /*   UNDERSØKER OM :  NY VTP  >=   GML.TRANS VTP */           
                  /* ********************************************* */           
                                                                                
                  CALL  P35_SJEKK_VTP_TRANS;                                    
                                                                                
                  IF FEIL_MELD_NR         >   0          THEN                   
                     DO;                                                        
                       /* ************************************** */             
                       /*  FEIL VED  P35_SJEKK_VTP_TRANS         */             
                       /* ************************************** */             
                                                                                
                       GO TO RETUR;                                             
                     END;                                                       
               END;                                                             
                                                                                
         END;       /*  DO   NY VIRK.DATO  =>  VIRKDATO       */                
      ELSE                                                                      
         /* **************************************************** */             
         /* NY  VTP   <   VTP   LEST STATUS                      */             
         /* **************************************************** */             
                                                                                
         IF W01_STATUS.STATUS_KODE          =   'S'      THEN                   
                                                                                
            /* ************************************************ */              
            /*   NY VTP  <   VTP  SISTE STATUS                  */              
            /* ************************************************ */              
                                                                                
            IF W01_STATUS.FØRSTE_GANG_REG      =   'J'      THEN                
               DO;                                                              
                  /* ******************************************** */            
                  /*   NY VTP  <   VTP  SISTE STATUS              */            
                  /*   SISTE STATUS ER  1. GANGS REG.             */            
                  /* ******************************************** */            
                                                                                
                  STATUS_TYPE                     =   'C';                      
                  W02_MER_DATA                    =   '0'B;                     
                  B01.STATUS(POS_I_B01)           = '';                         
               END;                                                             
         ELSE                                                                   
            DO;                                                                 
               /* ******************************************** */               
               /*                                              */               
               /*  NY VTP  <   VTP  SISTE STATUS               */               
               /*  SISTE STATUS ER : IKKE REGISTRERT 1. GANG   */               
               /*  MÅ SJEKKE VIRKN.DATO PÅ  NEST SISTE STATUS. */               
               /*            ----------     ------------------ */               
               /*                                              */               
               /* UNDERSØKER OM SISTE STATUS ER ET DØDSTILFELLE*/               
               /*                                              */               
               /* ******************************************** */               
                                                                                
               IF W01_STATUS.DØDSDATO_ÅMD >    0           THEN                 
                  W02_SS_ER_DØD           =   '1'B;                             
                                                                                
               SSA_UQUAL                  =   'STATUS   ';                      
               CALL P20_LES_SEGM_KVAL;                                          
                                                                                
               IF FEIL_MELD_NR            >    0           THEN                 
                  DO;                                                           
                     /* **************************************** */             
                     /*   FEIL VED LES AV STATUS                 */             
                     /* **************************************** */             
                                                                                
                     GO TO RETUR;                                               
                  END;                                                          
                                                                                
               SELECT   ( RF1.STATUS_KODE );                                    
                  WHEN  ( '  ' )                                                
                     DO;                                                        
                        /* ************************************** */            
                        /* NY VTP   <    VTP  SISTE STATUS        */            
                        /* DET FINNES EN NEST SISTE STATUS        */            
                        /* ************************************** */            
                                                                                
                        SUBSTR (ADDR            (W01_STATUS)                    
                         -> W01_HJELPE_IO,1,STG (W01_STATUS)) = W01_IO;         
                                                                                
                           HJELPEDATO = W01_STATUS.VIRK_DATO_ÅMD / 100;         
                           HJELPEDATO = HJELPEDATO * 100;                       
                        IF DIV_PARAM_OMR.TRANS_VIRKDATO_ÅMD  >=                 
                                   HJELPEDATO                   THEN            
                           DO;                                                  
                              /* ********************************* */           
                              /* NYTT VTP  < VTP      SISTE STATUS */           
                              /* NYTT VTP >= VTP NEST SISTE STATUS */           
                              /* NEST SISTE ER OPPHØRT MED KODE X  */           
                              /* OG NEST SISTE ER IKKE DØD .       */           
                              /* ********************************* */           
                                                                                
                              IF W01_STATUS.STATUS_KODE_HIST ='X'&              
                                 W01_STATUS.DØDSDATO_ÅMD     = 0 THEN           
                                 DO;                                            
                                    STATUS_TYPE              =   'K';           
                                    CALL  P40_LES_STATUS_OMR_TIL_B01;           
                                 END;                                           
                              ELSE                                              
                                 /* ********************************* */        
                                 /* NYTT VTP  < VTP      SISTE STATUS */        
                                 /* NYTT VTP >= VTP NEST SISTE STATUS */        
                                 /* NEST SISTE ER IKKE OPPHØRT MED X  */        
                                 /* ELLER NEST SISTE ER DØD .         */        
                                 /* SISTE STATUS :  DØD               */        
                                 /* ********************************* */        
                                                                                
                                 IF W02_SS_ER_DØD                   THEN        
                                    DO;                                         
                                       STATUS_TYPE             =    'G';        
                                       CALL  P40_LES_STATUS_OMR_TIL_B01;        
                                    END;                                        
                                                                                
                                 /* ********************************* */        
                                 /* NYTT VTP  < VTP      SISTE STATUS */        
                                 /* NYTT VTP >= VTP NEST SISTE STATUS */        
                                 /* NEST SISTE ER IKKE OPPHØRT MED X  */        
                                 /* ELLER NEST SISTE ER DØD .         */        
                                 /* SISTE STATUS :  IKKE DØD          */        
                                 /* ********************************* */        
                                                                                
                                 ELSE                                           
                                    DO;                                         
                                       STATUS_TYPE              =   'D';        
                                       CALL  P40_LES_STATUS_OMR_TIL_B01;        
                                    END;                                        
                           END;                                                 
                        ELSE                                                    
                           DO;                                                  
                              /* ********************************** */          
                              /* NYTT VTP  < VTP      SISTE STATUS  */          
                              /* NYTT VTP  < VTP NEST SISTE STATUS  */          
                              /* ********************************** */          
     /*  DENNE ER ANGONE TRANSER= Z                                             
                               W_BKTYPE = TRANS_OPPL_OMR.BLANKETTYPE;           
                               IF W01_STATUS.FØRSTE_GANG_REG = 'J' THEN         
                                  DO;                                           
                                                                                
                                      IF W_BKTYPE  ^= 'EN' !                    
                                         W_BKTYPE  ^= 'E1' !                    
                                         W_BKTYPE  ^= 'FT' !                    
                                         W_BKTYPE  ^= 'FO' !                    
                                         W_BKTYPE  ^= 'F7' !                    
                                         W_BKTYPE  ^= 'TG' !                    
                                         W_BKTYPE  ^= 'AU' !                    
                                         W_BKTYPE  ^= 'O2' !                    
                                         W_BKTYPE  ^= 'O1'    THEN              
                                         DO;                                    
                                            STATUS_TYPE = 'Z';                  
                                            W02_MER_DATA  = '0'B;               
                                            B01.STATUS(POS_I_B01) = '';         
                                         END;                                   
                                  END;                                          
                               ELSE                                             
                                  DO; */                                        
                                     DIV_PARAM_OMR.STATUS_TYPE  =  'F';         
                                     W02_MER_DATA             =  '0'B;          
                              /*  END; */                                       
                            END;                                                
                     END;                                                       
                                                                                
                  WHEN  ( 'GE' , 'GB' )                                         
                     DO;                                                        
                        /* ************************************** */            
                        /* NYTT VTP  < VTP         SISTE STATUS   */            
                        /* DET FINNES INGEN   NEST SISTE STATUS   */            
                        /* OG SISTE STATUS ER IKKE 1.GANGS REG.   */            
                        /* ************************************** */            
                                                                                
                        DIV_PARAM_OMR.STATUS_TYPE  =  'F';                      
                        W02_MER_DATA               =  '0'B;                     
                     END;                                                       
                  OTHERWISE                                                     
                     DO;                                                        
                        /* ************************************** */            
                        /* UGYLDIG STATUS KODER FRA DL1           */            
                        /* ************************************** */            
  L190:                                                                         
                        DB_STATUS_KODE            =   RF1.STATUS_KODE;          
                        FEIL_MELD_NR              =   500;                      
                        FEIL_VED_LABEL            =  '190';                     
                        GO TO RETUR;                                            
                     END;                                                       
                                                                                
               END;    /*    SELECT  :   RF1.STATUS_KODE              */        
                                                                                
            END;       /*    DO      :   IKKE 1.GANGS REG.           */         
         ELSE                                                                   
            DO;                                                                 
               /* ************************************************ */           
               /*  VIRKDATO  <  VIRKDATO   NEST SISTE STATUS       */           
               /* ************************************************ */           
                                                                                
               STATUS_TYPE             =    'F' ;                               
               W02_MER_DATA            =    '0'B;                               
            END;                                                                
  RETUR:                                                                        
    END P30_BEHANDLE_STATUS ;                                                   
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* NY  VTP  >=   VTP    NEST SISTE STATUS                         */        
    /*               INGEN       SISTE STATUS                         */        
    /*                                                                */        
    /* PROCEDUREN SJEKKER :      VTP   GAMMEL TRANS                   */        
    /* -----------------------                                        */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P35_SJEKK_VTP_TRANS:                                                        
      PROC;                                                                     
                                                                                
      /* ************************************************************ */        
      /*  UNDERSØKER OM DET FINNES EN TRANS MED :   VTP  >=  NY VTP   */        
      /* ************************************************************ */        
                                                                                
      SSA1_TRANHIST.VTP                     =    TRANS_VIRKDATO_ÅMD;            
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN,                 
                                                 SSA1_TRANHIST);                
                                                                                
      IF UIBFCTR                          ^=     UIB_RC_OK    THEN              
         DO;                                                                    
            /* ************************************************** */            
            /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */            
            /* ************************************************** */            
  L200:                                                                         
            FEIL_MELD_NR               =     500;                               
            FEIL_VED_LABEL             =    '200';                              
            GO   TO  RETUR;                                                     
         END;                                                                   
                                                                                
                                                                                
      SELECT   ( RF1.STATUS_KODE );                                             
         WHEN  ( '  ' , 'GA' , 'GK' )                                           
            DO;  /* RF1.STATUS_KODE = '  ' ! 'GA' ! 'GK' */                     
               /* ************************************** */                     
               /*  INGEN                  SISTE STATUS   */                     
               /*  NY VTP   >=   VTP NEST SISTE STATUS   */                     
               /*  NY VTP    <   VTP GML. TRANS          */                     
               /* ************************************** */                     
                                                                                
               STATUS_TYPE                 =    'D';                            
               CALL PLITDLI                     (W02_PARM_CT_5,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_IO,                        
                                                 SSA1_RF0PERSN,                 
                                                 SSA2_STATUS);                  
                                                                                
               IF   UIBFCTR               ^=     UIB_RC_OK    THEN              
                  DO;                                                           
                     /* ****************************************** */           
                     /*   UIB'S RETUR-CODE ER UAKSEPTABEL          */           
                     /* ****************************************** */           
  L210:                                                                         
                     FEIL_MELD_NR               =     500;                      
                     FEIL_VED_LABEL             =    '210';                     
                     GO   TO  RETUR;                                            
                  END;                                                          
                                                                                
               IF (RF1.STATUS_KODE = '  ' !                                     
                   RF1.STATUS_KODE = 'GA' !                                     
                   RF1.STATUS_KODE = 'GK' ) THEN                                
                  DO;                                                           
                     /* ****************************************** */           
                     /*   PCB'EN PEKER PÅ NEST SISTE STATUS        */           
                     /* ****************************************** */           
                                                                                
                     CALL  P40_LES_STATUS_OMR_TIL_B01;                          
                  END;                                                          
               ELSE                                                             
                  DO;                                                           
                     /* ****************************************** */           
                     /*   PCB'EN SKULLE PEKT PÅ NEST SISTE STATUS  */           
                     /* ****************************************** */           
  L220:                                                                         
                     FEIL_MELD_NR               =     500;                      
                     FEIL_VED_LABEL             =    '220';                     
                     GO   TO  RETUR;                                            
                  END;                                                          
            END;  /* RF1.STATUS_KODE = '  ' ! 'GA' ! 'GK' */                    
                                                                                
         WHEN  ( 'GE' , 'GB' )                                                  
            DO;                                                                 
               /* ************************************** */                     
               /*  INGEN                  SISTE STATUS   */                     
               /*  NY VTP   >=   VTP NEST SISTE STATUS   */                     
               /*  NY VTP   >=   VTP GML. TRANS          */                     
               /* ************************************** */                     
                                                                                
               STATUS_TYPE          =   'A' ;                                   
               W02_MER_DATA         =   '0'B;                                   
            END;                                                                
                                                                                
         OTHERWISE                                                              
            DO;                                                                 
               /* ************************************************** */         
               /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */         
               /* ************************************************** */         
  L230:                                                                         
               FEIL_MELD_NR               =     500;                            
               FEIL_VED_LABEL             =    '230';                           
            END;                                                                
      END;  /*      SELECT  (RF1.STATUS_KODE)                      */           
                                                                                
  RETUR:                                                                        
    END P35_SJEKK_VTP_TRANS;                                                    
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE STATUS-SEGMENTENE TIL B01                   */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P40_LES_STATUS_OMR_TIL_B01:                                                 
      PROC;                                                                     
                                                                                
      /* ************************************************************ */        
      /*  STATUS - SEGMENTET       ------>      B01                   */        
      /* ************************************************************ */        
                                                                                
      SUBSTR (ADDR (B01.STATUS        ( POS_I_B01 ))                            
           -> W01_HJELPE_IO,1 ,STG    ( B01.STATUS ( POS_I_B01 )))              
                              =         W01_IO ;                                
                                                                                
                                                                                
      /* ************************************************************ */        
      /*  LESER  UNDERLIGENDE SEGM TIL STATUS     ------->  B01       */        
      /* ************************************************************ */        
                                                                                
      CALL    P10_LES_SEGM;                                                     
                                                                                
      DO      WHILE    ( W02_MER_DATA ) ;                                       
                                                                                
        IF    FEIL_MELD_NR      >  0            THEN                            
          DO;                                                                   
             /* **************************************** */                     
             /*  FEIL VED LES                            */                     
             /* **************************************** */                     
                                                                                
             GO TO RETUR;                                                       
          END;                                                                  
                                                                                
                                                                                
        SELECT         ( RF1.SEGM_NAVN ) ;                                      
                                                                                
          WHEN         ('TILKN    ')                                            
            /* ****************************************************** */        
            /*    TILKNYTTNINGS - OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              W02_TILKNY_TELLER            =      W02_TILKNY_TELLER + 1;        
                                                                                
              SUBSTR (ADDR (B01.TILKN    ( POS_I_B01,                           
                                           W02_TILKNY_TELLER ))                 
               -> W01_HJELPE_IO,1,STG    ( B01.TILKN (                          
                      POS_I_B01   ,        W02_TILKNY_TELLER )))                
                                    =      W01_IO;                              
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('ALDERSP  ')                                            
            /* ****************************************************** */        
            /*    ALDERSP      - OPPLYSNINGENE   ->   B 0 1 .         */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR (B01.ALDERSP        ( POS_I_B01 ))                   
                ->    W01_HJELPE_IO,1,                                          
                          STG   (B01.ALDERSP   (1  ))  -                        
                         (STG   (B01.VENTØVR   (1,1) )   * 5) )                 
                                                                                
                                        =      W01_IO;                          
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('VENTØVR  ')                                            
            /* ****************************************************** */        
            /*    VENTØVR       - OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              W02_VENTØV_TELLER           =      W02_VENTØV_TELLER + 1;         
                                                                                
              SUBSTR (ADDR (B01.VENTØVR  ( POS_I_B01,                           
                                           W02_VENTØV_TELLER ))                 
                -> W01_HJELPE_IO,1,STG   ( B01.VENTØVR (                        
                   POS_I_B01    ,          W02_VENTØV_TELLER )))                
                                   =       W01_IO;                              
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('AFPHIST  ')                                            
            /* ****************************************************** */        
            /*    AFPHIST       - OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              W02_AFPHIS_TELLER      =   W02_AFPHIS_TELLER + 1;                 
                                                                                
              SUBSTR (ADDR (B01.AFPHIST  ( POS_I_B01,                           
                                           W02_AFPHIS_TELLER ))                 
                                                                                
                -> W01_HJELPE_IO,1,STG   ( B01.AFPHIST (                        
                   POS_I_B01    ,          W02_AFPHIS_TELLER )))                
                                   =       W01_IO;                              
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('UFØRPENS ')                                            
            /* ****************************************************** */        
            /*    UFØREPENSJONS - OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR (B01.UFØRPENS    ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.UFØRPENS (                    
                      POS_I_B01 )))    =      W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN ('UFØRHIST')                                                     
            /* ****************************************** */                    
            /*   UFØREHISTORIKK-OPPLYSNINGENE   ->  B 0 1 */                    
            /* ****************************************** */                    
            DO;                                                                 
              W02_UFHIST_TELLER = W02_UFHIST_TELLER + 1;                        
                                                                                
                                                                                
              W02_UFGRAD_TELLER = 0;                                            
                                                                                
                                                                                
              SUBSTR (ADDR (B01.UFØRHIST (POS_I_B01,                            
                            W02_UFHIST_TELLER ))                                
              -> W01_HJELPE_IO ,1,                                              
                     STG   (B01.UFØRHIST (1,1) )  -                             
                    (STG   (B01.UFØRGRAD (1,1,1))) * 12) = W01_IO;              
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN ('UFØRGRAD')                                                     
            /* ****************************************** */                    
            /*   UFØREGRAD-OPPLYSNINGENE   ->   B 0 1 .   */                    
            /* ****************************************** */                    
            DO;                                                                 
              W02_UFGRAD_TELLER = W02_UFGRAD_TELLER + 1;                        
                                                                                
              SUBSTR   (ADDR        (B01.UFØRGRAD (POS_I_B01,                   
                    W02_UFHIST_TELLER , W02_UFGRAD_TELLER ))                    
                 -> W01_HJELPE_IO,1,STG (B01.UFØRGRAD (                         
                        POS_I_B01 , W02_UFHIST_TELLER ,                         
                                    W02_UFGRAD_TELLER ))) =  W01_IO;            
                                                                                
              CALL  P10_LES_SEGM;                                               
            END;                                                                
                                                                                
          WHEN         ('YRKEPENS ')                                            
            /* ****************************************************** */        
            /* YRKESSKADEPENSJONS - OPPLYSNINGENE   ->   B 0 1 .      */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR (B01.YRKEPENS    ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.YRKEPENS (                    
                      POS_I_B01 )))    =      W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN ('YRKEHIST')                                                     
            /* ************************************************ */              
            /*   YRKESSKADE-HISTORIKK-OPPLYSNINGENE   ->  B 0 1 */              
            /* ************************************************ */              
            DO;                                                                 
              W02_YSHIST_TELLER = W02_YSHIST_TELLER + 1;                        
              W02_YSGRAD_TELLER = 0;                                            
                                                                                
              SUBSTR (ADDR (B01.YRKEHIST (POS_I_B01,                            
                            W02_YSHIST_TELLER ))                                
              -> W01_HJELPE_IO ,1,                                              
                     STG   (B01.YRKEHIST (1,1) )  -                             
                    (STG   (B01.YRKEGRAD (1,1,1))) * 5 ) = W01_IO;              
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN ('YRKEGRAD')                                                     
            /* ************************************************ */              
            /*   YRKESSKADE-GRAD-OPPLYSNINGENE   ->   B 0 1 .   */              
            /* ************************************************ */              
            DO;                                                                 
              W02_YSGRAD_TELLER = W02_YSGRAD_TELLER + 1;                        
                                                                                
              SUBSTR   (ADDR        (B01.YRKEGRAD (POS_I_B01,                   
                    W02_YSHIST_TELLER , W02_YSGRAD_TELLER ))                    
                 -> W01_HJELPE_IO,1,STG (B01.YRKEGRAD (                         
                        POS_I_B01 , W02_YSHIST_TELLER ,                         
                                    W02_YSGRAD_TELLER ))) =  W01_IO;            
                                                                                
              CALL  P10_LES_SEGM;                                               
            END;                                                                
                                                                                
          WHEN         ('ETTEPENS ')                                            
            /* ****************************************************** */        
            /*    ETTERLATTE  -   OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR  (B01.ETTEPENS   ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.ETTEPENS (                    
                      POS_I_B01 )))    =      W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
            /* ****************************************************** */        
            /*    FORSØRGINGSTILLEGG OPPLYSNINGENE   ->   B 0 1 .     */        
            /* ****************************************************** */        
          WHEN         ('FORSI    ')                                            
            DO;                                                                 
              SUBSTR (ADDR (B01.FORSI       ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.FORSI    (                    
                      POS_I_B01 )))    =      W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('ETTEBARN ')                                            
            /* ****************************************************** */        
            /*    ETTERLATTE BARN-OPPLYSNINGENE   ->   B 0 1          */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR (B01.ETTEBARN    ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.ETTEBARN (                    
                      POS_I_B01     )))  =    W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('EØSINFO  ')                                            
            /* ****************************************************** */        
            /*    SPESIAL    -    OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR (B01.EØSINFO     ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.EØSINFO  (                    
                      POS_I_B01 )))    =      W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          WHEN         ('SPESOPPL ')                                            
            /* ****************************************************** */        
            /*    SPESIAL    -    OPPLYSNINGENE   ->   B 0 1 .        */        
            /* ****************************************************** */        
            DO;                                                                 
              SUBSTR (ADDR (B01.SPESOPPL    ( POS_I_B01 ))                      
                ->    W01_HJELPE_IO,1,STG   ( B01.SPESOPPL (                    
                      POS_I_B01 )))    =      W01_IO;                           
                                                                                
              CALL P10_LES_SEGM;                                                
            END;                                                                
                                                                                
          OTHERWISE                                                             
            /* **************************************************** */          
            /*    FÅTT INN ET SEGMENT-NAVN SOM IKKE ER BRUKBART.    */          
            /* **************************************************** */          
            DO;                                                                 
              W02_MER_DATA                  =   '0'B;                           
            END;                                                                
                                                                                
        END;      /*       END PÅ SELECT-GRENEN                     */          
                                                                                
      END;        /* SLUTT PÅ DO LØKKE  ): INGEN FLERE STATUS-SEGM. */          
  RETUR:                                                                        
    END  P40_LES_STATUS_OMR_TIL_B01;                                            
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å BEHANDLE :                                     */        
    /* ---------------------------                                    */        
    /*                                                                */        
    /*        SISTE STATUS                                            */        
    /*                               ==>     B01   VED FORESPØRSEL    */        
    /*   NEST SISTE STATUS                                            */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P50_BEHANDLE_STATUS_FORESPØRSEL:                                            
      PROC;                                                                     
                                                                                
      SUBSTR (ADDR ( W01_STATUS )                                               
              ->     W01_HJELPE_IO,1,STG ( W01_STATUS ))  =  W01_IO ;           
                                                                                
                                                                                
      IF  W01_STATUS.STATUS_KODE         =    ØNSKET_STATUS       THEN          
        DO;                                                                     
          /* ****************************************************** */          
          /*     LEST STATUS    =   ØNSKET STATUS                   */          
          /* ****************************************************** */          
                                                                                
          CALL  P40_LES_STATUS_OMR_TIL_B01;                                     
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ****************************************************** */          
          /*     LEST STATUS       ^=   ØNSKET STATUS               */          
          /*                                                        */          
          /*     HVIS LEST STATUS  ^=  'N'  (NEST SISTE STATUS)     */          
          /*     SJEKKES NESTE STATUS-SEGM.                         */          
          /* ****************************************************** */          
                                                                                
          IF  W01_STATUS.STATUS_KODE    ^=   'N'                THEN            
            DO;                                                                 
              SSA_UQUAL                  =   'STATUS   ';                       
              CALL  P20_LES_SEGM_KVAL;                                          
                                                                                
              IF   FEIL_MELD_NR          >     0                THEN            
                DO;                                                             
                  /* *********************************************** */         
                  /*   FEIL VED LES                                  */         
                  /* *********************************************** */         
                                                                                
                  GO   TO  RETUR;                                               
                END;                                                            
                                                                                
              IF   W02_MER_DATA                                 THEN            
                DO;                                                             
                  /* *********************************************** */         
                  /*   LEST INN ET NYTT STATUS-SEGMENT.              */         
                  /*   SIDEN DET FORRIGE LESTE SEGM. IKKE VAR DET    */         
                  /*   ØNSKEDE , MÅ DETTE VÆRE DET.                  */         
                  /* *********************************************** */         
                                                                                
                  CALL  P40_LES_STATUS_OMR_TIL_B01;                             
                END;                                                            
            END;                                                                
          ELSE                                                                  
            DO;                                                                 
              /* *************************************************** */         
              /* LEST STATUS  ^=   ØNSKET STATUS                     */         
              /* LEST STATUS   =  'N'  ): FINNES INGEN ØNSKET STATUS */         
              /*                                                     */         
              /* *************************************************** */         
                                                                                
              W02_MER_DATA                =   '0'B;                             
                                                                                
              IF FUNKSJONSKODE           ^=   'F'       THEN                    
  L240:          DO;                                                            
                     FEIL_VED_LABEL       =   '240';                            
                     FEIL_MELD_NR         =    495 ;                            
                     GO   TO   RETUR;                                           
                 END;                                                           
            END;                                                                
        END;                                                                    
  RETUR:                                                                        
    END P50_BEHANDLE_STATUS_FORESPØRSEL;                                        
                                                                                
                                                                                
                                                                                
  L999:                                                                         
                                                                                
    EXEC CICS RETURN;                                                           
  END    R001311;                                                               
