 /*   SIST ENDRET PÅ PROD   2004.12.17 14.09.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 15.01.03 AV   SPA2970          */        
  /* **********************************************************    **/          
  /* DET ER DUMMY PROCEDURE FOR FEILMELDING           **/                       
  /* ************************************************************* **/          
   SKRIV_FEIL:                       /**   DUMMY PROC  **/                      
      PROC(FIXED_DEC_5);                                                        
                                                                                
      DCL                                                                       
        FIXED_DEC_5 UNAL FIXED DEC(5);                                          
                                                                                
   END SKRIV_FEIL;                                                              
                                                                                
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                         
                                                                                
           DCL                                                                  
             FIXED_DEC_5 UNAL FIXED DEC(5);                                     
                                                                                
   END SKRIV_FEIL_YP;                                                           
                                                                                
   SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                         
                                                                                
           DCL                                                                  
             FIXED_DEC_5 UNAL FIXED DEC(5);                                     
                                                                                
   END SKRIV_FEIL_SP;                                                           
                                                                                
   SKRIV_FEIL_EØS: PROC(FIXED_DEC_5); /** DUMMY PROC **/                        
                                                                                
           DCL                                                                  
             FIXED_DEC_5 UNAL FIXED DEC(5);                                     
                                                                                
   END SKRIV_FEIL_EØS;                                                          
