 /*       SIST ENDRET 22/06-98 10.23.52 AV   JDA7339                  */00000000
 /*       SIST ENDRET 04/06-98 15.10.09 AV   RFA9991                  */00000010
 %PAGE;                                /*   */                          00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0010809  -                                                    */00000040
 /*    PROGRAMMERER: JAN,MAI 81                                       */00000050
 /*HENSIKT:                                                           */00000060
 /*    R0010809 INNHOLDER:                                            */00000070
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000080
 /*           EP_TRANS_OMR.                                           */00000090
 /*    PROSEDYRENE ER SKILT UT FRA R0010802.      070587   BRITT      */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYRENE INCLUDES I ETTERLATTEBEHANDLINGA TIL DET MASKIN-   */00000120
 /*    ELLE FOLKETRYGDSYSTEMET.                                       */00000130
 /*    ARBEIDSOMRÅDE: P0010801  (LIGGER I R001.TEST.COPYLIB)          */00000140
 /*BRUK:                                                              */00000150
 /*    %INCLUDE R0010809;                                             */00000160
 /*    BLANK_EP_MAP:           BLANKER FELTENE PÅ MAPEN               */00000170
 /*    OVERFØR_EP_SØKER:       OVERFØRER EPDELEN MAP->ARBEIDSOMR      */00000180
 /*    OVERFØR_EP_SPES_SØKER:  OVERFØRER SPESIELL DEL SØKER           */00000190
 /*                            MAP->ARBEIDSOMR                        */00000200
 /*    OVERFØR_EP_SPES_AVDØDE: OVERFØRER SPESIELL DEL AVDØDE          */00000210
 /*                            MAP->ARBEIDSOMR                        */00000220
 /*    BLANK_YP_MAP: */      /*BLANKER FELTENE PÅ MAP YRKESSKADE      */00000230
 /*    OVERFØR_YP_SØKER:*/      /*OVERFØRER Y.SK.OPPL MAP->ARBEIDSOMR */00000240
 /* ***************************************************************** */00000250
 %PAGE;                                /*   */                          00000260
 /* BLANKING AV MAPEN  */                                               00000270
   BLANK_EP_MAP:                                                        00000280
   PROC;                                                                00000290
   DCL                                                                  00000300
     LOW BUILTIN;                                                       00000310
       S001081O.REGDATOO = LOW(6);                                      00000320
       S001081O.TERMIDO  = LOW(4);                                      00000330
       TP_PROSENTO       = LOW(2);                                      00000340
       FORVENTETO        = LOW(7);                                      00000350
       FAIO              = LOW(7);                                      00000360
       YSKADE_TILLEGGO   = LOW(1);                                      00000370
       FRAML_DATO_MÅO    = LOW(4);                                      00000380
       S001081O.FNR_EKO  = LOW(11);                                     00000390
       DØDSDATO_EKO      = LOW(6);                                      00000400
       PI_EKO            = LOW(7);                                      00000410
       VP_ÅR1_EKO        = LOW(2);                                      00000420
       VP_ÅR2_EKO        = LOW(2);                                      00000430
       VP_ÅR3_EKO        = LOW(2);                                      00000440
       VP_ÅR4_EKO        = LOW(2);                                      00000450
       STATSBORGERO      = LOW(3);                                      00000460
       BOSATTO           = LOW(3);                                      00000470
       FRAVIK_BOSATTO    = LOW(1);                                      00000480
       TRYGDET_3ÅRO      = LOW(1);                                      00000490
       FRA_TRY_3ÅRO      = LOW(1);                                      00000500
       FRAVIK_10_1O      = LOW(1);                                      00000510
       KONVENSJONO       = LOW(1);                                      00000520
       FRAVIK_19_3O      = LOW(1);                                      00000530
       FRAVIK_FLYKTO     = LOW(1);                                      00000540
       OVERKOMP_UTLO     = LOW(1);                                      00000550
       TT_ETTER_DØDO     = LOW(3);                                      00000560
       TT_F67O           = LOW(2);                                      00000570
       TT_E66_ÅO         = LOW(2);                                      00000580
       TT_E66_MO         = LOW(2);                                      00000590
       TT_FRAMT_10_1O    = LOW(2);                                      00000600
       TRYGDET_DØDO      = LOW(1);                                      00000610
       TT_VENT_UTLO      = LOW(2);                                      00000620
       IKKE_GPO          = LOW(1);                                      00000630
       STATSBORGER_EKO   = LOW(3);                                      00000640
       BOSATT_EKO        = LOW(3);                                      00000650
       TRYGDET_3ÅR_EKO   = LOW(1);                                      00000660
       FRAVIK_FLYKT_EKO  = LOW(1);                                      00000670
       OVERKOMP_UTL_EKO  = LOW(1);                                      00000680
       TRYGDET_DØD_EKO   = LOW(1);                                      00000690
       TT_F67_EKO        = LOW(2);                                      00000700
       TT_E66_Å_EKO      = LOW(2);                                      00000710
       TT_E66_M_EKO      = LOW(2);                                      00000720
       TT_FRAMT_10_1EKO  = LOW(2);                                      00000730
       MELDING1O         = (78)' ';                                     00000740
       MELDING2O         = (78)' ';                                     00000750
       MELDING3O         = (78)' ';                                     00000760
       MELDING4O         = (78)' ';                                     00000770
       MELDING5O         = (78)' ';                                     00000780
       MELDING6O         = (78)' ';                                     00000790
   END BLANK_EP_MAP;                                                    00000800
 %PAGE;                                /*   */                          00000810
       /* BLANKING AV MAPEN FOR YRKESSKADEOPPL */                       00000820
       BLANK_YP_MAP:                                                    00000830
       PROC;                                                            00000840
       DCL                                                              00000850
         LOW BUILTIN;                                                   00000860
          VILKÅR_1_2_2AO   = LOW(1);                                    00000870
          VILKÅR_1_2_2BO   = LOW(1);                                    00000880
          YST_MÅO          = LOW(4);                                    00000890
          YSYKDOMO         = LOW(1);                                    00000900
          YUGO             = LOW(3);                                    00000910
          KAP11_7_UTLØSTO  = LOW(1);                                    00000920
          YRKE11O          = LOW(1);                                    00000930
          AÅIO             = LOW(7);                                    00000940
          S001201O.FNR_EKO = LOW(11);                                   00000950
          FNR_SAMBOERO     = LOW(11);                                   00000960
          FNR_Y_BARNO      = LOW(11);                                   00000970
          PLEIEBARNO       = LOW(1);                                    00000980
          YMELDING1O       = (78)' ';                                   00000990
          YMELDING2O       = (78)' ';                                   00001000
          YMELDING3O       = (78)' ';                                   00001010
          YMELDING4O       = (78)' ';                                   00001020
          YMELDING5O       = (78)' ';                                   00001030
          YMELDING6O       = (78)' ';                                   00001040
       END BLANK_YP_MAP;                                                00001050
 %PAGE;                                /*   */                          00001060
 /* ***************************************************/      /****** */00001070
 /*                                                   */      /*      */00001080
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,    */      /*      */00001090
 /*   EVENTUELT ENDRET PÅ SKJERMBILDET FOR YRKESKADE  */      /*      */00001100
 /*   TIL TRANSOMR EP.                                */      /*      */00001110
 /*           MAPSET:  S001203   MAP S001201          */      /*      */00001120
 /*                                                   */      /*      */00001130
 /* ***************************************************/      /****** */00001140
 %SKIP;                                                                 00001150
       OVERFØR_YP_SØKER:                                                00001160
       PROC;                                                            00001170
        IF VILKÅR_1_2_2AL > 0 THEN                                      00001180
           EPY.VILKÅR_1_2_2A = VILKÅR_1_2_2AI;                          00001190
        IF VILKÅR_1_2_2BL > 0 THEN                                      00001200
           EPY.VILKÅR_1_2_2B = VILKÅR_1_2_2BI;                          00001210
        IF YST_MÅL > 0 THEN                                             00001220
           EPY.YST_ÅMD = KONV_MÅ_HÅMD(YST_MÅI);                         00001230
        IF YSYKDOML > 0 THEN                                            00001240
           EPY.YSYKDOM = YSYKDOMI;                                      00001250
        IF YUGL > 0 THEN                                                00001260
           EPY.YUG = F_FELT_CHAR_PIC3(YUGI);                            00001270
        IF KAP11_7_UTLØSTL > 0 THEN                                     00001280
           EPY.KAP_11_7_UTLØST = KAP11_7_UTLØSTI;                       00001290
        IF YRKE11L > 0 THEN                                             00001300
           EPY.YRKE11 = YRKE11I;                                        00001310
        IF AÅIL > 0 THEN                                                00001320
           EPY.AÅI = F_FELT_CHAR_PIC7(AÅII);                            00001330
        IF S001201I.FNR_EKL > 0 THEN                                    00001340
           EPY.FNR_EK = F_FELT_CHAR_PIC11(S001201I.FNR_EKI);            00001350
        IF FNR_SAMBOERL > 0 THEN                                        00001360
           EPY.FNR_SAMBOER = F_FELT_CHAR_PIC11(FNR_SAMBOERI);           00001370
        IF FNR_Y_BARNL > 0 THEN                                         00001380
           EPY.FNR_Y_BARN = F_FELT_CHAR_PIC11(FNR_Y_BARNI);             00001390
        IF PLEIEBARNL > 0 THEN                                          00001400
           EPY.PLEIEBARN = PLEIEBARNI;                                  00001410
       END OVERFØR_YP_SØKER;                                            00001420
 %PAGE;                                /*   */                          00001430
 /* ***************************************************************** */00001440
 /*                                                                   */00001450
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00001460
 /*   EVENTUELT ENDRET PÅ SKJERMBILDET TIL EP_TRANS_OMR I             */00001470
 /*   KOM_OMR FOR EP_SØKER.                                           */00001480
 /*           MAPSET:  S001083   MAP S001081                          */00001490
 /*                                                                   */00001500
 /* ***************************************************************** */00001510
 %SKIP;                                                                 00001520
   OVERFØR_EP_SØKER:                                                    00001530
   PROC;                                                                00001540
        IF S001081I.REGDATOL > 0 THEN                                   00001550
           EPS.REGDATO_ÅMD = KONV_ÅMD_HÅMD(S001081I.REGDATOI);          00001560
        IF S001081I.TERMIDL > 0 THEN                                    00001570
           EPS.TERMID = S001081I.TERMIDI;                               00001580
        IF S001081I.FNRL > 0 THEN                                       00001590
           EPS.FNR = F_FELT_CHAR_PIC11(S001081I.FNRI);                  00001600
        IF S001081I.NAVNL > 0 THEN                                      00001610
           EPS.NAVN = S001081I.NAVNI;                                   00001620
        IF SPRÅKL > 0 THEN                                              00001630
           EPS.SPRÅK = SPRÅKI;                                          00001640
        IF S001081I.TKNRL > 0 THEN                                      00001650
           EPS.TKNR = F_FELT_CHAR_PIC4(S001081I.TKNRI);                 00001660
        IF SIVILSTANDL > 0 THEN                                         00001670
           EPS.SIVILSTAND = SIVILSTANDI;                                00001680
        IF NORSK_BOSATTL > 0 THEN                                       00001690
           EPS.NORSK_BOSATT = NORSK_BOSATTI;                            00001700
        IF TP_PROSENTL > 0 THEN                                         00001710
           EPS.TP_PROSENT = F_FELT_CHAR_PIC2(TP_PROSENTI);              00001720
        IF VILKÅR_10_5L > 0 THEN                                        00001730
           EPS.VILKÅR_10_5 = VILKÅR_10_5I;                              00001740
        IF OMSORG_AVD_BAL > 0 THEN                                      00001750
           EPS.OMSORG_AVD_BA = OMSORG_AVD_BAI;                          00001760
        IF FORVENTETL > 0 THEN                                          00001770
           EPS.FORVENTET = F_FELT_CHAR_PIC7(FORVENTETI);                00001780
        IF FAIL > 0 THEN                                                00001790
           EPS.FAI = F_FELT_CHAR_PIC7(FAII);                            00001800
        IF YSKADE_TILLEGGL > 0 THEN                                     00001810
           EPS.YSKADE_TILLEGG = YSKADE_TILLEGGI;                        00001820
        IF GP_OS_KODEL > 0 THEN                                         00001830
           EPS.GP_OS_KODE = GP_OS_KODEI;                                00001840
        IF HJEMMEL_10_8L > 0 THEN                                       00001850
           EPS.HJEMMEL_10_8 = HJEMMEL_10_8I;                            00001860
        IF FRAML_DATO_MÅL > 0 THEN                                      00001870
           EPS.FRAMLEGGSDATO_ÅMD = KONV_MÅ_HÅMD(FRAML_DATO_MÅI);        00001880
        IF FRAMLEGGSKODEL > 0 THEN                                      00001890
           EPS.FRAMLEGGSKODE = FRAMLEGGSKODEI;                          00001900
        IF VIRK_DATO_MÅL > 0 THEN                                       00001910
           EPS.VIRK_DATO_ÅMD = KONV_MÅ_HÅMD(VIRK_DATO_MÅI);             00001920
        IF S001081I.FNR_EKL > 0 THEN                                    00001930
           EPS.FNR_EK = F_FELT_CHAR_PIC11(S001081I.FNR_EKI);            00001940
        IF NAVN_EKL > 0 THEN                                            00001950
           EPS.NAVN_EK = NAVN_EKI;                                      00001960
        IF NORSK_BOSATT_EKL > 0 THEN                                    00001970
           EPS.NORSK_BOSATT_EK = NORSK_BOSATT_EKI;                      00001980
        IF DØDSDATO_EKL > 0 THEN                                        00001990
           EPS.DØDSDATO_ÅMD_EK = KONV_DMÅ_HÅMD(DØDSDATO_EKI);           00002000
        IF VILKÅR_8_4_EKL > 0 THEN                                      00002010
           EPS.VILKÅR_8_4_EK = VILKÅR_8_4_EKI;                          00002020
        IF PI_EKL > 0 THEN                                              00002030
           EPS.PI_EK = F_FELT_CHAR_PIC7(PI_EKI);                        00002040
        IF VP_ÅR1_EKL > 0 THEN                                          00002050
           EPS.VP_ÅR_EK(1) = F_FELT_CHAR_PIC4(VP_ÅR1_EKI);              00002060
        IF VP_ÅR2_EKL > 0 THEN                                          00002070
           EPS.VP_ÅR_EK(2) = F_FELT_CHAR_PIC4(VP_ÅR2_EKI);              00002080
        IF VP_ÅR3_EKL > 0 THEN                                          00002090
           EPS.VP_ÅR_EK(3) = F_FELT_CHAR_PIC4(VP_ÅR3_EKI);              00002100
        IF VP_ÅR4_EKL > 0 THEN                                          00002110
           EPS.VP_ÅR_EK(4) = F_FELT_CHAR_PIC4(VP_ÅR4_EKI);              00002120
   END OVERFØR_EP_SØKER;                                                00002130
 %PAGE;                                 /*  */                          00002140
 /* ***************************************************************** */00002150
 /*                                                                   */00002160
 /*   PROSEDYRE FOR Å OVERFØRE SPESIELLE OPPLYSNINGER FRA             */00002170
 /*   SKJERMBILDET TIL EP_TRANS_OMR I KOM_OMR FOR EP_SPES.OPPL.SØKER  */00002180
 /*                 MAPSET S001083   MAP S001081                      */00002190
 /*                                                                   */00002200
 /* ***************************************************************** */00002210
 %SKIP(1);                                                              00002220
   OVERFØR_EP_SPES_SØKER:                                               00002230
   PROC;                                                                00002240
      IF STATSBORGERL > 0 THEN                                          00002250
           EPSP.STATSBORGER = F_FELT_CHAR_PIC3(STATSBORGERI);           00002260
      IF BOSATTL > 0 THEN                                               00002270
           EPSP.BOSATT = F_FELT_CHAR_PIC3(BOSATTI);                     00002280
      IF FRAVIK_BOSATTL > 0 THEN                                        00002290
         EPSP.FRAVIK_BOSATT = FRAVIK_BOSATTI;                           00002300
      IF TRYGDET_3ÅRL > 0 THEN                                          00002310
         EPSP.TRYGDET_3ÅR = TRYGDET_3ÅRI;                               00002320
      IF FRA_TRY_3ÅRL > 0 THEN                                          00002330
         EPSP.FRA_TRY_3ÅR = FRA_TRY_3ÅRI;                               00002340
      IF FRAVIK_10_1L > 0 THEN                                          00002350
         EPSP.FRAVIK_10_1 = FRAVIK_10_1I;                               00002360
      IF KONVENSJONL > 0 THEN                                           00002370
         EPSP.KONVENSJON = KONVENSJONI;                                 00002380
      IF FRAVIK_19_3L > 0 THEN                                          00002390
         EPSP.FRAVIK_19_3 = FRAVIK_19_3I;                               00002400
      IF FRAVIK_FLYKTL > 0 THEN                                         00002410
         EPSP.FRAVIK_FLYKT = FRAVIK_FLYKTI;                             00002420
      IF OVERKOMP_UTLL > 0 THEN                                         00002430
         EPSP.OVERKOMP_UTL = OVERKOMP_UTLI;                             00002440
      IF TT_ETTER_DØDL > 0 THEN                                         00002450
         EPSP.TT_ETTER_DØD = F_FELT_CHAR_PIC3(TT_ETTER_DØDI);           00002460
      IF TT_F67L > 0 THEN                                               00002470
           EPSP.TT_F67 = F_FELT_CHAR_PIC2(TT_F67I);                     00002480
      IF TT_E66_ÅL > 0 THEN                                             00002490
           EPSP.TT_E66_Å = F_FELT_CHAR_PIC2(TT_E66_ÅI);                 00002500
      IF TT_E66_ML > 0 THEN                                             00002510
           EPSP.TT_E66_M = F_FELT_CHAR_PIC2(TT_E66_MI);                 00002520
      IF TT_FRAMT_10_1L > 0 THEN                                        00002530
           EPSP.TT_FRAMT_10_1 = F_FELT_CHAR_PIC2(TT_FRAMT_10_1I);       00002540
      IF TRYGDET_DØDL > 0 THEN                                          00002550
         EPSP.TRYGDET_DØD = TRYGDET_DØDI;                               00002560
      IF TT_VENT_UTLL > 0 THEN                                          00002570
           EPSP.TT_VENT_UTL = F_FELT_CHAR_PIC2(TT_VENT_UTLI);           00002580
      IF IKKE_GPL > 0 THEN                                              00002590
         EPSP.IKKE_GP = IKKE_GPI;                                       00002600
   END OVERFØR_EP_SPES_SØKER;                                           00002610
 %PAGE;                         /*  */                                  00002620
 /* ***************************************************************** */00002630
 /*                                                                   */00002640
 /*   PROSEDYRE FOR Å OVERFØRE SPESIELLE OPPLYSNINGER FRA             */00002650
 /*   SKJERMBILDET TIL EP_TRANS_OMR I KOM_OMR FOR EP_SPES_AVDØDE.     */00002660
 /*                 MAPSET: S001083   MAP: S001081                    */00002670
 /*                                                                   */00002680
 /* ***************************************************************** */00002690
 %SKIP(1);                                                              00002700
   OVERFØR_EP_SPES_AVDØDE:                                              00002710
   PROC;                                                                00002720
      IF STATSBORGER_EKL > 0 THEN                                       00002730
           EPSP.STATSBORGER_EK = F_FELT_CHAR_PIC3(STATSBORGER_EKI);     00002740
      IF BOSATT_EKL > 0 THEN                                            00002750
           EPSP.BOSATT_EK = F_FELT_CHAR_PIC3(BOSATT_EKI);               00002760
      IF TRYGDET_3ÅR_EKL > 0 THEN                                       00002770
         EPSP.TRYGDET_3ÅR_EK = TRYGDET_3ÅR_EKI;                         00002780
      IF FRAVIK_FLYKT_EKL > 0 THEN                                      00002790
         EPSP.FRAVIK_FLYKT_EK = FRAVIK_FLYKT_EKI;                       00002800
      IF OVERKOMP_UTL_EKL > 0 THEN                                      00002810
         EPSP.OVERKOMP_UTL_EK = OVERKOMP_UTL_EKI;                       00002820
      IF TRYGDET_DØD_EKL > 0 THEN                                       00002830
         EPSP.TRYGDET_DØD_EK = TRYGDET_DØD_EKI;                         00002840
      IF TT_F67_EKL > 0 THEN                                            00002850
           EPSP.TT_F67_EK = F_FELT_CHAR_PIC2(TT_F67_EKI);               00002860
      IF TT_E66_Å_EKL > 0 THEN                                          00002870
           EPSP.TT_E66_Å_EK = F_FELT_CHAR_PIC2(TT_E66_Å_EKI);           00002880
      IF TT_E66_M_EKL > 0 THEN                                          00002890
           EPSP.TT_E66_M_EK = F_FELT_CHAR_PIC2(TT_E66_M_EKI);           00002900
      IF TT_FRAMT_10_1EKL > 0 THEN                                      00002910
           EPSP.TT_FRAMT_10_1_EK = F_FELT_CHAR_PIC2(TT_FRAMT_10_1EKI);  00002920
   END OVERFØR_EP_SPES_AVDØDE;                                          00002930
