 /*   SIST ENDRET PÅ PROD   2005.12.01  8.43.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.09.21 14.36.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.19 15.34.12 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.37.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.09.06 12.47.22 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.06  8.53.22 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.35.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.22.51 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.02 12.01.56 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.14 12.51.09 AV   JDA7339          */        
 /*       SIST ENDRET 13/07-99 08.51.39 AV   JDA7339                  */        
 /*       SIST ENDRET 13/07-99 08.50.59 AV   JDA7339                  */        
 /*       SIST ENDRET 26/03-99 13.25.25 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.13.08 AV   JDA7339                  */        
 /*       SIST ENDRET 10/12-98 10.53.27 AV   JDA7339                  */        
 /*       SIST ENDRET 10/12-98 10.51.40 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.18 AV   JDA7339                  */        
 /*       SIST ENDRET 11/03-98 12.05.33 AV   JDA7339                  */        
  /* *************************************************************** */         
  /* IDENTIFIKASJON:   R0017031                                      */         
  /* PROGRAMMERER:  HELEN    JULI, 1982                              */         
  /* HENSIKT:                                                        */         
  /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT    */         
  /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER        */         
  /*        HVER AJOURFØRT TRANSAKSJON.                              */         
  /* PROGRAMTILKNYTNING:                                             */         
  /*        PROGRAMMET INKLUDERES I  R0017001                        */         
  /*                                                                 */         
  /* *************************************************************** */         
 LAG_ALDERSP_HEND:                                                              
    PROC (AP_IND,AE_IND);                                                       
                                                                                
    EXEC CICS ADDRESS EIB(DFHEIPTR);                                            
                                                                                
                                                                                
    DCL (AP_IND,                                                                
         AE_IND,                                                                
         W_BARN_IND,                                                            
         W_BER_SØ_IND)                         FIXED BIN(15);                   
                                                                                
    DCL  AALDER                                FIXED DEC (5);                   
                                                                                
 DCL FNR13                              PIC '9999999999999';                    
 DCL FNR_Å   DEF FNR13 POS (5)           PIC '9999';                            
 DCL FNR_M   DEF FNR13 POS (3)           PIC '99';                              
 DCL FNR_D   DEF FNR13 POS (1)           PIC '99';                              
 DCL FNR_ÅMD                             PIC '99999999';                        
 DCL FNR_ÅMD_Å       DEF FNR_ÅMD POS (1) PIC '9999';                            
 DCL FNR_ÅMD_M       DEF FNR_ÅMD POS (5) PIC '99';                              
 DCL FNR_ÅMD_D       DEF FNR_ÅMD POS (7) PIC '99';                              
                                                                                
 DCL  FYLL_70_ÅMD                           PIC '99999999';                     
                                                                                
 DCL FYLL_70_ÅR  DEF FYLL_70_ÅMD POS (1)    PIC '9999';                         
                                                                                
 DCL FYLL_70_MND DEF FYLL_70_ÅMD POS (5)    PIC '99';                           
                                                                                
 DCL  FYLL_67_ÅMD                           PIC '99999999';                     
                                                                                
 DCL FYLL_67_ÅR  DEF FYLL_67_ÅMD POS (1)    PIC '9999';                         
                                                                                
 DCL FYLL_67_MND DEF FYLL_67_ÅMD POS (5)    PIC '99';                           
                                                                                
 DCL MAX_ÅMD                                PIC '99999999';                     
                                                                                
 DCL MAX_MND DEF MAX_ÅMD           POS (5)  PIC '99';                           
                                                                                
 DCL MAX_ÅR  DEF MAX_ÅMD           POS (1)  PIC '9999';                         
                                                                                
 DCL MIN_ÅMD                                PIC '99999999';                     
                                                                                
 DCL MIN_MND DEF MIN_ÅMD           POS (5)  PIC '99';                           
                                                                                
 DCL MIN_ÅR  DEF MIN_ÅMD           POS (1)  PIC '9999';                         
                                                                                
 DCL MND                                    PIC '9999';                         
                                                                                
 DCL                                                                            
    W_TAI               FIXED DEC (7),                                          
    W_BRP               FIXED DEC (7,2),                                        
    W_APD               FIXED DEC (7,3),                                        
    W_FAI_MAX           FIXED DEC (7),                                          
    W_FAI_MAX_FRAVIK    FIXED DEC (7);                                          
                                                                                
    /* ============================================================== */        
    /* START EKSEKVERING UNDERMODUL 7031............................. */        
    /* ============================================================== */        
                                                                                
    W_HENDELSE            =  '';                                                
    OMR_DATO              = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                   
    AALDER                = F_ALDER((B02.FNR(AP_IND)),                          
                                   TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD);           
    W_APD                 = B02.ALDERSP.APD(AP_IND);                            
                                                                                
    IF TRANS_OPPL_OMR.TRANSTYPE = 27     !                                      
       TRANS_OPPL_OMR.TRANSTYPE = 92     !     /*200302 HL*/                    
       TRANS_OPPL_OMR.TRANSTYPE = 93     !                                      
       TRANS_OPPL_OMR.TRANSTYPE = 95 THEN                                       
       DO;                                                                      
          HENDDATO  =  OMR_DATO/100;                                            
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          IF DIV_PERIODE.INTENDR_ÅMD     > 0 THEN                               
             HENDDATO     = DIV_PERIODE.INTENDR_ÅMD/100;                        
          ELSE                                                                  
             DO;                                                                
                HENDDATO = B02.STATUS.VIRK_DATO_ÅMD(AP_IND)/100;                
                R_HENDDATO_D =  B02.PERSON.STATUS.VIRK_DATO_ÅMD(AP_IND);        
              /*HENDDATO     =  R_HENDDATO.AAR !!R_HENDDATO.MND */              
             END;                                                               
       END;                                                                     
                                                                                
                                                                                
  /* *************************************************************** */         
  /* ANTALL ÅMDNEDER VENTET PÅ ALDERSPENSJON                         */         
  /* *************************************************************** */         
                                                                                
  /* *************************************************************** */         
  /*   VI SKRIVER BARE UT VENTEMåNEDER NåR DET TAS UT 100%           */         
  /* *************************************************************** */         
                                                                                
   MND                       = 0;                                               
   MAX_ÅMD                   = 0;                                               
   MIN_ÅMD                   = 0;                                               
                                                                                
   IF B02.ALDERSP.APD (AP_IND) = 100  THEN                                      
     DO;                                                                        
       FNR13        = KONV_FNR11_FNR13((B02.FNR(AP_IND)));                      
       FNR_ÅMD_Å    = FNR_Å;                                                    
       FNR_ÅMD_M    = FNR_M;                                                    
       FNR_ÅMD_D    = FNR_D;                                                    
       FYLL_67_ÅMD               = FNR_ÅMD + 670000;                            
       IF FYLL_67_ÅMD < 19730100 THEN                                           
          FYLL_67_ÅMD = 19730100;                                               
       FYLL_70_ÅMD               = FNR_ÅMD  + 700000;                           
       IF FYLL_70_ÅMD < 19730100 THEN                                           
          FYLL_70_ÅMD = 19730100;                                               
                                                                                
       IF B02.UTTAKSDATO_ÅMD(AP_IND) > FYLL_70_ÅMD THEN                         
          DO;                                                                   
                      IF FYLL_70_ÅMD > 19840400     THEN                        
                         MAX_ÅMD  = 19840400;                                   
                      ELSE                                                      
                         MAX_ÅMD  = FYLL_70_ÅMD;                                
                      MIN_ÅMD  = FYLL_67_ÅMD;                                   
                      MND      = (MAX_ÅR * 12 + MAX_MND)                        
                            - (MIN_ÅR * 12 + MIN_MND);                          
          END;                                                                  
       ELSE                                                                     
                                                                                
  /* *************************************************************** */         
  /* LOVENDRING - VENTETILLEGGET FALLER BORT 01.04.84                */         
  /* *************************************************************** */         
                                                                                
       IF FYLL_67_ÅMD < 19840400 THEN                                           
          DO;                                                                   
                                                                                
  /* *************************************************************** */         
  /* FRA 67 ÅR TIL FØRSTE UTTAKSDATO                                 */         
  /* *************************************************************** */         
                                                                                
              MAX_ÅMD  = B02.UTTAKSDATO_ÅMD(AP_IND);                            
              MIN_ÅMD  = FYLL_67_ÅMD;                                           
              IF MAX_ÅMD > 19840400 THEN                                        
                 MAX_ÅMD = 19840400;                                            
              IF MIN_ÅMD > 19840400 THEN                                        
                 MIN_ÅMD = 19840400;                                            
              MND      = (MAX_ÅR * 12 + MAX_MND)                                
                       - (MIN_ÅR * 12 + MIN_MND);                               
                                                                                
  /* *************************************************************** */         
  /* VIDERE FRA FØRSTE UTTAKSDATO                                    */         
  /* *************************************************************** */         
                                                                                
                  IF B02.UTTAKS_APD(AP_IND) < 100 THEN                          
                     MIN_ÅMD = B02.UTTAKSDATO_ÅMD(AP_IND);                      
                  ELSE                                                          
                     MIN_ÅMD = 0;                                               
                  IF MIN_ÅMD > 19840400 THEN                                    
                     MIN_ÅMD = 19840400;                                        
                                                                                
  /* *************************************************************** */         
  /* VENTEÅMDNEDER REGNES FREM TIL HVER VENTEPERIODE                 */         
  /* *************************************************************** */         
                                                                                
                  DO I = 1 TO 5 WHILE (B02.UTTAKSDATO_ÅMD_ØVRIGE                
                                    (AP_IND,I) > 0);                            
                        IF MIN_ÅMD > 0 THEN                                     
                           DO;                                                  
                                                                                
                              MAX_ÅMD = B02.UTTAKSDATO_ÅMD_ØVRIGE               
                                                         (AP_IND,I);            
                              IF MAX_ÅMD > 19840400 THEN                        
                                 MAX_ÅMD = 19840400;                            
                              MND      = (MAX_ÅR * 12 + MAX_MND)                
                                        - (MIN_ÅR * 12 + MIN_MND)               
                                        + MND;                                  
                           END;                                                 
                                                                                
                       IF B02.APD_ØVRIGE(AP_IND,I) < 100 THEN                   
                          MIN_ÅMD = B02.UTTAKSDATO_ÅMD_ØVRIGE(AP_IND,I);        
                       ELSE                                                     
                          MIN_ÅMD = 0;                                          
                   END;                                                         
         END;                                                                   
     END;                                                                       
                                                                                
   W_HENDELSE.ANTALL_MND_VENTET  =  MND;                                        
   IF W_HENDELSE.ANTALL_MND_VENTET  > 36 THEN                                   
      W_HENDELSE.ANTALL_MND_VENTET  = 36;                                       
                                                                                
    W_HENDELSE.VERSJON     =  W_ROT.NESTE_SB_VERSJON_NR;                        
    W_HENDELSE.TERMINAL    =  DIV_PARAM_OMR.BRUKER_ID;                          
              /* J.D 26.1.87 */                                                 
    IF TRANS_OPPL_OMR.TRANSTYPE = 21 THEN                                       
       DO;  /* DELVIS OPPHøR I EGEN YTELSE */                                   
         W_HENDELSE.FNR_EKTEF   =  0;                                           
         W_HENDELSE.NAVN_EKTEF  =  ' ';                                         
       END; /* DELVIS OPPHøR I EGEN YTELSE */                                   
    ELSE                                                                        
       DO;                                                                      
         W_HENDELSE.FNR_EKTEF   = B02.RF0PERSN.FNR(AE_IND);                     
         W_HENDELSE.NAVN_EKTEF  = B02.RF0PERSN.NAVN(AE_IND);                    
       END;                                                                     
              /* J.D 26.1.87 HIT */                                             
    W_HENDELSE.PENSJONSTYPE1 =  B02.STATUS.PENSJONSTYPE1(AP_IND);               
    W_HENDELSE.PENSJONSTYPE2 =  B02.STATUS.PENSJONSTYPE2(AP_IND);               
    W_HENDELSE.PENSJONSTYPE3 =  B02.STATUS.PENSJONSTYPE3(AP_IND);               
    W_HENDELSE.PENSJONSTYPE1_EK =  B02.STATUS.PENSJONSTYPE1(AE_IND);            
    W_HENDELSE.PENSJONSTYPE2_EK =  B02.STATUS.PENSJONSTYPE2(AE_IND);            
    W_HENDELSE.PENSJONSTYPE3_EK =  B02.STATUS.PENSJONSTYPE3(AE_IND);            
    W_HENDELSE.SIVILSTAND_EK =  B02.STATUS.SIVILSTAND(AE_IND);                  
    W_HENDELSE.GP_BRUTTO   =  B02.PERSON.ALDERSP.GP(AP_IND);                    
  /*W_HENDELSE.GP_NETTO    =  B02.PERSON.ALDERSP.GP(AP_IND)    */               
    W_HENDELSE.TP_BRUTTO   =  B02.PERSON.ALDERSP.TP(AP_IND);                    
  /*W_HENDELSE.TP_NETTO    =  B02.PERSON.ALDERSP.TP(AP_IND) */                  
  /* ENDRET 171000 MARTIN                                                       
    W_HENDELSE.ST = B02.PERSON.ALDERSP.ST(AP_IND); */                           
    W_HENDELSE.ST = B02.AP_ST_NETTO(AP_IND);                                    
    W_HENDELSE.ST_BRUTTO = B02.ALDERSP.ST(AP_IND);;                             
    W_HENDELSE.KT          =  B02.PERSON.ALDERSP.KT(AP_IND);                    
    /*                                                                          
    W_HENDELSE.ET          =  B02.PERSON.ALDERSP.ET(AP_IND) */                  
    W_HENDELSE.ET          =  B02.PERSON.AP_ET_NETTO(AP_IND);                   
    /* -------------------------------------------------------------- */        
    /* ENDRING I FORBINDELSE MED AFP PRORATA                          */        
    /* -------------------------------------------------------------- */        
    IF (B02.PENSJONSTYPE1(AP_IND) = 'K') THEN                                   
       DO;  /* DISSE FELTA GJELDER KUN VED AFP */                               
          W_HENDELSE.AFP_TILLEGG = B02.AFP_TILLEGG_NETTO(AP_IND);               
          W_HENDELSE.AFP_TILLEGG_BRUTTO = B02.AFP_TILLEGG(AP_IND);              
          IF (DIV_PARAM_OMR.AP_KODE_AEY(AP_IND) = 'W' !                         
              DIV_PARAM_OMR.AP_KODE_AEY(AP_IND) = 'P' ) THEN                    
             DO;  /* KUN VED UTTAK FOM 08.2000 */                               
                W_HENDELSE.UF_GRAD = B02.APD(AP_IND);                           
                W_HENDELSE.ST = B02.AP_ST_NETTO(AP_IND);                        
             END; /* KUN VED UTTAK FOM 08.2000 */                               
          W_HENDELSE.BT = 0;                                                    
          W_HENDELSE.BT_SÆRBARN = 0;                                            
       END; /* DISSE FELTA GJELDER KUN VED AFP */                               
    ELSE                                                                        
       DO;  /* DISSE FELTA GJELDER KUN VED ALDERSPENSJON */                     
          /* NULLSTILLER DET SOM GJELDER AFP */                                 
          W_HENDELSE.AFP_TILLEGG = 0;                                           
          W_HENDELSE.AFP_TILLEGG_BRUTTO = 0;                                    
          W_HENDELSE.UF_GRAD = 0;                                               
          /* NULLSTILLER DET SOM GJELDER AFP */                                 
          W_HENDELSE.BT = B02.PERSON.ALDERSP.BT(AP_IND);                        
          W_HENDELSE.BT_SÆRBARN = B02.PERSON.FORSI.BT_SÆRBARN(AP_IND);          
       END; /* DISSE FELTA GJELDER KUN VED ALDERSPENSJON */                     
    W_HENDELSE.FT_SKAL_BEREGNES = B02.FORSI.FT_SKAL_BEREGNES(AP_IND);           
    W_HENDELSE.ARBEIDSINNTEKT   = B02.FORSI.ARBEIDSINNTEKT(AP_IND);             
    W_HENDELSE.PENSJONSINNTEKT   = B02.FORSI.PENSJONSINNTEKT(AP_IND);           
    W_HENDELSE.ARBEIDSINNTEKT_EK = B02.FORSI.ARBEIDSINNTEKT_EK(AP_IND);         
    W_HENDELSE.PENSJONSINNTEKT_EK= B02.FORSI.PENSJONSINNTEKT_EK(AP_IND);        
                                                                                
                                                                                
    W_HENDELSE.FOLKETRYGD_EK = DIV_PARAM_OMR.FOLKETRYGD(AE_IND);                
    W_HENDELSE.FOLKETRYGD    = DIV_PARAM_OMR.FOLKETRYGD(AP_IND);                
    W_HENDELSE.TEI   = DIV_PARAM_OMR.TAI(AP_IND) / 1000;                        
    W_HENDELSE.BEREGN_ALT_AEY = DIV_PARAM_OMR.AP_KODE_AEY(AP_IND);              
    /* ENDRING 261000 MARTIN                                                    
           W_HENDELSE.FULLT_SÆRTILLEGG  =                                       
                DIV_PARAM_OMR.FULLT_SÆRTILLEGG(AP_IND);                         
                                                                                
    IF B02.ALDERSP.ST(AP_IND) >                                                 
               DIV_PARAM_OMR.FULLT_SÆRTILLEGG(AP_IND) THEN                      
           W_HENDELSE.FULLT_SÆRTILLEGG  =  0; */                                
    W_HENDELSE.FULLT_SÆRTILLEGG = B02.ALDERSP.ST(AP_IND);                       
    /* TIL HIT IFBM NYTT NETTOFELT */                                           
    W_HENDELSE.TP_GAR_KODE =  B02.PERSON.TP_GAR_KODE(AP_IND);                   
    W_HENDELSE.TP_GAR_KODE_EK =  B02.PERSON.TP_GAR_KODE(AE_IND);                
    W_HENDELSE.ANTALL_BARN =  B02.PERSON.STATUS.ANTALL_BARN(AP_IND);            
    W_HENDELSE.ANTALL_BARN_TIDL                                                 
                           =  B01.PERSON.STATUS.ANTALL_BARN(AP_IND);            
    W_HENDELSE.VT_GP       =  B02.PERSON.ALDERSP.VT_GP(AP_IND);                 
    IF B02.PERSON.ALDERSP.VT_TP(AP_IND) > 0 THEN                                
       DO;                                                                      
          W_HENDELSE.VT_TP  =  B02.PERSON.ALDERSP.VT_TP(AP_IND);                
       END;                                                                     
    IF AALDER < 7000  & B02.ETTEPENS.FORVENTET(AP_IND) = 0 THEN                 
       W_HENDELSE.FORVENTET_INNTEKT = B02.ALDERSP.FAI(AP_IND);                  
    ELSE                                                                        
       W_HENDELSE.FORVENTET_INNTEKT = B02.ETTEPENS.FORVENTET(AP_IND);           
    W_HENDELSE.FAI         =  B02.PERSON.ALDERSP.FAI(AP_IND);                   
    W_HENDELSE.APD         =  B02.PERSON.ALDERSP.APD(AP_IND);                   
                                                                                
    DO M = 1 TO 7 WHILE (B02.UFØRHIST.UFT_ÅMD(AP_IND,M) > 0);                   
      W_HENDELSE.BUP_GARANTI = B02.UFØRHIST.BUP_GARANTI(AP_IND,M);              
    END;                                                                        
    W_HENDELSE.REDUSERT_GP_2G = DIV_PARAM_OMR.REDUSERT_GP_2G(AP_IND);           
    W_HENDELSE.GAMMEL_SAMMENSTØTS_REGEL =                                       
               B02.PERSON.STATUS.GAMMEL_SAMMENSTØTS_REGEL(AP_IND);              
          IF AP_IND < 3        THEN                                             
             W_HENDELSE.GARANTITILLEGG_TP = DIV_PARAM_OMR.                      
                                GARANTITILLEGG_TP(AP_IND);                      
    IF B02.PENSJONSTYPE1(AE_IND)  =  'F' THEN                                   
         DO I = 1 TO 13;                                                        
            IF B02.FNR_TILKN(AP_IND,I) =   B02.FNR(AE_IND) THEN                 
                DO;                                                             
                   W_HENDELSE.ET_FØR_0591 = B02.FT_FØR_91(AP_IND,I);            
                   I = 13;                                                      
                END;                                                            
         END;                                                                   
    W_HENDELSE.FRIBELØP_MINSTE = DIV_PARAM_OMR.FRIBELØP_MINSTE(AP_IND);         
    W_HENDELSE.FRIBELØP_FELLESBARN =                                            
                              DIV_PARAM_OMR.FRIBELØP_FELLESBARN(AP_IND);        
   W_HENDELSE.FRIBELØP_SÆRBARN = DIV_PARAM_OMR.FRIBELØP_SÆRBARN(AP_IND);        
    W_HENDELSE.GARANTITILLEGG_EK = B02.FORSI.GARANTITILLEGG_EK(AP_IND);         
    W_HENDELSE.GARANTITILLEGG_BARN =                                            
                            B02.FORSI.GARANTITILLEGG_BARN(AP_IND);              
    W_HENDELSE.GARANTITILLEGG_SÆRBARN =                                         
                        B02.FORSI.GARANTITILLEGG_SÆRBARN(AP_IND);               
                                                                                
  /* *************************************************************** */         
  /* NY LOV 0192     JD 11.91                                        */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.GT_LOV92    =  B02.STATUS.GT_LOV92(AP_IND);                      
    W_HENDELSE.GT_TILLEGG_LOV92 = B02.STATUS.GT_TILLEGG_LOV92(AP_IND);          
    W_HENDELSE.GARANTI_DATO_ÅMD = B02.STATUS.GARANTI_DATO_ÅMD(AP_IND);          
    W_HENDELSE.AP_TP_NETTO      = B02.ALDERSP.AP_TP_NETTO   (AP_IND);           
    W_HENDELSE.AP_GP_NETTO      = B02.ALDERSP.AP_GP_NETTO   (AP_IND);           
    W_HENDELSE.SPT_1291         = B02.ALDERSP.SPT_1291      (AP_IND);           
    W_HENDELSE.OPT_1291         = B02.ALDERSP.OPT_1291      (AP_IND);           
    W_HENDELSE.PÅ_1291         = B02.ALDERSP.PÅ_1291      (AP_IND);             
    W_HENDELSE.PÅ_ETTER91      = B02.ALDERSP.PÅ_ETTER91   (AP_IND);             
    W_HENDELSE.SPT_1291_EK      = B02.ALDERSP.SPT_1291      (AE_IND);           
    W_HENDELSE.OPT_1291_EK      = B02.ALDERSP.OPT_1291      (AE_IND);           
    W_HENDELSE.PÅ_1291_EK      = B02.ALDERSP.PÅ_1291      (AE_IND);             
    W_HENDELSE.PÅ_ETTER91_EK   = B02.ALDERSP.PÅ_ETTER91   (AE_IND);             
    W_HENDELSE.YRKE_PÅ_ETTER91 = B02.YRKEPENS.PÅ_ETTER91  (AP_IND);             
    W_HENDELSE.YRKE_POENG_1291 = B02.YRKEPENS.YRKE_POENG_1291(AP_IND);          
    W_HENDELSE.YRKE_UFG    =  B02.PERSON.YRKEPENS.YUG(AP_IND);                  
    W_HENDELSE.YRKE_SPT    =  B02.YRKEPENS.SPT(AP_IND);                         
                                                                                
    IF B02.YRKE_POENG_1291(AP_IND)   >  B02.YRKEPENS.YPT(AP_IND) THEN           
       W_HENDELSE.YRKE_YPT    =  B02.YRKE_POENG_1291(AP_IND);                   
    ELSE                                                                        
       W_HENDELSE.YRKE_YPT    =  B02.YRKEPENS.YPT(AP_IND);                      
                                                                                
    W_HENDELSE.YRKE_PAÅ    =  B02.YRKEHIST.PAÅ(AP_IND,1);                       
    W_HENDELSE.YRKE_AÅI    =  B02.YRKEHIST.AÅI(AP_IND,1);                       
    W_HENDELSE.YRKE_YUFT_ÅMD = B02.YRKEHIST.YUFT_ÅMD(AP_IND,1);                 
    W_HENDELSE.YRKE_YST_ÅMD = B02.YRKEHIST.YST_ÅMD(AP_IND,1);                   
                                                                                
    IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '3'  THEN                          
       DO;                                                                      
          W_HENDELSE.ØNSKET_APD = B02.PERSON.ALDERSP.APD(AP_IND);               
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          W_HENDELSE.ØNSKET_APD   = 0;                                          
       END;                                                                     
                                                                                
  /* *************************************************************** */         
  /* HENTES FRA BEREGNING                                            */         
  /* *************************************************************** */         
                                                                                
    IF AALDER < 7000 THEN                                                       
       DO;                                                                      
          W_BER_SØ_IND              = BER_SØ_IND;                               
          BER_SØ_IND                = AP_IND;                                   
          W_FNR13   = KONV_FNR11_FNR13((B02.FNR(AP_IND)));                      
          CALL TIDLIGERE_ARBEIDSINNTEKT(W_TAI,W_BRP);                           
                                                                                
          IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '1'  THEN                    
             DO;                                                                
                CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);                        
                CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX_FRAVIK);                
                                                                                
                IF W_FAI_MAX < W_FAI_MAX_FRAVIK   THEN                          
                   W_FAI_MAX = W_FAI_MAX_FRAVIK;                                
             END;                                                               
          ELSE                                                                  
             IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '2'  THEN                 
                W_FAI_MAX = 0;                                                  
             ELSE                                                               
                IF B02.PERSON.ALDERSP.P67_KODE(AP_IND) = '3'  THEN              
                   DO;                                                          
                      IF W_TAI * 1000 < G * 2 THEN                              
                         CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX);              
                      ELSE                                                      
                         CALL FAI_GRENSER(W_APD,W_TAI,W_FAI_MAX);               
                   END;                                                         
                ELSE                                                            
                   CALL FAI_GRENSER_FRAVIK(W_APD,W_FAI_MAX);                    
          IF B02.ALDERSP.KONV_P_KODE(AP_IND) = 'F' THEN                         
             W_HENDELSE.FAI_MAX      = (G * 1.10)/100;                          
          ELSE                                                                  
             W_HENDELSE.FAI_MAX      = W_FAI_MAX/100;                           
                                                                                
          BER_SØ_IND              = W_BER_SØ_IND;                               
       END;                                                                     
                                                                                
    W_HENDELSE.TT           = B02.PERSON.STATUS.TT_ANV(AP_IND);                 
    W_HENDELSE.TT_EK        = B02.PERSON.STATUS.TT_ANV(AE_IND);                 
                                                                                
    W_HENDELSE.PÅ            = B02.ALDERSP.PÅ      (AP_IND);                    
    W_HENDELSE.OPT           = B02.ALDERSP.OPT     (AP_IND);                    
    W_HENDELSE.SPT           = B02.ALDERSP.SPT     (AP_IND);                    
  /*REMEDY 1477 HL 200510 : */                                                  
    IF B02.VENTEFAKTOR(AP_IND)  > 0  THEN                                       
       DO;                                                                      
          W_HENDELSE.PÅ_P67        = B02.ALDERSP.VT_PÅ   (AP_IND);              
          W_HENDELSE.OPT_P67       = B02.ALDERSP.VT_OPT  (AP_IND);              
          W_HENDELSE.SPT_P67       = B02.ALDERSP.VT_SPT  (AP_IND);              
          W_HENDELSE.VENTEFAKTOR   = B02.VENTEFAKTOR     (AP_IND);              
       END;                                                                     
    W_HENDELSE.BOSATT        = B02.BOSATT   (AP_IND);                           
                                                                                
 /*EØS-INFO : ****************************************** */                     
                                                                                
    W_HENDELSE.BEREGN_FOLKETRYGD = B02.BEREGN_FOLKETRYGD(AP_IND);               
    IF W_HENDELSE.BEREGN_FOLKETRYGD = ' ' THEN;                                 
    ELSE                                                                        
    DO;                                                                         
    W_HENDELSE.TT_NORSK_FAKTISK = B02.TT_FAKTISK_NORSK_MND(AP_IND);             
 /* W_HENDELSE.TT_SUM_FAKTISK   = W_HENDELSE.TT_NORSK_FAKTISK */                
 /* ENDRA 170400 MARTIN - DIV_PARAM KUN VED ATTFøRING */                        
    W_HENDELSE.TT_SUM_FAKTISK   = B02.TT_FAKTISK_NORSK_MND(AP_IND)              
                                + B02.TT_PRO_RATA_MND(AP_IND);                  
    IF W_HENDELSE.TT_SUM_FAKTISK > 480            THEN                          
       W_HENDELSE.TT_SUM_FAKTISK = 480;                                         
    W_HENDELSE.INNT_PRØVET_EØS_PENS                                             
                             = B02.INNT_PRØVET_EØS_PENS(AP_IND);                
 /*9907*/                                                                       
    IF B02.PRO_RATA_BEREGNING(AP_IND) = 'A'       THEN                          
 /*KODE 'A' BETYR AT EØS-ALTERNATIVET VINNER */                                 
       W_HENDELSE.GUNSTIGSTE_ALTERNATIV = '2';                                  
 /*KODE '2' BETYR AT EØS-ALTERNATIVET VINNER */                                 
    W_HENDELSE.TT_PRORATA_MND = B02.TT_PRO_RATA_MND(AP_IND);                    
    W_HENDELSE.TT_TEORETISK_EØS_MND =                                           
                                B02.TT_TEORETISK_EØS_MND(AP_IND);               
          W_HENDELSE.SPT_EØS      = B02.SPT_EØS(AP_IND);                        
          W_HENDELSE.OPT_EØS      = B02.OPT_EØS(AP_IND);                        
    W_HENDELSE.ALTERNATIV_GP       = B02.ALTERNATIV_GP(AP_IND);                 
    W_HENDELSE.ALTERNATIV_TP       = B02.ALTERNATIV_TP(AP_IND);                 
    W_HENDELSE.ALTERNATIV_GP_BRUTTO = B02.ALTERNATIV_GP_BRUTTO(AP_IND);         
    W_HENDELSE.ALTERNATIV_TP_BRUTTO = B02.ALTERNATIV_TP_BRUTTO(AP_IND);         
    W_HENDELSE.ALTERNATIV_ST       = B02.ALTERNATIV_ST(AP_IND);                 
    W_HENDELSE.ALTERNATIV_ET       = B02.ALTERNATIV_ET(AP_IND);                 
    W_HENDELSE.ALTERNATIV_BT       = B02.ALTERNATIV_BT(AP_IND);                 
    W_HENDELSE.ALTERNATIV_SUM_PENSJON =                                         
                            B02.ALTERNATIV_SUM_PENSJON(AP_IND);                 
    W_HENDELSE.TEORETISK_BELØP_GP   = DIV_PARAM_OMR.TEORETISK_BELØP_GP;         
    W_HENDELSE.TEORETISK_BELØP_TP   = DIV_PARAM_OMR.TEORETISK_BELØP_TP;         
    W_HENDELSE.PRO_RATA_BEREGNING   = B02.PRO_RATA_BEREGNING(AP_IND);           
    W_HENDELSE.EØS_8_4_3A           = B02.EØS_8_4_3A(AP_IND);                   
    W_HENDELSE.TT_TEORETISK     = DIV_PARAM_OMR.TT_TEORETISK;                   
       W_HENDELSE.PÅ_NORSK_FAKTISK = B02.PÅ_NORDISK_FAKT(AP_IND);               
     W_HENDELSE.PÅ_FAKTISK_NORDEN = B02.PÅ_NORDISK_FAKT(AP_IND);                
    W_HENDELSE.PÅ_EØS_FAKTISK   = DIV_PARAM_OMR.PÅ_EØS_FAKTISK(AP_IND);         
                                                                                
    W_HENDELSE.ANTALL_NORSKE_PÅ  = B02.ANTALL_NORSKE_PÅ(AP_IND);                
    W_HENDELSE.ANTALL_NORSKE_PÅ_ETTER91 =                                       
                            B02.ANTALL_NORSKE_PÅ_ETTER91(AP_IND);               
                                                                                
    W_HENDELSE.TT_FRAMTIDIG_MND     =                                           
          B02.TT_NORDISK_FRAMT_BRUTTO(AP_IND);                                  
    W_HENDELSE.PÅ_TEORETISK_FRAMT   =                                           
          DIV_PARAM_OMR.PÅ_TEORETISK_FRAMT;                                     
    W_HENDELSE.PÅ_EØS_42PROSENT    =                                            
          B02.EØSINFO.PÅ_EØS_ETTER91(AP_IND);                                   
    W_HENDELSE.PÅ_EØS_45PROSENT    =                                            
          B02.EØSINFO.PÅ_EØS(AP_IND)                                            
       -  B02.EØSINFO.PÅ_EØS_ETTER91(AP_IND);                                   
    END;                                                                        
  /*9907*/                                                                      
 /*EØS HIT    ****************************************** */                     
    IF B02.STATUS.SIVILSTAND(AP_IND) = 'E'  THEN                                
       W_HENDELSE.TP_PROSENT    = 55;                                           
    ELSE                                                                        
       W_HENDELSE.TP_PROSENT    = B02.ETTEPENS.TP_PROSENT(AP_IND);              
                                                                                
    IF B02.PENSJONSTYPE1(AE_IND) = 'A'    !                                     
       (B02.PENSJONSTYPE1(AE_IND) = 'K' &                                       
        B02.PENSJONSTYPE2(AE_IND) ^= 'N' )         THEN                         
                                                                                
       DO;                                                                      
          W_HENDELSE.PÅ_EK         = B02.ALDERSP.PÅ      (AE_IND);              
         W_HENDELSE.PÅ_ETTER91_EK = B02.ALDERSP.PÅ_ETTER91(AE_IND);             
          W_HENDELSE.OPT_EK        = B02.ALDERSP.OPT     (AE_IND);              
          W_HENDELSE.SPT_EK        = B02.ALDERSP.SPT     (AE_IND);              
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          W_HENDELSE.PÅ_EK         = B02.UFØRPENS.PÅ      (AE_IND);             
         W_HENDELSE.PÅ_ETTER91_EK = B02.UFØRPENS.PÅ_ETTER91(AE_IND);            
          W_HENDELSE.OPT_EK        = B02.UFØRPENS.OPT     (AE_IND);             
          W_HENDELSE.SPT_EK        = B02.UFØRPENS.SPT     (AE_IND);             
       END;                                                                     
                                                                                
    IF B02.PENSJONSTYPE1(AE_IND) = 'D'    THEN                                  
                                                                                
       DO;                                                                      
          W_HENDELSE.PÅ_EK         = B02.ETTEPENS.PÅ_AVD  (AP_IND);             
             /* TO NESTE LINJER LAGT INN 0799 JD */                             
          W_HENDELSE.PÅ_1291_EK      = B02.ETTEPENS.PÅ_1291(AP_IND);            
         W_HENDELSE.PÅ_ETTER91_EK = B02.ETTEPENS.PÅ_ETTER91(AP_IND);            
          W_HENDELSE.OPT_EK        = B02.ETTEPENS.OPT_AVD (AP_IND);             
          W_HENDELSE.SPT_EK        = B02.ETTEPENS.SPT_AVD (AP_IND);             
       END;                                                                     
                                                                                
    IF B02.PENSJONSTYPE2(AE_IND) = 'U' !                                        
       B02.PENSJONSTYPE2(AE_IND) = 'M' THEN                                     
           W_HENDELSE.INNT4G_EK = B02.PENSJONSTYPE2(AE_IND);                    
                                                                                
    W_BARN_IND = 1;                                                             
       DO J = 3 TO 14 WHILE(B02.FNR(J) > 0);                                    
                                                                                
          DO K = 1 TO 13 WHILE (B02.FNR_TILKN(AP_IND,K) > 0);                   
                                                                                
             IF B02.FNR(J) = B02.FNR_TILKN(AP_IND,K) THEN                       
                                                                                
                DO;                                                             
                   W_HENDELSE.BARN.FNR_B(W_BARN_IND)    = B02.FNR(J);           
                   W_HENDELSE.BARN.PENSJONSTYPE2_B(W_BARN_IND) =                
                                                  B02.PENSJONSTYPE2(J);         
                   W_HENDELSE.BT_FØR_0591(W_BARN_IND)   =                       
                               B02.FT_FØR_91(AP_IND,K);                         
                   W_BARN_IND = W_BARN_IND + 1;                                 
                   K = 13;                                                      
                END;                                                            
          END;                                                                  
       END;                                                                     
                                                                                
    IF B02.PENSJONSTYPE1(AE_IND) = 'G' &                                        
      (B02.SIVILSTAND   (AE_IND) = 'G' !                                        
       B02.SIVILSTAND   (AE_IND) = 'W' ) &                                      
       B02.PENSJONSTYPE2(AE_IND) = 'M' THEN                                     
       DO;                                                                      
                                                                                
  /* *************************************************************** */         
  /* EKTEFELLEN HAR IKKE PENSJON OG SØKEREN MOTTAR IKKE EKTEFELLE-   */         
  /* TILLEGG FOR EKTEFELLEN OG EKTEFELLEN HAR EN INNTEKT SOM ER      */         
  /* MINST 4G.                                                                  
  /* *************************************************************** */         
                                                                                
          DO I = 3 TO 14 WHILE (B02.FNR(I) > 0);                                
             IF B02.PENSJONSTYPE2(I) = 'R' &                                    
                W_HENDELSE.ANT_BT_REDUSERT < 3 THEN                             
                W_HENDELSE.ANT_BT_REDUSERT =                                    
                W_HENDELSE.ANT_BT_REDUSERT + 1;                                 
          END;                                                                  
       END;                                                                     
                                                                                
                                                                                
  /* *************************************************************** */         
  /* FØLGENDE  FELT HENTES FRA P0014009                     .        */         
  /* *************************************************************** */         
                                                                                
    W_HENDELSE.ÅR_BUP_FPP    = POREKKE.BUP_FPP_ÅR(AP_IND);                      
    W_HENDELSE.ÅR_BUP_FPP_EK = POREKKE.BUP_FPP_ÅR(AE_IND);                      
                                                                                
    CALL PLASSER_TEKST(AP_IND,AE_IND);                                          
                                                                                
    CALL INSERT_HENDELSE;                                                       
                                                                                
  /* *************************************************************** */         
  /* HVIS SLUTTPOENGTALLET ER STØRRE ENN 0 SKAL BEREGNINGSGRUNNLAG-  */         
  /* SEGMENT BYGGES OPP                                              */         
  /* *************************************************************** */         
                                                                                
                                                                                
    IF W_HENDELSE.SPT > 0 ! W_HENDELSE.OPT > 0 THEN                             
       DO;                                                                      
          CALL BYGG_OPP_BERGRUNL_SEGMENT(AP_IND);                               
       END;                                                                     
                                                                                
                                                                                
  END  LAG_ALDERSP_HEND;                                                        
