 /*       SIST ENDRET 04/05-98 13.14.31 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/03-98 10.34.14 AV   SLA9300                  */00000010
 /*       SIST ENDRET 13/12-91 12.26.32 AV   DYBVIK                   */00000020
 /*********************************************************************/00000030
 /* IDENTIFIKASJON:                                                   */00000040
 /*    R0016032 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000050
 /* HENSIKT:                                                          */00000060
 /*    EN PROSEDYRE SOM HENTER FELTER FRA BLANKETT-OMR. V/UP-TRANS.   */00000070
 /* PROGRAMTILKNYTNING:                                               */00000080
 /*    LOKAL PROSEDYRE I R0016001                                     */00000090
 /*********************************************************************/00000100
                                                                        00000110
    /*----------------------------------------------------------------*/00000120
    /*                                                                */00000130
    /* YRKE, PRIMÆR- OG SEKUNDÆR-DIAGNOSE LEGGES IKKE UT I B01/B02.   */00000140
    /* DISSE OPPLYSNINGENE MÅ HENTES DIREKTE PÅ TRANSAKSJONEN.        */00000150
    /* 2 TYPER UP-BL. FRA 1991 MEDFØRER 2 PROC'ER: UP_OPPDAT/U2_OPPDAT*/00000160
    /*----------------------------------------------------------------*/00000170
                                                                        00000180
 UP_OPPDAT: PROC;                                                       00000190
                                                                        00000200
 %INCLUDE P0010601;     /* TRANS_OMR UP-BLANKETT */                     00000210
                                                                        00000220
       /* DENNE ENDRES NÅR YRKESKODEN UTVIDES */                        00000230
                                                                        00000240
    IF VERIFY(TRANS_OMR.UPS.FNR,'0123456789') = 0 THEN                  00000250
      IF TRANS_OMR.UPS.FNR = B02.PERSON(I).RF0PERSN.FNR THEN            00000260
      DO;                                                               00000270
        IF TRANS_OMR.UPS.YRKE > 0 THEN                                  00000280
           REGTPKT.YRKE = TRANS_OMR.UPS.YRKE;                           00000290
                                                                        00000300
        IF TRANS_OMR.UPS.PRIMDIAG > '      ' THEN                       00000310
          DO;                                                           00000320
            IF TRANS_OMR.UPS.YSKADE_TILLEGG = 'J' THEN                  00000330
               DIAGNOSE.PRIMDIAG_YRKE  = TRANS_OMR.UPS.PRIMDIAG;        00000340
            ELSE                                                        00000350
               DIAGNOSE.PRIMDIAG       = TRANS_OMR.UPS.PRIMDIAG;        00000360
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000370
          END;                                                          00000380
                                                                        00000390
        IF TRANS_OMR.UPS.SEKUDIAG > '      ' THEN                       00000400
          DO;                                                           00000410
            IF TRANS_OMR.UPS.YSKADE_TILLEGG = 'J' THEN                  00000420
               DIAGNOSE.SEKUDIAG_YRKE  = TRANS_OMR.UPS.SEKUDIAG;        00000430
            ELSE                                                        00000440
               DIAGNOSE.SEKUDIAG       = TRANS_OMR.UPS.SEKUDIAG;        00000450
            SEGMENT_TABELL.DIAGNOSE = TRUE;                             00000460
          END;                                                          00000470
      END;                                                              00000480
                                                                        00000490
 END UP_OPPDAT;                                                         00000500
                                                                        00000510
