 /*   SIST ENDRET PÅ PROD   2003.12.05  8.37.35 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.12.05  8.25.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.21 10.33.06 AV   JDA7339          */        
 /*       SIST ENDRET 04/05-98 14.30.27 AV   JDA7339                  */        
 /*       SIST ENDRET 12/03-98 10.35.45 AV   SLA9300                  */        
 /*       SIST ENDRET 13/03-97 11.51.30 AV   JDA7339                  */        
 /*       SIST ENDRET 12/04-94 15.04.20 AV   DYBVIK                   */        
 /*       SIST ENDRET 19/02-92 15.00.23 AV   DYBVIK                   */        
 /*       SIST ENDRET 13/12-91 13.10.52 AV   DYBVIK                   */        
 /*       SIST ENDRET 26/04-91 13.13.00 AV   DYBVIK                   */        
 /*       SIST ENDRET 14/04-89 14.59.04 AV   DYBVIK                   */        
 /*       SIST ENDRET 14/12-88 14.31.42 AV   DYBVIK                   */        
 /*       SIST ENDRET 19/04-88 11.24.57 AV   HERMAN                   */        
 /*       SIST ENDRET 17/07-86 11.54.21 AV   DYBVIK                   */        
 /*       SIST ENDRET 16/07-86 09.25.09 AV   DYBVIK                   */        
 /*       SIST ENDRET 06/05-86 07.57.45 AV   FARVIK                   */        
 /*       SIST ENDRET 15/04-86 10.44.02 AV   FARVIK                   */        
 /*       SIST ENDRET 24/03-86 14.21.16 AV   FARVIK                   */        
 /*       SIST ENDRET 29/11-85 09.31.57 AV   FARVIK                   */        
 /*       SIST ENDRET 07/02-84 12.18.06 AV   BREIVIK                  */        
 /*********************************************************************/        
 /*                                                                   */        
 /* IDENTIFIKASJON:                                                   */        
 /*    R0016101                                                       */        
 /*                                                                   */        
 /*    PROGRAMMERER: P. BREIVIK, NOV 1982.                            */        
 /*                                                                   */        
 /* HENSIKT:                                                          */        
 /*    GENERERING AV GS/HSU-SEGMENTER TIL STAT-TRANS-BASEN.           */        
 /*                                                                   */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*                                                                   */        
 /* BRUK:                                                             */        
 /*                                                                   */        
 /* ENDRET UKE 15 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S               */        
 /*            NY SIVILSTANDSKODE = 60 (P) OG 00 (W)                  */        
 /* ENDRET : UKE 05 2000 AV  SVERRE LUNDEBY, DATA-UTVIKLING AS       */         
 /*          SAK 0013-2000 DAG I VIRKDATO > 00                        */        
 /*********************************************************************/        
                                                                                
 R001610: PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                 
 DCL (COMMAREA_PEKER)        POINTER;                                           
 %PAGE;                                                                         
 %INCLUDE P0019906; /* TRANS_OPPL_OMR */                                        
 %SKIP(4);                                                                      
 %INCLUDE P0019910; /* STYRINGS_OMR   */                                        
 %SKIP(4);                                                                      
 %INCLUDE P0019908; /* KOM_OMR */                                               
 %SKIP(4);                                                                      
 %INCLUDE P0019912; /* DIV_PARAM_OMR */                                         
 %PAGE;                                                                         
 DCL                                                                            
   1 TRANS_LISTE_OMR UNAL BASED      (TRANS_LISTE_PEKER),                       
     3 TRANS_LISTE_LINJE(5),                                                    
 %INCLUDE P0019911;  /*  TRANS-LISTE UNDERNIVÅ   */                             
 %PAGE;                                                                         
 %INCLUDE P0010701; /* TRANS_OMR */                                             
 %PAGE;                                                                         
 %INCLUDE P0016001; /* BOOLSK SEGMENT-TABELL */                                 
                                                                                
 %PAGE;                                                                         
 DCL 1 TR0ROT,                                                                  
 %INCLUDE P0016201; /* ARBEIDSOMRÅDE TR0ROT               */                    
 DCL 1 REGTPKT,                                                                 
 %INCLUDE P0016202; /* ARBEIDSOMRÅDE REGTPKT              */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 SIVILST,                                                                 
 %INCLUDE P0016204; /* ARBEIDSOMRÅDE SIVILST              */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 GS,                                                                      
 %INCLUDE P0016212; /* ARBEIDSOMRÅDE GS                   */                    
 DCL 1 HSU,                                                                     
 %INCLUDE P0016213; /* ARBEIDSOMRÅDE HSU                  */                    
                                                                                
 %PAGE;                                                                         
 DCL 1 DIAGNOSE,                                                                
 %INCLUDE P0016216; /* ARBEIDSOMRÅDE DIAGNOSE             */                    
 /*-------------------------------------------------------------------*/        
 /*      ROT_SEGMENT.                                                 */        
 /*-------------------------------------------------------------------*/        
 DCL 1  RF0PERSN               UNALIGNED,                                       
   %INCLUDE P0019927;                                                           
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /*   DL/1 PARAMETRE                                                  */        
 /*-------------------------------------------------------------------*/        
 %INCLUDE DLIUIB;                                                               
 DCL PLITDLI                 EXTERNAL ENTRY;                                    
                                                                                
 DCL UIB_RC_OK               BIT (8) INIT(0);    /* KONSTANT */                 
 DCL 1 TR0_PCB_PEKER         BASED (UIBPCBAL),                                  
       2 TR0_PCB_PTR         POINTER;                                           
                                                                                
 DCL INSERT                  CHAR (4) INIT('ISRT');                             
 DCL PARAM_COUNT_3           FIXED BIN (31) INIT(3);                            
 DCL PARAM_COUNT_4           FIXED BIN (31) INIT(4);                            
 DCL PARAM_COUNT_5           FIXED BIN (31) INIT(5);                            
 DCL PARAM_COUNT_6           FIXED BIN (31) INIT(6);                            
 /*-------------------------------------------------------------------*/        
 /*   DEKLARASJON AV SSA                                              */        
 /*-------------------------------------------------------------------*/        
 DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ')  ;              
 DCL    SSA_UNQUAL           CHAR (9);                                          
                                                                                
 DCL 1 SSA_TR0ROT UNALIGNED,                                                    
       2 HOVEDDEL            CHAR (17) INIT('TR0ROT  (FNR     '),               
       2 REL_OP              CHAR (2)  INIT(' ='),                              
       2 FNR_KEY             FIXED DEC (11),                                    
       2 END_MRK             CHAR (1)  INIT(')');                               
                                                                                
 DCL 1 SSA_REGTPKT UNALIGNED,                                                   
       2 HOVEDDEL            CHAR (17) INIT('REGTPKT (DATOKL  '),               
       2 REL_OP              CHAR (2)  INIT(' ='),                              
       2 DATO_KEY            FIXED DEC (09),                                    
       2 KLOKKE_KEY          FIXED DEC (09),                                    
       2 END_MRK             CHAR (1)  INIT(')');                               
 /*-------------------------------------------------------------------*/        
 /*   PCB-OMRÅDE                                                      */        
 /*-------------------------------------------------------------------*/        
 %INCLUDE P0012002;                                                             
                                                                                
 DCL 1 TR0_PCB               BASED (TR1_PCB_PEKER),                             
 %INCLUDE P0012003; /* PCB-OMRÅDE */                                            
 DCL 1 RF1                   BASED (RF1_PCB_PEKER),                             
 %INCLUDE P0012003; /* PCB-OMRÅDE */                                            
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /*   HJELPEVARIABLE                                                  */        
 /*-------------------------------------------------------------------*/        
 DCL TRUE                    BIT(1) INIT('1'B);                                 
 DCL FALSE                   BIT(1) INIT('0'B);                                 
 DCL FATAL_FEIL              BIT(1) INIT('0'B);                                 
 DCL (ENDRET,TP_ENDRET,                                                         
      FUNNET,FEIL)           BIT(1);                                            
 DCL HELP_FNR                PIC '(11)9';                                       
 DCL HJELP_FNR                PIC '(11)9';                                      
 DCL HELP_DATO               PIC '(8)9';                                        
 DCL HJELP_DATO               PIC '(8)9';                                       
 DCL PBR_TEXT                CHAR (50);                                         
  /* 2000                                                                       
 DCL DATO_KLOKKE             PIC '(17)9',                                       
     DATO_ÅMD                PIC '(8)9' DEF DATO_KLOKKE,                        
     DATO                    PIC '(8)9' DEF DATO_KLOKKE,                        
     KLOKKE                  PIC '(9)9' DEF DATO_KLOKKE POS(9);                 
     */                                                                         
 DCL DATO                    PIC '(8)9',                       /*2000*/         
     KLOKKE_CH               CHAR (9)  ,                       /*2000*/         
     KLOKKE                  PIC '(9)9' DEF KLOKKE_CH POS(1);  /*2000*/         
 DCL J                       FIXED BIN (15) ;                                   
 DCL IO_PEK                  POINTER;                                           
 DCL IO_AREA                 CHAR (150);                                        
 DCL IO_HELP_AREA            CHAR (150) BASED (IO_PEK);                         
 DCL (TIME,                                                                     
      SUBSTR,                                                                   
      CSTG,                                                                     
      ADDR,                                                                     
      MIN,                                                                      
      MAX,                                                                      
      FLOOR,                                            /* SL 200002*/          
      LENGTH,                                                                   
      CHAR,                                                                     
      VERIFY,                                                                   
      HBOUND)                BUILTIN;                                           
                                                                                
 %PAGE;                                                                         
 /*-------------------------------------------------------------------*/        
 /* START PÅ PROGRAM LAG_STATISTIKK_TRANS_FOR_STØNADER                */        
 /*-------------------------------------------------------------------*/        
    UIBPTR = UIB_PEKER;                                                         
    FEIL = TRUE;                                                                
 /*-------------------------------------------------------------------*/        
 /* CLEAR SEGMENT-TABELLEN OG ARBEIDSFELTENE FOR BASE-SEGMENTENE.     */        
 /*-------------------------------------------------------------------*/        
    SEGMENT_TABELL = '';                                                        
    TR0ROT         = '';                                                        
    REGTPKT        = '';                                                        
    SIVILST        = '';                                                        
    GS             = '';                                                        
    HSU            = '';                                                        
    DIAGNOSE       = '';                                                        
                                                                                
                                                                                
    TR0ROT.FNR = TRANS_OMR.USS.FNR;                                             
                                                                                
    SEGMENT_TABELL.REGTPKT      = TRUE;                                         
    HJELP_FNR  = TRANS_OPPL_OMR.FØDSNUMMER;                                     
    HJELP_DATO = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                              
                                                                                
    IF F_NUMERISK(F_FELT_PIC_CHAR8(USS.VIRK_DATO_ÅMD)) &                        
         F_GYLDIG_DATO(USS.VIRK_DATO_ÅMD) THEN                                  
       REGTPKT.VIRKDATO =         TRANS_OMR.USS.VIRK_DATO_ÅMD;                  
    ELSE                                                                        
       REGTPKT.VIRKDATO = HJELP_DATO;                                           
    /*----------------------------------------------------------*/              
    /*SIKRER AT DAG=00 I VIRKDATO                 SL UKE 5 2000 */              
    /*----------------------------------------------------------*/              
    REGTPKT.VIRKDATO = FLOOR (REGTPKT.VIRKDATO / 100) * 100;                    
                                                                                
    REGTPKT.TKNR                    = TRANS_OMR.USS.TKNR;                       
    REGTPKT.STATSBORGER             = TRANS_OMR.USS.STATSBORGER;                
                                                                                
    IF TRANS_OMR.USS.GS_DIAG > ' ' THEN                                         
       DO;                                                                      
          DIAGNOSE.PRIMDIAG_GS  =  TRANS_OMR.USS.GS_DIAG;                       
          SEGMENT_TABELL.DIAGNOSE  = TRUE;                                      
       END;                                                                     
    IF TRANS_OMR.USS.HSU_DIAG > ' ' THEN                                        
       DO;                                                                      
          DIAGNOSE.PRIMDIAG_HSU =  TRANS_OMR.USS.HSU_DIAG;                      
          SEGMENT_TABELL.DIAGNOSE  = TRUE;                                      
       END;                                                                     
                                                                                
    IF TRANS_OMR.USS.SIVILSTAND ^= ' ' THEN                                     
    DO;                                                                         
       SEGMENT_TABELL.SIVILST   = TRUE;                                         
       SELECT (TRANS_OMR.USS.SIVILSTAND);                                       
          WHEN ('G') SIVILST.SIVILSTAND = 29;                                   
          WHEN ('U') SIVILST.SIVILSTAND = 10;                                   
          WHEN ('A') SIVILST.SIVILSTAND = 24;                                   
          WHEN ('S') SIVILST.SIVILSTAND = 40;                                   
          WHEN ('E') SIVILST.SIVILSTAND = 30;                                   
          WHEN ('P') SIVILST.SIVILSTAND = 60;                                   
          WHEN ('W') SIVILST.SIVILSTAND = 00;                                   
          OTHERWISE  SIVILST.SIVILSTAND = 99;                                   
       END;                                                                     
    END;                                                                        
                                                                                
    IF TRANS_OMR.USS.GS_SATS ^= ' ' THEN                                        
    DO;                                                                         
       SEGMENT_TABELL.GS    = TRUE;                                             
       IF VERIFY (TRANS_OMR.USS.GS_SATS, '01234567') = 0  THEN                  
          GS.GS_SATS        = TRANS_OMR.USS.GS_SATS + 1; /*9702SOB*/            
       ELSE                                                                     
          GS.GS_SATS        = 0 ;                                               
                                                                                
       GS.GS_KODE(*)        = TRANS_OMR.USS.GS_KODE(*);                         
       DO J = 1 TO 3;                                                           
          IF VERIFY (GS.GS_KODE(J), '123456789 ') ^= 0 THEN                     
             GS.GS_KODE(J) = ' ';                                               
       END;                                                                     
    END;                                                                        
                                                                                
    IF TRANS_OMR.USS.HSU_SATS ^= ' ' THEN                                       
    DO;                                                                         
       SEGMENT_TABELL.HSU   = TRUE;                                             
       IF VERIFY (TRANS_OMR.USS.HSU_SATS, '0123456') = 0  THEN                  
          HSU.HSU_SATS      = TRANS_OMR.USS.HSU_SATS + 1;/*9702SOB*/            
       ELSE                                                                     
          HSU.HSU_SATS      = 0 ;                                               
                                                                                
       HSU.HSU_KODE(1)      = TRANS_OMR.USS.HSU_KODE;                           
       HSU.HSU_KODE(2)      = ' ' ;                                             
       IF VERIFY (HSU.HSU_KODE(1), '12 ') ^= 0 THEN                             
          HSU.HSU_KODE(1) = ' ';                                                
    END;                                                                        
                                                                                
                                                                                
                                                                                
  DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                               
                                                                                
  CALL SKRIV_STAT_SEGM;                                                         
  IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                                        
     DO;                                                                        
        FEIL = TRUE;                                                            
        GO TO UTGANG;                                                           
     END;                                                                       
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);        
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR);          
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR);         
                                                                                
  FEIL = FALSE;                                                                 
                                                                                
  CALL OPPDATER_TRANSLISTE;                                                     
                                                                                
  ANTALL_TRANS_I_TRANS_LISTE = 1;                                               
                                                                                
  EXEC CICS LINK PROGRAM('R0015301') COMMAREA (KOM_OMR);                        
                                                                                
  IF DB_STATUS_KODE = 'GE' THEN                                                 
     DO;                                                                        
        DB_STATUS_KODE             = '  ';                                      
        DIV_PARAM_OMR.FEIL_MELD_NR = 0   ;                                      
        CALL DANN_DUMMY_ROTSEGM;                                                
        EXEC CICS LINK PROGRAM('R0015301') COMMAREA (KOM_OMR);                  
     END;                                                                       
                                                                                
  IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                                        
     DO;                                                                        
        FEIL = TRUE;                                                            
        GO TO UTGANG;                                                           
     END;                                                                       
  ELSE                                                                          
     DIV_PARAM_OMR.PROGRAM_ID = 'R0016101';                                     
                                                                                
  TRANS_OPPL_OMR.TRANSKODE = 'R041';                                            
                                                                                
  EXEC CICS RETURN;                                                             
                                                                                
 UTGANG:                                                                        
 /*-------------------------------------------------------------------*/        
 /*                                                                   */        
 /* PROGRAMKONTROLLEN ENDER HER NÅR ALL OPPDATERING ER FORETATT       */        
 /* ELLER NÅR DET ER DETEKTERT EN FEIL I OPPDATERING AV ET SEGMENT.   */        
 /* VARIABELEN 'FEIL' AVGJØR FEIL-STATUS.                             */        
 /*                                                                   */        
 /*-------------------------------------------------------------------*/        
                                                                                
    IF FEIL THEN                                                                
       DO;                                                                      
          PBR_TEXT = 'DL/I-RETUR-KODE = ' !!                                    
                     CHAR(DLIUIB.UIBRCODE.UIBFCTR) !!                           
                     'DB_STATUS_KODE = ' !! DB_STATUS_KODE;                     
          EXEC CICS SEND TEXT FROM (PBR_TEXT)                                   
                                      ERASE JUSTIFY (16) ACCUM PAGING;          
                                                                                
          PBR_TEXT =                                                            
                     'TR0_PCB.STATUS_KODE = ' !! TR0_PCB.STATUS_KODE;           
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (17) ACCUM PAGING;        
                                                                                
          PBR_TEXT = 'SEGMENT-NIVÅ = ' !! TR0_PCB.SEGM_NIVAA;                   
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (18) ACCUM PAGING;        
                                                                                
                                                                                
          PBR_TEXT = 'FEIL_MELD_NR : ' !! FEIL_MELD_NR;                         
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (19) ACCUM PAGING;        
                                                                                
          PBR_TEXT = 'FEIL_VED_LABEL = ' !! FEIL_VED_LABEL;                     
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (20) ACCUM PAGING;        
                                                                                
          PBR_TEXT = 'AKTUELT FNR  :  ' !! CHAR(HELP_FNR);                      
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (22) ACCUM PAGING;        
                                                                                
                                                                                
          PBR_TEXT = 'TRANSAKSJONEN ER KANSELERT.';                             
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (24) ACCUM PAGING;        
                                                                                
          PBR_TEXT = 'TA UTSKRIFT OG KONTAKT FARVIK ELLER TRY.';                
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (26) ACCUM PAGING;        
          EXEC CICS SEND PAGE;                                                  
                                                                                
          EXEC CICS ABEND ABCODE('TRY');                                        
       END;                                                                     
    ELSE                                                                        
       PBR_TEXT = 'NORMAL AVSLUTNING PÅ PROGRAM R0016101';                      
                                                                                
  DANN_DUMMY_ROTSEGM:PROC;                                                      
                                                                                
    RF0PERSN.FNR                     =                                          
                                           TRANS_OMR.USS.FNR;                   
    RF0PERSN.NAVN                    =     ' ';                                 
    RF0PERSN.TKNR                    =                                          
                                                   TRANS_OMR.USS.TKNR;          
    RF0PERSN.SPRÅK                   =     ' '      ;                           
    RF0PERSN.AI67                    =     0        ;                           
    RF0PERSN.SPERRE                  =     ' '      ;                           
                                                                                
    CALL PLITDLI                          (PARAM_COUNT_4,                       
                                           INSERT,                              
                                           RF1,                                 
                                           RF0PERSN,                            
                                           SSA_UQUAL_ROT);                      
                                                                                
    IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                    
               DO;                                                              
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  ROT                     */                   
           /* ******************************************** */                   
  L100:                                                                         
                  FEIL_MELD_NR                =    500 ;                        
                  FEIL_VED_LABEL              =   '100';                        
                  FEIL                        =   TRUE ;                        
                  DB_STATUS_KODE              =   ' '  ;                        
                  GO   TO  RETUR;                                               
               END;                                                             
                                                                                
            IF   RF1.STATUS_KODE            ^=   '  '    THEN                   
               DO;                                                              
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  ROT                     */                   
           /* ******************************************** */                   
  L103:                                                                         
                 FEIL_MELD_NR                =    500 ;                         
                 FATAL_FEIL                  =   '1'B ;                         
                 DB_STATUS_KODE              =   RF1.STATUS_KODE;               
                 FEIL_VED_LABEL              =   '103';                         
                 GO   TO  RETUR;                                                
               END;                                                             
                                                                                
  RETUR:                                                                        
  END DANN_DUMMY_ROTSEGM;                                                       
                                                                                
  OPPDATER_TRANSLISTE:                                                          
  PROC;                                                                         
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANSKODE(1) =                 
                                            TRANS_OPPL_OMR.TRANSKODE;           
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.FØDSNUMMER(1) =                
                                           TRANS_OPPL_OMR.FØDSNUMMER;           
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.VIRKNINGSDATO_ÅMD(1) =         
                                      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;         
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.BLANKETTYPE(1) =               
                                          TRANS_OPPL_OMR.BLANKETTYPE;           
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANSTYPE(1) =                 
                                            TRANS_OPPL_OMR.TRANSTYPE;           
      TRANS_LISTE_OMR.TRANS_LISTE_LINJE.FAST_DEL.TRANS_RETURKODE(1) =           
                                      TRANS_OPPL_OMR.TRANS_RETURKODE;           
      TRANS_LISTE_OMR.NY_GML_TRANS_IND(1) = 'N';                                
                                                                                
      TRANS_LISTE_OMR.VARIABEL_DEL(1) = KOM_OMR.TRANS_OMR;                      
  END OPPDATER_TRANSLISTE;                                                      
                                                                                
 %PAGE;                                                                         
 SKRIV_STAT_SEGM: PROC;                                                         
                                                                                
 /*-------------------------------------------------------------------*/        
 /* PROSEDYREN LESER SEGMENT-TABELL OG SKRIVER UT DE SEGMENTENE TIL   */        
 /* TRANS-STAT-BASEN SOM HAR TILHØRENDE ELEMENTET I SEGMENT-TABELL    */        
 /* SATT TIL 'TRUE' (DVS '1'B). PROSEDYREN HENTER INFORMASJONEN       */        
 /* FRA ARBEIDS-OMRÅDE TIL TRANS-STAT-BASEN.                          */        
 /*-------------------------------------------------------------------*/        
 /* SETTING AV REGDATO'ER */                                                    
                                                                                
    DATO            = DATO_2000;                                                
    KLOKKE_CH       = TIME;                                                     
    SIVILST.REGDATO = DATO_2000;                                                
    GS.REGDATO      = DATO_2000;                                                
    HSU.REGDATO     = DATO_2000;                                                
                                                                                
 /* BEHANDLING AV ROT-SEGMENT */                                                
                                                                                
    HELP_FNR  = TR0ROT.FNR;                                                     
                                                                                
    IF ^(F_NUMERISK(F_FELT_PIC_CHAR11(HELP_FNR)) &                              
         F_GYLDIG_FNR(HELP_FNR)) THEN                                           
                                                                                
     IF  F_NUMERISK(F_FELT_PIC_CHAR11(HJELP_FNR)) &                             
         F_GYLDIG_FNR(HJELP_FNR) THEN                                           
                                                                                
         TR0ROT.FNR = HJELP_FNR;                                                
     ELSE                                                                       
       DO;                                                                      
          PBR_TEXT = 'TIDSPUNKT    :  ' !! DATO !! ' ' !! KLOKKE;               
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (18) ACCUM PAGING;        
                                                                                
          PBR_TEXT = 'AKTUELT FNR  :  ' !! CHAR(HELP_FNR);                      
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (20) ACCUM PAGING;        
                                                                                
                                                                                
          PBR_TEXT = 'TRANSAKSJONEN ER KANSELERT.';                             
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (24) ACCUM PAGING;        
                                                                                
          PBR_TEXT = 'TA UTSKRIFT OG KONTAKT FARVIK ELLER TRY.';                
                                                                                
          EXEC CICS SEND TEXT FROM (PBR_TEXT) JUSTIFY (26) ACCUM PAGING;        
          EXEC CICS SEND PAGE;                                                  
                                                                                
          EXEC CICS ABEND ABCODE('TRY');                                        
       END;                                                                     
                                                                                
                                                                                
                                                                                
    PBR_TEXT = 'DANN ROTSEGMENT.  ID = ' !! HELP_FNR;                           
                                                                                
    SSA_UNQUAL = 'TR0ROT  ';                                                    
    CALL PLITDLI (PARAM_COUNT_4,                                                
                  INSERT,                                                       
                  TR0_PCB,                                                      
                  TR0ROT,                                                       
                  SSA_UNQUAL);                                                  
    IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                                   
       ^(TR0_PCB.STATUS_KODE = '  ' ! TR0_PCB.STATUS_KODE = 'II') THEN          
    DO;                                                                         
 L100:                                                                          
     /*--------------------------------------*/                                 
     /* FEIL VED INSERT-KALLET TIL TR0-BASEN */                                 
     /* SEGMENTET FANTES IKKE FRA FØR OG     */                                 
     /* LOT SEG HELLER IKKE LEGGE INN        */                                 
     /*--------------------------------------*/                                 
                                                                                
        DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                                     
        DIV_PARAM_OMR.FEIL_VED_LABEL = 'L100';                                  
        GO TO UTGANG;                                                           
    END;                                                                        
                                                                                
                                                                                
 /*-------------------------------*/                                            
 /* BEHANDLING AV REGTPKT-SEGMENT */                                            
 /*-------------------------------*/                                            
                                                                                
    SSA_TR0ROT.FNR_KEY = TR0ROT.FNR;                                            
    IF SEGMENT_TABELL.REGTPKT THEN                                              
    DO;                                                                         
       REGTPKT.DATO   = DATO;                                                   
       REGTPKT.KLOKKE = KLOKKE;                                                 
       PBR_TEXT = 'DANN REGTPKT-SEGMENT.ID=' !! DATO !! ' ' !! KLOKKE;          
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                            
                                                                                
       IO_PEK = ADDR (REGTPKT);                                                 
       IO_AREA = IO_HELP_AREA;                                                  
       SSA_UNQUAL = 'REGTPKT ';                                                 
       CALL PLITDLI (PARAM_COUNT_5,                                             
                     INSERT,                                                    
                     TR0_PCB,                                                   
                     IO_AREA,                                                   
                     SSA_TR0ROT,                                                
                     SSA_UNQUAL);                                               
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                                
          TR0_PCB.STATUS_KODE ^= '  ' THEN                                      
       DO;                                                                      
 L110:                                                                          
       /*------------------------------------------------*/                     
       /* FEIL VED INSERT-KALLET TIL TR0-BASEN           */                     
       /* UNIKT REGTPKT-SEGMENTET LOT SEG IKKE LEGGE INN */                     
       /*------------------------------------------------*/                     
                                                                                
          DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                                   
          DIV_PARAM_OMR.FEIL_VED_LABEL = 'L110';                                
          GO TO UTGANG;                                                         
       END;                                                                     
    END;                                                                        
                                                                                
    SSA_REGTPKT.DATO_KEY   = REGTPKT.DATO  ;                                    
    SSA_REGTPKT.KLOKKE_KEY = REGTPKT.KLOKKE;                                    
                                                                                
 /*-------------------------------*/                                            
 /* BEHANDLING AV SIVILST-SEGMENT */                                            
 /*-------------------------------*/                                            
                                                                                
    IF SEGMENT_TABELL.SIVILST THEN                                              
    DO;                                                                         
       PBR_TEXT = 'DANN SIVILST-SEGMENT';                                       
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                            
                                                                                
       IO_PEK = ADDR(SIVILST);                                                  
       IO_AREA = IO_HELP_AREA;                                                  
       SSA_UNQUAL = 'SIVILST ';                                                 
       CALL PLITDLI (PARAM_COUNT_6,                                             
                     INSERT,                                                    
                     TR0_PCB,                                                   
                     IO_AREA,                                                   
                     SSA_TR0ROT,                                                
                     SSA_REGTPKT,                                               
                     SSA_UNQUAL);                                               
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                                
          TR0_PCB.STATUS_KODE ^= '  ' THEN                                      
       DO;                                                                      
 L120:                                                                          
           /*-------------------------------------------*/                      
           /* FEIL VED INSERT-KALLET TIL TR0-BASEN      */                      
           /* SIVILST-SEGMENTET LOT SEG IKKE LEGGE INN  */                      
           /*-------------------------------------------*/                      
                                                                                
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                                  
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L120';                               
           GO TO UTGANG;                                                        
        END;                                                                    
     END;                                                                       
                                                                                
                                                                                
 /*--------------------------*/                                                 
 /* BEHANDLING AV GS-SEGMENT */                                                 
 /*--------------------------*/                                                 
                                                                                
    IF SEGMENT_TABELL.GS THEN                                                   
    DO;                                                                         
       PBR_TEXT = 'DANN GS-SEGMENT';                                            
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                            
                                                                                
       IO_PEK = ADDR(GS);                                                       
       IO_AREA = IO_HELP_AREA;                                                  
       SSA_UNQUAL = 'GS      ';                                                 
       CALL PLITDLI (PARAM_COUNT_6,                                             
                     INSERT,                                                    
                     TR0_PCB,                                                   
                     IO_AREA,                                                   
                     SSA_TR0ROT,                                                
                     SSA_REGTPKT,                                               
                     SSA_UNQUAL);                                               
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                                
          TR0_PCB.STATUS_KODE ^= '  ' THEN                                      
       DO;                                                                      
 L130:                                                                          
           /*---------------------------------------*/                          
           /* FEIL VED INSERT-KALLET TIL TR0-BASEN  */                          
           /* GS-SEGMENTET LOT SEG IKKE LEGGE INN   */                          
           /*---------------------------------------*/                          
                                                                                
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                                  
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L130';                               
           GO TO UTGANG;                                                        
        END;                                                                    
     END;                                                                       
                                                                                
 /*---------------------------*/                                                
 /* BEHANDLING AV HSU-SEGMENT */                                                
 /*---------------------------*/                                                
                                                                                
    IF SEGMENT_TABELL.HSU THEN                                                  
    DO;                                                                         
       PBR_TEXT = 'DANN HSU-SEGMENT';                                           
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                            
                                                                                
       IO_PEK = ADDR (HSU);                                                     
       IO_AREA = IO_HELP_AREA;                                                  
       SSA_UNQUAL = 'HSU     ';                                                 
       CALL PLITDLI (PARAM_COUNT_6,                                             
                     INSERT,                                                    
                     TR0_PCB,                                                   
                     IO_AREA,                                                   
                     SSA_TR0ROT,                                                
                     SSA_REGTPKT,                                               
                     SSA_UNQUAL);                                               
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                                
          TR0_PCB.STATUS_KODE ^= '  ' THEN                                      
       DO;                                                                      
 L140:                                                                          
        /*--------------------------------------------*/                        
        /* FEIL VED INSERT-KALLET TIL TR0-BASEN       */                        
        /* UNIKT HSU-SEGMENTET LOT SEG IKKE LEGGE INN */                        
        /*--------------------------------------------*/                        
                                                                                
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                                  
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L140';                               
           GO TO UTGANG;                                                        
        END;                                                                    
     END;                                                                       
                                                                                
 /*--------------------------------*/                                           
 /* BEHANDLING AV DIAGNOSE-SEGMENT */                                           
 /*--------------------------------*/                                           
                                                                                
    IF SEGMENT_TABELL.DIAGNOSE THEN                                             
    DO;                                                                         
       PBR_TEXT = 'DANN DIAGNOSE-SEGMENT';                                      
    /* EXEC CICS SEND TEXT FROM (PBR_TEXT) ACCUM; */                            
                                                                                
       IO_PEK = ADDR (DIAGNOSE);                                                
       IO_AREA = IO_HELP_AREA;                                                  
       SSA_UNQUAL = 'DIAGNOSE';                                                 
       CALL PLITDLI (PARAM_COUNT_6,                                             
                     INSERT,                                                    
                     TR0_PCB,                                                   
                     IO_AREA,                                                   
                     SSA_TR0ROT,                                                
                     SSA_REGTPKT,                                               
                     SSA_UNQUAL);                                               
       IF DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK !                                
          TR0_PCB.STATUS_KODE ^= '  ' THEN                                      
       DO;                                                                      
 L150:                                                                          
        /*-------------------------------------------------*/                   
        /* FEIL VED INSERT-KALLET TIL TR0-BASEN            */                   
        /* UNIKT DIAGNOSE-SEGMENTET LOT SEG IKKE LEGGE INN */                   
        /*-------------------------------------------------*/                   
                                                                                
           DIV_PARAM_OMR.FEIL_MELD_NR   = 500;                                  
           DIV_PARAM_OMR.FEIL_VED_LABEL = 'L150';                               
           GO TO UTGANG;                                                        
        END;                                                                    
     END;                                                                       
                                                                                
 END SKRIV_STAT_SEGM;                                                           
                                                                                
                                                                                
                                                                                
  %INCLUDE R0019901 ;    /* DATO_KONTROLL */                                    
  %INCLUDE R0019904 ;    /* FNR-KONTROLL  */                                    
  %INCLUDE R0019910 ;    /* NUM-KONTROLL  */                                    
  %INCLUDE R0019912 ;    /* KONV FRA NUM TIL CHAR OG OMVENDT */                 
                                                                                
 END; /* OF PROGRAM R0016101 */                                                 
