 /*       SIST ENDRET 23/06-98 08.32.51 AV   JDA7339                  */00000000
 /*       SIST ENDRET 20/05-98 14.17.56 AV   HLA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0011204 - PROGRAM I PLI                                       */00000030
 /*    PROGRAMMERT AV JAN I AUGUST 1981                               */00000040
 /*HENSIKT:                                                           */00000050
 /*    PROGRAMMET BEHANDLER BARNEDELEN.                               */00000060
 /*ENDRING:                                                           */00000070
 /*    PROGRAMMET OVERFØR_FT_BARN ER SKILT UT OG LAGT I R0011210.     */00000080
 /*                                                     050587 BRITT  */00000090
 /*BRUK:                                                              */00000100
 /*    KONTR_BARNEDEL    - KONTROLL AV BARNEDELEN                     */00000110
 /*       (VIRK_DATO_MÅ,FEIL_FUNNET)                                  */00000120
 /*                                                                   */00000130
 /*    KONTROLL AV FT_BARN.                                           */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
 %SKIP(2);                                                              00000170
 KONTROLL_FT_BARN:                                                      00000180
   PROC (FEIL_FUNNET);                                                  00000190
 %SKIP;                                                                 00000200
   DCL                                                                  00000210
      FEIL_FUNNET BIT (1);                                              00000220
   DCL                                                                  00000230
      1 FNR_REG,                                                        00000240
        2 FNR1         FIXED DEC(11),                                   00000250
        2 FNR2         FIXED DEC(11),                                   00000260
        2 BRUKERID     CHAR     ( 4);                                   00000270
   DCL                                                                  00000280
      (FEIL19,                                                          00000290
      FEIL20,                                                           00000300
      FEIL21,                                                           00000310
      FEIL22) BIT (1);                                                  00000320
      FEIL19 = '0'B;                                                    00000330
      FEIL20 = '0'B;                                                    00000340
      FEIL21 = '0'B;                                                    00000350
      FEIL22 = '0'B;                                                    00000360
   DCL                                                                  00000370
      TELL                        FIXED BIN(15),                        00000380
      TELL_BARN                   FIXED BIN(15),                        00000390
      ANT_BARN                    FIXED BIN(15);                        00000400
   DCL                                                                  00000410
      ALDER FIXED(5);                                                   00000420
   DCL VIRK_DATO_ÅM   PIC '(6)9'; /*2000*/                              00000430
                                                                        00000440
      VIRK_DATO_ÅM = FTS.VIRK_DATO_ÅMD / 100;   /*2000*/                00000450
                                                                        00000460
      TELL_BARN = 0;                                                    00000470
                                                                        00000480
                                                                        00000490
                                                                        00000500
      FNR_REG.BRUKERID =    DIV_PARAM_OMR.CICS_IND;                     00000510
                                                                        00000520
      DO ANT_BARN = 1 TO 8;                                             00000530
         IF F_FELT_PIC_CHAR11(FTB.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN   00000540
            DO;                                                         00000550
               IF ^F_NUMERISK(F_FELT_PIC_CHAR11(FTB.FNR_BARN(ANT_BARN)))00000560
               THEN                                                     00000570
                  DO;                                                   00000580
                     IF ^FEIL19 THEN                                    00000590
                        DO;                                             00000600
                           FEIL19 = '1'B;                               00000610
                           FTB.FNR_BARNNR(ANT_BARN) = 200;              00000620
                        END;                                            00000630
                     ELSE                                               00000640
                        FTB.FNR_BARNNR(ANT_BARN) = 200;                 00000650
                  END;                                                  00000660
               ELSE                                                     00000670
               IF ^ F_GYLDIG_FNR(FTB.FNR_BARN(ANT_BARN)) THEN           00000680
                  DO;                                                   00000690
                     IF ^FEIL20 THEN                                    00000700
                        DO;                                             00000710
                           FEIL20 = '1'B;                               00000720
                           FTB.FNR_BARNNR(ANT_BARN) = 20;               00000730
                        END;                                            00000740
                     ELSE                                               00000750
                        FTB.FNR_BARNNR(ANT_BARN) = 999;                 00000760
                  END;                                                  00000770
               ELSE                                                     00000780
                  DO;                                                   00000790
                     ALDER =                                            00000800
  /*2000*/          F_ALDER(FTB.FNR_BARN(ANT_BARN),FTS.VIRK_DATO_ÅMD);  00000810
                    FNR_REG.FNR1 = FTB.FNR_BARN(ANT_BARN);              00000820
                    EXEC CICS LINK PROGRAM('R0019906')COMMAREA(FNR_REG);00000830
                    IF FNR_REG.FNR2 > 0 THEN                            00000840
                      DO;                                               00000850
                         FTB.FNR_BARNNR(ANT_BARN) = 203;                00000860
                         FTB.FNR_GML_BARN(ANT_BARN) =                   00000870
                         FTB.FNR_BARN(ANT_BARN);                        00000880
                         FTB.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;         00000890
                      END;                                              00000900
                     IF ALDER > 1712 THEN                               00000910
                        DO;                                             00000920
                           IF ^FEIL21 THEN                              00000930
                              DO;                                       00000940
                                 FEIL21 = '1'B;                         00000950
                                 FTB.FNR_BARNNR(ANT_BARN) = 21;         00000960
                              END;                                      00000970
                           ELSE                                         00000980
                              FTB.FNR_BARNNR(ANT_BARN) = 999;           00000990
                        END;                                            00001000
                     ELSE                                               00001010
                        IF ALDER < 0 THEN                               00001020
                           DO;                                          00001030
                              IF ^FEIL22 THEN                           00001040
                                 DO;                                    00001050
                                    FEIL22 = '1'B;                      00001060
                                    FTB.FNR_BARNNR( ANT_BARN) = 22;     00001070
                                 END;                                   00001080
                              ELSE                                      00001090
                                 FTB.FNR_BARNNR( ANT_BARN) = 999;       00001100
                           END;                                         00001110
                  END;                                                  00001120
                FEIL_FUNNET =                                           00001130
                       FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22; 00001140
                                                                        00001150
               IF ^ FEIL_FUNNET THEN                                    00001160
               IF VIRK_DATO_ÅM  > 199012 &  /*2000*/                    00001170
                  ALDER  < 0001      THEN                               00001180
                    DO;                                                 00001190
                        FEIL_FUNNET = '1'B;                             00001200
                        FTB.RBT_BARNNR(ANT_BARN) = 63;                  00001210
                    END;                             /*TIL HIT TRUDE */ 00001220
               IF FTB.RBT_BARN(ANT_BARN) = 'J' THEN                     00001230
                  DO;                                                   00001240
                     IF VIRK_DATO_ÅM < 198407 THEN  /*2000*/            00001250
                        DO;                                             00001260
                           FEIL_FUNNET = '1'B;                          00001270
                           FTS.VIRK_DATO_ÅMDNR = 276;  /*2000*/         00001280
                        END;                                            00001290
                  END;                                                  00001300
               ELSE                                                     00001310
                  IF FTB.RBT_BARN(ANT_BARN) ^= ' ' THEN                 00001320
                     DO;                                                00001330
                        FEIL_FUNNET = '1'B;                             00001340
                        FTB.RBT_BARNNR(ANT_BARN) = 271;                 00001350
                     END;                                               00001360
               TELL_BARN = TELL_BARN + 1;                               00001370
            END;                                                        00001380
         ELSE                                                           00001390
            LEAVE;                                                      00001400
      END;                                                              00001410
                                                                        00001420
                                                                        00001430
                                                                        00001440
                                                                        00001450
                                                                        00001460
      IF ^ FEIL_FUNNET THEN                                             00001470
        IF FTS.BT_ANT ^= TELL_BARN THEN                                 00001480
           DO;                                                          00001490
              FEIL_FUNNET = '1'B;                                       00001500
              FTS.BT_ANTNR = 23;                                        00001510
           END;                                                         00001520
                                                                        00001530
      FEIL_FUNNET = FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22;    00001540
                                                                        00001550
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00001560
      IF ^FEIL_FUNNET THEN                                              00001570
        IF FTS.BT_ANT > 0 THEN                                          00001580
           DO ANT_BARN = 1 TO FTS.BT_ANT;                               00001590
              DO TELL = ANT_BARN TO FTS.BT_ANT;                         00001600
                 IF TELL ^= ANT_BARN THEN                               00001610
                    IF FTB.FNR_BARN(TELL) = FTB.FNR_BARN(ANT_BARN) THEN 00001620
                       DO;                                              00001630
                          FEIL_FUNNET = '1'B;                           00001640
                          FTB.FNR_BARNNR(ANT_BARN) = 124;               00001650
                          FTB.FNR_BARNNR(TELL) = 999;                   00001660
                       END;                                             00001670
              END;                                                      00001680
           END;                                                         00001690
                                                                        00001700
   END KONTROLL_FT_BARN;                                                00001710
