 /*   SIST ENDRET PÅ PROD   2000.01.14 12.35.16 AV   JDA7339          */        
 /*       SIST ENDRET 07/07-99 12.29.37 AV   JDA7339                  */        
 /*       SIST ENDRET 19/02-99 12.31.16 AV   JDA7339                  */        
 /*       SIST ENDRET 26/01-99 17.47.41 AV   SPA7339                  */        
 /*       SIST ENDRET 26/01-99 14.33.33 AV   SPA7339                  */        
 /*       SIST ENDRET 08/01-99 14.25.41 AV   JDA7339                  */        
 /* **************************************************************** */         
 /*                R 0 0 1 U 8 0 7                                */            
 /* ************************************************************* */            
 /* PROGRAM-ID   R001U807                                         */            
 /*                                                               */            
 /* PROGRAM BLE LAGET : SEP 1998                                  */            
 /*                                                               */            
 /* ************************************************************* */            
 /* PROGRAM INCLUDES AV                                           */            
 /*    04EE BYGG SIDER AV TIDL TRANSER SOM BLANKETTMAP            */            
 /*    C470 BYGG SIDER AV TIDL TRANSER                            */            
 /*    U801 GRUNNBLANKET EE                                       */            
 /*                                                               */            
 /*                                                               */            
 /* ************************************************************* */            
  TEKST_SP_SØKER:  PROC;                                                        
  DCL  NOR_NUM CHAR (1) INIT('&');                                              
                                                                                
  S001U81O.TEXT_HEAD3O      =                                                   
    '3  S P E S I E L L E   O P P L Y N S N I N G E R   S Ø K E R';             
                                                                                
  S001U81O.TEXT_STATO       = 'Statsborgerskap      ';       /*3.1*/            
  S001U81O.TEXT_BOSAO       = 'Bosettningsland v/død      '; /*3.2*/            
                                                                                
                                                                                
  S001U81O.TEXT_MEDLO       = 'Medlem i folketrygden';       /*3.3.1*/          
  S001U81O.TEXT_TT_LO       = 'TT lik poengår             '; /*3.3.2*/          
  S001U81O.TEXT_MINSO       = 'Minst 20 års botid   ';       /*3.3.3*/          
  S001U81O.TEXT_KONVO       = 'Eventuelt konvensjonsland  '; /*3.3.4*/          
                                                                                
  S001U81O.TEXT_FRAVO       = 'Fravik fra bosatt EØS';       /*3.3.5*/          
  S001U81O.TEXT_UFØRO       = 'Garantert tileggspensjon   '; /*3.3.6*/          
                                                                                
  S001U81O.TEXT_FLYKO       = 'Fravik for flykting  ';       /*3.4*/            
  S001U81O.TEXT_ENDRO       = 'Skal trygdetiden endres    '; /*3.5*/            
                                                                                
                                                                                
                                                                                
    IF ^FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                               
                        TRANS_OPPL_OMR.TRANS_RETURKODE THEN                     
       S001U81I.STATSBORGERL  = CURSOR_POS;                                     
                                                                                
    S001U81O.STATSBORGERA         = DFHBMUNP;                                   
    S001U81O.BOSATTA              = DFHBMUNP;                                   
                                                                                
                                                                                
    S001U81O.MEDLEMA              = DFHBMUNP;                                   
    S001U81O.TT_LIK_PÅA           = DFHBMUNP;                                   
    S001U81O.MINST_20ÅRA          = DFHBMUNP;                                   
    S001U81O.KONVENSJON_LANDA     = DFHBMUNP;                                   
    S001U81O.FRAVIK_BOSATT_EØSA   = DFHBMUNP;                                   
    S001U81O.UNG_UFØRA            = DFHBMUNP;                                   
    S001U81O.FRAVIK_FLYKTA        = DFHBMUNP;                                   
    S001U81O.TT_ENDRESA           = DFHBMUNP;                                   
                                                                                
                                                                                
 END TEKST_SP_SØKER;                                                            
 /*----------------------------------------------------------*/                 
 FJERN_TEKST_SP_SØKER: PROC;                                                    
                                                                                
    S001U81O.TEXT_HEAD3O   = (64)' ';                                           
                                                                                
    S001U81O.TEXT_STATO    = (21)' ';                                           
    S001U81O.TEXT_BOSAO    = (29)' ';                                           
    S001U81O.TEXT_MEDLO    = (21)' ';                                           
    S001U81O.TEXT_TT_LO    = (29)' ';                                           
    S001U81O.TEXT_MINSO    = (21)' ';                                           
    S001U81O.TEXT_KONVO    = (29)' ';                                           
    S001U81O.TEXT_FRAVO    = (21)' ';                                           
    S001U81O.TEXT_UFØRO    = (29)' ';                                           
    S001U81O.TEXT_FLYKO    = (21)' ';                                           
    S001U81O.TEXT_ENDRO    = (29)' ';                                           
                                                                                
 END FJERN_TEKST_SP_SØKER;                                                      
