 /*       SIST ENDRET 26/08-91 14.43.35 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 19/06-91 10.20.50 AV   HERMAN                   */00000010
 /*       SIST ENDRET 14/06-91 09.41.08 AV   DYBVIK                   */00000020
 /******************************************************************* */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /************************                                            */00000050
 /*  PROGRAM-IDENT : R001TK81 - HOVEDPROGRAM.                         */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000070
 /*  PROGRAMMERER  : TUYEN                                            */00000080
 /*  PROGRAM LAGET : MAI 91                                           */00000090
 /*          ENDRET: AUG 91 (SKRIV OM PGA MULIGHET FOR SØKING PÅ NAVN)*/00000100
 /******************************************************************* */00000110
 /*HENSIKT:                                                           */00000120
 /************                                                        */00000130
 /*  BLANKETTKONTROLL FOR TK - MERKELAPPER.                           */00000140
 /******************************************************************* */00000150
 /*PROGRAMTILKNYTTING:                                                */00000160
 /**********************                                              */00000170
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE RT81.          */00000180
 /*                                                                   */00000190
 /******************************************************************* */00000200
 /*DATASETTOPPLYSNINGER:                                              */00000210
 /*************************                                           */00000220
 /*  CMSTK  (T001/P001.CMSTK.VSAM)      -  LES/SKRIV                  */00000230
 /*  TK-BASEN                           -  LES                        */00000240
 /******************************************************************* */00000250
 /*FEILMELDINGER:                                                     */00000260
 /*********************                                               */00000270
 /*                                                                   */00000280
 /*                                                                   */00000290
 /* ***************************************************************** */00000300
 R01TK81:                                                               00000310
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000320
                                                                        00000330
 %PAGE;                                                                 00000340
      %INCLUDE S001T8;             /* MERKELAP-MAPSETTET   */           00000350
 %PAGE;                                                                 00000360
      %INCLUDE P001TK03;           /* KOM_OMRÅDE (BASED) */             00000370
 %PAGE;                                                                 00000380
      %INCLUDE DFHBMSCA;                                                00000390
 %PAGE;                                                                 00000400
                                                                        00000410
 /* PCB-OMRÅDER */                                                      00000420
 /*-------------*/                                                      00000430
                                                                        00000440
   DCL 1 TK_PCB_PEKERE BASED (UIBPCBAL),                                00000450
         2 TK1_PCB_PEKER POINTER,                                       00000460
         2 TK2_PCB_PEKER POINTER;                                       00000470
                                                                        00000480
   DCL 1 TK1 BASED (TK1_PCB_PEKER),                                     00000490
      %INCLUDE P0012003;                                                00000500
                                                                        00000510
   DCL 1 TK2 BASED (TK2_PCB_PEKER),                                     00000520
      %INCLUDE P0012003;                                                00000530
                                                                        00000540
 %PAGE;                                                                 00000550
                                                                        00000560
 /* SSA */                                                              00000570
 /*-----*/                                                              00000580
                                                                        00000590
   DCL 1 SSA_TK STATIC,                                                 00000600
         5 HDEL     CHAR (17)   INIT ('TK      (TKNR    '),             00000610
         5 REL_OP   CHAR ( 2)   INIT (' ='),                            00000620
         5 KEY      PIC '( 4)9' INIT (0),                               00000630
         5 HP       CHAR ( 1)   INIT (')');                             00000640
                                                                        00000650
   DCL 1 SSA_TK2 STATIC,                                                00000660
         5 HDEL     CHAR (17)   INIT ('TK      (XTKNAVN '),             00000670
         5 REL_OP   CHAR ( 2)   INIT ('=>'),                            00000680
         5 KEY      CHAR (35)   INIT (''),                              00000690
         5 HP       CHAR ( 1)   INIT (')');                             00000700
                                                                        00000710
 /* SEGMENTER */                                                        00000720
 /*-----------*/                                                        00000730
                                                                        00000740
  %INCLUDE P001TK51;               /* TK-SEGMENT    */                  00000750
                                                                        00000760
 /* DLI PARAMETRE */                                                    00000770
 /*---------------*/                                                    00000780
                                                                        00000790
   %INCLUDE DLIUIB;                                                     00000800
                                                                        00000810
   DCL PLITDLI           EXTERNAL ENTRY;                                00000820
                                                                        00000830
   DCL GU                CHAR      ( 4) INIT ('GU  '),                  00000840
       GN                CHAR      ( 4) INIT ('GN  '),                  00000850
       GHNP              CHAR      ( 4) INIT ('GHNP'),                  00000860
       ISRT              CHAR      ( 4) INIT ('ISRT'),                  00000870
       REPL              CHAR      ( 4) INIT ('REPL'),                  00000880
       TRE               FIXED BIN (31) INIT (3)     ,                  00000890
       FIRE              FIXED BIN (31) INIT (4)     ,                  00000900
       FEM               FIXED BIN (31) INIT (5)     ,                  00000910
       TK_OPEN           CHAR      ( 5) INIT ('OPEN '),                 00000920
       TK_CLOSE          CHAR      ( 5) INIT ('CLOSE');                 00000930
   DCL                                                                  00000940
      (BMSMAPBR,                                                        00000950
      COMMAREA_PEKER) PTR;                                              00000960
   DCL                                                                  00000970
      (CSTG,                                                            00000980
      STG,                                                              00000990
      ADDR,                                                             00001000
      VERIFY,                                                           00001010
      UNSPEC,                                                           00001020
      LOW,                                                              00001030
      NULL,                                                             00001040
      ONCODE,                                                           00001050
      DATE,                                                             00001060
      TRANSLATE,                                                        00001070
      SUBSTR) BUILTIN;                                                  00001080
                                                                        00001090
 /* HJELPE-VARIABLE */                                                  00001100
 /*-----------------*/                                                  00001110
                                                                        00001120
   DCL                                                                  00001130
      FEIL_I_TK                   BIT(1),                               00001140
      FEIL_FUNNET                 BIT(1) INIT ('1'B),                   00001150
      FEIL_FT                     BIT(1) INIT ('0'B),                   00001160
      FEIL_AD                     BIT(1) INIT ('0'B),                   00001170
      FEIL_KJ                     BIT(1) INIT ('0'B),                   00001180
      FEIL_FOK                    BIT(1) INIT ('0'B),                   00001190
      FEIL_SS                     BIT(1) INIT ('0'B),                   00001200
      FEIL_PH                     BIT(1) INIT ('0'B),                   00001210
      FEIL_IN                     BIT(1) INIT ('0'B),                   00001220
      ONKODE                      PIC'9999',                            00001230
      CURSOR_POS                  FIXED BIN(15) INIT(-1),               00001240
      ONK DEF ONKODE              CHAR(4),                              00001250
      FEIL                        FIXED BIN(15) INIT(0),                00001260
      FEILKODE                    CHAR(4),                              00001270
      ANT_FEIL_SKREVET            FIXED DEC (3),                        00001280
      FATAL_FEIL                  BIT (1) INIT ('0'B),                  00001290
      K                           PIC'99' INIT (1),                     00001300
      NR_TAB(1:10)                PIC'9999' INIT (0),                   00001310
      LES_TKNR                    PIC'99999',                           00001320
      LES_NAVN                    CHAR (35) ,                           00001330
      X2                          CHAR (29) ,                           00001340
      X3                          CHAR (29) ,                           00001350
      TK_FINNES                   BIT (1) INIT ('0'B),                  00001360
      SOK_NR                      BIT (1) INIT ('0'B),                  00001370
      FUNNET_I_FIL                BIT (1) INIT ('0'B),                  00001380
      DSNAVN                      CHAR(8);                              00001390
                                                                        00001400
   DCL HJ_TKNR        PIC '( 5)9' INIT (0),                             00001410
       HJ_ADR1        CHAR (34)   INIT (''),                            00001420
       HJ_ADR2        CHAR (27)   INIT (''),                            00001430
       HJ_IN          CHAR ( 2) INIT (''),                              00001440
       HJ_PH          CHAR ( 2) INIT (''),                              00001450
       HJ_FT          CHAR ( 2) INIT (''),                              00001460
       HJ_AD          CHAR ( 2) INIT (''),                              00001470
       HJ_KJ          CHAR ( 2) INIT (''),                              00001480
       HJ_FOK         CHAR ( 2) INIT (''),                              00001490
       HJ_SS          CHAR ( 2) INIT (''),                              00001500
       HJ_IN_PIC      PIC '( 2)9' INIT (0),                             00001510
       HJ_PH_PIC      PIC '( 2)9' INIT (0),                             00001520
       HJ_FT_PIC      PIC '( 2)9' INIT (0),                             00001530
       HJ_AD_PIC      PIC '( 2)9' INIT (0),                             00001540
       HJ_KJ_PIC      PIC '( 2)9' INIT (0),                             00001550
       HJ_FOK_PIC     PIC '( 2)9' INIT (0),                             00001560
       HJ_SS_PIC      PIC '( 2)9' INIT (0);                             00001570
                                                                        00001580
   DCL 1 FIL_REC,                                                       00001590
         5 TKNR         PIC '( 5)9',                                    00001600
         5 ADR1         CHAR (34),                                      00001610
         5 ADR2         CHAR (27),                                      00001620
         5 IN           CHAR ( 2),                                      00001630
         5 PH           CHAR ( 2),                                      00001640
         5 FT           CHAR ( 2),                                      00001650
         5 AD           CHAR ( 2),                                      00001660
         5 KJ           CHAR ( 2),                                      00001670
         5 FOK          CHAR ( 2),                                      00001680
         5 SS           CHAR ( 2);                                      00001690
                                                                        00001700
   DCL 1 FEIL_STRUC,                                                    00001710
         5 FEIL_NR      FIXED DEC ( 5),                                 00001720
         5 FEIL_MELDING      CHAR (78),                                 00001730
         5 KOM_OMR_PEKER  POINTER;                                      00001740
 %PAGE;                                                                 00001750
                                                                        00001760
 /* SLUTT PÅ DEKLARASJONER */                                           00001770
 /**************************/                                           00001780
                                                                        00001790
 ON ERROR SNAP BEGIN       ;                                            00001800
    ON ERROR SYSTEM        ;                                            00001810
    ONKODE=ONCODE          ;                                            00001820
    FEILKODE = 'FEIL'      ;                                            00001830
    DSNAVN   = EIBDS       ;                                            00001840
    GO TO FEILBEH          ;                                            00001850
 END;                                                                   00001860
                                                                        00001870
 FEILKODE        = 'FEIL'   ;                                           00001880
 DSNAVN          = '       ';                                           00001890
 PROGRAM_ID      = 'R001TK81';                                          00001900
                                                                        00001910
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00001920
 EXEC CICS IGNORE CONDITION MAPFAIL       ;                             00001930
                                                                        00001940
 FUNKSJONSKODE = ' ';                                                   00001950
 STYREKODE     = ' ';                                                   00001960
                                                                        00001970
 X2 = 'ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ';                                  00001980
 X3 = 'abcdefghijklmnopqrstuvwxyzæøå';                                  00001990
                                                                        00002000
 CALL TK_DATABASE(TK_OPEN);                                             00002010
                                                                        00002020
 IF SEND_MAP THEN                                                       00002030
    DO;                                                                 00002040
       SEND_MAP = '0'B;                                                 00002050
                                                                        00002060
       ALLOCATE S001005O;                                               00002070
       S001005I.TKNRL = CURSOR_POS;                                     00002080
                                                                        00002090
       EXEC CICS SEND MAP('S001005')                                    00002100
                MAPSET('S001T83') ERASE CURSOR;                         00002110
    END;                                                                00002120
                                                                        00002130
 EXEC CICS RECEIVE MAP('S001005')                                       00002140
        MAPSET('S001T83') SET(BMSMAPBR);                                00002150
                                                                        00002160
 IF S001005I.FUNKSJONSKODEL > 0 THEN                                    00002170
     FUNKSJONSKODE = S001005I.FUNKSJONSKODEI;                           00002180
 ELSE                                                                   00002190
     IF S001005I.STYREKODEL > 0 THEN                                    00002200
          STYREKODE = S001005I.STYREKODEI;                              00002210
                                                                        00002220
 DO WHILE ((FUNKSJONSKODE = ' ') &                                      00002230
           (STYREKODE = ' '));                                          00002240
                                                                        00002250
   CALL INITIERING;                                                     00002260
                                                                        00002270
   IF S001005I.TKNRL > 0 THEN                                           00002280
      DO;                                                               00002290
         LES_TKNR = S001005I.TKNRI;                                     00002300
         SOK_NR = '1'B;                                                 00002310
      END;                                                              00002320
   ELSE                                                                 00002330
      IF S001005I.NAVNL > 0 THEN                                        00002340
         DO;                                                            00002350
            LES_NAVN = TRANSLATE(S001005I.NAVNI,X2,X3);                 00002360
                                                                        00002370
            SOK_NR   = '0'B;                                            00002380
         END;                                                           00002390
      ELSE                                                              00002400
         DO;                                                            00002410
            LES_TKNR = 0;                                               00002420
            SOK_NR = '1'B;                                              00002430
         END;                                                           00002440
                                                                        00002450
   ALLOCATE S001002O;                                                   00002460
   S001002I.ADR1L = CURSOR_POS;                                         00002470
                                                                        00002480
   IF ^SOK_NR THEN                                                      00002490
     DO;                                                                00002500
        K           = 1;                                                00002510
        NR_TAB      = 0;                                                00002520
                                                                        00002530
        SSA_TK2.KEY = LES_NAVN;                                         00002540
        CALL LES_DB_NAVN;                                               00002550
                                                                        00002560
        IF TK_FINNES THEN                                               00002570
           DO WHILE (TK_FINNES & (K < 11));                             00002580
              NR_TAB(K) = TK.TKNR;                                      00002590
              K         = K + 1;                                        00002600
                                                                        00002610
              SSA_TK2.KEY = LES_NAVN;                                   00002620
              CALL LES_DB_NAVN_NESTE;                                   00002630
           END;                                                         00002640
                                                                        00002650
        ELSE                                                            00002660
           DO;                                                          00002670
              ALLOCATE S001005O;                                        00002680
              S001005O.MELDING_1O = 'INGEN TK MED SLIK NAVN FINNES!';   00002690
              S001005I.TKNRL      = CURSOR_POS;                         00002700
                                                                        00002710
              GOTO L900;                                                00002720
           END;                                                         00002730
                                                                        00002740
        K = 1;                                                          00002750
                                                                        00002760
        DO WHILE ((K < 11) & (NR_TAB(K) ^= 0));                         00002770
           LES_TKNR = NR_TAB(K);                                        00002780
                                                                        00002790
           CALL BEHANDLE;                                               00002800
                                                                        00002810
           S001002O.MELDING1O = 'DERSOM DU IKKE VIL SØKE MER';          00002820
           S001002O.MELDING2O = 'ETTER DETTE NAVNET SKRIV M I';         00002830
           S001002O.MELDING3O = 'STYREKODE OG TRYKK ENTER';             00002840
           S001002O.MELDING4O = '';                                     00002850
           S001002O.MELDING5O = 'ELLERS TRYKK BARE ENTER';              00002860
                                                                        00002870
           S001002I.STYREKODEL= CURSOR_POS;                             00002880
                                                                        00002890
           EXEC CICS SEND MAP ('S001002') MAPSET ('S001T83')            00002900
                     CURSOR ERASE;                                      00002910
                                                                        00002920
           EXEC CICS RECEIVE MAP ('S001002') MAPSET ('S001T83')         00002930
                     SET (BMSMAPBR);                                    00002940
                                                                        00002950
           CALL SJEKK_UT;                                               00002960
           CALL INITIERING;                                             00002970
                                                                        00002980
           K = K + 1;                                                   00002990
        END;                                                            00003000
                                                                        00003010
     END; /* ^SOK_NR */                                                 00003020
                                                                        00003030
   ELSE                                                                 00003040
     CALL BEHANDLE;                                                     00003050
                                                                        00003060
   ALLOCATE S001005O;                                                   00003070
   S001005O.MELDING_1O = 'DATA ER BLITT REGISTRERT/OPPDATERT!';         00003080
   S001005I.TKNRL      = CURSOR_POS;                                    00003090
                                                                        00003100
 L900:                                                                  00003110
                                                                        00003120
   EXEC CICS SEND MAP('S001005') MAPSET('S001T83')                      00003130
           CURSOR ERASE;                                                00003140
                                                                        00003150
   EXEC CICS RECEIVE MAP('S001005')                                     00003160
           MAPSET('S001T83') SET(BMSMAPBR);                             00003170
                                                                        00003180
   IF S001005I.FUNKSJONSKODEL > 0 THEN                                  00003190
      FUNKSJONSKODE = S001005I.FUNKSJONSKODEI;                          00003200
   ELSE                                                                 00003210
      IF S001005I.STYREKODEL > 0 THEN                                   00003220
         STYREKODE = S001005I.STYREKODEI;                               00003230
                                                                        00003240
 END; /* WHILE */                                                       00003250
                                                                        00003260
 CALL TK_DATABASE(TK_CLOSE);                                            00003270
                                                                        00003280
 IF FUNKSJONSKODE ^= ' ' THEN                                           00003290
    IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                           00003300
      DO;                                                               00003310
         PROGRAM_ID = 'R001TK04';                                       00003320
         TRANSKODE = 'RT04';                                            00003330
      END;                                                              00003340
                                                                        00003350
    ELSE                                                                00003360
      IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                         00003370
         DO;                                                            00003380
            TRANSKODE = 'RT08';                                         00003390
            PROGRAM_ID = 'R001TK08';                                    00003400
         END;                                                           00003410
                                                                        00003420
      ELSE                                                              00003430
         IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                      00003440
            DO;                                                         00003450
               PROGRAM_ID = 'R001TK09';                                 00003460
               TRANSKODE = 'RT09';                                      00003470
            END;                                                        00003480
                                                                        00003490
         ELSE                                                           00003500
            DO;                                                         00003510
               PROGRAM_ID = 'R001TK03';                                 00003520
               TRANSKODE = 'RT03';                                      00003530
            END;                                                        00003540
                                                                        00003550
 ELSE                                                                   00003560
   IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                                00003570
      DO;                                                               00003580
         IF SUBSTR(FUNKSJON,3,1) = '' THEN                              00003590
            DO;                                                         00003600
                PROGRAM_ID = 'R001TK04';                                00003610
                TRANSKODE = 'RT04';                                     00003620
            END;                                                        00003630
         ELSE                                                           00003640
            DO;                                                         00003650
               PROGRAM_ID = 'R001TK07';                                 00003660
               TRANSKODE = 'RT07';                                      00003670
            END;                                                        00003680
      END;                                                              00003690
                                                                        00003700
   ELSE                                                                 00003710
      IF (VERIFY(STYREKODE, 'Mm') = 0) THEN                             00003720
         DO;                                                            00003730
            PROGRAM_ID = 'R001TK80';                                    00003740
            TRANSKODE = 'RT80';                                         00003750
         END;                                                           00003760
      ELSE                                                              00003770
         DO;                                                            00003780
            PROGRAM_ID = 'R001TK04';                                    00003790
            TRANSKODE = 'RT04';                                         00003800
         END;                                                           00003810
                                                                        00003820
 SEND_MAP      = '1'B;                                                  00003830
 STYREKODE     = ' ';                                                   00003840
 FUNKSJONSKODE = ' ';                                                   00003850
                                                                        00003860
                                                                        00003870
 EXEC CICS XCTL PROGRAM(PROGRAM_ID) COMMAREA(KOM_OMR);                  00003880
                                                                        00003890
 /* INTERNE PROSEDYRER */                                               00003900
 /*--------------------*/                                               00003910
                                                                        00003920
 INITIERING: PROC;                                                      00003930
                                                                        00003940
     FIL_REC        = '';                                               00003950
                                                                        00003960
     HJ_TKNR     = 0;                                                   00003970
     HJ_ADR1     = '';                                                  00003980
     HJ_ADR2     = '';                                                  00003990
     HJ_IN_PIC   = 0;                                                   00004000
     HJ_PH_PIC   = 0;                                                   00004010
     HJ_FT_PIC   = 0;                                                   00004020
     HJ_AD_PIC   = 0;                                                   00004030
     HJ_KJ_PIC   = 0;                                                   00004040
     HJ_FOK_PIC  = 0;                                                   00004050
     HJ_SS_PIC   = 0;                                                   00004060
     HJ_IN       = '';                                                  00004070
     HJ_PH       = '';                                                  00004080
     HJ_FT       = '';                                                  00004090
     HJ_AD       = '';                                                  00004100
     HJ_KJ       = '';                                                  00004110
     HJ_FOK      = '';                                                  00004120
     HJ_SS       = '';                                                  00004130
                                                                        00004140
     FEIL_FUNNET = '1'B;                                                00004150
                                                                        00004160
 END INITIERING;                                                        00004170
                                                                        00004180
                                                                        00004190
 BEHANDLE: PROC;                                                        00004200
                                                                        00004210
     EXEC CICS HANDLE CONDITION NOTFND (IKKE_FUNNET);                   00004220
                                                                        00004230
     EXEC CICS READ DATASET ('CMSTK')                                   00004240
                    INTO    (FIL_REC)                                   00004250
                    RIDFLD  (LES_TKNR);                                 00004260
                                                                        00004270
     CALL GI_DATA_TIL_SKJERM;                                           00004280
                                                                        00004290
     FUNNET_I_FIL   = '1'B;                                             00004300
                                                                        00004310
     GOTO L100;                                                         00004320
                                                                        00004330
     IKKE_FUNNET:                                                       00004340
                                                                        00004350
        FUNNET_I_FIL   = '0'B;                                          00004360
        S001002O.TKNRO = LES_TKNR;                                      00004370
                                                                        00004380
     L100:                                                              00004390
                                                                        00004400
        EXEC CICS SEND MAP('S001002') MAPSET('S001T83')                 00004410
                  CURSOR ERASE;                                         00004420
                                                                        00004430
        EXEC CICS RECEIVE MAP('S001002')                                00004440
                  MAPSET('S001T83') SET(BMSMAPBR);                      00004450
                                                                        00004460
        CALL SJEKK_UT;                                                  00004470
                                                                        00004480
        CALL SJEKK_FEIL;                                                00004490
                                                                        00004500
        IF FUNNET_I_FIL THEN                                            00004510
           EXEC CICS READ DATASET ('CMSTK')                             00004520
                          INTO    (FIL_REC)                             00004530
                          RIDFLD  (LES_TKNR)                            00004540
                          UPDATE;                                       00004550
                                                                        00004560
        FIL_REC = '';                                                   00004570
                                                                        00004580
        CALL GI_FILRECORD_VERDI;                                        00004590
                                                                        00004600
        IF FUNNET_I_FIL THEN                                            00004610
           EXEC CICS REWRITE DATASET ('CMSTK')                          00004620
                             FROM    (FIL_REC);                         00004630
        ELSE                                                            00004640
           EXEC CICS WRITE DATASET ('CMSTK')                            00004650
                           FROM    (FIL_REC)                            00004660
                           RIDFLD  (LES_TKNR);                          00004670
 END BEHANDLE;                                                          00004680
                                                                        00004690
                                                                        00004700
 GI_DATA_TIL_SKJERM: PROC;                                              00004710
                                                                        00004720
     S001002O.TKNRO = FIL_REC.TKNR;                                     00004730
     HJ_TKNR        = FIL_REC.TKNR;                                     00004740
                                                                        00004750
     S001002O.ADR1O = FIL_REC.ADR1;                                     00004760
     HJ_ADR1        = FIL_REC.ADR1;                                     00004770
                                                                        00004780
     S001002O.ADR2O = FIL_REC.ADR2;                                     00004790
     HJ_ADR2        = FIL_REC.ADR2;                                     00004800
                                                                        00004810
     S001002O.FTO   = FIL_REC.FT;                                       00004820
     HJ_FT          = FIL_REC.FT;                                       00004830
                                                                        00004840
     S001002O.ADO   = FIL_REC.AD;                                       00004850
     HJ_AD          = FIL_REC.AD;                                       00004860
                                                                        00004870
     S001002O.KJO   = FIL_REC.KJ;                                       00004880
     HJ_KJ          = FIL_REC.KJ;                                       00004890
                                                                        00004900
     S001002O.FOKO   = FIL_REC.FOK;                                     00004910
     HJ_FOK          = FIL_REC.FOK;                                     00004920
                                                                        00004930
     S001002O.SSO   = FIL_REC.SS;                                       00004940
     HJ_SS          = FIL_REC.SS;                                       00004950
                                                                        00004960
     S001002O.PHO   = FIL_REC.PH;                                       00004970
     HJ_PH          = FIL_REC.PH;                                       00004980
                                                                        00004990
     S001002O.INO   = FIL_REC.IN;                                       00005000
     HJ_IN          = FIL_REC.IN;                                       00005010
                                                                        00005020
 END GI_DATA_TIL_SKJERM;                                                00005030
                                                                        00005040
                                                                        00005050
 SJEKK_FEIL: PROC;                                                      00005060
                                                                        00005070
      DO WHILE (FEIL_FUNNET);                                           00005080
         IF S001002I.ADR1L > 0 THEN                                     00005090
            HJ_ADR1 = S001002I.ADR1I;                                   00005100
                                                                        00005110
         IF S001002I.ADR2L > 0 THEN                                     00005120
            HJ_ADR2 = S001002I.ADR2I;                                   00005130
                                                                        00005140
         IF S001002I.FTL > 0 THEN                                       00005150
            DO;                                                         00005160
               HJ_FT = S001002I.FTI;                                    00005170
                                                                        00005180
               IF VERIFY(S001002I.FTI,'0123456789 ') ^= 0 THEN          00005190
                  FEIL_FT = '1'B;                                       00005200
               ELSE                                                     00005210
                  FEIL_FT = '0'B;                                       00005220
            END;                                                        00005230
                                                                        00005240
         IF S001002I.ADL > 0 THEN                                       00005250
            DO;                                                         00005260
               HJ_AD = S001002I.ADI;                                    00005270
                                                                        00005280
               IF VERIFY(S001002I.ADI,'0123456789 ') ^= 0 THEN          00005290
                  FEIL_AD = '1'B;                                       00005300
               ELSE                                                     00005310
                  FEIL_AD = '0'B;                                       00005320
            END;                                                        00005330
                                                                        00005340
         IF S001002I.KJL > 0 THEN                                       00005350
            DO;                                                         00005360
               HJ_KJ = S001002I.KJI;                                    00005370
                                                                        00005380
               IF VERIFY(S001002I.KJI,'0123456789 ') ^= 0 THEN          00005390
                  FEIL_KJ = '1'B;                                       00005400
               ELSE                                                     00005410
                  FEIL_KJ = '0'B;                                       00005420
            END;                                                        00005430
                                                                        00005440
         IF S001002I.FOKL > 0 THEN                                      00005450
            DO;                                                         00005460
               HJ_FOK = S001002I.FOKI;                                  00005470
                                                                        00005480
               IF VERIFY(S001002I.FOKI,'0123456789 ') ^= 0 THEN         00005490
                  FEIL_FOK = '1'B;                                      00005500
               ELSE                                                     00005510
                  FEIL_FOK = '0'B;                                      00005520
            END;                                                        00005530
                                                                        00005540
         IF S001002I.SSL > 0 THEN                                       00005550
            DO;                                                         00005560
               HJ_SS = S001002I.SSI;                                    00005570
                                                                        00005580
               IF VERIFY(S001002I.SSI,'0123456789 ') ^= 0 THEN          00005590
                  FEIL_SS = '1'B;                                       00005600
               ELSE                                                     00005610
                  FEIL_SS = '0'B;                                       00005620
            END;                                                        00005630
                                                                        00005640
         IF S001002I.PHL > 0 THEN                                       00005650
            DO;                                                         00005660
               HJ_PH = S001002I.PHI;                                    00005670
                                                                        00005680
               IF VERIFY(S001002I.PHI,'0123456789 ') ^= 0 THEN          00005690
                  FEIL_PH = '1'B;                                       00005700
               ELSE                                                     00005710
                  FEIL_PH = '0'B;                                       00005720
            END;                                                        00005730
                                                                        00005740
         IF S001002I.INL > 0 THEN                                       00005750
            DO;                                                         00005760
               HJ_IN = S001002I.INI;                                    00005770
                                                                        00005780
               IF VERIFY(S001002I.INI,'0123456789 ') ^= 0 THEN          00005790
                  FEIL_IN = '1'B;                                       00005800
               ELSE                                                     00005810
                  FEIL_IN = '0'B;                                       00005820
            END;                                                        00005830
                                                                        00005840
         IF FEIL_FT ! FEIL_AD ! FEIL_KJ ! FEIL_FOK !                    00005850
            FEIL_SS ! FEIL_PH ! FEIL_IN              THEN               00005860
            DO;                                                         00005870
               FEIL_FUNNET = '1'B;                                      00005880
               S001002O.MELDING1O = 'DET MÅ VÆRE NUMMERISK VERDI HER!'; 00005890
            END;                                                        00005900
                                                                        00005910
         ELSE                                                           00005920
            FEIL_FUNNET = '0'B;                                         00005930
                                                                        00005940
         IF FEIL_FT THEN                                                00005950
            S001002I.FTL = CURSOR_POS;                                  00005960
                                                                        00005970
         IF FEIL_AD THEN                                                00005980
            S001002I.ADL = CURSOR_POS;                                  00005990
                                                                        00006000
         IF FEIL_KJ THEN                                                00006010
            S001002I.KJL = CURSOR_POS;                                  00006020
                                                                        00006030
         IF FEIL_FOK THEN                                               00006040
            S001002I.FOKL = CURSOR_POS;                                 00006050
                                                                        00006060
         IF FEIL_SS THEN                                                00006070
            S001002I.SSL = CURSOR_POS;                                  00006080
                                                                        00006090
         IF FEIL_PH THEN                                                00006100
            S001002I.PHL = CURSOR_POS;                                  00006110
                                                                        00006120
         IF FEIL_IN THEN                                                00006130
            S001002I.INL = CURSOR_POS;                                  00006140
                                                                        00006150
         IF FEIL_FUNNET THEN                                            00006160
            DO;                                                         00006170
               S001002O.TKNRO = HJ_TKNR;                                00006180
                                                                        00006190
               IF S001002I.ADR1L > 0 THEN                               00006200
                  DO;                                                   00006210
                     S001002O.ADR1O = S001002I.ADR1I;                   00006220
                     HJ_ADR1        = S001002I.ADR1I;                   00006230
                  END;                                                  00006240
               ELSE                                                     00006250
                  S001002O.ADR1O = HJ_ADR1;                             00006260
                                                                        00006270
               IF S001002I.ADR2L > 0 THEN                               00006280
                  DO;                                                   00006290
                     S001002O.ADR2O = S001002I.ADR2I;                   00006300
                     HJ_ADR2        = S001002I.ADR2I;                   00006310
                  END;                                                  00006320
               ELSE                                                     00006330
                  S001002O.ADR2O = HJ_ADR2;                             00006340
                                                                        00006350
               S001002O.FTO  = HJ_FT;                                   00006360
               S001002O.ADO  = HJ_AD;                                   00006370
               S001002O.KJO  = HJ_KJ;                                   00006380
               S001002O.FOKO = HJ_FOK;                                  00006390
               S001002O.SSO  = HJ_SS;                                   00006400
               S001002O.PHO  = HJ_PH;                                   00006410
               S001002O.INO  = HJ_IN;                                   00006420
                                                                        00006430
               EXEC CICS SEND MAP('S001002') MAPSET('S001T83')          00006440
                         CURSOR ERASE;                                  00006450
                                                                        00006460
               EXEC CICS RECEIVE MAP('S001002')                         00006470
                         MAPSET('S001T83') SET(BMSMAPBR);               00006480
                                                                        00006490
               CALL SJEKK_UT;                                           00006500
            END;                                                        00006510
      END;                                                              00006520
                                                                        00006530
 END SJEKK_FEIL;                                                        00006540
                                                                        00006550
                                                                        00006560
 GI_FILRECORD_VERDI: PROC;                                              00006570
                                                                        00006580
      FIL_REC.TKNR = LES_TKNR;                                          00006590
                                                                        00006600
      IF S001002I.ADR1L > 0 THEN                                        00006610
         FIL_REC.ADR1 = S001002I.ADR1I;                                 00006620
      ELSE                                                              00006630
         FIL_REC.ADR1 = HJ_ADR1;                                        00006640
                                                                        00006650
      IF S001002I.ADR2L > 0 THEN                                        00006660
         FIL_REC.ADR2 = S001002I.ADR2I;                                 00006670
      ELSE                                                              00006680
         FIL_REC.ADR2 = HJ_ADR2;                                        00006690
                                                                        00006700
      IF HJ_FT ^= '' THEN                                               00006710
         HJ_FT_PIC = HJ_FT;                                             00006720
                                                                        00006730
      IF HJ_AD ^= '' THEN                                               00006740
         HJ_AD_PIC = HJ_AD;                                             00006750
                                                                        00006760
      IF HJ_KJ ^= '' THEN                                               00006770
         HJ_KJ_PIC = HJ_KJ;                                             00006780
                                                                        00006790
      IF HJ_FOK ^= '' THEN                                              00006800
         HJ_FOK_PIC = HJ_FOK;                                           00006810
                                                                        00006820
      IF HJ_SS ^= '' THEN                                               00006830
         HJ_SS_PIC = HJ_SS;                                             00006840
                                                                        00006850
      IF HJ_PH ^= '' THEN                                               00006860
         HJ_PH_PIC = HJ_PH;                                             00006870
                                                                        00006880
      IF HJ_IN ^= '' THEN                                               00006890
         HJ_IN_PIC = HJ_IN;                                             00006900
                                                                        00006910
      IF HJ_FT ^= '' THEN                                               00006920
         FIL_REC.FT = HJ_FT_PIC;                                        00006930
      ELSE                                                              00006940
         FIL_REC.FT = HJ_FT;                                            00006950
                                                                        00006960
      IF HJ_AD ^= '' THEN                                               00006970
         FIL_REC.AD = HJ_AD_PIC;                                        00006980
      ELSE                                                              00006990
         FIL_REC.AD = HJ_AD;                                            00007000
                                                                        00007010
      IF HJ_KJ ^= '' THEN                                               00007020
         FIL_REC.KJ = HJ_KJ_PIC;                                        00007030
      ELSE                                                              00007040
         FIL_REC.KJ = HJ_KJ;                                            00007050
                                                                        00007060
      IF HJ_FOK ^= '' THEN                                              00007070
         FIL_REC.FOK = HJ_FOK_PIC;                                      00007080
      ELSE                                                              00007090
         FIL_REC.FOK = HJ_FOK;                                          00007100
                                                                        00007110
      IF HJ_SS ^= '' THEN                                               00007120
         FIL_REC.SS = HJ_SS_PIC;                                        00007130
      ELSE                                                              00007140
         FIL_REC.SS = HJ_SS;                                            00007150
                                                                        00007160
      IF HJ_PH ^= '' THEN                                               00007170
         FIL_REC.PH = HJ_PH_PIC;                                        00007180
      ELSE                                                              00007190
         FIL_REC.PH = HJ_PH;                                            00007200
                                                                        00007210
      IF HJ_IN ^= '' THEN                                               00007220
         FIL_REC.IN = HJ_IN_PIC;                                        00007230
      ELSE                                                              00007240
         FIL_REC.IN = HJ_IN;                                            00007250
                                                                        00007260
 END GI_FILRECORD_VERDI;                                                00007270
                                                                        00007280
                                                                        00007290
 SJEKK_UT: PROC;                                                        00007300
                                                                        00007310
    IF S001002I.FUNKSJONSKODEL > 0 THEN                                 00007320
       FUNKSJONSKODE = S001002I.FUNKSJONSKODEI;                         00007330
    ELSE                                                                00007340
       IF S001002I.STYREKODEL > 0 THEN                                  00007350
          STYREKODE = S001002I.STYREKODEI;                              00007360
                                                                        00007370
    IF FUNKSJONSKODE ^= ' ' THEN                                        00007380
       DO;                                                              00007390
          IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                     00007400
            DO;                                                         00007410
               PROGRAM_ID = 'R001TK04';                                 00007420
               TRANSKODE = 'RT04';                                      00007430
            END;                                                        00007440
                                                                        00007450
          ELSE                                                          00007460
            IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                   00007470
               DO;                                                      00007480
                  TRANSKODE = 'RT08';                                   00007490
                  PROGRAM_ID = 'R001TK08';                              00007500
               END;                                                     00007510
                                                                        00007520
            ELSE                                                        00007530
               IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                00007540
                  DO;                                                   00007550
                     PROGRAM_ID = 'R001TK09';                           00007560
                     TRANSKODE = 'RT09';                                00007570
                  END;                                                  00007580
                                                                        00007590
               ELSE                                                     00007600
                  DO;                                                   00007610
                     PROGRAM_ID = 'R001TK03';                           00007620
                     TRANSKODE = 'RT03';                                00007630
                  END;                                                  00007640
                                                                        00007650
          SEND_MAP      = '1'B;                                         00007660
          STYREKODE     = ' ';                                          00007670
          FUNKSJONSKODE = ' ';                                          00007680
                                                                        00007690
          CALL TK_DATABASE(TK_CLOSE);                                   00007700
                                                                        00007710
          EXEC CICS XCTL PROGRAM(PROGRAM_ID)                            00007720
               COMMAREA(KOM_OMR);                                       00007730
       END;                                                             00007740
                                                                        00007750
    ELSE                                                                00007760
      IF STYREKODE ^= ' ' THEN                                          00007770
         DO;                                                            00007780
             IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                      00007790
                DO;                                                     00007800
                   IF SUBSTR(FUNKSJON,3,1) = '' THEN                    00007810
                      DO;                                               00007820
                          PROGRAM_ID = 'R001TK04';                      00007830
                          TRANSKODE = 'RT04';                           00007840
                      END;                                              00007850
                   ELSE                                                 00007860
                      DO;                                               00007870
                         PROGRAM_ID = 'R001TK07';                       00007880
                         TRANSKODE = 'RT07';                            00007890
                      END;                                              00007900
                END;                                                    00007910
                                                                        00007920
             ELSE                                                       00007930
                IF (VERIFY(STYREKODE, 'Mm') = 0) THEN                   00007940
                   DO;                                                  00007950
                      PROGRAM_ID = 'R001TK80';                          00007960
                      TRANSKODE = 'RT80';                               00007970
                   END;                                                 00007980
                ELSE                                                    00007990
                   DO;                                                  00008000
                      PROGRAM_ID = 'R001TK04';                          00008010
                      TRANSKODE = 'RT04';                               00008020
                   END;                                                 00008030
                                                                        00008040
            SEND_MAP      = '1'B;                                       00008050
            STYREKODE     = ' ';                                        00008060
            FUNKSJONSKODE = ' ';                                        00008070
                                                                        00008080
            CALL TK_DATABASE(TK_CLOSE);                                 00008090
                                                                        00008100
            EXEC CICS XCTL PROGRAM(PROGRAM_ID)                          00008110
                   COMMAREA(KOM_OMR);                                   00008120
         END;                                                           00008130
 END SJEKK_UT;                                                          00008140
                                                                        00008150
                                                                        00008160
                                                                        00008170
 LES_DB_NAVN: PROC;                                                     00008180
                                                                        00008190
     TK = '';                                                           00008200
                                                                        00008210
     CALL PLITDLI       (FIRE              ,                            00008220
                         GU                ,                            00008230
                         TK2               ,                            00008240
                         TK                ,                            00008250
                         SSA_TK2)          ;                            00008260
                                                                        00008270
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00008280
        DO;                                                             00008290
 L150:                                                                  00008300
           FEIL_MELD_NR    =  500;                                      00008310
           FEIL_VED_LABEL  = '150';                                     00008320
           FATAL_FEIL      = '1'B;                                      00008330
           CALL SKRIV_FEILMELDING;                                      00008340
           EXEC CICS ABEND ABCODE(FEIL);                                00008350
        END;                                                            00008360
                                                                        00008370
     IF ((TK2.STATUS_KODE = 'GE') ! (TK2.STATUS_KODE = 'GB')) THEN      00008380
        TK_FINNES = '0'B;                                               00008390
                                                                        00008400
     ELSE                                                               00008410
        IF TK2.STATUS_KODE ^= '  ' THEN                                 00008420
           DO;                                                          00008430
  L160:                                                                 00008440
               FEIL_MELD_NR    =  500;                                  00008450
               FEIL_VED_LABEL  = '160';                                 00008460
               FATAL_FEIL      = '1'B;                                  00008470
               CALL SKRIV_FEILMELDING;                                  00008480
               EXEC CICS ABEND ABCODE(FEIL);                            00008490
           END;                                                         00008500
        ELSE                                                            00008510
           TK_FINNES = '1'B;                                            00008520
                                                                        00008530
 END LES_DB_NAVN;                                                       00008540
                                                                        00008550
                                                                        00008560
 LES_DB_NAVN_NESTE: PROC;                                               00008570
                                                                        00008580
     TK = '';                                                           00008590
                                                                        00008600
     CALL PLITDLI       (FIRE              ,                            00008610
                         GN                ,                            00008620
                         TK2               ,                            00008630
                         TK                ,                            00008640
                         SSA_TK2)          ;                            00008650
                                                                        00008660
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00008670
        DO;                                                             00008680
 L170:                                                                  00008690
           FEIL_MELD_NR    =  500;                                      00008700
           FEIL_VED_LABEL  = '170';                                     00008710
           FATAL_FEIL      = '1'B;                                      00008720
           CALL SKRIV_FEILMELDING;                                      00008730
           EXEC CICS ABEND ABCODE(FEIL);                                00008740
        END;                                                            00008750
                                                                        00008760
     IF ((TK2.STATUS_KODE = 'GE') ! (TK2.STATUS_KODE = 'GB')) THEN      00008770
        TK_FINNES = '0'B;                                               00008780
                                                                        00008790
     ELSE                                                               00008800
        IF TK2.STATUS_KODE ^= '  ' THEN                                 00008810
           DO;                                                          00008820
  L180:                                                                 00008830
               FEIL_MELD_NR    =  500;                                  00008840
               FEIL_VED_LABEL  = '180';                                 00008850
               FATAL_FEIL      = '1'B;                                  00008860
               CALL SKRIV_FEILMELDING;                                  00008870
               EXEC CICS ABEND ABCODE(FEIL);                            00008880
           END;                                                         00008890
        ELSE                                                            00008900
           TK_FINNES = '1'B;                                            00008910
                                                                        00008920
 END LES_DB_NAVN_NESTE;                                                 00008930
                                                                        00008940
                                                                        00008950
 SKRIV_FEILMELDING: PROC;                                               00008960
                                                                        00008970
    S001002I.TKNRL = CURSOR_POS;                                        00008980
                                                                        00008990
    S001002O.MELDING1O =                                                00009000
       'FEIL VED LABEL: ' !! FEIL_VED_LABEL;                            00009010
                                                                        00009020
    S001002O.MELDING2O =                                                00009030
       'UIBFCTR: ' !! UNSPEC(UIBFCTR) !!                                00009040
       ' UIBDLTR: ' !! UNSPEC(UIBDLTR);                                 00009050
                                                                        00009060
    S001002O.MELDING3O =                                                00009070
       'STATUS-KODE: ' !! TK2.STATUS_KODE;                              00009080
                                                                        00009090
    EXEC CICS SEND MAP('S001002') MAPSET('S001T83') ERASE;              00009100
                                                                        00009110
    EXEC CICS RECEIVE MAP('S001002')                                    00009120
           MAPSET('S001T83') SET(BMSMAPBR);                             00009130
                                                                        00009140
 END SKRIV_FEILMELDING;                                                 00009150
                                                                        00009160
                                                                        00009170
 TK_DATABASE:                                                           00009180
   PROC    (STYRING);                                                   00009190
                                                                        00009200
   DCL                                                                  00009210
      STYRING             CHAR (5);                                     00009220
                                                                        00009230
  /* **************************************************************** */00009240
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00009250
  /*     KALL                                                         */00009260
  /* **************************************************************** */00009270
                                                                        00009280
     DCL                                                                00009290
       PSB_NAVN                    CHAR (8)       INIT('B001TK02'),     00009300
       PCB_FUNCTION                CHAR (4)       INIT('PCB '),         00009310
       TERM_FUNCTION               CHAR (4)       INIT('TERM');         00009320
                                                                        00009330
                                                                        00009340
  /* **************************************************************** */00009350
  /*     DLI CALL-PARAMETRE                                           */00009360
  /* **************************************************************** */00009370
                                                                        00009380
     DCL 1  DLI_PARAM,                                                  00009390
            2   PARM_CT_1          FIXED BIN (31)  INIT ( 1 ),          00009400
            2   PARM_CT_3          FIXED BIN (31)  INIT ( 3 ),          00009410
            2   PARM_CT_4          FIXED BIN (31)  INIT ( 4 );          00009420
                                                                        00009430
                                                                        00009440
                                                                        00009450
     IF STYRING = 'OPEN '                         THEN                  00009460
        DO;                                                             00009470
           CALL   PLITDLI                        (PARM_CT_3,            00009480
                                                  PCB_FUNCTION,         00009490
                                                  PSB_NAVN,             00009500
                                                  UIBPTR);              00009510
                                                                        00009520
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00009530
             DO;                                                        00009540
                S001005O.MELDING_1O =                                   00009550
                 'DB-FEIL PÅ ÅPNINGSKALLET, KODE:' !!                   00009560
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00009570
                                                                        00009580
                EXEC CICS SEND MAP('S001005') MAPSET('S001T83')         00009590
                       ERASE CURSOR;                                    00009600
                                                                        00009610
                EXEC CICS RECEIVE MAP('S001005')                        00009620
                       MAPSET('S001T83') SET(BMSMAPBR);                 00009630
                                                                        00009640
                EXEC CICS ABEND ABCODE(FEIL);                           00009650
             END;                                                       00009660
        END;                                                            00009670
     ELSE                                                               00009680
        DO;                                                             00009690
           CALL   PLITDLI                     (PARM_CT_1,               00009700
                                               TERM_FUNCTION);          00009710
                                                                        00009720
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00009730
             DO;                                                        00009740
                S001005O.MELDING_1O =                                   00009750
                 'DB-FEIL PÅ STENGINGSKALLET, KODE:' !!                 00009760
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00009770
                                                                        00009780
                EXEC CICS SEND MAP('S001005') MAPSET('S001T83') ERASE;  00009790
                                                                        00009800
                EXEC CICS RECEIVE MAP('S001005')                        00009810
                       MAPSET('S001T83') SET(BMSMAPBR);                 00009820
                                                                        00009830
                EXEC CICS ABEND ABCODE(FEIL);                           00009840
             END;                                                       00009850
        END;                                                            00009860
                                                                        00009870
 END TK_DATABASE;                                                       00009880
                                                                        00009890
                                                                        00009900
  FEILBEH:                                                              00009910
                                                                        00009920
     CALL TK_DATABASE(TK_CLOSE);                                        00009930
                                                                        00009940
                                                                        00009950
                                                                        00009960
     S001002O.MELDING1O =                                               00009970
                                                                        00009980
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00009990
                                                                        00010000
     S001002O.MELDING2O =                                               00010010
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00010020
                                                                        00010030
     S001002O.MELDING3O =                                               00010040
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00010050
                                         !! '. DATASETT : ' !! DSNAVN;  00010060
                                                                        00010070
     S001002O.MELDING4O =                                               00010080
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00010090
                                                                        00010100
     EXEC CICS SEND MAP('S001002') MAPSET('S001T83') ERASE;             00010110
                                                                        00010120
     EXEC CICS RECEIVE MAP('S001002')                                   00010130
                       MAPSET('S001T83') SET(BMSMAPBR);                 00010140
                                                                        00010150
                                                                        00010160
     EXEC CICS SYNCPOINT ROLLBACK;                                      00010170
                                                                        00010180
     EXEC CICS RETURN;                                                  00010190
                                                                        00010200
                                                                        00010210
 END R01TK81;                                                           00010220
