 /*   SIST ENDRET PÅ PROD   2008.06.20  9.09.59 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2008.06.18 12.16.04 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2007.05.25 12.52.02 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.06.18 15.17.57 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.06.18 15.16.51 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2006.06.14 14.48.32 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2006.01.30 10.14.30 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2006.01.27 13.30.21 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.27 13.29.35 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.17 11.51.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.06.10 11.04.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.05.26  9.46.34 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.05.25 13.32.15 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.05.24  8.37.49 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.05.23 14.20.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.07.23 13.20.39 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.23 13.15.36 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.06.04  9.52.01 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.11.25 12.36.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.25 12.32.56 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.07.25  9.58.53 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.07.25  9.58.04 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.07.25  9.53.29 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.07.25  9.52.20 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.07.10 12.47.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.07.10 12.33.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.19 15.36.00 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.04.15 13.20.07 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.06.21  9.11.32 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.06.21 15.16.17 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.06.20 13.29.12 AV   SPA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.06.15  8.46.04 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.05.23 11.38.59 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.03.15 14.23.55 AV   HLA7339          */        
                                                                                
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0019H01 - GRUNNBELØPS_ENDRING - CICS-HOVEDPROG I PLI         */        
 /*     PROGRAMMERER: TOM JØRGENSEN, OKTOBER 1982.                    */        
 /* HENSIKT                                                           */        
 /*     KJØRES HVER GANG DET ER GRUNNBELØPS-ENDRING.                  */        
 /* ***************************************************************** */        
 /* ***************************************************************** */        
 /* GRUNNBELØPS-ENDRING                                               */        
 /*        PROGRAMMET LESER SEKVENSIELT GJENNOM PEPO-BASEN.           */        
 /*           NÅR EN PERSON MED PENSJON UTEN MERKE OM TIDLIGERE BE-   */        
 /*           HANDLET (BARE YNGSTE BARN I ET BARNEKULL BLIR LEST)     */        
 /*           SKJER FØLGENDE:                                         */        
 /*              - SISTE STATUS FOR FAMILIEN BLIR OPPRETTET GJENNOM   */        
 /*                MODULEN OPPRETT-SISTE-STATUS-FOR-FAMILIEN-BATCH    */        
 /*              - FAMILIEN BLIR OMREGNET MED DET NYE GRUNNBELØPET    */        
 /*                I MODULEN BEREGNING                                */        
 /*              - EKTEFELLE SOM HAR PENSJON BLIR MERKET SLIK AT      */        
 /*                FAMILIEN IKKE SKAL BLI BEHANDLET EN GANG TIL       */        
 /*                NÅR EKTEFELLEN BLIR LEST UNDER DEN SEKVENSIELLE    */        
 /*                LESINGEN.                                          */        
 /*           ETTER AT FAMILIEN ER OMREGNET SKAL RESULTATET SKRIVES   */        
 /*           UT PÅ ET DATASETT FOR VIDERE Å BLI SENDT TIL DATA-      */        
 /*           SENTRALENE.  DETTE DATASETTET KAN VI LISTE FOR KONTROLL */        
 /*           AV BEREGNINGEN.                                         */        
 /*           NÅR EN PERSON MED MERKE BLIR LEST UNDER DEN SEKVEN-     */        
 /*           SIELLE LESINGEN SKJER FØLGENDE:                         */        
 /*              - MERKE OM ALLEREDE OMREGNET FJERNES.                */        
 /*              - PERSONEN SKRIVES TILBAKE PÅ BASEN.                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
                                                                                
 R0019H:                                                                        
    PROC             (COMMAREA_PEKER)                                           
             OPTIONS (MAIN);                                                    
                                                                                
                                                                                
   DCL    KOM_OMR_PEKER  POINTER                                   ;            
    %PAGE;                                                                      
    %INCLUDE P0014009;                              /* POTALL_OPPL    */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019906;                              /* TRANS_OPPL_OMR */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019908;                              /* KOM_OMR        */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019910;                              /* STYRINGS_OMR   */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019912;                              /* DIV_PARAM_OMR  */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019014;                              /* FNR TAB/ST.BREV*/        
                                                                                
    %PAGE;                                                                      
       DCL 1 B00              BASED (B00_PEKER),                                
    %INCLUDE P0019921;                              /* B00            */        
                                                                                
    %PAGE;                                                                      
       DCL 1 B01              BASED (B01_PEKER),                                
    %INCLUDE P0019921;                              /* B01            */        
                                                                                
    %PAGE;                                                                      
       DCL 1 B02              BASED (B02_PEKER),                                
    %INCLUDE P0019921;                              /* B02            */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019924;                                                          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019925;                                                          
    %PAGE;                                                                      
    %INCLUDE S0011H ;                              /* MAP : OMREGNING*/         
                                                                                
                                                                                
    /*----------------------------------------------------------------*/        
    /*  DLI. LES/SKRIV-OMR, SSA'ER, DLIUIB-OMR, PCB'ENE               */        
    /*----------------------------------------------------------------*/        
                                                                                
    DCL 1 SEGMENTER,                                                            
                                                                                
           2 ROTSEGM,                                                           
             %INCLUDE P001992G;               /* ROT   _SEGM        */          
           2 STATUSSEGM,                                                        
             %INCLUDE P0019930;               /* STATUS_SEGM        */          
                                                                                
    DCL EN               FIXED BIN  (31) INIT (1),                              
        TO               FIXED BIN  (31) INIT (2),                              
        TRE              FIXED BIN  (31) INIT (3),                              
        FIRE             FIXED BIN  (31) INIT (4),                              
        FEM              FIXED BIN  (31) INIT (5),                              
        SEKS             FIXED BIN  (31) INIT (6);                              
                                                                                
    DCL 1 SSA_ROT_GU,                                                           
           2 SSA_ROT_NAVN      CHAR (11) INIT ('RF0PERSN*D('),                  
           2 FELT1             CHAR ( 8) INIT ('FNR     ')   ,                  
           2 RELOOP1           CHAR ( 2) INIT ('^=')         ,                  
           2 FNR         FIXED DEC  (11) INIT (0)            ,                  
           2 HØYRE_PARENTES    CHAR ( 1) INIT (')')          ;                  
                                                                                
                                                                                
    DCL 1 SSA_ROT,                                                              
           2 SSA_ROT_NAVN      CHAR(11) INIT ('RF0PERSN*D ') ;                  
                                                                                
    DCL 1 SSA_STATUS,                                                           
          2 SSA_STATUS_FELT    CHAR(9)  INIT ('STATUS  (')   ,                  
          2 FELT1              CHAR(8)  INIT ('STATKODE' )   ,                  
          2 RELOOP1            CHAR(2)  INIT (' ='       )   ,                  
          2 SSA_STATUS_KODE    CHAR(1)  INIT ('S'        )   ,                  
          2 CONC               CHAR(1)  INIT ('&'        )   ,                  
          2 FELT2              CHAR(8)  INIT ('STKODHST' )   ,                  
          2 RELOOP2            CHAR(2)  INIT (' ='       )   ,                  
          2 SSA_STATUS_HIST    CHAR(1)  INIT (' '        )   ,                  
          2 HØYRE_PARENTES     CHAR(1)  INIT (')'        )   ;                  
                                                                                
    DCL SSA_UQUAL              CHAR(9)  INIT ('STATUS   ')   ;                  
                                                                                
                                                                                
    /*----------------------------------------------------------------*/        
    /*  DLIUIB    ,   PCB_UIB_PEKER_OMR  ,   PCB'ENE RF1 OG RF4       */        
    /*----------------------------------------------------------------*/        
                                                                                
    %INCLUDE DLIUIB        ;                                                    
                                                                                
    %INCLUDE P0012002      ;                                                    
                                                                                
    DCL 1 RF4                  BASED    (RF4_PCB_PEKER),                        
          %INCLUDE P0012003;                                                    
                                                                                
                                                                                
    /*----------------------------------------------------------------*/        
    /*   OUTPUT - OMR. : TRKLISTE                                     */        
    /*----------------------------------------------------------------*/        
                                                                                
    %INCLUDE P0019H90      ;                                                    
                                                                                
                                                                                
    DCL 1 TRANS,                                                                
           2 TRANSKODE       CHAR(4)    INIT ('AUTO'),                          
           2 FILLER          CHAR(1)    INIT (' '),                             
           2 FNR             PIC'(11)9' INIT ('00000000000'),                   
           2 GRUNNBL_DATO    PIC'9999',                                         
           2 BLANKETTYPE     CHAR(2)    INIT ('  '),                            
           2 TRANSTYPE       CHAR(2)    INIT ('27');                            
                                                                                
                                                                                
    /*----------------------------------------------------------------*/        
    /*   OUTPUT - OMR. : ETTEPMELD                                    */        
    /*----------------------------------------------------------------*/        
                                                                                
    DCL 1 ETTEPMELD,                                                            
           2 FNR             PIC '(11)9',                                       
           2 NAVN            CHAR (25),                                         
           2 SPROG           CHAR (1),                                          
           2 TKNR            PIC '(4)9',                                        
           2 INNTGRENSE      PIC '(7)9';                                        
                                                                                
    DCL 1 ETTEP_BER,                                                            
           2 GP_PR_AAR       FIXED DEC (7),                                     
           2 TP_PR_AAR       FIXED DEC (7),                                     
           2 G_HALVE         FIXED DEC (7);                                     
                                                                                
    DCL INNTGRENSE_BER       FIXED DEC (7);                                     
                                                                                
    /*----------------------------------------------------------------*/        
    /*   OUTPUT - GRUNNPENSJON ENDRES                                 */        
    /*----------------------------------------------------------------*/        
                                                                                
    DCL 1 GP_REC,                                                               
          2  FNR             PIC '(11)9',                                       
          2  TKNR            PIC '9999',                                        
          2  GP_RED_KODE     CHAR (1),                                          
          2  REST            CHAR (6) INIT ('      ');                          
                                                                                
    /*----------------------------------------------------------------*/        
    /* REC BESKRIVELSE FOR OVERFØRING TIL INFO AV FRIINNTEKT TS MAI 05*/        
    /*----------------------------------------------------------------*/        
                                                                                
    DCL 1 FNR_TAK, /* OVERFØRING TIL INFOTRYGD */                               
          10 TKNR                       PIC '(04)9',                            
          10 FNR                        PIC '(11)9',                            
          10 INFOTRANSTYPE              CHAR (01)    INIT ('2'),                
          10 FTRYGD_FOM                 PIC '(06)9',                            
          10 HIGH_VALUES1               CHAR (08),                              
          10 BS20_ART_RTV               CHAR (01),                              
          10 HIGH_VALUES2               CHAR (39),                              
          10 INNT_GRENSE                PIC '(07)9',                            
          10 INNTEKSTKODE1              CHAR (01),                              
          10 HIGH_VALUES3               CHAR (05),                              
          10 INNTEKTSKODE2              CHAR (01),                              
          10 FRIINNT_ÅÅMMDD             PIC '(06)9';                            
                                                                                
    DCL TIL_DATO_ÅMD   FIXED DEC (9) INIT (0);                                  
                                                                                
    DCL FNR_FORRIGE           PIC '(11)9' INIT (0);                             
    DCL FNR_FORRIGE1          PIC '(11)9' INIT (0);                             
    DCL FNR_FORRIGE2          PIC '(11)9' INIT (0);                             
    DCL FNR_FORRIGE_TAK       PIC '(11)9' INIT (0);                             
                                                                                
    DCL FRIINNT_MND           PIC '999999' INIT (0);                            
    DCL FRIINNT_ÅÅÅÅ_MM       PIC '999999' INIT (0);                            
    DCL FRIINNT_ÅR      DEF FRIINNT_ÅÅÅÅ_MM POS (1)   PIC '9999',               
        FRIINNT_MM      DEF FRIINNT_ÅÅÅÅ_MM POS (5)   PIC '99';                 
                                                                                
    /*--HIT TRUDE 0505------------------------------------------------*/        
                                                                                
    /*----------------------------------------------------------------*/        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /*----------------------------------------------------------------*/        
                                                                                
    DCL                                                                         
      ( ADDR , CSTG , LOW , STG ,  SUBSTR ,        VERIFY , SYSPRINT,           
        NULL , UNSPEC , STORAGE )  BUILTIN                          ,           
        PLITDLI                    ENTRY                            ;           
                                                                                
                                                                                
    /*----------------------------------------------------------------*/        
    /*   FORSKJELLIGE HJELPE-OMRÅDER                                  */        
    /*----------------------------------------------------------------*/        
                                                                                
                                                                                
     DCL                                                                        
         UIB_RC_OK                 BIT  (8) INIT ( 0 )             ,            
         COMMAREA_PEKER            POINTER                         ,            
         OMR_FEIL_PEKER            POINTER                         ;            
                                                                                
                                                                                
    DCL WDATO8            PIC '(8)9';                                           
    DCL WDATO6            PIC '(6)9' DEF WDATO8 POS(3);                         
                                                                                
    DCL                                                                         
        MELDING          CHAR      (78)     INIT ((78)' ')         ;            
    DCL                                                                         
      1 FEIL_STRUC,                                                             
        2 FEIL_NR        FIXED DEC ( 5)     INIT (  0    )         ,            
        2 FEIL_MELDING   CHAR      (78)     INIT ((78)' ')         ;            
    DCL                                                                         
      1 FEIL_TAB,                                                               
        2 MELD     (15)  CHAR      (78)                            ,            
                                                                                
        F_IND            FIXED BIN (15)     INIT  (0)              ;            
                                                                                
                                                                                
                                                                                
 /* DCL DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (3) PIC '9999'     ,*/            
                                                                                
    DCL 1 DAGENS_DATO      PIC '(8)9',                                          
        1 DAGENS_DATO_ÅR   DEF  DAGENS_DATO POS (1) PIC '9999',                 
        1 DAGENS_DATO_MND  DEF  DAGENS_DATO POS (5) PIC '99' ,                  
        1 DAGENS_DATO_DAG  DEF  DAGENS_DATO POS (7) PIC '99' ;                  
                                                                                
    DCL W_GET            CHAR (4)         INIT ('    ')            ;            
    DCL 1 WDAGEN ,                                                              
         2 W_DATO_DAG        PIC '99'         ,                                 
         2 W_DATO_MND        PIC '99'         ,                                 
         2 W_DATO_ÅR         PIC '9999'       ,                                 
       1  W_DATO   DEF  WDAGEN PIC '(8)9'   ;                                   
                                                                                
                                                                                
    DCL FNR_PIC          PIC '(11)9'                               ,            
                                                                                
        FNR_DAG          DEF FNR_PIC       POS (1) PIC '99'        ,            
        FNR_MND          DEF FNR_PIC       POS (3) PIC '99'        ,            
        FNR_ÅR           DEF FNR_PIC       POS (5) PIC '99'        ,            
        FNR_INDSIFF      DEF FNR_PIC       POS (7) PIC '999'       ,            
        FNR_KJØNN        DEF FNR_PIC       POS (9) PIC '9'         ,            
                                                                                
        FNR_CHAR         DEF FNR_PIC       POS (1) CHAR (11)       ;            
                                                                                
                                                                                
    DCL INGEN_FEIL             BIT  (1) INIT('1'B),                             
        TRUE                   BIT  (1) INIT('1'B),                             
        FALSE                  BIT  (1) INIT('0'B),                             
        MER_DATA               BIT  (1) INIT('1'B),                             
        W_ANT_OMR_FAM_OPPD     BIT  (1) INIT('0'B),                             
        W_ANT_SPERRET_OPPD     BIT  (1) INIT('0'B),                             
        W_ANT_SPERRER_OPH_OPPD BIT  (1) INIT('0'B),                             
        W_ANT_TIL_TRKLIST_OPPD BIT  (1) INIT('0'B),                             
        W_ANT_TIL_OMRNULL_OPPD BIT  (1) INIT('0'B),                             
        FEIL_INPUT             BIT  (1) INIT('0'B);                             
                                                                                
    DCL KJØRE_SLUTT_TID_CHAR   CHAR (4),                                        
        KJØRE_SLUTT_TIM        PIC '99' DEF KJØRE_SLUTT_TID_CHAR,               
        KJØRE_SLUTT_MIN        PIC '99' DEF KJØRE_SLUTT_TID_CHAR POS(3),        
                                                                                
        KJØRE_SLUTT_TID_DEC    FIXED DEC ( 7);                                  
                                                                                
                                                                                
    DCL W_GRUNNBL_DATO         FIXED DEC ( 7);                                  
                                                                                
    DCL DIFFERANSE         PIC'9999';                                           
    DCL FORRIGE_TID        PIC'999B99B99'  INIT (0);                            
    DCL NÅ_TID             PIC'999B99B99'  INIT (0);                            
    DCL NÅ_TID_MIN         PIC'99'         DEF  NÅ_TID      POS(5);             
    DCL NÅ_TID_TIM         PIC'999'        DEF  NÅ_TID;                         
    DCL FORRIGE_TID_MIN    PIC'99'         DEF  FORRIGE_TID POS(5);             
    DCL FORRIGE_TID_TIM    PIC'999'        DEF  FORRIGE_TID;                    
    DCL START_TID          PIC'99B99B99'  INIT (0);                             
    DCL CURRENT_TID        PIC'9999999'   INIT (0);                             
    DCL SLUTT_TID          PIC'9999999'   INIT (0);                             
    DCL LES_TELLER         PIC'(7)9'       INIT (0);                            
    DCL SPERRE_TELLER      PIC'(7)9'       INIT (0);                            
    DCL BEH_TELLER         PIC'(7)9'       INIT (0);                            
    DCL NEDRE_GR           PIC'(8)9'       INIT (0);                            
    DCL OEVRE_GR           PIC'(8)9'       INIT (0);                            
    DCL OMR_DATO_ÅMD       PIC'(8)9'       INIT (0);                            
    DCL PIC8               PIC'(8)9'       INIT (0);                            
    DCL PIC6_AV8           PIC'(6)9'  DEF  PIC8 POS(1);                         
    DCL PIC4_POS1          PIC'(4)9'  DEF  PIC8 POS(1);                         
    DCL PIC2_POS5          PIC'(2)9'  DEF  PIC8 POS(5);                         
                                                                                
    DCL MAP_CHAR           CHAR(260)  BASED (BMSMAPBR);                         
    DCL MELD_XX            CHAR(48) INIT ((48)' ');                             
    DCL KONTROLL_S         CHAR(1)    INIT  (' ');                              
    DCL BRI_NUM_MDT        CHAR(1)    INIT  ('P');                              
    DCL BRI_PROT_MDT       CHAR(1)    INIT  ('Z');                              
    DCL NOR_NUM_MDT        CHAR(1)    INIT  ('J');                              
    DCL NOR_NUM            CHAR(1)    INIT  ('&');                              
    DCL DATASET            CHAR(8)    INIT  ('        ');                       
    DCL FEIL_RBA           POINTER;                                             
    DCL RBA_PEKER          POINTER;                                             
    DCL LOGG_RBA           POINTER;                                             
    DCL F001_RBA           POINTER;                                             
    DCL F021_RBA           POINTER;                                             
    DCL NULL_RBA           POINTER;                                             
    DCL BMSMAPBR           POINTER;                                             
    DCL ANT_BEH            PIC '(8)Z9'    INIT (0);                             
    DCL ANT_FEIL           PIC '(8)Z9'    INIT (0);                             
    DCL INTERVALL_TELL     PIC '(9)9'     INIT (1);                             
    DCL FIXED_BIN15        FIXED BIN (15);                                      
    DCL W_SØKER_IND        FIXED BIN (15);                                      
    DCL BARN_IND           FIXED BIN (15);                                      
    DCL TILKN_IND          FIXED BIN (15);                                      
    DCL PLASS_I_B02_IND    FIXED BIN (15);                                      
    DCL I                  FIXED BIN (15);                                      
    DCL J                  FIXED DEC ( 3);                                      
    DCL K                  FIXED DEC ( 3);                                      
    DCL G_NÅ               FIXED DEC ( 5)  INIT ( 0 );                          
    DCL G_FØR              FIXED DEC ( 5)  INIT ( 0 );                          
    DCL TEKST              CHAR      (20)  INIT ((20)' ');                      
    DCL GRUNN_OMR1         CHAR      (1440);                                    
    DCL GRUNN_OMR2         CHAR      (1440);                                    
    DCL GRUNN_IDENT        CHAR      ( 8);                                      
   /*                                                                           
    DCL TIDS_PEKER         POINTER                      ,                       
        TIDS_TEST          CHAR (4)   BASED (TIDS_PEKER),                       
        TID_UTE            CHAR (4)                     ;                       
    */                                                                          
                                                                                
    DCL TIDS_PEKER         POINTER  ,                                           
        TIDS_TEST          CHAR (4) ,                                           
        TID_UTE            CHAR (4) ;                                           
                                                                                
    DCL W_FNR              PIC '(11)9';                                         
    DCL W_FNR13            PIC '(13)9';                                         
    DCL W_FNR_ÅM           PIC '(6)9';                                          
    DCL  1 W_FNR_R DEF W_FNR13,                                                 
           2 W_DAG       PIC '99',                                              
           2 W_MND       PIC '99',                                              
           2 W_ÅR        PIC '9999',                                            
           2 W_ÅRHUNDRE  PIC '9',                                               
           2 W_REST      PIC '(4)9';                                            
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    EXEC CICS HANDLE AID PF1(PF1)             ;                                 
 /* EXEC CICS HANDLE AID PF1(PF1) ENTER(ENTER); */                              
 /* EXEC CICS HANDLE CONDITION ERROR   (CICS_ABEND);   */                       
                                                                                
    ON ERROR SNAP                                                               
       BEGIN;                                                                   
          ON ERROR SYSTEM;                                                      
          INGEN_FEIL               =  FALSE                           ;         
          IF FNR_PIC > 0  THEN                                                  
          MELDING                  = 'STOPP P.G.A PLI - ABEND, FNR: '!!         
                      FNR_PIC     !! ' TA HARD-COPY !! TRYKK ENTER !!';         
          ELSE                                                                  
          MELDING                  = 'KONTROLL   DATASET   '!! DATASET          
                                  !! ' TA HARD-COPY !! TRYKK ENTER !!';         
      /*  GOTO L999            ; */                                             
          EXEC CICS RETURN;                                                     
    END;                                                                        
                                                                                
                                                                                
    ALLOCATE POTALL_OPPL                                              ;         
    ALLOCATE PCB_UIB_PEKER_OMR                                        ;         
    ALLOCATE B00 ,B01 ,B02                                            ;         
    ALLOCATE GV_TAB_RE                                                 ;        
    ALLOCATE G_TAB_RE                                                 ;         
                                                                                
    KOM_OMR.STYRINGS_PEKER          = ADDR (KOM_OMR.STYRINGS_OMR   ) ;          
    KOM_OMR.TRANS_OPPL_PEKER        = ADDR (KOM_OMR.TRANS_OPPL_OMR ) ;          
    KOM_OMR.TRANS_PEKER             = ADDR (KOM_OMR.TRANS_OMR      ) ;          
    KOM_OMR.TRANS_LISTE_PEKER       = ADDR (KOM_OMR.TRANS_LISTE_OMR) ;          
    KOM_OMR.DIV_PARAM_PEKER         = ADDR (KOM_OMR.DIV_PARAM_OMR  ) ;          
    KOM_OMR.GV_PEKER                = ADDR (GRUNN_OMR1             ) ;          
    KOM_OMR.G_PEKER                 = ADDR (GRUNN_OMR2             ) ;          
 /* FEIL_STRUC.KOM_OMR_PEKER        = COMMAREA_PEKER ;  */                      
    KOM_OMR_PEKER        = COMMAREA_PEKER                 ;                     
    START_TID                       = EIBTIME                        ;          
    FORRIGE_TID                     = EIBTIME                        ;          
    DAGENS_DATO                     = DATO_2000;  ; /* ÅR MND DAG   */          
    TID_UTE                         = '"@" '      ; /* X'40008000'  */          
    TIDS_TEST                       = '    ';   /* LOW VALUE  */                
                                                                                
    B00                             =  ''  ;                                    
    B01                             =  ''  ;                                    
    B02                             =  ''  ;                                    
    GV_TAB_RE                       =  ''  ;                                    
    G_TAB_RE                        =  ''  ;                                    
    TRANS_LISTE_OMR                 =  ''  ;                                    
    POTALL_OPPL                     =  ''  ;                                    
    SEGMENTER                       =  ''  ;                                    
    FEIL_TAB                        =  ''  ;                                    
    I                               =   1  ;                                    
    INGEN_FEIL                      =  TRUE;                                    
    MER_DATA                        =  TRUE;                                    
                                                                                
                                                                                
    TRANS_OPPL_OMR.TRANSKODE        = 'AUTO'; /* IKKE AUTOBEREGNING  */         
    TRANS_OPPL_OMR.NY_GML_TRANS_IND = ' '   ;                                   
    TRANS_OPPL_OMR.FØDSNUMMER       =  0    ;                                   
    TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD=  99999999 ;                               
    TRANS_OPPL_OMR.BLANKETTYPE      = '  '  ;                                   
    TRANS_OPPL_OMR.TRANSTYPE        =  27   ;                                   
    TRANS_OPPL_OMR.TRANS_RETURKODE  = '    ';                                   
    DIV_PARAM_OMR. FEIL_MELD_NR     =  0    ;                                   
    DIV_PARAM_OMR. KJØRINGS_TYPE    = 'S'   ;                                   
                                                                                
    GRUNN_IDENT                     = 'P0019924';                               
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                              
    GRUNN_IDENT                     = 'P0019925';                               
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                              
                                                                                
    /*------------------------------------------------------------*/            
    /* KOMMER FRA R0010426 FØRSTE GANG VI KOMMER INN .            */            
    /*------------------------------------------------------------*/            
                                                                                
    IF PROGRAM_ID    = 'R0010426' THEN                                          
       DO;                                                                      
          PROGRAM_ID = 'R0019H01';                                              
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND)  ENDFILE(NOTFND);           
          EXEC CICS STARTBR  DATASET('OMRLOGG') RIDFLD(LOGG_RBA) RBA;           
          DATASET = 'OMRLOGG';                                                  
          DO WHILE ('A' = 'A');                                                 
             EXEC CICS READNEXT DATASET('OMRLOGG') RIDFLD(LOGG_RBA) RBA         
                                                   SET(BMSMAPBR);               
          END;                                                                  
                                                                                
          /*--------------------------------------------------------*/          
          /* HENT FRA FILE                                          */          
          /*--------------------------------------------------------*/          
                                                                                
  TILBAKE:                                                                      
                                                                                
          EXEC CICS LOAD   PROGRAM ('S0011H3');                                 
                                                                                
          S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                       
          EXEC CICS SEND   MAP     ('S0011H' ) MAPSET ('S0011H3')               
                                               CURSOR   ERASE     ;             
          EXEC CICS RETURN TRANSID ('RH01'   ) COMMAREA(KOM_OMR)  ;             
                                                                                
  NOTFND:                                                                       
          IF S0011HO .FNRO          =  99999999999 THEN                         
             DO;                                                                
                MAP_CHAR            =  LOW (250);                               
                S0011HO .FNRO       =  0;                                       
                S0011HI .DATO_MÅL   = -1;                                       
                S0011HO .DATO_MÅA   =  BRI_NUM_MDT;                             
                S0011HO .MELDINGO   = 'HER ER ALT I ORDEN FOR OPPSTART'         
                                       !!' FRA BEGYNNELSEN AV BASEN'  ;         
             END;                                                               
                                                                                
          ELSE IF S0011HO .RECORD_TYPEO ^=   'S' THEN                           
             DO;                                                                
                S0011HO .FNRA             =  BRI_NUM_MDT;                       
                S0011HI .FNRI             =  LOW (11)   ;                       
                S0011HI .FNRL             =  -1         ;                       
                S0011HO .STOPP_TIDA       =  BRI_NUM_MDT;                       
                S0011HI .STOPP_TIDI       =  LOW (4)    ;                       
                S0011HI .ANT_Ø_BEHI       =  LOW (8)    ;                       
                S0011HO .ANT_Ø_BEHA       =  BRI_NUM_MDT;                       
                S0011HI .ANT_G_STATI      =  LOW (7)    ;                       
                S0011HI .ANT_OMR_FAMI     =  LOW (7)    ;                       
                S0011HI .ANT_TIL_TRKLISTI = LOW (7)     ;                       
                S0011HI .ANT_TIL_OMRNULLI = LOW (7)     ;                       
                S0011HO .MELDINGO         = 'HER HAR DET VÆRT '    !!           
                                            'UKONTROLLERT AVBRUDD '!!           
                                            'SJEKK START-FNR NØYE'  ;           
             END;                                                               
                                                                                
          ELSE                       /*  S0011HO .RECORD_TYPEO = 'S' */         
             DO;                                                                
                S0011HO .FNRA             =  NOR_NUM_MDT;                       
                S0011HO .STOPP_TIDA       =  BRI_NUM_MDT;                       
                S0011HI .STOPP_TIDI       =  LOW (4)    ;                       
                S0011HI .ANT_Ø_BEHL       =  -1         ;                       
                S0011HI .ANT_Ø_BEHI       =  LOW (8)    ;                       
                S0011HO .ANT_Ø_BEHA       =  BRI_NUM_MDT;                       
                S0011HI .ANT_G_STATI      =  LOW (7)    ;                       
                S0011HI .ANT_OMR_FAMI     =  LOW (7)    ;                       
                S0011HI .ANT_TIL_TRKLISTI = LOW (7)     ;                       
                S0011HI .ANT_TIL_OMRNULLI = LOW (7)     ;                       
                S0011HO .MELDINGO         = 'HER ER ALT I ORDEN '     !!        
                                            'FOR OPPSTART'             ;        
             END;                                                               
                                                                                
                                                                                
          /*--------------------------------------------------------*/          
          /* SKRIVER START-INFO PÅ FEIL-LOGGEN .                    */          
          /*--------------------------------------------------------*/          
                                                                                
          F_IND        =   1                                          ;         
                                                                                
                                                                                
          DAGENS_DATO  =   DATO_2000                                  ;         
          W_DATO_DAG   =   DAGENS_DATO_DAG                            ;         
          W_DATO_MND   =   DAGENS_DATO_MND                            ;         
          W_DATO_ÅR    =   DAGENS_DATO_ÅR                             ;         
                                                                                
                                                                                
          MELDING      =  (78)' '                                     ;         
          CALL P050_SKRIV_OMRFEIL                                     ;         
                                                                                
                                                                                
          MELDING = ' GRUNNBELØPSENDRING  START KL.: ' !! START_TID !!          
                    '   DATO : ' !! W_DATO                            ;         
                                                                                
          FEIL_STRUC.FEIL_MELDING  =   MELDING                        ;         
          FEIL_TAB.MELD  (F_IND)   =   MELDING                        ;         
          CALL P050_SKRIV_OMRFEIL                                     ;         
                                                                                
          F_IND                    =   F_IND        + 1               ;         
          FEIL_STRUC.FEIL_MELDING  =   S0011HO .MELDINGO              ;         
          FEIL_TAB.MELD  (F_IND)   =   S0011HO .MELDINGO              ;         
          CALL P050_SKRIV_OMRFEIL                                     ;         
                                                                                
                                                                                
          GOTO TILBAKE;                                                         
       END;                                                                     
                                                                                
    REC_MAP:                                                                    
    EXEC CICS RECEIVE MAP ('S0011H' ) MAPSET ('S0011H3')                        
                                      SET    (BMSMAPBR);                        
                                                                                
    IF S0011HI .FUNKSJONSKODEL > 0    &                                         
    VERIFY(S0011HI.FUNKSJONSKODEI,'RVEFISAX') = 0 THEN                          
       DO;                                                                      
          STYRINGS_OMR.FUNKSJONSKODE = S0011HI.FUNKSJONSKODEI ;                 
          EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);               
       END;                                                                     
                                                                                
    KJØRE_SLUTT_TID_CHAR   = S0011HI .STOPP_TIDI;                               
                                                                                
    IF ^ F_NUMERISK (S0011HI .DATO_MÅI) THEN                                    
       DO;                                                                      
          S0011HI .DATO_MÅL = -1;                                               
          MELDING           = 'TEGN SOM IKKE ER TALL I DATOFELT';               
       END;                                                                     
                                                                                
    ELSE IF ^ F_GYLDIG_DATO(KONV_MÅ_HÅMD(S0011HO.DATO_MÅO)) THEN                
       DO;                                                                      
          S0011HI .DATO_MÅL = -1;                                               
          MELDING           = 'UGYLDIG DATO';                                   
       END;                                                                     
                                                                                
    ELSE IF ^ F_NUMERISK(S0011HI .FNRI) THEN                                    
       DO;                                                                      
          S0011HI .FNRL = -1;                                                   
          MELDING       ='TEGN SOM IKKE ER TALL I FØDSELSNUMMER - FELT';        
       END;                                                                     
                                                                                
    ELSE IF ^ F_GYLDIG_FNR(S0011HO .FNRO) & S0011HO .FNRO > 0 THEN              
       DO;                                                                      
          S0011HI .FNRL = -1;                                                   
          MELDING       = 'UGYLDIG FØDSELSNUMMER ';                             
       END;                                                                     
                                                                                
    ELSE IF ^ F_NUMERISK(S0011HI .ANT_Ø_BEHI) THEN                              
       DO;                                                                      
          S0011HI .ANT_Ø_BEHL = -1;                                             
          MELDING             = 'TEGN SOM IKKE ER TALL I ANTALL - FELT';        
       END;                                                                     
                                                                                
    ELSE IF  S0011HO .ANT_Ø_BEHO = 1 & S0011HI .FNRI = 0 THEN                   
       DO;                                                                      
          S0011HI .ANT_Ø_BEHL    = -1;                                          
          MELDING ='FEIL KOMBINASJON - KJØRE-ANTALL = 1 OG FNR = 0';            
       END;                                                                     
                                                                                
    ELSE IF                                                                     
         S0011HO.ANT_Ø_BEHO    = 9999             !                             
         S0011HO.ANT_Ø_BEHO    = 99999            !                             
         S0011HO.ANT_Ø_BEHO    = 999999           !                             
         S0011HO.ANT_Ø_BEHO    = 9999999          THEN                          
         DO;                                                                    
            S0011HI.ANT_Ø_BEHL = -1;                                            
            MELDING            = 'ALLE ÅTTE  9  TALLENE MÅ OPPGIS ';            
         END;                                                                   
                                                                                
    ELSE IF ^ F_NUMERISK(S0011HI .STOPP_TIDI) THEN                              
       DO;                                                                      
          S0011HI .STOPP_TIDL = -1;                                             
          MELDING             = 'TEGN SOM IKKE ER TALL I TIDS - FELT';          
       END;                                                                     
                                                                                
    ELSE IF KJØRE_SLUTT_MIN   > 59 THEN                                         
       DO;                                                                      
          S0011HI .STOPP_TIDL = -1;                                             
          MELDING             = 'URIKTIG TIDSANGIVELSE';                        
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          KJØRE_SLUTT_TID_DEC  = S0011HO .STOPP_TIDO * 100;                     
          SLUTT_TID            = KJØRE_SLUTT_TID_DEC   ;                        
          EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC) SET(TIDS_PEKER);          
          EXEC CICS HANDLE CONDITION EXPIRED(EXPIRED);                          
          EXEC CICS POST   TIME (KJØRE_SLUTT_TID_DEC) SET(TIDS_PEKER);          
          LEAVE;                                                                
  EXPIRED:                                                                      
           S0011HI .STOPP_TIDL = -1;                                            
           MELDING             = 'TIDSANGIVELSEN STOPPER TASKEN, '   !!         
                                 'DEN ER MULIGENS FØR NÅ - TIDSPUNKT' ;         
       END;                                                                     
                                                                                
                                                                                
                                                                                
    /*----------------------------------------------------*/                    
    /*HVIS FEIL SENDES UT MELDING OG RETURN TIL CICS      */                    
    /*----------------------------------------------------*/                    
                                                                                
    IF MELDING             ^= (78) ' '  THEN                                    
       CALL P040_MAP_UT_OG_RETUR;                                               
                                                                                
                                                                                
    IF S0011HO.ANT_Ø_BEHO = 11111111 THEN  /*    TEST FOR SISTE FNR */          
       KONTROLL_S  = 'J';                    /* UNDER BEHANDLING    */          
    /*-------------------------------------------------------------*/           
    /* SENDER UT MAP MED BESKJED OM OPPSTART                       */           
    /*-------------------------------------------------------------*/           
                                                                                
    S0011HO .MELDINGO                  =  'BEHANDLINGEN FOREGÅR   ' ;           
    S0011HO .RECORD_TYPEO              =  'O'                       ;           
    S0011HO .DATO_MÅA                  =   BRI_PROT_MDT             ;           
    S0011HO .FNRA                      =   BRI_PROT_MDT             ;           
    S0011HO .ANT_Ø_BEHA                =   BRI_PROT_MDT             ;           
    S0011HO .STOPP_TIDA                =   BRI_PROT_MDT             ;           
    S0011HO .START_TIDO                =   EIBTIME / 100            ;           
    S0011HO .KLOKKE_LOGO               =   EIBTIME / 100            ;           
    WDATO8                             = DATO_2000;                             
    S0011HO .DATO_LOGO                 =   WDATO6                   ;           
                                                                                
    S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                             
                                                                                
    EXEC CICS SEND  MAP    ('S0011H' ) MAPSET('S0011H3') WAIT DATAONLY;         
                                                                                
    DATASET = 'OMRLOGG ';                                                       
    EXEC CICS WRITE DATASET('OMRLOGG') FROM  (MAP_CHAR )                        
                                       RIDFLD(LOGG_RBA ) RBA;                   
                                                                                
                                                                                
                                                                                
    /*----------------------------------------------------*/                    
    /*  INITIERING DATABASEN                              */                    
    /*----------------------------------------------------*/                    
                                                                                
                                                                                
    CALL P030_DATABASE    ('OPEN')                         ;                    
                                                                                
    IF MELDING         ^= (78)' '                       THEN                    
       GOTO L999;                                                               
                                                                                
                                                                                
    /*-------------------------------------------------------*/                 
    /* INITIERER W_GET OG POSISJONERER TIL OPPGITT PERSON    */                 
    /* HVIS FNR > 0                                          */                 
    /*-------------------------------------------------------*/                 
                                                                                
    W_GET                              =   'GHU '             ;                 
                                                                                
    IF S0011HO.FNRO                    >    0           THEN                    
       DO;                                                                      
          SSA_ROT_GU.RELOOP1           =   ' ='               ;                 
          SSA_ROT_GU.FNR               =    S0011HO.FNRO      ;                 
                                                                                
          CALL  P080_LES_ROT_STATUS_SEGM  ('KV_ROT_ST','GHU ');                 
          W_GET                        =   'GHN '             ;                 
       END;                                                                     
                                                                                
    IF DIV_PARAM_OMR.FEIL_MELD_NR      >    0           THEN                    
       GOTO L999;                                                               
                                                                                
    /*-------------------------------------------------------*/                 
    /* LESER 1. PERSON SOM HAR PENSJON.                      */                 
    /*   ):  GHU / GHN PÅ RF0PERSN OG STATUS MED             */                 
    /*       STATUS_KODE = S OG STATUS_KODE_HIST = BLANK     */                 
    /*-------------------------------------------------------*/                 
                                                                                
    SSA_ROT_GU.RELOOP1                 =   '^='               ;                 
                                                                                
    IF S0011HO.ANT_Ø_BEHO              >    1              THEN                 
    /* CALL  P080_LES_ROT_STATUS_SEGM     ('KV_ROT_ST',W_GET) ; */              
       CALL  P080_LES_ROT_STATUS_SEGM     ('ROT_STAT ',W_GET) ;                 
                                                                                
    IF DIV_PARAM_OMR.FEIL_MELD_NR      >    0              THEN                 
       GOTO L999;                                                               
                                                                                
                                                                                
    S0011HO .RECORD_TYPEO              =   'L';                                 
    FNR_PIC                            =    S0011HO.FNRO         ;              
                                                                                
       PIC8               =KONV_MÅ_HÅMD(S0011HO.DATO_MÅO);                      
       NEDRE_GR                        =  0                           ;         
       OEVRE_GR                        =  0                           ;         
                                                                                
       DO I=1 TO 65  UNTIL (NEDRE_GR  <=  PIC6_AV8  &                           
                            OEVRE_GR  >=  PIC6_AV8  );                          
          NEDRE_GR                     =  PERIODE_START_ÅMD (I) / 100 ;         
          OEVRE_GR                     =  PERIODE_SLUTT_ÅMD (I) / 100 ;         
       END;                                                                     
                                                                                
       G_NÅ                            =  G_TAB_PERIODE.GRUNNBELØP(I);          
                                                                                
       G_FØR                      =  G_TAB_PERIODE.GRUNNBELØP(I - 1);           
                                                                                
                                                                                
  /*  ======>    ENTRY POINT                                  */                
                                                                                
    DO ANT_BEH = 1 TO  S0011HO.ANT_Ø_BEHO WHILE (MER_DATA     &                 
                                                  INGEN_FEIL  &                 
                                        TIDS_TEST = LOW (4) );                  
                                                                                
       DIV_PERIODE = '';                                                        
                                                                                
       FNR_PIC                         =   ROTSEGM.FNR                 ;        
       OMR_DATO_ÅMD       =   KONV_MÅ_HÅMD(S0011HO.DATO_MÅO);                   
                                                                                
    /*-------------------------------------------------------*/                 
    /* TESTER UT OM STATISTIKK ER UTE AV OMREGNING           */                 
    /* IF-TEST SKAL IKKE KOMENTERES UT.                      */                 
    /*-------------------------------------------------------*/                 
         /* ENDRET AV SATISH  26.05.2005   FOR TEST  */                         
       IF STATUSSEGM.G_DATO_ÅMD       ^=   OMR_DATO_ÅMD     THEN                
          DO;                                                                   
             W_ANT_OMR_FAM_OPPD        =   FALSE                       ;        
             W_ANT_SPERRET_OPPD        =   FALSE                       ;        
             W_ANT_SPERRER_OPH_OPPD    =   FALSE                       ;        
             W_ANT_TIL_TRKLIST_OPPD    =   FALSE                       ;        
             W_ANT_TIL_OMRNULL_OPPD    =   FALSE                       ;        
                                                                                
             /*----------------------------------------------*/                 
             /* SYNCPOINT OG INIT PÅ BASENE TAS              */                 
             /* HVIS SISTE BEHANDLING VAR FEILFRI .          */                 
             /*----------------------------------------------*/                 
                                                                                
             IF DIV_PARAM_OMR.FEIL_MELD_NR  = 0           THEN                  
                DO;                                                             
                   EXEC CICS SYNCPOINT                       ;                  
                   CALL P030_DATABASE   ('OPEN'   )          ;                  
                                                                                
                   /*----------------------------------------------*/           
                   /* POS. PCB4 TIL SIST BEH. PERSON               */           
                   /*----------------------------------------------*/           
                                                                                
                   SSA_ROT_GU.FNR         =  ROTSEGM.FNR             ;          
                   SSA_ROT_GU.RELOOP1     = ' ='                     ;          
                   CALL P080_LES_ROT_STATUS_SEGM ('KV_ROT_ST','GHU ');          
                                                                                
                END;                                                            
                                                                                
             /*------------------------------------------------------*/         
             /* INITIERING FØR LES AV FAMILIEN. SISTE STATUS         */         
             /*------------------------------------------------------*/         
                                                                                
             S0011HO.ANT_G_STATO     =  S0011HO.ANT_G_STATO + 1 ;               
             DIV_PARAM_OMR.FEIL_MELD_NR   =  0                       ;          
             SØKER_IND                    =  0                       ;          
             FAMILIE_IND                  =  0                       ;          
                                                                                
             /*------------------------------------------------------*/         
             /* PERSONEN MERKET, ER ALLEREDE OMREGNET.MERKET FJERNES */         
             /*------------------------------------------------------*/         
         /*                                                                     
             IF KONTROLL_S          = 'J'      THEN                             
                   CALL P099_FNR_KONTROLL ;                                     
        */                                                                      
     F999:                                                                      
             IF ROTSEGM.SPERRE            = 'J'                    THEN         
                CALL P060_OPPHEV_SPERRE                               ;         
             ELSE                                                               
                DO;                                                             
                   /*------------------------------------------------*/         
                   /* BARNEPENSJONIST YNGSTE BARN                    */         
                   /*------------------------------------------------*/         
                                                                                
                   IF (STATUSSEGM.PENSJONSTYPE1 = 'N' !                         
                       STATUSSEGM.PENSJONSTYPE1 = 'B') &                        
                       STATUSSEGM.PENSJONSTYPE2 = 'P'  THEN                     
                                                                                
                      SØKER_IND = 3;                                            
                   ELSE                                                         
                                                                                
                      /*---------------------------------------------*/         
                      /* PENSJONIST                                  */         
                      /*---------------------------------------------*/         
                                                                                
                      IF (STATUSSEGM.PENSJONSTYPE1 = 'A' !                      
                          STATUSSEGM.PENSJONSTYPE1 = 'E' !                      
                          STATUSSEGM.PENSJONSTYPE1 = 'J' !                      
                          STATUSSEGM.PENSJONSTYPE1 = 'K' !                      
                          STATUSSEGM.PENSJONSTYPE1 = 'Y' !                      
                          STATUSSEGM.PENSJONSTYPE1 = 'U') THEN                  
                         DO;                                                    
                            IF F_KJØNN (FNR_PIC)   = 'K'          THEN          
                               SØKER_IND           =  1              ;          
                            ELSE                                                
                               SØKER_IND           =  2              ;          
                         END;                                                   
                                                                                
                   IF SØKER_IND                        >  0        THEN         
                      DO;                                                       
                         /*-------------------------------------------*/        
                         /* LESER SISTE STATUS FOR EN FAMILIE TIL B01 */        
                         /*   PARAMETRE : FNR OG SØKER_IND,EKTEF_IND  */        
                         /*-------------------------------------------*/        
                                                                                
                         B01                           =  ''           ;        
                         POTALL_OPPL                   =  ''           ;        
                         DIV_PARAM_OMR. ØNSKET_STATUS  =  ' '          ;        
                         TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD=  99999999;           
                         TRANS_OPPL_OMR.FØDSNUMMER     =  ROTSEGM.FNR  ;        
                                                                                
                         EXEC CICS LINK PROGRAM  ('R0013101')                   
                                        COMMAREA (KOM_OMR   )          ;        
                                                                                
                         IF FEIL_MELD_NR      > 0                   THEN        
                            DO;                                                 
                               CALL P010_FEIL_I_BEH   ;                         
                               GOTO BEH_NESTE         ;                         
                            END;                                                
                         ELSE                                                   
                            DIV_PARAM_OMR.PROGRAM_ID    = 'R0019H01'   ;        
                                                                                
                         IF SØKER_IND    = 1         THEN                       
                            EKTEF_IND    = 2            ;                       
                         ELSE                                                   
                            IF SØKER_IND   = 2         THEN                     
                               EKTEF_IND   = 1            ;                     
                                                                                
                         CALL P020_BEREGNING                           ;        
                                                                                
                         IF FEIL_MELD_NR > 0                        THEN        
                            DO;                                                 
                               CALL P010_FEIL_I_BEH                    ;        
                               GOTO BEH_NESTE                          ;        
                            END;                                                
                         ELSE                                                   
                            DO;                                                 
                               DIV_PARAM_OMR.PROGRAM_ID  = 'R0019H01'  ;        
                               W_ANT_OMR_FAM_OPPD        =  TRUE       ;        
                               S0011HO.ANT_OMR_FAMO      =                      
                                            S0011HO.ANT_OMR_FAMO +1;            
                            END;                                                
                                                                                
                        /*BØ9207 - TEST FOR GARANTIER IKKE KOMPLETT -*/         
                        /*  UTVIDET DENNE NÅ, MEN IKKE KJØRT TEST.   */         
                        /*  TATT VEKK TEST PÅ ALDERSP/AFP.           */         
                        /*  PERSONER MED YTELSE (RF-VIRK) > G-DATO   */         
                        /*  MÅ FORTSATT TAS HENSYN TIL. (R0021100??).*/         
                      /*                                                        
                       *IF B02.PERSON(SØKER_IND).STATUS.                        
                       *                 PENSJONSTYPE1 ='A' !                   
                       *   B02.PERSON(SØKER_IND).STATUS.                        
                       *                 PENSJONSTYPE1 ='K' !                   
                       *UT 9706 SVERRE LUNDEBY, DATA-UTVIKLING                  
                       *   IF B02.PENSJONSTYPE1(SØKER_IND)  = 'U' !             
                       *      B02.PENSJONSTYPE1(SØKER_IND)  = 'Y' !             
                       *INN 9706 TEST PÅ ST PGA. SATSENDR.                      
                       *                                                        
                       *IF  B02.PERSON(SØKER_IND).ALDERSP.BT       > 0 !        
                       *    B02.PERSON(SØKER_IND).UFØRPENS.BT      > 0 !        
                       *    B02.PERSON(SØKER_IND).YRKEPENS.BT      > 0 !        
                       *    B02.PERSON(SØKER_IND).FORSI.BT_SÆRBARN > 0 !        
                       *    B02.PERSON(SØKER_IND).ALDERSP.ST   >  0 !           
                       *    B02.PERSON(SØKER_IND).UFØRPENS.ST  >  0 !           
                       *    B02.PERSON(SØKER_IND).ETTEPENS.ST  >  0 !           
                       *    B02.PERSON(SØKER_IND).YRKEPENS.ST  >  0 !           
                       *    B02.PERSON(SØKER_IND).ETTEBARN.ST  >  0 !           
                       *UT  9906 FORSLAG OM BARE G ENDRING                      
                       */                                                       
                                                                                
                        IF (B02.PERSON(SØKER_IND).STATUS.                       
                                         GARANTI_TP       > 0 !                 
                            B02.PERSON(SØKER_IND).STATUS.                       
                                         GT_TILLEGG_LOV92 > 0 !                 
                                                                                
                            B02.PERSON(SØKER_IND).FORSI.                        
                                         GARANTITILLEGG_EK> 0 !                 
                            B02.PERSON(SØKER_IND).FORSI.                        
                                         GARANTITILLEGG_BARN    > 0 !           
                            B02.PERSON(SØKER_IND).FORSI.                        
                                         GARANTITILLEGG_SÆRBARN > 0 ) !         
     /* STOPPET AV SITTIK 14.06.2006                                            
                          ( B02.PERSON(SØKER_IND).STATUS.                       
                                        GP_REDUKSJON_KODE  ^= ' '   &           
                            B02.PERSON(SØKER_IND).STATUS.                       
                                     GP_REDUKSJON_KODE  ^= '.')) !              
     */                                                                         
                           (B01.PERSON(SØKER_IND).STATUS.                       
                                         GARANTI_TP       > 0 !                 
                            B01.PERSON(SØKER_IND).STATUS.                       
                                         GT_TILLEGG_LOV92 > 0 !                 
                                                                                
                            B01.PERSON(SØKER_IND).FORSI.                        
                                         GARANTITILLEGG_EK> 0 !                 
                            B01.PERSON(SØKER_IND).FORSI.                        
                                   GARANTITILLEGG_BARN    > 0 !                 
                            B01.PERSON(SØKER_IND).FORSI.                        
                                   GARANTITILLEGG_SÆRBARN > 0  ) !              
                         ((B02.PERSON(SØKER_IND).STATUS.                        
                               PENSJONSTYPE2  ^= 'S'   ) &                      
                         ((B02.PERSON(SØKER_IND).ALDERSP.ST +                   
                           B02.PERSON(SØKER_IND).UFØRPENS.ST +                  
                           B02.PERSON(SØKER_IND).ETTEPENS.ST +                  
                           B02.PERSON(SØKER_IND).ETTEBARN.ST) > 0 )) !          
                         ((B02.PERSON(SØKER_IND).STATUS.                        
                               PENSJONSTYPE2   = 'S'  )   &                     
                         ((B02.PERSON(SØKER_IND).ALDERSP.ST +                   
                           B02.PERSON(SØKER_IND).UFØRPENS.ST +                  
                           B02.PERSON(SØKER_IND).ETTEPENS.ST +                  
                           B02.PERSON(SØKER_IND).ETTEBARN.ST) > 0 ) &           
                         ((B02.PERSON(EKTEF_IND).ALDERSP.ST +                   
                           B02.PERSON(EKTEF_IND).UFØRPENS.ST +                  
                           B02.PERSON(EKTEF_IND).ETTEPENS.ST) > 0 ))            
                                                                THEN            
                          DO;                                                   
          /*AB 21.12*/      IF B02.PENSJONSTYPE2(SØKER_IND) ^= 'A' THEN         
                              EXEC CICS LINK PROGRAM  ('R0016001')              
                                              COMMAREA ( KOM_OMR  );            
                            IF FEIL_MELD_NR > 0 THEN                            
                                  DO;                                           
                                     CALL P010_FEIL_I_BEH;                      
                                     GOTO BEH_NESTE;                            
                                  END;                                          
                               ELSE                                             
                               PROGRAM_ID =    'R0019H01' ;                     
                            END;                                                
                                                                                
                        /*BØ9207 - SLUTT */                                     
                                                                                
                         /*-------------------------------------------*/        
                         /* REPLACE PÅ RF-DB MED DE NYE BELØPENE      */        
                         /*-------------------------------------------*/        
                         EXEC CICS LINK PROGRAM  ('R0019H50')                   
                                        COMMAREA (KOM_OMR   )          ;        
                         IF FEIL_MELD_NR > 0                        THEN        
                            DO;                                                 
                               CALL P010_FEIL_I_BEH                    ;        
                               GOTO BEH_NESTE                          ;        
                            END;                                                
                         ELSE                                                   
                            DIV_PARAM_OMR.PROGRAM_ID    = 'R0019H01'   ;        
                                                                                
                         /*-------------------------------------------*/        
                         /* STATISTIKK. KALLES IKKE FOM. 01.01.86     */        
                         /*-------------------------------------------*/        
                                                                                
                                                                                
                         CALL P090_LAG_LISTE_TIL_TRYGDEKONTOR;                  
                                                                                
                                                                                
                      END;                   /* IF SØKER_IND > 0     */         
                                                                                
                                                                                
                END;                 /* ELSE TIL IF ROT.SPERRE = JA  */         
                                                                                
                                                                                
             /*-----------------------------------------------------*/          
             /* FAMILIE-BEH. OK . BLANKER FEILMELDINS-TABELLEN      */          
             /*-----------------------------------------------------*/          
                                                                                
             FEIL_TAB                         =   ''                 ;          
                                                                                
          END; /* IF STATUS.G_DATO_ÅM E_HIST ^=   OMR_DATO_ÅM       */          
                                                                                
                                                                                
  BEH_NESTE:                                                                    
                                                                                
       IF INTERVALL_TELL * 10000 <=  ANT_BEH    THEN                            
          DO;                                                                   
      /*   TIDS TEST FOR STOP AV KJØRING  SATISH  25.01.2006     */             
              EXEC CICS ASKTIME;                                                
              CURRENT_TID               = EIBTIME;                              
                                                                                
              IF CURRENT_TID > SLUTT_TID       THEN                             
                 DO;                                                            
                     TIDS_TEST = TID_UTE;                                       
                END;                                                            
      /* ****************************************************  */               
             EXEC CICS ASKTIME;                                                 
             NÅ_TID               = EIBTIME;                                    
             S0011HO .KLOKKE_LOGO = EIBTIME / 100;                              
             WDATO8                             = DATO_2000;                    
             S0011HO .DATO_LOGO       =   WDATO6                   ;            
                                                                                
             DIFFERANSE  = NÅ_TID_TIM * 60 + NÅ_TID_MIN -                       
                           FORRIGE_TID_TIM * 60  - FORRIGE_TID_MIN ;            
                                                                                
             MELDING    = (78) ' ';                                             
             IF  CURRENT_TID > SLUTT_TID      THEN                              
                 DO;                                                            
                  MELDING  =  'KJØRING TID ER GÅTT UT SISTE FNR:'!!             
                                      FNR_PIC             ;                     
                  S0011HO .MELDINGO  = MELDING;                                 
                 END;                                                           
             ELSE                                                               
             S0011HO .MELDINGO    =                                             
                                  'MIN SISTE 10000 ER KJØRT PÅ: '    !!         
                                   DIFFERANSE !! ',ANT:'!! ANT_BEH!!            
                                   ' '        !!   FNR_PIC             ;        
                                                                                
                                                                                
             S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                    
             EXEC CICS SEND  MAP     ('S0011H' ) MAPSET('S0011H3')              
                                                 WAIT    DATAONLY;              
             DATASET = 'OMRLOGG ';                                              
             EXEC CICS WRITE DATASET ('OMRLOGG') FROM  ( MAP_CHAR)              
                             RIDFLD  ( LOGG_RBA) RBA;                           
                                                                                
             S0011HO .ANT_G_STATO      = 0;                                     
             S0011HO .ANT_OMR_FAMO     = 0;                                     
             S0011HO .ANT_TIL_TRKLISTO = 0;                                     
             S0011HO .ANT_TIL_OMRNULLO = 0;                                     
             INTERVALL_TELL            = INTERVALL_TELL + 1;                    
             FORRIGE_TID               = NÅ_TID;                                
          END;                                                                  
                                                                                
                                                                                
       IF MER_DATA  &  INGEN_FEIL                                 THEN          
                                                                                
          IF S0011HO .ANT_Ø_BEHO       > 1                        THEN          
             DO;                                                                
                SSA_ROT_GU.RELOOP1     = '^='                      ;            
              CALL P080_LES_ROT_STATUS_SEGM ('ROT_STAT ','GHN ');               
           /*   CALL P080_LES_ROT_STATUS_SEGM ('N_ROT_STAT','GHN ');*/          
                   W_FNR  =  ROTSEGM.FNR             ;                          
             IF KONTROLL_S          = 'J'      THEN                             
                   CALL P099_FNR_KONTROLL ;                                     
                                                                                
             END;                                                               
          ELSE                                                                  
             IF S0011HO .ANT_Ø_BEHO    = '1'         THEN                       
                MER_DATA               =  FALSE         ;                       
                                                                                
    END;  /* DO WHILE .....                                         */          
                                                                                
    /*---------------------------------------------------------------*/         
    /*   SLUTT PÅ STYREMODUL .  INTERNE PROCEDURER FØLGER .          */         
    /*---------------------------------------------------------------*/         
                                                                                
  L999:                                                                         
                                                                                
    DCL UNORMAL_AVSLUTNING     BIT (1)     INIT ('0'B);                         
                                                                                
    EXEC CICS HANDLE    CONDITION ERROR   (ABEND);                              
                                                                                
    IF ( S0011HO .ANT_Ø_BEHO = ( ANT_BEH - 1 ) !                                
        TIDS_TEST           =  TID_UTE )       &                                
                                                                                
        MELDING             = (78)' '       THEN                                
        DO;                                                                     
                                                                                
           IF TIDS_TEST    =  TID_UTE    THEN                                   
                 MELDING   =                                                    
                           'KJØRING TID ER GÅTT UT SISTE FNR:'!!                
                                      FNR_PIC             ;                     
           ELSE                                                                 
                  MELDING   =  'NORMALT AVSLUTTET PÅ FNR : ' !!                 
                               FNR_PIC !! '    TRYKK ENTER  !! ';               
                                                                                
                  FEIL_TAB.MELD (1)  =  MELDING ;                               
        END;                                                                    
    ELSE                                                                        
      IF ^INGEN_FEIL                                              THEN          
         DO;                                                                    
            /*--------------------------------------------------------*/        
            /* FEIL I BEH. OPPDATERINGENE FJERNES OG TELLERE RESTILLES*/        
            /*--------------------------------------------------------*/        
                                                                                
            EXEC CICS SYNCPOINT ROLLBACK                               ;        
                                                                                
            S0011HO .ANT_G_STATO    =  S0011HO .ANT_G_STATO      - 1;           
                                                                                
            IF W_ANT_OMR_FAM_OPPD                                   THEN        
               S0011HO .ANT_OMR_FAMO = S0011HO .ANT_OMR_FAMO      - 1;          
                                                                                
            IF W_ANT_TIL_TRKLIST_OPPD                               THEN        
             S0011HO .ANT_TIL_TRKLISTO= S0011HO .ANT_TIL_TRKLISTO - 1;          
                                                                                
            IF W_ANT_TIL_OMRNULL_OPPD                               THEN        
             S0011HO .ANT_TIL_OMRNULLO= S0011HO .ANT_TIL_OMRNULLO - 1;          
                                                                                
            UNORMAL_AVSLUTNING         =  TRUE                         ;        
         END;                                                                   
                                                                                
                                                                                
    /*---------------------------------------------------------------*/         
    /* SKRIVER UT FEILMELDINGER FRA TAB. SOM TIDLIGERE ER FJERNET    */         
    /* VED  :     SYNCPOINT  ROLLBACK                                */         
    /*---------------------------------------------------------------*/         
                                                                                
    DO F_IND = 1 TO 15 WHILE    (FEIL_TAB.MELD (F_IND) ^=  (78)' '    );        
                                                                                
       FEIL_STRUC.FEIL_MELDING = FEIL_TAB.MELD (F_IND);                         
       CALL P050_SKRIV_OMRFEIL;                                                 
    END;                                                                        
                                                                                
                                                                                
    EXEC CICS ASKTIME                                                 ;         
    S0011HO .KLOKKE_LOGO     =  EIBTIME / 100                         ;         
    WDATO8                             = DATO_2000;                             
    S0011HO .DATO_LOGO       =   WDATO6                   ;                     
                                                                                
    FEIL_STRUC.FEIL_MELDING  =  FNR_PIC    !! '   ' !!                          
                                S0011HO .KLOKKE_LOGO                  ;         
    CALL P050_SKRIV_OMRFEIL;                                                    
                                                                                
                                                                                
    S0011HO .MELDINGO        =   MELDING;                                       
    FEIL_STRUC.FEIL_MELDING  =   MELDING;                                       
    CALL P050_SKRIV_OMRFEIL;                                                    
                                                                                
    /*------------------------------------------------------------*/            
    /*    TERMINERER PSB'EN                                       */            
    /*    SENDER UT MAP'EN OG SKRIVER PÅ LOGGEN .                 */            
    /*    SIMULERER NY INNGANG FRA R0010426 HVIS ABEND            */            
    /*------------------------------------------------------------*/            
                                                                                
    CALL P030_DATABASE    ('TERM')                                ;             
                                                                                
                                                                                
    S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                             
    EXEC CICS SEND MAP ('S0011H' ) MAPSET ('S0011H3') WAIT                      
                                           DATAONLY;                            
    S0011HO .RECORD_TYPEO    = 'S';                                             
    S0011HO .FNRO            =  FNR_PIC;                                        
                                                                                
    IF ANT_BEH               >  0                               THEN            
       DATASET = 'OMRLOGG ';                                                    
       EXEC CICS WRITE DATASET ('OMRLOGG') FROM     ( MAP_CHAR)                 
                                           RIDFLD   ( LOGG_RBA) RBA;            
                                                                                
    IF UNORMAL_AVSLUTNING     THEN                                              
       DO;                                                                      
          DIV_PARAM_OMR.PROGRAM_ID  = 'R0010426'                   ;            
          EXEC CICS RETURN TRANSID   ('RH01') COMMAREA ( KOM_OMR ) ;            
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          EXEC CICS RECEIVE MAP ('S0011H' ) MAPSET ('S0011H3')                  
                                            SET    (BMSMAPBR);                  
                                                                                
          /*------------------------------------------------------*/            
          /* SKRIVER PAUSEBILDE                                   */            
          /*------------------------------------------------------*/            
                                                                                
    /*    EXEC CICS SEND MAP ('S001012') MAPSET ('S001013')                     
                                         MAPONLY  ERASE   ; */                  
          EXEC CICS RETURN                                         ;            
       END;                                                                     
                                                                                
  CICS_ABEND:                                                                   
    INGEN_FEIL =  FALSE                                            ;            
    EXEC CICS HANDLE CONDITION ERROR   (ABEND);                                 
    MELDING    = 'STOPP P.G.A CICS - ABEND, FNR: ' !!                           
       FNR_PIC  !! ' TA HARD-COPY !! RING PATHAK 95251278  '   ;                
                                                                                
    FEIL_STRUC.FEIL_MELDING  =   MELDING;                                       
    CALL P050_SKRIV_OMRFEIL;                                                    
    MELDING    = 'KONTROLLER DATASET "OMRLOGG" OG "OMRFEIL"      ' ;            
                                                                                
    FEIL_STRUC.FEIL_MELDING  =   MELDING;                                       
    CALL P050_SKRIV_OMRFEIL;                                                    
                                                                                
   S0011HO .MELDINGO = MELDING;                                                 
   EXEC CICS SEND MAP('S0011H') MAPSET('S0011H3') WAIT DATAONLY;                
                                                                                
  ABEND:                                                                        
    EXEC CICS ABEND ABCODE ('FEIL')                                ;            
                                                                                
    EXEC CICS RETURN                                         ;                  
                                                                                
                                                                                
  PF1:                                                                          
                                                                                
     EXEC CICS SEND MAP('S0011H0') MAPSET('S0011H3') MAPONLY ERASE;             
     GOTO REC_MAP;                                                              
     /*                                                                         
  ENTER:                                                                        
                                                                                
     S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                            
     EXEC CICS SEND MAP('S0011H') MAPSET('S0011H3') MAPONLY ERASE;              
     PROGRAM_ID = 'R0010426';                                                   
     GOTO TILBAKE;                                                              
  */                                                                            
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE SOM SLETTER OPPDATERINGER , OG SKRIVER UT FEILMELD.  */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
                                                                                
    P010_FEIL_I_BEH:                                                            
      PROC;                                                                     
                                                                                
                                                                                
        /*------------------------------------------------------------*/        
        /* SLETTER OPPDATERINGER. SJEKKER OM TIDLIGERE SKREVNE FEIL   */        
        /* ER SLETTET (ROLLBACK). TAR VARE PÅ SISTE FEILMELDING .     */        
        /* DUMMY-TELLING AV ANTALL FEIL.                              */        
        /*------------------------------------------------------------*/        
                                                                                
        ANT_FEIL               =     ANT_FEIL    +  1                  ;        
        EXEC CICS SYNCPOINT ROLLBACK                                   ;        
                                                                                
                                                                                
        DO F_IND = 1 TO 15 WHILE    (FEIL_TAB.MELD (F_IND) ^= (78)' ') ;        
                                                                                
           FEIL_STRUC.FEIL_MELDING = FEIL_TAB.MELD (F_IND);                     
           CALL P050_SKRIV_OMRFEIL;                                             
        END;                                                                    
                                                                                
        IF F_IND               >  13           THEN                             
           DO;                                                                  
              INGEN_FEIL       = FALSE;                               ;         
              MELDING          = 'BEH. AV 7 FNR I SEKV. HAR GITT ' !!           
                                 'FEIL. SJEKK FEILEN ! TRYKK ENTER !!';         
              GOTO RETUR;                                                       
           END;                                                                 
                                                                                
                                                                                
        FEIL_STRUC.FEIL_MELDING = 'PROGRAM: '!! DIV_PARAM_OMR.PROGRAM_ID        
              !! ' FEIL VED LABEL: ' !! DIV_PARAM_OMR.FEIL_VED_LABEL  !!        
                 ' DB-STATUSKODE: '  !! DIV_PARAM_OMR.DB_STATUS_KODE  !!        
                 ' HOVEDFNR: '       !! FNR_PIC                        ;        
                                                                                
                                                                                
        FEIL_TAB.MELD (F_IND)    =   FEIL_STRUC.FEIL_MELDING           ;        
        CALL P050_SKRIV_OMRFEIL;                                                
                                                                                
                                                                                
        F_IND                    =   F_IND        + 1                  ;        
   /*   FEIL_STRUC.KOM_OMR_PEKER =   COMMAREA_PEKER  ; */                       
        KOM_OMR_PEKER =   COMMAREA_PEKER                    ;                   
        FEIL_STRUC.FEIL_NR       =   DIV_PARAM_OMR.FEIL_MELD_NR        ;        
        DIV_PARAM_OMR.FEIL_MELD_NR   =  0                       ;               
        CALL P030_DATABASE         ('OPEN')                            ;        
                                                                                
                                                                                
        EXEC CICS  LINK PROGRAM    ('R0019921') COMMAREA(FEIL_STRUC)   ;        
                                                                                
        FEIL_TAB.MELD (F_IND)    =   FEIL_STRUC.FEIL_MELDING           ;        
        CALL P050_SKRIV_OMRFEIL;                                                
                                                                                
                                                                                
        F_IND                    =   F_IND        + 1                  ;        
        FEIL_STRUC.FEIL_MELDING  =   ' '                               ;        
        CALL P050_SKRIV_OMRFEIL                                        ;        
                                                                                
        /*------------------------------------------------------------*/        
        /* POS. PCB4 TIL SIST BEH. PERSON                             */        
        /*------------------------------------------------------------*/        
                                                                                
        SSA_ROT_GU.FNR           =  ROTSEGM.FNR                        ;        
        SSA_ROT_GU.RELOOP1       =  ' ='                               ;        
        CALL P080_LES_ROT_STATUS_SEGM ('KV_ROT_ST','GHU ')             ;        
                                                                                
                                                                                
  RETUR:                                                                        
        IF ^INGEN_FEIL                           THEN                           
            CALL P045_MAP_UT_OG_AVSLUTT                                ;        
                                                                                
 END P010_FEIL_I_BEH;                                                           
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE SOM JUSTERE FORV. INNTEKT,INDEXENE OG KALLER BEREGN  */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P020_BEREGNING:                                                             
       PROCEDURE;                                                               
                                                                                
                                                                                
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD= KONV_MÅ_HÅMD(S0011HO.DATO_MÅO);          
       TRANS_OPPL_OMR.TRANSTYPE        =  27                          ;         
       B02                             =  B01                         ;         
                                                                                
                                                                                
   DO I = 1 TO 2;                         /*9907*/                              
       W_FNR        = B02.FNR(I);                                               
       W_FNR13      = KONV_FNR11_FNR13(W_FNR);                                  
       W_FNR_ÅM     = W_FNR_R.W_ÅR!!W_FNR_R.W_MND;                              
                                                                                
       IF B02.ETTEPENS.FORVENTET(I)  >  0               &                       
          B02.GT_TILLEGG_LOV92(I)    =  0             THEN                      
          B02.ETTEPENS.FORVENTET(I)  =                                          
              B02.ETTEPENS.FORVENTET(I) * G_NÅ / G_FØR ;                        
                                                                                
           /* --------------------------------------------- */                  
           /* VI MÅ RULLERE FORSI-INNTEKTER OG ALDERSP.FAI  */                  
           /* PGA REGELENDRINGER 0591 OG 0192. TRUDE 0492   */                  
           /* --------------------------------------------- */                  
                                                                                
       IF  (W_FNR_ÅM                > 192412  &                                 
           B02.KONV_P_KODE(I) ^= 'K') !                                         
          (B02.KONV_P_KODE(I) = 'K'  &                                          
           B02.UTTAKSDATO_ÅMD(I) > 19920000 ) THEN                              
             DO;                                                                
               IF B02.ALDERSP.FAI(I)  >  0        THEN                          
                  B02.ALDERSP.FAI(I)  =                                         
                      B02.ALDERSP.FAI(I) * G_NÅ / G_FØR ;                       
             END;                                                               
                                                                                
       IF B02.FORSI.ARBEIDSINNTEKT(I) >  0   THEN                               
          B02.FORSI.ARBEIDSINNTEKT(I) =                                         
              B02.FORSI.ARBEIDSINNTEKT(I) * G_NÅ / G_FØR ;                      
                                                                                
       IF B02.FORSI.PENSJONSINNTEKT(I) >  0   THEN                              
          B02.FORSI.PENSJONSINNTEKT(I) =                                        
              B02.FORSI.PENSJONSINNTEKT(I) * G_NÅ / G_FØR ;                     
                                                                                
       IF B02.FORSI.ARBEIDSINNTEKT_EK(I) >  0   THEN                            
          B02.FORSI.ARBEIDSINNTEKT_EK(I) =                                      
              B02.FORSI.ARBEIDSINNTEKT_EK(I) * G_NÅ / G_FØR ;                   
                                                                                
       IF B02.FORSI.PENSJONSINNTEKT_EK(I) >  0   THEN                           
          B02.FORSI.PENSJONSINNTEKT_EK(I) =                                     
              B02.FORSI.PENSJONSINNTEKT_EK(I) * G_NÅ / G_FØR ;                  
                                                                                
           /* TIL HIT REGELENDRINGER 0591 OG 0192. TRUDE 0492   */              
   END;                                                                         
                                                                                
       IF SØKER_IND                    =    3           THEN                    
          DO;                                                                   
             IF B02.FNR (1)            >    0           THEN                    
                FAMILIE_IND            =    1              ;                    
             ELSE                                                               
                IF B02.FNR (2)         >    0           THEN                    
                   FAMILIE_IND         =    2              ;                    
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
             IF SØKER_IND              =    1           THEN                    
                DO;                                                             
                   IF B02.FNR (2)      >    0           THEN                    
                      FAMILIE_IND      =    2              ;                    
                END;                                                            
             ELSE                                                               
                IF B02.FNR (1)         >    0           THEN                    
                   FAMILIE_IND         =    1              ;                    
          END;                                                                  
                                                                                
                                                                                
       /*------------------------------------------------------------*/         
       /* FAMILIEN BLIR OMREGNET EFTER DET NYE GRUNNBELØPET          */         
       /*    PARAMETRE ER :  B01,B02,SØKER_IND,FAMILIE_IND,          */         
       /*                    POENGREKKENE                            */         
       /*------------------------------------------------------------*/         
                                                                                
       EXEC CICS LINK PROGRAM ('R0014001') COMMAREA (KOM_OMR)        ;          
                                                                                
                                                                                
    END  P020_BEREGNING;                                                        
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE SOM FORETAR INITIERINGS OG TERMINERINGS KALL         */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P030_DATABASE:                                                              
      PROC  (STYRING);                                                          
                                                                                
      DCL                                                                       
        STYRING                               CHAR(4),                          
        NULL                                  BUILTIN,                          
        UNSPEC                                BUILTIN;                          
                                                                                
     /* ************************************************************ */         
     /*DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-KALL*/         
     /* ************************************************************ */         
                                                                                
     DCL                                                                        
       W01_PSB_NAVN                CHAR (8)       INIT('        '),             
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),                 
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
                                                                                
     /* ************************************************************ */         
     /* DLI CALL-PARAMETRE                                           */         
     /* ************************************************************ */         
                                                                                
     DCL 1  W01_DLI_PARAM,                                                      
            2   W02_GU             CHAR (4)       INIT('GU  '),                 
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),                      
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3),                      
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT(4);                      
                                                                                
                                                                                
      W01_PSB_NAVN   = DIV_PARAM_OMR.PSB_NAVN;                                  
                                                                                
      IF STYRING = 'OPEN' THEN                                                  
         DO;                                                                    
            CALL   PLITDLI                        (W02_PARM_CT_3,               
                                                   W01_PCB_FUNCTION,            
                                                   W01_PSB_NAVN,                
                                                   UIBPTR);                     
                                                                                
            IF DLIUIB.UIBFCTR                  =  '00000000'B THEN              
               DO;                                                              
                  PCB_UIB_PEKER_OMR.PCB_PEKER  =   UIBPCBAL;                    
                  PCB_UIB_PEKER_OMR.UIB_PEKER  =   UIBPTR;                      
               END;                                                             
            ELSE                                                                
               DO;                                                              
  L100:                                                                         
                  DIV_PARAM_OMR.FEIL_MELD_NR   =    500                ;        
                  DIV_PARAM_OMR.FEIL_VED_LABEL =   '110'               ;        
                  INGEN_FEIL                   =    FALSE              ;        
                  MELDING                      =   'NOE ER GALT '     !!        
                                                   'MED DB PÅ ÅPNINGS'!!        
                                                   'KALLET, KODE: '   !!        
                                                    UNSPEC(UIBFCTR)   !!        
                                                   ' '!!UNSPEC(UIBDLTR);        
                  GOTO P030_END;                                                
               END;                                                             
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
            CALL   PLITDLI                        (W02_PARM_CT_1,               
                                                   W01_TERM_FUNCTION);          
            KOM_OMR.PCB_UIB_PEKER = NULL;                                       
         END;                                                                   
                                                                                
  P030_END:                                                                     
                                                                                
    END P030_DATABASE;                                                          
                                                                                
                                                                                
    /* ************************************************************** */        
    /* PROC. SOM SKRIVER UT BILDE OG RETURNERER TIL CICS MED TRANSID  */        
    /* ************************************************************** */        
                                                                                
                                                                                
    P040_MAP_UT_OG_RETUR:                                                       
      PROC;                                                                     
                                                                                
         S0011HO .MELDINGO      =   MELDING;                                    
                                                                                
         S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                        
         EXEC CICS SEND   MAP     ('S0011H' ) MAPSET   ('S0011H3')              
                                    DATAONLY CURSOR               ;             
         EXEC CICS RETURN TRANSID ('RH01'  ) COMMAREA ( KOM_OMR ) ;             
                                                                                
    END P040_MAP_UT_OG_RETUR;                                                   
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /* PROC. SOM SKRIVER UT BILDE OG AVSLUTTER MED PAUSEBILDET        */        
    /* ************************************************************** */        
                                                                                
                                                                                
    P045_MAP_UT_OG_AVSLUTT:                                                     
      PROC;                                                                     
                                                                                
           FEIL_STRUC.FEIL_MELDING = MELDING ;                                  
           CALL P050_SKRIV_OMRFEIL;                                             
          S0011HO .MELDINGO      =   MELDING;                                   
                                                                                
          S0011HO.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                       
          EXEC CICS SEND    MAP     ('S0011H' ) MAPSET ('S0011H3')              
                                                DATAONLY CURSOR    ;            
                                                                                
          EXEC CICS RECEIVE MAP     ('S0011H' ) MAPSET ('S0011H3')              
                                                SET    (BMSMAPBR)  ;            
                                                                                
          /*------------------------------------------------------*/            
          /* SKRIVER PAUSEBILDE OG RETURNERER TIL CICS            */            
          /*------------------------------------------------------*/            
                                                                                
    /*    EXEC CICS SEND MAP ('S001012') MAPSET ('S001013')                     
                                     MAPONLY  ERASE;  */                        
          EXEC CICS RETURN    ;                                                 
                                                                                
    END P045_MAP_UT_OG_AVSLUTT;                                                 
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /* PROC. SOM SKRIVER FEIL-MELDINGER UT PÅ FEIL-LOGGEN             */        
    /* ************************************************************** */        
                                                                                
                                                                                
    P050_SKRIV_OMRFEIL:                                                         
      PROC;                                                                     
                                                                                
         EXEC CICS HANDLE    CONDITION ERROR   (ABEND);                         
         DATASET = 'OMRFEIL ';                                                  
         EXEC CICS WRITE DATASET  ('OMRFEIL')                                   
              FROM (FEIL_STRUC.FEIL_MELDING )  RIDFLD (FEIL_RBA) RBA;           
                                                                                
    END P050_SKRIV_OMRFEIL;                                                     
                                                                                
                                                                                
                                                                                
                                                                                
   /* *************************************************************** */        
   /* PROCEDURE SOM FJERNER SPERRINGENE                               */        
   /* *************************************************************** */        
                                                                                
                                                                                
   P060_OPPHEV_SPERRE:                                                          
      PROC;                                                                     
                                                                                
      DCL   W080_REPL           CHAR (4)   INIT ('REPL')               ;        
                                                                                
                                                                                
  /*  S0019HO.ANT_SPERRER_OPHO       =  S0019HO.ANT_SPERRER_OPHO + 1;*/         
      ROTSEGM.SPERRE                 =   ' ';                                   
                                                                                
                                                                                
      CALL PLITDLI                         (TRE                      ,          
                                            W080_REPL                ,          
                                            RF4                      ,          
                                            SEGMENTER               );          
                                                                                
                                                                                
                                                                                
      IF DLIUIB.UIBFCTR               ^=   '00000000'B             THEN         
         DO;                                                                    
  L110:                                                                         
            DIV_PARAM_OMR.FEIL_MELD_NR =    500                        ;        
            DIV_PARAM_OMR.FEIL_VED_LABEL=  '110'                       ;        
            INGEN_FEIL                 =    FALSE                      ;        
            MELDING                    =   'UIB-FEIL I P060 I RF-DB. '!!        
                                            UNSPEC (UIBFCTR) !! ' '   !!        
                                            UNSPEC (UIBDLTR)          !!        
                                          ' FNR: ' !! FNR_PIC          ;        
            GOTO P060_END;                                                      
         END;                                                                   
                                                                                
      /*--------------------------------------------------------------*/        
      /* SJEKKER OM  REPLACE GIKK.                                    */        
      /*--------------------------------------------------------------*/        
                                                                                
      IF RF4.STATUS_KODE              ^=   '  '                     THEN        
         DO;                                                                    
  L120:                                                                         
            DIV_PARAM_OMR.FEIL_MELD_NR =    500                        ;        
            DIV_PARAM_OMR.FEIL_VED_LABEL=  '120'                       ;        
            INGEN_FEIL                 =    FALSE                      ;        
            MELDING                    =   'FEIL VED REPL I P060_. '  !!        
                                           'I RF-DB. STATUS-KODE : '  !!        
                                            RF4.STATUS_KODE    !! ' ' !!        
                                           'FNR: ' !! FNR_PIC          ;        
         END;                                                                   
                                                                                
  P060_END:                                                                     
                                                                                
 END P060_OPPHEV_SPERRE;                                                        
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* LESER BARE ROT-SEGM ELLER ROT OG STATUS AVHENGIG AV SSA_IND .  */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
                                                                                
    P080_LES_ROT_STATUS_SEGM:                                                   
      PROC (W080_SSA_IND,W080_GET);                                             
                                                                                
                                                                                
      DCL   W080_SSA_IND        CHAR (9),                                       
            W080_GET            CHAR (4);                                       
                                                                                
      IF W080_SSA_IND                  =   'ROT_STAT ' THEN                     
                                                                                
         /*---------------------------------------------------------*/          
         /* LESER ROT OG SISTE STATUS, IKKE OPPHØRTE PERSONER.      */          
         /*---------------------------------------------------------*/          
                                                                                
         CALL PLITDLI                      (FEM                      ,          
                                            W080_GET                 ,          
                                            RF4                      ,          
                                            SEGMENTER                ,          
                                            SSA_ROT                  ,          
                                            SSA_STATUS              );          
                                                                                
      ELSE                                                                      
         /*---------------------------------------------------------*/          
         /* KVALIFISERER PÅ ROT                                     */          
         /*---------------------------------------------------------*/          
                                                                                
         CALL PLITDLI                      (FEM                      ,          
                                            W080_GET                 ,          
                                            RF4                      ,          
                                            SEGMENTER                ,          
                                            SSA_ROT_GU               ,          
                                            SSA_STATUS              );          
                                                                                
                                                                                
                                                                                
      IF DLIUIB.UIBFCTR               ^=   '00000000'B             THEN         
         DO;                                                                    
  L130:                                                                         
            DIV_PARAM_OMR.FEIL_MELD_NR =    500                        ;        
            DIV_PARAM_OMR.FEIL_VED_LABEL=  '130'                       ;        
            INGEN_FEIL                 =    FALSE                      ;        
            MELDING                    =   'UIB-FEIL I P080_. RF-DB ' !!        
                                           'KODER : '                 !!        
                                            UNSPEC (UIBFCTR) !! ' '   !!        
                                            UNSPEC (UIBDLTR)          !!        
                                          ' FNR: ' !! FNR_PIC          ;        
            GOTO P080_END;                                                      
         END;                                                                   
                                                                                
                                                                                
      SELECT (RF4.STATUS_KODE);                                                 
                                                                                
         WHEN ('  ','GA','GK')                                                  
            DO;                                                                 
               MER_DATA                =    TRUE;                               
            END;                                                                
                                                                                
         WHEN ('GB')                                                            
            DO;                                                                 
               MER_DATA                =    FALSE;                              
               MELDING  = 'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!           
                          'OPPDATERT VED HJELP AV NYE GRUNNBELØP GB';           
               CALL P045_MAP_UT_OG_AVSLUTT;                                     
            END;                                                                
                                                                                
         WHEN ('GE')                                                            
            DO;                                                                 
               IF W080_GET             =   'GHN '   THEN                        
                  DO;                                                           
                     MER_DATA                =    FALSE;                        
                     MELDING =                                                  
                          'DATABASEN HAR NÅ BLITT GJENNOMLEST OG ' !!           
                          'OPPDATERT VED HJELP AV NYE GRUNNBELØP GB';           
                     CALL P045_MAP_UT_OG_AVSLUTT;                               
                  END;                                                          
               ELSE                                                             
               IF W080_GET             =   'GHU '   !                           
           /*     W080_GET             =   'GHN '   ! */                        
                  W080_GET             =   'GU  '                 THEN          
                  DO;                                                           
                     MELDING =                                                  
                        'DETTE FØDSELSNUMMER FINNES IKKE I DATABASEN';          
                     CALL P040_MAP_UT_OG_RETUR;                                 
                  END;                                                          
               ELSE                                                             
                  MELDING = '*******NOE ER FEIL DATABASE *******   ' !!         
                            'STATUS ER =  GE                         ';         
                                                                                
               MER_DATA                =   FALSE;                               
            END;                                                                
                                                                                
         OTHERWISE                                                              
            /*--------------------------------------------------------*/        
            /* FEIL STATUSKODE                                        */        
            /*--------------------------------------------------------*/        
            DO;                                                                 
  L140:                                                                         
               DIV_PARAM_OMR.FEIL_MELD_NR  =   500                     ;        
               DIV_PARAM_OMR.FEIL_VED_LABEL=  '140'                    ;        
               INGEN_FEIL                  =   FALSE                   ;        
               MELDING                     =  'FEIL DLI-STATUSSKODE '!!         
                                               RF4.STATUS_KODE       !!         
                                             ' FRA ' !! W080_GET      ;         
            END;                                                                
                                                                                
      END;  /* SELECT ..                                             */         
                                                                                
                                                                                
  P080_END:                                                                     
                                                                                
 END P080_LES_ROT_STATUS_SEGM;                                                  
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE SOM LAGER LISTE TIL TRYGDEKONTORENE                  */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
                                                                                
    P090_LAG_LISTE_TIL_TRYGDEKONTOR:                                            
      PROC;                                                                     
                                                                                
      IF B02.PENSJONSTYPE1 (3)       = 'N'    !                                 
         B02.PENSJONSTYPE1 (3)       = 'B'                        THEN          
                                                                                
         DO I = 3 TO 14                 WHILE (B02.FNR(I) > 0);                 
                                                                                
            TRKLISTE                 =  '';                                     
            TRKLISTE.FNR             =  B02.FNR           (I);                  
            TRKLISTE.NAVN            =  B02.NAVN          (I);                  
            TRKLISTE.PENSJONSTYPE1   =  B02.PENSJONSTYPE1 (I);                  
            TRKLISTE.PENSJONSTYPE2   =  B02.PENSJONSTYPE2 (I);                  
            TRKLISTE.GP              =  B02.ETTEBARN.GP   (I);                  
            TRKLISTE.TP_AVD          =  B02.ETTEBARN.TP   (I);                  
            TRKLISTE.ST              =  B02.ETTEBARN.ST   (I);                  
       /*   TRKLISTE.TAI             =  0 */                                    
                                                                                
            IF B02.PENSJONSTYPE3 (I) = 'U' THEN                                 
               DO;                                                              
                  TRKLISTE.GP        =  B02.UFØRPENS.GP (I);                    
                  TRKLISTE.TP_EGEN   =  B02.UFØRPENS.TP (I);                    
                  TRKLISTE.ET        =  B02.UFØRPENS.ET (I);                    
                  TRKLISTE.BT        =  B02.UFØRPENS.BT (I);                    
                  TRKLISTE.ST        =  B02.UFØRPENS.ST (I);                    
                  TRKLISTE.ÅFT       =  B02.UFØRPENS.ÅFT(I);                    
                  TRKLISTE.APD_UFG   =  B02.UFØRPENS.UFG(I);                    
               END;                                                             
                                                                                
            TRKLISTE.SUM_YTELSE      =  B02.SUM_YTELSE  (I);                    
            TRKLISTE.TKNR            =  B02.TKNR        (I);                    
            DATASET = 'TRKLIST ';                                               
            EXEC CICS  WRITE DATASET  ('TRKLIST') FROM   (TRKLISTE )            
                                        RBA       RIDFLD (RBA_PEKER)   ;        
                                                                                
          S0011HO.ANT_TIL_TRKLISTO = S0011HO.ANT_TIL_TRKLISTO + 1    ;          
            W_ANT_TIL_TRKLIST_OPPD   =  TRUE                           ;        
         END;                                                                   
      ELSE                                                                      
                                                                                
         DO I = 1 TO 2;                                                         
                                                                                
  /*ENDRING I GRUNNPENSJON FOR EKTEPAR MV*/                                     
  /* TESTER PÅ BLANK OG HEXA NULLER */                                          
  /*FILE TIL INFO OM FRIINNTEKT  TS 0505 */                                     
                                                                                
            IF B02.GP_REDUKSJON_KODE(I) ^= ' '    &                             
               B02.GP_REDUKSJON_KODE(I) ^= ' '       THEN                       
               DO;                                                              
                  GP_REC.FNR         = B02.FNR(I);                              
                  GP_REC.TKNR        = B02.TKNR(I);                             
                  GP_REC.GP_RED_KODE = B02.GP_REDUKSJON_KODE(I);                
            DATASET = 'F0019H02';                                               
            EXEC CICS  WRITE DATASET  ('F0019H02') FROM   (GP_REC )             
                         RIDFLD (F021_RBA )    RBA;                             
               END;                                                             
  /*FILE TIL INFO OM FRIINNTEKT  TS 0505 */                                     
                                                                                
              IF B02.FRIINNTEKT_DATO_ÅMD(I) > 0 &                               
                 B02.STATUS_KODE_HIST(I)  = ' ' &                               
                (B02.PENSJONSTYPE1(I)     =  'U' !                              
                 B02.PENSJONSTYPE1(I)     =  'Y' )  THEN                        
                 DO;                                                            
                    /* ---------------------------------------------- */        
                    /* OPPDATERER DATAFELT SOM SKAL LEGGES UT TIL     */        
                    /* INFOTRYGD SOM BENYTTER DISSE I PE VT           */        
                    /* - FORMATET ER ØNSKET FRA INFOTRYGD             */        
                    /* ---------------------------------------------- */        
                                                                                
                    FNR_TAK.HIGH_VALUES1 =                                      
                       HIGH(LENGTH(HIGH_VALUES1));                              
                    FNR_TAK.HIGH_VALUES2 =                                      
                       HIGH(LENGTH(HIGH_VALUES2));                              
                    FNR_TAK.HIGH_VALUES3 =                                      
                       HIGH(LENGTH(HIGH_VALUES3));                              
                                                                                
                    IF B02.PENSJONSTYPE2(I) = 'E' THEN                          
                       FNR_TAK.BS20_ART_RTV =  'Y';                             
                    ELSE                                                        
                       FNR_TAK.BS20_ART_RTV =  'U';                             
                                                                                
                    FNR_TAK.TKNR =                                              
                       B02.TKNR(I);                                             
                    FNR_TAK.FNR =                                               
                       B02.FNR(I);                                              
                    FNR_TAK.FTRYGD_FOM =                                        
      /*                ((OMR_DATO_ÅMD/100) + 2);        */                     
      /*ETTER ØNSKE FRA MARGA : */                                              
                        ((OMR_DATO_ÅMD/100));                                   
                    FNR_TAK.INNT_GRENSE =                                       
                       B02.LOVLIG_INNTEKT(I);                                   
                    FNR_TAK.INNTEKSTKODE1 =                                     
                       B02.INNTEKTSKODE1(I);                                    
                    FNR_TAK.INNTEKTSKODE2 =                                     
                       B02.INNTEKTSKODE2(I);                                    
                    FNR_TAK.FRIINNT_ÅÅMMDD =                                    
                      KONV_HÅMD_ÅMD(B02.FRIINNTEKT_DATO_ÅMD(I));                
                    IF (FNR_FORRIGE_TAK ^= FNR_TAK.FNR) THEN                    
                       DO;                                                      
                          DATASET = 'FNRTAK';                                   
                          EXEC CICS WRITE DATASET('FNRTAK')                     
                          FROM (FNR_TAK) RIDFLD(FEIL_RBA2) RBA;                 
                          FNR_FORRIGE_TAK = FNR_TAK.FNR;                        
                       END;                                                     
                 END;                                                           
                                                                                
  /*ENGANGSJOBB TIL HIT*/                                                       
                                                                                
            IF (B02.DØDSDATO_ÅMD (I) = 0      &                                 
                B02.FNR          (I) > 0      &                                 
                B02.SUM_YTELSE   (I) > 0      &                                 
              ^(B02.PENSJONSTYPE1(I) = 'F' !                                    
                B02.PENSJONSTYPE2(I) = 'N' !                                    
                B02.PENSJONSTYPE1(I) = 'G')) THEN                               
                                                                                
                /*----------------------------------------------------*/        
                /* FORSØRGET PERSON                                   */        
                /*----------------------------------------------------*/        
                DO;                                                             
                   TRKLISTE               = '';                                 
                   TRKLISTE.FNR           = B02.FNR          (I);               
                   TRKLISTE.NAVN          = B02.NAVN         (I);               
                   TRKLISTE.PENSJONSTYPE1 = B02.PENSJONSTYPE1(I);               
                   TRKLISTE.PENSJONSTYPE2 = B02.PENSJONSTYPE2(I);               
                   TRKLISTE.SUM_YTELSE    = B02.SUM_YTELSE   (I);               
                   TRKLISTE.TKNR          = B02.TKNR         (I);               
                   TRKLISTE.GARANTI_TP    = B02.STATUS.GARANTI_TP(I);           
                                                                                
                                                                                
                SELECT  (B02.PENSJONSTYPE1(I));                                 
                                                                                
                   WHEN ('A','K')                                               
                                                                                
                      /*----------------------------------------------*/        
                      /* ALDERSPENSJON                                */        
                      /*----------------------------------------------*/        
                      DO;                                                       
                         TRKLISTE.GP      = B02.ALDERSP.AP_GP_NETTO(I);         
      /*NETTO 04.92 JD*/ TRKLISTE.TP_EGEN = B02.ALDERSP.AP_TP_NETTO(I);         
                  /*  TRKLISTE.ET      = B02.ALDERSP.ET         (I);*/          
                      TRKLISTE.ET      = B02.ALDERSP.AP_ET_NETTO(I);            
                         TRKLISTE.BT      = B02.ALDERSP.BT         (I);         
                  /*  TRKLISTE.ST      = B02.ALDERSP.ST         (I);*/          
                      TRKLISTE.ST      = B02.ALDERSP.AP_ST_NETTO(I);            
        /*HL TRKLISTE.TAI = DIV_PARAM_OMR.TAI(I) /1000 BORT 0596 TS */          
                         TRKLISTE.APD_UFG = B02.ALDERSP.APD        (I);         
                         TRKLISTE.VT_GP   = B02.ALDERSP.VT_GP      (I);         
                         TRKLISTE.VT_TP   = B02.ALDERSP.VT_TP      (I);         
              /* TRKLISTE.AFP_TILLEGG = B02.AFP_TILLEGG    (I);*/               
                 TRKLISTE.AFP_TILLEGG = B02.AFP_TILLEGG_NETTO    (I);           
                     /*  TRKLISTE.KONV_P_KODE = B02.KONV_P_KODE   */            
                         TRKLISTE.FORVENTET = B02.ALDERSP.FAI     (I);          
                                                                                
                         IF B02.PENSJONSTYPE2 (I) = 'E'            THEN         
                            DO;                                                 
     /*ENDRET FRA TP-BRUTTO TIL TP-NETTO JULI 2001 JD */                        
                               TRKLISTE.TP_AVD =                                
                                              B02.ETTEPENS.TP_NETTO(I);         
                               TRKLISTE.GP_N   =  TRKLISTE.GP;                  
                               TRKLISTE.TP_N   =  TRKLISTE.TP_AVD;              
                            END;                                                
                                                                                
                      END;                                                      
                                                                                
                   WHEN ('U')                                                   
                                                                                
                      /*----------------------------------------------*/        
                      /* UFØREPENSJO                                  */        
                      /*----------------------------------------------*/        
                      DO;                                                       
                         TRKLISTE.GP      = B02.UFØRPENS.GP        (I);         
                         TRKLISTE.TP_EGEN = B02.UFØRPENS.TP        (I);         
                         TRKLISTE.ET      = B02.UFØRPENS.ET        (I);         
                         TRKLISTE.BT      = B02.UFØRPENS.BT        (I);         
                         TRKLISTE.ST      = B02.UFØRPENS.ST        (I);         
                   /*    TRKLISTE.TAI     = 0   */                              
                         TRKLISTE.ÅFT     = B02.UFØRPENS.ÅFT       (I);         
                         TRKLISTE.APD_UFG = B02.UFØRPENS.UFG       (I);         
                                                                                
                         IF B02.PENSJONSTYPE2 (I) = 'E' THEN                    
                            DO;                                                 
                                                                                
                               IF B02.ETTEPENS.GP_BRUTTO (I) > 0   THEN         
                                  DO;                                           
                                     TRKLISTE.GP             =                  
                                             B02.ETTEPENS.GP_BRUTTO (I);        
                                     TRKLISTE.FORVENTET      =                  
                                             B02.ETTEPENS.FORVENTET (I);        
                                     TRKLISTE.GP_N           =                  
                                             B02.ETTEPENS.GP_NETTO  (I);        
                                     TRKLISTE.TP_N           =                  
                                             B02.ETTEPENS.TP_NETTO  (I);        
                                     TRKLISTE.ST             =                  
                                             B02.ETTEPENS.ST        (I);        
                                  END;                                          
                                                                                
                               TRKLISTE.TP_AVD               =                  
                                             B02.ETTEPENS.TP_BRUTTO (I);        
                            END;                                                
                      END;                                                      
                                                                                
                   WHEN ('E','J')                                               
                                                                                
                      /*----------------------------------------------*/        
                      /* ETTERLATTEPENSJON OG ETTERLATTE FAMILIEPLEIER*/        
                      /*----------------------------------------------*/        
                      DO;                                                       
                         TRKLISTE.GP        = B02.ETTEPENS.GP_BRUTTO(I);        
                         TRKLISTE.TP_AVD    = B02.ETTEPENS.TP_BRUTTO(I);        
                         TRKLISTE.FORVENTET = B02.ETTEPENS.FORVENTET(I);        
                         TRKLISTE.GP_N      = B02.ETTEPENS.GP_NETTO (I);        
                         TRKLISTE.TP_N      = B02.ETTEPENS.TP_NETTO (I);        
                         TRKLISTE.ST        = B02.ETTEPENS.ST       (I);        
                /*       TRKLISTE.TAI       = 0;  */                            
                      END;                                                      
                                                                                
                   WHEN ('Y')                                                   
                                                                                
                      /*----------------------------------------------*/        
                      /* YRKEPENSJO                                  */         
                      /*----------------------------------------------*/        
                      DO;                                                       
                         TRKLISTE.GP      = B02.UFØRPENS.GP        (I)          
                                            + B02.YRKEPENS.GP      (I);         
                         TRKLISTE.TP_EGEN = B02.UFØRPENS.TP        (I)          
                                            + B02.YRKEPENS.TP      (I);         
                         TRKLISTE.ET      = B02.UFØRPENS.ET        (I);         
                         TRKLISTE.ST      = B02.UFØRPENS.ST        (I);         
                         TRKLISTE.BT      = B02.UFØRPENS.BT        (I)          
                                            + B02.YRKEPENS.BT      (I);         
           /*            TRKLISTE.TAI     = 0 */                                
                         TRKLISTE.ÅFT     = B02.UFØRPENS.ÅFT       (I);         
                         TRKLISTE.APD_UFG = B02.UFØRPENS.UFG       (I);         
                                                                                
                         IF B02.PENSJONSTYPE2 (I) = 'E' THEN                    
                            DO;                                                 
                                                                                
                               IF B02.ETTEPENS.GP_BRUTTO (I) > 0   THEN         
                                  DO;                                           
                                     TRKLISTE.GP             =                  
                                             B02.ETTEPENS.GP_BRUTTO (I);        
                                     TRKLISTE.FORVENTET      =                  
                                             B02.ETTEPENS.FORVENTET (I);        
                                     TRKLISTE.GP_N           =                  
                                             B02.ETTEPENS.GP_NETTO  (I);        
                                     TRKLISTE.TP_N           =                  
                                             B02.ETTEPENS.TP_NETTO  (I);        
                                     TRKLISTE.ST             =                  
                                             B02.ETTEPENS.ST        (I);        
                                  END;                                          
                                                                                
                               TRKLISTE.TP_AVD               =                  
                                             B02.ETTEPENS.TP_BRUTTO (I);        
                            END;                                                
                      END;                                                      
                                                                                
                                                                                
                   OTHERWISE;                                                   
                      /*----------------------------------------------*/        
                      /* PERSONEN HAR INGEN EGEN YTELSE               */        
                      /*----------------------------------------------*/        
                                                                                
                END;                           /* SELECT ..           */        
                                                                                
 /*TILLEGG 1.5.91 HL : */                                                       
                                                                                
              TRKLISTE.GT_TILLEGG_L92 = B02.GT_TILLEGG_LOV92(I);/*L92*/         
                TRKLISTE.EK_GR   = B02.GARANTITILLEGG_EK  (I);                  
                TRKLISTE.BA_GR   = B02.GARANTITILLEGG_BARN(I);                  
                TRKLISTE.SB_TILL = B02.BT_SÆRBARN(I);                           
                TRKLISTE.SB_GR   = B02.GARANTITILLEGG_SÆRBARN(I);               
                DATASET = 'TRKLIST ';                                           
                EXEC CICS  WRITE DATASET ('TRKLIST') FROM   (TRKLISTE )         
                                           RBA       RIDFLD (RBA_PEKER);        
                                                                                
                S0011HO.ANT_TIL_TRKLISTO = S0011HO.ANT_TIL_TRKLISTO +           
                W_ANT_TIL_TRKLIST_OPPD   = TRUE                        ;        
             END;                                                               
                                                                                
                                                                                
            ELSE                                                                
               IF  (B02.PENSJONSTYPE1(I) = 'E'  &                               
                    B02.SUM_YTELSE   (I) =  0   &                               
                    B02.FNR          (I) >  0   &                               
                    B02.DØDSDATO_ÅMD (I) =  0 )         THEN                    
                                                                                
                  DO;                                                           
                                                                                
                     ETTEPMELD            = '';                                 
                     ETTEPMELD.FNR        = B02.FNR (I);                        
                     ETTEPMELD.NAVN       = B02.NAVN(I);                        
                     ETTEPMELD.TKNR       = B02.TKNR(I);                        
                     ETTEPMELD.SPROG      = B02.SPRÅK(I);                       
                                                                                
                     ETTEP_BER.GP_PR_AAR      =                                 
                                       B02.ETTEPENS.GP_BRUTTO(I) * 12;          
                     ETTEP_BER.TP_PR_AAR      =                                 
                                       B02.ETTEPENS.TP_BRUTTO(I) * 12;          
                                                                                
                     INNTGRENSE_BER = (ETTEP_BER.GP_PR_AAR +                    
                                       ETTEP_BER.TP_PR_AAR) * 2.5 ;             
                                                                                
                     ETTEP_BER.G_HALVE = (G_NÅ / 2);                            
                     INNTGRENSE_BER = INNTGRENSE_BER +                          
                                                    ETTEP_BER.G_HALVE;          
                                                                                
                     ETTEPMELD.INNTGRENSE = INNTGRENSE_BER;                     
                     DATASET = 'OMRNULL ';                                      
                     EXEC CICS WRITE DATASET ('OMRNULL')                        
                                 FROM (ETTEPMELD) RIDFLD (NULL_RBA) RBA;        
                                                                                
                     S0011HO.ANT_TIL_OMRNULLO =                                 
                                 S0011HO.ANT_TIL_OMRNULLO + 1          ;        
                     W_ANT_TIL_OMRNULL_OPPD   = TRUE                   ;        
                                                                                
                  END;                                                          
                                                                                
       END;  /* DO I = 1:2 */                                                   
                                                                                
    END P090_LAG_LISTE_TIL_TRYGDEKONTOR;                                        
   %PAGE;                                                                       
                                                                                
    P099_FNR_KONTROLL : PROC;                                                   
       W_FNR  =  ROTSEGM.FNR             ;                                      
                                                                                
       MELD_XX   = 'SISTE FNR FOR BEHANDLING' !! W_FNR;                         
                                                                                
       EXEC CICS HANDLE CONDITION ERROR   (F999);                               
       DATASET = 'F0019H01';                                                    
       EXEC CICS WRITE DATASET ('F0019H01') FROM( MELD_XX)                      
                  RIDFLD  ( F001_RBA) RBA;                                      
                                                                                
                                                                                
    END P099_FNR_KONTROLL;                                                      
  /*----------------------------------------------------------------*/          
  /*                                                                */          
  /* DENNE KALLES VED NORMAL OG UNORMAL AVSLUTNING PÅ KJØRINGEN .   */          
  /*                                                                */          
  /*----------------------------------------------------------------*/          
                                                                                
                                                                                
                                                                                
                                                                                
  /* ********************************************************** */              
  /* LABLER VED ABEND-SITUASJONER                               */              
  /* ********************************************************** */              
                                                                                
  /* ********************************************************** */              
  /*          E K S T E R N E    P R O C E D U R E R            */              
  /* ********************************************************** */              
                                                                                
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0019901;          /*     F_GYLDIG_DATO       */                      
 %PAGE;                                                                         
 %INCLUDE R0019902;          /*     F_KJØNN             */                      
 %PAGE;                                                                         
 %INCLUDE R0019904;          /*     F_GYLDIG_FNR        */                      
 %PAGE;                                                                         
 %INCLUDE R0019910;          /*     F_NUMERISK          */                      
 %PAGE;                                                                         
 %INCLUDE R0019995;          /*  KONV_FNR11_FNR13       */                      
 %PAGE;                                                                         
 %INCLUDE R0019984;          /*  KONV_MÅ_HÅMD 2000-3    */                      
 %PAGE;                                                                         
 %INCLUDE R0019956;          /*     P9956_BER_G_CICS    */                      
 %PAGE;                                                                         
 %INCLUDE R0019988;          /* KONV_HÅMD_ÅMD           */                      
                                                                                
 END R0019H;                                                                    
