 /*   SIST ENDRET PÅ PROD   2000.07.07 13.01.26 AV   JDA7339          */        
 F_FIX3_GYLDIG:                                                                 
   PROC(P_FIX3 ) RETURNS (BIT(1));                                              
   DCL  RETUR BIT(1) INIT('1'B);                                                
                                                                                
   DCL  P_PTR  POINTER;                                                         
   DCL  BIN_PTR  POINTER;                                                       
                                                                                
   DCL  P_FIX3  FIXED DEC(3,2);                                                 
   DCL  P_FIX3_C    BASED     (P_PTR) CHAR(2);                                  
                                                                                
   DCL  H_FIX3      CHAR(2)   INIT (0);                                         
   DCL  H_FIX3_1   CHAR (1) DEF H_FIX3   POS (2);                               
                                                                                
                                                                                
   DCL  1 BIN_2DEL    BASED (BIN_PTR),                                          
          5 BIN_2_1      BIT (4),                                               
          5 BIN_2_2      BIT (4);                                               
                                                                                
    P_PTR   = ADDR(P_FIX3 );                                                    
    BIN_PTR = ADDR(H_FIX3_1 );                                                  
                                                                                
    H_FIX3    = P_FIX3_C;                                                       
                                                                                
    IF BIN_2_2 ^= '1100'B THEN                                                  
            RETUR = '0'B;                                                       
                                                                                
            RETURN(RETUR);                                                      
 END F_FIX3_GYLDIG;                                                             
