 /*       SIST ENDRET 04/11-91 12.19.22 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 06/09-91 09.05.04 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 26/08-91 14.43.05 AV   DYBVIK                   */00000020
 /*       SIST ENDRET 19/06-91 10.19.00 AV   HERMAN                   */00000030
 /*       SIST ENDRET 14/06-91 09.39.09 AV   DYBVIK                   */00000040
 /*       SIST ENDRET 08/05-91 13.25.37 AV   DYBVIK                   */00000050
 /******************************************************************* */00000060
 /*IDENTIFIKASJON:                                                    */00000070
 /************************                                            */00000080
 /*  PROGRAM-IDENT : R001TK09 - HOVEDPROGRAM.                         */00000090
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000100
 /*  PROGRAMMERER  : TUYEN                                            */00000110
 /*  PROGRAM LAGET : JAN 91                                           */00000120
 /*                                                                   */00000130
 /******************************************************************* */00000140
 /*HENSIKT:                                                           */00000150
 /************                                                        */00000160
 /*  FORESPØRSLER PÅ OPPLYSNINGER VHA TKNR ELLER TKNAVN.              */00000170
 /******************************************************************* */00000180
 /*PROGRAMTILKNYTTING:                                                */00000190
 /**********************                                              */00000200
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE RT09.          */00000210
 /*                                                                   */00000220
 /******************************************************************* */00000230
 /*DATASETTOPPLYSNINGER:                                              */00000240
 /*************************                                           */00000250
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000260
 /*                                                                   */00000270
 /******************************************************************* */00000280
 /*FEILMELDINGER:                                                     */00000290
 /*********************                                               */00000300
 /*                                                                   */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 R001TK9:                                                               00000340
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000350
                                                                        00000360
 %PAGE;                                                                 00000370
      %INCLUDE S001T3;             /* FORESPØRSEL-MAPSETTET   */        00000380
 %PAGE;                                                                 00000390
      %INCLUDE S001T6;             /* KONTI, TLF.-, M.M.-MAPSETTET   */ 00000400
 %PAGE;                                                                 00000410
      %INCLUDE P001TK03;           /* KOM_OMRÅDE (BASED) */             00000420
 %PAGE;                                                                 00000430
      %INCLUDE DFHBMSCA;                                                00000440
 %PAGE;                                                                 00000450
      %INCLUDE DFHAID;                                                  00000460
 %PAGE;                                                                 00000470
                                                                        00000480
 /* PCB-OMRÅDER */                                                      00000490
 /*-------------*/                                                      00000500
                                                                        00000510
   DCL 1 TK_PCB_PEKERE BASED (UIBPCBAL),                                00000520
         2 TK1_PCB_PEKER POINTER,                                       00000530
         2 TK2_PCB_PEKER POINTER,                                       00000540
         2 TK3_PCB_PEKER POINTER;                                       00000550
                                                                        00000560
   DCL 1 TK1 BASED (TK1_PCB_PEKER),                                     00000570
      %INCLUDE P0012003;                                                00000580
                                                                        00000590
   DCL 1 TK2 BASED (TK2_PCB_PEKER),                                     00000600
      %INCLUDE P0012003;                                                00000610
                                                                        00000620
   DCL 1 TK3 BASED (TK3_PCB_PEKER),                                     00000630
      %INCLUDE P0012003;                                                00000640
                                                                        00000650
 %PAGE;                                                                 00000660
                                                                        00000670
 /* SSA */                                                              00000680
 /*-----*/                                                              00000690
                                                                        00000700
   DCL 1 SSA_TK STATIC,                                                 00000710
         5 HDEL     CHAR (17)   INIT ('TK      (TKNR    '),             00000720
         5 REL_OP   CHAR ( 2)   INIT (' ='),                            00000730
         5 KEY      PIC '( 4)9' INIT (0),                               00000740
         5 HP       CHAR ( 1)   INIT (')');                             00000750
                                                                        00000760
   DCL 1 SSA_TK2 STATIC,                                                00000770
         5 HDEL     CHAR (17)   INIT ('TK      (XTKNAVN '),             00000780
         5 REL_OP   CHAR ( 2)   INIT ('=>'),                            00000790
         5 KEY      CHAR (35)   INIT (''),                              00000800
         5 HP       CHAR ( 1)   INIT (')');                             00000810
                                                                        00000820
 /* SEGMENTER */                                                        00000830
 /*-----------*/                                                        00000840
                                                                        00000850
  %INCLUDE P001TK51;               /* TK-SEGMENT    */                  00000860
  %INCLUDE P001TK52;               /* KONTI-SEGMENT    */               00000870
  %INCLUDE P001TK55;               /* TLF-SEGMENT   */                  00000880
  %INCLUDE P001TK56;               /* KOMM-SEGMENT  */                  00000890
  %INCLUDE P001TK57;               /* SATELITT-SEGM.*/                  00000900
  %INCLUDE P001TK53;               /* INNBYGG-SEGM.*/                   00000910
                                                                        00000920
 /* DLI PARAMETRE */                                                    00000930
 /*---------------*/                                                    00000940
                                                                        00000950
   %INCLUDE DLIUIB;                                                     00000960
                                                                        00000970
   DCL PLITDLI           EXTERNAL ENTRY;                                00000980
                                                                        00000990
   DCL GU                CHAR      ( 4) INIT ('GU  '),                  00001000
       GN                CHAR      ( 4) INIT ('GN  '),                  00001010
       GHU               CHAR      ( 4) INIT ('GHU '),                  00001020
       GNP               CHAR      ( 4) INIT ('GNP '),                  00001030
       ISRT              CHAR      ( 4) INIT ('ISRT'),                  00001040
       REPL              CHAR      ( 4) INIT ('REPL'),                  00001050
       TRE               FIXED BIN (31) INIT (3)     ,                  00001060
       FIRE              FIXED BIN (31) INIT (4)     ,                  00001070
       FEM               FIXED BIN (31) INIT (5)     ,                  00001080
       TK_OPEN           CHAR      ( 5) INIT ('OPEN '),                 00001090
       TK_CLOSE          CHAR      ( 5) INIT ('CLOSE'),                 00001100
       SSA_TK_UQUAL      CHAR      ( 9) INIT ('TK       '),             00001110
       SSA_KONTI_UQUAL   CHAR      ( 9) INIT ('KONTI    '),             00001120
       SSA_TLF_UQUAL     CHAR      ( 9) INIT ('TELEFON  '),             00001130
       SSA_KOMM_UQUAL    CHAR      ( 9) INIT ('KOMMUNE  '),             00001140
       SSA_SAT_UQUAL     CHAR      ( 9) INIT ('SATELITT '),             00001150
       SSA_INNB_UQUAL    CHAR      ( 9) INIT ('INNBYGG  ');             00001160
   DCL                                                                  00001170
      (BMSMAPBR,                                                        00001180
      COMMAREA_PEKER) PTR;                                              00001190
   DCL                                                                  00001200
      (CSTG,                                                            00001210
      ADDR,                                                             00001220
      VERIFY,                                                           00001230
      UNSPEC,                                                           00001240
      NULL,                                                             00001250
      LOW,                                                              00001260
      ONCODE,                                                           00001270
      DATE,                                                             00001280
      TRANSLATE,                                                        00001290
      LENGTH,                                                           00001300
      SUBSTR) BUILTIN;                                                  00001310
                                                                        00001320
 /* HJELPE-VARIABLE */                                                  00001330
 /*-----------------*/                                                  00001340
                                                                        00001350
   DCL                                                                  00001360
      ONKODE                      PIC'9999',                            00001370
      I                           PIC '9',                              00001380
      CURSOR_POS                  FIXED BIN(15) INIT(-1),               00001390
      ONK DEF ONKODE              CHAR(4),                              00001400
      FEIL                        FIXED BIN(15) INIT(0),                00001410
      FEILKODE                    CHAR(4),                              00001420
      ANT_FEIL_SKREVET            FIXED DEC (3),                        00001430
      FATAL_FEIL                  BIT (1) INIT ('0'B),                  00001440
      SKRIV_BASE_OK               BIT (1) INIT ('0'B),                  00001450
      SLUTT_BASE                  BIT (1) INIT ('0'B),                  00001460
      SLUTT_NAVN                  BIT (1) INIT ('0'B),                  00001470
      LES_NAVN                    BIT (1) INIT ('0'B),                  00001480
      TK_FINNES                   BIT (1) INIT ('0'B),                  00001490
      KONTI_FINNES                BIT (1) INIT ('0'B),                  00001500
      INNB_FINNES                 BIT (1) INIT ('0'B),                  00001510
      SOK_NAVN                    CHAR (35) INIT (''),                  00001520
      SOK_LENGDE                  FIXED BIN(15) INIT(0),                00001530
      DSNAVN                      CHAR ( 8),                            00001540
      X2                          CHAR (29),                            00001550
      X3                          CHAR (29);                            00001560
                                                                        00001570
   DCL HJ_TLF( 2)     CHAR(13)  ,                                       00001580
       HJ_KOMM(2)     PIC '(4)9',                                       00001590
       HJ_KOMM_TYPE(2) CHAR (2),                                        00001600
       HJ_SAT(10)     PIC '(4)9',                                       00001610
       HJ_SUM_M       PIC '(7)9',                                       00001620
       HJ_SUM_K       PIC '(7)9',                                       00001630
       HJ_MANN_0_9    PIC '(7)9',                                       00001640
       HJ_MANN_10_19  PIC '(7)9',                                       00001650
       HJ_MANN_20_29  PIC '(7)9',                                       00001660
       HJ_MANN_30_39  PIC '(7)9',                                       00001670
       HJ_MANN_40_49  PIC '(7)9',                                       00001680
       HJ_MANN_50_59  PIC '(7)9',                                       00001690
       HJ_MANN_60_69  PIC '(7)9',                                       00001700
       HJ_MANN_70_79  PIC '(7)9',                                       00001710
       HJ_MANN_80_89  PIC '(7)9',                                       00001720
       HJ_MANN_90_99  PIC '(7)9',                                       00001730
       HJ_KV_0_9      PIC '(7)9',                                       00001740
       HJ_KV_10_19    PIC '(7)9',                                       00001750
       HJ_KV_20_29    PIC '(7)9',                                       00001760
       HJ_KV_30_39    PIC '(7)9',                                       00001770
       HJ_KV_40_49    PIC '(7)9',                                       00001780
       HJ_KV_50_59    PIC '(7)9',                                       00001790
       HJ_KV_60_69    PIC '(7)9',                                       00001800
       HJ_KV_70_79    PIC '(7)9',                                       00001810
       HJ_KV_80_89    PIC '(7)9',                                       00001820
       HJ_KV_90_99    PIC '(7)9',                                       00001830
       HJ_TOTAL       PIC '(7)9';                                       00001840
                                                                        00001850
   DCL 1 FEIL_STRUC,                                                    00001860
         5 FEIL_NR      FIXED DEC ( 5),                                 00001870
         5 FEIL_MELDING      CHAR (78),                                 00001880
         5 KOM_OMR_PEKER  POINTER;                                      00001890
 %PAGE;                                                                 00001900
                                                                        00001910
 /* SLUTT PÅ DEKLARASJONER */                                           00001920
 /**************************/                                           00001930
                                                                        00001940
 ON ERROR SNAP BEGIN       ;                                            00001950
    ON ERROR SYSTEM        ;                                            00001960
    ONKODE=ONCODE          ;                                            00001970
    FEILKODE = 'FEIL'      ;                                            00001980
    DSNAVN   = EIBDS       ;                                            00001990
    GO TO FEILBEH          ;                                            00002000
 END;                                                                   00002010
                                                                        00002020
 FEILKODE        = 'FEIL'   ;                                           00002030
 DSNAVN          = '       ';                                           00002040
 PROGRAM_ID      = 'R001TK09';                                          00002050
                                                                        00002060
 X2 = 'ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ';                                  00002070
 X3 = 'abcdefghijklmnopqrstuvwxyzæøå';                                  00002080
                                                                        00002090
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00002100
 EXEC CICS IGNORE CONDITION MAPFAIL       ;                             00002110
                                                                        00002120
 FUNKSJONSKODE = ' ';                                                   00002130
 STYREKODE     = ' ';                                                   00002140
                                                                        00002150
 CALL TK_DATABASE(TK_OPEN);                                             00002160
                                                                        00002170
 IF SEND_MAP THEN                                                       00002180
    DO;                                                                 00002190
       SEND_MAP = '0'B;                                                 00002200
                                                                        00002210
       ALLOCATE S001019O;                                               00002220
       S001019I.TKNRL = CURSOR_POS;                                     00002230
       EXEC CICS SEND MAP('S001019')                                    00002240
                MAPSET('S001T33') ERASE CURSOR;                         00002250
    END;                                                                00002260
                                                                        00002270
 EXEC CICS RECEIVE MAP('S001019')                                       00002280
                MAPSET('S001T33') SET(BMSMAPBR) ASIS;                   00002290
                                                                        00002300
 IF S001019I.FUNKSJONSKODEL > 0 THEN                                    00002310
     FUNKSJONSKODE = S001019I.FUNKSJONSKODEI;                           00002320
 ELSE                                                                   00002330
     IF S001019I.STYREKODEL > 0 THEN                                    00002340
         STYREKODE = S001019I.STYREKODEI;                               00002350
                                                                        00002360
 DO WHILE ((FUNKSJONSKODE = ' ') &                                      00002370
           (STYREKODE = ' '));                                          00002380
                                                                        00002390
   IF S001019I.TKNRL > 0 THEN                                           00002400
     DO;                                                                00002410
        SSA_TK.KEY = S001019I.TKNRI;                                    00002420
                                                                        00002430
        CALL LES_DB_TKNR;                                               00002440
                                                                        00002450
        IF TK_FINNES THEN                                               00002460
          DO;                                                           00002470
             TK_FINNES = '0'B;                                          00002480
                                                                        00002490
             CALL VIS_OPPLYSNINGER;                                     00002500
          END;                                                          00002510
                                                                        00002520
        ELSE                                                            00002530
          DO;                                                           00002540
             S001019O.MELDING1O = 'DENNE TK FINNES IKKE I BASEN!';      00002550
             S001019I.TKNRL     = CURSOR_POS;                           00002560
          END;                                                          00002570
     END;                                                               00002580
                                                                        00002590
   ELSE                                                                 00002600
     IF S001019I.TKNAVNL > 0 THEN                                       00002610
        DO;                                                             00002620
           LES_NAVN    = '1'B;                                          00002630
           SOK_NAVN    = TRANSLATE(S001019I.TKNAVNI,X2,X3);             00002640
           SOK_LENGDE  = S001019I.TKNAVNL;                              00002650
                                                                        00002660
           SSA_TK2.KEY = SOK_NAVN;                                      00002670
           CALL LES_DB_NAVN;                                            00002680
                                                                        00002690
           IF TK_FINNES THEN                                            00002700
              DO;                                                       00002710
                 DO WHILE (TK_FINNES);                                  00002720
                    CALL VIS_OPPLYSNINGER;                              00002730
                                                                        00002740
                    SSA_TK2.KEY = SOK_NAVN;                             00002750
                    CALL LES_DB_NAVN_NESTE;                             00002760
                 END; /* WHILE TK_FINNES */                             00002770
                                                                        00002780
                 SLUTT_NAVN = '1'B;                                     00002790
              END;                                                      00002800
                                                                        00002810
           ELSE                                                         00002820
              DO;                                                       00002830
                 S001019I.TKNAVNL   = CURSOR_POS;                       00002840
                 S001019O.MELDING1O = 'INGEN TK MED SLIK NAVN FINNES!'; 00002850
              END;                                                      00002860
                                                                        00002870
           LES_NAVN = '0'B;                                             00002880
        END;                                                            00002890
                                                                        00002900
     ELSE                                                               00002910
        DO;                                                             00002920
           CALL LES_DB_FØRSTE;                                          00002930
                                                                        00002940
           DO WHILE (^SLUTT_BASE);                                      00002950
              CALL VIS_OPPLYSNINGER;                                    00002960
                                                                        00002970
              CALL LES_DB_NESTE;                                        00002980
           END; /* WHILE ^SLUTT_BASE */                                 00002990
        END;                                                            00003000
                                                                        00003010
   IF SLUTT_BASE THEN                                                   00003020
      S001019O.MELDING1O = 'SLUTT PÅ BASEN!';                           00003030
   ELSE                                                                 00003040
      IF SLUTT_NAVN THEN                                                00003050
         DO;                                                            00003060
            S001019O.MELDING1O = 'INGEN FLERE MED DETTE NAVNET!';       00003070
            SLUTT_NAVN = '0'B;                                          00003080
         END;                                                           00003090
                                                                        00003100
   S001019I.TKNRL = CURSOR_POS;                                         00003110
                                                                        00003120
   EXEC CICS SEND MAP('S001019') MAPSET('S001T33') ERASE CURSOR;        00003130
   EXEC CICS RECEIVE MAP('S001019') MAPSET('S001T33')                   00003140
                  SET(BMSMAPBR) ASIS;                                   00003150
                                                                        00003160
   IF S001019I.FUNKSJONSKODEL > 0 THEN                                  00003170
       FUNKSJONSKODE = S001019I.FUNKSJONSKODEI;                         00003180
   ELSE                                                                 00003190
       IF S001019I.STYREKODEL > 0 THEN                                  00003200
          STYREKODE = S001019I.STYREKODEI;                              00003210
                                                                        00003220
 END; /* WHILE */                                                       00003230
                                                                        00003240
 CALL TK_DATABASE(TK_CLOSE);                                            00003250
                                                                        00003260
 IF FUNKSJONSKODE ^= ' ' THEN                                           00003270
    IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                           00003280
      DO;                                                               00003290
         PROGRAM_ID = 'R001TK04';                                       00003300
         TRANSKODE = 'RT04';                                            00003310
      END;                                                              00003320
                                                                        00003330
    ELSE                                                                00003340
      IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                         00003350
         DO;                                                            00003360
            TRANSKODE = 'RT08';                                         00003370
            PROGRAM_ID = 'R001TK08';                                    00003380
         END;                                                           00003390
                                                                        00003400
      ELSE                                                              00003410
         IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                      00003420
            DO;                                                         00003430
               PROGRAM_ID = 'R001TK09';                                 00003440
               TRANSKODE = 'RT09';                                      00003450
            END;                                                        00003460
                                                                        00003470
         ELSE                                                           00003480
            IF (VERIFY(FUNKSJONSKODE, 'Uu') = 0) THEN                   00003490
               DO;                                                      00003500
                  PROGRAM_ID = 'R001TK70';                              00003510
                  TRANSKODE = 'RT70';                                   00003520
               END;                                                     00003530
                                                                        00003540
            ELSE                                                        00003550
               DO;                                                      00003560
                  PROGRAM_ID = 'R001TK03';                              00003570
                  TRANSKODE = 'RT03';                                   00003580
               END;                                                     00003590
                                                                        00003600
 ELSE                                                                   00003610
   IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                                00003620
      DO;                                                               00003630
         IF SUBSTR(FUNKSJON,3,1) = '' THEN                              00003640
            DO;                                                         00003650
                PROGRAM_ID = 'R001TK04';                                00003660
                TRANSKODE = 'RT04';                                     00003670
            END;                                                        00003680
         ELSE                                                           00003690
            DO;                                                         00003700
               PROGRAM_ID = 'R001TK07';                                 00003710
               TRANSKODE = 'RT07';                                      00003720
            END;                                                        00003730
      END;                                                              00003740
                                                                        00003750
   ELSE                                                                 00003760
      IF (VERIFY(STYREKODE, 'Mm') = 0) THEN                             00003770
         DO;                                                            00003780
            IF SUBSTR(FUNKSJON,3,1) = '' THEN                           00003790
               DO;                                                      00003800
                   PROGRAM_ID = 'R001TK04';                             00003810
                   TRANSKODE = 'RT04';                                  00003820
               END;                                                     00003830
            ELSE                                                        00003840
               DO;                                                      00003850
                  PROGRAM_ID = 'R001TK80';                              00003860
                  TRANSKODE = 'RT80';                                   00003870
               END;                                                     00003880
         END;                                                           00003890
                                                                        00003900
      ELSE                                                              00003910
         IF (VERIFY(STYREKODE, 'Kk') = 0) THEN                          00003920
            DO;                                                         00003930
               IF SUBSTR(FUNKSJON,6,1) = '' THEN                        00003940
                  DO;                                                   00003950
                      PROGRAM_ID = 'R001TK04';                          00003960
                      TRANSKODE = 'RT04';                               00003970
                  END;                                                  00003980
               ELSE                                                     00003990
                  DO;                                                   00004000
                     PROGRAM_ID = 'R001TK06';                           00004010
                     TRANSKODE = 'RT06';                                00004020
                  END;                                                  00004030
            END;                                                        00004040
         ELSE                                                           00004050
            IF (VERIFY(STYREKODE, 'Ss') = 0) THEN                       00004060
               DO;                                                      00004070
                  IF SUBSTR(FUNKSJON,1,1) ^= '' &                       00004080
                     SUBSTR(FUNKSJON,2,1) ^= '' &                       00004090
                     SUBSTR(FUNKSJON,3,1) ^= '' &                       00004100
                     SUBSTR(FUNKSJON,4,1) ^= ''   THEN                  00004110
                     DO;                                                00004120
                         PROGRAM_ID = 'R001TK60';                       00004130
                         TRANSKODE = 'RT60';                            00004140
                     END;                                               00004150
                  ELSE                                                  00004160
                     DO;                                                00004170
                        PROGRAM_ID = 'R001TK03';                        00004180
                        TRANSKODE = 'RT03';                             00004190
                     END;                                               00004200
               END;                                                     00004210
            ELSE                                                        00004220
               IF (VERIFY(STYREKODE, 'Dd') = 0) THEN                    00004230
                  DO;                                                   00004240
                     IF SUBSTR(FUNKSJON,1,1) ^= '' &                    00004250
                        SUBSTR(FUNKSJON,2,1) ^= '' &                    00004260
                        SUBSTR(FUNKSJON,3,1) ^= '' &                    00004270
                        SUBSTR(FUNKSJON,4,1) ^= ''   THEN               00004280
                        DO;                                             00004290
                            PROGRAM_ID = 'R001TK61';                    00004300
                            TRANSKODE = 'RT61';                         00004310
                        END;                                            00004320
                     ELSE                                               00004330
                        DO;                                             00004340
                           PROGRAM_ID = 'R001TK03';                     00004350
                           TRANSKODE = 'RT03';                          00004360
                        END;                                            00004370
                  END;                                                  00004380
               ELSE                                                     00004390
                  IF (VERIFY(STYREKODE, 'Ff') = 0) THEN                 00004400
                     DO;                                                00004410
                        PROGRAM_ID = 'R001TK62';                        00004420
                        TRANSKODE = 'RT62';                             00004430
                     END;                                               00004440
                  ELSE                                                  00004450
                     DO;                                                00004460
                        PROGRAM_ID = 'R001TK03';                        00004470
                        TRANSKODE = 'RT03';                             00004480
                     END;                                               00004490
                                                                        00004500
 SEND_MAP      = '1'B;                                                  00004510
 STYREKODE     = ' ';                                                   00004520
 FUNKSJONSKODE = ' ';                                                   00004530
                                                                        00004540
                                                                        00004550
 EXEC CICS XCTL PROGRAM(PROGRAM_ID) COMMAREA(KOM_OMR);                  00004560
                                                                        00004570
 /* INTERNE PROSEDYRER */                                               00004580
 /**********************/                                               00004590
                                                                        00004600
 OVERFØR_SKJ_TK: PROC;                                                  00004610
                                                                        00004620
     S001020O.TKNRO            = TK.TKNR;                               00004630
     S001020O.TKNAVNO          = TK.TKNAVN;                             00004640
     S001020O.BESØKADRO        = TK.BESØKADR;                           00004650
                                                                        00004660
     IF TK.BPOSTNR > 0 THEN                                             00004670
        S001020O.BPOSTNRO         = TK.BPOSTNR;                         00004680
     ELSE                                                               00004690
        S001020O.BPOSTNRO         = LOW(4);                             00004700
                                                                        00004710
     S001020O.BPOSTNAVNO       = TK.BPOSTNAVN;                          00004720
     S001020O.POSTADRO         = TK.POSTADR;                            00004730
     S001020O.PPOSTNRO         = TK.PPOSTNR;                            00004740
     S001020O.PPOSTNAVNO       = TK.PPOSTNAVN;                          00004750
     S001020O.TELEFAXO         = TK.TELEFAX;                            00004760
     S001020O.TKSJEFO          = TK.TKSJEF;                             00004770
     S001020O.SJEFTLFO         = TK.SJEFTLF;                            00004780
     S001020O.SORTKRITERIUMO   = TK.SORTKRITERIUM;                      00004790
     S001020O.DATASENTRALO     = TK.DATASENTRAL;                        00004800
                                                                        00004810
     IF TK.DATASENTRALNR > 0 THEN                                       00004820
        S001020O.DATASENTRALNRO   = TK.DATASENTRALNR;                   00004830
     ELSE                                                               00004840
        S001020O.DATASENTRALNRO   = LOW(3);                             00004850
                                                                        00004860
     S001020O.EDBSYSTEMO       = TK.EDBSYSTEM;                          00004870
                                                                        00004880
     IF TK.ARBEIDSKONTOR > 0 THEN                                       00004890
        S001020O.ARBEIDSKONTORO   = TK.ARBEIDSKONTOR;                   00004900
     ELSE                                                               00004910
        S001020O.ARBEIDSKONTORO   = LOW(4);                             00004920
                                                                        00004930
     IF TK.ARBEIDSGIVER > 0 THEN                                        00004940
        S001020O.ARBEIDSGIVERO    = TK.ARBEIDSGIVER;                    00004950
     ELSE                                                               00004960
        S001020O.ARBEIDSGIVERO    = LOW(8);                             00004970
                                                                        00004980
     S001020O.MÅLFORMO         = TK.MÅLFORM;                            00004990
     S001020O.ANT_BREVO        = TK.ANT_BREV;                           00005000
                                                                        00005010
     S001020O.ANT_STILLINGO    = TK.ANT_STILLING;                       00005020
                                                                        00005030
     IF TK.LOKALMASKINNR > 0 THEN                                       00005040
        S001020O.LOKALMASKINNRO   = TK.LOKALMASKINNR;                   00005050
     ELSE                                                               00005060
        S001020O.LOKALMASKINNRO   = LOW(3);                             00005070
                                                                        00005080
     IF TK.ABONNEMENTNR > 0 THEN                                        00005090
        S001020O.ABONNEMENTNRO    = TK.ABONNEMENTNR;                    00005100
     ELSE                                                               00005110
        S001020O.ABONNEMENTNRO    = LOW(10);                            00005120
                                                                        00005130
     S001020O.SAMBANDO         = TK.SAMBAND;                            00005140
                                                                        00005150
     IF TK.HASTIGHET > 0 THEN                                           00005160
        S001020O.HASTIGHETO       = TK.HASTIGHET;                       00005170
     ELSE                                                               00005180
        S001020O.HASTIGHETO       = LOW(5);                             00005190
                                                                        00005200
     S001020O.REGNSKAPANSVAR1O = TK.REGNSKAPSANSVAR1;                   00005210
     S001020O.REGNSKAPANSVAR2O = TK.REGNSKAPSANSVAR2;                   00005220
                                                                        00005230
     IF TK.ÅRHUSLEIEREG > 0 THEN                                        00005240
        S001020O.ÅRHUSLEIEREGO    = TK.ÅRHUSLEIEREG;                    00005250
     ELSE                                                               00005260
        S001020O.ÅRHUSLEIEREGO    = LOW(4);                             00005270
                                                                        00005280
     S001020O.MRKFYLKEO        = TK.MRKFYLKE;                           00005290
     S001020O.MRKREVISJONO     = TK.MRKREVISJON;                        00005300
                                                                        00005310
     IF TK.REV_DISTRIKT > 0 THEN                                        00005320
        S001020O.REV_DISTRIKTO    = TK.REV_DISTRIKT;                    00005330
     ELSE                                                               00005340
        S001020O.REV_DISTRIKTO    = LOW(4);                             00005350
                                                                        00005360
     IF TK.FYLKESKONTOR > 0 THEN                                        00005370
        S001020O.FYLKESKONTORO    = TK.FYLKESKONTOR;                    00005380
     ELSE                                                               00005390
        S001020O.FYLKESKONTORO    = LOW(2);                             00005400
                                                                        00005410
                                                                        00005420
  END OVERFØR_SKJ_TK;                                                   00005430
                                                                        00005440
                                                                        00005450
 OVERFØR_SKJ_KONTI: PROC;                                               00005460
                                                                        00005470
     IF KONTI.POST_KONTO > 0 THEN                                       00005480
       S001022O.POST_KONTOO           = KONTI.POST_KONTO;               00005490
     ELSE                                                               00005500
       S001022O.POST_KONTOO           = LOW(11);                        00005510
                                                                        00005520
     IF KONTI.POST_KUNDENR > 0 THEN                                     00005530
       S001022O.POST_KUNDENRO         = KONTI.POST_KUNDENR;             00005540
     ELSE                                                               00005550
       S001022O.POST_KUNDENRO         = LOW(9);                         00005560
                                                                        00005570
     S001022O.PKONTO_ENDRETO        = KONTI.PKONTO_ENDRET;              00005580
                                                                        00005590
     IF KONTI.INTERIM_KONTO > 0 THEN                                    00005600
       S001022O.INTERIM_KONTOO        = KONTI.INTERIM_KONTO;            00005610
     ELSE                                                               00005620
       S001022O.INTERIM_KONTOO        = LOW(11);                        00005630
                                                                        00005640
     IF KONTI.INTERIM_AVTALEID > 0 THEN                                 00005650
       S001022O.INTERIM_AVTIDO        = KONTI.INTERIM_AVTALEID;         00005660
     ELSE                                                               00005670
       S001022O.INTERIM_AVTIDO        = LOW(9);                         00005680
                                                                        00005690
     S001022O.INTERIM_ENDRETO       = KONTI.INTERIM_ENDRET;             00005700
                                                                        00005710
     IF KONTI.DRIFTSKONTO > 0 THEN                                      00005720
       S001022O.DRIFTSKONTOO          = KONTI.DRIFTSKONTO;              00005730
     ELSE                                                               00005740
       S001022O.DRIFTSKONTOO          = LOW(11);                        00005750
                                                                        00005760
     IF KONTI.DKONTO_AVTALEID > 0 THEN                                  00005770
       S001022O.DRIFT_AVTALEIDO       = KONTI.DKONTO_AVTALEID;          00005780
     ELSE                                                               00005790
       S001022O.DRIFT_AVTALEIDO       = LOW(9);                         00005800
                                                                        00005810
     S001022O.DKONTO_ENDRETO        = KONTI.DKONTO_ENDRET;              00005820
                                                                        00005830
 END OVERFØR_SKJ_KONTI;                                                 00005840
                                                                        00005850
                                                                        00005860
 OVERFØR_SKJ_INNB: PROC;                                                00005870
                                                                        00005880
     S001022O.DATOO            = INNBYGG.INNBYGG_DATO;                  00005890
                                                                        00005900
     HJ_MANN_0_9   = INNBYGG.MANN_0 + INNBYGG.MANN_1 + INNBYGG.MANN_2 + 00005910
                     INNBYGG.MANN_3 + INNBYGG.MANN_4 + INNBYGG.MANN_5 + 00005920
                     INNBYGG.MANN_6 + INNBYGG.MANN_7 + INNBYGG.MANN_8 + 00005930
                     INNBYGG.MANN_9;                                    00005940
                                                                        00005950
     S001022O.M09O             = HJ_MANN_0_9;                           00005960
                                                                        00005970
     HJ_MANN_10_19 = INNBYGG.MANN_10 +INNBYGG.MANN_11 +INNBYGG.MANN_12+ 00005980
                     INNBYGG.MANN_13 +INNBYGG.MANN_14 +INNBYGG.MANN_15+ 00005990
                     INNBYGG.MANN_16 +INNBYGG.MANN_17 +INNBYGG.MANN_18+ 00006000
                     INNBYGG.MANN_19;                                   00006010
                                                                        00006020
     S001022O.M1019O           = HJ_MANN_10_19;                         00006030
                                                                        00006040
     HJ_MANN_20_29 = INNBYGG.MANN_20 +INNBYGG.MANN_21 +INNBYGG.MANN_22+ 00006050
                     INNBYGG.MANN_23 +INNBYGG.MANN_24 +INNBYGG.MANN_25+ 00006060
                     INNBYGG.MANN_26 +INNBYGG.MANN_27 +INNBYGG.MANN_28+ 00006070
                     INNBYGG.MANN_29;                                   00006080
                                                                        00006090
     S001022O.M2029O           = HJ_MANN_20_29;                         00006100
                                                                        00006110
     HJ_MANN_30_39 = INNBYGG.MANN_30 +INNBYGG.MANN_31 +INNBYGG.MANN_32+ 00006120
                     INNBYGG.MANN_33 +INNBYGG.MANN_34 +INNBYGG.MANN_35+ 00006130
                     INNBYGG.MANN_36 +INNBYGG.MANN_37 +INNBYGG.MANN_38+ 00006140
                     INNBYGG.MANN_39;                                   00006150
                                                                        00006160
     S001022O.M3039O           = HJ_MANN_30_39;                         00006170
                                                                        00006180
     HJ_MANN_40_49 = INNBYGG.MANN_40 +INNBYGG.MANN_41 +INNBYGG.MANN_42+ 00006190
                     INNBYGG.MANN_43 +INNBYGG.MANN_44 +INNBYGG.MANN_45+ 00006200
                     INNBYGG.MANN_46 +INNBYGG.MANN_47 +INNBYGG.MANN_48+ 00006210
                     INNBYGG.MANN_49;                                   00006220
                                                                        00006230
     S001022O.M4049O           = HJ_MANN_40_49;                         00006240
                                                                        00006250
     HJ_MANN_50_59 = INNBYGG.MANN_50 +INNBYGG.MANN_51 +INNBYGG.MANN_52+ 00006260
                     INNBYGG.MANN_53 +INNBYGG.MANN_54 +INNBYGG.MANN_55+ 00006270
                     INNBYGG.MANN_56 +INNBYGG.MANN_57 +INNBYGG.MANN_58+ 00006280
                     INNBYGG.MANN_59;                                   00006290
                                                                        00006300
     S001022O.M5059O           = HJ_MANN_50_59;                         00006310
                                                                        00006320
     HJ_MANN_60_69 = INNBYGG.MANN_60 +INNBYGG.MANN_61 +INNBYGG.MANN_62+ 00006330
                     INNBYGG.MANN_63 +INNBYGG.MANN_64 +INNBYGG.MANN_65+ 00006340
                     INNBYGG.MANN_66 +INNBYGG.MANN_67 +INNBYGG.MANN_68+ 00006350
                     INNBYGG.MANN_69;                                   00006360
                                                                        00006370
     S001022O.M6069O           = HJ_MANN_60_69;                         00006380
                                                                        00006390
     HJ_MANN_70_79 = INNBYGG.MANN_70 +INNBYGG.MANN_71 +INNBYGG.MANN_72+ 00006400
                     INNBYGG.MANN_73 +INNBYGG.MANN_74 +INNBYGG.MANN_75+ 00006410
                     INNBYGG.MANN_76 +INNBYGG.MANN_77 +INNBYGG.MANN_78+ 00006420
                     INNBYGG.MANN_79;                                   00006430
                                                                        00006440
     S001022O.M7079O           = HJ_MANN_70_79;                         00006450
                                                                        00006460
     HJ_MANN_80_89 = INNBYGG.MANN_80 +INNBYGG.MANN_81 +INNBYGG.MANN_82+ 00006470
                     INNBYGG.MANN_83 +INNBYGG.MANN_84 +INNBYGG.MANN_85+ 00006480
                     INNBYGG.MANN_86 +INNBYGG.MANN_87 +INNBYGG.MANN_88+ 00006490
                     INNBYGG.MANN_89;                                   00006500
                                                                        00006510
     S001022O.M8089O           = HJ_MANN_80_89;                         00006520
                                                                        00006530
     HJ_MANN_90_99 = INNBYGG.MANN_90 +INNBYGG.MANN_91 +INNBYGG.MANN_92+ 00006540
                     INNBYGG.MANN_93 +INNBYGG.MANN_94 +INNBYGG.MANN_95+ 00006550
                     INNBYGG.MANN_96 +INNBYGG.MANN_97 +INNBYGG.MANN_98+ 00006560
                     INNBYGG.MANN_99;                                   00006570
                                                                        00006580
     S001022O.M9099O           = HJ_MANN_90_99;                         00006590
                                                                        00006600
     S001022O.M100O            = INNBYGG.MANN_100;                      00006610
                                                                        00006620
     HJ_SUM_M                  = (HJ_MANN_0_9 +                         00006630
                                HJ_MANN_10_19 +                         00006640
                                HJ_MANN_20_29 +                         00006650
                                HJ_MANN_30_39 +                         00006660
                                HJ_MANN_40_49 +                         00006670
                                HJ_MANN_50_59 +                         00006680
                                HJ_MANN_60_69 +                         00006690
                                HJ_MANN_70_79 +                         00006700
                                HJ_MANN_80_89 +                         00006710
                                HJ_MANN_90_99 +                         00006720
                                INNBYGG.MANN_100);                      00006730
                                                                        00006740
     S001022O.SUM_MO           = HJ_SUM_M;                              00006750
                                                                        00006760
     HJ_KV_0_9   = INNBYGG.KVINNE_0  +INNBYGG.KVINNE_1 +INNBYGG.KVINNE_200006770
                 + INNBYGG.KVINNE_3  +INNBYGG.KVINNE_4 +INNBYGG.KVINNE_500006780
                 + INNBYGG.KVINNE_6  +INNBYGG.KVINNE_7 +INNBYGG.KVINNE_800006790
                 + INNBYGG.KVINNE_9;                                    00006800
                                                                        00006810
     S001022O.K09O             = HJ_KV_0_9;                             00006820
                                                                        00006830
     HJ_KV_10_19 = INNBYGG.KVINNE_10+INNBYGG.KVINNE_11+INNBYGG.KVINNE_1200006840
                 + INNBYGG.KVINNE_13+INNBYGG.KVINNE_14+INNBYGG.KVINNE_1500006850
                 + INNBYGG.KVINNE_16+INNBYGG.KVINNE_17+INNBYGG.KVINNE_1800006860
                 + INNBYGG.KVINNE_19;                                   00006870
                                                                        00006880
     S001022O.K1019O           = HJ_KV_10_19;                           00006890
                                                                        00006900
     HJ_KV_20_29 = INNBYGG.KVINNE_20+INNBYGG.KVINNE_21+INNBYGG.KVINNE_2200006910
                 + INNBYGG.KVINNE_23+INNBYGG.KVINNE_24+INNBYGG.KVINNE_2500006920
                 + INNBYGG.KVINNE_26+INNBYGG.KVINNE_27+INNBYGG.KVINNE_2800006930
                 + INNBYGG.KVINNE_29;                                   00006940
                                                                        00006950
     S001022O.K2029O           = HJ_KV_20_29;                           00006960
                                                                        00006970
     HJ_KV_30_39 = INNBYGG.KVINNE_30+INNBYGG.KVINNE_31+INNBYGG.KVINNE_3200006980
                 + INNBYGG.KVINNE_33+INNBYGG.KVINNE_34+INNBYGG.KVINNE_3500006990
                 + INNBYGG.KVINNE_36+INNBYGG.KVINNE_37+INNBYGG.KVINNE_3800007000
                 + INNBYGG.KVINNE_39;                                   00007010
                                                                        00007020
     S001022O.K3039O           = HJ_KV_30_39;                           00007030
                                                                        00007040
     HJ_KV_40_49 = INNBYGG.KVINNE_40+INNBYGG.KVINNE_41+INNBYGG.KVINNE_4200007050
                 + INNBYGG.KVINNE_43+INNBYGG.KVINNE_44+INNBYGG.KVINNE_4500007060
                 + INNBYGG.KVINNE_46+INNBYGG.KVINNE_47+INNBYGG.KVINNE_4800007070
                 + INNBYGG.KVINNE_49;                                   00007080
                                                                        00007090
     S001022O.K4049O           = HJ_KV_40_49;                           00007100
                                                                        00007110
     HJ_KV_50_59 = INNBYGG.KVINNE_50+INNBYGG.KVINNE_51+INNBYGG.KVINNE_5200007120
                 + INNBYGG.KVINNE_53+INNBYGG.KVINNE_54+INNBYGG.KVINNE_5500007130
                 + INNBYGG.KVINNE_56+INNBYGG.KVINNE_57+INNBYGG.KVINNE_5800007140
                 + INNBYGG.KVINNE_59;                                   00007150
                                                                        00007160
     S001022O.K5059O           = HJ_KV_50_59;                           00007170
                                                                        00007180
     HJ_KV_60_69 = INNBYGG.KVINNE_60+INNBYGG.KVINNE_61+INNBYGG.KVINNE_6200007190
                 + INNBYGG.KVINNE_63+INNBYGG.KVINNE_64+INNBYGG.KVINNE_6500007200
                 + INNBYGG.KVINNE_66+INNBYGG.KVINNE_67+INNBYGG.KVINNE_6800007210
                 + INNBYGG.KVINNE_69;                                   00007220
                                                                        00007230
     S001022O.K6069O           = HJ_KV_60_69;                           00007240
                                                                        00007250
     HJ_KV_70_79 = INNBYGG.KVINNE_70+INNBYGG.KVINNE_71+INNBYGG.KVINNE_7200007260
                 + INNBYGG.KVINNE_73+INNBYGG.KVINNE_74+INNBYGG.KVINNE_7500007270
                 + INNBYGG.KVINNE_76+INNBYGG.KVINNE_77+INNBYGG.KVINNE_7800007280
                 + INNBYGG.KVINNE_79;                                   00007290
                                                                        00007300
     S001022O.K7079O           = HJ_KV_70_79;                           00007310
                                                                        00007320
     HJ_KV_80_89 = INNBYGG.KVINNE_80+INNBYGG.KVINNE_81+INNBYGG.KVINNE_8200007330
                 + INNBYGG.KVINNE_83+INNBYGG.KVINNE_84+INNBYGG.KVINNE_8500007340
                 + INNBYGG.KVINNE_86+INNBYGG.KVINNE_87+INNBYGG.KVINNE_8800007350
                 + INNBYGG.KVINNE_89;                                   00007360
                                                                        00007370
     S001022O.K8089O           = HJ_KV_80_89;                           00007380
                                                                        00007390
     HJ_KV_90_99 = INNBYGG.KVINNE_90+INNBYGG.KVINNE_91+INNBYGG.KVINNE_9200007400
                 + INNBYGG.KVINNE_93+INNBYGG.KVINNE_94+INNBYGG.KVINNE_9500007410
                 + INNBYGG.KVINNE_96+INNBYGG.KVINNE_97+INNBYGG.KVINNE_9800007420
                 + INNBYGG.KVINNE_99;                                   00007430
                                                                        00007440
     S001022O.K9099O           = HJ_KV_90_99;                           00007450
                                                                        00007460
     S001022O.K100O            = INNBYGG.KVINNE_100;                    00007470
                                                                        00007480
     HJ_SUM_K                  = (HJ_KV_0_9 +                           00007490
                                HJ_KV_10_19 +                           00007500
                                HJ_KV_20_29 +                           00007510
                                HJ_KV_30_39 +                           00007520
                                HJ_KV_40_49 +                           00007530
                                HJ_KV_50_59 +                           00007540
                                HJ_KV_60_69 +                           00007550
                                HJ_KV_70_79 +                           00007560
                                HJ_KV_80_89 +                           00007570
                                HJ_KV_90_99 +                           00007580
                                INNBYGG.KVINNE_100);                    00007590
                                                                        00007600
     S001022O.SUM_KO           = HJ_SUM_K;                              00007610
                                                                        00007620
     HJ_TOTAL                  = (HJ_MANN_0_9        +                  00007630
                                  HJ_MANN_10_19 +                       00007640
                                  HJ_MANN_20_29 +                       00007650
                                  HJ_MANN_30_39 +                       00007660
                                  HJ_MANN_40_49 +                       00007670
                                  HJ_MANN_50_59 +                       00007680
                                  HJ_MANN_60_69 +                       00007690
                                  HJ_MANN_70_79 +                       00007700
                                  HJ_MANN_80_89 +                       00007710
                                  HJ_MANN_90_99 +                       00007720
                                  INNBYGG.MANN_100   +                  00007730
                                  HJ_KV_0_9          +                  00007740
                                  HJ_KV_10_19 +                         00007750
                                  HJ_KV_20_29 +                         00007760
                                  HJ_KV_30_39 +                         00007770
                                  HJ_KV_40_49 +                         00007780
                                  HJ_KV_50_59 +                         00007790
                                  HJ_KV_60_69 +                         00007800
                                  HJ_KV_70_79 +                         00007810
                                  HJ_KV_80_89 +                         00007820
                                  HJ_KV_90_99 +                         00007830
                                  INNBYGG.KVINNE_100);                  00007840
                                                                        00007850
     S001022O.TOTALO           = HJ_TOTAL;                              00007860
                                                                        00007870
 END OVERFØR_SKJ_INNB;                                                  00007880
                                                                        00007890
                                                                        00007900
 OVERFØR_SKJ_TLF: PROC;                                                 00007910
                                                                        00007920
     S001020O.TLF1O    = HJ_TLF(1);                                     00007930
     S001020O.TLF2O    = HJ_TLF(2);                                     00007940
                                                                        00007950
 END OVERFØR_SKJ_TLF;                                                   00007960
                                                                        00007970
                                                                        00007980
 OVERFØR_SKJ_KOMM: PROC;                                                00007990
                                                                        00008000
     IF HJ_KOMM(1) > 0 THEN                                             00008010
        S001020O.KOMM1O   = HJ_KOMM(1);                                 00008020
     ELSE                                                               00008030
        S001020O.KOMM1O   = LOW(4);                                     00008040
                                                                        00008050
     IF HJ_KOMM(2) > 0 THEN                                             00008060
        S001020O.KOMM2O   = HJ_KOMM(2);                                 00008070
     ELSE                                                               00008080
        S001020O.KOMM2O   = LOW(4);                                     00008090
                                                                        00008100
     S001020O.KOMM1_TYPEO = HJ_KOMM_TYPE(1);                            00008110
     S001020O.KOMM2_TYPEO = HJ_KOMM_TYPE(2);                            00008120
                                                                        00008130
 END OVERFØR_SKJ_KOMM;                                                  00008140
                                                                        00008150
                                                                        00008160
 OVERFØR_SKJ_SAT: PROC;                                                 00008170
                                                                        00008180
     IF HJ_SAT(1) > 0 THEN                                              00008190
        S001020O.SAT1O  = HJ_SAT(1);                                    00008200
     ELSE                                                               00008210
        S001020O.SAT1O  = LOW(4);                                       00008220
                                                                        00008230
     IF HJ_SAT(2) > 0 THEN                                              00008240
        S001020O.SAT2O = HJ_SAT(2);                                     00008250
     ELSE                                                               00008260
        S001020O.SAT2O  = LOW(4);                                       00008270
                                                                        00008280
     IF HJ_SAT(3) > 0 THEN                                              00008290
        S001020O.SAT3O  = HJ_SAT(3);                                    00008300
     ELSE                                                               00008310
        S001020O.SAT3O  = LOW(4);                                       00008320
                                                                        00008330
     IF HJ_SAT(4) > 0 THEN                                              00008340
        S001020O.SAT4O  = HJ_SAT(4);                                    00008350
     ELSE                                                               00008360
        S001020O.SAT4O  = LOW(4);                                       00008370
                                                                        00008380
     IF HJ_SAT(5) > 0 THEN                                              00008390
        S001020O.SAT5O  = HJ_SAT(5);                                    00008400
     ELSE                                                               00008410
        S001020O.SAT5O  = LOW(4);                                       00008420
                                                                        00008430
     IF HJ_SAT(6) > 0 THEN                                              00008440
        S001020O.SAT6O  = HJ_SAT(6);                                    00008450
     ELSE                                                               00008460
        S001020O.SAT6O  = LOW(4);                                       00008470
                                                                        00008480
     IF HJ_SAT(7) > 0 THEN                                              00008490
        S001020O.SAT7O  = HJ_SAT(7);                                    00008500
     ELSE                                                               00008510
        S001020O.SAT7O  = LOW(4);                                       00008520
                                                                        00008530
     IF HJ_SAT(8) > 0 THEN                                              00008540
        S001020O.SAT8O  = HJ_SAT(8);                                    00008550
     ELSE                                                               00008560
        S001020O.SAT8O  = LOW(4);                                       00008570
                                                                        00008580
     IF HJ_SAT(9) > 0 THEN                                              00008590
        S001020O.SAT9O  = HJ_SAT(9);                                    00008600
     ELSE                                                               00008610
        S001020O.SAT9O  = LOW(4);                                       00008620
                                                                        00008630
     IF HJ_SAT(10) > 0 THEN                                             00008640
        S001020O.SAT10O  = HJ_SAT(10);                                  00008650
     ELSE                                                               00008660
        S001020O.SAT10O  = LOW(4);                                      00008670
                                                                        00008680
 END OVERFØR_SKJ_SAT;                                                   00008690
                                                                        00008700
                                                                        00008710
 VIS_OPPLYSNINGER: PROC;                                                00008720
                                                                        00008730
     ALLOCATE S001020O;                                                 00008740
     S001020O.MELDING1O =                                               00008750
        'FOR Å SE KONTI- OG INNBYGGOPPLYSNINGER TRYKK ENTER';           00008760
                                                                        00008770
     CALL OVERFØR_SKJ_TK;                                               00008780
                                                                        00008790
     SSA_TK.KEY = TK.TKNR;                                              00008800
     CALL LES_DB_TKNR;                                                  00008810
                                                                        00008820
     I               = 1;                                               00008830
     TLF             = '';                                              00008840
     HJ_TLF          = '';                                              00008850
                                                                        00008860
     CALL PLITDLI       (FIRE              ,                            00008870
                         GNP               ,                            00008880
                         TK1               ,                            00008890
                         TLF               ,                            00008900
                         SSA_TLF_UQUAL)  ;                              00008910
                                                                        00008920
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00008930
       DO;                                                              00008940
 L810:                                                                  00008950
          FEIL_MELD_NR    =  500;                                       00008960
          FEIL_VED_LABEL  = '810';                                      00008970
          FATAL_FEIL      = '1'B;                                       00008980
          CALL SKRIV_FEILMELDING;                                       00008990
          EXEC CICS ABEND ABCODE(FEIL);                                 00009000
       END;                                                             00009010
                                                                        00009020
     IF TK1.STATUS_KODE ^= 'GE' THEN                                    00009030
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00009040
           DO;                                                          00009050
 L820:                                                                  00009060
              FEIL_MELD_NR    =  500;                                   00009070
              FEIL_VED_LABEL  = '820';                                  00009080
              FATAL_FEIL      = '1'B;                                   00009090
              CALL SKRIV_FEILMELDING;                                   00009100
              EXEC CICS ABEND ABCODE(FEIL);                             00009110
           END;                                                         00009120
        ELSE                                                            00009130
           DO;                                                          00009140
              HJ_TLF(I) = TLF.TLFNR;                                    00009150
              I         = I + 1;                                        00009160
           END;                                                         00009170
                                                                        00009180
     DO WHILE(TK1.STATUS_KODE ^= 'GE');                                 00009190
         TLF         = '';                                              00009200
                                                                        00009210
         CALL PLITDLI       (FIRE              ,                        00009220
                             GNP               ,                        00009230
                             TK1               ,                        00009240
                             TLF               ,                        00009250
                             SSA_TLF_UQUAL)  ;                          00009260
                                                                        00009270
         IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                 00009280
           DO;                                                          00009290
 L210:                                                                  00009300
              FEIL_MELD_NR    =  500;                                   00009310
              FEIL_VED_LABEL  = '210';                                  00009320
              FATAL_FEIL      = '1'B;                                   00009330
              CALL SKRIV_FEILMELDING;                                   00009340
              EXEC CICS ABEND ABCODE(FEIL);                             00009350
           END;                                                         00009360
                                                                        00009370
         IF TK1.STATUS_KODE ^= 'GE' THEN                                00009380
            IF TK1.STATUS_KODE ^= '  ' THEN                             00009390
               DO;                                                      00009400
 L220:                                                                  00009410
                  FEIL_MELD_NR    =  500;                               00009420
                  FEIL_VED_LABEL  = '220';                              00009430
                  FATAL_FEIL      = '1'B;                               00009440
                  CALL SKRIV_FEILMELDING;                               00009450
                  EXEC CICS ABEND ABCODE(FEIL);                         00009460
               END;                                                     00009470
            ELSE                                                        00009480
               DO;                                                      00009490
                  HJ_TLF(I) = TLF.TLFNR;                                00009500
                  I         = I + 1;                                    00009510
               END;                                                     00009520
     END;                                                               00009530
                                                                        00009540
     CALL OVERFØR_SKJ_TLF;                                              00009550
     I               = 1;                                               00009560
     KOMMUNE      = '';                                                 00009570
     HJ_KOMM      = 0;                                                  00009580
     HJ_KOMM_TYPE = '';                                                 00009590
                                                                        00009600
     CALL PLITDLI       (FIRE              ,                            00009610
                         GNP               ,                            00009620
                         TK1               ,                            00009630
                         KOMMUNE           ,                            00009640
                         SSA_KOMM_UQUAL)  ;                             00009650
                                                                        00009660
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00009670
       DO;                                                              00009680
 L830:                                                                  00009690
          FEIL_MELD_NR    =  500;                                       00009700
          FEIL_VED_LABEL  = '830';                                      00009710
          FATAL_FEIL      = '1'B;                                       00009720
          CALL SKRIV_FEILMELDING;                                       00009730
          EXEC CICS ABEND ABCODE(FEIL);                                 00009740
       END;                                                             00009750
                                                                        00009760
     IF TK1.STATUS_KODE ^= 'GE' THEN                                    00009770
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00009780
           DO;                                                          00009790
 L840:                                                                  00009800
              FEIL_MELD_NR    =  500;                                   00009810
              FEIL_VED_LABEL  = '840';                                  00009820
              FATAL_FEIL      = '1'B;                                   00009830
              CALL SKRIV_FEILMELDING;                                   00009840
              EXEC CICS ABEND ABCODE(FEIL);                             00009850
           END;                                                         00009860
        ELSE                                                            00009870
           DO;                                                          00009880
              HJ_KOMM(I)      = KOMMUNE.KOMMNR;                         00009890
              HJ_KOMM_TYPE(I) = KOMMUNE.KOMM_TYPE;                      00009900
              I               = I + 1;                                  00009910
           END;                                                         00009920
                                                                        00009930
     DO WHILE(TK1.STATUS_KODE ^= 'GE');                                 00009940
         KOMMUNE = '';                                                  00009950
                                                                        00009960
         CALL PLITDLI       (FIRE              ,                        00009970
                             GNP               ,                        00009980
                             TK1               ,                        00009990
                             KOMMUNE           ,                        00010000
                             SSA_KOMM_UQUAL)  ;                         00010010
                                                                        00010020
         IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                 00010030
           DO;                                                          00010040
  L250:                                                                 00010050
              FEIL_MELD_NR    =  500;                                   00010060
              FEIL_VED_LABEL  = '250';                                  00010070
              FATAL_FEIL      = '1'B;                                   00010080
              CALL SKRIV_FEILMELDING;                                   00010090
              EXEC CICS ABEND ABCODE(FEIL);                             00010100
           END;                                                         00010110
                                                                        00010120
         IF TK1.STATUS_KODE ^= 'GE' THEN                                00010130
            IF TK1.STATUS_KODE ^= '  ' THEN                             00010140
               DO;                                                      00010150
  L260:                                                                 00010160
                  FEIL_MELD_NR    =  500;                               00010170
                  FEIL_VED_LABEL  = '260';                              00010180
                  FATAL_FEIL      = '1'B;                               00010190
                  CALL SKRIV_FEILMELDING;                               00010200
                  EXEC CICS ABEND ABCODE(FEIL);                         00010210
               END;                                                     00010220
            ELSE                                                        00010230
               DO;                                                      00010240
                  HJ_KOMM(I)      = KOMMUNE.KOMMNR;                     00010250
                  HJ_KOMM_TYPE(I) = KOMMUNE.KOMM_TYPE;                  00010260
                  I               = I + 1;                              00010270
               END;                                                     00010280
     END;                                                               00010290
                                                                        00010300
     CALL OVERFØR_SKJ_KOMM;                                             00010310
     I               = 1;                                               00010320
     SAT = '';                                                          00010330
     HJ_SAT = 0;                                                        00010340
                                                                        00010350
     CALL PLITDLI       (FIRE              ,                            00010360
                         GNP               ,                            00010370
                         TK1               ,                            00010380
                         SAT               ,                            00010390
                         SSA_SAT_UQUAL)  ;                              00010400
                                                                        00010410
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00010420
       DO;                                                              00010430
 L850:                                                                  00010440
          FEIL_MELD_NR    =  500;                                       00010450
          FEIL_VED_LABEL  = '850';                                      00010460
          FATAL_FEIL      = '1'B;                                       00010470
          CALL SKRIV_FEILMELDING;                                       00010480
          EXEC CICS ABEND ABCODE(FEIL);                                 00010490
       END;                                                             00010500
                                                                        00010510
     IF TK1.STATUS_KODE ^= 'GE' THEN                                    00010520
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00010530
           DO;                                                          00010540
  L860:                                                                 00010550
              FEIL_MELD_NR    =  500;                                   00010560
              FEIL_VED_LABEL  = '860';                                  00010570
              FATAL_FEIL      = '1'B;                                   00010580
              CALL SKRIV_FEILMELDING;                                   00010590
              EXEC CICS ABEND ABCODE(FEIL);                             00010600
           END;                                                         00010610
        ELSE                                                            00010620
           DO;                                                          00010630
              HJ_SAT(I) = SAT.SATTKNR;                                  00010640
              I         = I + 1;                                        00010650
           END;                                                         00010660
                                                                        00010670
     DO WHILE(TK1.STATUS_KODE ^= 'GE');                                 00010680
         SAT = '';                                                      00010690
                                                                        00010700
         CALL PLITDLI       (FIRE              ,                        00010710
                             GNP               ,                        00010720
                             TK1               ,                        00010730
                             SAT               ,                        00010740
                             SSA_SAT_UQUAL)  ;                          00010750
                                                                        00010760
         IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                 00010770
           DO;                                                          00010780
 L290:                                                                  00010790
              FEIL_MELD_NR    =  500;                                   00010800
              FEIL_VED_LABEL  = '290';                                  00010810
              FATAL_FEIL      = '1'B;                                   00010820
              CALL SKRIV_FEILMELDING;                                   00010830
              EXEC CICS ABEND ABCODE(FEIL);                             00010840
           END;                                                         00010850
                                                                        00010860
         IF TK1.STATUS_KODE ^= 'GE' THEN                                00010870
            IF TK1.STATUS_KODE ^= '  ' THEN                             00010880
               DO;                                                      00010890
 L300:                                                                  00010900
                  FEIL_MELD_NR    =  500;                               00010910
                  FEIL_VED_LABEL  = '300';                              00010920
                  FATAL_FEIL      = '1'B;                               00010930
                  CALL SKRIV_FEILMELDING;                               00010940
                  EXEC CICS ABEND ABCODE(FEIL);                         00010950
               END;                                                     00010960
            ELSE                                                        00010970
               DO;                                                      00010980
                  HJ_SAT(I) = SAT.SATTKNR;                              00010990
                  I         = I + 1;                                    00011000
               END;                                                     00011010
     END;                                                               00011020
                                                                        00011030
     CALL OVERFØR_SKJ_SAT;                                              00011040
                                                                        00011050
     S001020O.FUNKSJONSKODEA = DFHBMFSE;                                00011060
     S001020I.TKNRL          = CURSOR_POS;                              00011070
                                                                        00011080
     EXEC CICS SEND MAP('S001020') MAPSET('S001T63') ERASE CURSOR;      00011090
     EXEC CICS RECEIVE MAP('S001020') MAPSET('S001T63')                 00011100
          SET(BMSMAPBR) ASIS;                                           00011110
                                                                        00011120
     IF S001020I.FUNKSJONSKODEL > 0 THEN                                00011130
        FUNKSJONSKODE = S001020I.FUNKSJONSKODEI;                        00011140
     ELSE                                                               00011150
        IF S001020I.STYREKODEL > 0 THEN                                 00011160
           STYREKODE = S001020I.STYREKODEI;                             00011170
                                                                        00011180
     IF FUNKSJONSKODE ^= ' ' THEN                                       00011190
        DO;                                                             00011200
           IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                    00011210
             DO;                                                        00011220
                PROGRAM_ID = 'R001TK04';                                00011230
                TRANSKODE = 'RT04';                                     00011240
             END;                                                       00011250
                                                                        00011260
           ELSE                                                         00011270
             IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                  00011280
                DO;                                                     00011290
                   TRANSKODE = 'RT08';                                  00011300
                   PROGRAM_ID = 'R001TK08';                             00011310
                END;                                                    00011320
                                                                        00011330
             ELSE                                                       00011340
                IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN               00011350
                   DO;                                                  00011360
                      PROGRAM_ID = 'R001TK09';                          00011370
                      TRANSKODE = 'RT09';                               00011380
                   END;                                                 00011390
                                                                        00011400
                ELSE                                                    00011410
                   IF (VERIFY(FUNKSJONSKODE, 'Uu') = 0) THEN            00011420
                      DO;                                               00011430
                         PROGRAM_ID = 'R001TK70';                       00011440
                         TRANSKODE = 'RT70';                            00011450
                      END;                                              00011460
                                                                        00011470
                   ELSE                                                 00011480
                      DO;                                               00011490
                         PROGRAM_ID = 'R001TK03';                       00011500
                         TRANSKODE = 'RT03';                            00011510
                      END;                                              00011520
                                                                        00011530
           SEND_MAP      = '1'B;                                        00011540
           STYREKODE     = ' ';                                         00011550
           FUNKSJONSKODE = ' ';                                         00011560
                                                                        00011570
           CALL TK_DATABASE(TK_CLOSE);                                  00011580
                                                                        00011590
           EXEC CICS XCTL PROGRAM(PROGRAM_ID)                           00011600
                COMMAREA(KOM_OMR);                                      00011610
        END;                                                            00011620
                                                                        00011630
     ELSE                                                               00011640
       IF STYREKODE ^= ' ' THEN                                         00011650
          DO;                                                           00011660
              IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                     00011670
                 DO;                                                    00011680
                    IF SUBSTR(FUNKSJON,3,1) = '' THEN                   00011690
                       DO;                                              00011700
                           PROGRAM_ID = 'R001TK04';                     00011710
                           TRANSKODE = 'RT04';                          00011720
                       END;                                             00011730
                    ELSE                                                00011740
                       DO;                                              00011750
                          PROGRAM_ID = 'R001TK07';                      00011760
                          TRANSKODE = 'RT07';                           00011770
                       END;                                             00011780
                 END;                                                   00011790
                                                                        00011800
              ELSE                                                      00011810
                 IF (VERIFY(STYREKODE, 'Mm') = 0) THEN                  00011820
                    DO;                                                 00011830
                       IF SUBSTR(FUNKSJON,3,1) = '' THEN                00011840
                          DO;                                           00011850
                              PROGRAM_ID = 'R001TK04';                  00011860
                              TRANSKODE = 'RT04';                       00011870
                          END;                                          00011880
                       ELSE                                             00011890
                          DO;                                           00011900
                             PROGRAM_ID = 'R001TK80';                   00011910
                             TRANSKODE = 'RT80';                        00011920
                          END;                                          00011930
                    END;                                                00011940
                                                                        00011950
                 ELSE                                                   00011960
                    IF (VERIFY(STYREKODE, 'Kk') = 0) THEN               00011970
                       DO;                                              00011980
                          IF SUBSTR(FUNKSJON,6,1) = '' THEN             00011990
                             DO;                                        00012000
                                 PROGRAM_ID = 'R001TK04';               00012010
                                 TRANSKODE = 'RT04';                    00012020
                             END;                                       00012030
                          ELSE                                          00012040
                             DO;                                        00012050
                                PROGRAM_ID = 'R001TK06';                00012060
                                TRANSKODE = 'RT06';                     00012070
                             END;                                       00012080
                       END;                                             00012090
                    ELSE                                                00012100
                       IF (VERIFY(STYREKODE, 'Ss') = 0) THEN            00012110
                          DO;                                           00012120
                             IF SUBSTR(FUNKSJON,1,1) ^= '' &            00012130
                                SUBSTR(FUNKSJON,2,1) ^= '' &            00012140
                                SUBSTR(FUNKSJON,3,1) ^= '' &            00012150
                                SUBSTR(FUNKSJON,4,1) ^= ''   THEN       00012160
                                DO;                                     00012170
                                   PROGRAM_ID = 'R001TK60';             00012180
                                   TRANSKODE = 'RT60';                  00012190
                                END;                                    00012200
                             ELSE                                       00012210
                                DO;                                     00012220
                                   PROGRAM_ID = 'R001TK03';             00012230
                                   TRANSKODE = 'RT03';                  00012240
                                END;                                    00012250
                          END;                                          00012260
                       ELSE                                             00012270
                          IF (VERIFY(STYREKODE, 'Dd') = 0) THEN         00012280
                             DO;                                        00012290
                                IF SUBSTR(FUNKSJON,1,1) ^= '' &         00012300
                                   SUBSTR(FUNKSJON,2,1) ^= '' &         00012310
                                   SUBSTR(FUNKSJON,3,1) ^= '' &         00012320
                                   SUBSTR(FUNKSJON,4,1) ^= ''   THEN    00012330
                                   DO;                                  00012340
                                      PROGRAM_ID = 'R001TK61';          00012350
                                      TRANSKODE = 'RT61';               00012360
                                   END;                                 00012370
                                ELSE                                    00012380
                                   DO;                                  00012390
                                      PROGRAM_ID = 'R001TK03';          00012400
                                      TRANSKODE = 'RT03';               00012410
                                   END;                                 00012420
                             END;                                       00012430
                          ELSE                                          00012440
                             IF (VERIFY(STYREKODE, 'Ff') = 0) THEN      00012450
                                DO;                                     00012460
                                   PROGRAM_ID = 'R001TK62';             00012470
                                   TRANSKODE = 'RT62';                  00012480
                                END;                                    00012490
                             ELSE                                       00012500
                                DO;                                     00012510
                                   PROGRAM_ID = 'R001TK03';             00012520
                                   TRANSKODE = 'RT03';                  00012530
                                END;                                    00012540
                                                                        00012550
             SEND_MAP      = '1'B;                                      00012560
             STYREKODE     = ' ';                                       00012570
             FUNKSJONSKODE = ' ';                                       00012580
                                                                        00012590
             CALL TK_DATABASE(TK_CLOSE);                                00012600
                                                                        00012610
             EXEC CICS XCTL PROGRAM(PROGRAM_ID)                         00012620
                    COMMAREA(KOM_OMR);                                  00012630
          END;                                                          00012640
                                                                        00012650
       ELSE                                                             00012660
          DO;                                                           00012670
             IF LES_NAVN THEN                                           00012680
             DO;                                                        00012690
                SSA_TK.KEY = TK.TKNR;                                   00012700
                CALL LES_DB_TKNR;                                       00012710
             END;                                                       00012720
                                                                        00012730
             CALL LES_DB_KONTI;                                         00012740
                                                                        00012750
             ALLOCATE S001022O;                                         00012760
                                                                        00012770
             S001022O.TKNRO     = TK.TKNR;                              00012780
             S001022O.TKNAVNO   = TK.TKNAVN;                            00012790
             S001022I.TKNRL     = CURSOR_POS;                           00012800
             S001022O.MELDING1O = 'FOR Å SE MER DATA, TRYKK ENTER!';    00012810
                                                                        00012820
             IF KONTI_FINNES THEN                                       00012830
               DO;                                                      00012840
                  KONTI_FINNES = '0'B;                                  00012850
                                                                        00012860
                  CALL OVERFØR_SKJ_KONTI;                               00012870
               END;                                                     00012880
                                                                        00012890
             SSA_TK.KEY = TK.TKNR;                                      00012900
             CALL LES_DB_TKNR;                                          00012910
                                                                        00012920
             CALL LES_DB_INNB;                                          00012930
                                                                        00012940
             IF INNB_FINNES THEN                                        00012950
               DO;                                                      00012960
                  CALL OVERFØR_SKJ_INNB;                                00012970
                  INNB_FINNES = '0'B;                                   00012980
               END;                                                     00012990
                                                                        00013000
             EXEC CICS SEND MAP('S001022') MAPSET('S001T63')            00013010
                  ERASE CURSOR;                                         00013020
                                                                        00013030
             EXEC CICS RECEIVE MAP('S001022') MAPSET('S001T63')         00013040
                  SET(BMSMAPBR) ASIS;                                   00013050
                                                                        00013060
             IF S001022I.FUNKSJONSKODEL > 0 THEN                        00013070
                FUNKSJONSKODE = S001022I.FUNKSJONSKODEI;                00013080
             ELSE                                                       00013090
                IF S001022I.STYREKODEL > 0 THEN                         00013100
                   STYREKODE = S001022I.STYREKODEI;                     00013110
                                                                        00013120
             IF FUNKSJONSKODE ^= ' ' THEN                               00013130
                DO;                                                     00013140
                   IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN            00013150
                     DO;                                                00013160
                        PROGRAM_ID = 'R001TK04';                        00013170
                        TRANSKODE = 'RT04';                             00013180
                     END;                                               00013190
                                                                        00013200
                   ELSE                                                 00013210
                     IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN          00013220
                        DO;                                             00013230
                           TRANSKODE = 'RT08';                          00013240
                           PROGRAM_ID = 'R001TK08';                     00013250
                        END;                                            00013260
                                                                        00013270
                     ELSE                                               00013280
                        IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN       00013290
                           DO;                                          00013300
                              PROGRAM_ID = 'R001TK09';                  00013310
                              TRANSKODE = 'RT09';                       00013320
                           END;                                         00013330
                                                                        00013340
                        ELSE                                            00013350
                           IF (VERIFY(FUNKSJONSKODE, 'Uu') = 0) THEN    00013360
                              DO;                                       00013370
                                 PROGRAM_ID = 'R001TK70';               00013380
                                 TRANSKODE = 'RT70';                    00013390
                              END;                                      00013400
                                                                        00013410
                           ELSE                                         00013420
                              DO;                                       00013430
                                 PROGRAM_ID = 'R001TK03';               00013440
                                 TRANSKODE = 'RT03';                    00013450
                              END;                                      00013460
                                                                        00013470
                   SEND_MAP      = '1'B;                                00013480
                   STYREKODE     = ' ';                                 00013490
                   FUNKSJONSKODE = ' ';                                 00013500
                                                                        00013510
                   CALL TK_DATABASE(TK_CLOSE);                          00013520
                                                                        00013530
                   EXEC CICS XCTL PROGRAM(PROGRAM_ID)                   00013540
                        COMMAREA(KOM_OMR);                              00013550
                END;                                                    00013560
                                                                        00013570
             ELSE                                                       00013580
               IF STYREKODE ^= ' ' THEN                                 00013590
                  DO;                                                   00013600
                      IF (VERIFY(STYREKODE, 'Aa') = 0) THEN             00013610
                         DO;                                            00013620
                            IF SUBSTR(FUNKSJON,3,1) = '' THEN           00013630
                               DO;                                      00013640
                                   PROGRAM_ID = 'R001TK04';             00013650
                                   TRANSKODE = 'RT04';                  00013660
                               END;                                     00013670
                            ELSE                                        00013680
                               DO;                                      00013690
                                  PROGRAM_ID = 'R001TK07';              00013700
                                  TRANSKODE = 'RT07';                   00013710
                               END;                                     00013720
                         END;                                           00013730
                                                                        00013740
                      ELSE                                              00013750
                         IF (VERIFY(STYREKODE, 'Mm') = 0) THEN          00013760
                            DO;                                         00013770
                               IF SUBSTR(FUNKSJON,3,1) = '' THEN        00013780
                                  DO;                                   00013790
                                      PROGRAM_ID = 'R001TK04';          00013800
                                      TRANSKODE = 'RT04';               00013810
                                  END;                                  00013820
                               ELSE                                     00013830
                                  DO;                                   00013840
                                     PROGRAM_ID = 'R001TK80';           00013850
                                     TRANSKODE = 'RT80';                00013860
                                  END;                                  00013870
                            END;                                        00013880
                                                                        00013890
                      ELSE                                              00013900
                         IF (VERIFY(STYREKODE, 'Kk') = 0) THEN          00013910
                            DO;                                         00013920
                               IF SUBSTR(FUNKSJON,6,1) = '' THEN        00013930
                                  DO;                                   00013940
                                      PROGRAM_ID = 'R001TK04';          00013950
                                      TRANSKODE = 'RT04';               00013960
                                  END;                                  00013970
                               ELSE                                     00013980
                                  DO;                                   00013990
                                     PROGRAM_ID = 'R001TK06';           00014000
                                     TRANSKODE = 'RT06';                00014010
                                  END;                                  00014020
                            END;                                        00014030
                         ELSE                                           00014040
                            IF (VERIFY(STYREKODE, 'Ss') = 0) THEN       00014050
                               DO;                                      00014060
                                  IF SUBSTR(FUNKSJON,1,1) ^= '' &       00014070
                                     SUBSTR(FUNKSJON,2,1) ^= '' &       00014080
                                     SUBSTR(FUNKSJON,3,1) ^= '' &       00014090
                                     SUBSTR(FUNKSJON,4,1) ^= ''   THEN  00014100
                                     DO;                                00014110
                                        PROGRAM_ID = 'R001TK60';        00014120
                                        TRANSKODE = 'RT60';             00014130
                                     END;                               00014140
                                  ELSE                                  00014150
                                     DO;                                00014160
                                        PROGRAM_ID = 'R001TK03';        00014170
                                        TRANSKODE = 'RT03';             00014180
                                     END;                               00014190
                               END;                                     00014200
                            ELSE                                        00014210
                               IF (VERIFY(STYREKODE, 'Dd') = 0) THEN    00014220
                                  DO;                                   00014230
                                     IF SUBSTR(FUNKSJON,1,1) ^= '' &    00014240
                                        SUBSTR(FUNKSJON,2,1) ^= '' &    00014250
                                        SUBSTR(FUNKSJON,3,1) ^= '' &    00014260
                                        SUBSTR(FUNKSJON,4,1) ^= ''  THEN00014270
                                        DO;                             00014280
                                           PROGRAM_ID = 'R001TK61';     00014290
                                           TRANSKODE = 'RT61';          00014300
                                        END;                            00014310
                                     ELSE                               00014320
                                        DO;                             00014330
                                           PROGRAM_ID = 'R001TK03';     00014340
                                           TRANSKODE = 'RT03';          00014350
                                        END;                            00014360
                                  END;                                  00014370
                                                                        00014380
                     SEND_MAP      = '1'B;                              00014390
                     STYREKODE     = ' ';                               00014400
                     FUNKSJONSKODE = ' ';                               00014410
                                                                        00014420
                     CALL TK_DATABASE(TK_CLOSE);                        00014430
                                                                        00014440
                     EXEC CICS XCTL PROGRAM(PROGRAM_ID)                 00014450
                            COMMAREA(KOM_OMR);                          00014460
                  END;                                                  00014470
       END;                                                             00014480
                                                                        00014490
 END VIS_OPPLYSNINGER;                                                  00014500
                                                                        00014510
                                                                        00014520
 LES_DB_TKNR: PROC;                                                     00014530
                                                                        00014540
     TK = '';                                                           00014550
                                                                        00014560
     CALL PLITDLI       (FIRE              ,                            00014570
                         GU                ,                            00014580
                         TK1               ,                            00014590
                         TK                ,                            00014600
                         SSA_TK)           ;                            00014610
                                                                        00014620
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00014630
        DO;                                                             00014640
 L010:                                                                  00014650
           FEIL_MELD_NR    =  500;                                      00014660
           FEIL_VED_LABEL  = '010';                                     00014670
           FATAL_FEIL      = '1'B;                                      00014680
           CALL SKRIV_FEILMELDING;                                      00014690
           EXEC CICS ABEND ABCODE(FEIL);                                00014700
        END;                                                            00014710
                                                                        00014720
     IF TK1.STATUS_KODE = 'GE' THEN                                     00014730
        TK_FINNES = '0'B;                                               00014740
                                                                        00014750
     ELSE                                                               00014760
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00014770
           DO;                                                          00014780
  L060:                                                                 00014790
               FEIL_MELD_NR    =  500;                                  00014800
               FEIL_VED_LABEL  = '060';                                 00014810
               FATAL_FEIL      = '1'B;                                  00014820
               CALL SKRIV_FEILMELDING;                                  00014830
               EXEC CICS ABEND ABCODE(FEIL);                            00014840
           END;                                                         00014850
        ELSE                                                            00014860
           TK_FINNES = '1'B;                                            00014870
                                                                        00014880
 END LES_DB_TKNR;                                                       00014890
                                                                        00014900
                                                                        00014910
 LES_DB_NAVN: PROC;                                                     00014920
                                                                        00014930
     TK = '';                                                           00014940
                                                                        00014950
     CALL PLITDLI       (FIRE              ,                            00014960
                         GU                ,                            00014970
                         TK2               ,                            00014980
                         TK                ,                            00014990
                         SSA_TK2)          ;                            00015000
                                                                        00015010
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00015020
        DO;                                                             00015030
 L150:                                                                  00015040
           FEIL_MELD_NR    =  500;                                      00015050
           FEIL_VED_LABEL  = '150';                                     00015060
           FATAL_FEIL      = '1'B;                                      00015070
           CALL SKRIV_FEILMELDING;                                      00015080
           EXEC CICS ABEND ABCODE(FEIL);                                00015090
        END;                                                            00015100
                                                                        00015110
     IF ((TK2.STATUS_KODE = 'GE') ! (TK2.STATUS_KODE = 'GB')) THEN      00015120
        TK_FINNES = '0'B;                                               00015130
                                                                        00015140
     ELSE                                                               00015150
        IF TK2.STATUS_KODE ^= '  ' THEN                                 00015160
           DO;                                                          00015170
  L160:                                                                 00015180
               FEIL_MELD_NR    =  500;                                  00015190
               FEIL_VED_LABEL  = '160';                                 00015200
               FATAL_FEIL      = '1'B;                                  00015210
               CALL SKRIV_FEILMELDING;                                  00015220
               EXEC CICS ABEND ABCODE(FEIL);                            00015230
           END;                                                         00015240
        ELSE                                                            00015250
           TK_FINNES = '1'B;                                            00015260
                                                                        00015270
 END LES_DB_NAVN;                                                       00015280
                                                                        00015290
                                                                        00015300
 LES_DB_NAVN_NESTE: PROC;                                               00015310
                                                                        00015320
     TK = '';                                                           00015330
                                                                        00015340
     CALL PLITDLI       (FIRE              ,                            00015350
                         GN                ,                            00015360
                         TK2               ,                            00015370
                         TK                ,                            00015380
                         SSA_TK2)          ;                            00015390
                                                                        00015400
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00015410
        DO;                                                             00015420
 L170:                                                                  00015430
           FEIL_MELD_NR    =  500;                                      00015440
           FEIL_VED_LABEL  = '170';                                     00015450
           FATAL_FEIL      = '1'B;                                      00015460
           CALL SKRIV_FEILMELDING;                                      00015470
           EXEC CICS ABEND ABCODE(FEIL);                                00015480
        END;                                                            00015490
                                                                        00015500
     IF ((TK2.STATUS_KODE = 'GE') ! (TK2.STATUS_KODE = 'GB')) THEN      00015510
        TK_FINNES = '0'B;                                               00015520
                                                                        00015530
     ELSE                                                               00015540
        IF TK2.STATUS_KODE ^= '  ' THEN                                 00015550
           DO;                                                          00015560
  L180:                                                                 00015570
               FEIL_MELD_NR    =  500;                                  00015580
               FEIL_VED_LABEL  = '180';                                 00015590
               FATAL_FEIL      = '1'B;                                  00015600
               CALL SKRIV_FEILMELDING;                                  00015610
               EXEC CICS ABEND ABCODE(FEIL);                            00015620
           END;                                                         00015630
        ELSE                                                            00015640
           TK_FINNES = '1'B;                                            00015650
                                                                        00015660
 END LES_DB_NAVN_NESTE;                                                 00015670
                                                                        00015680
                                                                        00015690
 LES_DB_FØRSTE: PROC;                                                   00015700
                                                                        00015710
     TK = '';                                                           00015720
                                                                        00015730
     CALL PLITDLI       (FIRE              ,                            00015740
                         GU                ,                            00015750
                         TK1               ,                            00015760
                         TK                ,                            00015770
                         SSA_TK_UQUAL)     ;                            00015780
                                                                        00015790
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00015800
        DO;                                                             00015810
 L110:                                                                  00015820
           FEIL_MELD_NR    =  500;                                      00015830
           FEIL_VED_LABEL  = '110';                                     00015840
           FATAL_FEIL      = '1'B;                                      00015850
           CALL SKRIV_FEILMELDING;                                      00015860
           EXEC CICS ABEND ABCODE(FEIL);                                00015870
        END;                                                            00015880
                                                                        00015890
     IF TK1.STATUS_KODE = 'GB' THEN                                     00015900
        SLUTT_BASE = '1'B;                                              00015910
                                                                        00015920
     ELSE                                                               00015930
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00015940
           DO;                                                          00015950
  L120:                                                                 00015960
               FEIL_MELD_NR    =  500;                                  00015970
               FEIL_VED_LABEL  = '120';                                 00015980
               FATAL_FEIL      = '1'B;                                  00015990
               CALL SKRIV_FEILMELDING;                                  00016000
               EXEC CICS ABEND ABCODE(FEIL);                            00016010
           END;                                                         00016020
        ELSE                                                            00016030
           SLUTT_BASE = '0'B;                                           00016040
                                                                        00016050
 END LES_DB_FØRSTE;                                                     00016060
                                                                        00016070
                                                                        00016080
 LES_DB_NESTE: PROC;                                                    00016090
                                                                        00016100
     TK = '';                                                           00016110
                                                                        00016120
     CALL PLITDLI       (FIRE              ,                            00016130
                         GN                ,                            00016140
                         TK1               ,                            00016150
                         TK                ,                            00016160
                         SSA_TK_UQUAL)     ;                            00016170
                                                                        00016180
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00016190
        DO;                                                             00016200
 L130:                                                                  00016210
           FEIL_MELD_NR    =  500;                                      00016220
           FEIL_VED_LABEL  = '130';                                     00016230
           FATAL_FEIL      = '1'B;                                      00016240
           CALL SKRIV_FEILMELDING;                                      00016250
           EXEC CICS ABEND ABCODE(FEIL);                                00016260
        END;                                                            00016270
                                                                        00016280
     IF TK1.STATUS_KODE = 'GB' THEN                                     00016290
        SLUTT_BASE = '1'B;                                              00016300
                                                                        00016310
     ELSE                                                               00016320
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00016330
           DO;                                                          00016340
  L140:                                                                 00016350
               FEIL_MELD_NR    =  500;                                  00016360
               FEIL_VED_LABEL  = '140';                                 00016370
               FATAL_FEIL      = '1'B;                                  00016380
               CALL SKRIV_FEILMELDING;                                  00016390
               EXEC CICS ABEND ABCODE(FEIL);                            00016400
           END;                                                         00016410
        ELSE                                                            00016420
           SLUTT_BASE = '0'B;                                           00016430
                                                                        00016440
 END LES_DB_NESTE;                                                      00016450
                                                                        00016460
                                                                        00016470
 LES_DB_KONTI: PROC;                                                    00016480
                                                                        00016490
     KONTI = '';                                                        00016500
                                                                        00016510
     CALL PLITDLI       (FIRE              ,                            00016520
                         GNP               ,                            00016530
                         TK1               ,                            00016540
                         KONTI             ,                            00016550
                         SSA_KONTI_UQUAL)  ;                            00016560
                                                                        00016570
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00016580
        DO;                                                             00016590
 L020:                                                                  00016600
           FEIL_MELD_NR    =  500;                                      00016610
           FEIL_VED_LABEL  = '020';                                     00016620
           FATAL_FEIL      = '1'B;                                      00016630
           CALL SKRIV_FEILMELDING;                                      00016640
           EXEC CICS ABEND ABCODE(FEIL);                                00016650
        END;                                                            00016660
                                                                        00016670
     IF TK1.STATUS_KODE = 'GE' THEN                                     00016680
        KONTI_FINNES = '0'B;                                            00016690
                                                                        00016700
     ELSE                                                               00016710
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00016720
           DO;                                                          00016730
  L030:                                                                 00016740
               FEIL_MELD_NR    =  500;                                  00016750
               FEIL_VED_LABEL  = '030';                                 00016760
               FATAL_FEIL      = '1'B;                                  00016770
               CALL SKRIV_FEILMELDING;                                  00016780
               EXEC CICS ABEND ABCODE(FEIL);                            00016790
           END;                                                         00016800
        ELSE                                                            00016810
           KONTI_FINNES = '1'B;                                         00016820
                                                                        00016830
 END LES_DB_KONTI;                                                      00016840
                                                                        00016850
                                                                        00016860
 LES_DB_INNB: PROC;                                                     00016870
                                                                        00016880
     INNBYGG = '';                                                      00016890
                                                                        00016900
     CALL PLITDLI       (FIRE              ,                            00016910
                         GNP               ,                            00016920
                         TK1               ,                            00016930
                         INNBYGG           ,                            00016940
                         SSA_INNB_UQUAL)  ;                             00016950
                                                                        00016960
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00016970
        DO;                                                             00016980
 L700:                                                                  00016990
           FEIL_MELD_NR    =  500;                                      00017000
           FEIL_VED_LABEL  = '700';                                     00017010
           FATAL_FEIL      = '1'B;                                      00017020
           CALL SKRIV_FEILMELDING;                                      00017030
           EXEC CICS ABEND ABCODE(FEIL);                                00017040
        END;                                                            00017050
                                                                        00017060
     IF TK1.STATUS_KODE = 'GE' THEN                                     00017070
        INNB_FINNES = '0'B;                                             00017080
                                                                        00017090
     ELSE                                                               00017100
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00017110
           DO;                                                          00017120
  L710:                                                                 00017130
               FEIL_MELD_NR    =  500;                                  00017140
               FEIL_VED_LABEL  = '710';                                 00017150
               FATAL_FEIL      = '1'B;                                  00017160
               CALL SKRIV_FEILMELDING;                                  00017170
               EXEC CICS ABEND ABCODE(FEIL);                            00017180
           END;                                                         00017190
        ELSE                                                            00017200
           INNB_FINNES = '1'B;                                          00017210
                                                                        00017220
 END LES_DB_INNB;                                                       00017230
                                                                        00017240
                                                                        00017250
 TK_DATABASE:                                                           00017260
   PROC    (STYRING);                                                   00017270
                                                                        00017280
   DCL                                                                  00017290
      STYRING             CHAR (5);                                     00017300
                                                                        00017310
  /* **************************************************************** */00017320
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00017330
  /*     KALL                                                         */00017340
  /* **************************************************************** */00017350
                                                                        00017360
     DCL                                                                00017370
       PSB_NAVN                    CHAR (8)       INIT('B001TK03'),     00017380
       PCB_FUNCTION                CHAR (4)       INIT('PCB '),         00017390
       TERM_FUNCTION               CHAR (4)       INIT('TERM');         00017400
                                                                        00017410
                                                                        00017420
  /* **************************************************************** */00017430
  /*     DLI CALL-PARAMETRE                                           */00017440
  /* **************************************************************** */00017450
                                                                        00017460
     DCL 1  DLI_PARAM,                                                  00017470
            2   PARM_CT_1          FIXED BIN (31)  INIT ( 1 ),          00017480
            2   PARM_CT_3          FIXED BIN (31)  INIT ( 3 ),          00017490
            2   PARM_CT_4          FIXED BIN (31)  INIT ( 4 );          00017500
                                                                        00017510
                                                                        00017520
                                                                        00017530
     IF STYRING = 'OPEN '                         THEN                  00017540
        DO;                                                             00017550
           CALL   PLITDLI                        (PARM_CT_3,            00017560
                                                  PCB_FUNCTION,         00017570
                                                  PSB_NAVN,             00017580
                                                  UIBPTR);              00017590
                                                                        00017600
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00017610
             DO;                                                        00017620
                ALLOCATE S001019O;                                      00017630
                S001019O.MELDING1O =                                    00017640
                 'DB-FEIL PÅ ÅPNINGSKALLET, KODE:' !!                   00017650
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00017660
                                                                        00017670
                EXEC CICS SEND MAP('S001019') MAPSET('S001T33') ERASE;  00017680
                                                                        00017690
                EXEC CICS RECEIVE MAP('S001019')                        00017700
                       MAPSET('S001T33') SET(BMSMAPBR) ASIS;            00017710
                                                                        00017720
                EXEC CICS ABEND ABCODE(FEIL);                           00017730
             END;                                                       00017740
        END;                                                            00017750
     ELSE                                                               00017760
        DO;                                                             00017770
           CALL   PLITDLI                     (PARM_CT_1,               00017780
                                               TERM_FUNCTION);          00017790
                                                                        00017800
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00017810
             DO;                                                        00017820
                S001019O.MELDING1O =                                    00017830
                 'DB-FEIL PÅ STENGINGSKALLET, KODE:' !!                 00017840
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00017850
                                                                        00017860
                EXEC CICS SEND MAP('S001019') MAPSET('S001T33') ERASE;  00017870
                                                                        00017880
                EXEC CICS RECEIVE MAP('S001019')                        00017890
                       MAPSET('S001T33') SET(BMSMAPBR) ASIS;            00017900
                                                                        00017910
                EXEC CICS ABEND ABCODE(FEIL);                           00017920
             END;                                                       00017930
        END;                                                            00017940
                                                                        00017950
 END TK_DATABASE;                                                       00017960
                                                                        00017970
 SKRIV_FEILMELDING: PROC;                                               00017980
                                                                        00017990
    ALLOCATE S001019O;                                                  00018000
                                                                        00018010
    S001019O.MELDING1O =                                                00018020
       'FEIL VED LABEL: ' !! FEIL_VED_LABEL;                            00018030
                                                                        00018040
    S001019O.MELDING2O =                                                00018050
       'UIBFCTR: ' !! UNSPEC(UIBFCTR) !!                                00018060
       ' UIBDLTR: ' !! UNSPEC(UIBDLTR);                                 00018070
                                                                        00018080
    S001019O.MELDING3O =                                                00018090
       'TK1.STATUS-KODE: ' !! TK1.STATUS_KODE;                          00018100
                                                                        00018110
    S001019O.MELDING4O =                                                00018120
       'TK2.STATUS-KODE: ' !! TK2.STATUS_KODE;                          00018130
                                                                        00018140
    EXEC CICS SEND MAP('S001019') MAPSET('S001T33') ERASE;              00018150
                                                                        00018160
    EXEC CICS RECEIVE MAP('S001019')                                    00018170
           MAPSET('S001T33') SET(BMSMAPBR) ASIS;                        00018180
                                                                        00018190
 END SKRIV_FEILMELDING;                                                 00018200
                                                                        00018210
                                                                        00018220
  FEILBEH:                                                              00018230
                                                                        00018240
     CALL TK_DATABASE(TK_CLOSE);                                        00018250
                                                                        00018260
     ALLOCATE S001019O;                                                 00018270
                                                                        00018280
     S001019O.MELDING1O =                                               00018290
                                                                        00018300
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00018310
                                                                        00018320
     S001019O.MELDING2O =                                               00018330
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00018340
                                                                        00018350
     S001019O.MELDING3O =                                               00018360
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00018370
                                         !! '. DATASETT : ' !! DSNAVN;  00018380
                                                                        00018390
     S001019O.MELDING4O =                                               00018400
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00018410
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00018420
                                                                        00018430
     S001019O.MELDING5O =                                               00018440
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00018450
                                                                        00018460
                                                                        00018470
     EXEC CICS SEND MAP('S001019') MAPSET('S001T33') ERASE;             00018480
                                                                        00018490
     EXEC CICS RECEIVE MAP('S001019')                                   00018500
                       MAPSET('S001T33') SET(BMSMAPBR) ASIS;            00018510
                                                                        00018520
                                                                        00018530
     EXEC CICS SYNCPOINT ROLLBACK;                                      00018540
                                                                        00018550
     EXEC CICS RETURN;                                                  00018560
                                                                        00018570
 END R001TK9;                                                           00018580
