 /*       SIST ENDRET 05/05-98 14.31.48 AV   JDA7339                  */00000000
 /*       SIST ENDRET 09/03-98 10.20.56 AV   SPA7339                  */00000010
 /*       SIST ENDRET 30/08-90 08.54.40 AV   DYBVIK                   */00000020
  /* **************************************************************** */00000030
  /*IDENTIFIKASJON:                                                   */00000040
  /*    R0015411 - HOVEDPROGRAM I PLI                                 */00000050
  /*    PROGRAMMERER: LUNDEBY FEBRUAR  1982                           */00000060
  /*                                                                  */00000070
  /*HENSIKT:                                                          */00000080
  /*    REPLACE ROOT  ,                                               */00000090
  /*              RECORD TIL DATABASEN                                */00000100
  /*                                                                  */00000110
  /*PROGRAMTILKNYTNING:                                               */00000120
  /*                                                                  */00000130
  /*BRUK:                                                             */00000140
  /*                                                                  */00000150
  /* **************************************************************** */00000160
                                                                        00000170
  R001540 :                                                             00000180
    PROC            (COMMAREA_PEKER)                                    00000190
           OPTIONS  (MAIN);                                             00000200
                                                                        00000210
                                                                        00000220
    %PAGE;                                                              00000230
    %INCLUDE P0019908;                            /* KOM_OMR        */  00000240
                                                                        00000250
    %PAGE;                                                              00000260
    %INCLUDE P0019910;                            /* STYRINGS_OMR   */  00000270
                                                                        00000280
    %PAGE;                                                              00000290
    %INCLUDE P0019912;                            /* DIV_PARAM_OMR  */  00000300
                                                                        00000310
                                                                        00000320
    %PAGE;                                                              00000330
       DCL 1  B02              BASED (B02_PEKER),                       00000340
    %INCLUDE P0019921;                            /* B02            */  00000350
                                                                        00000360
                                                                        00000370
    /* ************************************************************ */  00000380
    /*     INNEBYGDE PLI-FUNKSJONER                                 */  00000390
    /* ************************************************************ */  00000400
                                                                        00000410
     DCL                                                                00000420
        ( ADDR , LOW , CSTG   ) BUILTIN;                                00000430
     DCL                                                                00000440
          PLITDLI ENTRY;                                                00000450
     DCL                                                                00000460
         COMMAREA_PEKER            POINTER;                             00000470
     DCL                                                                00000480
         W01_HJELPE_PTR            POINTER;                             00000490
                                                                        00000500
    /* ************************************************************ */  00000510
    /* HJELPE-OMR. FOR BUILTIN-FUNC.     :    DATO_2000             */  00000520
    /* ************************************************************ */  00000530
                                                                        00000540
     DCL    W01_DATO_2000                    PIC '(8)9'  INIT (0);      00000550
                                                                        00000560
 /*  DCL    W01_ÅR  DEF     W01_DATO_2000    PIC '99' ; */              00000570
                                                                        00000580
    /* ************************************************************ */  00000590
    /* OPPTELINGS- OG LOOP-PARAMETRE M.M                            */  00000600
    /* ************************************************************ */  00000610
                                                                        00000620
     DCL 1  W01_OPPTELL_OMR,                                            00000630
            2   W02_I              FIXED    BIN   (15)   INIT ( 0 ),    00000640
            2   W02_ÅR             FIXED    BIN   (15)   INIT ( 0 ),    00000650
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),    00000660
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),    00000670
            2   B                           CHAR  (1)    INIT (' ');    00000680
                                                                        00000690
    %PAGE;                                                              00000700
    /* ************************************************************ */  00000710
    /*                                                              */  00000720
    /* DLI CALL-PARAMETRE                                           */  00000730
    /*                                                              */  00000740
    /* ************************************************************ */  00000750
                                                                        00000760
     DCL 1  W01_DLI_PARAM,                                              00000770
            2   W02_DLI_FUNC       CHAR (4)       INIT ('    '),        00000780
            2   W02_GN             CHAR (4)       INIT ('GN  '),        00000790
            2   W02_GU             CHAR (4)       INIT ('GU  '),        00000800
            2   W02_GNP            CHAR (4)       INIT ('GNP '),        00000810
            2   W02_GHU            CHAR (4)       INIT ('GHU '),        00000820
            2   W02_DLET           CHAR (4)       INIT ('DLET'),        00000830
            2   W02_REPL           CHAR (4)       INIT ('REPL'),        00000840
            2   W02_ISRT           CHAR (4)       INIT ('ISRT'),        00000850
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT (3),             00000860
            2   W02_PARM_CT_4      FIXED BIN(31)  INIT (4),             00000870
            2   W02_PARM_CT_5      FIXED BIN(31)  INIT (5),             00000880
            2   W02_PARM_CT_6      FIXED BIN(31)  INIT (6),             00000890
            2   W02_PARM_CT_7      FIXED BIN(31)  INIT (7),             00000900
            2   W02_OUT_FELT       PIC '(11)9'    INIT (''),            00000910
            2   W02_DATO           PIC '(4)9'     INIT (''),            00000920
            2   W02_ST_OK          BIT (1)        INIT (''),            00000930
            2   NEI                BIT (1)        INIT ('0'B),          00000940
            2   PERSON_IKKE_DØD    BIT (1)        INIT ('0'B),          00000950
            2   W02_OUT2           CHAR (20)      INIT ('');            00000960
                                                                        00000970
     DCL    W01_IO                 CHAR (150)    INIT  ('');            00000980
     DCL    W01_HJELPE_IO          CHAR (150)    BASED (W01_HJELPE_PTR);00000990
                                                                        00001000
    %PAGE;                                                              00001010
    /* ************************************************************ */  00001020
    /*                                                              */  00001030
    /* DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */  00001040
    /*                                                              */  00001050
    /* ************************************************************ */  00001060
                                                                        00001070
     DCL    SSA_UQUAL                            CHAR (9) INIT ((9)' ');00001080
                                                                        00001090
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                           00001100
            2    HDEL                            CHAR (17)  INIT        00001110
                 ('RF0PERSN(FNR     '),                                 00001120
            2    REL_OP                          CHAR (2)   INIT (' ='),00001130
            2    PKEY               FIXED        DEC  (11)  INIT ( 0 ), 00001140
            2    HP                              CHAR (1)   INIT (')'); 00001150
                                                                        00001160
                                                                        00001170
    /* ************************************************************ */  00001180
    /*                                                              */  00001190
    /* ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */  00001200
    /*                                                              */  00001210
    /* ************************************************************ */  00001220
                                                                        00001230
    %INCLUDE DLIUIB;                                                    00001240
                                                                        00001250
     DCL                                                                00001260
         UIB_RC_OK                 BIT (8)       INIT( 0 );             00001270
                                                                        00001280
                                                                        00001290
    /* ************************************************************ */  00001300
    /*                                                              */  00001310
    /* PCB- OG UIB-OMR .                                          */    00001320
    /*                                                              */  00001330
    /* ************************************************************ */  00001340
                                                                        00001350
     %INCLUDE   P0012002;                /* PCB_UIB_PEKER_OMR BASED */  00001360
                                                                        00001370
     DCL 1  RF1                     BASED (RF1_PCB_PEKER),              00001380
     %INCLUDE   P0012003;                /*    PCB                 */   00001390
                                                                        00001400
    %PAGE;                                                              00001410
    /* ************************************************************ */  00001420
    /*                                                              */  00001430
    /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .     */  00001440
    /*       ---------------------------------------------------    */  00001450
    /*                                                              */  00001460
    /*                                                              */  00001470
    /*        INITIERER FORSKJELLIGE PARAMETRE .                    */  00001480
    /*                                                              */  00001490
    /* ************************************************************ */  00001500
                                                                        00001510
    W01_DATO_2000                        =       DATO_2000        ;     00001520
    PROGRAM_ID                           =      'R0015411'        ;     00001530
    UIBPTR                               =       UIB_PEKER        ;     00001540
                                                                        00001550
                                                                        00001560
    /* ************************************************************* */ 00001570
    /* OPPRYDDING AV ROOT                 .                          */ 00001580
    /* ************************************************************* */ 00001590
                                                                        00001600
                                                                        00001610
    DO   W02_I  =  1  TO  14;                                           00001620
                                                                        00001630
      IF B02.FNR  (W02_I)             >    0                       THEN 00001640
         DO;                                                            00001650
                                                                        00001660
            IF DIV_PARAM_OMR.KJØRINGS_TYPE  ^=   'S'      &             00001670
               STYRINGS_OMR .FUNKSJONSKODE  ^=   'E'               THEN 00001680
                                                                        00001690
               /* ************************************************** */ 00001700
               /*  NYE OPPL. INN I :  RF0PERSN  PINNTEKT  TILBERPO   */ 00001710
               /*  HVIS IKKE       : 'SATVIS KJØRING' ELLER FJERNING */ 00001720
               /* ************************************************** */ 00001730
               DO;                                                      00001740
                  SSA1_RF0PERSN.PKEY  =  B02.FNR(W02_I);                00001750
                                                                        00001760
                  CALL PLITDLI          (W02_PARM_CT_4,                 00001770
                                         W02_GHU,                       00001780
                                         RF1,                           00001790
                                         W01_IO,                        00001800
                                         SSA1_RF0PERSN);                00001810
                                                                        00001820
                  IF UIBFCTR        ^=   UIB_RC_OK         THEN         00001830
                     DO;                                                00001840
                        /* *************************************** */   00001850
                        /*   UAKSEPTABEL KODE FRA :    UIB         */   00001860
                        /* *************************************** */   00001870
  L100:                                                                 00001880
                        FEIL_MELD_NR   =   500;                         00001890
                        FEIL_VED_LABEL =  '100';                        00001900
                        GO TO    L999;                                  00001910
                     END;                                               00001920
                                                                        00001930
                                                                        00001940
                  W01_HJELPE_PTR    =   ADDR (B02.RF0PERSN (W02_I)) ;   00001950
                  W01_IO            =   W01_HJELPE_IO               ;   00001960
                                                                        00001970
                                                                        00001980
                  SELECT  (RF1.STATUS_KODE);                            00001990
                                                                        00002000
                     WHEN ('  ')                                        00002010
                        DO;                                             00002020
                           CALL PLITDLI           (W02_PARM_CT_3,       00002030
                                                   W02_REPL,            00002040
                                                   RF1,                 00002050
                                                   W01_IO);             00002060
                                                                        00002070
                           IF UIBFCTR          ^=  UIB_RC_OK     !      00002080
                              RF1.STATUS_KODE  ^=  '  '             THEN00002090
                              DO;                                       00002100
                                 /* ********************************* */00002110
                                 /* UAKSEPTABEL KODE FRA :  UIB       */00002120
                                 /*                 RF1.STATUS_KODE   */00002130
                                 /* ********************************* */00002140
  L110:                                                                 00002150
                                 FEIL_MELD_NR   =   500;                00002160
                                 FEIL_VED_LABEL =  '110';               00002170
                                 DB_STATUS_KODE =   RF1.STATUS_KODE;    00002180
                                 GO TO     L999;                        00002190
                              END;                                      00002200
                        END;                                            00002210
                                                                        00002220
                     WHEN ('GE')                                        00002230
                        DO;                                             00002240
                           /* ************************************** */ 00002250
                           /* DUMMY-ROT SKULLE VERT LAGET I R0013110 */ 00002260
                           /* ************************************** */ 00002270
  L120:                                                                 00002280
                           FEIL_MELD_NR         =    501;               00002290
                           FEIL_VED_LABEL       =   '120';              00002300
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;   00002310
                           GO TO     L999;                              00002320
                        END;                                            00002330
                                                                        00002340
                     OTHERWISE                                          00002350
                        DO;                                             00002360
                           /* ************************************* */  00002370
                           /*  UGYLDIG STATUSKODE FRA DLI           */  00002380
                           /* ************************************* */  00002390
  L130:                                                                 00002400
                           FEIL_MELD_NR         =    500;               00002410
                           FEIL_VED_LABEL       =   '130';              00002420
                           DB_STATUS_KODE       =    RF1.STATUS_KODE;   00002430
                           GO TO     L999;                              00002440
                        END;                                            00002450
                  END;     /*     SELECT  :   RF1.STATUS_KODE     */    00002460
                                                                        00002470
                                                                        00002480
               END;   /* DIV_PARAM.KJØRIN                         */    00002490
                                                                        00002500
         END;               /*         B02.FNR  (W02_I)  > 0      */    00002510
                                                                        00002520
    END;               /*     DO 1 TO 14                          */    00002530
                                                                        00002540
  L999:                                                                 00002550
                                                                        00002560
    EXEC CICS RETURN;                                                   00002570
  END  R001540;                                                         00002580
