 /*       SIST ENDRET 09/06-98 08.29.54 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 10.43.30 AV   HLA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R001NC07 - PROGRAM I PLI                                       */00000030
 /*    PROGRAMMERT AV SATISH 1991                                     */00000040
 /*HENSIKT:                                                           */00000050
 /*    SKRIVE PROSEDYRER FOR INNSETTING AV FORTEKSTER OG ATTRIBUTTER  */00000060
 /*TEKST_BARN:                                                        */00000070
 /*    SETTER INN FORTEKSTER OG ATTRIBUTTER I BARNEDELEN.             */00000080
 /*FJERN_TEKST_BARN:                                                  */00000090
 /*    SETTER 0 I LENGDEKODE FOR TEKSTER BARNEDEL OG BLANKE I         */00000100
 /*    TEKSTFELTET.                                                   */00000110
 %SKIP(3);                             /*  */                           00000120
 TEKST_BARN:                                                            00000130
   PROC;                                                                00000140
   DCL                                                                  00000150
      NOR_NUM CHAR(1) INIT('&');                                        00000160
                                                                        00000170
         S001NC1O.TFBXO = 'BARN ';                                      00000180
         S001NC1O.TFBNO     = 'FNR';                                    00000190
         S001NC1O.RBTXO     =                                           00000200
                        'BOR BARNET SAMMEN MED BEGGE FORELDRENE ? ';    00000210
                                                                        00000220
      CALL BLOKKERE_BARN;                                               00000230
      IF  F7S.BT_ANT > 0 THEN                                           00000240
          DO;                                                           00000250
             DO A = 1 TO F7S.BT_ANT;                                    00000260
                S001NC1O.FNR_BARNA (A)= NOR_NUM;                        00000270
                S001NC1O.RBTNA (A)    = DFHBMUNP;                       00000280
             END;                                                       00000290
          END;                                                          00000300
                                                                        00000310
      IF ^FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                     00000320
                        TRANS_OPPL_OMR.TRANS_RETURKODE THEN             00000330
         S001NC1I.FNR_BARNL(1) = CURSOR_POS;                            00000340
   END TEKST_BARN;                                                      00000350
 %PAGE;                                                                 00000360
                                       /* BLANKE I TEKSTFELT */         00000370
                                                                        00000380
 FJERN_TEKST_BARN:                                                      00000390
   PROC;                                                                00000400
      S001NC1O.TFBXO = '     ';                                         00000410
      S001NC1O.TFBNO = '            ';                                  00000420
      S001NC1O.RBTXO = (45)' ';                                         00000430
   END FJERN_TEKST_BARN;                                                00000440
                                                                        00000450
 BLOKKERE_BARN:                    /* ASKIP OG PROT    */               00000460
   PROC;                                                                00000470
      DO A = 1 TO 12;                                                   00000480
         S001NC1O.FNR_BARNA(A) = DFHBMASK;                              00000490
         S001NC1O.RBTNA (A)    = DFHBMASK;                              00000500
      END;                                                              00000510
   END BLOKKERE_BARN;                                                   00000520
 %SKIP(3);                             /*  */                           00000530
 TEKST_SØKER2:                                                          00000540
   PROC;                                                                00000550
   DCL                                                                  00000560
      NOR_NUM CHAR(1) INIT('&');                                        00000570
                                                                        00000580
      S001NC1O.TSBO  = 'SØKER';                                         00000590
      S001NC1O.TSB1O = 'PENSJ.INNT';                                    00000600
      S001NC1O.TSB2O = 'ARB. INNT ';                                    00000610
      S001NC1O.TEBO  = 'EKTEF';                                         00000620
      S001NC1O.TEB1O = 'PENSJ.INNT';                                    00000630
      S001NC1O.TEB2O = 'ARB. INNT ';                                    00000640
      S001NC1O.PIA        = NOR_NUM;                                    00000650
      S001NC1O.AIA        = NOR_NUM;                                    00000660
      S001NC1O.PI_EKA     = NOR_NUM;                                    00000670
      S001NC1O.AI_EKA     = NOR_NUM;                                    00000680
                                                                        00000690
      IF ^FEIL_FUNNET & TRANS_OPPL_OMR.TRANSKODE ^=                     00000700
                        TRANS_OPPL_OMR.TRANS_RETURKODE THEN             00000710
         S001NC1I.PIL        = CURSOR_POS;                              00000720
   END TEKST_SØKER2;                                                    00000730
 %PAGE;                                                                 00000740
                                       /* BLANKE I TEKSTFELT */         00000750
                                                                        00000760
 FJERN_TEKST_SØKER2:                                                    00000770
   PROC;                                                                00000780
      S001NC1O.TSBO = '     ';                                          00000790
      S001NC1O.TSB1O = '   ';                                           00000800
      S001NC1O.TSB2O = '   ';                                           00000810
      S001NC1O.TEBO = '     ';                                          00000820
      S001NC1O.TEB1O = '   ';                                           00000830
      S001NC1O.TEB2O = '   ';                                           00000840
   END FJERN_TEKST_SØKER2;                                              00000850
                                                                        00000860
