 /*   SIST ENDRET PÅ PROD   2005.07.14  8.31.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.07.08 12.38.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.07.20 11.12.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.20 11.09.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.19 11.46.31 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.16 13.59.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.12 13.39.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.27.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.14.49 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.34.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.08.18 14.48.16 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 14.34.18 AV   JDA7339          */        
 /*       SIST ENDRET 09/12-98 14.27.19 AV   JDA7339                  */        
 /*       SIST ENDRET 09/12-98 14.26.49 AV   JDA7339                  */        
 /*       SIST ENDRET 09/06-98 08.30.15 AV   SPA7339                  */        
 /*       SIST ENDRET 20/05-98 11.23.11 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /* ***************************************************************** */        
 /*               R 0 0 1 N 6 0 3                                     */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001N603  KONTROLL_U2_SØKER   SUBPROGRAM         */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : HERMAN                                           */        
 /*  PROGRAMMET BLE LAGET :     1991                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  FORETAR KONTROLL AV GRUNNBLANKETT U2 - SØKERDELEN.               */        
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */        
 /*                                                                   */        
 /*  FORETAR KONTROLL AV TILLEGGSBLANKETT YP.                         */        
 /*  RETURNERER FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RETT          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  PROGRAMMET INCLUDES AV R001N601 - KONTROLL_GRUNNBLANKETT_U2      */        
 /*  ARBEIDSOMRÅDET P001N601 ER INCLUDET I HOVEDPROG                  */        
 /*  BRUK :                                                           */        
 /*  CALL KONTROLL_U2_SØKER(FEIL_I_U2_SØKER);                         */        
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */        
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */        
 /*          R0019901 - F_GYLDIG_DATO                                 */        
 /*          R0019902 - F_KJØNN                                       */        
 /*          R0019903 - F_EK_ALDER                                    */        
 /*          R0019904 - F_GYLDIG_FNR                                  */        
 /*          R0019905 - F_ALDER                                       */        
 /*          R0019910 - F_NUMERISK                                    */        
 /*          R0019912 - F_FELT_PIC_CHAR11                             */        
 /*          R0019964 - F_6MDR                                        */        
 /*          VERIFY   - BUILTIN-FUNCTION                              */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*   FØDSELSNR-ENDRINGSREG. LESES VED EXEC LINK TIL R0019906.        */        
 /*   TKNR_TAB.LESES VED EXEC CICS READ DATASET.                      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*   MELDINGSNR LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM            */        
 /*   FEIL_FUNNET SETTES = '1'B.                                      */        
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDING PÅ SKJERMBILDET      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   MODULEN KONTROLLERER U2_SØKER, OG RETURNERER                    */        
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */        
 /*                                                                   */        
 /*ENDRET: 31.10.90 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */        
 /* ******                                                            */        
 /*    LEGGER INN KRYSS-KONTROLL PÅ PRIMÆR- OG SEKUNDÆR-DIAGNOSE.     */        
 /*    REF.==> KAP.18 DIAGNOSE-KODER.                                 */        
 /* ***************************************************************** */        
 KONTROLL_U2_SØKER:                                                             
   PROC (FEIL_FUNNET);                                                          
   DCL                                                                          
      FEIL_FUNNET     BIT (1);                                                  
   DCL                                                                          
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),                     
      KEY_PEKER                  POINTER,                                       
      TK_RECL                    CHAR (101);                                    
                                                                                
   DCL                                                                          
      01 W01_PRIM                CHAR(6);                                       
   DCL                                                                          
      01 W01_SEKU                CHAR(6);                                       
   DCL                                                                          
      01 W01_DIAG_PRIM DEF W01_PRIM,                                            
         10 FILLER               CHAR(4),                                       
         10 W01_REST_PRIM        CHAR(2);                                       
   DCL                                                                          
      01 W01_DIAG_SEKU DEF W01_SEKU,                                            
         10 FILLER               CHAR(4),                                       
         10 W01_REST_SEKU        CHAR(2);                                       
   DCL                                                                          
      01 W01_DIA_RECL,                                                          
         10 W01_DIA_RECL_KEY         CHAR(6);                                   
   DCL                                                                          
      W_FNR                                     PIC'(11)9';                     
   DCL                                                                          
      1 FNR13  ,                                                                
        2 DAG                                   PIC'(2)9',                      
        2 MND                                   PIC'(2)9',                      
        2 AAR                                   PIC'(4)9',                      
        2 ÅRHUNDRE                              PIC'9',                         
        2 REST                                  PIC'(4)9';                      
   DCL FNR13_DEF    DEF FNR13                   PIC'(13)9'; /*9812*/            
                                                                                
   DCL                                                                          
      W_FNR_EK                                  PIC'(11)9';                     
   DCL                                                                          
      1 FNR13_EK ,                                                              
        2 DAG                                   PIC'(2)9',                      
        2 MND                                   PIC'(2)9',                      
        2 AAR                                   PIC'(4)9',                      
        2 ÅRHUNDRE                              PIC'9',                         
        2 REST                                  PIC'(4)9';                      
   DCL FNR13_EK_DEF    DEF FNR13_EK        PIC'(13)9'; /*9812*/                 
   DCL                                                                          
      TT_E66_ÅMD                                PIC'(8)9';                      
   DCL                                                                          
      ALDER           FIXED DEC (5),                                            
      ALDERSGRENSE    FIXED DEC (5),    /*HL*/                                  
      IÅR             FIXED BIN (15),                                           
      J               FIXED BIN (15),                                           
      TELL            FIXED BIN (15);                                           
   DCL DATO            PIC '(8)9';                                              
   DCL                                                                          
      1 DAGENS_DATO   DEF DATO,                                                 
        2 ÅR          PIC'9999',                                                
        2 MN          PIC'99',                                                  
        2 DG          PIC'99';                                                  
   DCL                                                                          
      DAGENS_DATO_ÅMD DEF DATO POS(1) PIC'(8)9';                                
                                                                                
 /*  HJELPE DCL FOR Å SNU DATO           */                                     
                                                                                
   DCL                                                                          
      HJ_VIRK_DATO_ÅMD                       PIC '99999999',                    
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅMD POS(1) PIC '9999',                       
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅMD POS(5) PIC '99',                         
                                                                                
      HJ_UFT_ÅMD                             PIC '99999999',                    
      UFT_Å DEF HJ_UFT_ÅMD POS(1)            PIC '9999',                        
      UFT_M DEF HJ_UFT_ÅMD POS(5)            PIC '99';                          
                                                                                
                                                                                
   DCL  W603_DIAG                   CHAR (6)    INIT ('      '),                
        W603_D_P DEF W603_DIAG      PIC '(6)9'  POS  ( 1)      ,                
        W603_S12 DEF W603_DIAG      CHAR ( 2)   POS  ( 1)      ,                
        W603_KEY DEF W603_DIAG      CHAR ( 5)   POS  ( 1)      ,                
        W603_S6  DEF W603_DIAG      CHAR ( 1)   POS  ( 6)      ,                
                                                                                
        W603_DIAG_LENGTH     FIXED  BIN  (15)   INIT ( 6)      ,                
        W603_KEY_LENGTH      FIXED  BIN  (15)   INIT ( 5)      ,                
                                                                                
        W603_KAP18                  BIT  ( 1)                  ;                
                                                                                
   DCL                                                                          
      1 FNR_REG,                                                                
        2 FNR1      FIXED DEC(11),                                              
        2 FNR2      FIXED DEC(11),                                              
        2 BRUKERID  CHAR     ( 4);                                              
   DCL TT_FRA37_M              FIXED DEC (3);                                   
   DCL TT_FRA37_Å              FIXED DEC (5);                                   
   DCL TT_HJELP_M              FIXED DEC (3);                                   
                                                                                
                                                                                
                                                                                
 /*LOVENDRING MED VIRKNING FRA 1.1.91 SP : */                                   
    DIV_PARAM_OMR.REGN_1291 = ' ';                                              
                                                                                
    FNR_REG.BRUKERID =  DIV_PARAM_OMR.CICS_IND;                                 
    DATO             =  DATO_2000      ;                                        
    FEIL_FUNNET      =  '0'B           ;                                        
    KEY_PEKER        =  ADDR (U2S.TKNR);                                        
                                                                                
    HJ_VIRK_DATO_ÅMD = U2S.VIRK_DATO_ÅMD;                                       
                                                                                
 /*MIDLERTIDIG STOPP AV ALLE FORSØRGINGSTI_ÅMDLLEGG - HL 26.3.91 */             
                                                                                
   IF HJ_VIRK_DATO_ÅMD < 19930800 & (U2S.SIVILSTAND = 'P') THEN                 
      DO;                                                                       
         FEIL_FUNNET = '1'B;                                                    
         U2S.SIVILSTANDNR = 388;                                                
      END;                                                                      
   IF HJ_VIRK_DATO_ÅMD < 19940100 & (U2S.SIVILSTAND = 'W') THEN                 
      DO;                                                                       
         FEIL_FUNNET = '1'B;                                                    
         U2S.SIVILSTANDNR = 389;                                                
      END;                                                                      
                                                                                
    W01_PRIM         = U2S.PRIMDIAG;                                            
    W01_SEKU         = U2S.SEKUDIAG;                                            
                                                                                
    IF VERIFY(U2S.ATT_UF,'AU') ^= 0 THEN                                        
                                                                                
       DO;                                                                      
          FEIL_FUNNET  = '1'B;                                                  
          U2S.ATT_UFNR = 268;                                                   
       END;                                                                     
    IF ^F_NUMERISK((U2S.FNR)) THEN                                              
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.FNRNR   = 200;                                                    
       END;                                                                     
    ELSE                                                                        
       IF ^F_GYLDIG_FNR(U2S.FNR) THEN                                           
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U2S.FNRNR   = 1;                                                   
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
             FNR_REG.FNR1 = U2S.FNR;                                            
             W_FNR        = U2S.FNR;                                            
             EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);              
             IF FNR_REG.FNR2 > 0 THEN                                           
                DO;                                                             
                   U2S.FNRNR   = 203;                                           
                   U2S.FNR_GML = U2S.FNR;                                       
                   U2S.FNR     = FNR_REG.FNR2;                                  
                END;                                                            
          END;                                                                  
                                                                                
 /* FNR13 = KONV_FNR11_FNR13(U2S.FNR);           Y2K*/                          
    FNR13_DEF = KONV_FNR11_FNR13(U2S.FNR);         /*9812*/                     
                                                                                
    IF U2S.NAVN = (25)' ' THEN                                                  
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.NAVNNR  = 2;                                                      
       END;                                                                     
    IF VERIFY(U2S.SPRÅK,'NBE ') ^= 0 THEN                                       
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.SPRÅKNR = 6;                                                      
       END;                                                                     
    IF ^ F_NUMERISK(F_FELT_PIC_CHAR4(U2S.TKNR)) THEN                            
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.TKNRNR  = 200;                                                    
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND);                          
            EXEC CICS READ DATASET ('TKNRTAB') RIDFLD(KEY_BIT)                  
                                               INTO(TK_RECL);                   
            LEAVE;                                                              
        NOTFND:                                                                 
            FEIL_FUNNET = '1'B;                                                 
            U2S.TKNRNR  = 3;                                                    
       END;                                                                     
                                                                                
    /* ************************************************** */                    
    /* KONTROLL AV ACF2 FOR TILLGANGE TIL TKNR            */                    
    /*                                                    */                    
          /* ************************************************** */              
    BO_TKNR  = TKNR;                                                            
     CALL ATK_TILGANG_KONTROLL;                                                 
                                                                                
                                                                                
    IF VERIFY(U2S.SIVILSTAND,'GASUEPW') ^= 0 THEN                               
       DO;                                                                      
          FEIL_FUNNET      = '1'B;                                              
          U2S.SIVILSTANDNR = 5;                                                 
       END;                                                                     
                                                                                
    IF ^(U2S.TILL_EK = 'J' ! U2S.TILL_EK = ' ') THEN                            
       DO;                                                                      
          FEIL_FUNNET   ='1'B;                                                  
          U2S.TILL_EKNR = 4;                                                    
       END;                                                                     
                                                                                
  /* ******************************************************** */                
  /* TILLEGG FOR EKTEFELLE SKAL OGSÅ AVVISES HVIS UFØREGRADEN */                
  /* ER UNDER 50 PROSENT.  GJELDER YRKESSKADETILFELLENE.      */                
  /* ERIK 19.1.88.                                            */                
  /* ******************************************************** */                
                                                                                
         IF U2S.UFG < 50 &                                                      
            U2S.TILL_EK = 'J' THEN                                              
            DO;                                                                 
               FEIL_FUNNET = '1'B;                                              
               U2S.TILL_EKNR = 303;                                             
               U2S.UFGNR     = 999;                                             
            END;                                                                
                                                                                
  /* ******************************************************** */                
  /* ERIK 19.1.88.                                            */                
  /* ******************************************************** */                
                                                                                
    IF VERIFY(U2S.NORSK_BOSATT,'JN') ^= 0 THEN                                  
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U2S.NORSK_BOSATTNR = 8;                                               
       END;                                                                     
    ELSE                                                                        
    IF U2S.NORSK_BOSATT = 'J'    THEN                                           
       DO;                                                                      
                                                                                
          HJ_UFT_ÅMD  = U2S.UFT_ÅMD  ;                                          
          TT_FRA37_M  = (UFT_Å -(FNR13.AAR + 16 ))* 12                          
                         + UFT_M - FNR13.MND ;                                  
          TT_FRA37_Å  = TT_FRA37_M / 12 ;                                       
          TT_HJELP_M  = TT_FRA37_Å * 12;                                        
                                                                                
          U2SP.TT_FRA1937_ÅR  = TT_FRA37_Å;                                     
          U2SP.TT_FRA1937_MND = TT_FRA37_M - TT_HJELP_M;                        
       END;                                                                     
    IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U2S.BT_ANT)) THEN                           
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.BT_ANTNR = 200;                                                   
       END;                                                                     
    ELSE                                                                        
       IF U2S.BT_ANT > 12 THEN                                                  
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U2S.BT_ANTNR = 7;                                                  
          END;                                                                  
                                                                                
                                                                                
          IF ^(U2S.YSKADE_TILLEGG = 'J' ! U2S.YSKADE_TILLEGG = ' ')             
             THEN                                                               
                DO;                                                             
                   FEIL_FUNNET   ='1'B;                                         
                   U2S.YSKADE_TILLEGGNR = 300;                                  
                END;                                                            
                                                                                
                                                                                
  /* DERSOM VP_ÅR1 ER NULL NOEN AV DE ANDRE UTFYLT, NULLES DISSE  */            
                                                                                
    DO J = 1 TO 4 UNTIL(F_FELT_PIC_CHAR4(U2S.VP_ÅR(J) = '0000'));               
       IF F_FELT_PIC_CHAR4(U2S.VP_ÅR(J)) = '0000' THEN                          
          DO TELL            = J TO 4;                                          
             U2S.VP_ÅR(TELL) = 0;                                               
          END;                                                                  
    END;                                                                        
    DO IÅR = 1 TO 4 WHILE (F_FELT_PIC_CHAR4(U2S.VP_ÅR(IÅR)) ^= '0000');         
       IF ^F_NUMERISK(F_FELT_PIC_CHAR4(U2S.VP_ÅR(IÅR))) THEN                    
          DO;                                                                   
             FEIL_FUNNET      = '1'B;                                           
             U2S.VP_ÅRNR(IÅR) = 200;                                            
          END;                                                                  
       ELSE                                                                     
          IF ^(U2S.VP_ÅR(IÅR) > 1966 &                                          
               U2S.VP_ÅR(IÅR) <= DAGENS_DATO.ÅR) !                              
               U2S.VP_ÅR(IÅR) < (FNR13.AAR + 17)     THEN                       
             DO;                                                                
                FEIL_FUNNET      = '1'B;                                        
                U2S.VP_ÅRNR(IÅR) = 47;                                          
             END;                                                               
    END;                                                                        
    IF ^F_NUMERISK(F_FELT_PIC_CHAR1(U2S.UTDANNING)) THEN                        
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.FNRNR   = 352;                                                    
       END;                                                                     
    ELSE                                                                        
    IF VERIFY(U2S.UTDANNING,'123') ^= 0 THEN                                    
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U2S.UTDANNINGNR    = 352;                                             
       END;                                                                     
    IF ^(U2S.VILKÅR_8_4_3A = 'J' ! U2S.VILKÅR_8_4_3A = 'N') THEN                
       DO;                                                                      
          FEIL_FUNNET      = '1'B;                                              
          U2S.VILKÅR_8_4_3ANR = 45;                                             
       END;                                                                     
    IF ^F_NUMERISK(F_FELT_PIC_CHAR3((U2S.UFG))) THEN                            
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.UFGNR   = 200;                                                    
       END;                                                                     
    ELSE                                                                        
 /* ********************************************************* */                
 /* HER KOMMER YRKESSKADEPENSJONENE.  ERIK 8.9.87             */                
 /* SKAL GODTA F.O.M 15 %                                     */                
 /* ********************************************************* */                
 /* ********************************************************* */                
 /* VI SKAL GODTA BLANK I UFG, DERSOM 'J' I YSKADE_TILLEGG.   */                
 /* TRUDE 14.6.88                                             */                
 /* ********************************************************* */                
                                                                                
        IF (U2S.YSKADE_TILLEGG = 'J') & ^(                                      
            U2S.UFG = 15 ! U2S.UFG = 20 ! U2S.UFG = 25 ! U2S.UFG = 30 !         
            U2S.UFG = 35 ! U2S.UFG = 40 ! U2S.UFG = 45 !                        
            U2S.UFG = 50 ! U2S.UFG = 55 ! U2S.UFG = 60 ! U2S.UFG = 65 !         
            U2S.UFG = 70 ! U2S.UFG = 75 ! U2S.UFG = 80 ! U2S.UFG = 85 !         
            U2S.UFG = 90 ! U2S.UFG = 95 ! U2S.UFG = 100 !                       
                                          U2S.UFG = 0   )  THEN                 
            DO;                                                                 
               FEIL_FUNNET = '1'B;                                              
               U2S.UFGNR   = 350;                                               
            END;                                                                
        ELSE                                                                    
          IF ^(U2S.YSKADE_TILLEGG = 'J') & ^(                                   
            U2S.UFG = 50 ! U2S.UFG = 55 ! U2S.UFG = 60 ! U2S.UFG = 65 !         
            U2S.UFG = 70 ! U2S.UFG = 75 ! U2S.UFG = 80 ! U2S.UFG = 85 !         
            U2S.UFG = 90 ! U2S.UFG = 95 ! U2S.UFG = 100) THEN                   
            DO;                                                                 
               FEIL_FUNNET = '1'B;                                              
               U2S.UFGNR   = 38;                                                
            END;                                                                
    IF ^F_NUMERISK(F_FELT_PIC_CHAR8((U2S.UFT_ÅMD))) THEN                        
       DO;                                                                      
          FEIL_FUNNET  = '1'B;                                                  
          U2S.UFT_ÅMDNR = 200;                                                  
       END;                                                                     
    ELSE                                                                        
       IF ^F_GYLDIG_DATO(U2S.UFT_ÅMD) THEN                                      
          DO;                                                                   
             FEIL_FUNNET  = '1'B;                                               
             U2S.UFT_ÅMDNR = 40;                                                
          END;                                                                  
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U2S.PI)) THEN                               
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.PINR    = 200;                                                    
       END;                                                                     
    IF VERIFY(U2S.YRKESM_ATTF,'JN ') ^= 0 THEN                                  
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U2S.YRKESM_ATTFNR  = 353;                                             
       END;                                                                     
    IF U2S.YRKESM_ATTF = 'N'       THEN                                         
       U2S.YRKESM_ATTF = ' ';                                                   
    IF ^F_NUMERISK(F_FELT_PIC_CHAR2(U2S.YRKE)) THEN                             
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2S.YRKENR  = 200;                                                    
       END;                                                                     
    ELSE                                                                        
       IF ^ (U2S.YRKE >= 0 & U2S.YRKE <= 19) ! U2S.YRKE = 8 THEN                
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U2S.YRKENR  = 42;                                                  
          END;                                                                  
                                                                                
    W603_KAP18        = '0'B;                                                   
                                                                                
    IF U2S.PRIMDIAG  ^= '      '  &                                             
       W01_REST_PRIM ^= 'XX'      THEN                                          
       DO;                                                                      
          /*-------------------------------------------------------*/           
          /* SJEKKER OM GYLDIG DIAGNOSE-KODE MOT DIAGNOSE-FILEN    */           
          /* SJEKKER OM PRIMÆRDIAGNOSE ER INNEFOR DE INTERVALLER   */           
          /* SOM KREVER SEK.DIAG FRA KAP.18                        */           
          /*-------------------------------------------------------*/           
                                                                                
          EXEC CICS HANDLE CONDITION         NOTFND (NOTFND1);                  
          EXEC CICS READ DATASET ('DIAGNOS') RIDFLD (U2S.PRIMDIAG)              
                                             INTO   (W01_DIA_RECL);             
                                                                                
          IF VERIFY (U2S.PRIMDIAG , '0123456789')  = 0 THEN                     
             DO;                                                                
                W603_DIAG         =  U2S.PRIMDIAG;                              
                                                                                
                IF (W603_D_P     >=  905000  &                                  
                    W603_D_P     <=  909900   )  !                              
                   (W603_D_P     >=  998000  &                                  
                    W603_D_P     <=  998901   )      THEN                       
                                                                                
                    W603_KAP18    = '1'B;                                       
             END;                                                               
       END;                                                                     
                                                                                
    GOTO DIAG_UT1;                                                              
                                                                                
 NOTFND1:                                                                       
    FEIL_FUNNET        = '1'B;                                                  
    U2S.PRIMDIAGNR     =  43;                                                   
                                                                                
 DIAG_UT1:                                                                      
    IF U2S.SEKUDIAG   ^= '      ' &                                             
       W01_REST_SEKU  ^= 'XX'     THEN                                          
       DO;                                                                      
          W603_DIAG    =  U2S.SEKUDIAG;                                         
                                                                                
          IF W603_KAP18                       THEN                              
             DO;                                                                
                IF (W603_S12 ^=   'E9'     &                                    
                    W603_S12 ^=   'E8'      ) !                                 
                                                                                
                   VERIFY (W603_S6,'123456789') > 0 THEN                        
                   DO;                                                          
                      FEIL_FUNNET    = '1'B;                                    
                      U2S.SEKUDIAGNR =  295;                                    
                   END;                                                         
                                                                                
                ELSE DO;                                                        
                      /*-----------------------------------------*/             
                      /* OPPSLAG MED SIFFER 1-5 I DIAGNOSE KAP18 */             
                      /*-----------------------------------------*/             
                                                                                
                      EXEC CICS HANDLE  CONDITION   NOTFND (NOTFND2);           
                      EXEC CICS READ    DATASET   ('DIAGNOS' )                  
                                        RIDFLD    ( W603_KEY )                  
                                        INTO      ( W01_DIA_RECL)               
                                        LENGTH    ( W603_DIAG_LENGTH)           
                                        KEYLENGTH ( W603_KEY_LENGTH )           
                                        GENERIC                                 
                                        EQUAL;                                  
                      GOTO DIAG_UT2;                                            
                   END;                                                         
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                /*-----------------------------------------------*/             
                /* PRIM DIAG ULIK KAP18. SJEKKER OM SEKU DIAG =  */             
                /*-----------------------------------------------*/             
                IF W603_S12  =   'E9'     !                                     
                   W603_S12  =   'E8'                THEN                       
                   DO;                                                          
                      FEIL_FUNNET    = '1'B;                                    
                      U2S.SEKUDIAGNR =  296;                                    
                      GOTO DIAG_UT2;                                            
                   END;                                                         
                                                                                
             END;                                                               
                                                                                
          EXEC CICS HANDLE CONDITION NOTFND(NOTFND2);                           
          EXEC CICS READ DATASET ('DIAGNOS') RIDFLD (U2S.SEKUDIAG)              
                                             INTO   (W01_DIA_RECL);             
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          /*--------------------------------------------------------*/          
          /* SEKU DIAG IKKE REG. SJEKKER OM PRIM DIAG =  KAP18-KODE */          
          /*--------------------------------------------------------*/          
          IF W603_KAP18                              THEN                       
             DO;                                                                
                FEIL_FUNNET          = '1'B;                                    
                U2S.SEKUDIAGNR       =  297;                                    
             END;                                                               
       END;                                                                     
                                                                                
    GOTO DIAG_UT2;                                                              
                                                                                
 NOTFND2:                                                                       
    FEIL_FUNNET        = '1'B;                                                  
    U2S.SEKUDIAGNR     = 44;                                                    
                                                                                
 DIAG_UT2:                                                                      
                                                                                
    IF ^F_NUMERISK(F_FELT_PIC_CHAR8((U2S.VIRK_DATO_ÅMD))) THEN                  
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U2S.VIRK_DATO_ÅMDNR = 200;                                            
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          IF ^F_GYLDIG_DATO(U2S.VIRK_DATO_ÅMD) THEN                             
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U2S.VIRK_DATO_ÅMDNR = 9;                                        
             END;                                                               
          ELSE                                                                  
          IF HJ_VIRK_DATO_ÅMD < 19910100 THEN                                   
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U2S.VIRK_DATO_ÅMDNR = 364;                                      
             END;                                                               
       END;                                                                     
    IF F_FELT_PIC_CHAR11(U2S.FNR_EK) ^= (11)'0' THEN                            
       DO;                                                                      
          IF ^F_NUMERISK(F_FELT_PIC_CHAR11(U2S.FNR_EK)) THEN                    
             DO;                                                                
                FEIL_FUNNET  = '1'B;                                            
                U2S.FNR_EKNR = 200;                                             
             END;                                                               
          ELSE                                                                  
          IF ^F_GYLDIG_FNR(U2S.FNR_EK) THEN                                     
             DO;                                                                
                FEIL_FUNNET  = '1'B;                                            
                U2S.FNR_EKNR = 1;                                               
             END;                                                               
          ELSE                                                                  
             DO;                                                                
                FNR_REG.FNR1 = U2S.FNR_EK;                                      
                EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);           
                IF FNR_REG.FNR2 > 0 THEN                                        
                   DO;                                                          
                      U2S.FNR_EKNR   = 203;                                     
                      U2S.FNR_GML_EK = U2S.FNR_EK;                              
                      U2S.FNR_EK     = FNR_REG.FNR2;                            
                   END;                                                         
             END;                                                               
       FNR13_EK_DEF  = KONV_FNR11_FNR13(U2S.FNR_EK); /*Y2K*/                    
                                                                                
          IF U2S.MINST4G = 'J' THEN                                             
             DO;                                                                
                IF  U2S.SIVILSTAND ^= 'G' THEN                                  
                    DO;                                                         
                       FEIL_FUNNET = '1'B;                                      
                       U2S.SIVILSTANDNR = 274;                                  
                    END;                                                        
             END;                                                               
          ELSE                                                                  
             IF U2S.MINST4G  ^= 'N' THEN                                        
                DO;                                                             
                   FEIL_FUNNET = '1'B;                                          
                   U2S.MINST4GNR = 272;                                         
                END;                                                            
       END;                                                                     
                                                                                
 /* HER SETTES VERDIER INN I MENY_OMR                                 */        
                                                                                
    FØDSNUMMER    = U2S.FNR;                                                    
    VIRKNINGSDATO_ÅMD = U2S.VIRK_DATO_ÅMD;                                      
                                                                                
 /*   KRYSS KONTROLLER       */                                                 
                                                                                
    IF ^FEIL_FUNNET THEN                                                        
       DO;                                                                      
          HJ_UFT_ÅMD      = U2S.UFT_ÅMD;                                        
          ALDER           = F_ALDER(U2S.FNR,U2S.UFT_ÅMD);                       
                                                                                
                                                                                
 /*LOVENDRING MED VIRKNING FRA 1.1.91 SP : */                                   
          IF  HJ_VIRK_DATO_ÅMD > 19920000 &                                     
              HJ_UFT_ÅMD      <  19920000     THEN                              
                                                                                
               DIV_PARAM_OMR.REGN_1291 = 'J';                                   
                                                                                
             /* TRUDE 08.07.05  GIKK AN Å REG PI VED ALDER < 17 ÅR */           
          IF U2S.PI   > 0 &                                                     
             ALDER    < 1800 THEN                                               
              DO;                                                               
                 FEIL_FUNNET = '1'B;                                            
                 U2S.PINR      = 252;                                           
              END;                                                              
                                                                                
                                                                                
                                                                                
          W_FNR_EK       = U2S.FNR_EK;                                          
                                                                                
          IF ALDER < 1600 THEN                                                  
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U2S.UFT_ÅMDNR = 196;                                            
             END;                                                               
          IF HJ_UFT_ÅMD > DAGENS_DATO_ÅMD   THEN                                
             DO;                                                                
                FEIL_FUNNET = '1'B;                                             
                U2S.UFT_ÅMDNR = 206;                                            
             END;                                                               
          ELSE;                                                                 
          ALDER           = F_ALDER(U2S.FNR,U2S.VIRK_DATO_ÅMD);                 
  /*        FJERNET 15.3.00                                                     
          IF F_KJØNN(U2S.FNR) = 'K' THEN                                        
             DO IÅR = 1 TO 2;                                                   
                IF U2S.VP_ÅR(IÅR) > 0 THEN                                      
                   DO;                                                          
                      FEIL_FUNNET      = '1'B;                                  
                      U2S.VP_ÅRNR(IÅR) = 47;                                    
                      U2S.FNRNR        = 999;                                   
                   END;                                                         
             END;                                                               
 **************** */                                                            
          IF ^FEIL_FUNNET & U2S.VP_ÅR(1) > 0 & U2S.VP_ÅR(2) > 0 &               
                                       U2S.VP_ÅR(1) = U2S.VP_ÅR(2) THEN         
             DO;                                                                
                FEIL_FUNNET    = '1'B;                                          
                U2S.VP_ÅRNR(1) = 124;                                           
                U2S.VP_ÅRNR(2) = 999;                                           
             END;                                                               
                                                                                
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U2S.INNTEKT_FØR_UP)) THEN                   
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U2S.INNTEKT_FØR_UPNR = 200;                                           
       END;                                                                     
                                                                                
    IF U2S.INNTEKT_FØR_UP > 0 & U2S.ATT_UF = 'A' THEN                           
       DO;                                                                      
          FEIL_FUNNET        = '1'B;                                            
          U2S.INNTEKT_FØR_UPNR = 399;   /* JD 02.97 */                          
       END;                                                                     
          IF HJ_UFT_ÅMD > HJ_VIRK_DATO_ÅMD THEN                                 
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U2S.UFT_ÅMDNR      = 41;                                        
                U2S.VIRK_DATO_ÅMDNR = 999;                                      
             END;                                                               
          ELSE                                                                  
          IF ^ F_6MDR(HJ_VIRK_DATO_ÅMD)         THEN                            
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U2S.VIRK_DATO_ÅMDNR = 205;                                      
             END;                                                               
          ELSE                                                                  
          IF ALDER < 1600 THEN                                                  
             DO;                                                                
                FEIL_FUNNET        = '1'B;                                      
                U2S.FNRNR          = 50;                                        
                U2S.VIRK_DATO_ÅMDNR = 999;                                      
             END;                                                               
           ELSE                                                                 
           IF ALDER > 6701 THEN                 /*7.3.91 HL */                  
              DO;                                                               
                 FEIL_FUNNET        = '1'B;                                     
                 U2S.FNRNR          = 52;                                       
                 U2S.VIRK_DATO_ÅMDNR = 999;                                     
              END;                                                              
           ELSE                                                                 
           IF U2S.SIVILSTAND = 'P'  &                                           
             (U2S.FNR_EK > 0 & F_KJØNN(U2S.FNR)                                 
                                 ^= F_KJØNN(U2S.FNR_EK))THEN                    
              DO;                                                               
                 FEIL_FUNNET  = '1'B;                                           
                 U2S.FNRNR    = 392;                                            
                 U2S.FNR_EKNR = 999;                                            
              END;                                                              
           ELSE                                                                 
           IF U2S.SIVILSTAND ^= 'P'  &                                          
             (U2S.FNR_EK > 0 & F_KJØNN(U2S.FNR)                                 
                                  = F_KJØNN(U2S.FNR_EK))THEN                    
              DO;                                                               
                 FEIL_FUNNET  = '1'B;                                           
                 U2S.FNRNR    = 16;                                             
                 U2S.FNR_EKNR = 999;                                            
              END;                                                              
            ELSE                                                                
            IF ^(U2S.SIVILSTAND = 'G' ! U2S.SIVILSTAND = 'A' !                  
                 U2S.SIVILSTAND = 'W' ! U2S.SIVILSTAND = 'P') &                 
            (U2S.FNR_EK > 0 ! U2S.NAVN_EK ^= (25)' ') THEN                      
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  U2S.SIVILSTANDNR = 123;                                       
                  U2S.FNR_EKNR = 999;                                           
                  U2S.NAVN_EKNR = 999;                                          
               END;                                                             
            ELSE                                                                
            IF U2S.FNR_EK > 0 & U2S.NAVN_EK = (25)' ' THEN                      
               DO;                                                              
                  FEIL_FUNNET = '1'B;                                           
                  U2S.NAVN_EKNR = 118;                                          
               END;                                                             
            ELSE                                                                
            IF U2S.TILL_EK = 'J' THEN                                           
               DO;                                                              
                  IF U2S.NAVN_EK = (25)' ' THEN                                 
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        U2S.NAVN_EKNR = 19;                                     
                        U2S.TILL_EKNR = 999;                                    
                     END;                                                       
                  ELSE                                                          
                  IF U2S.FNR_EK = 0 THEN                                        
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        U2S.FNR_EKNR = 15;                                      
                        U2S.TILL_EKNR = 999;                                    
                     END;                                                       
                                                                                
                  ELSE                                                          
                  IF ^(U2S.SIVILSTAND = 'G' ! U2S.SIVILSTAND = 'A' !            
                       U2S.SIVILSTAND = 'W' ! U2S.SIVILSTAND = 'P') THEN        
                     DO;                                                        
                        FEIL_FUNNET = '1'B;                                     
                        U2S.SIVILSTANDNR = 54;                                  
                        U2S.TILL_EKNR = 999;                                    
                     END;                                                       
               END;                                                             
            ELSE                                                                
               DO;                                                              
               IF (U2S.FNR_EK = 0 ! U2S.NAVN_EK = (25)' ') &                    
               (U2S.SIVILSTAND = 'G' ! U2S.SIVILSTAND = 'A') THEN               
                  DO;                                                           
                     FEIL_FUNNET = '1'B;                                        
                     U2S.FNR_EKNR = 18;                                         
                     U2S.NAVN_EKNR = 999;                                       
                     U2S.SIVILSTANDNR = 999;                                    
                  END;                                                          
               IF (U2S.FNR_EK = 0 ! U2S.NAVN_EK = (25)' ') &                    
               (U2S.SIVILSTAND = 'W') THEN                                      
                  DO;                                                           
                     FEIL_FUNNET = '1'B;                                        
                     U2S.FNR_EKNR = 390;                                        
                     U2S.NAVN_EKNR = 999;                                       
                     U2S.SIVILSTANDNR = 999;                                    
                  END;                                                          
               IF (U2S.FNR_EK = 0 ! U2S.NAVN_EK = (25)' ') &                    
               (U2S.SIVILSTAND = 'P') THEN                                      
                  DO;                                                           
                     FEIL_FUNNET = '1'B;                                        
                     U2S.FNR_EKNR = 391;                                        
                     U2S.NAVN_EKNR = 999;                                       
                     U2S.SIVILSTANDNR = 999;                                    
                  END;                                                          
               END;                                                             
         END;                                                                   
   END KONTROLL_U2_SØKER;                                                       
                                                                                
                                                                                
   KONTROLL_YP_U2:                                                              
   PROC(FEIL_FUNNET);                                                           
                                                                                
     DCL FEIL_FUNNET   BIT(1);                                                  
                                                                                
                                                                                
     IF ^(U2Y.VILKÅR_1_2_2A = 'J' ! U2Y.VILKÅR_1_2_2A = ' ')  THEN              
        DO;                                                                     
           FEIL_FUNNET   ='1'B;                                                 
           U2Y.VILKÅR_1_2_2ANR = 301;                                           
        END;                                                                    
                                                                                
                                                                                
     IF ^(U2Y.VILKÅR_1_2_2B = 'J' ! U2Y.VILKÅR_1_2_2B = ' ')   THEN             
         DO;                                                                    
            FEIL_FUNNET   ='1'B;                                                
            U2Y.VILKÅR_1_2_2BNR = 302;                                          
         END;                                                                   
                                                                                
     IF ^F_NUMERISK(U2Y.YST_ÅMD) THEN                                           
        DO;                                                                     
           FEIL_FUNNET    = '1'B;                                               
           U2Y.YST_ÅMDNR = 200;                                                 
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           IF ^F_GYLDIG_DATO(U2Y.YST_ÅMD) THEN                                  
              DO;                                                               
                 FEIL_FUNNET    = '1'B;                                         
                 U2Y.YST_ÅMDNR = 304;                                           
              END;                                                              
           ELSE                                                                 
           IF U2Y.YST_ÅMD  < 19710100 THEN                                      
              DO;                                                               
                 FEIL_FUNNET    = '1'B;                                         
                 U2Y.YST_ÅMDNR = 305;                                           
              END;                                                              
       END;                                                                     
                                                                                
       IF ^(U2Y.YSYKDOM = 'J' ! U2Y.YSYKDOM = 'N')    THEN                      
           DO;                                                                  
              FEIL_FUNNET   ='1'B;                                              
              U2Y.YSYKDOMNR = 306;                                              
           END;                                                                 
                                                                                
       IF ^F_NUMERISK(F_FELT_PIC_CHAR3(U2Y.YUG)) THEN                           
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U2Y.YUGNR = 200;                                                   
          END;                                                                  
       ELSE                                                                     
                                                                                
                                                                                
       IF U2Y.YUG < 15 ! U2Y.YUG > 100 THEN                                     
          DO;                                                                   
             FEIL_FUNNET = '1'B;                                                
             U2Y.YUGNR = 307;                                                   
          END;                                                                  
                                                                                
 /* ********************************************************* */                
 /* VI SKAL GODTA BLANK I UFG, DERSOM 'J' I YSKADE_TILLEGG.   */                
 /* TRUDE 14.6.88                                             */                
 /* ********************************************************* */                
                                                                                
                                                                                
    IF  U2Y.KAP_11_7_UTLØST = 'J'          THEN                                 
               DIV_PARAM_OMR.REGN_1291 = ' ';                                   
    ELSE                                                                        
    IF ^(U2Y.KAP_11_7_UTLØST = ' ') THEN                                        
        DO;                                                                     
           FEIL_FUNNET   ='1'B;                                                 
           U2Y.KAP_11_7_UTLØSTNR = 308;                                         
        END;                                                                    
                                                                                
    IF VERIFY(U2Y.YRKE11,'FMUEVSA') ^= 0 THEN                                   
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2Y.YRKE11NR =  309 ;                                                 
       END;                                                                     
   /*                                                                           
    IF ^F_NUMERISK(F_FELT_PIC_CHAR7(U2Y.AÅI)) THEN                              
       DO;                                                                      
          FEIL_FUNNET = '1'B;                                                   
          U2Y.AÅINR = 200 ;                                                     
       END;                                                                     
   */                                                                           
    IF F_FELT_PIC_CHAR11(U2Y.FNR_EK) ^= (11) '0' THEN                           
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U2Y.FNR_EKNR        = 315 ;                                           
       END;                                                                     
                                                                                
    IF F_FELT_PIC_CHAR11(U2Y.FNR_SAMBOER) ^= (11) '0' THEN                      
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U2Y.FNR_SAMBOERNR   = 315 ;                                           
       END;                                                                     
                                                                                
    IF F_FELT_PIC_CHAR11(U2Y.FNR_Y_BARN) ^= (11) '0' THEN                       
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U2Y.FNR_Y_BARNNR    =  315 ;                                          
       END;                                                                     
    /* TEST PAA FEILNR 317 LAGT INN 0197 AV JD*/                                
    IF U2S.UFG < U2Y.YUG              THEN                                      
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U2Y.FNR_Y_BARNNR    =  317 ;                                          
       END;                                                                     
                                                                                
    IF U2Y.PLEIEBARN ^= ' '  THEN                                               
       DO;                                                                      
          FEIL_FUNNET         = '1'B;                                           
          U2Y.PLEIEBARNNR     = 315 ;                                           
       END;                                                                     
                                                                                
    IF ^FEIL_FUNNET THEN                                                        
       DO;                                                                      
                                                                                
          IF U2Y.YST_ÅMD  >  U2S.VIRK_DATO_ÅMD  !                               
             U2Y.YST_ÅMD  >  U2S.UFT_ÅMD              THEN                      
             DO;                                                                
                                                                                
        /* ********************************************************** */        
        /* FEIL,YSKADETIDSPUNKTET > VIRK ELLER > UFØRETIDSPUNKTET     */        
        /* PÅ KAP.8 - BLANKETTEN.  ERIK 6.7.87                        */        
        /* ********************************************************** */        
                                                                                
                  FEIL_FUNNET    = '1'B;                                        
                  U2Y.YST_ÅMDNR  =  312 ;                                       
              END;                                                              
                                                                                
                                                                                
          IF U2Y.KAP_11_7_UTLØST = 'J' &                                        
             U2Y.YUG > 29              THEN                                     
             DO;                                                                
                                                                                
        /* ********************************************************** */        
        /* HVIS JA I ENGANGSUTLØST Y-PENSJON OG GRADEN      ER OVER   */        
        /* 29 PROSENT, SÅ AVVISES BLANKETTEN.                         */        
        /* ********************************************************** */        
                                                                                
                 FEIL_FUNNET            = '1'B;                                 
                 U2Y.KAP_11_7_UTLØSTNR  =  313 ;                                
                 U2Y.YUGNR              =  999 ;                                
              END;                                                              
                                                                                
           IF U2Y.KAP_11_7_UTLØST = 'J' &                                       
              U2S.UFG > 29              THEN                                    
              DO;                                                               
                                                                                
        /* ********************************************************** */        
        /* HVIS JA I ENGANGSUTLØST Y-PENSJON OG SAMLET GRAD ER OVER   */        
        /* 29 PROSENT, SÅ AVVISES BLANKETTEN.                         */        
        /* ********************************************************** */        
                                                                                
                 FEIL_FUNNET            = '1'B;                                 
                 U2Y.KAP_11_7_UTLØSTNR  =  313 ;                                
                 U2Y.YUGNR              =  999 ;                                
              END;                                                              
                                                                                
                                                                                
                                                                                
           IF U2Y.KAP_11_7_UTLØST = 'J' &                                       
              U2S.BT_ANT > 0            THEN                                    
              DO;                                                               
                                                                                
        /* ********************************************************** */        
        /* HVIS JA I ENGANGSUTLØST Y-PENSJON OG ANTALL BARN > 0 ,     */        
        /* SKAL BLANKETTEN AVVISES.   TRUDE                           */        
        /* ********************************************************** */        
                                                                                
                 FEIL_FUNNET            = '1'B;                                 
                 U2Y.KAP_11_7_UTLØSTNR  =  329 ;                                
                 U2Y.YUGNR              =  999 ;                                
              END;                                                              
                                                                                
           IF U2Y.YRKE11    = 'F' &                                             
              U2Y.AÅI      ^= 9999999 THEN                                      
              DO;                                                               
                                                                                
        /* ********************************************************** */        
        /* KODE F = FISKER.  INNTEKT SKAL IKKE OPPGIS FOR DISSE.      */        
        /* ********************************************************** */        
                                                                                
                  FEIL_FUNNET     = '1'B;                                       
                  U2Y.AÅINR       =  314;                                       
                  U2Y.YRKE11NR    =  999;                                       
               END;                                                             
            ELSE                                                                
            IF U2Y.YRKE11    = 'A' &                                            
               U2Y.AÅI       = 9999999 THEN                                     
               DO;                                                              
                                                                                
        /* ********************************************************** */        
        /* KODE A = ARBEIDSTAKER.  INNTEKT SKAL ALLTID OPPGIS.        */        
        /* ********************************************************** */        
                                                                                
                  FEIL_FUNNET     = '1'B;                                       
                  U2Y.AÅINR       =  316;                                       
                  U2Y.YRKE11NR    =  999;                                       
               END;                                                             
                                                                                
            IF (U2Y.YRKE11    = 'E' !                                           
                U2Y.YRKE11    = 'U' !                                           
                U2Y.YRKE11    = 'V' !                                           
                U2Y.YRKE11    = 'M' !                                           
                U2Y.YRKE11    = 'S'   ) &                                       
                U2Y.AÅI       = 9999999 THEN                                    
                                                                                
        /* ********************************************************** */        
        /* FOR YRKESKODENE E, U, V, M OG S KAN INNTEKT OPPGIS, MEN    */        
        /* DET ER IKKE NOE KRAV OM DETTE.  JEG ER IMIDLERTID NOE      */        
        /* USIKKER PÅ OM DETTE SKAL GJELDE FOR KODE S.  AVKLARES      */        
        /* SENERE.  ERIK 29.3.88.                                     */        
        /* ********************************************************** */        
                                                                                
                U2Y.AÅI       = 0;                                              
         /*************************************************************/        
         /* DERSOM UFG = 0, FLYTTES YUG INN I FELTET . TRUDE          */        
         /*************************************************************/        
                                                                                
            IF U2S.YSKADE_TILLEGG = 'J' THEN                                    
               DO;                                                              
                  IF U2S.UFG      = 0 THEN                                      
                     U2S.UFG      = U2Y.YUG;                                    
               END;                                                             
                                                                                
        /* ********************************************************** */        
        /* UFØREGRADEN I KAP. 8 ER MINDRE ENN Y-UFG.  BLANKETTEN      */        
        /* SKAL FORKASTES.                                            */        
        /* 20.6.88 VI SKAL GODTA BLANK I UFØREGRADEN I KAP 8, DERSOM  */        
        /* 'J' I YSKADETILLEGG. TRUDE. (STJERNET UT  DENNE TEST)      */        
        /* ********************************************************** */        
                                                                                
                                                                                
            IF ^(U2Y.VILKÅR_1_2_2A   = ' '  !                                   
                 U2Y.VILKÅR_1_2_2B   = ' '  )  &                                
                 U2S.NORSK_BOSATT = 'J'  THEN                                   
               DO;                                                              
                                                                                
        /* ********************************************************** */        
        /* VILKÅR 1-2-2 ER UTFYLT.  PERSONEN ER DA IKKE BOSATT I      */        
        /* NORGE, MEN U2-BLANKETTEN ER KRYSSET AV MED JA I FELTET     */        
        /* NORSK BOSATT.  BLANKETTEN AVVISES.                         */        
        /* ********************************************************** */        
                                                                                
                  FEIL_FUNNET        = '1'B;                                    
                  U2Y.VILKÅR_1_2_2ANR  = 318 ;                                  
                  U2Y.VILKÅR_1_2_2BNR  = 999 ;                                  
               END;                                                             
                                                                                
                                                                                
            ELSE                                                                
            IF ^(U2Y.VILKÅR_1_2_2A  = ' '  !                                    
                U2Y.VILKÅR_1_2_2B  = ' ' ) &                                    
                (U2Y.YUG    ^= U2S.UFG)   THEN                                  
                DO;                                                             
                                                                                
        /* ********************************************************** */        
        /* PERSONEN ER IKKE BOSATT I NORGE.  KAP. 8 GRADEN ER UNDER   */        
        /* 50 PROSENT, OG YRKEGRAD OG KAP. 8 GRADEN ER ULIK.          */        
        /* BLANKETTEN SKAL AVVISES.                                   */        
        /* ********************************************************** */        
                                                                                
                     FEIL_FUNNET          = '1'B;                               
                     U2Y.YUGNR            = 324 ;                               
                     U2Y.VILKÅR_1_2_2ANR  = 999 ;                               
                     U2Y.VILKÅR_1_2_2BNR  = 999 ;                               
                  END;                                                          
         END;                                                                   
                                                                                
          END KONTROLL_YP_U2;                                                   
