 /*   SIST ENDRET PÅ PROD   2001.10.22 12.35.32 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.24 AV   JDA7339          */        
 /*       SIST ENDRET 18/03-99 09.16.31 AV   JDA7339                  */        
 /*       SIST ENDRET 18/03-99 09.13.21 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.05 AV   JDA7339                  */        
 /*       SIST ENDRET 11/03-98 12.05.19 AV   JDA7339                  */        
 /* **************************************************************** */         
 /* IDENTIFIKASJON:   R0017022                                       */         
 /* PROGRAMMERER:  HELEN    JULI, 1982                              */          
 /* HENSIKT:                                                         */         
 /*        LEGGER INFORMASJON FRA B02 OVER I ET HENDELSE-SEGMENT     */         
 /*        I STØNADSBREV-BASEN . PROGRAMMET KALLES OPP ETTER         */         
 /*        HVER AJOURFØRT TRANSAKSJON.                               */         
 /* PROGRAMTILKNYTNING:                                              */         
 /*        PROGRAMMET KALLES OPP AV R0017001                         */         
 /*                                                                  */         
 /* **************************************************************** */         
 LAG_BARNEP_EN_HEND:                                                            
      PROC (B_IND) ;                                                            
  EXEC CICS ADDRESS EIB(DFHEIPTR);                                              
 DCL  B_IND        FIXED BIN(15);                                               
 DCL  IND          FIXED BIN(15);                                               
 DCL  EKIND        FIXED BIN(15);                                               
 DCL  Y_BARN_IND   FIXED BIN(15);                                               
                                                                                
 /* **************************************************************** */         
 /* PROGRAMMET BEGYNNER HER.                                         */         
 /* VI BLANKER W_HENDELSE OG  FINNER YNGSTE BARN.                    */         
 /* **************************************************************** */         
                                                                                
    W_HENDELSE            = '';                                                 
    DO IND = 3 TO 14;                                                           
  /*  ENDRET 09.02.88 SATISH                                   */               
  /*   IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'Y' THEN     */                
  /*  HIT TIL 09.02.88                                        */                
                                                                                
       IF B02.PERSON.STATUS.PENSJONSTYPE2(IND) = 'P' &                          
         (B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'B' !                          
          B02.PERSON.STATUS.PENSJONSTYPE1(IND) = 'N') THEN                      
          DO;                                                                   
             Y_BARN_IND = IND;                                                  
             IND = 14;                                                          
          END;                                                                  
    END;                                                                        
                                                                                
    OMR_DATO                = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                 
    IF TRANS_OPPL_OMR.TRANSTYPE = 27 THEN                                       
       DO;                                                                      
          HENDDATO  =  OMR_DATO/100;                                            
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          R_HENDDATO_D    =  B02.PERSON.STATUS.VIRK_DATO_ÅMD(B_IND);            
          HENDDATO        =  R_HENDDATO.AAR * 100 + R_HENDDATO.MND;             
       END;                                                                     
                                                                                
    W_HENDELSE.VERSJON       =    W_ROT.NESTE_SB_VERSJON_NR;                    
    W_HENDELSE.TERMINAL      =    DIV_PARAM_OMR.BRUKER_ID;                      
    W_HENDELSE.PENSJONSTYPE1 = B02.STATUS.PENSJONSTYPE1(B_IND);                 
    W_HENDELSE.PENSJONSTYPE2 = B02.STATUS.PENSJONSTYPE2(B_IND);                 
    W_HENDELSE.PENSJONSTYPE3 = B02.STATUS.PENSJONSTYPE3(B_IND);                 
                                                                                
    IF B02.PERSON.STATUS.PENSJONSTYPE3(B_IND) = 'U'     THEN                    
                                                                                
       DO;                                                                      
          W_HENDELSE.GP_BRUTTO = B02.PERSON.UFØRPENS.GP(B_IND);                 
          W_HENDELSE.GP_NETTO  = B02.PERSON.UFØRPENS.GP(B_IND);                 
          W_HENDELSE.TP_BRUTTO = B02.PERSON.UFØRPENS.TP(B_IND);                 
          W_HENDELSE.TP_NETTO  = B02.PERSON.UFØRPENS.TP(B_IND);                 
          W_HENDELSE.ST        = B02.PERSON.UFØRPENS.ST(B_IND);                 
          W_HENDELSE.KT        = B02.PERSON.UFØRPENS.KT(B_IND);                 
          W_HENDELSE.UF_GRAD   = B02.PERSON.UFØRPENS.UFG(B_IND);                
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          W_HENDELSE.GP_BRUTTO  =    B02.PERSON.ETTEBARN.GP(B_IND);             
          W_HENDELSE.GP_NETTO   =    B02.PERSON.ETTEBARN.GP(B_IND);             
       END;                                                                     
                                                                                
    W_HENDELSE.ANTALL_BARN = B02.PERSON.STATUS.ANTALL_BARN(Y_BARN_IND);         
    W_HENDELSE.ANTALL_BARN_TIDL = B01.PERSON.STATUS.ANTALL_BARN(3);             
    W_HENDELSE.TT          = B02.PERSON.STATUS.TT_ANV(B_IND);                   
    W_HENDELSE.BOSATT      = B02.BOSATT(B_IND); /*JD 08.90*/                    
                                                                                
    /* ENDRET 031286 BF: YNGSTE BARNS FNR LEGGES INN I HENDELSES-  */           
    /*                   SEGMENTET. (DETTE SKAL BRUKES I R001NO20) */           
                                                                                
    W_HENDELSE.FNR_B (1)        = B02.FNR (Y_BARN_IND);                         
                                                                                
    IF B02.FNR(1)          > 0   THEN                                           
                                                                                
       DO;                                                                      
          W_HENDELSE.FNR_EKTEF   = B02.FNR(1);                                  
          W_HENDELSE.NAVN_EKTEF  = B02.NAVN(1);                                 
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          W_HENDELSE.FNR_EKTEF   = B02.FNR(2);                                  
          W_HENDELSE.NAVN_EKTEF  = B02.NAVN(2);                                 
       END;                                                                     
                                                                                
    CALL PLASSER_TEKST(B_IND,B_IND);                                            
                                                                                
 /* **************************************************************** */         
 /* HENDELSE SEGMENT SKRIVES UT.                                     */         
 /* **************************************************************** */         
                                                                                
    CALL INSERT_HENDELSE;                                                       
                                                                                
 END  LAG_BARNEP_EN_HEND;                                                       
