 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.47 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.58 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.57.07 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.41.07 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO1A  UNDERPROGRAM SOM BRUKES AV R001NO10    */        
 /*                            KONTROLL AFP-BLANKETT.                 */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : SATISH PATHAK                                    */        
 /*  PROGRAMMET BLE LAGET : MAR 1989                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:  LAGT INN CALL TIL BLANK_AFP_SPES.            */        
 /*                      ABENDER I GRUNNBLANKETTRUTINEN KAN SKYLDES   */        
 /*                      UGYLDIGE VERDIER I AFPSP.                              
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NO1A                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R0011902   BLANK TRANSOMR                                      */        
 /*    R0011903   KONTR AFP SØKER                                     */        
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR AFP OG FLYTTER DERETTER       */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P119_BEHANDLE_AFP: PROC;                                                       
                                                                                
                                                                                
 %INCLUDE P0011901;                      /* TRANSOMRÅDE AFP */                  
                                                                                
                                                                                
          CALL BLANK_AFP_SØKER;                         /* R0011902 */          
          CALL BLANK_AFP_MELDNR;                        /* R0011902 */          
          CALL BLANK_AFP_SPES;                          /* R0011902 */          
          CALL OVERF_AFP_BLANKETT;                                              
          CALL KONTROLL_AFP_SØKER(FEIL_FUNNET);         /* R0011903 */          
                                                                                
                                                                                
          IF AFP.NORSK_BOSATT = 'N'   THEN                                      
             DO;                                                                
                FEIL_I_BOSATT = TRUE;                                           
                FEIL_FUNNET   = TRUE;                                           
             END;                                                               
                                                                                
          IF FEIL_FUNNET      THEN                                              
             CALL FINN_FEIL_AFP;                                                
                                                                                
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL AFP TRANSOMRÅDE FOR AFP SØKER.                    */        
 /* ***************************************************************** */        
 OVERF_AFP_BLANKETT:PROC;                                                       
                                                                                
      DCL HJELPEDATO    PIC '(8)9';                                             
                                                                                
          AFP.REGDATO_ÅMD  =  BLANKETT_RECORD.TRANS_DATO_ÅMD;                   
          AFP.TERMID       = DIV_PARAM_OMR.TERMINAL_NR;                         
          HJELPEDATO        = AFP_BLANKETT.VIRK_DATO_ÅMD / 100 ;                
          AFP.VIRK_DATO_ÅMD = HJELPEDATO * 100;                                 
          AFP.FNR          =  BLANKETT_RECORD.FNR;                              
          AFP.NAVN         =  BLANKETT_RECORD.NAVN;                             
          AFP.TKNR         =  BLANKETT_RECORD.TKNR;                             
          AFP.TILL_EK      =  AFP_BLANKETT.EKTEFELLETILLEGG;                    
          AFP.SIVILSTAND   =  AFP_BLANKETT.SIVILSTAND;                          
          AFP.SPRÅK        =  AFP_BLANKETT.SPRÅK;                               
                                                                                
          AFP.NORSK_BOSATT =  AFP_BLANKETT.NORSK_BOSATT;                        
                                                                                
          IF F_FELT_PIC_CHAR6 (AFP_BLANKETT.FAI) ^= '      '     THEN           
             AFP.FAI       =  AFP_BLANKETT.FAI ; /* ENDRET AV SATISH*/          
                                                                                
          IF F_FELT_PIC_CHAR3 (AFP_BLANKETT.APD) ^= '   '        THEN           
             AFP.APD       =  AFP_BLANKETT.APD;                                 
                                                                                
          IF F_FELT_PIC_CHAR11 (AFP_BLANKETT.FNR_EK) ^= (11)' '  THEN           
             AFP.FNR_EK    =  AFP_BLANKETT.FNR_EK;                              
                                                                                
          IF F_FELT_PIC_CHAR6 (AFP_BLANKETT.PI) ^= '      '     THEN            
              AFP.PI       =  AFP_BLANKETT.PI;                                  
          AFP.AFP_ORDNING  =  AFP_BLANKETT.AFP_ORDNING;                         
          AFP.NAVN_EK      =  AFP_BLANKETT.NAVN_EK;                             
          AFP.AFP_TILLEGG_KODE  =  AFP_BLANKETT.AFP_TILLEGG;                    
                                                                                
                                                                                
    END OVERF_AFP_BLANKETT;                                                     
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */        
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */        
 /* ***************************************************************** */        
 FINN_FEIL_AFP:PROC;                                                            
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF AFP.FNRNR ^= 0 &                                                   
             AFP.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF AFP.TKNRNR ^= 0 &                                                  
             AFP.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.TKNRNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF AFP.NAVNNR ^= 0 &                                                  
             AFP.NAVNNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.NAVNNR;                             
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.SPRÅKNR ^= 0 &                                                 
             AFP.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.SPRÅKNR;                            
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.SIVILSTANDNR ^= 0 &                                            
             AFP.SIVILSTANDNR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.SIVILSTANDNR;                       
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.TILL_EKNR ^= 0 &                                               
             AFP.TILL_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.TILL_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.NORSK_BOSATTNR ^= 0 &                                          
             AFP.NORSK_BOSATTNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.NORSK_BOSATTNR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.FAINR ^= 0 &                                                   
             AFP.FAINR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.FAINR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.APDNR ^= 0 &                                                   
             AFP.APDNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.APDNR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.VIRK_DATO_ÅMDNR ^= 0 &                                         
             AFP.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.FNR_EKNR ^= 0 &                                                
             AFP.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.FNR_EKNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.NAVN_EKNR ^= 0 &                                               
             AFP.NAVN_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.NAVN_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.AFP_ORDNINGNR ^= 0 &                                           
             AFP.AFP_ORDNINGNR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.AFP_ORDNINGNR;                      
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF AFP.PINR     ^= 0 &                                                
             AFP.PINR     ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = AFP.PINR    ;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
                                                                                
                                                                                
    END FINN_FEIL_AFP;                                                          
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0011902;          /*     BLANK AP TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R0011903;          /*     KONTR AP SØKER      */                      
                                                                                
 END P119_BEHANDLE_AFP;                                                         
                                                                                
                                                                                
