 /*       SIST ENDRET 22/06-98 12.24.31 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/06-98 11.02.21 AV   RFA9991                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0011405 - PROSEDYRER I PLI                                    */00000040
 /*    PROGRAMMERER: JAN, SEPTEMBER 1981                              */00000050
 /*HENSIKT:                                                           */00000060
 /*    PROSEDYRENE FORETAR KONTROLL AV DATA FOR E1_KAP7,E1_KAP8 OG    */00000070
 /*    E1_KAP10 OG E1_KAP11 FRA ENDRINGSBLANKETTEN.             */      00000080
 /*PROGRAMTILKNYTNING:                                                */00000090
 /*    PROSEDYRENE INNGÅR SOM EN DEL AV BEHANDLINGEN AV ENDRINGS-     */00000100
 /*    BLANKETTEN.                                                    */00000110
 /*    INCLUDES I  R0011401.                                          */00000120
 /*BRUK:                                                              */00000130
 /*    CALL KONTROLL_E1_KAP7 (FEIL_I_E1_KAP7);                        */00000140
 /*    CALL KONTROLL_E1_KAP8 (FEIL_I_E1_KAP8);                        */00000150
 /*    CALL KONTROLL_E1_KAP10(FEIL_I_E1_KAP10);                       */00000160
 /*    CALL KONTROLL_E1_KAP11(FEIL_I_E1_KAP11);                 */      00000170
 /******************************************************************* */00000180
 %PAGE;                                /*   */                          00000190
 /* ***************************************************************** */00000200
 /*                                                                   */00000210
 /*   MODULEN KONTROLLERER E1_KAP7 (ENDRING I INNTEKT ELLER PENSJONS- */00000220
 /*   GRAD) OG RETURNERER MED FEIL_FUNNET= '1'B HVIS FEIL, '0'B       */00000230
 /*   HVIS RIKTIG                                                     */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 %SKIP(2);                                                              00000270
 KONTROLL_E1_KAP7:                                                      00000280
   PROC (FEIL_FUNNET);                                                  00000290
   DCL                                                                  00000300
      FEIL_FUNNET BIT (1);                                              00000310
 %SKIP;                                                                 00000320
 /* ***************************************************************** */00000330
 /*   DERSOM FELTET ER UTFYLT                                         */00000340
 /* ***************************************************************** */00000350
                                                                        00000360
      IF E1K7.FAI > 0 THEN                                              00000370
                                                                        00000380
 /* ***************************************************************** */00000390
 /*      F_NUMERISK KONTROLLERER OM ET OVERFØRT CHAR-FELT ER NUMERISK */00000400
 /*      DERSOM FELTET ER NUMERISK RETURNERES '1'B, HVIS IKKE '0'B.   */00000410
 /* ***************************************************************** */00000420
 /* ***************************************************************** */00000430
 /*      F_FELT_PIC_CHAR ER EN FUNKSJON SOM KONVERTERER PIC-FELT TIL  */00000440
 /*      CHAR.                                                        */00000450
 /* ***************************************************************** */00000460
                                                                        00000470
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E1K7.FAI)) THEN               00000480
            DO;                                                         00000490
               FEIL_FUNNET = '1'B;                                      00000500
                                                                        00000510
 /* ***************************************************************** */00000520
 /*      FEILMELD 200: TEGN SOM IKKE ER TALL FOREKOMMER I TALLFELTET. */00000530
 /* ***************************************************************** */00000540
                                                                        00000550
               E1K7.FAINR = 200;                                        00000560
            END;                                                        00000570
      IF E1K7.APD_MAX ^= ' ' THEN                                       00000580
         DO;                                                            00000590
            IF ^ (E1K7.APD_MAX = 'X') THEN                              00000600
               DO;                                                      00000610
                  FEIL_FUNNET    = '1'B;                                00000620
                                                                        00000630
 /* ***************************************************************** */00000640
 /*         FEILMELD 149: FEIL I MAKS PENSJONSGRAD                    */00000650
 /* ***************************************************************** */00000660
                                                                        00000670
                  E1K7.APD_MAXNR =149;                                  00000680
               END;                                                     00000690
            ELSE                                                        00000700
               IF E1K7.APD = 999 THEN                                   00000710
                  E1K7.APD = 100;                                       00000720
               ELSE                                                     00000730
                  IF E1K7.APD ^= 100 THEN                               00000740
                     DO;                                                00000750
                        FEIL_FUNNET = '1'B;                             00000760
                                                                        00000770
 /* **************************************************************** */ 00000780
 /*               FEILMELD 182: APD-MAX ER UTFYLT,APD ER IKKE 999    */ 00000790
 /*               ELLER 100.                                         */ 00000800
 /* **************************************************************** */ 00000810
                                                                        00000820
                        E1K7.APDNR  = 182;                              00000830
                     END;                                               00000840
         END;                                                           00000850
      ELSE                                                              00000860
         IF E1K7.APD = 999 THEN                                         00000870
            DO;                                                         00000880
               IF E1K7.FAI ^= 9999999  THEN                             00000890
                  E1K7.APD = 100;                                       00000900
               ELSE                                                     00000910
                  LEAVE;                                                00000920
            END;                                                        00000930
         ELSE                                                           00000940
            IF E1K7.APD > 0 THEN                                        00000950
               IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K7.APD)) THEN         00000960
                  DO;                                                   00000970
                     FEIL_FUNNET = '1'B;                                00000980
                     E1K7.APDNR  = 200;                                 00000990
                  END;                                                  00001000
               ELSE                                                     00001010
                  IF ^(E1K7.APD = 0 !  E1K7.APD = 25 !                  00001020
                       E1K7.APD = 50 ! E1K7.APD = 75 !                  00001030
                       E1K7.APD = 100) THEN                             00001040
                     DO;                                                00001050
                        FEIL_FUNNET = '1'B;                             00001060
                                                                        00001070
 /* ***************************************************************** */00001080
 /*            FEILMELD 12: PENSJONSGRADEN ER UGYLDIG                 */00001090
 /* ***************************************************************** */00001100
                                                                        00001110
                        E1K7.APDNR  = 12;                               00001120
                     END;                                               00001130
   END KONTROLL_E1_KAP7;                                                00001140
 %PAGE;                                /*   */                          00001150
                                                                        00001160
 /* ***************************************************************** */00001170
 /*                                                                   */00001180
 /*   MODULEN KONTROLLERER E1_KAP8(REDUKSJON AV UFØREGRAD) OG         */00001190
 /*   RETURNERER MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG   */00001200
 /*                                                                   */00001210
 /* ***************************************************************** */00001220
                                                                        00001230
 %SKIP(2);                                                              00001240
 KONTROLL_E1_KAP8:                                                      00001250
   PROC (FEIL_FUNNET);                                                  00001260
   DCL                                                                  00001270
      FEIL_FUNNET BIT (1);                                              00001280
 %SKIP;                                                                 00001290
      IF E1K8.UFG > 0 THEN                                              00001300
         DO;                                                            00001310
            IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K8.UFG)) THEN            00001320
               DO;                                                      00001330
                  FEIL_FUNNET = '1'B;                                   00001340
                  E1K8.UFGNR  = 200;                                    00001350
               END;                                                     00001360
            ELSE                                                        00001370
             IF ^(E1K8.UFG = 15 ! E1K8.UFG = 20 ! E1K8.UFG = 25 !       00001380
                  E1K8.UFG = 30 ! E1K8.UFG = 35 ! E1K8.UFG = 40 !       00001390
                  E1K8.UFG = 45 ! E1K8.UFG = 50 ! E1K8.UFG = 55 !       00001400
                  E1K8.UFG = 60 ! E1K8.UFG = 65 ! E1K8.UFG = 70 !       00001410
                  E1K8.UFG = 75 ! E1K8.UFG = 80 ! E1K8.UFG = 85 !       00001420
 /*13.7.89-HL*/   E1K8.UFG = 100 !                                      00001430
                  E1K8.UFG = 90 ! E1K8.UFG = 95 ! E1K8.UFG = 999 ) THEN 00001440
                                                                        00001450
                  DO;                                                   00001460
                     FEIL_FUNNET = '1'B;                                00001470
                                                                        00001480
 /* ***************************************************************** */00001490
 /*            FEILMELD 38: UGYLDIG UFØREGRAD                         */00001500
 /* ***************************************************************** */00001510
                                                                        00001520
                     E1K8.UFGNR = 38;                                   00001530
                  END;                                                  00001540
         END;                                                           00001550
   END KONTROLL_E1_KAP8;                                                00001560
 %PAGE;                                /*   */                          00001570
                                                                        00001580
 /* ***************************************************************** */00001590
 /*                                                                   */00001600
 /*   MODULEN KONTROLLERER E1_KAP10 (DIVERSE ENDRINGER) OG RETURNERER */00001610
 /*   MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS RIKTIG              */00001620
 /*                                                                   */00001630
 /* ***************************************************************** */00001640
                                                                        00001650
 %SKIP(2);                                                              00001660
 KONTROLL_E1_KAP10:                                                     00001670
   PROC (FEIL_FUNNET);                                                  00001680
   DCL                                                                  00001690
      FEIL_FUNNET     BIT (1);                                          00001700
 %SKIP;                                                                 00001710
   DCL                                                                  00001720
      DAGENS_DATO_ÅMD PIC '99999999',                                   00001730
      DAGENS_DATO_ÅM  DEF DAGENS_DATO_ÅMD PIC '999999',                 00001740
      DAGENS_DATO_Å2  DEF DAGENS_DATO_ÅMD POS(3) PIC '99',              00001750
      DAGENS_DATO_Å4  DEF DAGENS_DATO_ÅMD PIC '9999';                   00001760
 %PAGE;                                /*   */                          00001770
                                                                        00001780
 /* ***************************************************************** */00001790
 /*  HJELPE DCL FOR Å SNU DATO                                        */00001800
 /* ***************************************************************** */00001810
                                                                        00001820
 %SKIP(1);                                                              00001830
   DCL                                                                  00001840
      HJ_FRAML_DATO_ÅMD PIC '99999999',                                 00001850
      FRAML_DATO_Å2    DEF HJ_FRAML_DATO_ÅMD POS(1) PIC '99',           00001860
      FRAML_DATO_Å4    DEF HJ_FRAML_DATO_ÅMD POS(3) PIC '9999',         00001870
      FRAML_DATO_M     DEF HJ_FRAML_DATO_ÅMD POS(5) PIC '99';           00001880
 %SKIP;                                                                 00001890
 %PAGE;                                                                 00001900
                                                                        00001910
      DAGENS_DATO_ÅMD = DATO_2000;                                      00001920
      IF E1K10.FORVENTET > 0 THEN                                       00001930
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR7(E1K10.FORVENTET)) THEN        00001940
            DO;                                                         00001950
               FEIL_FUNNET       = '1'B;                                00001960
               E1K10.FORVENTETNR = 200;                                 00001970
            END;                                                        00001980
      IF ^(E1K10.O_TIL_PENSJON = 'X' ! E1K10.O_TIL_PENSJON = ' ') THEN  00001990
         DO;                                                            00002000
            FEIL_FUNNET           = '1'B;                               00002010
                                                                        00002020
 /* **************************************************************** */ 00002030
 /*   FEILMELD 150: FEIL I OVEGANG TIL PENSJON                       */ 00002040
 /* **************************************************************** */ 00002050
                                                                        00002060
            E1K10.O_TIL_PENSJONNR =150;                                 00002070
         END;                                                           00002080
      IF E1K10.TP_PROSENT > 0 THEN                                      00002090
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K10.TP_PROSENT)) THEN       00002100
            DO;                                                         00002110
               FEIL_FUNNET        = '1'B;                               00002120
               E1K10.TP_PROSENTNR = 200;                                00002130
            END;                                                        00002140
         ELSE                                                           00002150
            IF E1K10.TP_PROSENT > 55 &                                  00002160
               E1K10.TP_PROSENT < 999 THEN                              00002170
               DO;                                                      00002180
                  FEIL_FUNNET        = '1'B;                            00002190
                                                                        00002200
 /* **************************************************************** */ 00002210
 /*         FEILMELD 64: FEIL I TP-PROSENT                           */ 00002220
 /* **************************************************************** */ 00002230
                                                                        00002240
                  E1K10.TP_PROSENTNR = 64;                              00002250
               END;                                                     00002260
      IF E1K10.FRAML_DATO_ÅMD > 0 THEN                                  00002270
         IF ^ F_NUMERISK(F_FELT_PIC_CHAR8(E1K10.FRAML_DATO_ÅMD)) THEN   00002280
            DO;                                                         00002290
               FEIL_FUNNET           = '1'B;                            00002300
               E1K10.FRAML_DATO_ÅMDNR = 200;                            00002310
            END;                                                        00002320
         ELSE                                                           00002330
            IF E1K10.FRAML_DATO_ÅMD > 0 THEN                            00002340
                                                                        00002350
 /* **************************************************************** */ 00002360
 /*            FUNKSJONEN F_GYLDIG_DATO KONTROLLERER OM EN DATO(ÅR/  */ 00002370
 /*            MND) ER GYLDIG. HVIS GYLDIG RETURNERES '1'B, HVIS     */ 00002380
 /*            IKKE GYLDIG '0'B.                                     */ 00002390
 /* **************************************************************** */ 00002400
                                                                        00002410
               IF ^ F_GYLDIG_DATO(E1K10.FRAML_DATO_ÅMD) THEN            00002420
                  DO;                                                   00002430
                     FEIL_FUNNET           = '1'B;                      00002440
                                                                        00002450
 /* **************************************************************** */ 00002460
 /*            FEILMELD 71: UGYLDIG FRAMLEGGSDATO                    */ 00002470
 /* **************************************************************** */ 00002480
                                                                        00002490
                     E1K10.FRAML_DATO_ÅMDNR = 71;                       00002500
                  END;                                                  00002510
      IF VERIFY (E1K10.OPPHØR_EO,'JN ') ^= 0 THEN                       00002520
         DO;                                                            00002530
            FEIL_FUNNET       = '1'B;                                   00002540
                                                                        00002550
 /* **************************************************************** */ 00002560
 /*   FEILMELD 151: FEIL I OPPHØR-EO                                 */ 00002570
 /* **************************************************************** */ 00002580
                                                                        00002590
            E1K10.OPPHØR_EONR = 151;                                    00002600
         END;                                                           00002610
      ELSE                                                              00002620
         IF E1K10.OPPHØR_EO ^= ' ' & E1K10.FRAML_DATO_ÅMD = 0 THEN      00002630
            DO;                                                         00002640
               FEIL_FUNNET       = '1'B;                                00002650
                                                                        00002660
 /* **************************************************************** */ 00002670
 /*      FEILMELD 184: OPPHØR-EO ER UTFYLT,FRAMLEGGSDATO IKKE UTFYLT */ 00002680
 /* **************************************************************** */ 00002690
                                                                        00002700
               E1K10.OPPHØR_EONR = 184;                                 00002710
            END;                                                        00002720
         ELSE                                                           00002730
            IF E1K10.OPPHØR_EO = ' ' & E1K10.FRAML_DATO_ÅMD > 0 THEN    00002740
               DO;                                                      00002750
                  FEIL_FUNNET       = '1'B;                             00002760
                                                                        00002770
 /* **************************************************************** */ 00002780
 /*         FEILMELD 187: OPPHØR_EO IKKE UTFYLT,FRAML_DATO ER UTFYLT */ 00002790
 /* **************************************************************** */ 00002800
                                                                        00002810
                  E1K10.OPPHØR_EONR = 187;                              00002820
               END;                                                     00002830
 %SKIP(3);                             /*  */                           00002840
                                                                        00002850
 /* ***************************************************************** */00002860
 /*   KRYSS KONTROLLER                                                */00002870
 /* ***************************************************************** */00002880
                                                                        00002890
 %SKIP;                                                                 00002900
      IF ^ FEIL_FUNNET THEN                                             00002910
         DO;                                                            00002920
            HJ_FRAML_DATO_ÅMD = E1K10.FRAML_DATO_ÅMD;                   00002930
                                                                        00002940
            IF (E1K10.FRAML_DATO_ÅMD > 0 ! E1K10.OPPHØR_EO ^= ' ' !     00002950
                E1K10.TP_PROSENT    < 999 !                             00002960
                E1K10.O_TIL_PENSJON ^= ' ') &                           00002970
                E1K10.FORVENTET     = 9999999   THEN                    00002980
                  DO;                                                   00002990
                     FEIL_FUNNET           = '1'B;                      00003000
                     E1K10.FORVENTETNR     = 88;                        00003010
                  END;                                                  00003020
            IF E1K10.FRAML_DATO_ÅMD > 0 THEN                            00003030
               IF HJ_FRAML_DATO_ÅMD < DAGENS_DATO_ÅMD THEN              00003040
                  DO;                                                   00003050
                     FEIL_FUNNET           = '1'B;                      00003060
                     E1K10.FRAML_DATO_ÅMDNR = 72;                       00003070
                  END;                                                  00003080
         END;                                                           00003090
   END KONTROLL_E1_KAP10;                                               00003100
 %PAGE;                                /*   */                          00003110
        /* OBS. NY PROSEDYRE   */                                       00003120
 /* ********************************************************** */       00003130
 /*                                                            */       00003140
 /*   MODULEN KONTROLLERER E1_KAP11(REDUKSJON AV YRKEGRAD) OG  */       00003150
 /*   RETURNERER MED FEIL_FUNNET = '1'B HVIS FEIL, '0'B HVIS   */       00003160
 /*   RIKTIG                                                   */       00003170
 /*                                                            */       00003180
 /* ********************************************************** */       00003190
                                                                        00003200
 KONTROLL_E1_KAP11:                                                     00003210
   PROC (FEIL_FUNNET);                                                  00003220
   DCL                                                                  00003230
      FEIL_FUNNET BIT (1);                                              00003240
                                                                        00003250
      IF E1K11.YUG > 0 THEN                                             00003260
         DO;                                                            00003270
            IF ^ F_NUMERISK(F_FELT_PIC_CHAR3(E1K11.YUG)) THEN           00003280
               DO;                                                      00003290
                  FEIL_FUNNET = '1'B;                                   00003300
                  E1K11.YUGNR = 200;                                    00003310
               END;                                                     00003320
            ELSE                                                        00003330
             IF ^(E1K11.YUG = 15 ! E1K11.YUG = 20 !                     00003340
                  E1K11.YUG = 25 ! E1K11.YUG = 30 !                     00003350
                  E1K11.YUG = 35 ! E1K11.YUG = 40 !                     00003360
                  E1K11.YUG = 45 ! E1K11.YUG = 50 !                     00003370
                  E1K11.YUG = 55 ! E1K11.YUG = 60 !                     00003380
                  E1K11.YUG = 65 ! E1K11.YUG = 70 !                     00003390
                  E1K11.YUG = 75 ! E1K11.YUG = 80 !                     00003400
                  E1K11.YUG = 85 ! E1K11.YUG = 90 !                     00003410
                  E1K11.YUG = 95 ! E1K11.YUG = 999)  THEN               00003420
                                                                        00003430
                  DO;                                                   00003440
                     FEIL_FUNNET = '1'B;                                00003450
                                                                        00003460
 /* *********************************************************** */      00003470
 /*            FEILMELD 307: UGYLDIG UFØREGRAD                  */      00003480
 /* *********************************************************** */      00003490
                                                                        00003500
                     E1K11.YUGNR = 307;                                 00003510
                  END;                                                  00003520
             ELSE                                                       00003530
                IF E1K8.UFG > 0  THEN                                   00003540
                   DO;                                                  00003550
                      IF E1K8.UFG  < 50        &                        00003560
                         E1K8.UFG ^= E1K11.YUG    THEN                  00003570
                         DO;                                            00003580
                            FEIL_FUNNET = '1'B;                         00003590
                            E1K8.UFGNR  = 311;                          00003600
                            E1K11.YUGNR = 999;                          00003610
                         END;                                           00003620
                      IF E1K8.UFG < E1K11.YUG    THEN                   00003630
                         DO;                                            00003640
                            FEIL_FUNNET = '1'B;                         00003650
                            E1K8.UFGNR  = 317;                          00003660
                            E1K11.YUGNR = 999;                          00003670
                         END;                                           00003680
                                                                        00003690
                   END;                                                 00003700
         END;                                                           00003710
   END KONTROLL_E1_KAP11;                                               00003720
