 R001S100: PROC (TEST) OPTIONS (MAIN);                                          
                                                                                
 DCL  MELDING CHAR(5) INIT('XXXXX');                                            
 DCL  PSBNAVN CHAR(8) INIT('B001R001');                                         
 DCL  PLITDLI ENTRY;                                                            
 DCL  PCBCALL CHAR(8) INIT('PCB');                                              
                                                                                
 %INCLUDE  DLIUIB;                                                              
                                                                                
 DCL  1 PCBPTR BASED(IUBPCBAL),                                                 
      2 PPCB POINTER;                                                           
                                                                                
 DCL  FUNK CHAR(4) INIT('  ');                                                  
 DCL  WORK CHAR(160) INIT(' ');                                                 
 DCL  ANTALL BIN FIXED(31) INIT(0);                                             
                                                                                
 DCL  1 GDATSSA,                                                                
      2 SEGM CHAR (8) INIT ('RF0PERSN'),                                        
      2 COMM CHAR (2) INIT ('*-'),                                              
      2 NØKKEL CHAR (9) INIT ('(FNR'),                                          
      2 RO CHAR (2) INIT ('='),                                                 
      2 VALUE FIXED DECIMAL (11) INIT('0'),                                     
      2 END CHAR (1) INIT (')');                                                
                                                                                
 EXEC  CICS DUMP DUMPCODE ('SJEK')                                              
      FROM (MELDING)                                                            
      LENGTH(5);                                                                
                                                                                
 ANTALL  = 3;                                                                   
                                                                                
 VALUE  = 00000000000; /* (fnr fjernet) */
                                                                                
 CALL  PLITDLI(ANTALL,PCBCALL,PSBNAVN,UIBPTR);                                  
                                                                                
 EXEC  CICS DUMP DUMPCODE ('ESJK')                                              
      FROM (MELDING)                                                            
      LENGTH(5);                                                                
                                                                                
 EXEC  CICS DUMP DUMPCODE ('SCAL')                                              
      FROM (MELDING)                                                            
      LENGTH(5);                                                                
                                                                                
 FUNK  = 'GU';                                                                  
 ANTALL  = 4;                                                                   
 CALL  PLITDLI(ANTALL,FUNK,PPCB,WORK,GDATSSA);                                  
                                                                                
 EXEC  CICS DUMP DUMPCODE ('ECAL')                                              
      FROM (MELDING)                                                            
      LENGTH(5);                                                                
                                                                                
 EXEC  CICS RETURN;                                                             
                                                                                
 END;                                                                           
