 /*   SIST ENDRET PÅ PROD   2008.05.31 11.27.00 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2004.02.20 12.50.04 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.02.20 12.38.08 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.14.39 AV   JDA7339          */        
 /*       SIST ENDRET 02/09-98 11.54.00 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001I903  MASSE-REGISTRERING AV INNTEKTER        */        
 /*                            FRA BRUDD-LISTE.                       */        
 /*  PROGRAM-SPRÅK : PLI/CICS                     HOVEDPROGRAM        */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : JAN 1989                                  */        
 /*  ENDRINGERSDATO : 08.06.1998                                      */        
 /*  ENDRINGEN GJELDER: ÅR2000                                        */        
 /*  ENDRINGEN BLE UTFØRT AV : O.GØYTIL.                              */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  PROGRAMMET STYRER REGISTRERING AV INNTEKTER FRA BRUDD-LISTE.     */        
 /*  INNTEKTENE LEGGES UT PÅ FILEN INBRUDD. FILEN OLBRUDD OPPDATERES  */        
 /*  FOR UTSKRIVING AV KONTROLL-LISTE.                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  BLIR GITT KONTROLL V TRANSKODE RI9B.                             */        
 /*                                                                   */        
 /*  ARBEIDSOMRÅDER SOM BRUKES :                                      */        
 /*                                                                   */        
 /*          S001I9;                              MAP REG.INNT.       */        
 /*          P0019956;                            INNTEKTS_RAPPORT    */        
 /*          P0019906;                            TRANS_OPPL_OMR      */        
 /*          P0019908;                            KOM_OMR             */        
 /*          P0019910;                            STYRINGS_OMR        */        
 /*          P0019912;                            DIV_OMR             */        
 /*          P0019924;                            G_V TAB             */        
 /*          P0019925;                            G TAB               */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  OUTPUT ER                                                        */        
 /*            OLBRUDD   TIL KONTROLL-LISTE                           */        
 /*            INBRUDD   TIL R0019D11 - SPLITT PENSJ/IKKE PENSJ.      */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*  FEIL-MELDINGER SKRIVES UT PÅ SKJERMBILDET.                       */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001I93:                                                                       
    PROC            (COMMAREA_PEKER)                                            
           OPTIONS  (MAIN);                                                     
                                                                                
                                                                                
    %PAGE;                                                                      
    DCL 01 INNT_RAPP,                                                           
    %INCLUDE P0019956;                /* INNTEKTS-RAPPORTEN         */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE S001I9  ;                /* MAP : REGISTRERING         */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019906;                /*  TRANS_OPPL_OMR   (BASED)  */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019908;                /*  KOM_OMR    (BASED)        */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019910;                /*  STYRINGS_OMRÅDE  (BASED)  */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019912;                /*  DIV_OMRÅDE (BASED)        */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019924;                /*  G_V TABELL                */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0019925;                /*  G   TABELL                */          
                                                                                
    %PAGE;                                                                      
    %INCLUDE DFHBMSCA;                                                          
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  TRANS-OMRÅDE FOR REG. AV INNTEKT                                 */        
 /*  TRANS-LISTE-OMR BRUKES FOR Å OPPBEVARE INNTEKTENE MENS           */        
 /*  KONTROLL_INNTEKTENE REGISTRERES.                                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
    DCL 1 TRANS_OMR UNAL BASED(TRANS_PEKER),                                    
          3 INNTEKT(16),                                                        
            4 FNRNR          FIXED DEC (5),                                     
            4 FNR            PIC '(11)9',                                       
            4 TYPENR         FIXED DEC (5),                                     
            4 TYPE           CHAR(1),                                           
            4 ETYPENR        FIXED DEC (5),                                     
            4 ETYPE          CHAR(1),                                           
            4 ÅRNR           FIXED DEC (5),                                     
            4 ÅR             PIC '(4)9',                                        
            4 ARTNR          FIXED DEC (5),                                     
            4 ART            PIC '(1)9',                                        
            4 MERKENR        FIXED DEC (5),                                     
            4 MERKE          PIC '(1)9',                                        
            4 KOMMNRNR       FIXED DEC (5),                                     
            4 KOMMNR         PIC '(4)9',                                        
            4 PG_INNTEKTNR   FIXED DEC (5),                                     
            4 PG_INNTEKT     PIC '(9)9',                                        
            4 AGIVKODENR     FIXED DEC (5),                                     
            4 AGIVKODE       PIC '(3)9';                                        
                                                                                
    DCL 1 TRANS_LISTE_OMR UNAL BASED(TRANS_LISTE_PEKER),                        
          3 KTRL_INNTEKT(16),                                                   
            4 FNRNR          FIXED DEC (5),                                     
            4 FNR            PIC '(11)9',                                       
            4 TYPENR         FIXED DEC (5),                                     
            4 TYPE           CHAR(1),                                           
            4 ETYPENR        FIXED DEC (5),                                     
            4 ETYPE          CHAR(1),                                           
            4 ÅRNR           FIXED DEC (5),                                     
            4 ÅR             PIC '(4)9',                                        
            4 ARTNR          FIXED DEC (5),                                     
            4 ART            PIC '(1)9',                                        
            4 MERKENR        FIXED DEC (5),                                     
            4 MERKE          PIC '(1)9',                                        
            4 KOMMNRNR       FIXED DEC (5),                                     
            4 KOMMNR         PIC '(4)9',                                        
            4 PG_INNTEKTNR   FIXED DEC (5),                                     
            4 PG_INNTEKT     PIC '(9)9',                                        
            4 AGIVKODENR     FIXED DEC (5),                                     
            4 AGIVKODE       PIC '(3)9';                                        
                                                                                
    DCL 1 TRANS_SAVE_OMR UNAL,                                                  
          3 SAVE_INNTEKT(16),                                                   
            4 FNRNR          FIXED DEC (5),                                     
            4 FNR            PIC '(11)9',                                       
            4 TYPENR         FIXED DEC (5),                                     
            4 TYPE           CHAR(1),                                           
            4 ETYPENR        FIXED DEC (5),                                     
            4 ETYPE          CHAR(1),                                           
            4 ÅRNR           FIXED DEC (5),                                     
            4 ÅR             PIC '(4)9',                                        
            4 ARTNR          FIXED DEC (5),                                     
            4 ART            PIC '(1)9',                                        
            4 MERKENR        FIXED DEC (5),                                     
            4 MERKE          PIC '(1)9',                                        
            4 KOMMNRNR       FIXED DEC (5),                                     
            4 KOMMNR         PIC '(4)9',                                        
            4 PG_INNTEKTNR   FIXED DEC (5),                                     
            4 PG_INNTEKT     PIC '(9)9',                                        
            4 AGIVKODENR     FIXED DEC (5),                                     
            4 AGIVKODE       PIC '(3)9';                                        
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   INPUT OMRÅDER FOR G_TAB OG G_V_TAB                              */        
 /* ***************************************************************** */        
                                                                                
     DCL GRUNN_OMR1          CHAR  (1440);                                      
     DCL GRUNN_OMR2          CHAR  (1440);                                      
     DCL GRUNN_IDENT         CHAR  ( 8);                                        
     DCL Y2K_DATO_X          CHAR(8)                     ; /*Y2K*/              
     DCL Y2K_DATO_N          PIC '(8)9'                  ; /*Y2K*/              
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   FUNKSJONER, PEKERE                                              */        
 /* ***************************************************************** */        
                                                                                
    DCL (ADDR, VERIFY, LOW, CSTG, ONCODE, SUBSTR, DATE, TIME,DATETIME,          
         UNSPEC, STG)                                          BUILTIN;         
                                                                                
    DCL BMSMAPBR              POINTER;                                          
    DCL COMMAREA_PEKER        POINTER;                                          
                                                                                
    DCL IN_RBA                POINTER;                                          
                                                                                
                                                                                
 /* ************************************************************** */           
 /*   DATOBEHANDLING                                               */           
 /* ************************************************************** */           
                                                                                
    DCL                                                                         
        01 DATO                  PIC '(8)9'; /*Y2K*/                            
    DCL                                                                         
        01 DATO_REDEF DEF DATO,                                                 
           02 DAG                PIC '(2)9',                                    
           02 MND                PIC '(2)9',                                    
           02 ÅR                 PIC '(4)9'; /*Y2K*/                            
                                                                                
    DCL                                                                         
        01 HDATO                 PIC '(8)9'; /*Y2K*/                            
    DCL                                                                         
        01 HDATO_REDEF DEF HDATO,                                               
           02 ÅR                 PIC '(4)9', /*Y2K*/                            
           02 MND                PIC '(2)9',                                    
           02 DAG                PIC '(2)9';                                    
                                                                                
    DCL 1 TID,                                                                  
          2 TID1                 CHAR (6), /* TT,MM,.SEK    */                  
          2 TID2                 CHAR (3); /* MILL.SEK.     */                  
    DCL TID_D     DEFINED   TID  CHAR (9);                                      
                                                                                
                                                                                
 /* ************************************************************** */           
 /*  INDEKSER, BRYTERE                                             */           
 /* ************************************************************** */           
                                                                                
    DCL                                                                         
        W01_ULIK                  BIT(1),                                       
        W01_STOR                  BIT(1),                                       
        FEIL_FUNNET               BIT(1),                                       
        FEIL_I_SØKER              BIT(1),                                       
        K                         FIXED BIN(15) INIT(0),                        
        I                         FIXED BIN(15) INIT(0),                        
        FEIL                      FIXED BIN(15) INIT(0),                        
        FEIL_I                    FIXED BIN(15) INIT(0);                        
                                                                                
                                                                                
 /* ************************************************************** */           
 /*  FELTER FOR MAP-BEHANDLING OG FIL-BEHANDLING                   */           
 /* ************************************************************** */           
                                                                                
    DCL                                                                         
        ONKODE                    PIC'9999',                                    
        ONK DEF ONKODE            CHAR(4),                                      
        CURSOR_POS                FIXED BIN(15) INIT(-1);                       
                                                                                
                                                                                
 /* ************************************************************** */           
 /*  FEILBEHANDLING                                                */           
 /* ************************************************************** */           
                                                                                
    DCL MELDING                   CHAR     (77)      INIT(' ');                 
    DCL FEILKODE                  CHAR     ( 4);                                
    DCL DSNAVN                    CHAR     ( 7);                                
    DCL ANT_FEIL_SKREVET          FIXED DEC( 3);                                
                                                                                
    DCL SYSPRINT                  FILE PRINT;                                   
                                                                                
                                                                                
 %PAGE;                                                                         
    /* ************************************************************** */        
    /*   SLUTT PÅ DEKLARASJONENE .   EKSEKVERINGEN STARTER            */        
    /* ************************************************************** */        
                                                                                
                                                                                
                                                                                
                                                                                
        ON ERROR SNAP BEGIN     ;                                               
           ON ERROR SYSTEM      ;                                               
           ONKODE=ONCODE        ;                                               
           FEILKODE = 'FEIL'    ;                                               
           DSNAVN = EIBDS       ;                                               
           GO TO FEILBEH        ;                                               
        END;                                                                    
                                                                                
        EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                              
                                                                                
        W01_ULIK = '0'B     ;                                                   
        W01_STOR = '0'B     ;                                                   
        FEILKODE = 'FEIL'   ;                                                   
        DSNAVN   = '       ';                                                   
                                                                                
        KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER =                                   
                                         ADDR(KOM_OMR.DIV_PARAM_OMR);           
                                                                                
        KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER =                                 
                                         ADDR(KOM_OMR.TRANS_LISTE_OMR);         
        KOM_OMR.PEKER_LISTE.TRANS_PEKER    = ADDR(KOM_OMR.TRANS_OMR);           
        KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  =                                 
                                         ADDR(KOM_OMR.TRANS_OPPL_OMR);          
        KOM_OMR.PEKER_LISTE.STYRINGS_PEKER = ADDR(KOM_OMR.STYRINGS_OMR);        
                                                                                
        KOM_OMR.GV_PEKER          = ADDR (GRUNN_OMR1             );             
        KOM_OMR.G_PEKER           = ADDR (GRUNN_OMR2             );             
                                                                                
        GV_TAB_RE       = '' ;                                                  
        G_TAB_RE        = '' ;                                                  
                                                                                
        GRUNN_IDENT               = 'P0019924';                                 
                                                                                
        CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                          
                                                                                
        GRUNN_IDENT               = 'P0019925';                                 
                                                                                
        CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                          
                                                                                
        IF FRA_CICS THEN                                                        
           DO;                                                                  
                                                                                
              TRANS_OMR       = ''   ;     /*  BLANK_INNTEKT      */            
              TRANS_LISTE_OMR = ''   ;     /*  BLANK_KTRL_INNTEKT */            
                                                                                
              FRA_CICS = '0'B;                                                  
                                                                                
           END;                                                                 
                                                                                
 RECEIVE_MAP:                                                                   
                                                                                
        EXEC CICS RECEIVE MAP('S001I09')                                        
                                     MAPSET('S001I93') SET(BMSMAPBR);           
        CALL BLANK_MELDNR;                                                      
        FEIL_MELD_NR = 0;                                                       
                                                                                
        IF S001I09I.FUNKSJONSKODEL > 0 THEN                                     
           DO;                                                                  
              IF S001I09I.FUNKSJONSKODEI = 'R'    &                             
                 TRANSKODE      = 'RI9C' THEN                                   
                 DO;                                                            
                                                                                
                    /* ********************************************** */        
                    /* DET FØRSTE REGISTRERINGSBILDET SKRIVES UT      */        
                    /* IGJEN.                                         */        
                    /* ********************************************** */        
                                                                                
                    TRANSKODE = 'RI9B';                                         
                                                                                
                    SAVE_INNTEKT = INNTEKT;                                     
                    INNTEKT      = KTRL_INNTEKT;                                
                    KTRL_INNTEKT = SAVE_INNTEKT;                                
                                                                                
                    CALL OVERFØR_INNTEKT_MAP;                                   
                                                                                
                    S001I09O.MELDING1O = (77)' ';                               
                    S001I09O.MELDING2O = (77)' ';                               
                    S001I09O.MELDING3O = (77)' ';                               
                    S001I09O.MELDING4O = (77)' ';                               
                    S001I09O.MELDING5O = (77)' ';                               
                    S001I09O.MELDING6O = (77)' ';                               
                                                                                
                                                                                
                    EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')             
                                          DATAONLY ERASEAUP CURSOR;             
                                                                                
                    EXEC CICS RETURN TRANSID(TRANSKODE)                         
                                     COMMAREA(KOM_OMR);                         
                 END;                                                           
                                                                                
              IF S001I09I.FUNKSJONSKODEI = 'X' THEN                             
                 DO;                                                            
                                                                                
                    /* ********************************************** */        
                    /* PAUSEBILDET SKRIVES UT                         */        
                    /* ********************************************** */        
                                                                                
                    EXEC CICS SEND MAP ('S001012') MAPSET ('S001I93')           
                                                   MAPONLY ERASE;               
                    EXEC CICS RETURN;                                           
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
                                                                                
        ANT_FEIL_SKREVET = 0;                                                   
        FEIL_FUNNET      = '0'B;                                                
        FEIL_I_SØKER     = '0'B;                                                
                                                                                
        /* ************************************************* */                 
        /* OPPLYSNINGENE PÅ BILDET OVERFØRES TIL TRANS_OMR   */                 
        /* OG KONTROLLERES.                                  */                 
        /* ************************************************* */                 
                                                                                
        CALL OVERFØR_INNTEKT;                                                   
                                                                                
        CALL KONTROLL_INNTEKT(FEIL_I_SØKER);                                    
                                                                                
                                                                                
        IF FEIL_I_SØKER = '0'B THEN                                             
           FEIL_FUNNET = '0'B;                                                  
        ELSE                                                                    
           FEIL_FUNNET = '1'B;                                                  
                                                                                
        IF FEIL_FUNNET THEN                                                     
           DO;                                                                  
                                                                                
              /* ************************************************* */           
              /* FEIL ER FUNNET. BILDET SENDES UT MED FEIL-        */           
              /* MELDINGER.                                        */           
              /* ************************************************* */           
                                                                                
              CALL OVERFØR_INNTEKT_MAP;                                         
                                                                                
              EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')                   
                                          DATAONLY ERASEAUP CURSOR;             
                                                                                
              FEIL_MELD_NR = 666; /* => FEIL_FUNNET ER SATT. */                 
                                                                                
           END;                                                                 
                                                                                
        ELSE                                                                    
           DO;                                                                  
                                                                                
              IF TRANSKODE = 'RI9B' THEN                                        
                 DO;                                                            
                                                                                
                    /* ******************************************* */           
                    /* DET FØRSTE BILDET ER KONTROLLERT OG FEIL-   */           
                    /* FRITT.  OPPLYSNINGENE FLYTTES OVER I KTRL_  */           
                    /* INNTEKT, OG BILDET GJØRES KLART FOR         */           
                    /* KONTROLLREGISTRERING.                       */           
                    /* ******************************************* */           
                                                                                
                    TRANSKODE = 'RI9C';                                         
                                                                                
                    IF KTRL_INNTEKT.FNR(1) ^= 0 THEN                            
                       DO;                                                      
                          SAVE_INNTEKT = INNTEKT;                               
                          INNTEKT      = KTRL_INNTEKT;                          
                          KTRL_INNTEKT = SAVE_INNTEKT;                          
                          CALL OVERFØR_INNTEKT_MAP;                             
                          S001I09O.MELDING1O = 'KONTROLLREGISTRER ' !!          
                                               'INNTEKTENE.';                   
                       END;                                                     
                    ELSE                                                        
                       DO;                                                      
                          CALL OVERFØR_INNTEKT_HOPPL_MAP;                       
                          KTRL_INNTEKT = INNTEKT;                               
                          INNTEKT = ''    ;                                     
                          DO I = 1 TO 16;                                       
                             INNTEKT.FNR(I) = KTRL_INNTEKT.FNR(I);              
                          END;                                                  
                       END;                                                     
                                                                                
        /* FØDSELSNUMMER BLOKKERES FOR REGISTRERING.          */                
                                                                                
                    S001I09O.FNR1A = DFHBMASK;                                  
                    S001I09O.FNR2A = DFHBMASK;                                  
                    S001I09O.FNR3A = DFHBMASK;                                  
                    S001I09O.FNR4A = DFHBMASK;                                  
                    S001I09O.FNR5A = DFHBMASK;                                  
                    S001I09O.FNR6A = DFHBMASK;                                  
                    S001I09O.FNR7A = DFHBMASK;                                  
                    S001I09O.FNR8A = DFHBMASK;                                  
                    S001I09O.FNR9A = DFHBMASK;                                  
                    S001I09O.FNR10A = DFHBMASK;                                 
                    S001I09O.FNR11A = DFHBMASK;                                 
                    S001I09O.FNR12A = DFHBMASK;                                 
                    S001I09O.FNR13A = DFHBMASK;                                 
                    S001I09O.FNR14A = DFHBMASK;                                 
                    S001I09O.FNR15A = DFHBMASK;                                 
                    S001I09O.FNR16A = DFHBMASK;                                 
                                                                                
                    EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')             
                                                  MAPONLY ERASE;                
                                                                                
                    EXEC CICS SEND MAP('S001I09') MAPSET('S001I93')             
                                                  DATAONLY CURSOR;              
                                                                                
                 END;                                                           
              ELSE                                                              
                 DO;                                                            
                                                                                
                    /* ******************************************* */           
                    /* DET ANDRE BILDET ER KONTROLLERT OG FEIL-    */           
                    /* FRITT.  DET SJEKKES AT DE TO REGISTRERINGENE*/           
                    /* ER LIKE.  HVIS IKKE SENDES UT FEILMELDING.  */           
                    /* ******************************************* */           
                                                                                
                    DO I = 1 TO 16 WHILE(KTRL_INNTEKT.FNR(I) > 0);              
                       IF KTRL_INNTEKT.TYPE (I)   ^= INNTEKT.TYPE(I)   !        
                          KTRL_INNTEKT.ETYPE(I)   ^= INNTEKT.ETYPE(I)  !        
                          KTRL_INNTEKT.ÅR (I)     ^= INNTEKT.ÅR (I)    !        
                          KTRL_INNTEKT.ART (I)    ^= INNTEKT.ART (I)   !        
                          KTRL_INNTEKT.MERKE(I)   ^= INNTEKT.MERKE(I)  !        
                          KTRL_INNTEKT.KOMMNR(I)  ^= INNTEKT.KOMMNR(I) !        
                          KTRL_INNTEKT.PG_INNTEKT(I) ^=                         
                                                INNTEKT.PG_INNTEKT(I)  !        
                          KTRL_INNTEKT.AGIVKODE(I) ^=                           
                                                INNTEKT.AGIVKODE(I) THEN        
                          DO;                                                   
                             FEIL_I = I;                                        
                             W01_ULIK = '1'B;                                   
                             I = 16 ;                                           
                          END;                                                  
                       ELSE                                                     
                          IF KTRL_INNTEKT.PG_INNTEKT(I) > 500000 !              
                             KTRL_INNTEKT.PG_INNTEKT(I) = 500000 THEN           
                             DO;                                                
                                FEIL_I = I;                                     
                                W01_STOR = '1'B;                                
                                I = 16 ;                                        
                             END;                                               
                    END;                                                        
                                                                                
                    IF W01_ULIK !                                               
                       W01_STOR THEN                                            
                       DO;                                                      
                          S001I09O.MELDING1O = (77)' ';                         
                          S001I09O.MELDING2O = (77)' ';                         
                          S001I09O.MELDING3O = (77)' ';                         
                          S001I09O.MELDING4O = (77)' ';                         
                          S001I09O.MELDING5O = (77)' ';                         
                          S001I09O.MELDING6O = (77)' ';                         
                                                                                
                          IF W01_ULIK THEN                                      
                             IF INNTEKT.PG_INNTEKT(FEIL_I) > 500000 !           
                                INNTEKT.PG_INNTEKT(FEIL_I) =                    
                                                         500000 THEN            
                                DO;                                             
                                   S001I09O.MELDING2O =                         
                                                'KONTROLLLINJE ULIK' !!         
                                               ' 1.REGISTRERTE LINJE.';         
                                                                                
                                   S001I09O.MELDING3O =                         
                                            'KONTROLLER HØY INNTEKT!.';         
                                END;                                            
                             ELSE                                               
                                S001I09O.MELDING2O =                            
                                                'KONTROLLLINJE ULIK' !!         
                                               ' 1.REGISTRERTE LINJE.';         
                          ELSE                                                  
                             S001I09O.MELDING2O =                               
                                            'KONTROLLER HØY INNTEKT!.';         
                                                                                
                          CALL SETT_ATTRIBUTTER;                                
                                                                                
                          W01_ULIK = '0'B;                                      
  /*                      W01_STOR = '0'B;   */                                 
                                                                                
                          TRANSKODE = 'RI9C';                                   
                                                                                
                          CALL OVERFØR_INNTEKT_MAP;                             
                                                                                
                          EXEC CICS SEND MAP('S001I09')                         
                                                      MAPSET('S001I93')         
                                                      DATAONLY CURSOR;          
                                                                                
                          TRANSKODE = 'RI9C';                                   
                                                                                
  /* TILLEGG 02/01-90 AV TUYEN */                                               
                                                                                
                          IF W01_STOR THEN                                      
                             DO;                                                
                                W01_STOR = '0'B;                                
                                EXEC CICS RECEIVE MAP('S001I09')                
                                  MAPSET('S001I93')                             
                                  SET(BMSMAPBR);                                
                                GO TO OPPDAT ;                                  
                             END;                                               
                       END;                                                     
                    ELSE                                                        
                       DO;                                                      
                                                                                
  OPPDAT:                                                                       
  /* TIL HIT */                                                                 
                          /* ************************************* */           
                          /* REGISTRERINGENE ER NÅ RIKTIGE.        */           
                          /* OPPDATER_FILER FORETAR VIDERE BEHAND- */           
                          /* LING.  KLAR FOR NY REGISTRERING.      */           
                          /* ************************************* */           
                                                                                
                          CALL OPPDATER_FILER;                                  
                                                                                
                          EXEC CICS SEND MAP('S001I09')                         
                                         MAPSET('S001I93')                      
                                         MAPONLY ERASE;                         
                                                                                
                          FRA_CICS     = '1'B;                                  
                          TRANSKODE    = 'RI9B';                                
                       END;                                                     
                 END;                                                           
           END;                                                                 
                                                                                
        EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                  
                                                                                
                                                                                
 FEILBEH:                                                                       
                                                                                
        EXEC CICS HANDLE CONDITION ERROR(ABEND);                                
                                                                                
        PROGRAM_ID = 'R001I903';                                                
                                                                                
        ALLOCATE S001I09O;                                                      
                                                                                
        S001I09O.MELDING2O =                                                    
                                                                                
                 'F E I L  H A R  O P P S T Å T T ! ! !.';                      
                                                                                
        S001I09O.MELDING3O =                                                    
                 'EIBRCODE : ' !! UNSPEC(EIBRCODE);                             
                                                                                
        S001I09O.MELDING4O =                                                    
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE         
                                         !! '. DATASETT : ' !! DSNAVN;          
                                                                                
        S001I09O.MELDING5O =                                                    
                      'PROGRAMNAVN :  ' !! PROGRAM_ID !!                        
                      '.INGEN OPPDATERING ER BLITT UTFØRT.';                    
                                                                                
        S001I09O.MELDING6O =                                                    
                      'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';                
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I09')               MAPSET('S001I93');          
                                                                                
        EXEC CICS RECEIVE MAP('S001I09')                                        
                                       MAPSET('S001I93') SET(BMSMAPBR);         
                                                                                
                                                                                
        EXEC CICS SYNCPOINT ROLLBACK;                                           
                                                                                
                                                                                
        TERMINERINGS_IND = 'F';                                                 
                                                                                
                                                                                
 ABEND:                                                                         
        EXEC CICS ABEND ABCODE(FEIL);                                           
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*           I N T E R N E     P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* SETTER CURSOR PÅ DEN LINJEN SOM ER FEIL                           */        
 /* ***************************************************************** */        
 SETT_ATTRIBUTTER: PROC;                                                        
                                                                                
        SELECT (FEIL_I);                                                        
           WHEN (1)                                                             
              S001I09I.TYPE1L = CURSOR_POS;                                     
           WHEN (2)                                                             
              S001I09I.TYPE2L = CURSOR_POS;                                     
           WHEN (3)                                                             
              S001I09I.TYPE3L = CURSOR_POS;                                     
           WHEN (4)                                                             
              S001I09I.TYPE4L = CURSOR_POS;                                     
           WHEN (5)                                                             
              S001I09I.TYPE5L = CURSOR_POS;                                     
           WHEN (6)                                                             
              S001I09I.TYPE6L = CURSOR_POS;                                     
           WHEN (7)                                                             
              S001I09I.TYPE7L = CURSOR_POS;                                     
           WHEN (8)                                                             
              S001I09I.TYPE8L = CURSOR_POS;                                     
           WHEN (9)                                                             
              S001I09I.TYPE9L = CURSOR_POS;                                     
           WHEN (10)                                                            
              S001I09I.TYPE10L = CURSOR_POS;                                    
           WHEN (11)                                                            
              S001I09I.TYPE11L = CURSOR_POS;                                    
           WHEN (12)                                                            
              S001I09I.TYPE12L = CURSOR_POS;                                    
           WHEN (13)                                                            
              S001I09I.TYPE13L = CURSOR_POS;                                    
           WHEN (14)                                                            
              S001I09I.TYPE14L = CURSOR_POS;                                    
           WHEN (15)                                                            
              S001I09I.TYPE15L = CURSOR_POS;                                    
           WHEN (16)                                                            
              S001I09I.TYPE16L = CURSOR_POS;                                    
           OTHERWISE;                                                           
        END;                                                                    
    END SETT_ATTRIBUTTER;                                                       
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*                                                                   */        
 /* PROSEDYREN OVERFØRER OPPL. OM INNT FRA SKJERMBILDET TIL           */        
 /*    TRANS_OMR I KOM_OMR.                                           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERFØR_INNTEKT:                                                               
    PROC;                                                                       
                                                                                
    DCL (TELL1,TELL2) FIXED BIN(15);                                            
                                                                                
        IF FNR1L > 0 THEN                                                       
           INNTEKT.FNR(1) = F_FELT_CHAR_PIC11(FNR1O);                           
                                                                                
        IF FNR2L > 0 THEN                                                       
           INNTEKT.FNR(2) = F_FELT_CHAR_PIC11(FNR2O);                           
                                                                                
        IF FNR3L > 0 THEN                                                       
           INNTEKT.FNR(3) = F_FELT_CHAR_PIC11(FNR3O);                           
                                                                                
        IF FNR4L > 0 THEN                                                       
           INNTEKT.FNR(4) = F_FELT_CHAR_PIC11(FNR4O);                           
                                                                                
        IF FNR5L > 0 THEN                                                       
           INNTEKT.FNR(5) = F_FELT_CHAR_PIC11(FNR5O);                           
                                                                                
        IF FNR6L > 0 THEN                                                       
           INNTEKT.FNR(6) = F_FELT_CHAR_PIC11(FNR6O);                           
                                                                                
        IF FNR7L > 0 THEN                                                       
           INNTEKT.FNR(7) = F_FELT_CHAR_PIC11(FNR7O);                           
                                                                                
        IF FNR8L > 0 THEN                                                       
           INNTEKT.FNR(8) = F_FELT_CHAR_PIC11(FNR8O);                           
                                                                                
        IF FNR9L > 0 THEN                                                       
           INNTEKT.FNR(9) = F_FELT_CHAR_PIC11(FNR9O);                           
                                                                                
        IF FNR10L > 0 THEN                                                      
           INNTEKT.FNR(10) = F_FELT_CHAR_PIC11(FNR10O);                         
                                                                                
        IF FNR11L > 0 THEN                                                      
           INNTEKT.FNR(11) = F_FELT_CHAR_PIC11(FNR11O);                         
                                                                                
        IF FNR12L > 0 THEN                                                      
           INNTEKT.FNR(12) = F_FELT_CHAR_PIC11(FNR12O);                         
                                                                                
        IF FNR13L > 0 THEN                                                      
           INNTEKT.FNR(13) = F_FELT_CHAR_PIC11(FNR13O);                         
                                                                                
        IF FNR14L > 0 THEN                                                      
           INNTEKT.FNR(14) = F_FELT_CHAR_PIC11(FNR14O);                         
                                                                                
        IF FNR15L > 0 THEN                                                      
           INNTEKT.FNR(15) = F_FELT_CHAR_PIC11(FNR15O);                         
                                                                                
        IF FNR16L > 0 THEN                                                      
           INNTEKT.FNR(16) = F_FELT_CHAR_PIC11(FNR16O);                         
                                                                                
                                                                                
                                                                                
                                                                                
        IF TYPE1L > 0 THEN                                                      
           INNTEKT.TYPE(1) = TYPE1O;                                            
                                                                                
        IF TYPE2L > 0 THEN                                                      
           INNTEKT.TYPE(2) = TYPE2O;                                            
                                                                                
        IF TYPE3L > 0 THEN                                                      
           INNTEKT.TYPE(3) = TYPE3O;                                            
                                                                                
        IF TYPE4L > 0 THEN                                                      
           INNTEKT.TYPE(4) = TYPE4O;                                            
                                                                                
        IF TYPE5L > 0 THEN                                                      
           INNTEKT.TYPE(5) = TYPE5O;                                            
                                                                                
        IF TYPE6L > 0 THEN                                                      
           INNTEKT.TYPE(6) = TYPE6O;                                            
                                                                                
        IF TYPE7L > 0 THEN                                                      
           INNTEKT.TYPE(7) = TYPE7O;                                            
                                                                                
        IF TYPE8L > 0 THEN                                                      
           INNTEKT.TYPE(8) = TYPE8O;                                            
                                                                                
        IF TYPE9L > 0 THEN                                                      
           INNTEKT.TYPE(9) = TYPE9O;                                            
                                                                                
        IF TYPE10L > 0 THEN                                                     
           INNTEKT.TYPE(10) = TYPE10O;                                          
                                                                                
        IF TYPE11L > 0 THEN                                                     
           INNTEKT.TYPE(11) = TYPE11O;                                          
                                                                                
        IF TYPE12L > 0 THEN                                                     
           INNTEKT.TYPE(12) = TYPE12O;                                          
                                                                                
        IF TYPE13L > 0 THEN                                                     
           INNTEKT.TYPE(13) = TYPE13O;                                          
                                                                                
        IF TYPE14L > 0 THEN                                                     
           INNTEKT.TYPE(14) = TYPE14O;                                          
                                                                                
        IF TYPE15L > 0 THEN                                                     
           INNTEKT.TYPE(15) = TYPE15O;                                          
                                                                                
        IF TYPE16L > 0 THEN                                                     
           INNTEKT.TYPE(16) = TYPE16O;                                          
                                                                                
                                                                                
                                                                                
                                                                                
        IF ETYPE1L > 0 THEN                                                     
           INNTEKT.ETYPE(1) = ETYPE1O;                                          
                                                                                
        IF ETYPE2L > 0 THEN                                                     
           INNTEKT.ETYPE(2) = ETYPE2O;                                          
                                                                                
        IF ETYPE3L > 0 THEN                                                     
           INNTEKT.ETYPE(3) = ETYPE3O;                                          
                                                                                
        IF ETYPE4L > 0 THEN                                                     
           INNTEKT.ETYPE(4) = ETYPE4O;                                          
                                                                                
        IF ETYPE5L > 0 THEN                                                     
           INNTEKT.ETYPE(5) = ETYPE5O;                                          
                                                                                
        IF ETYPE6L > 0 THEN                                                     
           INNTEKT.ETYPE(6) = ETYPE6O;                                          
                                                                                
        IF ETYPE7L > 0 THEN                                                     
           INNTEKT.ETYPE(7) = ETYPE7O;                                          
                                                                                
        IF ETYPE8L > 0 THEN                                                     
           INNTEKT.ETYPE(8) = ETYPE8O;                                          
                                                                                
        IF ETYPE9L > 0 THEN                                                     
           INNTEKT.ETYPE(9) = ETYPE9O;                                          
                                                                                
        IF ETYPE10L > 0 THEN                                                    
           INNTEKT.ETYPE(10) = ETYPE10O;                                        
                                                                                
        IF ETYPE11L > 0 THEN                                                    
           INNTEKT.ETYPE(11) = ETYPE11O;                                        
                                                                                
        IF ETYPE12L > 0 THEN                                                    
           INNTEKT.ETYPE(12) = ETYPE12O;                                        
                                                                                
        IF ETYPE13L > 0 THEN                                                    
           INNTEKT.ETYPE(13) = ETYPE13O;                                        
                                                                                
        IF ETYPE14L > 0 THEN                                                    
           INNTEKT.ETYPE(14) = ETYPE14O;                                        
                                                                                
        IF ETYPE15L > 0 THEN                                                    
           INNTEKT.ETYPE(15) = ETYPE15O;                                        
                                                                                
        IF ETYPE16L > 0 THEN                                                    
           INNTEKT.ETYPE(16) = ETYPE16O;                                        
                                                                                
                                                                                
                                                                                
                                                                                
        IF ÅR1L > 0 THEN                                                        
           INNTEKT.ÅR(1) =                                                      
                       F_FELT_CHAR_PIC2(ÅR1O);                                  
                                                                                
        IF ÅR2L > 0 THEN                                                        
           INNTEKT.ÅR(2) =                                                      
                       F_FELT_CHAR_PIC2(ÅR2O);                                  
                                                                                
        IF ÅR3L > 0 THEN                                                        
           INNTEKT.ÅR(3) =                                                      
                       F_FELT_CHAR_PIC2(ÅR3O);                                  
                                                                                
        IF ÅR4L > 0 THEN                                                        
           INNTEKT.ÅR(4) =                                                      
                       F_FELT_CHAR_PIC2(ÅR4O);                                  
                                                                                
        IF ÅR5L > 0 THEN                                                        
           INNTEKT.ÅR(5) =                                                      
                       F_FELT_CHAR_PIC2(ÅR5O);                                  
                                                                                
        IF ÅR6L > 0 THEN                                                        
           INNTEKT.ÅR(6) =                                                      
                       F_FELT_CHAR_PIC2(ÅR6O);                                  
                                                                                
        IF ÅR7L > 0 THEN                                                        
           INNTEKT.ÅR(7) =                                                      
                       F_FELT_CHAR_PIC2(ÅR7O);                                  
                                                                                
        IF ÅR8L > 0 THEN                                                        
           INNTEKT.ÅR(8) =                                                      
                       F_FELT_CHAR_PIC2(ÅR8O);                                  
                                                                                
        IF ÅR9L > 0 THEN                                                        
           INNTEKT.ÅR(9) =                                                      
                       F_FELT_CHAR_PIC2(ÅR9O);                                  
                                                                                
        IF ÅR10L > 0 THEN                                                       
           INNTEKT.ÅR(10) =                                                     
                       F_FELT_CHAR_PIC2(ÅR10O);                                 
                                                                                
        IF ÅR11L > 0 THEN                                                       
           INNTEKT.ÅR(11) =                                                     
                       F_FELT_CHAR_PIC2(ÅR11O);                                 
                                                                                
        IF ÅR12L > 0 THEN                                                       
           INNTEKT.ÅR(12) =                                                     
                       F_FELT_CHAR_PIC2(ÅR12O);                                 
                                                                                
        IF ÅR13L > 0 THEN                                                       
           INNTEKT.ÅR(13) =                                                     
                       F_FELT_CHAR_PIC2(ÅR13O);                                 
                                                                                
        IF ÅR14L > 0 THEN                                                       
           INNTEKT.ÅR(14) =                                                     
                       F_FELT_CHAR_PIC2(ÅR14O);                                 
                                                                                
        IF ÅR15L > 0 THEN                                                       
           INNTEKT.ÅR(15) =                                                     
                       F_FELT_CHAR_PIC2(ÅR15O);                                 
                                                                                
        IF ÅR16L > 0 THEN                                                       
           INNTEKT.ÅR(16) =                                                     
                       F_FELT_CHAR_PIC2(ÅR16O);                                 
                                                                                
                                                                                
                                                                                
                                                                                
        IF ART1L > 0 THEN                                                       
           INNTEKT.ART(1) =                                                     
                       F_FELT_CHAR_PIC1(ART1O);                                 
                                                                                
        IF ART2L > 0 THEN                                                       
           INNTEKT.ART(2) =                                                     
                       F_FELT_CHAR_PIC1(ART2O);                                 
                                                                                
        IF ART3L > 0 THEN                                                       
           INNTEKT.ART(3) =                                                     
                       F_FELT_CHAR_PIC1(ART3O);                                 
                                                                                
        IF ART4L > 0 THEN                                                       
           INNTEKT.ART(4) =                                                     
                       F_FELT_CHAR_PIC1(ART4O);                                 
                                                                                
        IF ART5L > 0 THEN                                                       
           INNTEKT.ART(5) =                                                     
                       F_FELT_CHAR_PIC1(ART5O);                                 
                                                                                
        IF ART6L > 0 THEN                                                       
           INNTEKT.ART(6) =                                                     
                       F_FELT_CHAR_PIC1(ART6O);                                 
                                                                                
        IF ART7L > 0 THEN                                                       
           INNTEKT.ART(7) =                                                     
                       F_FELT_CHAR_PIC1(ART7O);                                 
                                                                                
        IF ART8L > 0 THEN                                                       
           INNTEKT.ART(8) =                                                     
                       F_FELT_CHAR_PIC1(ART8O);                                 
                                                                                
        IF ART9L > 0 THEN                                                       
           INNTEKT.ART(9) =                                                     
                       F_FELT_CHAR_PIC1(ART9O);                                 
                                                                                
        IF ART10L > 0 THEN                                                      
           INNTEKT.ART(10) =                                                    
                       F_FELT_CHAR_PIC1(ART10O);                                
                                                                                
        IF ART11L > 0 THEN                                                      
           INNTEKT.ART(11) =                                                    
                       F_FELT_CHAR_PIC1(ART11O);                                
                                                                                
        IF ART12L > 0 THEN                                                      
           INNTEKT.ART(12) =                                                    
                       F_FELT_CHAR_PIC1(ART12O);                                
                                                                                
        IF ART13L > 0 THEN                                                      
           INNTEKT.ART(13) =                                                    
                       F_FELT_CHAR_PIC1(ART13O);                                
                                                                                
        IF ART14L > 0 THEN                                                      
           INNTEKT.ART(14) =                                                    
                       F_FELT_CHAR_PIC1(ART14O);                                
                                                                                
        IF ART15L > 0 THEN                                                      
           INNTEKT.ART(15) =                                                    
                       F_FELT_CHAR_PIC1(ART15O);                                
                                                                                
        IF ART16L > 0 THEN                                                      
           INNTEKT.ART(16) =                                                    
                       F_FELT_CHAR_PIC1(ART16O);                                
                                                                                
                                                                                
                                                                                
                                                                                
        IF MERKE1L > 0 THEN                                                     
           INNTEKT.MERKE(1) =                                                   
                       F_FELT_CHAR_PIC1(MERKE1O);                               
                                                                                
        IF MERKE2L > 0 THEN                                                     
           INNTEKT.MERKE(2) =                                                   
                       F_FELT_CHAR_PIC1(MERKE2O);                               
                                                                                
        IF MERKE3L > 0 THEN                                                     
           INNTEKT.MERKE(3) =                                                   
                       F_FELT_CHAR_PIC1(MERKE3O);                               
                                                                                
        IF MERKE4L > 0 THEN                                                     
           INNTEKT.MERKE(4) =                                                   
                       F_FELT_CHAR_PIC1(MERKE4O);                               
                                                                                
        IF MERKE5L > 0 THEN                                                     
           INNTEKT.MERKE(5) =                                                   
                       F_FELT_CHAR_PIC1(MERKE5O);                               
                                                                                
        IF MERKE6L > 0 THEN                                                     
           INNTEKT.MERKE(6) =                                                   
                       F_FELT_CHAR_PIC1(MERKE6O);                               
                                                                                
        IF MERKE7L > 0 THEN                                                     
           INNTEKT.MERKE(7) =                                                   
                       F_FELT_CHAR_PIC1(MERKE7O);                               
                                                                                
        IF MERKE8L > 0 THEN                                                     
           INNTEKT.MERKE(8) =                                                   
                       F_FELT_CHAR_PIC1(MERKE8O);                               
                                                                                
        IF MERKE9L > 0 THEN                                                     
           INNTEKT.MERKE(9) =                                                   
                       F_FELT_CHAR_PIC1(MERKE9O);                               
                                                                                
        IF MERKE10L > 0 THEN                                                    
           INNTEKT.MERKE(10) =                                                  
                       F_FELT_CHAR_PIC1(MERKE10O);                              
                                                                                
        IF MERKE11L > 0 THEN                                                    
           INNTEKT.MERKE(11) =                                                  
                       F_FELT_CHAR_PIC1(MERKE11O);                              
                                                                                
        IF MERKE12L > 0 THEN                                                    
           INNTEKT.MERKE(12) =                                                  
                       F_FELT_CHAR_PIC1(MERKE12O);                              
                                                                                
        IF MERKE13L > 0 THEN                                                    
           INNTEKT.MERKE(13) =                                                  
                       F_FELT_CHAR_PIC1(MERKE13O);                              
                                                                                
        IF MERKE14L > 0 THEN                                                    
           INNTEKT.MERKE(14) =                                                  
                       F_FELT_CHAR_PIC1(MERKE14O);                              
                                                                                
        IF MERKE15L > 0 THEN                                                    
           INNTEKT.MERKE(15) =                                                  
                       F_FELT_CHAR_PIC1(MERKE15O);                              
                                                                                
        IF MERKE16L > 0 THEN                                                    
           INNTEKT.MERKE(16) =                                                  
                       F_FELT_CHAR_PIC1(MERKE16O);                              
                                                                                
                                                                                
                                                                                
                                                                                
        IF KOMMNR1L > 0 THEN                                                    
           INNTEKT.KOMMNR(1) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR1O);                              
                                                                                
        IF KOMMNR2L > 0 THEN                                                    
           INNTEKT.KOMMNR(2) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR2O);                              
                                                                                
        IF KOMMNR3L > 0 THEN                                                    
           INNTEKT.KOMMNR(3) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR3O);                              
                                                                                
        IF KOMMNR4L > 0 THEN                                                    
           INNTEKT.KOMMNR(4) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR4O);                              
                                                                                
        IF KOMMNR5L > 0 THEN                                                    
           INNTEKT.KOMMNR(5) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR5O);                              
                                                                                
        IF KOMMNR6L > 0 THEN                                                    
           INNTEKT.KOMMNR(6) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR6O);                              
                                                                                
        IF KOMMNR7L > 0 THEN                                                    
           INNTEKT.KOMMNR(7) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR7O);                              
                                                                                
        IF KOMMNR8L > 0 THEN                                                    
           INNTEKT.KOMMNR(8) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR8O);                              
                                                                                
        IF KOMMNR9L > 0 THEN                                                    
           INNTEKT.KOMMNR(9) =                                                  
                       F_FELT_CHAR_PIC4(KOMMNR9O);                              
                                                                                
        IF KOMMNR10L > 0 THEN                                                   
           INNTEKT.KOMMNR(10) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR10O);                             
                                                                                
        IF KOMMNR11L > 0 THEN                                                   
           INNTEKT.KOMMNR(11) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR11O);                             
                                                                                
        IF KOMMNR12L > 0 THEN                                                   
           INNTEKT.KOMMNR(12) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR12O);                             
                                                                                
        IF KOMMNR13L > 0 THEN                                                   
           INNTEKT.KOMMNR(13) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR13O);                             
                                                                                
        IF KOMMNR14L > 0 THEN                                                   
           INNTEKT.KOMMNR(14) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR14O);                             
                                                                                
        IF KOMMNR15L > 0 THEN                                                   
           INNTEKT.KOMMNR(15) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR15O);                             
                                                                                
        IF KOMMNR16L > 0 THEN                                                   
           INNTEKT.KOMMNR(16) =                                                 
                       F_FELT_CHAR_PIC4(KOMMNR16O);                             
                                                                                
                                                                                
                                                                                
                                                                                
        IF INNTEKT1L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(1) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT1I);                             
                                                                                
        IF INNTEKT2L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(2) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT2I);                             
                                                                                
        IF INNTEKT3L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(3) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT3I);                             
                                                                                
        IF INNTEKT4L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(4) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT4I);                             
                                                                                
        IF INNTEKT5L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(5) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT5I);                             
                                                                                
        IF INNTEKT6L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(6) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT6I);                             
                                                                                
        IF INNTEKT7L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(7) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT7I);                             
                                                                                
        IF INNTEKT8L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(8) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT8I);                             
                                                                                
        IF INNTEKT9L > 0 THEN                                                   
           INNTEKT.PG_INNTEKT(9) =                                              
                       F_FELT_CHAR_PIC9(INNTEKT9I);                             
                                                                                
        IF INNTEKT10L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(10) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT10I);                            
                                                                                
        IF INNTEKT11L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(11) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT11I);                            
                                                                                
        IF INNTEKT12L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(12) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT12I);                            
                                                                                
        IF INNTEKT13L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(13) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT13I);                            
                                                                                
        IF INNTEKT14L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(14) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT14I);                            
                                                                                
        IF INNTEKT15L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(15) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT15I);                            
                                                                                
        IF INNTEKT16L > 0 THEN                                                  
           INNTEKT.PG_INNTEKT(16) =                                             
                       F_FELT_CHAR_PIC9(INNTEKT16I);                            
                                                                                
                                                                                
                                                                                
                                                                                
        IF AGIVKODE1L > 0 THEN                                                  
           INNTEKT.AGIVKODE(1) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE1I);                            
                                                                                
        IF AGIVKODE2L > 0 THEN                                                  
           INNTEKT.AGIVKODE(2) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE2I);                            
                                                                                
        IF AGIVKODE3L > 0 THEN                                                  
           INNTEKT.AGIVKODE(3) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE3I);                            
                                                                                
        IF AGIVKODE4L > 0 THEN                                                  
           INNTEKT.AGIVKODE(4) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE4I);                            
                                                                                
        IF AGIVKODE5L > 0 THEN                                                  
           INNTEKT.AGIVKODE(5) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE5I);                            
                                                                                
        IF AGIVKODE6L > 0 THEN                                                  
           INNTEKT.AGIVKODE(6) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE6I);                            
                                                                                
        IF AGIVKODE7L > 0 THEN                                                  
           INNTEKT.AGIVKODE(7) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE7I);                            
                                                                                
        IF AGIVKODE8L > 0 THEN                                                  
           INNTEKT.AGIVKODE(8) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE8I);                            
                                                                                
        IF AGIVKODE9L > 0 THEN                                                  
           INNTEKT.AGIVKODE(9) =                                                
                       F_FELT_CHAR_PIC3(AGIVKODE9I);                            
                                                                                
        IF AGIVKODE10L > 0 THEN                                                 
           INNTEKT.AGIVKODE(10) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE10I);                           
                                                                                
        IF AGIVKODE11L > 0 THEN                                                 
           INNTEKT.AGIVKODE(11) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE11I);                           
                                                                                
        IF AGIVKODE12L > 0 THEN                                                 
           INNTEKT.AGIVKODE(12) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE12I);                           
                                                                                
        IF AGIVKODE13L > 0 THEN                                                 
           INNTEKT.AGIVKODE(13) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE13I);                           
                                                                                
        IF AGIVKODE14L > 0 THEN                                                 
           INNTEKT.AGIVKODE(14) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE14I);                           
                                                                                
        IF AGIVKODE15L > 0 THEN                                                 
           INNTEKT.AGIVKODE(15) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE15I);                           
                                                                                
        IF AGIVKODE16L > 0 THEN                                                 
           INNTEKT.AGIVKODE(16) =                                               
                       F_FELT_CHAR_PIC3(AGIVKODE16I);                           
                                                                                
   /* HER NULLER EN TABELLEN ETTER DET FØRSTE ELEMENT SOM ER NULL */            
                                                                                
        DO TELL1 = 1 TO 16 UNTIL                                                
              (F_FELT_PIC_CHAR11(INNTEKT.FNR(TELL1)) = '00000000000');          
        END;                                                                    
                                                                                
        DO TELL2 = TELL1 TO 16;                                                 
           INNTEKT.FNR (TELL2)       = 0;                                       
           INNTEKT.ÅR  (TELL2)       = 0;                                       
           INNTEKT.TYPE (TELL2)      = ' ';                                     
           INNTEKT.ETYPE (TELL2)     = ' ';                                     
           INNTEKT.ART (TELL2)       = 0;                                       
           INNTEKT.MERKE (TELL2)     = 0;                                       
           INNTEKT.KOMMNR (TELL2)    = 0;                                       
           INNTEKT.PG_INNTEKT(TELL2) = 0;                                       
           INNTEKT.AGIVKODE (TELL2)  = 0;                                       
        END;                                                                    
                                                                                
    END OVERFØR_INNTEKT;                                                        
 %PAGE;                                /*  */                                   
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    KONTROLL AV INNTEKT.                                           */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 KONTROLL_INNTEKT:                                                              
    PROC (FEIL_FUNNET);                                                         
                                                                                
    DCL                                                                         
        FEIL_FUNNET             BIT (1);                                        
    DCL                                                                         
        KEY_BIT                 BIT(32) BASED (KEY_PEKER),                      
        KEY_PEKER               POINTER,                                        
        KOMMNR_RECL             CHAR (100);                                     
    DCL                                                                         
        KEY_BIT_ST              BIT(32) BASED (KEY_PEKER_ST),                   
        KEY_PEKER_ST            POINTER,                                        
        STRYK_RECL              CHAR (19),                                      
        KEY                     PIC '(13)9';                                    
    DCL                                                                         
        (FEIL19,                                                                
         FEIL20,                                                                
         FEIL21,                                                                
         FEIL22,                                                                
         FEIL23,                                                                
         FEIL24,                                                                
         FEIL25)                BIT (1);                                        
    DCL                                                                         
        ANT_LINJER              FIXED BIN(15);                                  
                                                                                
                                                                                
    DCL                                                                         
        1 FNR_REG,                                                              
          2 FNR                 FIXED DEC(11),                                  
          2 FNR2                FIXED DEC(11),                                  
          2 BRUKERID            CHAR     ( 4),                                  
                                                                                
        ALDER                   FIXED DEC (5);                                  
                                                                                
    DCL                                                                         
        W_FNR                   PIC'(11)9';                                     
    DCL                                                                         
        1 FNR DEF W_FNR,                                                        
          2 DAG                 PIC'(2)9',                                      
          2 MND                 PIC'(2)9',                                      
          2 AAR                 PIC'(2)9',                                      
          2 ÅRHUNDRE            PIC'9',                                         
          2 REST                PIC'(4)9';                                      
                                                                                
    DCL                                                                         
        HJ_MÅ                   PIC'(4)9';                                      
                                                                                
                                                                                
                                                                                
                                                                                
        FEIL19       = '0'B;                                                    
        FEIL20       = '0'B;                                                    
        FEIL21       = '0'B;                                                    
        FEIL22       = '0'B;                                                    
        FEIL23       = '0'B;                                                    
        FEIL24       = '0'B;                                                    
        FEIL25       = '0'B;                                                    
        FEIL_FUNNET  = '0'B;                                                    
                                                                                
                                                                                
        DO ANT_LINJER = 1 TO 16 WHILE                                           
                        (F_FELT_PIC_CHAR11(INNTEKT.FNR(ANT_LINJER) >            
                                                     '00000000000'));           
                                                                                
           W_FNR     = INNTEKT.FNR(ANT_LINJER);                                 
                                                                                
           IF ^F_NUMERISK                                                       
                      (F_FELT_PIC_CHAR11(INNTEKT.FNR(ANT_LINJER))) THEN         
              DO;                                                               
                 FEIL_FUNNET = '1'B;                                            
                 INNTEKT.FNRNR(ANT_LINJER) = 200;                               
              END;                                                              
           ELSE                                                                 
              IF ^F_GYLDIG_FNR(INNTEKT.FNR(ANT_LINJER)) THEN                    
                 DO;                                                            
                    FEIL_FUNNET = '1'B;                                         
                    INNTEKT.FNRNR(ANT_LINJER) = 1;                              
                 END;                                                           
              ELSE                                                              
                 DO;                                                            
                    FNR_REG.FNR = INNTEKT.FNR(ANT_LINJER);                      
                    EXEC CICS LINK PROGRAM('R0019906')                          
                                                    COMMAREA(FNR_REG);          
                    IF FNR_REG.FNR2 > 0 THEN                                    
                       DO;                                                      
                          INNTEKT.FNRNR(ANT_LINJER) = 203;                      
                          INNTEKT.FNR(ANT_LINJER) = FNR_REG.FNR2;               
                       END;                                                     
                 END;                                                           
                                                                                
           KEY_PEKER = ADDR(INNTEKT.KOMMNR(ANT_LINJER));                        
                                                                                
           IF VERIFY(INNTEKT.TYPE(ANT_LINJER),'BCDSU') ^= 0 THEN                
              DO;                                                               
                 IF ^FEIL20 THEN                                                
                    DO;                                                         
                       FEIL20 = '1'B;                                           
                       INNTEKT.TYPENR(ANT_LINJER) = 245;                        
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.TYPENR(ANT_LINJER) = 999;                           
              END;                                                              
                                                                                
           IF VERIFY(INNTEKT.ETYPE(ANT_LINJER),'019') ^= 0 THEN                 
              DO;                                                               
                 IF ^FEIL20 THEN                                                
                    DO;                                                         
                       FEIL20 = '1'B;                                           
                       INNTEKT.ETYPENR(ANT_LINJER) = 258;                       
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.ETYPENR(ANT_LINJER) = 999;                          
              END;                                                              
                                                                                
           IF ^F_NUMERISK                                                       
                       (F_FELT_PIC_CHAR2(INNTEKT.ÅR(ANT_LINJER))) THEN          
              DO;                                                               
                IF ^FEIL19 THEN                                                 
                   DO;                                                          
                      FEIL19 = '1'B;                                            
                      INNTEKT.ÅRNR(ANT_LINJER) = 200;                           
                   END;                                                         
                ELSE                                                            
                   INNTEKT.ÅRNR(ANT_LINJER) = 999;                              
              END;                                                              
                                                                                
           ELSE                                                                 
              IF INNTEKT.ÅR(ANT_LINJER) < 63 THEN                               
                 DO;                                                            
                    IF ^FEIL19 THEN                                             
                       DO;                                                      
                          FEIL19 = '1'B;                                        
                          INNTEKT.ÅRNR(ANT_LINJER) = 249;                       
                       END;                                                     
                    ELSE                                                        
                       INNTEKT.ÅRNR(ANT_LINJER) = 999;                          
                 END;                                                           
                                                                                
              ELSE                                                              
                 IF GV_TAB_ARRAY.INNTRAP_SPERREDATO                             
                               (INNTEKT.ÅR(ANT_LINJER)) = 999999 THEN           
                    DO;                                                         
                       IF ^FEIL19 THEN                                          
                          DO;                                                   
                             FEIL19 = '1'B;                                     
                             INNTEKT.ÅRNR(ANT_LINJER) = 249;                    
                          END;                                                  
                       ELSE                                                     
                          INNTEKT.ÅRNR(ANT_LINJER) = 999;                       
                    END;                                                        
                                                                                
                 ELSE                                                           
                    IF INNTEKT.ÅR(ANT_LINJER) < 67 THEN                         
                       DO;                                                      
                          IF ^FEIL19 THEN                                       
                             DO;                                                
                                FEIL19 = '1'B;                                  
                                INNTEKT.ÅRNR(ANT_LINJER) = 251;                 
                             END;                                               
                          ELSE                                                  
                             INNTEKT.ÅRNR(ANT_LINJER) = 999;                    
                       END;                                                     
                    ELSE                                                        
                                                                                
                       IF INNTEKT.FNRNR(ANT_LINJER) = 0 THEN                    
                                                                                
                          DO;                                                   
                             HJ_MÅ     = INNTEKT.ÅR(ANT_LINJER);                
                             ALDER     =                                        
                                F_ALDER(INNTEKT.FNR(ANT_LINJER),HJ_MÅ);         
                                                                                
                             IF ^(ALDER < 7000 &                                
                                  ALDER > 1600) THEN                            
                                DO;                                             
                                   IF ^FEIL19 THEN                              
                                      DO;                                       
                                         FEIL19 = '1'B;                         
                                         INNTEKT.ÅRNR(ANT_LINJER) = 252;        
                                      END;                                      
                                   ELSE                                         
                                      INNTEKT.ÅRNR(ANT_LINJER) = 999;           
                                END;                                            
                          END;                                                  
                                                                                
           IF ^F_NUMERISK(F_FELT_PIC_CHAR1(                                     
                                      INNTEKT.ART(ANT_LINJER))) THEN            
              DO;                                                               
                 IF ^FEIL21 THEN                                                
                    DO;                                                         
                       FEIL21 = '1'B;                                           
                       INNTEKT.ARTNR(ANT_LINJER) = 200;                         
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.ARTNR(ANT_LINJER) = 999;                            
              END;                                                              
           ELSE                                                                 
                                                                                
              IF VERIFY(F_FELT_PIC_CHAR1(                                       
                         INNTEKT.ART(ANT_LINJER)),'123') ^= 0 THEN              
                 DO;                                                            
                    IF ^FEIL21 THEN                                             
                       DO;                                                      
                          FEIL21 = '1'B;                                        
                          INNTEKT.ARTNR(ANT_LINJER) = 246;                      
                       END;                                                     
                    ELSE                                                        
                       INNTEKT.ARTNR(ANT_LINJER) = 999;                         
                 END;                                                           
                                                                                
              ELSE                                                              
                 IF ( INNTEKT.ART(ANT_LINJER) = 3 &                             
                      INNTEKT.TYPE(ANT_LINJER) ^= 'B' ) THEN                    
                    DO;                                                         
                       IF ^FEIL21 THEN                                          
                          DO;                                                   
                             FEIL21 = '1'B;                                     
                             INNTEKT.ARTNR(ANT_LINJER) = 285;                   
                          END;                                                  
                       ELSE                                                     
                          INNTEKT.ARTNR(ANT_LINJER) = 999;                      
                    END;                                                        
                                                                                
           IF ^F_NUMERISK(F_FELT_PIC_CHAR1(                                     
                                      INNTEKT.MERKE(ANT_LINJER))) THEN          
              DO;                                                               
                 IF ^FEIL22 THEN                                                
                    DO;                                                         
                       FEIL22 = '1'B;                                           
                       INNTEKT.MERKENR(ANT_LINJER) = 200;                       
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                          
              END;                                                              
           ELSE                                                                 
              IF VERIFY(F_FELT_PIC_CHAR1(                                       
                      INNTEKT.MERKE(ANT_LINJER)),'0123459') ^= 0 THEN           
                 DO;                                                            
                    IF ^FEIL22 THEN                                             
                       DO;                                                      
                          FEIL22 = '1'B;                                        
                          INNTEKT.MERKENR(ANT_LINJER) = 247;                    
                       END;                                                     
                    ELSE                                                        
                       INNTEKT.MERKENR(ANT_LINJER) = 999;                       
                 END;                                                           
                                                                                
                                                                                
           IF (INNTEKT.TYPE(ANT_LINJER) = 'B' &                                 
               INNTEKT.MERKE(ANT_LINJER) ^= 0 &                                 
               INNTEKT.MERKE(ANT_LINJER) ^= 1 &                                 
               INNTEKT.MERKE(ANT_LINJER) ^= 4) THEN                             
              DO;                                                               
                 IF ^FEIL22 THEN                                                
                    DO;                                                         
                       FEIL22 = '1'B;                                           
                       INNTEKT.MERKENR(ANT_LINJER) = 287;                       
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                        
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                          
              END;                                                              
                                                                                
                                                                                
           IF (INNTEKT.TYPE(ANT_LINJER) = 'C ' &                                
               INNTEKT.MERKE(ANT_LINJER) ^= 0) !                                
                                                                                
              (INNTEKT.TYPE(ANT_LINJER) = 'S ' &                                
               INNTEKT.MERKE(ANT_LINJER) ^= 0) !                                
                                                                                
              (INNTEKT.TYPE(ANT_LINJER) = 'U ' &                                
               INNTEKT.MERKE(ANT_LINJER) ^= 0) THEN                             
                                                                                
              DO;                                                               
                 IF ^FEIL22 THEN                                                
                    DO;                                                         
                       FEIL22 = '1'B;                                           
                       INNTEKT.MERKENR(ANT_LINJER) = 286;                       
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                        
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                          
              END;                                                              
                                                                                
                                                                                
           IF (INNTEKT.TYPE(ANT_LINJER) = 'D ' &                                
               INNTEKT.MERKE(ANT_LINJER) ^= 0 &                                 
               INNTEKT.MERKE(ANT_LINJER) ^= 1 &                                 
               INNTEKT.MERKE(ANT_LINJER) ^= 2 &                                 
               INNTEKT.MERKE(ANT_LINJER) ^= 3) THEN                             
                                                                                
              DO;                                                               
                 IF ^FEIL22 THEN                                                
                    DO;                                                         
                       FEIL22 = '1'B;                                           
                       INNTEKT.MERKENR(ANT_LINJER) = 288;                       
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                        
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.MERKENR(ANT_LINJER) = 999;                          
              END;                                                              
                                                                                
                                                                                
           IF ^F_NUMERISK(F_FELT_PIC_CHAR4(                                     
                                      INNTEKT.KOMMNR(ANT_LINJER))) THEN         
              DO;                                                               
                 IF ^FEIL23 THEN                                                
                    DO;                                                         
                       FEIL23 = '1'B;                                           
                       INNTEKT.KOMMNRNR(ANT_LINJER) = 200;                      
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.KOMMNRNR(ANT_LINJER) = 999;                         
              END;                                                              
           ELSE                                                                 
              IF INNTEKT.TYPE(ANT_LINJER) = 'S' THEN                            
                 INNTEKT.KOMMNR(ANT_LINJER) = 0000;                             
              ELSE                                                              
                 DO;                                                            
                    EXEC CICS HANDLE CONDITION NOTFND(NOTFND1);                 
                    EXEC CICS READ DATASET ('LIKNING') RIDFLD(KEY_BIT)          
                                                    INTO(KOMMNR_RECL);          
                    GOTO KOMM_UT1;                                              
                NOTFND1:                                                        
                                                                                
    /* ENDRET 170787 BRITT: KOMMUNENR. SOM BEGYNNER MED 6 OG 7000 OG */         
    /*                   9000 ER GYLDIGE. FEILRAPP. 319.          */            
                                                                                
                    IF ^((INNTEKT.KOMMNR(ANT_LINJER) > 6000 &                   
                          INNTEKT.KOMMNR(ANT_LINJER) < 7001 ) !                 
                          INNTEKT.KOMMNR(ANT_LINJER) = 9000 ) THEN              
                       DO;                                                      
                          IF ^FEIL23 THEN                                       
                             DO;                                                
                                FEIL23 = '1'B;                                  
                                INNTEKT.KOMMNRNR(ANT_LINJER) = 248;             
                             END;                                               
                          ELSE                                                  
                             INNTEKT.KOMMNRNR(ANT_LINJER) = 999;                
                          LEAVE;                                                
                       END;                                                     
                KOMM_UT1:                                                       
                    IF INNTEKT.TYPE(ANT_LINJER) = 'U' &                         
                       INNTEKT.KOMMNR(ANT_LINJER) ^= 0301 THEN                  
                       IF ^FEIL23 THEN                                          
                          DO;                                                   
                             FEIL23 = '1'B;                                     
                             INNTEKT.KOMMNRNR(ANT_LINJER) = 248;                
                          END;                                                  
                 END;                                                           
                                                                                
                                                                                
           IF ^F_NUMERISK(F_FELT_PIC_CHAR3(                                     
                                    INNTEKT.AGIVKODE(ANT_LINJER))) THEN         
              DO;                                                               
                 IF ^FEIL25 THEN                                                
                    DO;                                                         
                       FEIL25 = '1'B;                                           
                       INNTEKT.AGIVKODENR(ANT_LINJER) = 200;                    
                    END;                                                        
                 ELSE                                                           
                    INNTEKT.AGIVKODENR(ANT_LINJER) = 999;                       
              END;                                                              
           ELSE                                                                 
              IF INNTEKT.AGIVKODE(ANT_LINJER) > 0 &                             
                 INNTEKT.TYPE(ANT_LINJER) ^= 'D' THEN                           
                 DO;                                                            
                    IF ^FEIL20 THEN                                             
                       DO;                                                      
                          FEIL20 = '1'B;                                        
                          INNTEKT.TYPENR(ANT_LINJER) = 257;                     
                       END;                                                     
                    ELSE                                                        
                       INNTEKT.TYPENR(ANT_LINJER) = 999;                        
                 END;                                                           
                                                                                
           KEY       = INNTEKT.FNR(ANT_LINJER) * 100 +                          
                       INNTEKT.ÅR(ANT_LINJER);                                  
           KEY_PEKER_ST = ADDR(KEY);                                            
                                                                                
           EXEC CICS HANDLE CONDITION NOTFND(ALT_OK1);                          
           EXEC CICS READ DATASET ('STRYK') RIDFLD(KEY_BIT_ST)                  
                                               INTO(STRYK_RECL);                
           IF ^FEIL19 THEN                                                      
              DO;                                                               
                 FEIL19 = '1'B;                                                 
                 INNTEKT.ÅRNR(ANT_LINJER) = 266;                                
              END;                                                              
           ELSE                                                                 
              INNTEKT.ÅRNR(ANT_LINJER) = 999;                                   
                                                                                
 ALT_OK1:                                                                       
        END;                                                                    
                                                                                
                                                                                
        IF ANT_LINJER = 1 THEN                                                  
           DO;                                                                  
              INNTEKT.FNRNR(ANT_LINJER) = 250;                                  
              FEIL_FUNNET = '1'B;                                               
           END;                                                                 
                                                                                
                                                                                
        FEIL_FUNNET = FEIL_FUNNET ! FEIL19 ! FEIL20 ! FEIL21 ! FEIL22 !         
                                    FEIL23 ! FEIL24 ! FEIL25;                   
                                                                                
                                                                                
    END KONTROLL_INNTEKT;                                                       
 %PAGE;                                /*  */                                   
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    BLANKING AV MELDINGSNUMMER.                                    */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 BLANK_MELDNR:                                                                  
    PROC;                                                                       
        DO I = 1 TO 16;                                                         
           INNTEKT.FNRNR (I)       = 0;                                         
           INNTEKT.TYPENR (I)      = 0;                                         
           INNTEKT.ETYPENR (I)     = 0;                                         
           INNTEKT.ÅRNR (I)        = 0;                                         
           INNTEKT.ARTNR (I)       = 0;                                         
           INNTEKT.MERKENR (I)     = 0;                                         
           INNTEKT.KOMMNRNR (I)    = 0;                                         
           INNTEKT.PG_INNTEKTNR(I) = 0;                                         
           INNTEKT.AGIVKODENR (I)  = 0;                                         
        END;                                                                    
    END BLANK_MELDNR;                                                           
 %SKIP;                                                                         
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRA OVERFØRER DATA FRA INNTEKT_OMR TIL                    */        
 /*   SKJERMBILDE                                                     */        
 /*   MAP: S001I09                                                    */        
 /*   MAPSET: S001I93                                                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 OVERFØR_INNTEKT_MAP:                                                           
    PROC;                                                                       
    DCL                                                                         
        NORMAL CHAR (1) INIT(' '),                                              
        NOR_NUM CHAR (1) INIT('&'),                                             
        BRI_NUM CHAR (1) INIT('Q');                                             
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(1)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR1O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(1));          
              S001I09O.ÅR1O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(1)) ;           
              S001I09O.TYPE1O     = INNTEKT.TYPE(1)                ;            
              S001I09O.ETYPE1O    = INNTEKT.ETYPE(1)               ;            
              S001I09O.ART1O      = F_FELT_PIC_CHAR1(INNTEKT.ART(1)) ;          
              S001I09O.MERKE1O    =                                             
                                F_FELT_PIC_CHAR1(INNTEKT.MERKE(1)) ;            
              S001I09O.KOMMNR1O   =                                             
                                F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(1));            
              S001I09O.INNTEKT1O  =                                             
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(1));        
              S001I09O.AGIVKODE1O =                                             
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(1)) ;         
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(2)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR2O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(2));          
              S001I09O.ÅR2O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(2)) ;           
              S001I09O.TYPE2O     = INNTEKT.TYPE(2)                ;            
              S001I09O.ETYPE2O    = INNTEKT.ETYPE(2)               ;            
              S001I09O.ART2O      = F_FELT_PIC_CHAR1(INNTEKT.ART(2)) ;          
              S001I09O.MERKE2O    =                                             
                              F_FELT_PIC_CHAR1(INNTEKT.MERKE(2)) ;              
              S001I09O.KOMMNR2O   =                                             
                              F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(2));              
              S001I09O.INNTEKT2O  =                                             
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(2)) ;         
              S001I09O.AGIVKODE2O =                                             
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(2)) ;           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(3)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR3O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(3));          
              S001I09O.ÅR3O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(3)) ;           
              S001I09O.TYPE3O     = INNTEKT.TYPE(3)                ;            
              S001I09O.ETYPE3O    = INNTEKT.ETYPE(3)               ;            
              S001I09O.ART3O      = F_FELT_PIC_CHAR1(INNTEKT.ART(3)) ;          
              S001I09O.MERKE3O    =                                             
                                F_FELT_PIC_CHAR1(INNTEKT.MERKE(3)) ;            
              S001I09O.KOMMNR3O   =                                             
                                F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(3));            
              S001I09O.INNTEKT3O  =                                             
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(3));        
              S001I09O.AGIVKODE3O =                                             
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(3)) ;         
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(4)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR4O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(4));          
              S001I09O.ÅR4O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(4)) ;           
              S001I09O.TYPE4O     = INNTEKT.TYPE(4)                ;            
              S001I09O.ETYPE4O    = INNTEKT.ETYPE(4)               ;            
              S001I09O.ART4O      = F_FELT_PIC_CHAR1(INNTEKT.ART(4)) ;          
              S001I09O.MERKE4O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(4));         
              S001I09O.KOMMNR4O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(4));        
              S001I09O.INNTEKT4O  =                                             
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(4)) ;         
              S001I09O.AGIVKODE4O =                                             
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(4)) ;           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(5)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR5O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(5));          
              S001I09O.ÅR5O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(5)) ;           
              S001I09O.TYPE5O     = INNTEKT.TYPE(5)                ;            
              S001I09O.ETYPE5O    = INNTEKT.ETYPE(5)               ;            
              S001I09O.ART5O      = F_FELT_PIC_CHAR1(INNTEKT.ART(5)) ;          
              S001I09O.MERKE5O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(5));         
              S001I09O.KOMMNR5O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(5));        
              S001I09O.INNTEKT5O  =                                             
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(5));        
              S001I09O.AGIVKODE5O =                                             
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(5)) ;         
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(6)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR6O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(6));          
              S001I09O.ÅR6O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(6)) ;           
              S001I09O.TYPE6O     = INNTEKT.TYPE(6)                ;            
              S001I09O.ETYPE6O    = INNTEKT.ETYPE(6)               ;            
              S001I09O.ART6O      = F_FELT_PIC_CHAR1(INNTEKT.ART(6)) ;          
              S001I09O.MERKE6O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(6));         
              S001I09O.KOMMNR6O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(6));        
              S001I09O.INNTEKT6O  =                                             
                               F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(6));         
              S001I09O.AGIVKODE6O =                                             
                               F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(6)) ;          
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(7)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR7O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(7));          
              S001I09O.ÅR7O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(7)) ;           
              S001I09O.TYPE7O     = INNTEKT.TYPE(7)                ;            
              S001I09O.ETYPE7O    = INNTEKT.ETYPE(7)                ;           
              S001I09O.ART7O      = F_FELT_PIC_CHAR1(INNTEKT.ART(7)) ;          
              S001I09O.MERKE7O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(7));         
              S001I09O.KOMMNR7O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(7));        
              S001I09O.INNTEKT7O  =                                             
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(7));        
              S001I09O.AGIVKODE7O =                                             
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(7)) ;         
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(8)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR8O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(8));          
              S001I09O.ÅR8O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(8)) ;           
              S001I09O.TYPE8O     = INNTEKT.TYPE(8)                ;            
              S001I09O.ETYPE8O    = INNTEKT.ETYPE(8)               ;            
              S001I09O.ART8O      = F_FELT_PIC_CHAR1(INNTEKT.ART(8)) ;          
              S001I09O.MERKE8O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(8));         
              S001I09O.KOMMNR8O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(8));        
              S001I09O.INNTEKT8O  =                                             
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(8)) ;         
              S001I09O.AGIVKODE8O =                                             
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(8)) ;           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(9)) ^= (11)'0' THEN                    
           DO;                                                                  
              S001I09O.FNR9O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(9));          
              S001I09O.ÅR9O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(9)) ;           
              S001I09O.TYPE9O     = INNTEKT.TYPE(9)                ;            
              S001I09O.ETYPE9O    = INNTEKT.ETYPE(9)               ;            
              S001I09O.ART9O      = F_FELT_PIC_CHAR1(INNTEKT.ART(9)) ;          
              S001I09O.MERKE9O    = F_FELT_PIC_CHAR1(INNTEKT.MERKE(9));         
              S001I09O.KOMMNR9O   = F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(9));        
              S001I09O.INNTEKT9O  =                                             
                                F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(9));        
              S001I09O.AGIVKODE9O =                                             
                                F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(9)) ;         
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(10)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR10O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(10));        
              S001I09O.ÅR10O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(10)) ;         
              S001I09O.TYPE10O     = INNTEKT.TYPE(10)                ;          
              S001I09O.ETYPE10O    = INNTEKT.ETYPE(10)               ;          
              S001I09O.ART10O      = F_FELT_PIC_CHAR1(INNTEKT.ART(10));         
              S001I09O.MERKE10O    =                                            
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(10));               
              S001I09O.KOMMNR10O   =                                            
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(10));              
              S001I09O.INNTEKT10O  =                                            
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(10)) ;         
              S001I09O.AGIVKODE10O =                                            
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(10)) ;           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(11)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR11O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(11));        
              S001I09O.ÅR11O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(11)) ;         
              S001I09O.TYPE11O     = INNTEKT.TYPE(11)                ;          
              S001I09O.ETYPE11O    = INNTEKT.ETYPE(11)               ;          
              S001I09O.ART11O      = F_FELT_PIC_CHAR1(INNTEKT.ART(11));         
              S001I09O.MERKE11O    =                                            
                               F_FELT_PIC_CHAR1(INNTEKT.MERKE(11)) ;            
              S001I09O.KOMMNR11O   =                                            
                               F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(11));            
              S001I09O.INNTEKT11O  =                                            
                               F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(11));        
              S001I09O.AGIVKODE11O =                                            
                               F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(11));          
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(12)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR12O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(12));        
              S001I09O.ÅR12O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(12)) ;         
              S001I09O.ETYPE12O    = INNTEKT.ETYPE(12)               ;          
              S001I09O.TYPE12O     = INNTEKT.TYPE(12)                ;          
              S001I09O.ART12O      = F_FELT_PIC_CHAR1(INNTEKT.ART(12));         
              S001I09O.MERKE12O    =                                            
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(12)) ;              
              S001I09O.KOMMNR12O   =                                            
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(12));              
              S001I09O.INNTEKT12O  =                                            
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(12)) ;         
              S001I09O.AGIVKODE12O =                                            
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(12)) ;           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(13)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR13O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(13));        
              S001I09O.ÅR13O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(13)) ;         
              S001I09O.TYPE13O     = INNTEKT.TYPE(13)                ;          
              S001I09O.ETYPE13O    = INNTEKT.ETYPE(13)               ;          
              S001I09O.ART13O      = F_FELT_PIC_CHAR1(INNTEKT.ART(13));         
              S001I09O.MERKE13O    =                                            
                              F_FELT_PIC_CHAR1(INNTEKT.MERKE(13)) ;             
              S001I09O.KOMMNR13O   =                                            
                              F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(13));             
              S001I09O.INNTEKT13O  =                                            
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(13));         
              S001I09O.AGIVKODE13O =                                            
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(13)) ;          
           END;                                                                 
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(14)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR14O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(14));        
              S001I09O.ÅR14O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(14)) ;         
              S001I09O.TYPE14O     = INNTEKT.TYPE(14)                ;          
              S001I09O.ETYPE14O    = INNTEKT.ETYPE(14)               ;          
              S001I09O.ART14O      = F_FELT_PIC_CHAR1(INNTEKT.ART(14));         
              S001I09O.MERKE14O    =                                            
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(14)) ;              
              S001I09O.KOMMNR14O   =                                            
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(14));              
              S001I09O.INNTEKT14O  =                                            
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(14)) ;         
              S001I09O.AGIVKODE14O =                                            
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(14)) ;           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(15)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR15O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(15));        
              S001I09O.ÅR15O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(15)) ;         
              S001I09O.TYPE15O     = INNTEKT.TYPE(15)                ;          
              S001I09O.ETYPE15O    = INNTEKT.ETYPE(15)               ;          
              S001I09O.ART15O      = F_FELT_PIC_CHAR1(INNTEKT.ART(15));         
              S001I09O.MERKE15O    =                                            
                              F_FELT_PIC_CHAR1(INNTEKT.MERKE(15)) ;             
              S001I09O.KOMMNR15O   =                                            
                              F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(15));             
              S001I09O.INNTEKT15O  =                                            
                              F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(15));         
              S001I09O.AGIVKODE15O =                                            
                              F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(15));           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(16)) ^= (11)'0' THEN                   
           DO;                                                                  
              S001I09O.FNR16O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(16));        
              S001I09O.ÅR16O       = F_FELT_PIC_CHAR2(INNTEKT.ÅR(16)) ;         
              S001I09O.TYPE16O     = INNTEKT.TYPE(16)                ;          
              S001I09O.ETYPE16O    = INNTEKT.ETYPE(16)               ;          
              S001I09O.ART16O      = F_FELT_PIC_CHAR1(INNTEKT.ART(16));         
              S001I09O.MERKE16O    =                                            
                             F_FELT_PIC_CHAR1(INNTEKT.MERKE(16)) ;              
              S001I09O.KOMMNR16O   =                                            
                             F_FELT_PIC_CHAR4(INNTEKT.KOMMNR(16));              
              S001I09O.INNTEKT16O =                                             
                             F_FELT_PIC_CHAR9(INNTEKT.PG_INNTEKT(16));          
              S001I09O.AGIVKODE16O =                                            
                             F_FELT_PIC_CHAR3(INNTEKT.AGIVKODE(16)) ;           
           END;                                                                 
                                                                                
                                                                                
 /* *********************************************** */                          
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                          
 /* *********************************************** */                          
                                                                                
        S001I09O.DUMMYA = '_';                                                  
                                                                                
                                                                                
        IF INNTEKT.FNRNR(1) = 0 THEN                                            
           S001I09O.FNR1A = NOR_NUM;                                            
        ELSE                                                                    
           DO;                                                                  
              S001I09O.FNR1A = BRI_NUM;                                         
              S001I09I.FNR1L = CURSOR_POS;                                      
              IF INNTEKT.FNRNR(1) ^= 999 THEN                                   
                 CALL SKRIV_FEIL(INNTEKT.FNRNR(1));                             
           END;                                                                 
                                                                                
        IF INNTEKT.ÅRNR(1) = 0 THEN                                             
           S001I09O.ÅR1A = NOR_NUM;                                             
        ELSE                                                                    
           DO;                                                                  
              S001I09O.ÅR1A = BRI_NUM;                                          
              S001I09I.ÅR1L = CURSOR_POS;                                       
              IF INNTEKT.ÅRNR(1) ^= 999 THEN                                    
                 CALL SKRIV_FEIL(INNTEKT.ÅRNR(1));                              
           END;                                                                 
                                                                                
        IF INNTEKT.ETYPENR(1) = 0 THEN                                          
           S001I09O.ETYPE1A = NORMAL;                                           
        ELSE                                                                    
           DO;                                                                  
              S001I09O.ETYPE1A = DFHBMBRY;                                      
              S001I09I.ETYPE1L = CURSOR_POS;                                    
              IF INNTEKT.ETYPENR(1) ^= 999 THEN                                 
                 CALL SKRIV_FEIL(INNTEKT.ETYPENR(1));                           
           END;                                                                 
                                                                                
        IF INNTEKT.TYPENR(1) = 0 THEN                                           
           S001I09O.TYPE1A = NORMAL;                                            
        ELSE                                                                    
           DO;                                                                  
              S001I09O.TYPE1A = DFHBMBRY;                                       
              S001I09I.TYPE1L = CURSOR_POS;                                     
              IF INNTEKT.TYPENR(1) ^= 999 THEN                                  
                 CALL SKRIV_FEIL(INNTEKT.TYPENR(1));                            
           END;                                                                 
                                                                                
        IF INNTEKT.ARTNR(1) = 0 THEN                                            
              S001I09O.ART1A = NOR_NUM;                                         
        ELSE                                                                    
           DO;                                                                  
              S001I09O.ART1A = BRI_NUM;                                         
              S001I09I.ART1L = CURSOR_POS;                                      
              IF INNTEKT.ARTNR(1) ^= 999 THEN                                   
                 CALL SKRIV_FEIL(INNTEKT.ARTNR(1));                             
           END;                                                                 
                                                                                
        IF INNTEKT.MERKENR(1) = 0 THEN                                          
           S001I09O.MERKE1A = NOR_NUM;                                          
        ELSE                                                                    
           DO;                                                                  
              S001I09O.MERKE1A = BRI_NUM;                                       
              S001I09I.MERKE1L = CURSOR_POS;                                    
              IF INNTEKT.MERKENR(1) ^= 999 THEN                                 
                 CALL SKRIV_FEIL(INNTEKT.MERKENR(1));                           
           END;                                                                 
                                                                                
        IF INNTEKT.KOMMNRNR(1) = 0 THEN                                         
           S001I09O.KOMMNR1A = NOR_NUM;                                         
        ELSE                                                                    
           DO;                                                                  
              S001I09O.KOMMNR1A = BRI_NUM;                                      
              S001I09I.KOMMNR1L = CURSOR_POS;                                   
              IF INNTEKT.KOMMNRNR(1) ^= 999 THEN                                
                 CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(1));                          
           END;                                                                 
                                                                                
        IF INNTEKT.PG_INNTEKTNR(1) = 0 THEN                                     
           S001I09O.INNTEKT1A = NOR_NUM;                                        
        ELSE                                                                    
           DO;                                                                  
              S001I09O.INNTEKT1A = BRI_NUM;                                     
              S001I09I.INNTEKT1L = CURSOR_POS;                                  
              IF INNTEKT.PG_INNTEKTNR(1) ^= 999 THEN                            
                 CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(1));                      
           END;                                                                 
                                                                                
        IF INNTEKT.AGIVKODENR(1) = 0 THEN                                       
           S001I09O.AGIVKODE1A = NOR_NUM;                                       
        ELSE                                                                    
           DO;                                                                  
              S001I09O.AGIVKODE1A = BRI_NUM;                                    
              S001I09I.AGIVKODE1L = CURSOR_POS;                                 
              IF INNTEKT.AGIVKODENR(1) ^= 999 THEN                              
                 CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(1));                        
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(2)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(2) = 0 THEN                                      
                 S001I09O.FNR2A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR2A = BRI_NUM;                                   
                    S001I09I.FNR2L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(2) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(2));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(2) = 0 THEN                                       
                 S001I09O.ÅR2A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR2A = BRI_NUM;                                    
                    S001I09I.ÅR2L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(2) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(2));                        
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(2) = 0 THEN                                    
                 S001I09O.ETYPE2A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE2A = DFHBMBRY;                                
                    S001I09I.ETYPE2L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(2) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(2));                     
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(2) = 0 THEN                                     
                 S001I09O.TYPE2A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE2A = DFHBMBRY;                                 
                    S001I09I.TYPE2L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(2) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(2));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(2) = 0 THEN                                      
                 S001I09O.ART2A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART2A = BRI_NUM;                                   
                    S001I09I.ART2L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(2) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(2));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(2) = 0 THEN                                    
                 S001I09O.MERKE2A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE2A = BRI_NUM;                                 
                    S001I09I.MERKE2L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(2) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(2));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(2) = 0 THEN                                   
                 S001I09O.KOMMNR2A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR2A = BRI_NUM;                                
                    S001I09I.KOMMNR2L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(2) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(2));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(2) = 0 THEN                               
                 S001I09O.INNTEKT2A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT2A = BRI_NUM;                               
                    S001I09I.INNTEKT2L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(2) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(2));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(2) = 0 THEN                                 
                 S001I09O.AGIVKODE2A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE2A = BRI_NUM;                              
                    S001I09I.AGIVKODE2L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(2) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(2));                  
                 END;                                                           
                                                                                
           END;                                                                 
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(3)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(3) = 0 THEN                                      
                 S001I09O.FNR3A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR3A = BRI_NUM;                                   
                    S001I09I.FNR3L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(3) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(3));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(3) = 0 THEN                                       
                 S001I09O.ÅR3A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR3A = BRI_NUM;                                    
                    S001I09I.ÅR3L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(3) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(3));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(3) = 0 THEN                                     
                 S001I09O.TYPE3A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE3A = DFHBMBRY;                                 
                    S001I09I.TYPE3L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(3) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(3));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(3) = 0 THEN                                    
                 S001I09O.ETYPE3A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE3A = DFHBMBRY;                                
                    S001I09I.ETYPE3L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(3) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(3));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(3) = 0 THEN                                      
                 S001I09O.ART3A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART3A = BRI_NUM;                                   
                    S001I09I.ART3L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(3) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(3));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(3) = 0 THEN                                    
                 S001I09O.MERKE3A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE3A = BRI_NUM;                                 
                    S001I09I.MERKE3L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(3) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(3));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(3) = 0 THEN                                   
                 S001I09O.KOMMNR3A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR3A = BRI_NUM;                                
                    S001I09I.KOMMNR3L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(3) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(3));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(3) = 0 THEN                               
                 S001I09O.INNTEKT3A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT3A = BRI_NUM;                               
                    S001I09I.INNTEKT3L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(3) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(3));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(3) = 0 THEN                                 
                 S001I09O.AGIVKODE3A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE3A = BRI_NUM;                              
                    S001I09I.AGIVKODE3L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(3) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(3));                  
                 END;                                                           
                                                                                
           END;                                                                 
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(4)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(4) = 0 THEN                                      
                 S001I09O.FNR4A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR4A = BRI_NUM;                                   
                    S001I09I.FNR4L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(4) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(4));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(4) = 0 THEN                                       
                 S001I09O.ÅR4A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR4A = BRI_NUM;                                    
                    S001I09I.ÅR4L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(4) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(4));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(4) = 0 THEN                                     
                 S001I09O.TYPE4A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE4A = DFHBMBRY;                                 
                    S001I09I.TYPE4L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(4) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(4));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(4) = 0 THEN                                    
                 S001I09O.ETYPE4A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE4A = DFHBMBRY;                                
                    S001I09I.ETYPE4L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(4) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(4));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(4) = 0 THEN                                      
                 S001I09O.ART4A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART4A = BRI_NUM;                                   
                    S001I09I.ART4L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(4) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(4));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(4) = 0 THEN                                    
                 S001I09O.MERKE4A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE4A = BRI_NUM;                                 
                    S001I09I.MERKE4L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(4) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(4));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(4) = 0 THEN                                   
                 S001I09O.KOMMNR4A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR4A = BRI_NUM;                                
                    S001I09I.KOMMNR4L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(4) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(4));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(4) = 0 THEN                               
                 S001I09O.INNTEKT4A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT4A = BRI_NUM;                               
                    S001I09I.INNTEKT4L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(4) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(4));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(4) = 0 THEN                                 
                 S001I09O.AGIVKODE4A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE4A = BRI_NUM;                              
                    S001I09I.AGIVKODE4L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(4) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(4));                  
                 END;                                                           
                                                                                
           END;                                                                 
                                                                                
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(5)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(5) = 0 THEN                                      
                 S001I09O.FNR5A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR5A = BRI_NUM;                                   
                    S001I09I.FNR5L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(5) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(5));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(5) = 0 THEN                                       
                 S001I09O.ÅR5A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR5A = BRI_NUM;                                    
                    S001I09I.ÅR5L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(5) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(5));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(5) = 0 THEN                                     
                 S001I09O.TYPE5A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE5A = DFHBMBRY;                                 
                    S001I09I.TYPE5L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(5) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(5));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(5) = 0 THEN                                    
                 S001I09O.ETYPE5A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE5A = DFHBMBRY;                                
                    S001I09I.ETYPE5L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(5) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(5));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(5) = 0 THEN                                      
                 S001I09O.ART5A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART5A = BRI_NUM;                                   
                    S001I09I.ART5L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(5) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(5));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(5) = 0 THEN                                    
                 S001I09O.MERKE5A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE5A = BRI_NUM;                                 
                    S001I09I.MERKE5L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(5) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(5));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(5) = 0 THEN                                   
                 S001I09O.KOMMNR5A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR5A = BRI_NUM;                                
                    S001I09I.KOMMNR5L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(5) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(5));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(5) = 0 THEN                               
                 S001I09O.INNTEKT5A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT5A = BRI_NUM;                               
                    S001I09I.INNTEKT5L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(5) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(5));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(5) = 0 THEN                                 
                 S001I09O.AGIVKODE5A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE5A = BRI_NUM;                              
                    S001I09I.AGIVKODE5L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(5) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(5));                  
                 END;                                                           
                                                                                
           END;                                                                 
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(6)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(6) = 0 THEN                                      
                 S001I09O.FNR6A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR6A = BRI_NUM;                                   
                    S001I09I.FNR6L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(6) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(6));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(6) = 0 THEN                                       
                 S001I09O.ÅR6A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR6A = BRI_NUM;                                    
                    S001I09I.ÅR6L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(6) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(6));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(6) = 0 THEN                                     
                 S001I09O.TYPE6A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE6A = DFHBMBRY;                                 
                    S001I09I.TYPE6L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(6) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(6));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(6) = 0 THEN                                    
                 S001I09O.ETYPE6A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE6A = DFHBMBRY;                                
                    S001I09I.ETYPE6L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(6) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(6));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(6) = 0 THEN                                      
                 S001I09O.ART6A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART6A = BRI_NUM;                                   
                    S001I09I.ART6L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(6) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(6));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(6) = 0 THEN                                    
                 S001I09O.MERKE6A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE6A = BRI_NUM;                                 
                    S001I09I.MERKE6L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(6) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(6));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(6) = 0 THEN                                   
                 S001I09O.KOMMNR6A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR6A = BRI_NUM;                                
                    S001I09I.KOMMNR6L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(6) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(6));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(6) = 0 THEN                               
                 S001I09O.INNTEKT6A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT6A = BRI_NUM;                               
                    S001I09I.INNTEKT6L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(6) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(6));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(6) = 0 THEN                                 
                 S001I09O.AGIVKODE6A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE6A = BRI_NUM;                              
                    S001I09I.AGIVKODE6L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(6) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(6));                  
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(7)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(7) = 0 THEN                                      
                 S001I09O.FNR7A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR7A = BRI_NUM;                                   
                    S001I09I.FNR7L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(7) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(7));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(7) = 0 THEN                                       
                 S001I09O.ÅR7A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR7A = BRI_NUM;                                    
                    S001I09I.ÅR7L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(7) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(7));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(7) = 0 THEN                                     
                 S001I09O.TYPE7A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE7A = DFHBMBRY;                                 
                    S001I09I.TYPE7L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(7) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(7));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(7) = 0 THEN                                    
                 S001I09O.ETYPE7A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE7A = DFHBMBRY;                                
                    S001I09I.ETYPE7L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(7) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(7));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(7) = 0 THEN                                      
                 S001I09O.ART7A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART7A = BRI_NUM;                                   
                    S001I09I.ART7L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(7) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(7));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(7) = 0 THEN                                    
                 S001I09O.MERKE7A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE7A = BRI_NUM;                                 
                    S001I09I.MERKE7L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(7) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(7));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(7) = 0 THEN                                   
                 S001I09O.KOMMNR7A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR7A = BRI_NUM;                                
                    S001I09I.KOMMNR7L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(7) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(7));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(7) = 0 THEN                               
                 S001I09O.INNTEKT7A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT7A = BRI_NUM;                               
                    S001I09I.INNTEKT7L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(7) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(7));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(7) = 0 THEN                                 
                 S001I09O.AGIVKODE7A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE7A = BRI_NUM;                              
                    S001I09I.AGIVKODE7L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(7) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(7));                  
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(8)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(8) = 0 THEN                                      
                 S001I09O.FNR8A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR8A = BRI_NUM;                                   
                    S001I09I.FNR8L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(8) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(8));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(8) = 0 THEN                                       
                 S001I09O.ÅR8A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR8A = BRI_NUM;                                    
                    S001I09I.ÅR8L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(8) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(8));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(8) = 0 THEN                                     
                 S001I09O.TYPE8A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE8A = DFHBMBRY;                                 
                    S001I09I.TYPE8L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(8) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(8));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(8) = 0 THEN                                    
                 S001I09O.ETYPE8A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE8A = DFHBMBRY;                                
                    S001I09I.ETYPE8L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(8) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(8));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(8) = 0 THEN                                      
                 S001I09O.ART8A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART8A = BRI_NUM;                                   
                    S001I09I.ART8L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(8) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(8));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(8) = 0 THEN                                    
                 S001I09O.MERKE8A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE8A = BRI_NUM;                                 
                    S001I09I.MERKE8L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(8) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(8));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(8) = 0 THEN                                   
                 S001I09O.KOMMNR8A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR8A = BRI_NUM;                                
                    S001I09I.KOMMNR8L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(8) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(8));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(8) = 0 THEN                               
                 S001I09O.INNTEKT8A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT8A = BRI_NUM;                               
                    S001I09I.INNTEKT8L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(8) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(8));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(8) = 0 THEN                                 
                 S001I09O.AGIVKODE8A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE8A = BRI_NUM;                              
                    S001I09I.AGIVKODE8L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(8) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(8));                  
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(9)) ^= (11)'0' THEN                    
           DO;                                                                  
              IF INNTEKT.FNRNR(9) = 0 THEN                                      
                 S001I09O.FNR9A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR9A = BRI_NUM;                                   
                    S001I09I.FNR9L = CURSOR_POS;                                
                    IF INNTEKT.FNRNR(9) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(9));                       
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(9) = 0 THEN                                       
                 S001I09O.ÅR9A = NOR_NUM;                                       
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR9A = BRI_NUM;                                    
                    S001I09I.ÅR9L = CURSOR_POS;                                 
                    IF INNTEKT.ÅRNR(9) ^= 999 THEN                              
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(9));                        
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(9) = 0 THEN                                     
                 S001I09O.TYPE9A = NORMAL;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE9A = DFHBMBRY;                                 
                    S001I09I.TYPE9L = CURSOR_POS;                               
                    IF INNTEKT.TYPENR(9) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(9));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(9) = 0 THEN                                    
                 S001I09O.ETYPE9A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE9A = DFHBMBRY;                                
                    S001I09I.ETYPE9L = CURSOR_POS;                              
                    IF INNTEKT.ETYPENR(9) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(9));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(9) = 0 THEN                                      
                 S001I09O.ART9A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART9A = BRI_NUM;                                   
                    S001I09I.ART9L = CURSOR_POS;                                
                    IF INNTEKT.ARTNR(9) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(9));                       
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(9) = 0 THEN                                    
                 S001I09O.MERKE9A = NOR_NUM;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE9A = BRI_NUM;                                 
                    S001I09I.MERKE9L = CURSOR_POS;                              
                    IF INNTEKT.MERKENR(9) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(9));                     
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(9) = 0 THEN                                   
                 S001I09O.KOMMNR9A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR9A = BRI_NUM;                                
                    S001I09I.KOMMNR9L = CURSOR_POS;                             
                    IF INNTEKT.KOMMNRNR(9) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(9));                    
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(9) = 0 THEN                               
                 S001I09O.INNTEKT9A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT9A = BRI_NUM;                               
                    S001I09I.INNTEKT9L = CURSOR_POS;                            
                    IF INNTEKT.PG_INNTEKTNR(9) ^= 999 THEN                      
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(9));                
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(9) = 0 THEN                                 
                 S001I09O.AGIVKODE9A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE9A = BRI_NUM;                              
                    S001I09I.AGIVKODE9L = CURSOR_POS;                           
                    IF INNTEKT.AGIVKODENR(9) ^= 999 THEN                        
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(9));                  
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(10)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(10) = 0 THEN                                     
                 S001I09O.FNR10A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR10A = BRI_NUM;                                  
                    S001I09I.FNR10L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(10) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(10));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(10) = 0 THEN                                      
                 S001I09O.ÅR10A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR10A = BRI_NUM;                                   
                    S001I09I.ÅR10L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(10) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(10));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(10) = 0 THEN                                    
                 S001I09O.TYPE10A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE10A = DFHBMBRY;                                
                    S001I09I.TYPE10L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(10) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(10));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(10) = 0 THEN                                   
                 S001I09O.ETYPE10A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE10A = DFHBMBRY;                               
                    S001I09I.ETYPE10L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(10) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(10));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(10) = 0 THEN                                     
                 S001I09O.ART10A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART10A = BRI_NUM;                                  
                    S001I09I.ART10L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(10) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(10));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(10) = 0 THEN                                   
                 S001I09O.MERKE10A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE10A = BRI_NUM;                                
                    S001I09I.MERKE10L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(10) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(10));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(10) = 0 THEN                                  
                 S001I09O.KOMMNR10A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR10A = BRI_NUM;                               
                    S001I09I.KOMMNR10L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(10) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(10));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(10) = 0 THEN                              
                 S001I09O.INNTEKT10A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT10A = BRI_NUM;                              
                    S001I09I.INNTEKT10L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(10) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(10));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(10) = 0 THEN                                
                 S001I09O.AGIVKODE10A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE10A = BRI_NUM;                             
                    S001I09I.AGIVKODE10L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(10) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(10));                 
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(11)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(11) = 0 THEN                                     
                 S001I09O.FNR11A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR11A = BRI_NUM;                                  
                    S001I09I.FNR11L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(11) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(11));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(11) = 0 THEN                                      
                 S001I09O.ÅR11A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR11A = BRI_NUM;                                   
                    S001I09I.ÅR11L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(11) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(11));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(11) = 0 THEN                                    
                 S001I09O.TYPE11A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE11A = DFHBMBRY;                                
                    S001I09I.TYPE11L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(11) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(11));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(11) = 0 THEN                                   
                 S001I09O.ETYPE11A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE11A = DFHBMBRY;                               
                    S001I09I.ETYPE11L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(11) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(11));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(11) = 0 THEN                                     
                 S001I09O.ART11A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART11A = BRI_NUM;                                  
                    S001I09I.ART11L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(11) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(11));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(11) = 0 THEN                                   
                 S001I09O.MERKE11A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE11A = BRI_NUM;                                
                    S001I09I.MERKE11L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(11) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(11));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(11) = 0 THEN                                  
                 S001I09O.KOMMNR11A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR11A = BRI_NUM;                               
                    S001I09I.KOMMNR11L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(11) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(11));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(11) = 0 THEN                              
                 S001I09O.INNTEKT11A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT11A = BRI_NUM;                              
                    S001I09I.INNTEKT11L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(11) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(11));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(11) = 0 THEN                                
                 S001I09O.AGIVKODE11A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE11A = BRI_NUM;                             
                    S001I09I.AGIVKODE11L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(11) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(11));                 
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(12)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(12) = 0 THEN                                     
                 S001I09O.FNR12A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR12A = BRI_NUM;                                  
                    S001I09I.FNR12L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(12) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(12));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(12) = 0 THEN                                      
                 S001I09O.ÅR12A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR12A = BRI_NUM;                                   
                    S001I09I.ÅR12L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(12) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(12));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(12) = 0 THEN                                    
                 S001I09O.TYPE12A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE12A = DFHBMBRY;                                
                    S001I09I.TYPE12L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(12) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(12));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(12) = 0 THEN                                   
                 S001I09O.ETYPE12A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE12A = DFHBMBRY;                               
                    S001I09I.ETYPE12L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(12) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(12));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(12) = 0 THEN                                     
                 S001I09O.ART12A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART12A = BRI_NUM;                                  
                    S001I09I.ART12L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(12) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(12));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(12) = 0 THEN                                   
                 S001I09O.MERKE12A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE12A = BRI_NUM;                                
                    S001I09I.MERKE12L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(12) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(12));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(12) = 0 THEN                                  
                 S001I09O.KOMMNR12A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR12A = BRI_NUM;                               
                    S001I09I.KOMMNR12L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(12) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(12));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(12) = 0 THEN                              
                 S001I09O.INNTEKT12A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT12A = BRI_NUM;                              
                    S001I09I.INNTEKT12L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(12) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(12));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(12) = 0 THEN                                
                 S001I09O.AGIVKODE12A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE12A = BRI_NUM;                             
                    S001I09I.AGIVKODE12L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(12) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(12));                 
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(13)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(13) = 0 THEN                                     
                 S001I09O.FNR13A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR13A = BRI_NUM;                                  
                    S001I09I.FNR13L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(13) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(13));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(13) = 0 THEN                                      
                 S001I09O.ÅR13A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR13A = BRI_NUM;                                   
                    S001I09I.ÅR13L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(13) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(13));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(13) = 0 THEN                                    
                 S001I09O.TYPE13A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE13A = DFHBMBRY;                                
                    S001I09I.TYPE13L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(13) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(13));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(13) = 0 THEN                                   
                 S001I09O.ETYPE13A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE13A = DFHBMBRY;                               
                    S001I09I.ETYPE13L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(13) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(13));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(13) = 0 THEN                                     
                 S001I09O.ART13A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART13A = BRI_NUM;                                  
                    S001I09I.ART13L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(13) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(13));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(13) = 0 THEN                                   
                 S001I09O.MERKE13A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE13A = BRI_NUM;                                
                    S001I09I.MERKE13L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(13) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(13));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(13) = 0 THEN                                  
                 S001I09O.KOMMNR13A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR13A = BRI_NUM;                               
                    S001I09I.KOMMNR13L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(13) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(13));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(13) = 0 THEN                              
                 S001I09O.INNTEKT13A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT13A = BRI_NUM;                              
                    S001I09I.INNTEKT13L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(13) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(13));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(13) = 0 THEN                                
                 S001I09O.AGIVKODE13A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE13A = BRI_NUM;                             
                    S001I09I.AGIVKODE13L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(13) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(13));                 
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(14)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(14) = 0 THEN                                     
                 S001I09O.FNR14A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR14A = BRI_NUM;                                  
                    S001I09I.FNR14L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(14) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(14));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(14) = 0 THEN                                      
                 S001I09O.ÅR14A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR14A = BRI_NUM;                                   
                    S001I09I.ÅR14L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(14) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(14));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(14) = 0 THEN                                    
                 S001I09O.TYPE14A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE14A = DFHBMBRY;                                
                    S001I09I.TYPE14L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(14) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(14));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(14) = 0 THEN                                   
                 S001I09O.ETYPE14A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE14A = DFHBMBRY;                               
                    S001I09I.ETYPE14L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(14) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(14));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(14) = 0 THEN                                     
                 S001I09O.ART14A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART14A = BRI_NUM;                                  
                    S001I09I.ART14L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(14) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(14));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(14) = 0 THEN                                   
                 S001I09O.MERKE14A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE14A = BRI_NUM;                                
                    S001I09I.MERKE14L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(14) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(14));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(14) = 0 THEN                                  
                 S001I09O.KOMMNR14A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR14A = BRI_NUM;                               
                    S001I09I.KOMMNR14L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(14) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(14));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(14) = 0 THEN                              
                 S001I09O.INNTEKT14A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT14A = BRI_NUM;                              
                    S001I09I.INNTEKT14L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(14) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(14));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(14) = 0 THEN                                
                 S001I09O.AGIVKODE14A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE14A = BRI_NUM;                             
                    S001I09I.AGIVKODE14L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(14) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(14));                 
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(15)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(15) = 0 THEN                                     
                 S001I09O.FNR15A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR15A = BRI_NUM;                                  
                    S001I09I.FNR15L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(15) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(15));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(15) = 0 THEN                                      
                 S001I09O.ÅR15A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR15A = BRI_NUM;                                   
                    S001I09I.ÅR15L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(15) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(15));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(15) = 0 THEN                                    
                 S001I09O.TYPE15A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE15A = DFHBMBRY;                                
                    S001I09I.TYPE15L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(15) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(15));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(15) = 0 THEN                                   
                 S001I09O.ETYPE15A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE15A = DFHBMBRY;                               
                    S001I09I.ETYPE15L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(15) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(15));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(15) = 0 THEN                                     
                 S001I09O.ART15A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART15A = BRI_NUM;                                  
                    S001I09I.ART15L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(15) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(15));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(15) = 0 THEN                                   
                 S001I09O.MERKE15A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE15A = BRI_NUM;                                
                    S001I09I.MERKE15L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(15) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(15));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(15) = 0 THEN                                  
                 S001I09O.KOMMNR15A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR15A = BRI_NUM;                               
                    S001I09I.KOMMNR15L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(15) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(15));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(15) = 0 THEN                              
                 S001I09O.INNTEKT15A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT15A = BRI_NUM;                              
                    S001I09I.INNTEKT15L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(15) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(15));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(15) = 0 THEN                                
                 S001I09O.AGIVKODE15A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE15A = BRI_NUM;                             
                    S001I09I.AGIVKODE15L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(15) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(15));                 
                 END;                                                           
           END;                                                                 
                                                                                
                                                                                
        IF F_FELT_PIC_CHAR11(INNTEKT.FNR(16)) ^= (11)'0' THEN                   
           DO;                                                                  
              IF INNTEKT.FNRNR(16) = 0 THEN                                     
                 S001I09O.FNR16A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.FNR16A = BRI_NUM;                                  
                    S001I09I.FNR16L = CURSOR_POS;                               
                    IF INNTEKT.FNRNR(16) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.FNRNR(16));                      
                 END;                                                           
                                                                                
              IF INNTEKT.ÅRNR(16) = 0 THEN                                      
                 S001I09O.ÅR16A = NOR_NUM;                                      
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ÅR16A = BRI_NUM;                                   
                    S001I09I.ÅR16L = CURSOR_POS;                                
                    IF INNTEKT.ÅRNR(16) ^= 999 THEN                             
                       CALL SKRIV_FEIL(INNTEKT.ÅRNR(16));                       
                 END;                                                           
                                                                                
              IF INNTEKT.TYPENR(16) = 0 THEN                                    
                 S001I09O.TYPE16A = NORMAL;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.TYPE16A = DFHBMBRY;                                
                    S001I09I.TYPE16L = CURSOR_POS;                              
                    IF INNTEKT.TYPENR(16) ^= 999 THEN                           
                       CALL SKRIV_FEIL(INNTEKT.TYPENR(16));                     
                 END;                                                           
                                                                                
              IF INNTEKT.ETYPENR(16) = 0 THEN                                   
                 S001I09O.ETYPE16A = NORMAL;                                    
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ETYPE16A = DFHBMBRY;                               
                    S001I09I.ETYPE16L = CURSOR_POS;                             
                    IF INNTEKT.ETYPENR(16) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.ETYPENR(16));                    
                 END;                                                           
                                                                                
              IF INNTEKT.ARTNR(16) = 0 THEN                                     
                 S001I09O.ART16A = NOR_NUM;                                     
              ELSE                                                              
                 DO;                                                            
                    S001I09O.ART16A = BRI_NUM;                                  
                    S001I09I.ART16L = CURSOR_POS;                               
                    IF INNTEKT.ARTNR(16) ^= 999 THEN                            
                       CALL SKRIV_FEIL(INNTEKT.ARTNR(16));                      
                 END;                                                           
                                                                                
              IF INNTEKT.MERKENR(16) = 0 THEN                                   
                 S001I09O.MERKE16A = NOR_NUM;                                   
              ELSE                                                              
                 DO;                                                            
                    S001I09O.MERKE16A = BRI_NUM;                                
                    S001I09I.MERKE16L = CURSOR_POS;                             
                    IF INNTEKT.MERKENR(16) ^= 999 THEN                          
                       CALL SKRIV_FEIL(INNTEKT.MERKENR(16));                    
                 END;                                                           
                                                                                
              IF INNTEKT.KOMMNRNR(16) = 0 THEN                                  
                 S001I09O.KOMMNR16A = NOR_NUM;                                  
              ELSE                                                              
                 DO;                                                            
                    S001I09O.KOMMNR16A = BRI_NUM;                               
                    S001I09I.KOMMNR16L = CURSOR_POS;                            
                    IF INNTEKT.KOMMNRNR(16) ^= 999 THEN                         
                       CALL SKRIV_FEIL(INNTEKT.KOMMNRNR(16));                   
                 END;                                                           
                                                                                
              IF INNTEKT.PG_INNTEKTNR(16) = 0 THEN                              
                 S001I09O.INNTEKT16A = NOR_NUM;                                 
              ELSE                                                              
                 DO;                                                            
                    S001I09O.INNTEKT16A = BRI_NUM;                              
                    S001I09I.INNTEKT16L = CURSOR_POS;                           
                    IF INNTEKT.PG_INNTEKTNR(16) ^= 999 THEN                     
                       CALL SKRIV_FEIL(INNTEKT.PG_INNTEKTNR(16));               
                 END;                                                           
                                                                                
              IF INNTEKT.AGIVKODENR(16) = 0 THEN                                
                 S001I09O.AGIVKODE16A = NOR_NUM;                                
              ELSE                                                              
                 DO;                                                            
                    S001I09O.AGIVKODE16A = BRI_NUM;                             
                    S001I09I.AGIVKODE16L = CURSOR_POS;                          
                    IF INNTEKT.AGIVKODENR(16) ^= 999 THEN                       
                       CALL SKRIV_FEIL(INNTEKT.AGIVKODENR(16));                 
                 END;                                                           
           END;                                                                 
                                                                                
    END OVERFØR_INNTEKT_MAP;                                                    
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRA OVERFØRER FNR OG ÅR FRA INNTEKT_OMR TIL               */        
 /*   SKJERMBILDE. RESTEN BLANKES.                                    */        
 /*   MAP: S001I09                                                    */        
 /*   MAPSET: S001I93                                                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 OVERFØR_INNTEKT_HOPPL_MAP:                                                     
    PROC;                                                                       
                                                                                
                                                                                
        S001I09O.FNR1O      = F_FELT_PIC_CHAR11(INNTEKT.FNR(1));                
                                                                                
        IF INNTEKT.FNR(2) ^= 0 THEN                                             
           S001I09O.FNR2O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(2));                
                                                                                
        IF INNTEKT.FNR(3) ^= 0 THEN                                             
           S001I09O.FNR3O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(3));                
                                                                                
        IF INNTEKT.FNR(4) ^= 0 THEN                                             
           S001I09O.FNR4O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(4));                
                                                                                
        IF INNTEKT.FNR(5) ^= 0 THEN                                             
           S001I09O.FNR5O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(5));                
                                                                                
        IF INNTEKT.FNR(6) ^= 0 THEN                                             
           S001I09O.FNR6O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(6));                
                                                                                
        IF INNTEKT.FNR(7) ^= 0 THEN                                             
           S001I09O.FNR7O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(7));                
                                                                                
        IF INNTEKT.FNR(8) ^= 0 THEN                                             
           S001I09O.FNR8O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(8));                
                                                                                
        IF INNTEKT.FNR(9) ^= 0 THEN                                             
           S001I09O.FNR9O   = F_FELT_PIC_CHAR11(INNTEKT.FNR(9));                
                                                                                
        IF INNTEKT.FNR(10) ^= 0 THEN                                            
           S001I09O.FNR10O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(10));               
                                                                                
        IF INNTEKT.FNR(11) ^= 0 THEN                                            
           S001I09O.FNR11O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(11));               
                                                                                
        IF INNTEKT.FNR(12) ^= 0 THEN                                            
           S001I09O.FNR12O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(12));               
                                                                                
        IF INNTEKT.FNR(13) ^= 0 THEN                                            
           S001I09O.FNR13O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(13));               
                                                                                
        IF INNTEKT.FNR(14) ^= 0 THEN                                            
           S001I09O.FNR14O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(14));               
                                                                                
        IF INNTEKT.FNR(15) ^= 0 THEN                                            
           S001I09O.FNR15O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(15));               
                                                                                
        IF INNTEKT.FNR(16) ^= 0 THEN                                            
           S001I09O.FNR16O  = F_FELT_PIC_CHAR11(INNTEKT.FNR(16));               
                                                                                
                                                                                
        S001I09I.TYPE1L     = CURSOR_POS;                                       
                                                                                
        S001I09O.TYPE1O     = LOW(1);                                           
        S001I09O.TYPE2O     = LOW(1);                                           
        S001I09O.TYPE3O     = LOW(1);                                           
        S001I09O.TYPE4O     = LOW(1);                                           
        S001I09O.TYPE5O     = LOW(1);                                           
        S001I09O.TYPE6O     = LOW(1);                                           
        S001I09O.TYPE7O     = LOW(1);                                           
        S001I09O.TYPE8O     = LOW(1);                                           
        S001I09O.TYPE9O     = LOW(1);                                           
        S001I09O.TYPE10O    = LOW(1);                                           
        S001I09O.TYPE11O    = LOW(1);                                           
        S001I09O.TYPE12O    = LOW(1);                                           
        S001I09O.TYPE13O    = LOW(1);                                           
        S001I09O.TYPE14O    = LOW(1);                                           
        S001I09O.TYPE15O    = LOW(1);                                           
        S001I09O.TYPE16O    = LOW(1);                                           
                                                                                
        S001I09O.ETYPE1O    = LOW(1);                                           
        S001I09O.ETYPE2O    = LOW(1);                                           
        S001I09O.ETYPE3O    = LOW(1);                                           
        S001I09O.ETYPE4O    = LOW(1);                                           
        S001I09O.ETYPE5O    = LOW(1);                                           
        S001I09O.ETYPE6O    = LOW(1);                                           
        S001I09O.ETYPE7O    = LOW(1);                                           
        S001I09O.ETYPE8O    = LOW(1);                                           
        S001I09O.ETYPE9O    = LOW(1);                                           
        S001I09O.ETYPE10O   = LOW(1);                                           
        S001I09O.ETYPE11O   = LOW(1);                                           
        S001I09O.ETYPE12O   = LOW(1);                                           
        S001I09O.ETYPE13O   = LOW(1);                                           
        S001I09O.ETYPE14O   = LOW(1);                                           
        S001I09O.ETYPE15O   = LOW(1);                                           
        S001I09O.ETYPE16O   = LOW(1);                                           
                                                                                
        S001I09O.ÅR1O       = LOW(2);                                           
        S001I09O.ÅR2O       = LOW(2);                                           
        S001I09O.ÅR3O       = LOW(2);                                           
        S001I09O.ÅR4O       = LOW(2);                                           
        S001I09O.ÅR5O       = LOW(2);                                           
        S001I09O.ÅR6O       = LOW(2);                                           
        S001I09O.ÅR7O       = LOW(2);                                           
        S001I09O.ÅR8O       = LOW(2);                                           
        S001I09O.ÅR9O       = LOW(2);                                           
        S001I09O.ÅR10O      = LOW(2);                                           
        S001I09O.ÅR11O      = LOW(2);                                           
        S001I09O.ÅR12O      = LOW(2);                                           
        S001I09O.ÅR13O      = LOW(2);                                           
        S001I09O.ÅR14O      = LOW(2);                                           
        S001I09O.ÅR15O      = LOW(2);                                           
        S001I09O.ÅR16O      = LOW(2);                                           
                                                                                
        S001I09O.ART1O      = LOW(1);                                           
        S001I09O.ART2O      = LOW(1);                                           
        S001I09O.ART3O      = LOW(1);                                           
        S001I09O.ART4O      = LOW(1);                                           
        S001I09O.ART5O      = LOW(1);                                           
        S001I09O.ART6O      = LOW(1);                                           
        S001I09O.ART7O      = LOW(1);                                           
        S001I09O.ART8O      = LOW(1);                                           
        S001I09O.ART9O      = LOW(1);                                           
        S001I09O.ART10O     = LOW(1);                                           
        S001I09O.ART11O     = LOW(1);                                           
        S001I09O.ART12O     = LOW(1);                                           
        S001I09O.ART13O     = LOW(1);                                           
        S001I09O.ART14O     = LOW(1);                                           
        S001I09O.ART15O     = LOW(1);                                           
        S001I09O.ART16O     = LOW(1);                                           
                                                                                
        S001I09O.MERKE1O    = LOW(1);                                           
        S001I09O.MERKE2O    = LOW(1);                                           
        S001I09O.MERKE3O    = LOW(1);                                           
        S001I09O.MERKE4O    = LOW(1);                                           
        S001I09O.MERKE5O    = LOW(1);                                           
        S001I09O.MERKE6O    = LOW(1);                                           
        S001I09O.MERKE7O    = LOW(1);                                           
        S001I09O.MERKE8O    = LOW(1);                                           
        S001I09O.MERKE9O    = LOW(1);                                           
        S001I09O.MERKE10O   = LOW(1);                                           
        S001I09O.MERKE11O   = LOW(1);                                           
        S001I09O.MERKE12O   = LOW(1);                                           
        S001I09O.MERKE13O   = LOW(1);                                           
        S001I09O.MERKE14O   = LOW(1);                                           
        S001I09O.MERKE15O   = LOW(1);                                           
        S001I09O.MERKE16O   = LOW(1);                                           
                                                                                
        S001I09O.KOMMNR1O   = LOW(4);                                           
        S001I09O.KOMMNR2O   = LOW(4);                                           
        S001I09O.KOMMNR3O   = LOW(4);                                           
        S001I09O.KOMMNR4O   = LOW(4);                                           
        S001I09O.KOMMNR5O   = LOW(4);                                           
        S001I09O.KOMMNR6O   = LOW(4);                                           
        S001I09O.KOMMNR7O   = LOW(4);                                           
        S001I09O.KOMMNR8O   = LOW(4);                                           
        S001I09O.KOMMNR9O   = LOW(4);                                           
        S001I09O.KOMMNR10O  = LOW(4);                                           
        S001I09O.KOMMNR11O  = LOW(4);                                           
        S001I09O.KOMMNR12O  = LOW(4);                                           
        S001I09O.KOMMNR13O  = LOW(4);                                           
        S001I09O.KOMMNR14O  = LOW(4);                                           
        S001I09O.KOMMNR15O  = LOW(4);                                           
        S001I09O.KOMMNR16O  = LOW(4);                                           
                                                                                
        S001I09O.INNTEKT1O  = LOW(9);                                           
        S001I09O.INNTEKT2O  = LOW(9);                                           
        S001I09O.INNTEKT3O  = LOW(9);                                           
        S001I09O.INNTEKT4O  = LOW(9);                                           
        S001I09O.INNTEKT5O  = LOW(9);                                           
        S001I09O.INNTEKT6O  = LOW(9);                                           
        S001I09O.INNTEKT7O  = LOW(9);                                           
        S001I09O.INNTEKT8O  = LOW(9);                                           
        S001I09O.INNTEKT9O  = LOW(9);                                           
        S001I09O.INNTEKT10O = LOW(9);                                           
        S001I09O.INNTEKT11O = LOW(9);                                           
        S001I09O.INNTEKT12O = LOW(9);                                           
        S001I09O.INNTEKT13O = LOW(9);                                           
        S001I09O.INNTEKT14O = LOW(9);                                           
        S001I09O.INNTEKT15O = LOW(9);                                           
        S001I09O.INNTEKT16O = LOW(9);                                           
                                                                                
        S001I09O.AGIVKODE1O = LOW(3);                                           
        S001I09O.AGIVKODE2O = LOW(3);                                           
        S001I09O.AGIVKODE3O = LOW(3);                                           
        S001I09O.AGIVKODE4O = LOW(3);                                           
        S001I09O.AGIVKODE5O = LOW(3);                                           
        S001I09O.AGIVKODE6O = LOW(3);                                           
        S001I09O.AGIVKODE7O = LOW(3);                                           
        S001I09O.AGIVKODE8O = LOW(3);                                           
        S001I09O.AGIVKODE9O = LOW(3);                                           
        S001I09O.AGIVKODE10O = LOW(3);                                          
        S001I09O.AGIVKODE11O = LOW(3);                                          
        S001I09O.AGIVKODE12O = LOW(3);                                          
        S001I09O.AGIVKODE13O = LOW(3);                                          
        S001I09O.AGIVKODE14O = LOW(3);                                          
        S001I09O.AGIVKODE15O = LOW(3);                                          
        S001I09O.AGIVKODE16O = LOW(3);                                          
                                                                                
        S001I09O.MELDING1O   = 'KONTROLLREGISTRER INNTEKTENE.';                 
                                                                                
    END OVERFØR_INNTEKT_HOPPL_MAP;                                              
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRA OPPDATERER FILER MED DATA FRA TRANSOMRÅDE INNTEKT.    */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 OPPDATER_FILER:                                                                
    PROC;                                                                       
                                                                                
    DCL                                                                         
        01 NYKKEL   DEF KEY,                                                    
           02 KONTOR_N           CHAR(3)    ,                                   
           02 TERMID_N           CHAR(4)    ,                                   
           02 FNR_N              PIC '(11)9',                                   
           02 REGTPK_N           CHAR(6)    ,                                   
           02 IÅR_N              PIC '(4)9' , /*Y2K*/                           
           02 BLTYPE_N           CHAR(1)    ,                                   
           02 IART_N             CHAR(1)    ,                                   
           02 KOMMNR1_N          PIC '(4)9' ,                                   
           02 AGIVNR_N           PIC '(3)9' ,                                   
           02 RAPPDATO_N         PIC '(8)9' ; /*Y2K*/                           
                                                                                
    DCL                                                                         
        KEY_BIT                  BIT(32) BASED (KEY_PEKER),                     
        KEY_PEKER                POINTER                ,                       
        KEY_RECL                 CHAR (97)              ,                       
        KEY                      CHAR (45)              ; /*Y2K*/               
    DCL                                                                         
        LISTE_RECL               CHAR(103)  ; /*Y2K*/                           
    DCL                                                                         
        01 REC_OMR DEF LISTE_RECL,                                              
           02 KONTOR             CHAR(3)    ,                                   
           02 TERMID             CHAR(4)    ,                                   
           02 FNR                PIC '(11)9',                                   
           02 REGTPK             CHAR(6)    ,                                   
           02 IÅR                PIC '(4)9' , /*Y2K*/                           
           02 BLTYPE             CHAR(1)    ,                                   
           02 IART               CHAR(1)    ,                                   
           02 KOMMNR1            PIC '(4)9' ,                                   
           02 AGIVNR             PIC '(3)9' ,                                   
           02 RAPPDATO           PIC '(8)9' , /*Y2K*/                           
           02 NAVN               CHAR(25)   ,                                   
           02 INNTEKT            PIC '(7)9' ,                                   
           02 ETYPE              CHAR(1)    ,                                   
           02 MERKE              CHAR(1)    ,                                   
           02 DÅR                PIC '(4)9' , /*Y2K*/                           
           02 KOMMNR2            PIC '(4)9' ,                                   
           02 BRUKERID           CHAR(4)    ,                                   
           02 FNR2               PIC '(11)9',                                   
           02 INDEKS             CHAR(1)    ;                                   
                                                                                
 /* ***************************************************************** */        
 /*        HDATO        = DATE();                                     */        
           Y2K_DATO_X            = SUBSTR(DATETIME,1,8)    ; /*Y2K*/            
           Y2K_DATO_N            = Y2K_DATO_X              ; /*Y2K*/            
           HDATO                 = Y2K_DATO_N              ; /*Y2K*/            
                                                                                
           DATO_REDEF.ÅR = HDATO_REDEF.ÅR ;                                     
           DATO_REDEF.MND = HDATO_REDEF.MND;                                    
           DATO_REDEF.DAG = HDATO_REDEF.DAG;                                    
                                                                                
           DO I = 1 TO 16 WHILE(INNTEKT.FNR(I) ^= 0);                           
                                                                                
              EXEC CICS DELAY INTERVAL(002);                                    
                                                                                
              TID_D     = TIME  ;                                               
              INNT_RAPP       = '';                                             
                                                                                
              REC_ART         = INNTEKT.TYPE(I);                                
              RAPP_ART        = INNTEKT.ETYPE(I);                               
              INNT_ÅR         = INNTEKT.ÅR(I);                                  
              KOMM_NR         = INNTEKT.KOMMNR(I);                              
     /*Y2K*/  RAPP_DATO_ÅMD   = HDATO;                                          
              INNT_RAPP.FNR   = INNTEKT.FNR(I);                                 
                                                                                
              IF INNTEKT.ART(I) = 1              THEN                           
                 PI(1)        = INNTEKT.PG_INNTEKT(I);                          
              ELSE                                                              
                 IF INNTEKT.ART(I) = 2           THEN                           
                    PI(3)     = INNTEKT.PG_INNTEKT(I);                          
                 ELSE                                                           
                    IF INNTEKT.ART(I) = 3        THEN                           
                       PI(2)  = INNTEKT.PG_INNTEKT(I);                          
                                                                                
              INNTEKT_OMB     = INNTEKT.MERKE(I);                               
                                                                                
                                                                                
              EXEC CICS WRITE DATASET('INBRUDD') FROM (INNT_RAPP)               
                                                 RIDFLD (IN_RBA) RBA;           
                                                                                
                                                                                
              LISTE_RECL     = ''                   ;                           
              REC_OMR.KONTOR = 'SA'                 ;                           
              REC_OMR.FNR    = INNTEKT.FNR(I)       ;                           
              REC_OMR.IÅR    = INNTEKT.ÅR(I)        ;                           
              REC_OMR.BLTYPE = INNTEKT.TYPE(I)      ;                           
              REC_OMR.IART   = INNTEKT.ART(I)       ;                           
              REC_OMR.KOMMNR1 = INNTEKT.KOMMNR(I)   ;                           
              REC_OMR.AGIVNR = INNTEKT.AGIVKODE(I)  ;                           
              REC_OMR.RAPPDATO = DATO               ;                           
                                                                                
              REC_OMR.DÅR    = 0                    ;                           
              REC_OMR.TERMID = DIV_PARAM_OMR.TERMINAL_NR ;                      
              REC_OMR.REGTPK = TID1                 ;                           
              REC_OMR.BRUKERID = STYRINGS_OMR.BRUKERID;                         
              REC_OMR.INNTEKT = INNTEKT.PG_INNTEKT(I);                          
                                                                                
              REC_OMR.ETYPE  = INNTEKT.ETYPE(I)     ;                           
              REC_OMR.MERKE  = INNTEKT.MERKE(I)     ;                           
              REC_OMR.INDEKS = '1'                  ;                           
                                                                                
                                                                                
              NYKKEL.KONTOR_N = 'SA'                ;                           
              NYKKEL.FNR_N   = INNTEKT.FNR(I)       ;                           
              NYKKEL.IÅR_N   = INNTEKT.ÅR(I)        ;                           
              NYKKEL.BLTYPE_N = INNTEKT.TYPE(I)     ;                           
              NYKKEL.IART_N  = INNTEKT.ART(I)       ;                           
              NYKKEL.KOMMNR1_N = INNTEKT.KOMMNR(I)  ;                           
              NYKKEL.AGIVNR_N = INNTEKT.AGIVKODE(I) ;                           
              NYKKEL.RAPPDATO_N = DATO              ;                           
              NYKKEL.TERMID_N = DIV_PARAM_OMR.TERMINAL_NR ;                     
              NYKKEL.REGTPK_N = TID1                ;                           
              KEY_PEKER      = ADDR(KEY)            ;                           
              KEY_RECL       = LISTE_RECL           ;                           
                                                                                
              EXEC CICS WRITE DATASET ('OLBRUDD') RIDFLD (KEY_BIT )             
                                                   FROM (KEY_RECL);             
                                                                                
                                                                                
                                                                                
                                                                                
           END;                                                                 
                                                                                
    END OPPDATER_FILER;                                                         
                                                                                
  /* ***************************************************************  */        
  /*    PROSEDYREN                                                    */        
  /*    PROSEDYREN SETTER INN AKTUELLE FEILMELDINGER PÅ               */        
  /*    MELDINGSFELTENE I MAPEN VIA LINK TIL R0019921 SOM GÅR INN I   */        
  /*    FEILMELDINGSBASEN.                                            */        
  /* ***************************************************************  */        
  % PAGE;                                                                       
     SKRIV_FEIL:                                                                
       PROC (FEILNR);                                                           
       DCL                                                                      
          FEILNR UNAL FIXED DEC (5),                                            
          1 FEIL_STRUC,                                                         
            2 FEIL_NR          FIXED DEC(5),                                    
            2 FEIL_MELDING     CHAR(78),                                        
            2 KOM_OMR_PEKER    POINTER;                                         
                                                                                
         IF FRA_UTEN_DIALOG ! FRA_MED_DIALOG THEN                               
           IF FEIL_MELD_NR > 0 THEN                                             
             DO;                                                                
               S001I09O.MELDING1O =                                             
                           'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!            
                           ' GÅR I FEIL VED LABEL NR. '           !!            
                           DIV_PARAM_OMR.FEIL_VED_LABEL;                        
               ANT_FEIL_SKREVET = 2;                                            
             END;                                                               
                                                                                
          IF ANT_FEIL_SKREVET < 7 THEN                                          
             DO;                                                                
               KOM_OMR_PEKER = COMMAREA_PEKER;                                  
               FEIL_NR       = FEILNR;                                          
               EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);         
                                                                                
               ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                         
               IF ANT_FEIL_SKREVET = 1 THEN                                     
                  S001I09O.MELDING1O = FEIL_MELDING;                            
               ELSE                                                             
                  IF ANT_FEIL_SKREVET = 2 THEN                                  
                     S001I09O.MELDING2O = FEIL_MELDING;                         
                  ELSE                                                          
                     IF ANT_FEIL_SKREVET = 3 THEN                               
                        S001I09O.MELDING3O = FEIL_MELDING;                      
                     ELSE                                                       
                        IF ANT_FEIL_SKREVET = 4 THEN                            
                           S001I09O.MELDING4O = FEIL_MELDING;                   
                        ELSE                                                    
                           IF ANT_FEIL_SKREVET = 5 THEN                         
                              S001I09O.MELDING5O = FEIL_MELDING;                
                           ELSE                                                 
                              IF ANT_FEIL_SKREVET = 6 THEN                      
                                 S001I09O.MELDING6O = FEIL_MELDING;             
             END;                                                               
       END SKRIV_FEIL;                                                          
 %PAGE;                                                                         
  /* ********************************************************** */              
  /*          E K S T E R N E   P R O C E D U R E R             */              
  /* ********************************************************** */              
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
      %INCLUDE R0019901;               /* TESTER OM DATO ER GYLDIG  */          
 %PAGE;                                                                         
      %INCLUDE R0019902;               /* FINNE KJØNN               */          
 %PAGE;                                                                         
      %INCLUDE R0019903;               /* EKTEFELLES ALDER GYLDIG   */          
 %PAGE;                                                                         
      %INCLUDE R0019904;               /* FØDSELSNUMMERKONTROLL     */          
 %PAGE;                                                                         
      %INCLUDE R0019905;               /* BEREGNER ALDER            */          
 %PAGE;                                                                         
      %INCLUDE R0019907;               /* TABELLSØKING              */          
 %PAGE;                                                                         
      %INCLUDE R0019908;               /* DAGENS DATO PLUSS 1       */          
 %PAGE;                                                                         
      %INCLUDE R0019910;               /* NUMERISK KONTROLL         */          
 %PAGE;                                                                         
      %INCLUDE R0019911;               /* DATO KONTROLL             */          
 %PAGE;                                                                         
      %INCLUDE R0019912;               /* KONVERTERING CHAR ==> PIC /           
                                          PIC ==> CHAR              */          
 %PAGE;                                                                         
      %INCLUDE R0019956;               /* P9956_BER_G_CICS          */          
 %PAGE;                                                                         
      %INCLUDE R0019995;               /*  KONV_FNR11_FNR13         */          
                                                                                
                                                                                
                                                                                
   END R001I93;                                                                 
