 /*       SIST ENDRET 23/06-98 08.33.01 AV   JDA7339                  */00000000
 /*       SIST ENDRET 20/05-98 14.18.08 AV   HLA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0011209  -                                                    */00000030
 /*    PROGRAMMERER: JAN, AUGUST 81                                   */00000040
 /*HENSIKT:                                                           */00000050
 /*    R0011209 INNHOLDER:                                            */00000060
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000070
 /*           FT_TRANS_OMR.                                           */00000080
 /*PROGRAMTILKNYTNING:                                                */00000090
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000100
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000110
 /*    FOLKETRYGDSYSTEMET.                                            */00000120
 /*    ARBEIDSOMRÅDE: P0011201  (LIGGER I R001.TEST.COPYLIB)          */00000130
 /*BRUK:                                                              */00000140
 /*    %INCLUDE R0011209;                                             */00000150
 /*    OVERFØR_FT_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */00000160
 /* ***************************************************************** */00000170
 /*                                                                   */00000180
 /*   PROSEDYRE FOR Å BLANKE MAPEN                                    */00000190
 /*                                                                   */00000200
 /* ***************************************************************** */00000210
 %SKIP;                                                                 00000220
   BLANK_FT_MAP:                                                        00000230
      PROC;                                                             00000240
   DCL                                                                  00000250
     LOW BUILTIN;                                                       00000260
     BT_ANTO      = LOW(2);                                             00000270
     FNR_EKO      = LOW(11);                                            00000280
     TT_F67_EKO   = LOW(2);                                             00000290
     TT_E66_M_EKO = LOW(2);                                             00000300
     TT_E66_Å_EKO = LOW(2);                                             00000310
     MINST4GO     = LOW(1);                                             00000320
     FNR_BARN1O   = LOW(11);                                            00000330
     FNR_BARN2O   = LOW(11);                                            00000340
     FNR_BARN3O   = LOW(11);                                            00000350
     FNR_BARN4O   = LOW(11);                                            00000360
     FNR_BARN5O   = LOW(11);                                            00000370
     FNR_BARN6O   = LOW(11);                                            00000380
     FNR_BARN7O   = LOW(11);                                            00000390
     FNR_BARN8O   = LOW(11);                                            00000400
     RBT1O        = LOW(1);                                             00000410
     RBT2O        = LOW(1);                                             00000420
     RBT3O        = LOW(1);                                             00000430
     RBT4O        = LOW(1);                                             00000440
     RBT5O        = LOW(1);                                             00000450
     RBT6O        = LOW(1);                                             00000460
     RBT7O        = LOW(1);                                             00000470
     RBT8O        = LOW(1);                                             00000480
     MELDING1O    = (78)' ';                                            00000490
     MELDING2O    = (78)' ';                                            00000500
     MELDING3O    = (78)' ';                                            00000510
     MELDING4O    = (78)' ';                                            00000520
     MELDING5O    = (78)' ';                                            00000530
     MELDING6O    = (78)' ';                                            00000540
   END BLANK_FT_MAP;                                                    00000550
 %PAGE;                                /*   */                          00000560
 /* ***************************************************************** */00000570
 /*                                                                   */00000580
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000590
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL FT_TRANS_OMR I              */00000600
 /*   KOM_OMR FOR FT_SØKER.                                           */00000610
 /*           MAPSET:  S001123   MAP S001121                          */00000620
 /*                                                                   */00000630
 /* ***************************************************************** */00000640
 %SKIP;                                                                 00000650
                                                                        00000660
 OVERFØR_FT_SØKER:                                                      00000670
   PROC;                                                                00000680
      IF REGDATOL > 0 THEN                                              00000690
         FTS.REGDATO_ÅMD = KONV_ÅMD_HÅMD (REGDATOI); /*2000*/           00000700
      IF TERMIDL  > 0 THEN                                              00000710
           FTS.TERMID  = TERMIDI;                                       00000720
      IF FNRL > 0 THEN                                                  00000730
           FTS.FNR = F_FELT_CHAR_PIC11 (FNRI);                          00000740
      IF TKNRL > 0 THEN                                                 00000750
           FTS.TKNR = F_FELT_CHAR_PIC4 (TKNRI);                         00000760
      IF TILL_EKL > 0 THEN                                              00000770
           FTS.TILL_EK = TILL_EKI;                                      00000780
      IF BT_ANTL > 0 THEN                                               00000790
           FTS.BT_ANT = F_FELT_CHAR_PIC2 (BT_ANTI);                     00000800
      IF VIRK_DATO_MÅL > 0 THEN                                         00000810
           FTS.VIRK_DATO_ÅMD = KONV_MÅ_HÅMD(VIRK_DATO_MÅI);/*2000*/     00000820
      IF FNR_EKL > 0 THEN                                               00000830
           FTS.FNR_EK = F_FELT_CHAR_PIC11 (FNR_EKI);                    00000840
                                                                        00000850
 /*** IF NAVN_EKL > 0 THEN *** 161287 BF ***/                           00000860
 /*        FTS.NAVN_EK = NAVN_EKI;         */                           00000870
 /******************************************/                           00000880
                                                                        00000890
      IF BOSATT_UTLL > 0 THEN                                           00000900
           FTS.BOSATT_UTL = BOSATT_UTLI;                                00000910
      IF TT_F67_EKL > 0 THEN                                            00000920
           FTS.TT_F67_EK = F_FELT_CHAR_PIC2 (TT_F67_EKI);               00000930
      IF TT_E66_Å_EKL > 0 THEN                                          00000940
           FTS.TT_E66_Å_EK = F_FELT_CHAR_PIC2 (TT_E66_Å_EKI);           00000950
      IF TT_E66_M_EKL > 0 THEN                                          00000960
           FTS.TT_E66_M_EK = F_FELT_CHAR_PIC2 (TT_E66_M_EKI);           00000970
      IF MINST4GL > 0 THEN                                              00000980
           FTS.EK_INNT = MINST4GI;                                      00000990
   END OVERFØR_FT_SØKER;                                                00001000
