 /*   SIST ENDRET PÅ PROD   2008.11.05 16.23.35 AV   SPA2990          */        
 /*       SIST ENDRET 04/05-98 12.59.48 AV   JDA7339                  */        
 /*       SIST ENDRET 25/02-98 09.49.04 AV   RFA9991                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014327 - PROSEDYRE I PLI                                     */        
 /*    PROGRAMMERER:    HERMAN - AUGUST 1997                          */        
 /* *****************************************                         */        
 /*HENSIKT:                                                           */        
 /*    PROSEDYREN BEHANDLER UNGE DØDE (TP_GAR_KODE KAN BLI 'E')       */        
 /* ****************************************************************  */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYREN INCLUDES I R0014101(CALL I     ),4301(CALL I 4323) */         
 /*                          4501 (CALL I                             */        
 /*BRUK:                                                              */        
 /*    CALL UNGE_DØDE_E                                               */        
 /*    VIRK_ÅMD                                                       */        
 /*    FNR_ÅR                                                         */        
 /*    ALDER                                                          */        
 /*    RETUR_POENG                                                    */        
 /* ***************************************************************** */        
                                                                                
 %SKIP(2);                                                                      
 UNGE_DØDE_E:                                                                   
   PROC(VIRK_ÅMD,FNR_ÅR,ALDER,RETUR_POENG);                                     
                                                                                
   DCL VIRK_ÅMD                        PIC      '(8)9';  /*2000*/               
   DCL FNR_ÅR                          PIC      '9999';  /*2000*/               
   DCL ALDER                           PIC    'S99999';                         
   DCL RETUR_POENG                     FIXED DEC (3,2);                         
                                                                                
   DCL VIRK_ÅMD_HL                     PIC      '(8)9';  /*2000*/               
   DCL FNR_ÅR_HL                       PIC      '9999';  /*2000*/               
   DCL ALDER_HL                        PIC    'S99999';                         
   DCL RETUR_POENG_HL                  FIXED DEC (3,2);                         
                                                                                
   VIRK_ÅMD_HL = VIRK_ÅMD;                                                      
   FNR_ÅR_HL = FNR_ÅR;                                                          
   ALDER_HL = ALDER;                                                            
   RETUR_POENG_HL = RETUR_POENG;                                                
                                                                                
   RETUR_POENG = 0;                                                             
   IF VIRK_ÅMD > 19970600           THEN     /*2000*/                           
      DO;                                                                       
         IF FNR_ÅR < 1941                   THEN           /*2000*/             
            DO;                                                                 
               IF ALDER < 2601                   THEN                           
                  IF FNR_ÅR > 1930                   THEN  /*2000*/             
                     RETUR_POENG = 3.30;                                        
                  ELSE                                                          
                  IF ALDER < 2401                  THEN                         
                     IF FNR_ÅR > 1925                THEN  /*2000*/             
                        RETUR_POENG = 3.00;                                     
                     ELSE                                                       
                     IF ALDER < 2201                  THEN                      
                        IF FNR_ÅR = 1925                THEN   /*2000*/         
                           RETUR_POENG = 2.00;                                  
                        ELSE                                                    
                        IF FNR_ÅR = 1923           !          /*2000*/          
                           FNR_ÅR = 1924                THEN  /*2000*/          
                           RETUR_POENG = 1.60;                                  
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO 9705 ELLER 9706 :*/                                         
   IF VIRK_ÅMD > 19970400          THEN      /*2000*/                           
      DO;                                                                       
         IF FNR_ÅR < 1943                 THEN                /*2000*/          
            DO;                                                                 
               IF ALDER < 2401                THEN                              
                  DO;                                                           
                     IF FNR_ÅR > 1930                   THEN /*2000*/           
                        RETUR_POENG = 3.30;                                     
                     ELSE                                                       
                     IF FNR_ÅR > 1925                THEN    /*2000*/           
                        RETUR_POENG = 3.00;                                     
                     ELSE                                                       
                     IF ALDER < 2201                      THEN                  
                        IF FNR_ÅR = 1925                THEN  /*2000*/          
                           RETUR_POENG = 2.00;                                  
                        ELSE                                                    
                        IF FNR_ÅR = 1923           !        /*2000*/            
                           FNR_ÅR = 1924                THEN /*2000*/           
                           RETUR_POENG = 1.60;                                  
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO ER 9205-9704*/                                              
   IF VIRK_ÅMD > 19920400            THEN      /*2000*/                         
      DO;                                                                       
         IF FNR_ÅR < 1943                 THEN                                  
            DO;                                               /*2000*/          
               IF ALDER < 2401                THEN                              
                  DO;                                                           
                     IF FNR_ÅR > 1925                   THEN   /*2000*/         
                        RETUR_POENG = 3.00;                                     
                     ELSE                                                       
                     IF ALDER < 2201                      THEN                  
                        IF FNR_ÅR = 1925                THEN /*2000*/           
                           RETUR_POENG = 2.00;                                  
                        ELSE                                                    
                        IF FNR_ÅR = 1923           !        /*2000*/            
                           FNR_ÅR = 1924                THEN /*2000*/           
                           RETUR_POENG = 1.60;                                  
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO ER 9201-9204*/                                              
   IF VIRK_ÅMD > 19920000                THEN    /*2000*/                       
      DO;                                                                       
         IF FNR_ÅR < 1945                 THEN             /*2000*/             
            DO;                                                                 
               IF ALDER < 2201                THEN                              
                  DO;                                                           
                     IF FNR_ÅR > 1925                   THEN /*2000*/           
                        RETUR_POENG = 2.50;                                     
                     ELSE                                                       
                     IF FNR_ÅR = 1925                THEN   /*2000*/            
                        RETUR_POENG = 2.00;                                     
                     ELSE                                                       
                     IF FNR_ÅR = 1923           !          /*2000*/             
                        FNR_ÅR = 1924                THEN  /*2000*/             
                        RETUR_POENG = 1.60;                                     
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO ER 9101-9112*/                                              
   IF VIRK_ÅMD > 19910000                THEN       /*2000*/                    
      DO;                                                                       
         IF FNR_ÅR < 1945                 THEN            /*2000*/              
            DO;                                                                 
               IF ALDER < 2201                 THEN                             
                  DO;                                                           
                     IF FNR_ÅR > 1924                   THEN  /*2000*/          
                        RETUR_POENG = 2.00;                                     
                     ELSE                                                       
                     IF FNR_ÅR = 1923           !          /*2000*/             
                        FNR_ÅR = 1924                THEN  /*2000*/             
                        RETUR_POENG = 1.60;                                     
                  END;                                                          
            END;                                                                
      END;                                                                      
   ELSE  /*VIRKDATO 8907-9012 :*/                                               
   IF VIRK_ÅMD > 19890600                THEN    /*2000*/                       
      DO;                                                                       
         IF FNR_ÅR < 1945                 THEN           /*2000*/               
            DO;                                                                 
               IF ALDER < 2201                 THEN                             
                  DO;                                                           
                     IF FNR_ÅR > 1922                   THEN /*2000*/           
                        RETUR_POENG = 1.60;                                     
                  END;                                                          
            END;                                                                
      END;                                                                      
      RETUR_POENG_HL = RETUR_POENG;                                             
 END UNGE_DØDE_E;                                                               
