 /*   SIST ENDRET PÅ PROD   2006.07.18 11.36.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.42.53 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.50 AV   SPA2970          */        
 /*       SIST ENDRET 09/06-98 08.48.57 AV   SPA7339                  */        
 /*       SIST ENDRET 27/05-98 09.51.39 AV   RFA9991                  */        
 /*       SIST ENDRET 02/11-94 13.43.06 AV   HLB0310                  */        
 /*       SIST ENDRET 20/09-94 09.43.01 AV   HERMAN                   */        
 /*       SIST ENDRET 21/05-92 14.26.32 AV   HERMAN                   */        
 /*       SIST ENDRET 17/02-92 13.46.34 AV   DYBVIK                   */        
 /*       SIST ENDRET 08/01-92 15.44.24 AV   HERMAN                   */        
 /*       SIST ENDRET 03/01-92 14.54.23 AV   HERMAN                   */        
 /*       SIST ENDRET 14/04-89 13.38.40 AV   HERMAN                   */        
 /* *************************************************************** */          
 /*IDENTIFIKASJON:                                                  */          
 /*    R0014425 - PROSEDYRE I PLI                                   */          
 /*HENSIKT:                                                         */          
 /*                                                                 */          
 /*  1. BEREGNE OG OPPDATERE YRKEPENS.SPT                           */          
 /*                                                                 */          
 /*  2. OPPDATERE YRKEPENS.YPT                                      */          
 /*                                                                 */          
 /*  3.  FRA 1.1.92 SKAL YRKE_POENG_1291, HVIS DEN ER STØRST,       */          
 /*      KOPIERES INN I YPT.                                        */          
 /*                                                                 */          
 /*  4. SETTE YPT_KODE = 'V' HVIS ORDINÆR BEREGNING AV SLUTT-POENG  */          
 /*     GIR BEST RESULTAT (KODEN SKAL VÆRE OPPDATERT MED 'Y' ELLER  */          
 /*     'A' FRA FØR - PROGRAM 4424)                                 */          
 /*                                                                 */          
 /*  5.  BEREGNE TILLEGGSPENSJON FOR YRKESSKADEPENSJONER            */          
 /*                                                                 */          
 /*PROGRAMTILKNYTNING:                                              */          
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV UFØREPENSJON- */          
 /*    SBEREGNINGEN - FOR YRKESSKADDE.                              */          
 /*    INCLUDES I R0014401                                          */          
 /*BRUK:                                                            */          
 /*    CALL BEREGN_TP_YP;                                           */          
 /*                                                                 */          
 /* *************************************************************** */          
 /*   */                                                                        
 BEREGN_TP_YP:                                                                  
   PROC;                                                                        
                                                                                
  DCL        YHIST_IND         BIN FIXED (15);                                  
  DCL        TP_WORK           FIXED DEC (13,4);                                
  DCL        FAKTOR1           FIXED DEC (7);                                   
  DCL        FAKTOR2           FIXED DEC (7);                                   
  DCL        YRKE_POENG        FIXED DEC (3,2);                                 
  DCL        WFNR              PIC      '(11)9';                                
  DCL        FNR_ÅR DEF WFNR POS(5)     PIC '99';                               
  DCL        UFTID_ÅR          FIXED DEC (3);                                   
  DCL        FØR92             FIXED DEC (3);                                   
                                                                                
                                                                                
    WFNR = B02.FNR(BER_SØ_IND);                                                 
    B02.YRKEPENS.SPT(BER_SØ_IND) = POREKKE.SPT(BER_SØ_IND);                     
                                                                                
    DO YHIST_IND = 1 TO 10  WHILE                                               
                         (B02.YRKEHIST.OPPH_DATO_ÅMD(BER_SØ_IND,                
                                 YHIST_IND) > 0);             /*Y2K*/           
    END;                                                                        
                                                                                
    IF B02.PAÅ(BER_SØ_IND,YHIST_IND) > POREKKE.SPT(BER_SØ_IND) THEN             
                                                                                
       B02.YRKEPENS.YPT(BER_SØ_IND) = B02.PAÅ(BER_SØ_IND,YHIST_IND);            
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
          B02.YRKEPENS.YPT(BER_SØ_IND) = POREKKE.SPT(BER_SØ_IND);               
          B02.YPT_KODE(BER_SØ_IND)     = 'V'; /*VANLIGE REGLER GIR*/            
                                              /*BEST SPT          */            
       END;                                                                     
                                                                                
    IF B02.YRKEPENS.YPT(BER_SØ_IND) < B02.YRKE_POENG_1291(BER_SØ_IND)           
       THEN                                                                     
       DO;                                                                      
       B02.YRKEPENS.YPT(BER_SØ_IND) = B02.YRKE_POENG_1291(BER_SØ_IND);          
       B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0;                                 
       END;                                                                     
                                                                                
    TP_WORK  = G * B02.YRKEPENS.YPT(BER_SØ_IND);                                
    TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(BER_SØ_IND) /100;                     
 /* TP_WORK  = TP_WORK / 12;                                 */                 
    IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 0       THEN                       
       TP_WORK  = TP_WORK * 45 /100;                                            
    ELSE                                                                        
       DO;                                                                      
 /*LAGET HELTALLS-BEREGNING FOR Å UNNGÅ PL1-DEFINISJONER - HL 1194*/            
                                                                                
          FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                                
                     - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )                    
                     * 45000                                                    
                   / B02.YRKEPENS.PÅ(BER_SØ_IND) ;                              
          FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) * 42000                 
                   / B02.YRKEPENS.PÅ(BER_SØ_IND) ;                              
          TP_WORK = TP_WORK * (FAKTOR1 + FAKTOR2) * 0.00001 + 0.05;             
       END;                                                                     
 /* B02.YRKEPENS.TP(BER_SØ_IND) = TP_WORK + 0.5;      */                        
    B02.YRKEPENS.TP(BER_SØ_IND) = TP_WORK / 12 + 0.5;                           
    IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'A' THEN                                 
       YRKE_ÅRSTP = TP_WORK + 0.5;                                              
 %PAGE;                                                                         
                                                                                
     RETUR:                                                                     
                                                                                
   END BEREGN_TP_YP;                                                            
                                                                                
