 /*   SIST ENDRET PÅ PROD   2007.12.21 12.20.33 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2005.04.19 13.04.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.29.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.30.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.09.17  9.15.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.24.28 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.08.08 15.48.38 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.17 12.44.56 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.12 10.13.56 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.03.22  9.40.50 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.03  9.01.10 AV   JDA7339          */        
 /*       SIST ENDRET 08/01-99 14.39.11 AV   JDA7339                  */        
 /*       SIST ENDRET 08/01-99 14.26.31 AV   JDA7339                  */        
 /*       SIST ENDRET 19/08-98 09.28.34 AV   TSB7339                  */        
 /*       SIST ENDRET 20/07-98 10.04.29 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 09.06.41 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014101 - BEREGN_ETTERLATT_AP - HOVEDPROGRAM I PLI            */        
 /*    PROGRAMMERER: KRISTENSEN, APRIL 1982                           */        
 /*    SIST ENDRET AV KARIN I JULI 82                                 */        
 /*HENSIKT:                                                           */        
 /*    PROGRAMMET FORETAR BEREGNING FOR ETTERLATT_AP OG INKLUDERER    */        
 /*    DE NØDVENDIGE UNDERMODULER.                                    */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR LINKET FRA 4001 - (BEREGNING).                 */        
 /*BRUK:                                                              */        
 /*    EXEC CICS LINK PROGRAM('R0014101') COMMAREA(KOM_OMR)           */        
 /* ***************************************************************** */        
 R001410: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                  
                                                                                
    %INCLUDE P0014002;  /* W_POREKKE                     */                     
    %INCLUDE P0014003;  /* TAB                           */                     
    %INCLUDE P0014009;  /* POTALL_OPPL (BASED)           */                     
    %INCLUDE P0019906;  /* TRANS_OPPL_OMR    (BASED)     */                     
    %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)            */                     
    %INCLUDE P0019910;  /* STYRINGS_OMR (BASED)          */                     
    %INCLUDE P0019912;  /* DIV_PARAM_OMR   (BASED)       */                     
    %INCLUDE P0019924;  /* GRUNNBELØP VEIET-GJENNOMSNITT */                     
    %INCLUDE P0019925;  /* GRUNNBELØP                    */                     
    %INCLUDE P0019980; /* DEFINERING AV FNR11/13 SØKER & EKTEFELLE */           
    DCL                                                                         
       1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                               
    DCL                                                                         
       1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                               
    DCL REST_GRAD_4129       FIXED DEC (3) INIT (0);                            
    DCL YRKE_GP_4129         FIXED DEC (7) INIT (0);                            
    DCL ALDER_GP_4129        FIXED DEC (7) INIT (0);                            
    DCL GP_100_4129          FIXED DEC (7) INIT (0);                            
    DCL  GP_FAKTOR_4129      FIXED DEC (5,4);                                   
                                                                                
 DCL                                                                            
    ADDR                         BUILTIN,                                       
    HBOUND                       BUILTIN,                                       
    AP_GT                        FIXED DEC (7) INIT (0),                        
    AP_GP                        FIXED DEC (7) INIT (0), /* NY 0192 */          
    AP_KT                        FIXED DEC (7) INIT (0),                        
    AP_ST                        FIXED DEC (7) INIT (0),                        
    AP_TEI                       FIXED DEC (7) INIT (0), /* NY 0192 */          
    AP_TP                        FIXED DEC (7) INIT (0),                        
    APD_ØNSKET                   FIXED DEC( 3) INIT (0),                        
    COMMAREA_PEKER               PTR,                                           
    CSTG                         BUILTIN,                                       
    EP_TP                        FIXED DEC (7) INIT (0),                        
    GAR92_AVD                    FIXED DEC (5) INIT (0),                        
    GAR92_EGEN                   FIXED DEC (5) INIT (0),                        
    GAR92_EGEN_55                FIXED DEC (5) INIT (0),                        
    I                            FIXED BIN(15) INIT (0),                        
    J                            FIXED BIN(15) INIT (0),                        
    MÅNED_ÅR                     PIC '999999',                                  
    ROUND                        BUILTIN,                                       
    SUBSTR                       BUILTIN,                                       
    VERIFY                       BUILTIN,                                       
    SØTTI                        FIXED DEC (5) INIT (0),                        
    TILLEGGSBLANKETT_YRKESSKADE  CHAR (1)      INIT (' '),                      
    TP_EGEN                      FIXED DEC (7) INIT (0),                        
    TP_EK_PT                     FIXED DEC (7) INIT (0),                        
    TP_PT_EGEN_55                FIXED DEC (7) INIT (0),                        
    UFØR_FØR_73                  CHAR  (1) INIT (' '),    /*TS 300392*/         
    VIRK_LOV92_ÅM                PIC '(6)9',    /* 2000-3 */                    
    VIRKNINGSÅR                  DEF MÅNED_ÅR POS (3) PIC '9999',               
    W_SUM_YTELSE                 FIXED DEC (7) INIT (0),                        
    W_TT_KONVENSJON              FIXED DEC (5) INIT (0);                        
                                                                                
   DCL ALDER_EK    PIC '(4)9';                                                  
   DCL ALDER_EGEN  PIC '(4)9';                                                  
                                                                                
   DCL ST_BEREGNET(2) CHAR (1) INIT ((2)(' '));                                 
   DCL 1 FNR_EK_R13 DEF W_FNR_EK_13,                                            
         2 DAG_EK       PIC '99',                                               
         2 MND_EK       PIC '99',                                               
         2 ÅR_EK        PIC '9999',                                             
         2 ÅRHUNDRE_EK  PIC '9',                                                
         2 FILLER_EK    PIC '9999';                                             
    /* ============================================================== */        
                                                                                
    W_FNR          = B02.FNR(BER_SØ_IND);                                       
    W_FNR_EK       = B02.FNR(BER_EK_IND);                                       
    W_FNR_13       = KONV_FNR11_FNR13(W_FNR);                                   
    W_FNR_EK_13    = KONV_FNR11_FNR13(W_FNR_EK);                                
    ST_BEREGNET(1)   = ' ';                                                     
    ST_BEREGNET(2)   = ' ';                                                     
                                                                                
    /* NULLSTILLING LAGT INN 08.08.2000 - MARTIN */                             
    B02.AFP_TILLEGG(BER_SØ_IND)  = 0;                                           
    B02.AFP_TILLEGG_NETTO(BER_SØ_IND)  = 0;                                     
                                                                                
    DIV_PARAM_OMR.TAI(1)      = 0;                                              
    DIV_PARAM_OMR.TAI(2)      = 0;                                              
    DIV_PARAM_OMR.AP_KODE_AEY (1) = ' ';                                        
    DIV_PARAM_OMR.AP_KODE_AEY (2) = ' ';                                        
                                                                                
    /*HL : BLANKETT E3 GA IKKE YRKESSKADEFORDEL FØR ENDRING 23.11.94 */         
                                                                                
    IF TRANS_OPPL_OMR.TRANSTYPE = 3          THEN                               
       SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                                      
          WHEN('EE') CALL HENT_FRA_EE;                                          
          WHEN('EP') CALL HENT_FRA_EP;                                          
          WHEN('E3') CALL HENT_FRA_E3;                                          
          OTHER;                                                                
       END;                                                                     
 /*                                                                             
 /*    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'E3' THEN     /*231194*/               
 /*       CALL HENT_FRA_E3;                            /*231194*/               
 /*    ELSE                                                                     
 /*    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EP' THEN     /*231194*/               
 /*       CALL HENT_FRA_EP;                                                     
 /*    ELSE                                                                     
 /*    IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EE' THEN     /*0195  */               
 /*       CALL HENT_FRA_EE;                                                     
 */                                                                             
    IF TILLEGGSBLANKETT_YRKESSKADE = 'J'     THEN                               
       CALL BEREGN_POENG_AÅI_AVDØD;              /*4128*/                       
                                                                                
    ALDER_EK  = F_ALDER(W_FNR_EK,TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD);             
    ALDER_EGEN =                                                                
     F_ALDER((B02.FNR(BER_SØ_IND)),TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD);           
   /* LOVENDRING - HL 200811*/                                                  
    IF (ALDER_EGEN > 6800   !                                                   
        TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD < 20080000)   THEN;                    
    ELSE                                                                        
      DO;                                                                       
         B02.FAI(BER_SØ_IND) = 0;                                               
         B02.FAI_DATO_ÅMD(BER_SØ_IND) = 0;                                      
      END;                                                                      
                                                                                
    CALL BEREGN_ETTERLATT_AP_DEL1;                      /* 4121 */              
                                                                                
    IF FEIL_MELD_NR > 0  THEN                                                   
       GO TO L999;                                                              
    ELSE                                                                        
       PROGRAM_ID = 'R0014101';                                                 
                                                                                
    DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) =                                
                            B02.ALDERSP.ST(BER_SØ_IND);/*NY92*/                 
                                                                                
 /*IF F_ALDER(TRANS_OPPL_OMR.FØDSNUMMER,TRANS_OPPL_OMR.VIRKNINGSDATO)*/         
                                                                                
 /*LOVENDRING 1.1.91 HL : */                                                    
                                                                                
                                                                                
 IF VIRKNINGSDATO_ÅMD < 19910000 THEN                                           
    SØTTI = 7000;                                                               
 ELSE                                                                           
    SØTTI = 7001;                                                               
                                                                                
 IF  W_FNR_R13.ÅR  < 1925  !                                                    
    (B02.KONV_P_KODE(BER_SØ_IND)  = 'K' &          /*TS0393*/                   
     B02.UTTAKSDATO_ÅMD(BER_SØ_IND) < 19920000)  THEN                           
   DO;                                                                          
    IF ALDER_EGEN                                                               
       < SØTTI & W_FNR_R13.ÅR > 1902          THEN                              
                                                                                
     SELECT(TRANS_OPPL_OMR.TRANSTYPE);                                          
       WHEN(1)  /* GRUNNBLANKETT ALDER  */                                      
         DO;                                                                    
                                                                                
           IF TRANS_OPPL_OMR.BLANKETTYPE = 'AP' THEN                            
              CALL HENT_FRA_AP;                                                 
                                                                                
           IF TRANS_OPPL_OMR.BLANKETTYPE = 'A1' THEN                            
              CALL HENT_FRA_A1;                                                 
           CALL BEREGN_APD(APD_ØNSKET);                /* 4122 */               
         END;                                                                   
       WHEN(3)  /* GRUNNBLANKETT ETTERLATT EKTEFELLE  */                        
         DO;                                                                    
            /*CALL TIL E3 PGA TT_KOVENSJON. TRUDE 230393*/                      
           IF TRANS_OPPL_OMR.BLANKETTYPE   = 'E3' THEN                          
              CALL HENT_FRA_E3;                                                 
           ELSE                                                                 
           IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EE' THEN   /*0195*/               
              CALL HENT_FRA_EE;                                                 
                                                                                
           APD_ØNSKET = 100;                                                    
           CALL BEREGN_APD(APD_ØNSKET);                /* 4122 */               
         END;                                                                   
       WHEN(8)  /* ENDRINGSBLANKETT - ENDRING I GRAD ELLER FAI */               
         DO;                                                                    
           IF TRANS_OPPL_OMR.BLANKETTYPE   = 'EN' THEN                          
              CALL BEREGN_APD(100) ;                 /* 4122 */                 
           ELSE                                                                 
             DO;                                                                
                CALL HENT_FRA_E1;                                               
                CALL BEREGN_APD(APD_ØNSKET) ;         /* 4122 */                
             END;                                                               
                                                                                
         END;                                                                   
       WHEN(24)                                                                 
         DO;                                                                    
           CALL BEREGN_APD_OVERGANG_FRA_UP;            /* 4123 */               
         END;                                                                   
       WHEN(25)                                                                 
         DO;                                                                    
                                                                                
 /* LOVENDRING PR 1.4.84          *       *         *      */                   
                                                                                
           IF B02.STATUS.VIRK_DATO_ÅMD(BER_SØ_IND) > 19840300 THEN              
              DO;                                                               
                APD_ØNSKET       = 100;                                         
                CALL BEREGN_APD (APD_ØNSKET);          /* 4122 */               
              END;                                                              
                                                                                
 /* HIT                     *               *         *       */                
                                                                                
           CALL BEREGN_APD_OVERGANG_FRA_KAP10;         /* 4124 */               
         END;                                                                   
       WHEN(27)                                                                 
         DO;     /*ELLERS BLIR APD SATT TIL 100 FOR TIDLIG*/                    
         END;    /*HL 200208*/                                                  
       WHEN(41)                                                                 
         DO;                                                                    
                                                                                
 /* LOVENDRING PR 1.4.84          *       *         *      */                   
                                                                                
           IF B02.STATUS.VIRK_DATO_ÅMD(BER_SØ_IND) > 19840300  THEN             
              DO;                                                               
                APD_ØNSKET       = 100;                                         
                CALL BEREGN_APD (APD_ØNSKET);          /* 4122 */               
              END;                                                              
                                                                                
 /* HIT                     *               *         *       */                
                                                                                
           CALL BEREGN_APD_OVERGANG_FRA_KAP10;         /* 4124 */               
                                                                                
           CALL BEREGN_APD_OVERGANG_FRA_UP;            /* 4123 */               
         END;                                                                   
       OTHERWISE                                                                
         DO;                                                                    
                                                                                
           APD_ØNSKET = 100;                                                    
           CALL BEREGN_APD(APD_ØNSKET);                /* 4122 */               
         END;                                                                   
                                                                                
     END; /* SELECT  */                                                         
                                                                                
     ELSE                                                                       
     /* PERSONEN ER MINST 70 ÅR ELLER FØDT FØR 1903 */                          
                                                                                
       DO;    /* SØRGE FOR AT APD ER 100 - ENDRET 200208 HL*/                   
           IF B02.STATUS.VIRK_DATO_ÅMD(BER_SØ_IND) > 19870300  THEN             
              B02.APD(BER_SØ_IND) = 100;                                        
           CALL APD_70ÅR;                            /* 4125 */                 
       END;                                                                     
   END;                                                                         
   CALL BEREGN_ETTERLATT_AP_DEL3;                      /* 4126 */               
                                                                                
 L999:                                                                          
    EXEC CICS RETURN;                                                           
                                                                                
                                                                                
 HENT_FRA_AP: PROC;                                                             
 %INCLUDE P0010501;  /* AP-OMRÅDE                */                             
   APD_ØNSKET = APS.APD;                                                        
 END HENT_FRA_AP;                                                               
                                                                                
 HENT_FRA_A1: PROC;                                                             
 %INCLUDE P001N501;  /* A1-OMRÅDE                */                             
   APD_ØNSKET = A1S.APD;                                                        
 END HENT_FRA_A1;                                                               
                                                                                
           /*TRUDE 23.03.93 */                                                  
 HENT_FRA_E3: PROC;                                                             
 %INCLUDE P001N801;  /* E3-OMRÅDE                */                             
   TILLEGGSBLANKETT_YRKESSKADE = E3S.YSKADE_TILLEGG;                            
   IF E3SP.TT_KONVENSJON_ÅR > 0 THEN                                            
      W_TT_KONVENSJON    = E3SP.TT_KONVENSJON_ÅR;                               
 END HENT_FRA_E3;                                                               
                                                                                
 HENT_FRA_EE: PROC;                                                             
 %INCLUDE P001U801;  /* EE-OMRÅDE                */                             
   TILLEGGSBLANKETT_YRKESSKADE = EES.YSKADE_TILLEGG;                            
   IF EESP.TT_KONVENSJON_ÅR_EK > 0 THEN                                         
      W_TT_KONVENSJON    = EESP.TT_KONVENSJON_ÅR_EK;                            
 END HENT_FRA_EE;                                                               
                                                                                
 HENT_FRA_EP: PROC;                                                             
 %INCLUDE P0010801;  /* EP-OMRÅDE                */                             
   TILLEGGSBLANKETT_YRKESSKADE = EPS.YSKADE_TILLEGG;                            
 END HENT_FRA_EP;                                                               
                                                                                
 HENT_FRA_E1: PROC;                                                             
 %INCLUDE P0011401;  /* E1-OMRÅDE                */                             
     APD_ØNSKET = E1K7.APD;                                                     
 END HENT_FRA_E1;                                                               
                                                                                
 %PAGE;                                                                         
                                                                                
 %INCLUDE R0014021;   /*  JUSTER_40PROS  ERSTATTER 4244   */                    
 %INCLUDE R0014022;   /*  JUSTER_FORVENTET                */                    
 %INCLUDE R0014111;   /*  BEREGN_GTLOV92_AE          NY92 */                    
 %INCLUDE R0014121;       /* BEREGN_ETTERLATT_AP_DEL1      */                   
 %INCLUDE R0014122;       /* BEREGN_APD                    */                   
 %INCLUDE R0014123;       /* BEREGN_APD_OVERGANG_FRA_UP    */                   
 %INCLUDE R0014124;       /* BEREGN_APD_OVERGANG_FRA_KAP10 */                   
 %INCLUDE R0014125;       /* APD_70ÅR                      */                   
 %INCLUDE R0014126;       /* BEREGN_ETTERLATT_AP_DEL3      */                   
 %INCLUDE R0014128;       /* BEREGN_POENG_AÅI_AVDØD        */                   
 %INCLUDE R0014129;       /* BEREGN_ETTERLATT_AP_YP        */                   
 %INCLUDE R0014131;       /* BEREGN_TP_ETTERLATT_AP        */                   
 %INCLUDE R0014132;       /* BEREGN_GP_ETTERLATT_AP        */                   
 %INCLUDE R0014133;       /* F_BEREGN_SÆRTILLEGG           */                   
 %INCLUDE R0014134;       /* F_BEREGN_KOMPENSASJONSTILLEGG */                   
 %INCLUDE R0014135;       /* TIDLIGERE ARBEIDSINNTEKT      */                   
 %INCLUDE R0014136;       /* ÅTTI_PROSENT_REGELEN          */                   
 %INCLUDE R0014137;       /* JUSTER_MED_APD                */                   
 %INCLUDE R0014138;       /* BEREGN_VT                     */                   
 %INCLUDE R0014140;   /*  F_OVERGANG_FRA_YP          NY92 */                    
 %INCLUDE R0014142;       /* F_TILLEGGSPENSJON             */                   
 %INCLUDE R0014143;       /* POENGTILLEGG                  */                   
 %INCLUDE R0014145;       /* REGN_TT_67_TIL_70             */                   
 %INCLUDE R0014146;       /* FAI_GRENSER                   */                   
 %INCLUDE R0014147;       /* FRAVIK_80_PROSENT             */                   
 %INCLUDE R0014148;       /* F_TP92                        */                   
 %INCLUDE R0014151;   /*  KLARGJØR_TAB               NY92 */                    
 %INCLUDE R0014153;        /* BEREGN_SPT_OPT_PÅ            */                   
 %INCLUDE R0014155;       /* FAI_GRENSER_FRAVIK            */                   
 %INCLUDE R0014156;        /* BEREGN_SPT_OPT_PÅ_ALT        */                   
 %INCLUDE R0014161;   /*  LEGG_UFØREHIST_I_TAB       NY92 */                    
 %INCLUDE R0014180;       /* SÆRTILLEGG_UTLAND --TRUDE     */                   
 %INCLUDE R0014182;       /* BEREGN_GP_ETTERLATT_AP_UTLAND */                   
 %INCLUDE R0014199;   /*  SPT_GARANTI_E                   */                    
 %INCLUDE R0014233;       /* BEREGN_BT                     */                   
 %INCLUDE R0014241;   /*  BEREGN_AP_OVERGANG_FRA_YP  NY92 */                    
 %INCLUDE R0014243;   /*  JUSTER_AE_MED_F                 */                    
 /*INCLUDE R0014244;       JUSTER_AP_40PROS                */                   
 %INCLUDE R0014322;   /*  REGN_TT_67_TIL_70_DØD           */                    
 %INCLUDE R0014327;   /*  UNGE_DØDE_E                     */                    
 %INCLUDE R0019905;       /* BEREGN ALDER                  */                   
 %INCLUDE R0019995;       /* KONV_FNR11_FNR13    2000-3    */                   
 END R001410;                                                                   
