 /*   SIST ENDRET PÅ PROD   2002.04.19 12.13.56 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.03.20  8.25.05 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.05.04 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.37.02 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.57.10 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.41.10 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NU1A  UNDERPROGRAM SOM BRUKES AV R001NO10    */        
 /*                            KONTROLL KFP-BLANKETT.                 */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : HERMAN                                           */        
 /*  PROGRAMMET BLE LAGET : NOV 1997                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*  ENDRINGER                                                        */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NU1A                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R001UJ02   BLANK TRANSOMR                                      */        
 /*    R001UJ03   KONTR KFP SØKER                                     */        
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR KFP OG FLYTTER DERETTER       */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P119_BEHANDLE_KFP: PROC;                                                       
                                                                                
                                                                                
 %INCLUDE P001UJ01;                      /* TRANSOMRÅDE KFP */                  
                                                                                
                                                                                
          CALL BLANK_KFP_SØKER;                         /* R001UJ02 */          
          CALL BLANK_KFP_MELDNR;                        /* R001UJ02 */          
          CALL OVERF_KFP_BLANKETT;                                              
          CALL KONTROLL_KFP_SØKER(FEIL_FUNNET);         /* R001UJ03 */          
                                                                                
                                                                                
          IF KFP.NORSK_BOSATT = 'N'   THEN                                      
             DO;                                                                
                FEIL_I_BOSATT = TRUE;                                           
                FEIL_FUNNET   = TRUE;                                           
             END;                                                               
                                                                                
          IF FEIL_FUNNET      THEN                                              
             CALL FINN_FEIL_KFP;                                                
                                                                                
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL KFP TRANSOMRÅDE FOR KFP SØKER.                    */        
 /* ***************************************************************** */        
 OVERF_KFP_BLANKETT:PROC;                                                       
                                                                                
          DCL HJELPEDATO    PIC '(8)9';                                         
                                                                                
          KFP.REGDATO_ÅMD  =  BLANKETT_RECORD.TRANS_DATO_ÅMD;                   
          KFP.TERMID       = DIV_PARAM_OMR.TERMINAL_NR;                         
          HJELPEDATO        = KFP_BLANKETT.VIRK_DATO_ÅMD / 100;                 
          KFP.VIRK_DATO_ÅMD = HJELPEDATO * 100;                                 
          KFP.FNR          =  BLANKETT_RECORD.FNR;                              
          KFP.NAVN         =  BLANKETT_RECORD.NAVN;                             
          KFP.TKNR         =  BLANKETT_RECORD.TKNR;                             
          KFP.TILL_EK      =  KFP_BLANKETT.TILL_EK;                             
          KFP.SIVILSTAND   =  KFP_BLANKETT.SIVILSTAND;                          
          KFP.SPRÅK        =  KFP_BLANKETT.SPRÅK;                               
          KFP.EK_INNT_OVER_2G =  KFP_BLANKETT.EK_INNT_OVER_2G;                  
                                                                                
          KFP.NORSK_BOSATT =  KFP_BLANKETT.NORSK_BOSATT;                        
                                                                                
          IF F_FELT_PIC_CHAR7 (KFP_BLANKETT.FAI) ^= (7)' '       THEN           
             KFP.FAI       =  KFP_BLANKETT.FAI ;                                
                                                                                
          IF F_FELT_PIC_CHAR11 (KFP_BLANKETT.FNR_EK) ^= (11)' '  THEN           
             KFP.FNR_EK    =  KFP_BLANKETT.FNR_EK;                              
                                                                                
          IF F_FELT_PIC_CHAR7                                                   
                 (KFP_BLANKETT.PENSJONS_INNTEKT) ^= (7)' '  THEN                
             KFP.PEN_INNT  =  KFP_BLANKETT.PENSJONS_INNTEKT;                    
                                                                                
          IF F_FELT_PIC_CHAR7(KFP_BLANKETT.PI_SISTE_ÅR) ^= (7)' '   THEN        
              KFP.PI_SISTE_ÅR =  KFP_BLANKETT.PI_SISTE_ÅR;                      
          KFP.AFP_ORDNING  =  KFP_BLANKETT.AFP_ORDNING;                         
          KFP.NAVN_EK      =  KFP_BLANKETT.NAVN_EK;                             
          KFP.AFP_TILLEGGKODE  =  KFP_BLANKETT.AFP_TILLEGG;                     
          KFP.RED_GP_3_2_5       = KFP_BLANKETT.RED_GP_3_2_5;                   
                                                                                
                                                                                
    END OVERF_KFP_BLANKETT;                                                     
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */        
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */        
 /* ***************************************************************** */        
 FINN_FEIL_KFP:PROC;                                                            
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF KFP.VIRK_DATO_ÅMDNR ^= 0 &                                         
             KFP.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.FNRNR ^= 0 &                                                   
             KFP.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF KFP.NAVNNR ^= 0 &                                                  
             KFP.NAVNNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.NAVNNR;                             
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.TKNRNR ^= 0 &                                                  
             KFP.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.TKNRNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF KFP.SPRÅKNR ^= 0 &                                                 
             KFP.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.SPRÅKNR;                            
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.SIVILSTANDNR ^= 0 &                                            
             KFP.SIVILSTANDNR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.SIVILSTANDNR;                       
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.NORSK_BOSATTNR ^= 0 &                                          
             KFP.NORSK_BOSATTNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.NORSK_BOSATTNR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.PI_SISTE_ÅRNR     ^= 0 &                                       
             KFP.PI_SISTE_ÅRNR     ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.PI_SISTE_ÅRNR    ;                  
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.FAINR ^= 0 &                                                   
             KFP.FAINR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.FAINR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.EK_INNT_OVER_2GNR ^= 0 &                                       
             KFP.EK_INNT_OVER_2GNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.EK_INNT_OVER_2GNR;                  
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.TILL_EKNR ^= 0 &                                               
             KFP.TILL_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.TILL_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.FNR_EKNR ^= 0 &                                                
             KFP.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.FNR_EKNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.NAVN_EKNR ^= 0 &                                               
             KFP.NAVN_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.NAVN_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.PEN_INNTNR ^= 0 &                                              
             KFP.PEN_INNTNR ^= 999 THEN                                         
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.PEN_INNTNR;                         
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.AFP_ORDNINGNR ^= 0 &                                           
             KFP.AFP_ORDNINGNR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.AFP_ORDNINGNR;                      
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF KFP.AFP_TILLEGGKODENR ^= 0 &                                       
             KFP.AFP_TILLEGGKODENR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.AFP_TILLEGGKODENR;                  
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
          IF KFP.RED_GP_3_2_5NR ^= 0 &                                          
             KFP.RED_GP_3_2_5NR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = KFP.RED_GP_3_2_5NR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
                                                                                
                                                                                
    END FINN_FEIL_KFP;                                                          
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001UJ02;          /*     BLANK KF TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R001UJ03;          /*     KONTR KF SØKER      */                      
                                                                                
 END P119_BEHANDLE_KFP;                                                         
