 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.54 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.43 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.58.29 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.40.28 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO14  UNDERPROGRAM SOM BRUKES AV R001NO10.   */        
 /*                            KONTROLL BP-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NO14                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R0011102   BLANK BP TRANSOMR                                   */        
 /*    R0011103   KONTR BP                                            */        
 /*    FUNKSJONER SOM BRUKES ER INKLUDERT I HOVEDPROGRAMMET.          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR BP OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P111_BEHANDLE_BP: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P0011101;                               /* TRANSOMR BP */             
                                                                                
                                                                                
          CALL BLANK_BP_BARN;                            /* R0011102 */         
          CALL BLANK_BP_AVD;                             /* R0011102 */         
          CALL BLANK_BP_GEN;                             /* R0011102 */         
          CALL BLANK_BP_MELDNR;                          /* R0011102 */         
          CALL OVERFØR_BP;                                                      
          CALL KONTROLL_ETTERLATTE_BARN_EN(FEIL_FUNNET); /* R0011103 */         
                                                                                
          IF FEIL_FUNNET THEN                                                   
             CALL FINN_FEIL_BP;                                                 
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA INPUT_RECORD                  */        
 /*   TIL BP_TRANS_OMR I KOM_OMR FOR BP_BARN.                         */        
 /* ***************************************************************** */        
 OVERFØR_BP:                                                                    
    PROC;                                                                       
                                                                                
      DCL HJELPEDATO    PIC '(8)9';                                             
                                                                                
          BPB.REGDATO_ÅMD         = BLANKETT_RECORD.TRANS_DATO_ÅMD;             
          BPB.TERMID              = DIV_PARAM_OMR.TERMINAL_NR;                  
                                                                                
          DO I = 1 TO 5 WHILE(F_FELT_PIC_CHAR11                                 
                             (BP_BLANKETT.FNR_BARN(I))^= (11)' ');              
             BPB.TAB.FNR_BARN(I)  = BP_BLANKETT.FNR_BARN(I);                    
             BPB.TAB.NAVN_BARN(I) = BP_BLANKETT.NAVN_BARN(I);                   
             BPB.TAB.TKNR(I)      = BP_BLANKETT.TKNR_BARN(I);                   
          END;                                                                  
                                                                                
          BPB.SPRÅK               = BP_BLANKETT.SPRÅK;                          
          BPB.KT                  = BP_BLANKETT.KOMP_TILLEGG;                   
          HJELPEDATO              = BP_BLANKETT.VIRK_DATO_ÅMD / 100;            
          BPB.VIRK_DATO_ÅMD       = HJELPEDATO * 100;                           
          BPB.FNR_DØD             = BP_BLANKETT.FNR_AVD;                        
          BPB.NAVN_DØD            = BP_BLANKETT.NAVN_AVD;                       
          BPB.DØDSDATO_ÅMD        = BP_BLANKETT.DØDSDATO_ÅMD;                   
                                                                                
                                                                                
    END OVERFØR_BP;                                                             
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   PROSEDYRE FOR Å FINNE OG TA VARE PÅ FEIL_MELD_NR NÅR DET ER     */        
 /*   FEIL I DEN OVERFØRTE RECORDEN.                                  */        
 /* ***************************************************************** */        
 FINN_FEIL_BP:PROC;                                                             
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          DO I = 1 TO 10;                                                       
                                                                                
             IF BPB.TAB.FNR_BARNNR(I) ^= 0   &                                  
                BPB.TAB.FNR_BARNNR(I) ^= 999 THEN                               
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = BPB.TAB.FNR_BARNNR(I);               
                   IF FEIL_IND ^= 3            THEN                             
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
             IF BPB.TAB.NAVN_BARNNR(I) ^= 0   &                                 
                BPB.TAB.NAVN_BARNNR(I) ^= 999 THEN                              
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = BPB.TAB.NAVN_BARNNR(I);              
                   IF FEIL_IND ^= 3            THEN                             
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
             IF BPB.TAB.TKNRNR(I) ^= 0       &                                  
                BPB.TAB.TKNRNR(I) ^= 999     THEN                               
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = BPB.TAB.TKNRNR(I);                   
                   IF FEIL_IND ^= 3            THEN                             
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
          END;                                                                  
                                                                                
          IF BPB.SPRÅKNR ^= 0   &                                               
             BPB.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = BPB.SPRÅKNR;                            
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF BPB.KTNR ^= 0   &                                                  
             BPB.KTNR ^= 999 THEN                                               
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = BPB.KTNR;                               
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF BPB.VIRK_DATO_ÅMDNR ^= 0  &                                        
             BPB.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = BPB.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF BPB.FNR_DØDNR ^= 0   &                                             
             BPB.FNR_DØDNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = BPB.FNR_DØDNR;                          
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF BPB.NAVN_DØDNR ^= 0   &                                            
             BPB.NAVN_DØDNR ^= 999 THEN                                         
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = BPB.NAVN_DØDNR;                         
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF BPB.DØDSDATO_ÅMDNR ^= 0   &                                        
             BPB.DØDSDATO_ÅMDNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = BPB.DØDSDATO_ÅMDNR;                     
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
    END FINN_FEIL_BP;                                                           
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0011102;          /*     BLANK BP TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R0011103;          /*     KONTR BP SØKER      */                      
                                                                                
                                                                                
 END P111_BEHANDLE_BP;                                                          
                                                                                
                                                                                
