 /*   SIST ENDRET PÅ PROD   2000.12.07 12.35.38 AV   JDA7339          */        
 /*       SIST ENDRET 28/11-00 10.27.00 AV   SEB7339                  */        
 /*       SIST ENDRET 04/05-98 13.15.00 AV   JDA7339                  */        
 /*       SIST ENDRET 12/03-98 10.35.05 AV   SLA9300                  */        
 /*       SIST ENDRET 21/06-93 10.52.36 AV   HERMAN                   */        
 /*       SIST ENDRET 17/07-92 13.47.41 AV   DYBVIK                   */        
 /*       SIST ENDRET 13/12-91 12.34.06 AV   DYBVIK                   */        
 /*********************************************************************/        
 /* IDENTIFIKASJON:                                                   */        
 /*    R0016053 - INCLUDEMODUL                                        */        
 /*    LAGET:     BJØRG, DESEMBER 91                                  */        
 /* HENSIKT:                                                          */        
 /*    EKSTRA-TEST PÅ OM APOPPL-SEGMENT SKAL DANNES - PGA. AT RF-SYST.*/        
 /*    IKKE REGNER APD, MÅ VI I VISSE TILFELLER SAMMENLIGNE UTREGNET  */        
 /*    APD I B01 OG B02.                                              */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*    LOKAL PROSEDYRE I R0016001                                     */        
 /*********************************************************************/        
                                                                                
 F_REGN_APD_B01_B02: PROCEDURE  RETURNS (BIT (1)) ;                             
                                                                                
 DCL (B01_APD,                                                                  
      B02_APD)               DEC FIXED (3) ;                                    
 DCL  B01_BELØP              DEC FIXED (5) ;                                    
 DCL  B02_BELØP              DEC FIXED (5) ;                                    
 DCL  ABS                    BUILTIN ;                                          
                                                                                
    B01_BELØP =    B01.PERSON(I).ALDERSP.GP          +                          
                   B01.PERSON(I).ALDERSP.TP          +                          
                   B01.PERSON(I).ALDERSP.AP_ST_NETTO +  /* SEB7339 */           
                   B01.PERSON(I).ETTEPENS.TP_BRUTTO  ;                          
                                                                                
    IF B01_BELØP  >  0  THEN                                                    
      B01_APD = (((B01.PERSON(I).ALDERSP.AP_GP_NETTO +                          
                   B01.PERSON(I).ALDERSP.AP_TP_NETTO +                          
                   B01.PERSON(I).ALDERSP.AP_ST_NETTO +  /* SEB7339 */           
                   B01.PERSON(I).ETTEPENS.TP_NETTO ) /                          
                   B01_BELØP                         ) * 100 ) + 0.5 ;          
    ELSE                                                                        
      B01_APD =    0 ;                                                          
                                                                                
                                                                                
    B02_BELØP =    B02.PERSON(I).ALDERSP.GP          +                          
                   B02.PERSON(I).ALDERSP.TP          +                          
                   B02.PERSON(I).ALDERSP.AP_ST_NETTO +  /* SEB7339 */           
                   B02.PERSON(I).ETTEPENS.TP_BRUTTO  ;                          
                                                                                
    IF B02_BELØP  >  0  THEN                                                    
      B02_APD = (((B02.PERSON(I).ALDERSP.AP_GP_NETTO +                          
                   B02.PERSON(I).ALDERSP.AP_TP_NETTO +                          
                   B02.PERSON(I).ALDERSP.AP_ST_NETTO +  /* SEB7339 */           
                   B02.PERSON(I).ETTEPENS.TP_NETTO ) /                          
                   B02_BELØP                         ) * 100 ) + 0.5 ;          
    ELSE                                                                        
      B02_APD =    0 ;                                                          
                                                                                
    RETURN (ABS (B01_APD - B02_APD) > 1) ;                                      
                                                                                
 END F_REGN_APD_B01_B02 ;                                                       
                                                                                
