 /*       SIST ENDRET 07/05-98 15.57.46 AV   SPA7339                  */00000000
 /*       SIST ENDRET 09/03-98 10.29.25 AV   SPA7339                  */00000010
 /*       SIST ENDRET 12/10-95 14.12.52 AV   JDA0310                  */00000020
  /* **************************************************************** */00000030
  /*IDENTIFIKASJON:                                                   */00000040
  /*    R0015502 - HOVEDPROGRAM I PLI                                 */00000050
  /*                                                                  */00000060
  /*    PROGRAMMERER: PATHAK             OKTOBER  1995                */00000070
  /*                                                                  */00000080
  /*HENSIKT:                                                          */00000090
  /*    FJERNER US TRANSER     FRA    DB.                             */00000100
  /*                                                                  */00000110
  /*PROGRAMTILKNYTNING:                                               */00000120
  /*                                                                  */00000130
  /*BRUKER                                                            */00000140
  /*                                                                  */00000150
  /* **************************************************************** */00000160
                                                                        00000170
  R001550:                                                              00000180
    PROC            (LOKAL_KOM_PTR)                                     00000190
           OPTIONS  (MAIN);                                             00000200
                                                                        00000210
    %PAGE;                                                              00000220
    %INCLUDE P0019908;                         /* KOM_OMR         (B) */00000230
                                                                        00000240
    %PAGE;                                                              00000250
    %INCLUDE P0019912;                         /* DIV_PARAM_OMR   (B) */00000260
    %INCLUDE P0019913;                         /* LOKAL_KOM_OMR   (B) */00000270
                                                                        00000280
    %PAGE;                                                              00000290
    /* ************************************************************** */00000300
    /*   INNEBYGDE PLI-FUNKSJONER                                     */00000310
    /* ************************************************************** */00000320
                                                                        00000330
       DCL                                                              00000340
         ( ADDR , CSTG , LOW , STG , SUBSTR )  BUILTIN;                 00000350
       DCL                                                              00000360
         PLITDLI ENTRY;                                                 00000370
                                                                        00000380
       DCL                                                              00000390
         ( LOKAL_KOM_PTR, COMMAREA_PEKER , W01_HJELPE_PEKER ) POINTER;  00000400
    /* ************************************************************** */00000410
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */00000420
    /* ************************************************************** */00000430
                                                                        00000440
    %INCLUDE DLIUIB;                                                    00000450
                                                                        00000460
       DCL                                                              00000470
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );   00000480
                                                                        00000490
                                                                        00000500
    %PAGE;                                                              00000510
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */00000520
                                                                        00000530
                                                                        00000540
    /* ************************************************************** */00000550
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */00000560
    /* ************************************************************** */00000570
                                                                        00000580
    %PAGE;                                                              00000590
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                   00000600
    %INCLUDE P0012003;                         /* PCB                 */00000610
                                                                        00000620
                                                                        00000630
    /* ************************************************************** */00000640
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */00000650
    /* ************************************************************** */00000660
                                                                        00000670
       DCL 1  W01                       UNALIGNED,                      00000680
              2   MER_DATA                    BIT  (1)   INIT ('1'B),   00000690
              2   BARN_IKKE_LEST              BIT  (1)   INIT ('1'B),   00000700
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),   00000710
              2   TO_GRUNNBYP_LEST            BIT  (1)   INIT ('0'B),   00000720
              2   GRUNNBYP_IKKE_LEST          BIT  (1)   INIT ('1'B),   00000730
              2   TO_GRUNNEES_LEST            BIT  (1)   INIT ('0'B),   00000740
              2   GRUNNEES_IKKE_LEST          BIT  (1)   INIT ('1'B),   00000750
              2   NAVN                        CHAR (25)  INIT ((25)' '),00000760
              2   VIRK_DATO_ÅMD               PIC '(8)9' INIT ( 0  ),   00000770
              2   VTP_ÅMD_SISTE               PIC '(8)9' INIT ( 0  ),   00000780
              2   I                    FIXED  BIN  (15)  INIT (1),      00000790
              2   J                    FIXED  BIN  (15)  INIT (1);      00000800
                                                                        00000810
    /* ************************************************************** */00000820
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */00000830
    /* ************************************************************** */00000840
                                                                        00000850
 /*    DCL 1  W01_DLI_PARAM,    OMRÅDET ÅMD VÆRE UNALIGNED     */       00000860
 /*                             NY VERSJON AV IMS  120788 BF   */       00000870
                                                                        00000880
       DCL 1  W01_DLI_PARAM      UNALIGNED,                             00000890
              2   W02_GU                  CHAR (4)   INIT ('GU  '),     00000900
              2   W02_GN                  CHAR (4)   INIT ('GN  '),     00000910
              2   W02_GHN                 CHAR (4)   INIT ('GHN '),     00000920
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),     00000930
              2   W02_DLET                CHAR (4)   INIT ('DLET'),     00000940
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),          00000950
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),          00000960
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),          00000970
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');  00000980
                                                                        00000990
       DCL    W01_IO                CHAR (340)       INIT ( (340) ' ' ),00001000
              W01_HJELPE_IO         CHAR (340) BASED (W01_HJELPE_PEKER);00001010
                                                                        00001020
    /* ************************************************************** */00001030
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */00001040
    /* ************************************************************** */00001050
                                                                        00001060
       DCL    SSA_UQUAL                       CHAR (9) INIT ((9)' ');   00001070
                                                                        00001080
       DCL 1  SSA1_TRANHIST_CMD               ,                         00001090
              2    HDEL                       CHAR (19)  INIT           00001100
                                                ('TRANHIST*P(GRBLKODE'),00001110
              2    REL_OP_1                   CHAR (2)   INIT ('^='),   00001120
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00001130
              2    HP                         CHAR (1)   INIT (')');    00001140
                                                                        00001150
                                                                        00001160
                                                                        00001170
       DCL 1  SSA_UQUAL_CMD          UNALIGNED,                         00001180
              2   NAVN                        CHAR (8) INIT('TRANHIST'),00001190
              2   KODE                        CHAR (2) INIT('*P');      00001200
                                                                        00001210
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                         00001220
              2    HDEL                       CHAR (17)  INIT           00001230
                                                  ('RF0PERSN(FNR     '),00001240
              2    REL_OP                     CHAR (2)   INIT (' ='),   00001250
              2    PKEY              FIXED    DEC  (11),                00001260
              2    HP                         CHAR (1)   INIT (')' );   00001270
                                                                        00001280
       DCL 1  SSA1_TRANHIST          UNALIGNED,                         00001290
              2    HDEL                       CHAR (19)  INIT           00001300
                                                ('TRANHIST*P(VIRKDATO'),00001310
              2    REL_OP_1                   CHAR (1)   INIT (' '),    00001320
              2    REL_OP_2                   CHAR (1)   INIT ('>'),    00001330
              2    VTP               FIXED    DEC  (8)   INIT ( 0 ),    00001340
              2    KONKAT                     CHAR (1)   INIT ('&'),    00001350
              2    MDEL                       CHAR (8)   INIT           00001360
                                                        ('GRBLKODE'),   00001370
              2    REL_OP_3                   CHAR (2)   INIT ('^='),   00001380
              2    GRBLKODE                   CHAR (2)   INIT ('US'),   00001390
              2    HP                         CHAR (1)   INIT (')');    00001400
                                                                        00001410
                                                                        00001420
    /* ************************************************************** */00001430
    /*                                                                */00001440
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */00001450
    /*     ---------------------------------------------------        */00001460
    /*                                                                */00001470
    /*                                                                */00001480
    /*      INITIERING AV PARAMETRE TIL DIV_PARAM_OMR.                */00001490
    /*                                                                */00001500
    /*      SETTER UIBPTR = UIB_PEKER   SOM OVERFØRES ETTER           */00001510
    /*      INITIERINGS-KALL   I     R0012001 .                       */00001520
    /*                                                                */00001530
    /* ************************************************************** */00001540
                                                                        00001550
                                                                        00001560
                                                                        00001570
                                                                        00001580
    COMMAREA_PEKER =  HOVED_KOM_OMR_PTR;                                00001590
    PROGRAM_ID                              =   'R0015502'             ;00001600
    UIBPTR                                  =    UIB_PEKER             ;00001610
                                                                        00001620
                                                                        00001630
    IF SUBSTR(CICS_NAVN,1,4) = 'HELP'     THEN                          00001640
             SSA1_TRANHIST_CMD.REL_OP_1 = ' =' ;                        00001650
                                                                        00001660
                                                                        00001670
    /* ********************************************************** */    00001680
    /* SETTER INN VERDIENE I SSA'ENE.                             */    00001690
    /* ********************************************************** */    00001700
                                                                        00001710
    SSA1_RF0PERSN.PKEY              =   SEARCH_FNR                 ;    00001720
    CALL  P005_LES_ROT_GU;                                              00001730
       IF FEIL_MELD_NR         >     0               THEN               00001740
          GO   TO   L999;                                               00001750
                                                                        00001760
    DO I = 1 TO TRANS_ANT          WHILE (FEIL_MELD_NR = 0);            00001770
                                                                        00001780
       CALL P020_LES_NESTE_TRANHIST;                                    00001790
                                                                        00001800
       IF FEIL_MELD_NR         >     0               THEN               00001810
          GO   TO   L999;                                               00001820
                                                                        00001830
       CALL  P030_DLET_TRANHIST;                                        00001840
    END;                                                                00001850
                                                                        00001860
    /* ************************************************************** */00001870
    /* ************************************************************** */00001880
    /* ************************************************************** */00001890
                                                                        00001900
                                                                        00001910
    %PAGE;                                                              00001920
    /* ************************************************************** */00001930
    /*                                                                */00001940
    /* PROCEDURE FOR LESE ROT-SEGM              ( GHU   )             */00001950
    /*                                                                */00001960
    /* ************************************************************** */00001970
                                                                        00001980
    P005_LES_ROT_GU:                                                    00001990
      PROC;                                                             00002000
                                                                        00002010
      CALL PLITDLI                              (W02_PARM_CT_4,         00002020
                                                 W02_GU,                00002030
                                                 RF1,                   00002040
                                                 W01_IO,                00002050
                                                 SSA1_RF0PERSN);        00002060
                                                                        00002070
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00002080
        DO;                                                             00002090
          SELECT  ( RF1.STATUS_KODE );                                  00002100
                                                                        00002110
            WHEN  ( '  ' )                                              00002120
              W01.MER_DATA                 =    '1'B;                   00002130
                                                                        00002140
            WHEN  ( 'GE' )                                              00002150
              W01.MER_DATA                 =    '0'B;                   00002160
                                                                        00002170
            OTHERWISE                                                   00002180
              DO;                                                       00002190
                /* ************************************************** */00002200
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00002210
                /* ************************************************** */00002220
  L110:                                                                 00002230
                DB_STATUS_KODE             = RF1.STATUS_KODE;           00002240
                FEIL_MELD_NR               =     500;                   00002250
                FEIL_VED_LABEL             =    '110';                  00002260
                                                                        00002270
              END;                                                      00002280
          END;                                                          00002290
        END;                                                            00002300
      ELSE                                                              00002310
        DO;                                                             00002320
          /* ************************************************** */      00002330
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00002340
          /* ************************************************** */      00002350
  L120:                                                                 00002360
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00002370
          FEIL_MELD_NR               =     500;                         00002380
          FEIL_VED_LABEL             =    '120';                        00002390
        END;                                                            00002400
    END P005_LES_ROT_GU;                                                00002410
                                                                        00002420
                                                                        00002430
                                                                        00002440
    /* ************************************************************** */00002450
    /*                                                                */00002460
    /* PROCEDURE FOR LESE NESTE TRANHIST (GN    UKVALIFISERT  )       */00002470
    /*                                                                */00002480
    /* ************************************************************** */00002490
                                                                        00002500
    P020_LES_NESTE_TRANHIST:                                            00002510
      PROC;                                                             00002520
                                                                        00002530
      CALL PLITDLI                              (W02_PARM_CT_5,         00002540
                                                 W02_GHN,               00002550
                                                 RF1,                   00002560
                                                 W01_IO,                00002570
                                                 SSA1_RF0PERSN,         00002580
                                                 SSA1_TRANHIST_CMD);    00002590
                                                                        00002600
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00002610
        DO;                                                             00002620
          SELECT ( RF1.STATUS_KODE );                                   00002630
                                                                        00002640
            WHEN ( '  ' , 'GA' , 'GK' )                                 00002650
              W01.MER_DATA                 =    '1'B;                   00002660
                                                                        00002670
            WHEN ( 'GE' , 'GB' )                                        00002680
              W01.MER_DATA                 =    '0'B;                   00002690
                                                                        00002700
            OTHERWISE                                                   00002710
              DO;                                                       00002720
                /* ************************************************** */00002730
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00002740
                /* ************************************************** */00002750
  L130:                                                                 00002760
                DB_STATUS_KODE             = RF1.STATUS_KODE;           00002770
                FEIL_MELD_NR               =     500;                   00002780
                FEIL_VED_LABEL             =    '130';                  00002790
                                                                        00002800
              END;                                                      00002810
          END;                                                          00002820
        END;                                                            00002830
      ELSE                                                              00002840
        DO;                                                             00002850
          /* ************************************************** */      00002860
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00002870
          /* ************************************************** */      00002880
  L140:                                                                 00002890
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00002900
          FEIL_MELD_NR               =     500;                         00002910
          FEIL_VED_LABEL             =    '140';                        00002920
        END;                                                            00002930
    END P020_LES_NESTE_TRANHIST;                                        00002940
                                                                        00002950
                                                                        00002960
                                                                        00002970
                                                                        00002980
    /* ************************************************************** */00002990
    /*                                                                */00003000
    /* PROCEDURE FOR FJRENE THRANHIST                                 */00003010
    /*                                                                */00003020
    /* ************************************************************** */00003030
                                                                        00003040
    P030_DLET_TRANHIST:                                                 00003050
      PROC;                                                             00003060
                                                                        00003070
      CALL PLITDLI                              (W02_PARM_CT_3,         00003080
                                                 W02_DLET,              00003090
                                                 RF1,                   00003100
                                                 W01_IO);               00003110
                                                                        00003120
      IF   UIBFCTR                         =     UIB_RC_OK    THEN      00003130
        DO;                                                             00003140
          SELECT ( RF1.STATUS_KODE );                                   00003150
            WHEN ( '  ' , 'GA' , 'GK' )                                 00003160
              W01.MER_DATA                 =    '1'B;                   00003170
            WHEN ( 'GE' , 'GB' )                                        00003180
              W01.MER_DATA                 =    '0'B;                   00003190
            OTHERWISE                                                   00003200
              DO;                                                       00003210
                /* ************************************************** */00003220
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */00003230
                /* ************************************************** */00003240
  L150:                                                                 00003250
                DB_STATUS_KODE             = RF1.STATUS_KODE;           00003260
                FEIL_MELD_NR               =     500;                   00003270
                FEIL_VED_LABEL             =    '150';                  00003280
                                                                        00003290
              END;                                                      00003300
          END;                                                          00003310
        END;                                                            00003320
      ELSE                                                              00003330
        DO;                                                             00003340
          /* ************************************************** */      00003350
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00003360
          /* ************************************************** */      00003370
  L160:                                                                 00003380
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00003390
          FEIL_MELD_NR               =     500;                         00003400
          FEIL_VED_LABEL             =    '160';                        00003410
        END;                                                            00003420
    END P030_DLET_TRANHIST;                                             00003430
                                                                        00003440
                                                                        00003450
                                                                        00003460
                                                                        00003470
    /* ************************************************************ */  00003480
    /*                                                              */  00003490
    /*  LESER NESTE TRANS MED :                   VTP  >   VTP.NS   */  00003500
    /*                                                              */  00003510
    /* ************************************************************ */  00003520
                                                                        00003530
    P030_LES_TRANHIST_GN_QUAL:                                          00003540
      PROC;                                                             00003550
                                                                        00003560
      CALL PLITDLI                              (W02_PARM_CT_5,         00003570
                                                 W02_GN,                00003580
                                                 RF1,                   00003590
                                                 W01_IO,                00003600
                                                 SSA1_RF0PERSN,         00003610
                                                 SSA1_TRANHIST);        00003620
                                                                        00003630
                                                                        00003640
                                                                        00003650
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN      00003660
        DO;                                                             00003670
          /* ************************************************** */      00003680
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */      00003690
          /* ************************************************** */      00003700
  L170:                                                                 00003710
          DB_STATUS_KODE             = RF1.STATUS_KODE;                 00003720
          FEIL_MELD_NR               =     500;                         00003730
          FEIL_VED_LABEL             =    '170';                        00003740
          GO   TO  RETUR;                                               00003750
        END;                                                            00003760
                                                                        00003770
      SELECT ( RF1.STATUS_KODE );                                       00003780
                                                                        00003790
        WHEN ( '  ' , 'GA' , 'GK' )                                     00003800
          DO;                                                           00003810
            /* ************************************** */                00003820
            /*  VTP LEST TRANS    >    VTP NST SISTE  */                00003830
            /* ************************************** */                00003840
                                                                        00003850
            W01.MER_DATA                   =    '1'B;                   00003860
          END;                                                          00003870
                                                                        00003880
        WHEN ( 'GE' , 'GB' )                                            00003890
          DO;                                                           00003900
            /* ************************************** */                00003910
            /*  FINNES INGEN TRANS                    */                00003920
            /* ************************************** */                00003930
                                                                        00003940
            W01.MER_DATA         =   '0'B;                              00003950
          END;                                                          00003960
                                                                        00003970
        OTHERWISE                                                       00003980
          DO;                                                           00003990
            /* ************************************************** */    00004000
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */    00004010
            /* ************************************************** */    00004020
                                                                        00004030
  L180:                                                                 00004040
            DB_STATUS_KODE             = RF1.STATUS_KODE;               00004050
            FEIL_MELD_NR               =     500;                       00004060
            FEIL_VED_LABEL             =    '180';                      00004070
          END;                                                          00004080
                                                                        00004090
      END;  /*      SELECT  (RF1.STATUS_KODE)                      */   00004100
                                                                        00004110
  RETUR:                                                                00004120
    END P030_LES_TRANHIST_GN_QUAL;                                      00004130
                                                                        00004140
                                                                        00004150
                                                                        00004160
    /* ********************************************************* */     00004170
    /*                                                           */     00004180
    /* *****  PROC SOM KALLER RIKTIG BLANKETT-OMRÅDET  *******   */     00004190
    /*                                                           */     00004200
    /* ********************************************************* */     00004210
                                                                        00004220
  L999:                                                                 00004230
                                                                        00004240
    EXEC CICS RETURN;                                                   00004250
  END R001550;                                                          00004260
