 /*   SIST ENDRET PÅ PROD   2006.06.22 12.04.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.06.22 12.03.01 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.09.26 13.49.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.09.26 13.31.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.50.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.28  9.19.59 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.58.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.07.16 12.49.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.09.25 10.52.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.01.13 13.02.38 AV   JDA7339          */        
 /*       SIST ENDRET 30/09-98 14.14.33 AV   TSB7339                  */        
 /*       SIST ENDRET 02/09-98 10.28.51 AV   SPA7339                  */        
 /* *******************************************************************/        
 /* PROGRAM NAME  : R001I501                                          */        
 /* LANGUAGE      : PL/1                                              */        
 /* *******************************************************************/        
 /*    REGISTRERING AV FORELØPIG INNTEKT.                             */        
 /* ------------------------------------------------------------------*/        
 /*  -----------------------------------------------------------------*/        
 /*  SIST ENDRET 6/5-94 AV OLAV                                       */        
 /*    HVIS W02_INNT_TYPE = 'J','K' ELLER 'L'                         */        
 /*    SÅ AVSLUTTES IKKE 'TASKEN  (V/SAMME INNTEKT OG KOMMUNENR).     */        
 /*  ---------------------------------------------------------------- */        
 /*  -----------------------------------------------------------------*/        
 /*  SIST ENDRET 6/9-90 AV TUYEN                                      */        
 /*    KORREKSJON AV INNTEKT PÅ SAMME INNTEKTTYPE OG ÅR MEN ULIKE     */        
 /*    KOMMUNE GODTAS MEN MED EN ADVARSEL.                            */        
 /*  ---------------------------------------------------------------- */        
 /*  SIST ENDRET 10/1-90 AV   TUYEN                                   */        
 /*    1. KONTROLL-LISTA VISER GAMMEL REG. DATO ISTEDENFOR            */        
 /*       DAGENS DATO (FOR 'FJERNING VED KORRIGERING').               */        
 /*    2. DERSOM DEN NYE REGISTRERINGEN ER HELT LIK DET SOM STÅR INNE */        
 /*       FRA FØR, KOMMER DET EN MELDING OM DETTE.                    */        
 /*  ---------------------------------------------------------------  */        
 /*  SIST ENDRET 20/11-89 AV   TUYEN                                  */        
 /*    1. FOR FØRSTE GANG REGISTRERING OG KORREKSJON:                 */        
 /*          DERSOM DET LIGGER I BASEN EN INNTEKT SOM ER LIK DET      */        
 /*          REGISTRERTE INNTEKT OG KOMMUNENR ER LIKE MEN             */        
 /*          INNTEKT-TYPE ER ULIKE:                                   */        
 /*          - SLIK GODTAS DET IDAG                                   */        
 /*          - NÅ ENDRES DET S.A. REGISTRERING AVVISES                */        
 /*                                                                   */        
 /*          FOR REC_ART B (INNTEKT-TYPE B, C, D) VIL REGISTRERINGEN  */        
 /*          GODTAS MEN MED EN ADVARSEL.                              */        
 /*                                                                   */        
 /*  PROGRAMMET FORTAR REGISTRERING AV NYE INNTEKTER.                 */        
 /*                                                                   */        
 /*  PROGRAMMERER ROLF FARVIK, DATA-UTVIKLING A/S ,   JULI 1983       */        
 /* ***************************************************************** */        
 /* ENDRET 29.01.85 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */        
 /* ---------------                                                   */        
 /*    LEGGER UT DATA TIL NORTRYGD. TKNR FINNES VED 1. OG SJEKKE OM   */        
 /*    DET FINNES I ROT-SEGM. ER RF0PERSN.TKNR = 0 BRUKES KOMMNR. I   */        
 /*    SISTE INNTEKTS-SEGM.                                           */        
 /* ***************************************************************** */        
 /*  ---------------------------------------------------------------  */        
 /*  ENDRET 08.06.1998 AV O.GØYTIL           ÅR2000-TILPASNING        */        
 /*  ---------------------------------------------------------------  */        
                                                                                
 R001I50:                                                                       
   PROC (COMMAREA_PEKER) OPTIONS(MAIN);                                         
                                                                                
 %PAGE;                                                                         
      %INCLUDE S001I4;     /*  INNTEKTMAPSET4    (BASED) */                     
                                                                                
 %PAGE;                                                                         
      %INCLUDE P001I401;   /*  TRANS_OMR          (BASED) */                    
 %PAGE;                                                                         
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */                    
 %PAGE;                                                                         
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                            
 %PAGE;                                                                         
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */                       
 %PAGE;                                                                         
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */                      
 %PAGE;                                                                         
 %SKIP(1);                                                                      
                                                                                
                                                                                
  DCL DUMMY_ÅR    PIC '(4)9';                               /*Y2K*/             
  DCL FNR11                      PIC '(11)9'  INIT ( 0 )   ;                    
  DCL FNR_PIC13                  PIC '(13)9'  INIT ( 0 )   ;                    
  DCL FNR_ÅRH                    PIC '9'      DEF FNR_PIC13 POS(9);             
  DCL FNR_ÅR                     PIC '9999'   DEF FNR_PIC13 POS(5);             
  DCL ÅR_PIC                     PIC '(4)9'   INIT ( 0 )   ; /*Y2K*/            
  DCL INNT_ALDER                 PIC '(2)9'                ;                    
  DCL INNT_MÅ                    PIC '(4)9'                ;                    
  DCL FEILTYPE                   PIC '(1)9'                ;                    
  DCL ÅR_CHAR                    CHAR (4)     DEF ÅR_PIC   ; /*Y2K*/            
  DCL FATAL_FEIL                 BIT  (1)     INIT ('0'B)  ;                    
  DCL ROT_IKKE_FUNNET            BIT  (1)     INIT ('0'B)  ;                    
  DCL IKKE_FUNNET                BIT  (1)     INIT ('0'B)  ;                    
  DCL ANT_X                      FIXED DEC(9) INIT (0)     ;                    
  DCL FEIL                       CHAR(2)       ;                                
  DCL FTYPE                      CHAR(1)       ;                                
  DCL FART                       CHAR(1)       ;                                
  DCL TEKST                      CHAR(10)      ;                                
  DCL ÅR_DAGNR_C8                CHAR (8)    ; /*Y2K*/                          
  DCL ÅR_DAGNR_N7  DEF ÅR_DAGNR_C8                                              
                     POS (1)          PIC '(7)9'; /*Y2K*/                       
  DCL DATO_NUM                   PIC '(8)9'    ; /*Y2K*/                        
                                                                                
   DCL                                                                          
       MAP_MELDING              CHAR(78)      INIT((78)' '),                    
       1  FEIL_STRUC,                                                           
          2  FEIL_NR               FIXED DEC(5),                                
          2  FEIL_MELDING          CHAR     (78),                               
          2  KOM_OMR_PEKER         POINTER;                                     
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
       DCL                                                                      
      (TIME,DATE ,ADDR , CSTG , LOW , STG , SUBSTR ,ONCODE, VERIFY,             
       DATETIME)                                             BUILTIN;           
                                                                                
       DCL                                                                      
         PLITDLI ENTRY,                                                         
              BMSMAPBR  PTR;                                                    
                                                                                
    /* ************************************************************** */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
       DCL                                                                      
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );           
                                                                                
       DCL                                                                      
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )               
                                               POINTER;                         
                                                                                
    /* ************************************************************** */        
    /*   ROT_SEGMENT.                                                 */        
    /* ************************************************************** */        
                                                                                
       DCL 1  RF0PERSN               UNALIGNED,                                 
       %INCLUDE P0019927;                                                       
                                                                                
    /* ************************************************************** */        
    /*   STATUS-SEGMENTET                                             */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_STATUS             UNALIGNED,                                 
       %INCLUDE P0019930;                                                       
                                                                                
    /* ************************************************************** */        
    /*   INNTEKT-SEGMENTET                                            */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_PINT               UNALIGNED,                                 
       %INCLUDE P0019928;                                                       
                                                                                
    /* ************************************************************** */        
    /*   DIV HJELPEFELT.                                              */        
    /* ************************************************************** */        
       DCL WFNR                            PIC '(11)9';                         
                                                                                
       DCL 1  W01,                                                              
              2   W02_INNT_TYPE               CHAR ( 1),                        
    /*Y2K*/   2   W02_DAGENS_DATO       FIXED DEC  ( 8),                        
              2   FNR                   FIXED DEC  (11) INIT ( 0  ),            
              2   TKNR                  FIXED DEC  ( 4) INIT ( 0  ),            
              2   MER_DATA                    BIT  ( 1) INIT ('0'B),            
              2   TIDL_FFU                    BIT  ( 1) INIT ('0'B);            
                                                                                
    /* ************************************************************** */        
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_DLI_PARAM,                                                    
              2   W02_GET                 CHAR (4)   INIT ('    '),             
              2   W02_GHU                 CHAR (4)   INIT('GHU '),              
              2   W02_DLET                CHAR (4)   INIT('DLET'),              
              2   W02_ISRT                CHAR (4)   INIT('ISRT'),              
              2   W02_REPL                CHAR (4)   INIT('REPL'),              
              2   W02_GU                  CHAR (4)   INIT ('GU  '),             
              2   W02_GN                  CHAR (4)   INIT ('GN  '),             
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),             
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                  
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                  
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),                  
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');          
                                                                                
       DCL    W01_IO                CHAR (150)       INIT ( (150) ' ' );        
                                                                                
    /* ************************************************************** */        
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
    /* ************************************************************** */        
                                                                                
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ')  ;        
                                                                                
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ')  ;        
                                                                                
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');        
                                                                                
                                                                                
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('RF0PERSN(FNR     '),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
              2    PKEY               FIXED   DEC  (11),                        
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
                                                                                
       DCL 1  SSA1_STATUS            UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('STATUS  (STATKODE'),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
              2    STATKODE                   CHAR (1)   INIT ('S'),            
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
                                                                                
                                                                                
       DCL 1  SSA1_PINNTEKT          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('PINNTEKT(INNTÅRTY'),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
      /*Y2K*/ 2    ÅR                 FIXED   DEC  (4),                         
              2    TYPE                       CHAR (1),                         
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
                                                                                
                                                                                
                                                                                
       DCL 1  SSA2_PINNTEKT          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('PINNTEKT(INNTÅR  '),                                       
              2    REL_OP1                    CHAR (2)   INIT (' ='),           
      /*Y2K*/ 2    ÅR                 FIXED   DEC  (4),                         
              2    KONKAT                     CHAR (1)   INIT('&'),             
              2    UDEL                       CHAR (8)   INIT                   
                   ('INNTTYPE'),                                                
              2    REL_OP2                    CHAR (2)   INIT (' ='),           
              2    TYPE                       CHAR (1),                         
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
 /* TILLEGG 08.12.89 AV TUYEN */                                                
                                                                                
       DCL 1  SSA3_PINNTEKT          UNALIGNED,                                 
              2    HDEL1                      CHAR (17)  INIT                   
                   ('PINNTEKT(INNTÅRTY'),                                       
              2    REL_OP1                    CHAR (2)   INIT ('=>'),           
      /*Y2K*/ 2    ÅR1                FIXED   DEC  (4),                         
              2    TYPE1                      CHAR (1),                         
              2    KONKAT                     CHAR (1)   INIT ('&') ,           
              2    HDEL2                      CHAR (8)   INIT                   
                   ('INNTÅRTY'),                                                
              2    REL_OP2                    CHAR (2)   INIT ('<='),           
     /*Y2K*/  2    ÅR2                FIXED   DEC  (4),                         
              2    TYPE2                      CHAR (1),                         
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
 /* TILLEGG 1/10-90 AV TUYEN */                                                 
                                                                                
       DCL 1  SSA4_PINNTEKT          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('PINNTEKT(INNTÅR  '),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
     /*Y2K*/  2    ÅR                 FIXED   DEC  (4),                         
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
 /* TIL HIT */                                                                  
                                                                                
    /* ************************************************************** */        
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */        
    /* ************************************************************** */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */        
    %PAGE;                                                                      
                                                                                
    /* DCL 1  B01              BASED (B01_PEKER),                               
    %INCLUDE P0019921;                */       /* B01_OMR (BASED)     */        
                                                                                
                                                                                
    %PAGE;                                                                      
    /* DCL 1  B02              BASED (B02_PEKER),                               
    %INCLUDE P0019921;                  */     /* B02_OMR (BASED)     */        
                                                                                
    %PAGE;                                                                      
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                           
    %INCLUDE P0012003;                         /* PCB                 */        
                                                                                
                                                                                
    %PAGE;                                                                      
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
    /*     ---------------------------------------------------        */        
    /*                                                                */        
    /*                                                                */        
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */        
    /*                                                                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
  PROGRAM_ID            = 'R001I501'                   ;                        
                                                                                
                                                                                
  DB_STATUS_KODE        = '  '                         ;                        
  FEIL_MELD_NR          = 0                            ;                        
  DATO_NUM              = DATO_2000                    ; /*Y2K*/                
  UIBPTR                = PCB_UIB_PEKER_OMR.UIB_PEKER  ;                        
                                                                                
                                                                                
                                                                                
  DO  I = 8 TO 14 WHILE(NIS.ÅR(I) > 0 & FEIL_MELD_NR = 0);                      
                                                                                
      CALL BEREGN_INNT_TYPE(                                                    
                 NIS.TYPE(I),NIS.ART(I),W02_INNT_TYPE);                         
                                                                                
      SSA1_RF0PERSN.PKEY               =     NISF.FNR ;                         
      SEARCH_FNR                       = NISF.FNR;                              
      WFNR = SEARCH_FNR  ;                                                      
      ROT_IKKE_FUNNET                  =     '0'B     ;                         
      IKKE_FUNNET                      =     '0'B     ;                         
                                                                                
      CALL P05_SJEKK_OM_DØD;                                                    
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
         GOTO L999;                                                             
                                                                                
      CALL P10_BEHANDLE_PINNTEKT;                                               
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
         GOTO L999;                                                             
                                                                                
      IF FEILTYPE    > 0 THEN                                                   
         GOTO FORTSETT;                                                         
                                                                                
      IF NIS.TYPE(I) = 'S' !                                                    
         NIS.TYPE(I) = 'D' !                                                    
         (NIS.TYPE(I) = 'B' & (NIS.MERKE(I) = 1 ! NIS.MERKE(I) = 5)) !          
         (NIS.TYPE(I) = 'C' &  NIS.KOMMNR(I) > 2500) THEN                       
         DO;                                                                    
            CALL P30_SKRIV_KEYFIL;                                              
            IF FEIL_MELD_NR > 0 THEN                                            
               GOTO L999;                                                       
         END;                                                                   
                                                                                
  /***** O M R E G N I N G   P.G.A. I N N T E K T S E N D R I N G **/           
                                                                                
                                                                                
      FØDSNUMMER = NISF.FNR;                                                    
      SEARCH_FNR = NISF.FNR;                                                    
      FNR_PIC13  = KONV_FNR11_FNR13(NISF.FNR);  /*Y2K*/                         
                                                                                
      IF NIS.ETYPE(I) = 0 THEN                                                  
         DO;                                                                    
            INNT_ALDER   = NIS.ÅR(I) - FNR_ÅR;                                  
                                                                                
            IF INNT_ALDER = 66 THEN                                             
               ØNSKET_STATUS  = '6';                                            
            ELSE                                                                
               IF INNT_ALDER = 69 THEN                                          
                  ØNSKET_STATUS  = '9';                                         
         END;                                                                   
      DIV_PARAM_OMR.INTENDR_ÅR = NIS.ÅR(I);                                     
                                                                                
      EXEC CICS LINK PROGRAM('R001I601') COMMAREA (KOM_OMR);                    
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
         DO;                                                                    
            GOTO L999;                                                          
         END;                                                                   
      ELSE                                                                      
         PROGRAM_ID = 'R001I501';                                               
 /* ENDRET AV TS/HL/OG  28.04.2005            */                                
 /*   CALL P40_SKRIV_KOMPREC; */                                                
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
         CALL SKRIV_FEILMELDING;                                                
                                                                                
                                                                                
                                                                                
   FORTSETT:                                                                    
                                                                                
   CALL SKRIV_OLINNTE(FEILTYPE,FEILTYPE);                                       
                                                                                
   IF NIS.MERKE(I) = 2 !                                                        
      TIDL_FFU            THEN                                                  
      CALL SKRIV_FFU_DATA;                                                      
                                                                                
                                                                                
     /*----------------------------------------*/                               
     /* DATA TIL NORTRYGD   :   TIL - FNR      */                               
     /*----------------------------------------*/                               
                                                                                
     SSA1_RF0PERSN.PKEY = NISF.FNR                   ;                          
     W01.FNR            = NISF.FNR                   ;                          
     W01.TKNR           = F100_FINN_TKNR (NISF.FNR)  ;                          
                                                                                
     IF FEIL_MELD_NR    >  0                      THEN                          
        DO;                                                                     
           FATAL_FEIL   = '1'B                       ;                          
           GO TO L999;                                                          
        END;                                                                    
                                                                                
  /* CALL P900_NOR_DATA (W01.FNR , W01.TKNR); */                                
                                                                                
     IF FEIL_MELD_NR    >  0                      THEN                          
        DO;                                                                     
           FATAL_FEIL   = '1'B                       ;                          
           GO TO L999;                                                          
        END;                                                                    
     ELSE                                                                       
        PROGRAM_ID      = 'R001I501'            ;                               
  END;                                                                          
                                                                                
 L999:                                                                          
                                                                                
  EXEC CICS PURGE MESSAGE;                                                      
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     CALL SKRIV_FEILMELDING;                                                    
                                                                                
  TRANS_RETURKODE = 'R041';                                                     
                                                                                
  EXEC CICS RETURN;                                                             
                                                                                
                                                                                
                                                                                
  /**********    H O V E D S T Y R I N G   S L U T T   *************/           
                                                                                
  BEREGN_INNT_TYPE:                                                             
     PROC(TYPE,ART,INNT_TYPE);                                                  
                                                                                
     DCL TYPE      CHAR(1);                                                     
     DCL ART       PIC '9';                                                     
     DCL INNT_TYPE CHAR(1);                                                     
                                                                                
     SELECT(TYPE);                                                              
                                                                                
        WHEN('B')                                                               
                                                                                
           SELECT(ART);                                                         
                                                                                
              WHEN(1)                                                           
                 INNT_TYPE = 'B';                                               
              WHEN(2)                                                           
                 INNT_TYPE = 'C';                                               
              WHEN(3)                                                           
                 INNT_TYPE = 'D';                                               
              OTHERWISE                                                         
                   ;                                                            
           END;                                                                 
        WHEN('C')                                                               
                                                                                
           SELECT(ART);                                                         
                                                                                
              WHEN(1)                                                           
                 INNT_TYPE = 'E';                                               
              WHEN(2)                                                           
                 INNT_TYPE = 'F';                                               
              OTHERWISE                                                         
                   ;                                                            
           END;                                                                 
        WHEN('D')                                                               
                                                                                
           SELECT(ART);                                                         
                                                                                
              WHEN(1)                                                           
                 INNT_TYPE = 'H';                                               
              WHEN(2)                                                           
                 INNT_TYPE = 'I';                                               
              OTHERWISE                                                         
                   ;                                                            
           END;                                                                 
        WHEN('S')                                                               
                                                                                
           SELECT(ART);                                                         
                                                                                
              WHEN(1)                                                           
                 INNT_TYPE = 'S';                                               
              WHEN(2)                                                           
                 INNT_TYPE = 'T';                                               
              OTHERWISE                                                         
                   ;                                                            
           END;                                                                 
        WHEN('O')                                                               
                                                                                
           SELECT(ART);                                                         
                                                                                
              WHEN(4)                                                           
                 INNT_TYPE = 'J';                                               
              WHEN(5)                                                           
                 INNT_TYPE = 'K';                                               
              WHEN(6)                                                           
                 INNT_TYPE = 'L';                                               
              OTHERWISE                                                         
                   ;                                                            
           END;                                                                 
        WHEN('U')                                                               
                                                                                
           SELECT(ART);                                                         
                                                                                
              WHEN(1)                                                           
                 INNT_TYPE = 'V';                                               
              WHEN(2)                                                           
                 INNT_TYPE = 'W';                                               
              OTHERWISE                                                         
                   ;                                                            
           END;                                                                 
                                                                                
        OTHERWISE                                                               
           ;                                                                    
     END;                                                                       
  END BEREGN_INNT_TYPE;                                                         
    %PAGE;                                                                      
                                                                                
                                                                                
                                                                                
  P05_SJEKK_OM_DØD:                                                             
    PROC;                                                                       
                                                                                
                                                                                
    DCL 01 D_DATO                            PIC '(8)9', /*Y2K*/                
        01 D_DATO_REDEF DEF D_DATO                     ,                        
           02 ÅR                             PIC '(4)9', /*Y2K*/                
           02 MND                            PIC '(2)9',                        
           02 DAG                            PIC '(2)9';                        
                                                                                
                                                                                
                                                                                
    W01_STATUS                      =     ''               ;                    
                                                                                
    /* ***************************************************** */                 
    /*  LES AV ROT                                           */                 
    /* ***************************************************** */                 
                                                                                
                                                                                
     CALL PLITDLI                   (W02_PARM_CT_4,                             
                                          W02_GHU,                              
                                          RF1,                                  
                                          RF0PERSN,                             
                                          SSA1_RF0PERSN);                       
                                                                                
     IF DLIUIB.UIBRCODE.UIBFCTR  ^=  UIB_RC_OK         THEN                     
        DO;                                                                     
                /* ******************************************** */              
                /* FEIL VED LES   AV :  ROT                     */              
                /* ******************************************** */              
  L010:                                                                         
                FEIL_MELD_NR           =  500 ;                                 
                FEIL_VED_LABEL         = '010';                                 
                FATAL_FEIL             = '1'B ;                                 
                GOTO RETUR;                                                     
        END;                                                                    
                                                                                
     IF RF1.STATUS_KODE           = 'GE'    THEN                                
        DO;                                                                     
                /* ******************************************** */              
                /* ROT    IKKE FUNNET.                          */              
                /* ******************************************** */              
                                                                                
                ROT_IKKE_FUNNET            =   '1'B;                            
                GO  TO   RETUR;                                                 
                                                                                
        END;                                                                    
    /* ***************************************************** */                 
    /*  LES AV ROT OG STATUS.                                */                 
    /* ***************************************************** */                 
                                                                                
    IF RF1.STATUS_KODE     =   '  '    THEN                                     
       DO;                                                                      
                                                                                
           CALL PLITDLI                  (W02_PARM_CT_5,                        
                                          W02_GU,                               
                                          RF1,                                  
                                          W01_STATUS,                           
                                          SSA1_RF0PERSN,                        
                                          SSA1_STATUS);                         
                                                                                
    IF DLIUIB.UIBRCODE.UIBFCTR       ^=   UIB_RC_OK    THEN                     
       DO;                                                                      
          /* ******************************************** */                    
          /* FEIL VED LES   AV :  ROT OG STATUS.          */                    
          /* ******************************************** */                    
  L005:                                                                         
          FEIL_MELD_NR                =    500 ;                                
          FEIL_VED_LABEL              =   '005';                                
          FATAL_FEIL                  =   '1'B ;                                
          GO   TO  RETUR;                                                       
       END;                                                                     
                                                                                
                                                                                
    IF RF1.STATUS_KODE               =   'GE'    THEN                           
       DO;                                                                      
          /* ******************************************** */                    
          /* STATUS  IKKE FUNNET                          */                    
          /*                                              */                    
          /* ******************************************** */                    
                                                                                
                                                                                
                GO  TO   RETUR;                                                 
                                                                                
       END;                                                                     
    ELSE                                                                        
    IF RF1.STATUS_KODE         ^=   '  '    THEN                                
       DO;                                                                      
                   /* ******************************************** */           
                   /* FEIL VED LES AV :  ROT                       */           
                   /* ******************************************** */           
  L015:                                                                         
                   FEIL_MELD_NR          =    500 ;                             
                   FATAL_FEIL            =   '1'B ;                             
                   DB_STATUS_KODE        =    RF1.STATUS_KODE;                  
                   FEIL_VED_LABEL        =   '015';                             
                   GO   TO  RETUR;                                              
       END;                                                                     
                                                                                
       D_DATO   = W01_STATUS.DØDSDATO_ÅMD;                                      
                                                                                
       IF D_DATO             > 0                  &                             
          NIS.ÅR         (I) > D_DATO_REDEF.ÅR    &                             
          NIS.PG_INNTEKT (I) > 0                  THEN                          
          DO;                                                                   
             FEILTYPE       = 1                            ;                    
             CALL SKRIV_BREV     (FEILTYPE,D_DATO_REDEF.ÅR);                    
             CALL SKRIV_OLINNTE(FEILTYPE,D_DATO_REDEF.ÅR);                      
          END;                                                                  
                                                                                
                                                                                
  RETUR:                                                                        
                                                                                
  END P05_SJEKK_OM_DØD;                                                         
                                                                                
                                                                                
  P10_BEHANDLE_PINNTEKT:                                                        
    PROC;                                                                       
                                                                                
           /* ******************************************** */                   
           /*  SKRIV ROT HVIS DET IKKE FINNES.             */                   
           /* ******************************************** */                   
                                                                                
                                                                                
      DUMMY_ÅR = 0;                                                             
                                                                                
      IF ROT_IKKE_FUNNET THEN                                                   
         DO;                                                                    
            IF NISF.NAVN = '                         '  THEN                    
               DO;                                                              
                  /* *************************** */                             
                  /* NAVN MÅ UTFYLLES.           */                             
                  /* *************************** */                             
                  FEILTYPE = 8;                                                 
                  CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                           
                  CALL SKRIV_OLINNTE(FEILTYPE,FEILTYPE);                        
                  GO   TO  RETUR;                                               
               END;                                                             
                                                                                
            RF0PERSN                         =     ''       ;                   
            RF0PERSN.FNR                     =     NISF.FNR ;                   
            RF0PERSN.NAVN                    =     NISF.NAVN;                   
            RF0PERSN.TKNR                    =     0        ;                   
            RF0PERSN.SPRÅK                   =     ' '      ;                   
            RF0PERSN.AI67                    =     0        ;                   
            RF0PERSN.SPERRE                  =     ' '      ;                   
                                                                                
            CALL PLITDLI                          (W02_PARM_CT_4,               
                                                   W02_ISRT,                    
                                                   RF1,                         
                                                   RF0PERSN,                    
                                                   SSA_UQUAL_ROT);              
                                                                                
            IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN            
               DO;                                                              
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  ROT                     */                   
           /* ******************************************** */                   
  L100:                                                                         
                  FEIL_MELD_NR                =    500 ;                        
                  FEIL_VED_LABEL              =   '100';                        
                  FATAL_FEIL                  =   '1'B ;                        
                  GO   TO  RETUR;                                               
               END;                                                             
                                                                                
            IF   RF1.STATUS_KODE            ^=   '  '    THEN                   
               DO;                                                              
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  ROT                     */                   
           /* ******************************************** */                   
  L103:                                                                         
                 FEIL_MELD_NR                =    500 ;                         
                 FATAL_FEIL                  =   '1'B ;                         
                 DB_STATUS_KODE              =   RF1.STATUS_KODE;               
                 FEIL_VED_LABEL              =   '103';                         
                 GO   TO  RETUR;                                                
               END;                                                             
                                                                                
                                                                                
         END;                                                                   
                                                                                
 /* TILLEGG 1/10-90 AV TUYEN */                                                 
                                                                                
  IF NIS.TYPE(I) = 'A' THEN                                                     
    DO;                                                                         
      SSA4_PINNTEKT.ÅR    = NIS.ÅR(I);                                          
                                                                                
      CALL PLITDLI                          (W02_PARM_CT_5,                     
                                             W02_GHU,                           
                                             RF1,                               
                                             W01_PINT,                          
                                             SSA1_RF0PERSN,                     
                                             SSA4_PINNTEKT);                    
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  LXX1:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   'XX1';                               
           FATAL_FEIL                  =   '1'B ;                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
      ALLOCATE S001I04O      ;                                                  
      ALLOCATE S001I04I      ;                                                  
      EXEC CICS LOAD PROGRAM('S001I43') ;                                       
                                                                                
      S001I04O.MELDING1O = '';                                                  
      S001I04O.MELDING2O = '';                                                  
                                                                                
      IF   RF1.STATUS_KODE             =   '  '    THEN                         
        DO;                                                                     
          /* ******************************************** */                    
          /* DET FINNES INNTEKT MED SAMME ÅR.             */                    
          /* ******************************************** */                    
                                                                                
           S001I04O.MELDING1O =                                                 
              'DET FINNES INNTEKT I BASEN I SAMME ÅR!';                         
                                                                                
           S001I04O.MELDING2O = 'REGISTRERINGEN FORKASTES!!!';                  
                                                                                
           EXEC CICS SEND MAP('S001I04')                                        
                     MAPSET('S001I43') CURSOR          ;                        
                                                                                
           /* DUMMY RECEIVE-KALL. */                                            
                                                                                
           EXEC CICS RECEIVE MAP('S001I04')                                     
                     MAPSET('S001I43') SET(BMSMAPBR);                           
                                                                                
           GOTO L999;                                                           
        END;                                                                    
                                                                                
      ELSE                                                                      
        IF RF1.STATUS_KODE = 'GE' THEN                                          
          DO;                                                                   
            /* INGEN INNTEKT REGISTRERT FOR AKTUELT ÅR */                       
                                                                                
               IF NIS.ETYPE(I) ^= 0 THEN                                        
                  DO;                                                           
                      S001I04O.MELDING1O =                                      
                            'BARE ENDR. TYPE "0" TILLATES!';                    
                      EXEC CICS SEND MAP('S001I04')                             
                             MAPSET('S001I43') CURSOR          ;                
                                                                                
                     /* DUMMY RECEIVE-KALL. */                                  
                                                                                
                      EXEC CICS RECEIVE MAP('S001I04')                          
                             MAPSET('S001I43') SET(BMSMAPBR);                   
                      GOTO L999;                                                
                  END;                                                          
                                                                                
               IF NIS.KOMMNR(I) ^= 0000 THEN                                    
                  DO;                                                           
                      S001I04O.MELDING1O =                                      
                            'BARE KOMMUNENR 0000 TILLATES!';                    
                      EXEC CICS SEND MAP('S001I04')                             
                             MAPSET('S001I43') CURSOR          ;                
                                                                                
                     /* DUMMY RECEIVE-KALL. */                                  
                                                                                
                      EXEC CICS RECEIVE MAP('S001I04')                          
                             MAPSET('S001I43') SET(BMSMAPBR);                   
                      GOTO L999;                                                
                  END;                                                          
                                                                                
               IF NIS.PG_INNTEKT(I) ^= 0 THEN                                   
                  DO;                                                           
                      S001I04O.MELDING1O =                                      
                            'BARE NULL-INNTEKT TILLATES!';                      
                                                                                
                      EXEC CICS SEND MAP('S001I04')                             
                          MAPSET('S001I43') CURSOR          ;                   
                                                                                
                     /* DUMMY RECEIVE-KALL. */                                  
                                                                                
                      EXEC CICS RECEIVE MAP('S001I04')                          
                          MAPSET('S001I43') SET(BMSMAPBR);                      
                                                                                
                      GOTO L999;                                                
                  END;                                                          
                                                                                
               ELSE                                                             
                  DO;                                                           
                                                                                
                     W02_PI_ÅR       = NIS.ÅR(I)              ;                 
                     W02_PI_MERKE    = NIS.MERKE(I)           ;                 
                     W02_PI          = 0                      ;                 
                     W02_PI_KOMMNR   = 0000                   ;                 
                                                                                
                     W02_PI_TYPE     = 'A'                    ;                 
                     DATO_NUM        = DATO_2000              ; /*Y2K*/         
                     ÅR_DAGNR_C8     = R0019947(DATO_NUM )    ;                 
                     W02_PI_RAPPDATO = ÅR_DAGNR_N7            ;                 
                                                                                
                     CALL PLITDLI             (W02_PARM_CT_5,                   
                                               W02_ISRT,                        
                                               RF1,                             
                                               W01_PINT,                        
                                               SSA1_RF0PERSN,                   
                                               SSA_UQUAL_PINNTEKT);             
                                                                                
                     IF   DLIUIB.UIBRCODE.UIBFCTR ^= UIB_RC_OK THEN             
                     DO;                                                        
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV :  PINNTEKT                */            
                  /* ******************************************** */            
  LXX3:                                                                         
                        FEIL_MELD_NR                =    500 ;                  
                        FEIL_VED_LABEL              =   'XX3';                  
                        FATAL_FEIL                  =   '1'B ;                  
                        GO   TO  RETUR;                                         
                     END;                                                       
                                                                                
                     IF   RF1.STATUS_KODE  ^= '  ' THEN                         
                     DO;                                                        
  LXX4:                                                                         
                        FEIL_MELD_NR                =    500 ;                  
                        FATAL_FEIL                  =   '1'B ;                  
                        DB_STATUS_KODE               = RF1.STATUS_KODE;         
                        FEIL_VED_LABEL              =   'XX4';                  
                        GO   TO  RETUR;                                         
                     END;                                                       
                                                                                
                     GOTO RETUR;                                                
                  END;                                                          
          END;                                                                  
                                                                                
        ELSE                                                                    
          DO;                                                                   
             /* ************************************************/               
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */               
             /* ************************************************/               
  LXX2:                                                                         
              FEIL_MELD_NR                =   500 ;                             
              FEIL_VED_LABEL              =  'XX2';                             
              FATAL_FEIL                  =   '1'B ;                            
              DB_STATUS_KODE      =   RF1.STATUS_KODE;                          
              GO   TO  RETUR;                                                   
          END;                                                                  
   END;                                                                         
                                                                                
 /* TIL HIT */                                                                  
                                                                                
      SSA1_PINNTEKT.ÅR    =  NIS.ÅR(I)     ;                                    
      SSA1_PINNTEKT.TYPE  =  W02_INNT_TYPE ;                                    
                                                                                
      TIDL_FFU = '0'B;                                                          
                                                                                
      CALL P15_LES_INNTEKT_GN;                                                  
                                                                                
                                                                                
      DO WHILE (FEIL_MELD_NR = 0 & ^IKKE_FUNNET);                               
                                                                                
                                                                                
                                                                                
         IF NIS.KOMMNR(I) < 2500 THEN                                           
            CALL P50_BEHANDLE_INNTEKTER_1;                                      
                                                                                
                                                                                
         IF FEIL_MELD_NR > 0 THEN                                               
            GO   TO  L999;                                                      
                                                                                
                                                                                
         IF NIS.KOMMNR(I) = 0301 THEN                                           
            CALL P60_BEHANDLE_INNTEKTER_2;                                      
                                                                                
                                                                                
         IF FEIL_MELD_NR > 0 THEN                                               
            GO   TO  L999;                                                      
                                                                                
         CALL P70_BEHANDLE_INNTEKTER_3;                                         
                                                                                
                                                                                
         IF FEIL_MELD_NR > 0 THEN                                               
            GO   TO  L999;                                                      
                                                                                
         IF W02_PI_MERKE = 2 THEN                                               
            TIDL_FFU = '1'B;                                                    
                                                                                
         CALL P15_LES_INNTEKT_GN;                                               
                                                                                
     END;                                                                       
                                                                                
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
         GO   TO  RETUR;                                                        
                                                                                
           /* ******************************************** */                   
           /*  LES      :  PINNTEKT                        */                   
           /* ******************************************** */                   
                                                                                
                                                                                
      CALL PLITDLI                          (W02_PARM_CT_5,                     
                                             W02_GHU,                           
                                             RF1,                               
                                             W01_PINT,                          
                                             SSA1_RF0PERSN,                     
                                             SSA1_PINNTEKT);                    
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L105:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '105';                               
           FATAL_FEIL                  =   '1'B ;                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
                                                                                
      IF   RF1.STATUS_KODE             =   '  '    THEN                         
        DO;                                                                     
          /* ******************************************** */                    
          /* SAMME PINNTEKT LIGGER INNE FRA FØR.          */                    
          /* ******************************************** */                    
                                                                                
                                                                                
           IF NIS.ETYPE(I) = 1 THEN                                             
              DO;                                                               
                 IF NIS.PG_INNTEKT(I) = 0 &                                     
                    NIS.KOMMNR(I) ^= W02_PI_KOMMNR &                            
                    (W02_PI_KOMMNR ^=0)            THEN                         
                                                                                
                    DO;                                                         
                       FEILTYPE = 2;                                            
                       CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                      
                    END;                                                        
                                                                                
                                                                                
 /* TILLEGG 06.09.90 AV TUYEN. */                                               
                                                                                
                 IF NIS.KOMMNR(I) ^= W02_PI_KOMMNR &                            
                    (W02_PI_KOMMNR ^= 0) THEN                                   
                                                                                
                    DO;                                                         
                                                                                
                       ALLOCATE S001I04O      ;                                 
                       ALLOCATE S001I04I      ;                                 
                       EXEC CICS LOAD PROGRAM('S001I43') ;                      
                                                                                
                       S001I04O.MELDING1O = '';                                 
                       S001I04O.MELDING2O = '';                                 
                       S001I04O.MELDING3O = '';                                 
                       S001I04O.MELDING1O =                                     
                                                                                
              'KOMMUNE ER FORSKJELLIG FRA KOMMUNE REGISTRERT I BASEN!.';        
                                                                                
                       S001I04O.MELDING2O =                                     
                                                                                
              'ER DU SIKKER PÅ AT DET ER RIKTIG Å KORRIGERE???';                
                                                                                
                                                                                
                       EXEC CICS SEND MAP('S001I04')                            
                           MAPSET('S001I43') CURSOR          ;                  
                                                                                
              /* DUMMY RECEIVE-KALL. */                                         
                                                                                
                       EXEC CICS RECEIVE MAP('S001I04')                         
                           MAPSET('S001I43') SET(BMSMAPBR);                     
                                                                                
                   END;                                                         
 /* TIL HIT */                                                                  
                                                                                
                 CALL KONTROLL_PI_TYPE(FTYPE,FART);                             
                 CALL SKRIV_OLINNTE(FEILTYPE,FEILTYPE);                         
           /*      CALL SKRIV_OLINNTE(FTYPE,FART); */                           
    /* ********************************************************* */             
    /* SKRIVE GAMLE INNTEKT INFORMASJON TIL REVISJON DBD         */             
    /*                                                           */             
    /* SATISH   28.01.2004                                       */             
    /* ********************************************************* */             
                                                                                
                 CALL  SKRIV_INNTEKT_TIL_DR  ;                                  
    /*  OPPTIL HER         *************************************** */           
                                                                                
                 W02_PI_ÅR       = NIS.ÅR(I)                 ;                  
                 W02_PI_MERKE    = NIS.MERKE(I)              ;                  
                 W02_PI          = NIS.PG_INNTEKT(I);  /*200504*/               
                 W02_PI_KOMMNR   = NIS.KOMMNR(I)             ;                  
                                                                                
                 W02_PI_TYPE     = W02_INNT_TYPE             ;                  
                 DATO_NUM        = DATO_2000                 ; /*Y2K*/          
                 ÅR_DAGNR_C8     = R0019947(DATO_NUM)       ;                   
                 W02_PI_RAPPDATO = ÅR_DAGNR_N7               ;                  
                                                                                
                                                                                
                                                                                
                 CALL PLITDLI                      (W02_PARM_CT_3,              
                                                    W02_REPL,                   
                                                    RF1,                        
                                                    W01_PINT);                  
                                                                                
                 IF   DLIUIB.UIBRCODE.UIBFCTR  ^=     UIB_RC_OK    THEN         
                      DO;                                                       
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L106:                                                                         
                         FEIL_MELD_NR                =    500 ;                 
                         FEIL_VED_LABEL              =   '106';                 
                         FATAL_FEIL                  =   '1'B ;                 
                         GO   TO  RETUR;                                        
                     END;                                                       
                                                                                
                                                                                
                     IF  RF1.STATUS_KODE     ^=       '  ' THEN                 
                         DO;                                                    
             /* ************************************************/               
             /* FEIL VED REPL AV INNTEKT.                      */               
             /* ************************************************/               
  L107:                                                                         
                            FEIL_MELD_NR                =   500 ;               
                            FEIL_VED_LABEL              =  '107';               
                            FATAL_FEIL                  =   '1'B ;              
                            DB_STATUS_KODE      =   RF1.STATUS_KODE;            
                            GO   TO  RETUR;                                     
                         END;                                                   
                                                                                
              END;                                                              
           ELSE                                                                 
                                                                                
          /* ******************************************** */                    
          /* HVIS ETYPE = 9 (OPPHØR),GODKJENNES DETTE     */                    
          /* HVIS KOMMUNENR I TRANS ER LIK DET PÅ BASE.   */                    
          /* ******************************************** */                    
              IF NIS.ETYPE(I) = 9 THEN                                          
                 DO;                                                            
                    IF NIS.KOMMNR(I) = W02_PI_KOMMNR THEN                       
                       DO;                                                      
                                                                                
    /* ********************************************************* */             
    /* SKRIVE GAMLE INNTEKT INFORMASJON TIL REVISJON DBD         */             
    /*                                                           */             
    /* SATISH   28.01.2004                                       */             
    /* ********************************************************* */             
                                                                                
                          CALL  SKRIV_INNTEKT_TIL_DR  ;                         
    /*  OPPTIL HER         *************************************** */           
                                                                                
                          W02_PI_ÅR       = NIS.ÅR(I)              ;            
                          W02_PI_MERKE    = NIS.MERKE(I)           ;            
                          W02_PI          = NIS.PG_INNTEKT(I); /**/             
                          W02_PI_KOMMNR   = NIS.KOMMNR(I)          ;            
                                                                                
                          W02_PI_TYPE     = W02_INNT_TYPE          ;            
           /*Y2K*/        DATO_NUM        = DATO_2000              ;            
                          ÅR_DAGNR_C8     = R0019947(DATO_NUM )    ;            
                          W02_PI_RAPPDATO = ÅR_DAGNR_N7            ;            
                                                                                
                                                                                
                                                                                
                                                                                
                         CALL PLITDLI           (W02_PARM_CT_3,                 
                                                 W02_DLET,                      
                                                 RF1,                           
                                                 W01_PINT);                     
                                                                                
                         IF   DLIUIB.UIBRCODE.UIBFCTR  ^=                       
                                                      UIB_RC_OK    THEN         
                             DO;                                                
           /* ******************************************** */                   
           /* FEIL VED DLET  AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L111:                                                                         
                                FEIL_MELD_NR                =    500 ;          
                                FEIL_VED_LABEL              =   '111';          
                                FATAL_FEIL                  =   '1'B ;          
                                GO   TO  RETUR;                                 
                             END;                                               
                                                                                
                                                                                
                         IF  RF1.STATUS_KODE     ^=       '  ' THEN             
                            DO;                                                 
             /* ************************************************/               
             /* FEIL VED DLET AV INNTEKT.                      */               
             /* ************************************************/               
  L112:                                                                         
                               FEIL_MELD_NR                =   500 ;            
                               FEIL_VED_LABEL              =  '112';            
                               FATAL_FEIL                  =   '1'B ;           
                               DB_STATUS_KODE      =   RF1.STATUS_KODE;         
                               GO   TO  RETUR;                                  
                            END;                                                
                                                                                
                                                                                
                                                                                
                          W02_PI         = 0;                                   
                          W02_PI_MERKE   = '9';                                 
                                                                                
                         CALL PLITDLI           (W02_PARM_CT_5,                 
                                                 W02_ISRT     ,                 
                                                 RF1          ,                 
                                                 W01_PINT     ,                 
                                                 SSA1_RF0PERSN,                 
                                                 SSA_UQUAL_PINNTEKT);           
                                                                                
                         IF   DLIUIB.UIBRCODE.UIBFCTR  ^=                       
                                                      UIB_RC_OK    THEN         
                             DO;                                                
           /* ******************************************** */                   
           /* FEIL VED ISRT  AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L113:                                                                         
                                FEIL_MELD_NR                =    500 ;          
                                FEIL_VED_LABEL              =   '113';          
                                FATAL_FEIL                  =   '1'B ;          
                                GO   TO  RETUR;                                 
                             END;                                               
                                                                                
                                                                                
                         IF  RF1.STATUS_KODE     ^=       '  ' THEN             
                            DO;                                                 
             /* ************************************************/               
             /* FEIL VED ISRT AV INNTEKT.                      */               
             /* ************************************************/               
  L114:                                                                         
                               FEIL_MELD_NR                =   500 ;            
                               FEIL_VED_LABEL              =  '114';            
                               FATAL_FEIL                  =   '1'B ;           
                               DB_STATUS_KODE      =   RF1.STATUS_KODE;         
                               GO   TO  RETUR;                                  
                            END;                                                
                       END;                                                     
                    ELSE                                                        
                       DO;                                                      
           /* ******************************************** */                   
           /* UGYLDIG ETYPE.ETYPE = 9 OG KOMMNR. ER ULIKE. */                   
           /* ******************************************** */                   
  L115:                                                                         
                          FEIL_MELD_NR                =    259 ;                
                          FEIL_VED_LABEL              =   '115';                
                          GO   TO  RETUR;                                       
                       END;                                                     
                 END;                                                           
              ELSE                                                              
                 DO;                                                            
           /* ******************************************** */                   
           /* UGYLDIG ETYPE.SAMME INNTEKT OG ÅR LIGGER INNE*/                   
           /* (ETYPE = 0).                                 */                   
           /* ******************************************** */                   
  L116:                                                                         
                    FEIL_MELD_NR                =    260 ;                      
                    FEIL_VED_LABEL              =   '116';                      
                                                                                
                    IF NIS.KOMMNR(I) ^= W02_PI_KOMMNR THEN                      
                                                                                
                       DO;                                                      
                          FEILTYPE = 3;                                         
                          CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                   
                       END;                                                     
                                                                                
 /* TILLEGG 10/1-90 AV TUYEN. */                                                
                                                                                
                    ELSE                                                        
                                                                                
                       IF (NIS.MERKE(I)      = W02_PI_MERKE) &                  
                          (NIS.PG_INNTEKT(I) = (W02_PI)) THEN /**/              
                                                                                
                          DO;                                                   
                             ALLOCATE S001I04O      ;                           
                             ALLOCATE S001I04I      ;                           
                             EXEC CICS LOAD PROGRAM('S001I43') ;                
                                                                                
                             S001I04O.MELDING1O = '';                           
                             S001I04O.MELDING2O = '';                           
                             S001I04O.MELDING1O =                               
                                                                                
              'DEN NYE REGISTRERINGEN ER HELT LIK DET SOM STÅR INNE ';          
                                                                                
                             S001I04O.MELDING2O =                               
                                                                                
              'FRA FØR.  TASKEN BLIR KANSELLERT !!!';                           
                                                                                
                                                                                
                             EXEC CICS SEND MAP('S001I04')                      
                                MAPSET('S001I43') CURSOR          ;             
                                                                                
              /* DUMMY RECEIVE-KALL. */                                         
                                                                                
                             EXEC CICS RECEIVE MAP('S001I04')                   
                                MAPSET('S001I43') SET(BMSMAPBR);                
                                                                                
                          END;                                                  
 /* TIL HIT */                                                                  
                    CALL SKRIV_OLINNTE(FEILTYPE,FEILTYPE);                      
                                                                                
                    GO   TO  RETUR;                                             
                 END;                                                           
        END;                                                                    
                                                                                
      ELSE                                                                      
         IF  RF1.STATUS_KODE           =       'GE'         THEN                
             DO;                                                                
             /* ************************************************/               
             /* FINNES IKKE FRA FØR,BÅDE ETYPE=0 (FØRSTE-      */               
             /* GANGSREGISTRERING) OG ETYPE=1(ENDRING) GODTAS. */               
             /* ************************************************/               
                                                                                
                IF NIS.ETYPE(I) = 0 !                                           
                   NIS.ETYPE(I) = 1 THEN                                        
                                                                                
                   DO;                                                          
                                                                                
                         SSA2_PINNTEKT.ÅR      =     NIS.ÅR(I);                 
                         SSA2_PINNTEKT.TYPE    =     'A';                       
                                                                                
             /* ******************************************** */                 
             /*  LES :  PINNTEKT MED BLTYPE = A(FORLØPIG INNT)*/                
             /*         HVIS DEN FINNES,FJERNES DEN.          */                
             /* ******************************************** */                 
                                                                                
                                                                                
                         CALL PLITDLI          (W02_PARM_CT_5,                  
                                                W02_GHU,                        
                                                RF1,                            
                                                W01_PINT,                       
                                                SSA1_RF0PERSN,                  
                                                SSA2_PINNTEKT);                 
                                                                                
                         IF   DLIUIB.UIBRCODE.UIBFCTR    ^=                     
                                             UIB_RC_OK    THEN                  
                              DO;                                               
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L108:                                                                         
                                 FEIL_MELD_NR          =    500 ;               
                                 FEIL_VED_LABEL        =   '108';               
                                 FATAL_FEIL            =   '1'B ;               
                                 GO   TO  RETUR;                                
                              END;                                              
                                                                                
                         IF   RF1.STATUS_KODE   =   '  '    THEN                
                              DO;                                               
                                                                                
    /* ********************************************************* */             
    /* SKRIVE GAMLE INNTEKT INFORMASJON TIL REVISJON DBD         */             
    /*                                                           */             
    /* SATISH   28.01.2004                                       */             
    /* ********************************************************* */             
                                                                                
                                   CALL SKRIV_INNTEKT_TIL_DR  ;                 
                                                                                
    /*  OPPTIL HER         *************************************** */           
                                                                                
                                                                                
                                 CALL PLITDLI   (W02_PARM_CT_3,                 
                                                 W02_DLET,                      
                                                 RF1,                           
                                                 W01_PINT);                     
                                                                                
                                 IF   DLIUIB.UIBRCODE.UIBFCTR  ^=               
                                                      UIB_RC_OK    THEN         
                                      DO;                                       
           /* ******************************************** */                   
           /* FEIL VED DLET  AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L109:                                                                         
                                         FEIL_MELD_NR    =    500 ;             
                                         FEIL_VED_LABEL  =   '109';             
                                         FATAL_FEIL      =   '1'B ;             
                                         GO   TO  RETUR;                        
                                      END;                                      
                                                                                
                                                                                
                                  IF  RF1.STATUS_KODE     ^=                    
                                                          '  ' THEN             
                                      DO;                                       
             /* ************************************************/               
             /* FEIL VED DLET AV INNTEKT.                      */               
             /* ************************************************/               
  L110:                                                                         
                                         FEIL_MELD_NR   =   500 ;               
                                         FEIL_VED_LABEL =  '110';               
                                         FATAL_FEIL     =   '1'B ;              
                                         DB_STATUS_KODE =                       
                                                    RF1.STATUS_KODE;            
                                         GO   TO  RETUR;                        
                                      END;                                      
                              END;                                              
                                                                                
                                                                                
 /* TILLEGG 18.12.89 AV TUYEN */                                                
                                                                                
                         SSA3_PINNTEKT.ÅR1     =     NIS.ÅR(I);                 
                         SSA3_PINNTEKT.TYPE1   =     'A'      ;                 
                         SSA3_PINNTEKT.ÅR2     =     NIS.ÅR(I);                 
                         SSA3_PINNTEKT.TYPE2   =     'W'      ;                 
                                                                                
                         CALL PLITDLI          (W02_PARM_CT_5,                  
                                                W02_GU,                         
                                                RF1,                            
                                                W01_PINT,                       
                                                SSA1_RF0PERSN,                  
                                                SSA3_PINNTEKT) ;                
                                                                                
                         IF   DLIUIB.UIBRCODE.UIBFCTR    ^=                     
                                             UIB_RC_OK    THEN                  
                              DO;                                               
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
    L200:                                                                       
                                 FEIL_MELD_NR          =    500 ;               
                                 FEIL_VED_LABEL        =   '200';               
                                 FATAL_FEIL            =   '1'B ;               
                                 GO   TO  RETUR;                                
                              END;                                              
                                                                                
                                                                                
                         DO WHILE (RF1.STATUS_KODE = '  ') ;                    
                                                                                
            /* DET FINNES INNTEKT I BASEN PÅ SAMME ÅR. */                       
                                                                                
                            IF W02_PI_KOMMNR = NIS.KOMMNR(I) &                  
   /**/                        W02_PI        = NIS.PG_INNTEKT(I) &              
   /* OMSORG*/                ( W02_PI_TYPE   ^= 'J' &                          
   /* OMSORG*/                  W02_PI_TYPE   ^= 'K' &                          
   /* OMSORG*/                  W02_PI_TYPE   ^= 'L' ) THEN                     
                                                                                
                               IF (W02_PI_TYPE   = 'B' !                        
                                   W02_PI_TYPE   = 'C' !                        
                                   W02_PI_TYPE   = 'D' ) &                      
                                  (W02_INNT_TYPE = 'B' !                        
                                   W02_INNT_TYPE = 'C' !                        
                                   W02_INNT_TYPE = 'D' ) THEN                   
                                   DO;                                          
                                                                                
            /* DERSOM KOMMUNENR OG INNTEKT ER LIKE OG REC.ART ER B */           
            /* SKRIVES DET UT EN ADVARSEL.                         */           
                                                                                
                                      ALLOCATE S001I04O      ;                  
                                      ALLOCATE S001I04I      ;                  
                                     EXEC CICS LOAD PROGRAM('S001I43');         
                                                                                
                                      S001I04O.MELDING1O = '';                  
                                      S001I04O.MELDING2O = '';                  
                                      S001I04O.MELDING3O = '';                  
                                      S001I04O.MELDING1O =                      
                                                                                
                          'OBS: DET FINNES I BASEN SAMME INNTEKT' ;             
                                                                                
                                      S001I04O.MELDING2O =                      
                                                                                
                          'MED BL.TYPE B OG KOMMUNENR ER LIKE.' ;               
                                                                                
                                      S001I04O.MELDING3O =                      
                                                                                
                          'ER DU SIKKERT PÅ AT DETTE ER RIKTIG ???' ;           
                                                                                
                                                                                
                                      EXEC CICS SEND MAP('S001I04')             
                                         MAPSET('S001I43') CURSOR ;             
                                                                                
                                      EXEC CICS RECEIVE MAP('S001I04')          
                                       MAPSET('S001I43') SET(BMSMAPBR);         
                                   END;                                         
                                ELSE                                            
                                   DO;                                          
                                                                                
   /*OMSORG*/             IF  ( W02_INNT_TYPE   ^= 'J' &                        
                                W02_INNT_TYPE   ^= 'K' &                        
                                W02_INNT_TYPE   ^= 'L' )           !            
                                                                                
            /*Y2K*/          (  NIS.ÅR(I)        < 1992            &            
                              ( W02_INNT_TYPE    = 'J' !                        
                                W02_INNT_TYPE    = 'K' !                        
                                W02_INNT_TYPE    = 'L' ))       THEN            
                                                                                
                    DO;                                                         
            /* DERSOM KOMMUNENR OG INNTEKT ER LIKE OG REC.ART IKKE */           
            /* ER B OG INNTEKT-TYPE ER FORSKJELLIGE AVBRYTTES      */           
            /* PROGRAMMET.                                         */           
                                                                                
                                      ALLOCATE S001I04O      ;                  
                                      ALLOCATE S001I04I      ;                  
                                     EXEC CICS LOAD PROGRAM('S001I43');         
                                                                                
                                      S001I04O.MELDING1O = '';                  
                                      S001I04O.MELDING2O = '';                  
                                      S001I04O.MELDING3O = '';                  
                                      S001I04O.MELDING4O = '';                  
                                      S001I04O.MELDING1O =                      
                                                                                
                   'DET FINNES I BASEN SAMME INNTEKT OG KOMMUNENR' ;            
                                                                                
                                      S001I04O.MELDING2O =                      
                                                                                
                   'MEN FORSKJELLIG INNTEKT-TYPE.' ;                            
                                                                                
                                      S001I04O.MELDING3O =                      
                                                                                
                   'DERFOR KANSELLERES TASKEN.' ;                               
                                                                                
                                      S001I04O.MELDING4O =                      
                                                                                
                   'INGEN REGISTRERING BLIR FORETATT.' ;                        
                                                                                
                                                                                
                                      EXEC CICS SEND MAP('S001I04')             
                                         MAPSET('S001I43') CURSOR ;             
                                                                                
                                      EXEC CICS RECEIVE MAP('S001I04')          
                                       MAPSET('S001I43') SET(BMSMAPBR);         
                                                                                
                                      GOTO L999 ;                               
                    END;                                                        
                                   END;                                         
                                                                                
                              CALL PLITDLI          (W02_PARM_CT_5,             
                                                     W02_GN,                    
                                                     RF1,                       
                                                     W01_PINT,                  
                                                     SSA1_RF0PERSN,             
                                                     SSA3_PINNTEKT) ;           
                                                                                
                              IF  DLIUIB.UIBRCODE.UIBFCTR    ^=                 
                                             UIB_RC_OK    THEN                  
                                  DO;                                           
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
    L201:                                                                       
                                      FEIL_MELD_NR         =    500 ;           
                                      FEIL_VED_LABEL       =   '200';           
                                      FATAL_FEIL           =   '1'B ;           
                                      GO   TO  RETUR;                           
                                  END;                                          
                         END;                                                   
 /* TIL HIT */                                                                  
                                                                                
                                                                                
                         W02_PI_ÅR       = NIS.ÅR(I)              ;             
                         W02_PI_MERKE    = NIS.MERKE(I)           ;             
                         W02_PI          = NIS.PG_INNTEKT(I);  /**/             
                         W02_PI_KOMMNR   = NIS.KOMMNR(I)          ;             
                                                                                
                         W02_PI_TYPE     = W02_INNT_TYPE          ;             
           /*Y2K*/       DATO_NUM        = DATO_2000              ;             
                         ÅR_DAGNR_C8     = R0019947(DATO_NUM)     ;             
                         W02_PI_RAPPDATO = ÅR_DAGNR_N7            ;             
                                                                                
                                                                                
                         CALL PLITDLI             (W02_PARM_CT_5,               
                                                   W02_ISRT,                    
                                                   RF1,                         
                                                   W01_PINT,                    
                                                   SSA1_RF0PERSN,               
                                                   SSA_UQUAL_PINNTEKT);         
                                                                                
                         IF   DLIUIB.UIBRCODE.UIBFCTR    ^=                     
                                              UIB_RC_OK    THEN                 
                              DO;                                               
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L120:                                                                         
                                 FEIL_MELD_NR                =    500 ;         
                                 FEIL_VED_LABEL              =   '120';         
                                 FATAL_FEIL                  =   '1'B ;         
                                 GO   TO  RETUR;                                
                              END;                                              
                                                                                
                                                                                
                         IF  RF1.STATUS_KODE     ^=       '  ' THEN             
                             DO;                                                
             /* ************************************************/               
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */               
             /* ************************************************/               
  L125:                                                                         
                                FEIL_MELD_NR                =   500 ;           
                                FEIL_VED_LABEL              =  '125';           
                                FATAL_FEIL                  =   '1'B ;          
                                DB_STATUS_KODE      =   RF1.STATUS_KODE;        
                                GO   TO  RETUR;                                 
                             END;                                               
                   END;                                                         
                ELSE                                                            
                   DO;                                                          
           /* ********************************************** */                 
           /* UGYLDIG ETYPE.INNTEKT LIGGER IKKE INNE FRA FØR.*/                 
           /* ********************************************** */                 
  L130:                                                                         
                      FEIL_MELD_NR                =    262 ;                    
                      FEIL_VED_LABEL              =   '130';                    
                      GO   TO  RETUR;                                           
                   END;                                                         
             END;                                                               
                                                                                
         ELSE                                                                   
            IF  RF1.STATUS_KODE           ^=       '  '         THEN            
                DO;                                                             
             /* ************************************************/               
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */               
             /* ************************************************/               
  L135:                                                                         
                   FEIL_MELD_NR                =    500 ;                       
                   FEIL_VED_LABEL              =   '135';                       
                   FATAL_FEIL                  =   '1'B ;                       
                   DB_STATUS_KODE              =    RF1.STATUS_KODE;            
                   GO   TO  RETUR;                                              
                END;                                                            
  RETUR:                                                                        
                                                                                
  END P10_BEHANDLE_PINNTEKT;                                                    
                                                                                
                                                                                
  P15_LES_INNTEKT_GN:                                                           
    PROC;                                                                       
                                                                                
                                                                                
                                                                                
                                                                                
           /* ******************************************** */                   
           /*  LES      :  PINNTEKT                        */                   
           /* ******************************************** */                   
                                                                                
                                                                                
      CALL PLITDLI                          (W02_PARM_CT_5,                     
                                             W02_GN,                            
                                             RF1,                               
                                             W01_PINT,                          
                                             SSA1_RF0PERSN,                     
                                             SSA1_PINNTEKT);                    
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L140:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '140';                               
           FATAL_FEIL                  =   '1'B ;                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
      IF   RF1.STATUS_KODE             =   'GE'    THEN                         
           DO;                                                                  
              IKKE_FUNNET = '1'B;                                               
              GO TO RETUR;                                                      
           END;                                                                 
      ELSE                                                                      
         IF   RF1.STATUS_KODE         ^=   '  '    THEN                         
              DO;                                                               
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L145:                                                                         
                 FEIL_MELD_NR                =    500 ;                         
                 FEIL_VED_LABEL              =   '145';                         
                 DB_STATUS_KODE              =   RF1.STATUS_KODE;               
                 IKKE_FUNNET                 =   '1'B ;                         
                 FATAL_FEIL                  =   '1'B ;                         
                 GO   TO  RETUR;                                                
              END;                                                              
                                                                                
  RETUR:                                                                        
                                                                                
  END P15_LES_INNTEKT_GN;                                                       
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /* PROCEDURE FOR Å SKRIV OPPLYSNINGER UT PÅ 6EYFILEN.             */        
    /* ************************************************************** */        
                                                                                
  P30_SKRIV_KEYFIL:                                                             
    PROC;                                                                       
                                                                                
   DCL                                                                          
      KEY_PEKER                  POINTER                  ;                     
   DCL                                                                          
      KEY_IDENT                BIT (32) BASED(KEY_PEKER)  ; /* KONS RF*/        
   DCL                                                                          
      01 REC_OMR BASED (KEY_PEKER),                                             
         02 FNR                  PIC '(11)9',                                   
         02 IÅR                  PIC '(4)9',                                    
         02 ART                  PIC '(1)9',                                    
         02 RAPPDATOM      FIXED DEC (9)   ,                                    
         02 AGIVKODE             PIC '(3)9';                                    
   DCL  KEYFIL_RECL                CHAR (24);                                   
   DCL                                                                          
      01 HDATO                   PIC '(8)9';                                    
   DCL                                                                          
      01 HDATO_REDEF DEF HDATO,                                                 
         02 ÅR                   PIC '(4)9',                                    
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9';                                    
   DCL                                                                          
      01 DATOM                   PIC '(9)9';                                    
   DCL                                                                          
      01 DATOM_REDEF DEF DATOM,                                                 
         02 ÅR                   PIC '(4)9',                                    
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9',                                    
         02 M                    CHAR (1);                                      
                                                                                
      KEY_PEKER   = ADDR(KEYFIL_RECL);                                          
      REC_OMR.FNR       = NISF.FNR;                                             
      REC_OMR.IÅR       = NIS.ÅR(I);                                            
      REC_OMR.ART       = NIS.ART(I);                                           
                                                                                
      HDATO             = DATO_2000;                                            
                                                                                
      DATOM_REDEF.ÅR    = HDATO_REDEF.ÅR;                                       
      DATOM_REDEF.MND   = HDATO_REDEF.MND;                                      
      DATOM_REDEF.DAG   = HDATO_REDEF.DAG;                                      
      DATOM_REDEF.M     = NIS.MERKE(I);                                         
                                                                                
      REC_OMR.RAPPDATOM = DATOM;                                                
      REC_OMR.AGIVKODE  = NIS.AGIVKODE(I);                                      
                                                                                
      EXEC CICS HANDLE CONDITION ERROR   (L117)  ;                              
      EXEC CICS HANDLE CONDITION DUPREC  (ALT_OK);                              
      EXEC CICS WRITE  DATASET ('KEYFIL') RIDFLD (KEY_IDENT)                    
                                          FROM   (KEYFIL_RECL);                 
      GOTO ALT_OK;                                                              
                                                                                
    L117:                                                                       
                                                                                
      FEIL_MELD_NR                =    512  ;                                   
      FEIL_VED_LABEL              =   '117';                                    
      FATAL_FEIL                  =   '1'B ;                                    
                                                                                
    ALT_OK:                                                                     
                                                                                
                                                                                
  END P30_SKRIV_KEYFIL;                                                         
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å SKRIVE KOMPREC.                                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
  P40_SKRIV_KOMPREC:                                                            
    PROC;                                                                       
                                                                                
   DCL   KOM_PEKER                  POINTER    ;                                
                                                                                
   DCL    KOMP_REC                   CHAR(67);    /*Y2K*/                       
                                                                                
   DCL  01 KOM_OMR  BASED (KOM_PEKER),                                          
         02 TYPE                 CHAR(1)   ,                                    
         02 ETYPE                CHAR(1)   ,                                    
         02 IÅR                  PIC '(4)9', /*Y2K*/                            
         02 KOMMNR         FIXED DEC (4)   ,                                    
         02 RAPPDATOM      FIXED DEC (9)   , /*Y2K*/                            
         02 FNR            FIXED DEC (11)  ,                                    
         02 GMLFNR         FIXED DEC (11)  ,                                    
         02 AINNTEKT       FIXED DEC (9)   ,                                    
         02 SINNTEKT       FIXED DEC (9)   ,                                    
         02 BINNTEKT       FIXED DEC (9)   ,                                    
         02 INNTOMB              PIC '(1)9',                                    
         02 NAVN                 CHAR(25)  ;                                    
   DCL                                                                          
      01 HDATO                   PIC '(8)9'; /*Y2K*/                            
   DCL                                                                          
      01 HDATO_REDEF DEF HDATO,                                                 
         02 ÅR                   PIC '(4)9', /*Y2K*/                            
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9';                                    
   DCL                                                                          
      01 DATOM                   PIC '(9)9'; /*Y2K*/                            
   DCL                                                                          
      01 DATOM_REDEF DEF DATOM,                                                 
         02 ÅR                   PIC '(4)9', /*Y2K*/                            
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9',                                    
         02 M                    CHAR(1);                                       
                                                                                
      KOM_PEKER    = ADDR(KOMP_REC);                                            
      KOM_OMR.TYPE      = NIS.TYPE(I) ;                                         
      KOM_OMR.ETYPE     = NIS.ETYPE(I);                                         
      KOM_OMR.IÅR       = NIS.ÅR(I)   ;                                         
                                                                                
      KOM_OMR.KOMMNR = NIS.KOMMNR(I);                                           
                                                                                
      HDATO             = DATO_2000      ; /*Y2K*/                              
                                                                                
      DATOM_REDEF.ÅR    = HDATO_REDEF.ÅR ;                                      
      DATOM_REDEF.MND   = HDATO_REDEF.MND;                                      
      DATOM_REDEF.DAG   = HDATO_REDEF.DAG;                                      
      DATOM_REDEF.M     = NIS.MERKE(I)   ;                                      
                                                                                
      KOM_OMR.RAPPDATOM = DATOM          ;                                      
      KOM_OMR.FNR       = NISF.FNR       ;                                      
      KOM_OMR.NAVN      = NISF.NAVN      ;                                      
      KOM_OMR.GMLFNR    = 0              ;                                      
      KOM_OMR.AINNTEKT  = 0              ;                                      
      KOM_OMR.SINNTEKT  = 0              ;                                      
      KOM_OMR.BINNTEKT  = 0              ;                                      
                                                                                
      IF NIS.ART(I)     = 1 THEN                                                
         KOM_OMR.AINNTEKT  = NIS.PG_INNTEKT(I);                                 
      ELSE                                                                      
         IF NIS.ART(I)     = 2 THEN                                             
            KOM_OMR.SINNTEKT  = NIS.PG_INNTEKT(I);                              
         ELSE                                                                   
            IF NIS.ART(I)     = 3 THEN                                          
               KOM_OMR.BINNTEKT  = NIS.PG_INNTEKT(I);                           
                                                                                
                                                                                
      EXEC CICS HANDLE CONDITION ERROR(L11X);                                   
      EXEC CICS WRITE DATASET ('KOMP') RIDFLD(KOM_PEKER)                        
                                       FROM(KOMP_REC) RBA;                      
                                                                                
      GOTO ALT_OK;                                                              
    L11X:                                                                       
      FEIL_MELD_NR                =     511;                                    
      FEIL_VED_LABEL              =   '11X';                                    
      FATAL_FEIL                  =   '1'B ;                                    
    ALT_OK:                                                                     
                                                                                
  END P40_SKRIV_KOMPREC;                                                        
                                                                                
                                                                                
  P50_BEHANDLE_INNTEKTER_1:                                                     
    PROC;                                                                       
                                                                                
      IF  NIS.TYPE(I) = 'C' THEN                                                
          IF (W02_PI_TYPE = 'B'       !                                         
             W02_PI_TYPE  = 'C'       !                                         
             W02_PI_TYPE  = 'D' )     &                                         
             W02_PI_ÅR    = NIS.ÅR(I) &                                         
             W02_PI_MERKE > 3          THEN                                     
             FEILTYPE    = 0    ;                                               
          ELSE                                                                  
             DO;                                                                
                FEILTYPE    = 4    ;                                            
                IKKE_FUNNET = '1'B ;                                            
                CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                             
             END;                                                               
                                                                                
  RETUR:                                                                        
                                                                                
  END P50_BEHANDLE_INNTEKTER_1;                                                 
                                                                                
                                                                                
                                                                                
  P60_BEHANDLE_INNTEKTER_2:                                                     
    PROC;                                                                       
                                                                                
  /* DCL DUMMY_ÅR    PIC '(4)9';    Y2K*/                                       
                                                                                
     DUMMY_ÅR = 0;                                                              
                                                                                
     IF  NIS.TYPE(I) = 'B' THEN                                                 
         DO;                                                                    
            IF (W02_PI_TYPE = 'V' !                                             
                W02_PI_TYPE = 'W' ) &                                           
                W02_PI_ÅR   = NIS.ÅR(I) THEN                                    
                DO;                                                             
                   FEILTYPE    = 5    ;                                         
                   IKKE_FUNNET = '1'B ;                                         
                   CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                          
                END;                                                            
         END;                                                                   
     ELSE                                                                       
        IF  NIS.TYPE(I) = 'U' THEN                                              
            IF (W02_PI_TYPE = 'B' !                                             
                W02_PI_TYPE = 'C'  !                                            
                W02_PI_TYPE = 'D' ) &                                           
                W02_PI_ÅR   = NIS.ÅR(I) THEN                                    
                DO;                                                             
                   FEILTYPE    = 5    ;                                         
                   IKKE_FUNNET = '1'B ;                                         
                   CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                          
                END;                                                            
                                                                                
  END P60_BEHANDLE_INNTEKTER_2;                                                 
                                                                                
                                                                                
                                                                                
  P70_BEHANDLE_INNTEKTER_3:                                                     
    PROC;                                                                       
                                                                                
 /*  DCL DUMMY_ÅR    PIC '(4)9';    Y2K*/                                       
                                                                                
      DUMMY_ÅR = 0;                                                             
                                                                                
      IF  (NIS.TYPE(I) = 'B' !                                                  
          NIS.TYPE(I)  = 'U') &                                                 
          NIS.MERKE(I) > 3       THEN                                           
          IF W02_PI_TYPE = 'E' !                                                
             W02_PI_TYPE = 'F'   THEN                                           
             FEILTYPE    = 0    ;                                               
          ELSE                                                                  
             DO;                                                                
                FEILTYPE    = 6    ;                                            
                IKKE_FUNNET = '1'B ;                                            
                CALL SKRIV_BREV(FEILTYPE,DUMMY_ÅR);                             
             END;                                                               
  END P70_BEHANDLE_INNTEKTER_3;                                                 
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR FINNE RETT TKNR .   (GU KVAL. PÅ ROT OG PINNTEKT)*/        
    /*                                                                */        
    /*     TKNR FINNES VED 1. OG SJEKKE OM ROTSEGM. FNR > 0  . ER DET */        
    /*     IKKE DET BENYTTES KOMMNR. I SISTE INNTEKTS-SEGM.           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    F100_FINN_TKNR:                                                             
      PROC            ( W100_FNR)   RETURNS (FIXED DEC(4))            ;         
                                                                                
      DCL W100_FNR      FIXED DEC   (11)                              ,         
          W100_TKNR     FIXED DEC   ( 4)     INIT     (0)             ;         
                                                                                
                                                                                
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GU,                        
                                                 RF1,                           
                                                 RF0PERSN,                      
                                                 SSA1_RF0PERSN);                
                                                                                
      IF UIBFCTR                          ^=     UIB_RC_OK         !            
         RF1.STATUS_KODE                  ^=    '  '          THEN              
         DO;                                                                    
                                                                                
            /* **************************************************** */          
            /* UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES        */          
            /* **************************************************** */          
  L161:                                                                         
            FEIL_MELD_NR         =     500;                                     
            FEIL_VED_LABEL       =    '161';                                    
            DB_STATUS_KODE       =     RF1.STATUS_KODE;                         
            GO TO RETUR;                                                        
         END;                                                                   
                                                                                
                                                                                
      IF RF0PERSN.TKNR                    >      0                THEN          
         W100_TKNR                        =      RF0PERSN.TKNR        ;         
      ELSE                                                                      
         DO;                                                                    
            CALL PLITDLI                        (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_PINT,                      
                                                 SSA_UQUAL_PINNTEKT_L);         
                                                                                
            IF   UIBFCTR                   =     UIB_RC_OK    THEN              
              DO;                                                               
                 SELECT ( RF1.STATUS_KODE );                                    
                                                                                
                    WHEN ( '  ' )                                               
                        W100_TKNR          =     W01_PINT.W02_PI_KOMMNR;        
                                                                                
                    WHEN ( 'GE' , 'GB' );                                       
                                                                                
                    OTHERWISE                                                   
                                                                                
                       /* ******************************************* */        
                       /*UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES*/        
                       /* ******************************************* */        
                       DO;                                                      
  L162:                                                                         
                          FEIL_MELD_NR         =     500;                       
                          FEIL_VED_LABEL       =    '162';                      
                          DB_STATUS_KODE       =     RF1.STATUS_KODE;           
                       END;                                                     
                 END;                                                           
              END;                                                              
            ELSE                                                                
              DO;                                                               
                 /* ******************************************* */              
                 /* UIB'S RETUR-CODE ER UAKSEPTABEL             */              
                 /* ******************************************* */              
  L164:                                                                         
                  FEIL_MELD_NR               =     500;                         
                  FEIL_VED_LABEL             =    '164';                        
              END;                                                              
         END;                                                                   
                                                                                
  RETUR:                                                                        
      RETURN (W100_TKNR);                                                       
                                                                                
                                                                                
    END F100_FINN_TKNR;                                                         
                                                                                
                                                                                
                                                                                
                                                                                
  SKRIV_FEILMELDING:                                                            
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    GIR UT FEILMELDING.                                           */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SKRIV_FEILMELDING;                                       */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
   IF FATAL_FEIL           THEN                                                 
      DO;                                                                       
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!                
                               ' GÅR I FEIL VED LABEL NR. '        !!           
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;           
        EXEC CICS PURGE MESSAGE;                                                
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING              
                                                           JUSTIFY(10);         
                                                                                
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                              
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                                
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);                
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)                    
                                                         ACCUM PAGING;          
                                                                                
        IF FEIL_MELD_NR        =     500              THEN                      
           DO;                                                                  
                                                                                
              /* *************************************************** */         
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */         
              /* *************************************************** */         
                                                                                
              FEIL_MELDING     =  '  RETUR_KODE   =  '                          
                                       !! DIV_PARAM_OMR.DB_STATUS_KODE ;        
              EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM                    
                                               PAGING   JUSTIFY (18);           
           END;                                                                 
                                                                                
        ELSE                                                                    
           IF FEIL_MELD_NR   =     499              THEN                        
              DO;                                                               
                                                                                
               /* *************************************************** */        
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */        
               /* *************************************************** */        
                                                                                
                                                                                
                 FNR11            =  NISF.FNR;                                  
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR11    ;                
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM                 
                                                  PAGING   JUSTIFY (18);        
              END;                                                              
           ELSE                                                                 
              IF FEIL_MELD_NR   =     512              THEN                     
                 DO;                                                            
                                                                                
               /* *************************************************** */        
               /*     FEIL I SKRIV AV KEYFIL.                         */        
               /* *************************************************** */        
                                                                                
                                                                                
                    FNR11            =  NISF.FNR;                               
                    ÅR_PIC           =  NIS.ÅR(I);                              
                    FEIL_MELDING     =  '  FNR  =  ' !!  FNR11    !!            
                                    '  INNTEKTSÅR = ' !!  ÅR_CHAR ;             
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM              
                                                  PAGING   JUSTIFY (18);        
                                                                                
                    FEIL_MELDING     =  '  EIBRCODE     =  '                    
                                       !! EIBRCODE;                             
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM              
                                               PAGING   JUSTIFY (18);           
                 END;                                                           
           ELSE                                                                 
              IF FEIL_MELD_NR   =     511              THEN                     
                 DO;                                                            
                                                                                
               /* *************************************************** */        
               /*     FEIL I SKRIV AV KOMPREC.                        */        
               /* *************************************************** */        
                                                                                
                                                                                
                    FNR11            =  NISF.FNR;                               
                    ÅR_PIC           =  NIS.ÅR(I);                              
                    FEIL_MELDING     =  '  FNR  =  ' !!  FNR11    !!            
                                    '  INNTEKTSÅR = ' !!  ÅR_CHAR ;             
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM              
                                                  PAGING   JUSTIFY (18);        
                                                                                
                    FEIL_MELDING     =  '  EIBRCODE     =  '                    
                                       !! EIBRCODE;                             
                    EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM              
                                               PAGING   JUSTIFY (18);           
                  END;                                                          
                                                                                
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!                     
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';        
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)                    
                                                           ACCUM PAGING;        
        EXEC CICS SEND PAGE;                                                    
                                                                                
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/                    
                                                                                
         EXEC CICS ABEND                                                        
                     ABCODE(STOP);                                              
     END;                                                                       
  ELSE                                                                          
           IF FEIL_MELD_NR   =     382              THEN                        
              DO;                                                               
                 ALLOCATE S001I04O      ;                                       
                 S001I04O.MELDING1O =                                           
           'FNR ER I HISTORISK DATABASE ***  REGISTRERINGEN FORKASTES';         
                                                                                
           S001I04O.MELDING2O =                                                 
              '** VENT ** KAN REGISTRERES I MORGEN ***';                        
                                                                                
                  EXEC CICS SEND MAP('S001I04')                                 
                                 MAPSET('S001I43') CURSOR          ;            
                                                                                
                                                                                
                  EXEC CICS RECEIVE MAP('S001I04')                              
                           MAPSET('S001I43') SET(BMSMAPBR);                     
              END;                                                              
                                                                                
  ELSE                                                                          
     DO;                                                                        
        DIV_PARAM_OMR.FRA_CICS        = '0'B;                                   
        DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B;                                   
        DIV_PARAM_OMR.FRA_MED_DIALOG  = '1'B;                                   
        DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                                   
        TRANS_OPPL_OMR.BLANKETTYPE    = 'NI';                                   
        EXEC CICS LINK PROGRAM('R0013301')COMMAREA(KOM_OMR);                    
     END;                                                                       
                                                                                
  END SKRIV_FEILMELDING;                                                        
                                                                                
  SKRIV_FFU_DATA:                                                               
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SKRIVER OPPLYSNINGER UT PÅ BREVFIL FOR BRUK TIL FFURAPPORT*/            
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SKRIV_FFU_DATA;                                          */        
  /*                                                                  */        
  /* **************************************************************** */        
   DCL                                                                          
      FFU_PEKER                  POINTER    ;                                   
   DCL                                                                          
      FFU_REC                   CHAR(74)   ;  /*Y2K*/                           
   DCL                                                                          
      01 FFU_OMR  DEF FFU_REC ,                                                 
         02 FNR                  PIC '(11)9',                                   
         02 IÅR1                 PIC '(4)9' , /*Y2K*/                           
         02 NAVN                 CHAR(25)   ,                                   
         02 INNTEKT              PIC '(7)9' ,                                   
         02 KOMMNR               PIC '(4)9' ,                                   
         02 AGIVNR               PIC '(3)9' ,                                   
         02 RAPPDATO             PIC '(8)9' , /*Y2K*/                           
         02 FILLER               CHAR(12)   ;                                   
   DCL                                                                          
      01 DATO                    PIC '(8)9';  /*Y2K*/                           
   DCL                                                                          
      01 DATO_REDEF DEF DATO,                                                   
         02 DAG                  PIC '(2)9',                                    
         02 MND                  PIC '(2)9',                                    
         02 ÅR                   PIC '(4)9';  /*Y2K*/                           
                                                                                
   DCL                                                                          
      01 HDATO                   PIC '(8)9';  /*Y2K*/                           
   DCL                                                                          
      01 HDATO_REDEF DEF HDATO,                                                 
         02 ÅR                   PIC '(4)9',  /*Y2K*/                           
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9';                                    
      HDATO             = DATO_2000         ; /*Y2K*/                           
                                                                                
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                                      
      DATO_REDEF.MND    = HDATO_REDEF.MND;                                      
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                                      
                                                                                
      FFU_OMR.RAPPDATO  = DATO_2000        ; /*Y2K*/                            
                                                                                
      FFU_OMR.FNR       = NISF.FNR         ;                                    
      FFU_OMR.NAVN      = NISF.NAVN        ;                                    
      FFU_OMR.IÅR1      = NIS.ÅR(I)        ;                                    
      FFU_OMR.INNTEKT   = NIS.PG_INNTEKT(I);                                    
      FFU_OMR.KOMMNR    = NIS.KOMMNR(I)    ;                                    
      FFU_OMR.AGIVNR    = NIS.AGIVKODE(I)  ;                                    
                                                                                
                                                                                
                                                                                
      EXEC CICS HANDLE CONDITION ERROR(L120);                                   
      EXEC CICS HANDLE CONDITION DUPREC(ALT_OK);                                
      EXEC CICS WRITE DATASET ('FFUDATA') RIDFLD(FFU_PEKER) RBA                 
                                                FROM(FFU_REC);                  
      GOTO ALT_OK;                                                              
    L120:                                                                       
      FEIL_MELD_NR                =     516;                                    
      FEIL_VED_LABEL              =   '120';                                    
      FATAL_FEIL                  =   '1'B ;                                    
    ALT_OK:                                                                     
                                                                                
                                                                                
  END SKRIV_FFU_DATA;                                                           
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  SKRIV_BREV:                                                                   
     PROC(FEILTYPE,D_ÅR);                                                       
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SKRIVER BREV OM FEILSITUASJONER.                              */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SKRIV_BREV(FEILTYPE,D_ÅR);                               */        
  /*                                                                  */        
  /* **************************************************************** */        
   DCL                                                                          
     1 CHARLIST2,                                                               
       2 PRINT,                                                                 
         3 TERMID CHAR(4) INIT('    '),                                         
         3 RESERV CHAR(12) INIT(' '),                                           
       2 SLUTT2,                                                                
         3 SLUTT  FIXED BIN(15) INIT(-1),                                       
         3 RESERV CHAR(14)      INIT(' ');                                      
                                                                                
                                                                                
   DCL                                                                          
      KEY_BIT                    BIT(32) BASED (KEY_PEKER),                     
      KEY_PEKER                  POINTER,                                       
      KOMMNR_RECL                CHAR (100);                                    
   DCL                                                                          
      01 KOMMNR_OMR  DEF KOMMNR_RECL,                                           
         02 NR                   PIC '(4)9' ,                                   
         02 NAVN                 CHAR (25),                                     
         02 ADR1                 CHAR (35),                                     
         02 ADR2                 CHAR (30),                                     
         02 FILLER               CHAR ( 6);                                     
                                                                                
   DCL                                                                          
      UTLINJE1                   CHAR(80)   ;                                   
   DCL                                                                          
      FEILTYPE                   PIC '9'    ;                                   
   DCL                                                                          
      ANT_GANGER                 PIC '(2)9' ;                                   
   DCL                                                                          
      01 NAVN_1                  CHAR (35)  ;                                   
   DCL                                                                          
      01 PIC_INNTEKT1            PIC 'Z.ZZZ.ZZ9';                               
   DCL                                                                          
      01 DATO                    PIC '(8)9';  /*Y2K*/                           
   DCL                                                                          
      01 DATO_REDEF DEF DATO,                                                   
         02 DAG                  PIC '(2)9',                                    
         02 MND                  PIC '(2)9',                                    
         02 ÅR                   PIC '(4)9';  /*Y2K*/                           
                                                                                
   DCL                                                                          
      01 D_ÅR                    PIC '9999';  /*Y2K*/                           
   DCL                                                                          
      01 HDATO                   PIC '(8)9';  /*Y2K*/                           
   DCL                                                                          
      01 HDATO_REDEF DEF HDATO,                                                 
         02 ÅR                   PIC '(4)9',  /*Y2K*/                           
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9';                                    
                                                                                
      TERMID  = 'R1B7';                                                         
                                                                                
      HDATO             = DATO_2000         ; /*Y2K*/                           
                                                                                
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                                      
      DATO_REDEF.MND    = HDATO_REDEF.MND;                                      
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                                      
                                                                                
                                                                                
      /*   HENTER KOMMUNEOPPLYSNINGER   ********/                               
                                                                                
      KEY_PEKER   = ADDR(NIS.KOMMNR(I));                                        
                                                                                
                                                                                
      EXEC CICS HANDLE CONDITION ERROR(IKKE_FUNNET1);                           
                                                                                
      EXEC CICS READ DATASET ('LIKNING') RIDFLD(KEY_BIT)                        
                                                    INTO(KOMMNR_RECL);          
      GO TO OK1;                                                                
                                                                                
  IKKE_FUNNET1:                                                                 
      NAVN_1   = 'UKJENT KOMMUNENR.';                                           
  OK1:                                                                          
      NAVN_1   = KOMMNR_OMR.NAVN;                                               
                                                                                
      ALLOCATE S001I04O;                                                        
      ALLOCATE S001I04I;                                                        
      EXEC CICS LOAD PROGRAM('S001I43');                                        
                                                                                
      S001I04O.MELDING1O = '';                                                  
      S001I04O.MELDING2O = '';                                                  
      S001I04O.MELDING3O = '';                                                  
      S001I04O.MELDING4O = '';                                                  
      S001I04O.MELDING5O = '';                                                  
      S001I04O.MELDING6O = '';                                                  
                                                                                
      SELECT (FEILTYPE);                                                        
         WHEN (1)                                                               
           DO;                                                                  
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.1 PÅ LOKAL SKRIVER.                     */        
  /*                                                                  */        
  /*                                                                  */        
  /*                                                                  */        
  /*    INNTEKT REGISTRERT PÅ DØD PERSON.                             */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
                                                                                
        S001I04O.MELDING2O =                                                    
                                                                                
        '**** P E R S O N E N  E R  D Ø D ****';                                
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
          /*                                           DATAONLY ;*/             
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    TIL LIGNINGSSJEFEN I ' !! KOMMNR_OMR.NAVN;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR1;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR2;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    ' !! NISF.FNR !! '  ' !! NISF.NAVN;                     
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
    /*  ENDRET AV SATISH 08.02.2000                                             
        EXEC CICS SEND TEXT FROM(BLANKLINJE) ACCUM PAGING L80 PRINT;            
    */                                                                          
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
   /*   ENDRET TIL OPPTILL                */                                    
                                                                                
        UTLINJE1 = '    RAPPORTERING AV PENSJONSGIVENDE INNTEKT FOR ÅR'         
                   !! ' ETTER REGISTRERT';                                      
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '    DØDSÅR.';                                               
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER PENSJONSGIVENDE '          
                   !! 'INNTEKT INN-';                                           
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        PIC_INNTEKT1 = NIS.PG_INNTEKT(I);                                       
                                                                                
        UTLINJE1 = '    RAPPORTERT TIL RIKSTRYGDEVERKET MED KR  '               
                   !! PIC_INNTEKT1 !! ' FOR';                                   
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '    INNTEKTSÅRET 19' !! NIS.ÅR(I) !! '.';                   
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
        UTLINJE1 = '    I FØLGE VÅRT REGISTER ER VEDKOMMENDE SKATTEYTER'        
                   !! ' DØD I 19' !! D_ÅR !! ',';                               
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '    OG DET INNRAPPORTERTE BELØP BLIR AV DEN GRUNN'          
                   !! ' IKKE REGI-';                                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '    STRERT.';                                               
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                RIKSTRYGDEVERKET';          
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE;                                                    
                                                                                
           END;                                                                 
                                                                                
         WHEN (2)                                                               
           DO;                                                                  
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.2 PÅ LOKAL SKRIVER.                     */        
  /*                                                                  */        
  /* NULLINNTEKT RAPPORTERT FRA EN ANNEN KOMMUNE.                     */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
     DCL PI PIC '(9)9';                                                         
                                                                                
        S001I04O.MELDING2O =                                                    
                                                                                
        '**** F E I L  I N N R A P P O R T E R I N G ****';                     
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    TIL SKATTEDIREKTORATET';                                
                                                                                
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    FNR: ' !! NISF.FNR                                      
                  !! '  NAVN: ' !! NISF.NAVN                                    
                  !! '    INNTEKTSÅR: ' !! NIS.ÅR(I);                           
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    FOR OVENNEVTE SKATTEYTER ER'                            
                   !! 'NULLINNTEKT RAPPORTERT FRA EN ANNEN KOMMUNE';            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '    ENN TIDLIGERE RAPPORTERT INNTEKT OVER NULL.';           
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '    NULLINNTEKT ER RAPPORTERT FRA '                         
                   !! ' KOMMUNENR. ' !! NIS.KOMMNR(I) !! ',';                   
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        PI = W02_PI;            /**/                                            
        UTLINJE1 = '    MENS TIDLIGERE ER DET RAPPORTERT  '                     
             !! 'INNTEKT MED KR. ' !! PI !! 'FRA';                              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '    KOMMUNENR. ' !!     (W02_PI_KOMMNR);                    
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                                         '                  
                !! '        RIKSTRYGDEVERKET';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE;                                                    
                                                                                
                                                                                
           END;                                                                 
                                                                                
         WHEN (3)                                                               
           DO;                                                                  
                                                                                
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.3 PÅ LOKAL SKRIVER.                     */        
  /*    BREV NR.1                                                     */        
  /*                                                                  */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
    DCL KOMMNR PIC '(4)9';                                                      
                                                                                
                                                                                
        S001I04O.MELDING2O =                                                    
                                                                                
        '**** I N N T E K T  F R A  T O  K O M M U N E R ****';                 
                                                                                
        S001I04O.MELDING3O =                                                    
                                                                                
        '**** B R E V NR.1 **************';                                     
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    TIL LIGNINGSSJEFEN I ' !! KOMMNR_OMR.NAVN;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR1;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR2;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    ' !! NISF.FNR !! '  ' !! NISF.NAVN;                     
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
        UTLINJE1 = '    RAPPORTERING AV PENSJONSGIVENDE INNTEKT FOR INN'        
                   !! 'TEKTSÅRET 19' !! NIS.ÅR(I);                              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER PENSJONSGIVENDE '          
                   !! 'INNTEKT FOR 19' !! NIS.ÅR(I);                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '    INNRAPPORTERT BÅDE FRA:';                               
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                      A: ' !! NIS.KOMMNR(I) !! ' '          
                          !! NAVN_1;                                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        KOMMNR = W02_PI_KOMMNR;                                                 
                                                                                
        /*   HENTER KOMMUNEOPPLYSNINGER FRA KOMMUNE NR.2  ********/             
                                                                                
        KEY_PEKER = ADDR(KOMMNR);                                               
                                                                                
        EXEC CICS HANDLE CONDITION ERROR(IKKE_FUNNET2);                         
                                                                                
        EXEC CICS READ DATASET ('LIKNING') RIDFLD(KEY_BIT)                      
                                                    INTO(KOMMNR_RECL);          
        GO TO OK2;                                                              
                                                                                
  IKKE_FUNNET2:                                                                 
        KOMMNR_OMR.NAVN = 'UKJENT KOMMUNENR.';                                  
  OK2:                                                                          
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                      B: ' !!     (W02_PI_KOMMNR)           
                  !! ' ' !! KOMMNR_OMR.NAVN;                                    
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 2;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    RIKSTRYGDEVERKET HAR REGISTRERT DEN PENSJONSGI'         
                   !! 'VENDE INNTEKT';                                          
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    FRA A, MENS DEN PENSJONSGIVENDE INNTEKT FRA B'          
                   !! ' ER AVVIST.';                                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    ÅRSAKEN TIL DETTE ER AT INNTEKTEN FRA A ER'             
                   !! ' REGISTRERT FØRST.';                                     
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    VI ANMODER DE BERØRTE KOMMUNER OM Å BRINGE SKA'         
                   !! 'TTEYTERS RIKTIGE';                                       
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    SKATTEKOMMUNE FOR 19' !! NIS.ÅR(I)                      
                   !! ' PÅ DET RENE, DERSOM FORHOLDET IKKE ALLE-';              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 =    '    REDE ER AVKLARET.';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
        EXEC CICS SEND PAGE RETAIN;                                             
                                                                                
                                                                                
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '    RUTINENE DERETTER :';                                   
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
        ANT_GANGER = 2;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '           1. DERSOM A FASTHOLDER SKATTEPLIKTEN'            
                   !! ' ER DET IKKE NØD-';                                      
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              VENDIG Å FORETA SEG NOE(MED MINDRE'           
                   !! ' ANDRE ANSETTELSER';                                     
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              SKAL ENDRES).';                               
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 2;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '           2. DERSOM A FRAFALLER SKATTEPLIKTEN'             
                   !! ' MELDES AVGANG';                                         
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              VED Å PÅFØRE KODE "9" I RUTEN '               
                   !! '"P.KODE" PÅ DEN';                                        
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              ORDINÆRE LIGNINGSBLANKETT'                    
                                            !! '.BLANKETTEN SENDES';            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              DATASENTERET FOR SKATTEVESENET '              
                         !! 'SAMMEN MED';                                       
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        UTLINJE1 = '              EVENTUELLE ANDRE RETTEBLANKETTER.';           
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    SKATTEDIREKTORATET                   '                  
                !! '        RIKSTRYGDEVERKET';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE RETAIN;                                             
                                                                                
                                                                                
                                                                                
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.3 PÅ LOKAL SKRIVER.                     */        
  /*    BREV NR.2                                                     */        
  /*                                                                  */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
        ALLOCATE S001I04O;                                                      
        ALLOCATE S001I04I;                                                      
        EXEC CICS LOAD PROGRAM('S001I43');                                      
                                                                                
        S001I04O.MELDING3O =                                                    
                                                                                
        '**** B R E V 2 **************';                                        
                                                                                
        S001I04O.MELDING3O = '                                 ';               
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    TIL LIGNINGSSJEFEN I ' !! KOMMNR_OMR.NAVN;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR1;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '                         ' !! KOMMNR_OMR.ADR2;              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    ' !! NISF.FNR !! '  ' !! NISF.NAVN;                     
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    RAPPORTERING AV PENSJONSGIVENDE INNTEKT FOR INN'        
                   !! 'TEKTSÅRET 19' !! NIS.ÅR(I);                              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER PENSJONSGIVENDE '          
                   !! 'INNTEKT FOR 19' !! NIS.ÅR(I);                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    INNRAPPORTERT BÅDE FRA:';                               
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                      A: ' !! NIS.KOMMNR(I) !! ' '          
                          !! NAVN_1;                                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                      B: ' !!     (W02_PI_KOMMNR)           
                   !! ' ' !! KOMMNR_OMR.NAVN;                                   
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 2;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    RIKSTRYGDEVERKET HAR REGISTRERT DEN PENSJONSGI'         
                   !! 'VENDE INNTEKT';                                          
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    FRA A, MENS DEN PENSJONSGIVENDE INNTEKT FRA B'          
                   !! ' ER AVVIST.';                                            
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    ÅRSAKEN TIL DETTE ER AT INNTEKTEN FRA A ER'             
                   !! ' REGISTRERT FØRST.';                                     
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    VI ANMODER DE BERØRTE KOMMUNER OM Å BRINGE SKA'         
                   !! 'TTEYTERS RIKTIGE';                                       
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    SKATTEKOMMUNE FOR 19' !! NIS.ÅR(I)                      
                   !! ' PÅ DET RENE, DERSOM FORHOLDET IKKE ALLE-';              
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '    REDE ER AVKLARET.';                                     
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        EXEC CICS SEND PAGE RETAIN;                                             
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    RUTINENE DERETTER :';                                   
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '           1. DERSOM  B FASTHOLDER SKATTEPLIKTEN'           
                   !! ' ANSETTES PENSJONS-';                                    
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              GIVENDE INNTEKT PÅ BLANKETTEN "END'           
                   !! 'RING I PENSJONS-';                                       
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              GIVENDE INNTEKT". BLANKETTEN SENDES'          
                   !! ' DATASENTERET';                                          
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              FOR SKATTEVESENET. (DERSOM ANDRE AN'          
                   !! 'SETTELSER M.V.';                                         
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              SKAL ENDRES,NYTTES DEN ORDINÆRE L'            
                   !! 'IGNINGSBLANKETT';                                        
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              SOM SENDES DATASENTERET FOR SKATT'            
                   !! 'EVESENET.)';                                             
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '           2. DERSOM B FRAFALLER SKATTEPLIKTEN'             
                   !! ' MELDES AVGANG VED';                                     
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              Å PÅFØRE KODE "9" I RUTEN "P.KODE" '          
                   !! 'PÅ DEN ORDINÆRE';                                        
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              LIGNINGSBLANKETT. BLANKETTEN SENDES'          
                   !! ' DATASENTERET';                                          
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              FOR SKATTEVESENET SAMMEN MED EVEN'            
                   !! 'TUELLE ANDRE RETTE-';                                    
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '              BLANKETTER.';                                 
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    SKATTEDIREKTORATET                   '                  
                !! '        RIKSTRYGDEVERKET';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE RETAIN;                                             
                                                                                
                                                                                
           END;                                                                 
                                                                                
                                                                                
 /*      WHEN (4)                                                     */        
 /*        DO;                                                        */        
                                                                                
 /*ENDRET 3.7.87 HL - MELDING NR 4 SKAL IKKE SKRIVES - FRAPP 516*/              
                                                                                
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.4 PÅ LOKAL SKRIVER.                     */        
  /*                                                                  */        
  /* FEIL VED INNRAPPORTERINGEN.                                      */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
  /*    S001I04O.MELDING2O =                                          */        
  /*                                                                  */        
  /*    '**** F E I L  I N N R A P P O R T E R I N G  ****';          */        
  /*                                                                  */        
  /*    S001I04O.MELDING4O =                                          */        
                                                                                
 /*                'KLARGJØR PRINTER OG TRYKK ENTER.';            */            
                                                                                
 /*     S001I04O.MELDING6O =                                      */            
                                                                                
 /*          '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';  */            
                                                                                
                                                                                
 /*     EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;   */            
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
 /*     EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')        */            
 /*                                            SET(BMSMAPBR);     */            
                                                                                
 /*     EXEC CICS ROUTE LIST (CHARLIST2);                         */            
                                                                                
                                                                                
 /*UTLINJE1 = '                                                  '*/            
 /*                !! '                OSLO, ' !! DATO;           */            
                                                                                
 /*     CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                  */            
                                                                                
                                                                                
 /*     ANT_GANGER = 3;                                           */            
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */            
                                                                                
 /*     UTLINJE1 = '    TIL DIREKTORATET FOR SKATTEVESENET ';     */            
                                                                                
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */            
                                                                                
 /*     ANT_GANGER = 3;                                           */            
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */            
                                                                                
 /*     UTLINJE1 = 'FNR: ' !! NISF.FNR !! ' NAVN: ' !! NISF.NAVN  */            
 /*       !!  'INNTEKTSÅR: ' !! NIS.ÅR(I);                        */            
                                                                                
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */            
 /*     ANT_GANGER = 1;                                           */            
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */            
                                                                                
 /*UTLINJE1 = '    INNTEKT OMBORD RAPPORTERT FRA DIREKTORATET '   */            
 /*                !! 'FOR SJØMENN,MEN';                          */            
                                                                                
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */            
                                                                                
                                                                                
 /*     ANT_GANGER = 1;                                           */            
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */            
                                                                                
                                                                                
                                                                                
 /*     UTLINJE1 = '    IKKE FRA DIREKTORATET FOR SKATTEVESENET.';*/            
                                                                                
 /*     CALL SEND_UTLINJE(UTLINJE1);                              */            
                                                                                
                                                                                
 /*     ANT_GANGER = 4;                                           */            
 /*     CALL SEND_BLANKLINJE(ANT_GANGER);                         */            
                                                                                
                                                                                
                                                                                
 /*     UTLINJE1 = '                                         '   */             
 /*             !! '        RIKSTRYGDEVERKET';                   */             
                                                                                
 /*     CALL SEND_UTLINJE(UTLINJE1);                             */             
                                                                                
                                                                                
 /*     EXEC CICS SEND PAGE;                                     */             
                                                                                
 /*        END;                                                  */             
                                                                                
                                                                                
         WHEN (5)                                                               
           DO;                                                                  
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.5 PÅ LOKAL SKRIVER.                     */        
  /*                                                                  */        
  /* OSLO HAR SENDT BÅDE B- OG U-RAPPORT PÅ SAMME PERSON FOR SAMME ÅR.*/        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
        S001I04O.MELDING2O =                                                    
                                                                                
        '**** F E I L  I N N R A P P O R T E R I N G';                          
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    TIL SKATTEDIREKTORATET';                                
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = 'FNR: ' !! NISF.FNR                                          
                              !! ' NAVN: ' !! NISF.NAVN                         
                              !! ' INNTEKTSÅR: ' !! NIS.ÅR(I);                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 2;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    FOR OVENNEVNTE SKATTEYTER ER DET INNSENDT '             
                   !! 'BÅDE B- OG U-RAPPORT';                                   
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        UTLINJE1 = '   FOR SAMME ÅR.';                                          
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                                         '                  
                !! '        RIKSTRYGDEVERKET';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE;                                                    
                                                                                
                                                                                
                                                                                
           END;                                                                 
                                                                                
                                                                                
                                                                                
                                                                                
         WHEN (6)                                                               
           DO;                                                                  
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.6 PÅ LOKAL SKRIVER.                     */        
  /*                                                                  */        
  /* FEIL VED INNRAPPORTERINGEN.                                      */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
        S001I04O.MELDING2O =                                                    
                                                                                
        '**** F E I L  I N N R A P P O R T E R I N G  ****';                    
                                                                                
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    TIL DIREKTORATET FOR SJØMENN ';                         
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = 'FNR: ' !! NISF.FNR !! ' NAVN: ' !! NISF.NAVN                
          !! 'INNTEKTSÅR: ' !! NIS.ÅR(I);                                       
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
        UTLINJE1 = '    INNTEKT OMBORD RAPPORTERT FRA DIREKTORATET '            
                   !! 'FOR SKATTEVESENET,MEN';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '    IKKE FRA DIREKTORATET FOR SJØMENN.';                    
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                                         '                  
                !! '        RIKSTRYGDEVERKET';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE;                                                    
                                                                                
           END;                                                                 
                                                                                
                                                                                
                                                                                
                                                                                
         WHEN (8)                                                               
           DO;                                                                  
                                                                                
  /* **************************************************************** */        
  /*    SKRIVER UT RAPPORT NR.8 PÅ LOKAL SKRIVER.                     */        
  /*                                                                  */        
  /* NAVN IKKE UTFYLT.                                                */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
        S001I04O.MELDING2O =                                                    
                                                                                
        '**** N A V N  M Å  O P P G I S  ****';                                 
                                                                                
        S001I04O.MELDING4O =                                                    
                                                                                
                   'KLARGJØR PRINTER OG TRYKK ENTER.';                          
                                                                                
        S001I04O.MELDING6O =                                                    
                                                                                
                    '(HVIS UTSKRIFTEN BLIR ØDELAGT,REGISTRER PÅNYTT).';         
                                                                                
                                                                                
        EXEC CICS SEND MAP('S001I04') MAPSET('S001I43') CURSOR;                 
                                                                                
        /* DUMMY RECEIVE-KALL.                                     */           
                                                                                
        EXEC CICS RECEIVE MAP('S001I04') MAPSET('S001I43')                      
                                               SET(BMSMAPBR);                   
                                                                                
        EXEC CICS ROUTE LIST (CHARLIST2);                                       
                                                                                
                                                                                
        UTLINJE1 = '                                                  '         
                   !! '                OSLO, ' !! DATO;                         
                                                                                
        CALL SEND_UTLINJE_FØRSTE_GANG(UTLINJE1);                                
                                                                                
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    TIL SKATTEDIREKTORATET';                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 3;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = 'FNR: ' !! NISF.FNR !! '       '                             
                              !! '   INNTEKTSÅR: ' !! NIS.ÅR(I);                
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
        ANT_GANGER = 1;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
        UTLINJE1 = '    VEDKOMMENDE ER IKKE I REGISTERET FRA FØR,  '            
                   !! 'NAVN MÅ DERFOR OPPGIS.';                                 
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        ANT_GANGER = 4;                                                         
        CALL SEND_BLANKLINJE(ANT_GANGER);                                       
                                                                                
                                                                                
                                                                                
        UTLINJE1 = '                                         '                  
                !! '        RIKSTRYGDEVERKET';                                  
                                                                                
        CALL SEND_UTLINJE(UTLINJE1);                                            
                                                                                
                                                                                
        EXEC CICS SEND PAGE;                                                    
                                                                                
                                                                                
                                                                                
           END;                                                                 
                                                                                
         OTHERWISE;                                                             
                                                                                
 /*ENDRET 3.7.87 HL - MELDING NR 4 SKAL IKKE SKRIVES - FRAPP 516*/              
                                                                                
      END;                                                                      
                                                                                
  END SKRIV_BREV;                                                               
                                                                                
                                                                                
                                                                                
  SEND_UTLINJE_FØRSTE_GANG:                                                     
       PROC(LINJE);                                                             
                                                                                
       DCL LINJE CHAR(80);                                                      
                                                                                
        EXEC CICS SEND TEXT FROM(LINJE) ACCUM PAGING L80 PRINT                  
                                         ERASE;                                 
                                                                                
                                                                                
  END SEND_UTLINJE_FØRSTE_GANG;                                                 
                                                                                
                                                                                
                                                                                
                                                                                
  SEND_BLANKLINJE:                                                              
       PROC(I);                                                                 
                                                                                
   DCL  BLANKLINJE                 CHAR(80)  INIT (' ');                        
   DCL I     PIC '9';                                                           
   DCL J     PIC '9';                                                           
                                                                                
        DO J = 1 TO I;                                                          
           EXEC CICS SEND TEXT FROM(BLANKLINJE) ACCUM PAGING L80 PRINT;         
        END;                                                                    
                                                                                
  END SEND_BLANKLINJE;                                                          
                                                                                
                                                                                
                                                                                
  SEND_UTLINJE:                                                                 
       PROC(LINJE);                                                             
                                                                                
       DCL LINJE CHAR(80);                                                      
                                                                                
        EXEC CICS SEND TEXT FROM(LINJE) ACCUM PAGING L80 PRINT;                 
                                                                                
                                                                                
  END SEND_UTLINJE;                                                             
                                                                                
                                                                                
                                                                                
                                                                                
  SKRIV_OLINNTE:                                                                
     PROC(TYPE,DØDSÅR);                                                         
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SKRIVER OPPLYSNINGER UT PÅ P001.OLINNTE FOR BRUK VED UTSKRIFT */        
  /*    AV KONTROLLISTE.                                              */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SKRIV_OLINNTE;                                           */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
   DCL                                                                          
      OLI_PEKER                  POINTER;                                       
   DCL                                                                          
      OLI_REC                  CHAR(103)  ;                /*Y2K*/              
   DCL                                                                          
      01 OLI_OMR  DEF OLI_REC ,                                                 
         02 KONTOR               CHAR(3)    ,                                   
         02 TERMID               CHAR(4)    ,                                   
         02 FNR                  PIC '(11)9',                                   
         02 REGTPK               CHAR(6)    ,                                   
         02 IÅR                  PIC '(4)9' ,  /*Y2K*/                          
         02 BLTYPE               CHAR(1)    ,                                   
         02 IART                 CHAR(1)    ,                                   
         02 KOMMNR1              PIC '(4)9' ,                                   
         02 AGIVNR               PIC '(3)9' ,                                   
         02 RAPPDATO             PIC '(8)9' ,  /*Y2K*/                          
         02 NAVN                 CHAR(25)   ,                                   
         02 INNTEKT              PIC '(7)9' ,                                   
         02 ETYPE                CHAR(1)    ,                                   
         02 MERKE                CHAR(1)    ,                                   
         02 DÅR                  PIC '(4)9' ,  /*Y2K*/                          
         02 KOMMNR2              PIC '(4)9' ,                                   
         02 BRUKERID             CHAR(4)    ,                                   
         02 FNR2                 PIC '(11)9',                                   
         02 INDEKS               PIC '9'    ;                                   
   DCL                                                                          
       DØDSÅR                  PIC '(4)9',     /*Y2K*/                          
       TYPE                    PIC '(1)9';                                      
   DCL                                                                          
      01 HDATO                   PIC '(8)9';   /*Y2K*/                          
   DCL                                                                          
      01 HDATO_REDEF DEF HDATO,                                                 
         02 ÅR                   PIC '(4)9',   /*Y2K*/                          
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9';                                    
   DCL                                                                          
      01 DATO                    PIC '(8)9';  /*Y2K*/                           
   DCL                                                                          
      01 DATO_REDEF DEF DATO,                                                   
         02 DAG                  PIC '(2)9',                                    
         02 MND                  PIC '(2)9',                                    
         02 ÅR                   PIC '(4)9';  /*Y2K*/                           
                                                                                
                                                                                
   DCL 1  TID,                                                                  
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */        
          2  TID2                          CHAR (3); /* MILL.SEK.     */        
   DCL TID_D          DEFINED   TID        CHAR (9);                            
                                                                                
                                                                                
      EXEC CICS DELAY INTERVAL(002);                                            
                                                                                
      TID_D             = TIME  ;                                               
      HDATO             = DATO_2000;         /*Y2K*/                            
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                                      
      DATO_REDEF.MND    = HDATO_REDEF.MND;                                      
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                                      
                                                                                
      OLI_OMR.KONTOR    = NISF.AVSENDER    ;                                    
      OLI_OMR.FNR       = NISF.FNR         ;                                    
      OLI_OMR.IÅR       = NIS.ÅR(I)        ;                                    
      OLI_OMR.BLTYPE    = NIS.TYPE(I)      ;                                    
      OLI_OMR.IART      = NIS.ART(I)       ;                                    
      OLI_OMR.KOMMNR1   = NIS.KOMMNR(I)    ;                                    
      OLI_OMR.AGIVNR    = NIS.AGIVKODE(I)  ;                                    
      OLI_OMR.RAPPDATO  = DATO             ; /*Y2K*/                            
      OLI_OMR.NAVN      = NISF.NAVN        ;                                    
                                                                                
      IF TYPE = 1 THEN                                                          
         OLI_OMR.DÅR    = DØDSÅR           ;                                    
      ELSE                                                                      
         OLI_OMR.DÅR    = 0                ;                                    
      OLI_OMR.TERMID    = DIV_PARAM_OMR.TERMINAL_NR ;                           
      OLI_OMR.REGTPK    = TID1             ;                                    
      OLI_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                                
      OLI_OMR.INNTEKT   = NIS.PG_INNTEKT(I);                                    
                                                                                
      OLI_OMR.ETYPE     = NIS.ETYPE(I)     ;                                    
      OLI_OMR.MERKE     = NIS.MERKE(I)     ;                                    
      OLI_OMR.INDEKS    = '1'              ;                                    
   /*                                                                           
                                                                                
      NYKKEL.KONTOR_N   = NISF.AVSENDER    ;                                    
      NYKKEL.FNR_N      = NISF.FNR         ;                                    
      NYKKEL.IÅR_N      = NIS.ÅR(I)        ;                                    
      NYKKEL.BLTYPE_N   = NIS.TYPE(I)      ;                                    
      NYKKEL.IART_N     = NIS.ART(I)       ;                                    
      NYKKEL.KOMMNR1_N  = NIS.KOMMNR(I)    ;                                    
      NYKKEL.AGIVNR_N   = NIS.AGIVKODE(I)  ;                                    
      NYKKEL.RAPPDATO_N = DATO             ;                                    
      NYKKEL.TERMID_N   = DIV_PARAM_OMR.TERMINAL_NR ;                           
      NYKKEL.REGTPK_N   = TID1             ;                                    
                                                                                
     */                                                                         
      EXEC CICS HANDLE CONDITION ERROR    (L126)             ;                  
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;                  
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (OLI_PEKER)                  
                                   FROM(OLI_REC ) RBA;                          
      GOTO ALT_OK;                                                              
                                                                                
    L126:                                                                       
      FEIL_MELD_NR                =    505 ;                                    
      FEIL_VED_LABEL              =   '126';                                    
      FATAL_FEIL                  =   '1'B ;                                    
                                                                                
    ALT_OK:                                                                     
                                                                                
                                                                                
  END SKRIV_OLINNTE;                                                            
                                                                                
                                                                                
  KONTROLL_PI_TYPE:                                                             
                  PROC (W02_BLTYPE,W02_ART);                                    
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SKRIVER OPPLYSNINGER UT PÅ R001.OLINNTE FOR BRUK VED UTSKRIFT */        
  /*    AV KONTROLLISTE.                                              */        
  /*    BLIR KALT OPP VED KORRIGERINGSRAPPORTER.                      */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*                                                          */                
  /*                                                                  */        
  /* **************************************************************** */        
     DCL W02_BLTYPE    CHAR (1);                                                
     DCL W02_ART       CHAR (1);                                                
                                                                                
                                                                                
     SELECT(W02_PI_TYPE);                                                       
                                                                                
        WHEN('B','C','D')                                                       
                                                                                
           DO;                                                                  
              W02_BLTYPE = 'B';                                                 
              IF W02_PI_TYPE = 'B' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'C' THEN                                      
                    W02_ART    = '2';                                           
                 ELSE                                                           
                    IF W02_PI_TYPE = 'D' THEN                                   
                       W02_ART    = '3';                                        
           END;                                                                 
                                                                                
        WHEN('E','F')                                                           
                                                                                
           DO;                                                                  
                                                                                
              W02_BLTYPE = 'C';                                                 
              IF W02_PI_TYPE = 'E' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'F' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        WHEN('H','I')                                                           
                                                                                
           DO;                                                                  
                                                                                
              W02_BLTYPE = 'D';                                                 
              IF W02_PI_TYPE = 'H' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'I' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        WHEN('J','K','L')                                                       
                                                                                
           DO;                                                                  
                                                                                
              W02_BLTYPE = 'O';                                                 
              IF W02_PI_TYPE = 'J' THEN                                         
                 W02_ART    = '4';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'K' THEN                                      
                    W02_ART    = '5';                                           
                 ELSE                                                           
                    IF W02_PI_TYPE = 'L' THEN                                   
                       W02_ART    = '6';                                        
           END;                                                                 
                                                                                
        WHEN('S','T')                                                           
                                                                                
           DO;                                                                  
                                                                                
              W02_BLTYPE = 'S';                                                 
              IF W02_PI_TYPE = 'S' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'T' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        WHEN('V','W')                                                           
                                                                                
           DO;                                                                  
                                                                                
              W02_BLTYPE = 'U';                                                 
              IF W02_PI_TYPE = 'V' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'W' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        OTHERWISE                                                               
           ;                                                                    
     END;                                                                       
                                                                                
                                                                                
   END KONTROLL_PI_TYPE;                                                        
                                                                                
                                                                                
  %INCLUDE R0019912;             /*  NUM-> CHAR                       */        
  %INCLUDE R0019905;             /*  F_ALDER                          */        
  %INCLUDE R0019947;             /*  ÅÅMMDD > ÅRDAGNR,ÅRDAGNR > ÅÅMMDD*/        
   /* %INCLUDE R0019957;       P900_NOR_DATA (FNR,TKNR)         */              
  %INCLUDE R0019995;             /*  KONV_FNR11_FNR13                 */        
  %INCLUDE R0018037;             /*  SKRIV_INNTEKT_TIL_DR             */        
                                                                                
                                                                                
 END R001I50;                                                                   
