 /*       SIST ENDRET 02/09-98 12.59.53 AV   SPA7339                  */00000000
 /*       SIST ENDRET 20/07-98 10.04.09 AV   JDA7339                  */00000010
 /*       SIST ENDRET 17/06-98 09.46.23 AV   RFA9991                  */00000020
 /*       SIST ENDRET 06/09-90 14.31.08 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 05/07-90 09.24.12 AV   DYBVIK                   */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /*    R0014580 - PROSEDYRE I PLI                                     */00000070
 /*    PROGRAMMERER: TRUDE SPONBERG MARS 1990                         */00000080
 /*HENSIKT:                                                           */00000090
 /*    BEREGNE GRUNNPENSJON ETTERLATT-UFØR  BOSATT UTLAND             */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTEPEN-  */00000120
 /*    SJONSBEREGNINGEN                                               */00000130
 /*    INCLUDES I R0014501                                            */00000140
 /*BRUK:                                                              */00000150
 /*    CALL BEREGN_GP_ETTERLATT_UP_UTLAND;                            */00000160
 /*                                                                   */00000170
 /* ***************************************************************** */00000180
                                                                        00000190
 /*------------------------------------------------------------------*/ 00000200
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00000210
 /* GRUNNPENSJON. BEREGNINGSREGLENES PUNKT 6.1.1.2 . TRUDE, 21.03.90 */ 00000220
 /*------------------------------------------------------------------*/ 00000230
                                                                        00000240
 BEREGN_GP_ETTERLATT_UP_UTLAND:                                         00000250
   PROC;                                                                00000260
 %SKIP(2);                                                              00000270
                                                                        00000280
 DCL HJ_DATO                     PIC'(8)9';       /* 2000_3 */          00000290
 DCL HJ_DATO_ÅR DEF HJ_DATO POS(1) PIC '9999';                          00000300
                                                                        00000310
                                                                        00000320
  DCL BOTID_EGEN   FIXED DEC (3) INIT(0),                               00000330
      BOTID_EK     FIXED DEC (3) INIT(0);                               00000340
                                                                        00000350
  DCL FAKTISK_BOTID_EGEN   FIXED DEC (3) INIT(0),                       00000360
      FAKTISK_BOTID_EK     FIXED DEC (3) INIT(0);                       00000370
                                                                        00000380
  DCL TT_MED_FREMT_ÅR_EGEN  FIXED DEC (3) INIT(0),                      00000390
      TT_MED_FREMT_ÅR_EK    FIXED DEC (3) INIT(0);                      00000400
                                                                        00000410
  DCL TT_ANV_GP    FIXED DEC (3) INIT(0);                               00000420
                                                                        00000430
  DCL GRUNNPENSJON  FIXED DEC (11,4) INIT(0);                           00000440
                                                                        00000450
  HJ_DATO = B02.DØDSDATO_ÅMD(BER_EK_IND);                               00000460
                                                                        00000470
  IF HJ_DATO_ÅR - FNR13_EK_R.ÅR_EK > 66 THEN                            00000480
     CALL REGN_TT_67_TIL_70_DØD;                                        00000490
                                                                        00000500
  BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                          00000510
                 B02.TT_FRAMT_VED_FRAVIK_10_1(BER_SØ_IND) +             00000520
                 B02.TT_FRAMT_DØD(BER_SØ_IND) +                         00000530
                ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);            00000540
                                                                        00000550
  IF BOTID_EGEN > 40   THEN                                             00000560
     BOTID_EGEN = 40;                                                   00000570
                                                                        00000580
                                                                        00000590
  TT_MED_FREMT_ÅR_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                  00000600
                       ((B02.TT_ETTER_1966(BER_SØ_IND) +                00000610
                         B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);          00000620
                                                                        00000630
                                                                        00000640
  DCL F67  PIC '9999';                                                  00000650
  DCL E66 PIC  '9999';                                                  00000660
  DCL FRAM PIC  '9999';                                                 00000670
  DCL F670 PIC  '9999';                                                 00000680
                                                                        00000690
                                                                        00000700
                                                                        00000710
       F67             = B02.TT_FØR_1967(BER_EK_IND) ;                  00000720
       F670 =            B02.TT_67_TIL_70(BER_EK_IND);                  00000730
       E66 =             B02.TT_ETTER_1966(BER_EK_IND);                 00000740
       FRAM =            B02.TT_FRAMT(BER_EK_IND);                      00000750
                                                                        00000760
  TT_MED_FREMT_ÅR_EK   = B02.TT_FØR_1967(BER_EK_IND) +                  00000770
                         B02.TT_67_TIL_70(BER_EK_IND) +                 00000780
                       ((B02.TT_ETTER_1966(BER_EK_IND) +                00000790
                         B02.TT_FRAMT(BER_EK_IND) + 11) / 12);          00000800
                                                                        00000810
  IF TT_MED_FREMT_ÅR_EGEN > 40  THEN                                    00000820
     TT_MED_FREMT_ÅR_EGEN = 40 ;                                        00000830
                                                                        00000840
  IF TT_MED_FREMT_ÅR_EK   > 40  THEN                                    00000850
     TT_MED_FREMT_ÅR_EK   = 40 ;                                        00000860
                                                                        00000870
  FAKTISK_BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                  00000880
                       ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);     00000890
  FAKTISK_BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                  00000900
                       ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);     00000910
                                                                        00000920
  IF FAKTISK_BOTID_EGEN > 40 THEN                                       00000930
     FAKTISK_BOTID_EGEN = 40;                                           00000940
                                                                        00000950
  IF FAKTISK_BOTID_EK   > 40 THEN                                       00000960
     FAKTISK_BOTID_EK   = 40;                                           00000970
                                                                        00000980
 /*IF TT_MED_FREMT_ÅR_EK    > 20  !      **** SKAL VÆRE 20 ÅRS BOTID */ 00000990
 /*  TT_MED_FREMT_ÅR_EGEN  > 20  THEN     ** TRUDE,060990           */  00001000
   IF FAKTISK_BOTID_EGEN    > 20  !                                     00001010
      FAKTISK_BOTID_EK     > 20  THEN                                   00001020
      DO;                                                               00001030
         IF TT_MED_FREMT_ÅR_EGEN > TT_MED_FREMT_ÅR_EK THEN              00001040
            TT_ANV_GP  = TT_MED_FREMT_ÅR_EGEN;                          00001050
         ELSE                                                           00001060
            TT_ANV_GP  = TT_MED_FREMT_ÅR_EK;                            00001070
                                                                        00001080
         B02.TT_ANV(BER_EK_IND) = TT_MED_FREMT_ÅR_EK; /*TRUDE,240890*/  00001090
         GO TO L100;                                                    00001100
      END;                                                              00001110
                                                                        00001120
  BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                          00001130
                ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);            00001140
                                                                        00001150
  IF BOTID_EK   > 40   THEN                                             00001160
     BOTID_EK   = 40;                                                   00001170
                                                                        00001180
  IF (B02.TRYGDET_DØD(BER_SØ_IND)    = 'J' !                            00001190
      B02.TRYGDET_DØD(BER_EK_IND)    = 'J')  &                          00001200
     (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND)    = 'J' !                        00001210
      B02.TRYGDET_3ÅR_DØD(BER_EK_IND)    = 'J') THEN                    00001220
   DO;                                                                  00001230
                                                                        00001240
      /*PUNKT 1.1 MINST 20 ÅR BOTID , SAMME REGLER SOM BOSATT(6.1.1.1)*/00001250
                                                                        00001260
      /* PUNKT 1.2 :  */                                                00001270
                                                                        00001280
                                                                        00001290
      IF  (BOTID_EGEN              >  9  &                              00001300
           BOTID_EGEN              < 20 ) !                             00001310
          (BOTID_EK                >  9  &                              00001320
           BOTID_EK                < 20 )  THEN                         00001330
         DO;                                                            00001340
            IF BOTID_EGEN          >=  BOTID_EK  THEN                   00001350
               TT_ANV_GP           =   BOTID_EGEN;                      00001360
            ELSE                                                        00001370
               TT_ANV_GP           = BOTID_EK  ;                        00001380
         B02.TT_ANV(BER_EK_IND) = BOTID_EK; /*TRUDE,240890*/            00001390
         END;                                                           00001400
   END;                                                                 00001410
                                                      /*PUNKT 2: */     00001420
                                                                        00001430
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001440
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                        00001450
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001460
       B02.TRYGDET_DØD(BER_EK_IND)      = 'J' ) THEN                    00001470
     DO;                                                                00001480
        IF FAKTISK_BOTID_EGEN > FAKTISK_BOTID_EK  THEN                  00001490
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001500
        ELSE                                                            00001510
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001520
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/     00001530
     END;                                                               00001540
                                                                        00001550
                                                       /*PUNKT 3: */    00001560
                                                                        00001570
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001580
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                        00001590
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001600
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                    00001610
     DO;                                                                00001620
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                 00001630
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001640
        ELSE                                                            00001650
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001660
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/     00001670
     END;                                                               00001680
                                                                        00001690
                                                                        00001700
                                                        /*PUNKT 4: */   00001710
                                                                        00001720
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                   00001730
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) = 'J') !                         00001740
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                         00001750
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                    00001760
     DO;                                                                00001770
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                 00001780
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                             00001790
        ELSE                                                            00001800
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                             00001810
        B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/     00001820
     END;                                                               00001830
                                                                        00001840
                                                                        00001850
                                              /*6.1.1.4 KONVENSJON   */ 00001860
                                                                        00001870
  IF B02.KONVENSJON(BER_SØ_IND) = 'J' THEN   /* DEN STØRSTE TT ??? */   00001880
   DO;                                                                  00001890
     IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                    00001900
        TT_ANV_GP          = FAKTISK_BOTID_EGEN;                        00001910
     ELSE                                                               00001920
        TT_ANV_GP          = FAKTISK_BOTID_EK  ;                        00001930
     B02.TT_ANV(BER_EK_IND) = FAKTISK_BOTID_EK; /*TRUDE,240890*/        00001940
   END;                                                                 00001950
                                                     /* PUNKT 1.3 :  */ 00001960
                                                                        00001970
 /*IF B02.ETTEPENS.PÅ_AVD (BER_SØ_IND)  >  BOTID_EK    THEN             00001980
                    TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND); ? */   00001990
                                                                        00002000
   IF B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) > 0   THEN                     00002010
     DO;                                                                00002020
       IF TT_ANV_GP < B02.ETTEPENS.PÅ_AVD(BER_SØ_IND) THEN              00002030
          TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);                  00002040
     B02.TT_ANV(BER_EK_IND) = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);          00002050
     END;                                                               00002060
 L100:                                                                  00002070
  IF  TT_ANV_GP  >  3  !                                                00002080
     (TT_ANV_GP  <  3  &                                                00002090
      B02.KONVENSJON(BER_SØ_IND)  = 'J') THEN                           00002100
          DO;                                                           00002110
            GP_UP                     = G * TT_ANV_GP / 40;             00002120
            GP_UP                     = (GRUNNPENSJON / 12) + 0.5;      00002130
            GP_UP                     = GRUNNPENSJON;                   00002140
            B02.TT_ANV(BER_SØ_IND)             = TT_ANV_GP;             00002150
          END;                                                          00002160
  ELSE                                                                  00002170
            GP_UP = 0;                                                  00002180
                                                                        00002190
        IF B02.YRKEPENS.YUG(BER_SØ_IND) > 0 THEN                        00002200
                                                                        00002210
           DO;                                                          00002220
              GP_UP      = G * UFGRAD * B02.TT_ANV(BER_SØ_IND) /        00002230
                           (100 * 40 * 12) + 0.5;                       00002240
                                                                        00002250
              GP_YP      = G * B02.YRKEPENS.YUG(BER_SØ_IND) /           00002260
                           (12 * 100 ) + 0.5;                           00002270
                                                                        00002280
              GP_EGEN    = GP_UP + GP_YP;                               00002290
                                                                        00002300
           END;                                                         00002310
                                                                        00002320
        ELSE                                                            00002330
          DO;                                                           00002340
            GP_EGEN = G * B02.UFØRPENS.UFG(BER_SØ_IND) *                00002350
                      B02.TT_ANV(BER_SØ_IND) / (100 * 40 * 12) + 0.5;   00002360
                                                                        00002370
            GP_UP = GP_EGEN;                                            00002380
          END;                                                          00002390
  /*  ********    IF TT_ANV_UP   > TT_ANV_AVD THEN                      00002400
                     TT_ANV_EP   = TT_ANV_UP;                           00002410
                                                                        00002420
                  ELSE                                                  00002430
                                                                        00002440
                  TT_ANV_EP   = TT_ANV_AVD;  *************** */         00002450
                                                                        00002460
        IF B02.YRKEPENS.YUG(BER_EK_IND) > 0 THEN                        00002470
 /* BYTTER UT TT_ANV_EP MED B02.TT_ANV .PENSJON UTL. TRUDE   */         00002480
           GP_EP = G * B02.TT_ANV(BER_SØ_IND) *                         00002490
                       (100 - B02.YRKEPENS.YUG(BER_EK_IND))             00002500
                       / (40 * 12 * 100)                  +             00002510
                       G * B02.YRKEPENS.YUG(BER_EK_IND)                 00002520
                       / (12 * 100) + 0.5;                              00002530
                                                                        00002540
        ELSE                                                            00002550
                                                                        00002560
           GP_EP = G * B02.TT_ANV(BER_SØ_IND) / (40 * 12) + 0.5;        00002570
  /* END;    ??? TRUDE 050990  */                                       00002580
                                                                        00002590
  IF B02.IKKE_GP(BER_SØ_IND)  = 'J' THEN                                00002600
    DO;                                                                 00002610
     GP_EP   = 0 ;                                                      00002620
     GP_UP   = 0 ;                                                      00002630
     GP_EGEN = 0 ;                                                      00002640
    END;                                                                00002650
                                                                        00002660
 /*------------------------------------------------------------------*/ 00002670
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */ 00002680
 /* TIL HIT. TRUDE                                                   */ 00002690
 /*------------------------------------------------------------------*/ 00002700
                                                                        00002710
   END BEREGN_GP_ETTERLATT_UP_UTLAND;                                   00002720
