 /*   SIST ENDRET PÅ PROD   2008.05.31 11.27.29 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.05.10 13.05.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.15.21 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.20.21 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.14 13.04.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.39.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.31.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.57.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.08.15  9.11.02 AV   JDA7339          */        
 /*       SIST ENDRET 07/08-98 08.40.12 AV   TSB7339                  */        
 /*       SIST ENDRET 29/05-98 11.04.28 AV   SPA7339                  */        
 /*       SIST ENDRET 13/05-98 15.02.32 AV   SPA7339                  */        
 /*       SIST ENDRET 06/05-98 09.59.10 AV   JDA7339                  */        
 /*       SIST ENDRET 14/01-98 15.53.59 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN VED VENTETRANSBEHANDLING.*/        
 /*                                                                   */        
 /*  PROGRAMMET LESER INN DATA FRA VENTETRANSBILDET.                  */        
 /*                                                                   */        
 /*  PROGRAMMETS TRANSKODER ER R048,R48A,R48B.                        */        
 /*                                                                   */        
 /*  PROGRAMMERER ROLF FARVIK, MAI 1983.                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */        
 /*    OM FNR ER ENDRET (R0019906).                                   */        
 /* ***************************************************************** */        
 R001048:PROC (COMMAREA_PEKER) OPTIONS(MAIN);                                   
                                                                                
      %INCLUDE S00101  ;   /*  BL.MAPSETTENE   (BASED) */                       
                                                                                
 %PAGE;                                                                         
      %INCLUDE S001V0;     /*  VENTEMAPSET1    (BASED) */                       
 /*  ALLE MAPPER ER SAMMLET I S001V0     SATISH 27.04.98 */                     
 /*   %INCLUDE S001V2;         VENTEMAPSET2    (BASED) */                       
                                                                                
 /*    %INCLUDE S001V3;        VENTEMAPSET3    (BASED) */                       
                                                                                
      %INCLUDE P0012001;   /*  TRANS_SEGM_OMR  (BASED) */                       
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */                    
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                            
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */                       
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */                      
   /* %INCLUDE P0019959;   /*  OMRAADE FOR FUNKTAB      */                      
      %INCLUDE P0019924;    /*  G_V_TAB                  */                     
      %INCLUDE P0019925;    /*  G_TAB                    */                     
   DCL                                                                          
       MAP_MELDING              CHAR(78)      INIT((78)' '),                    
       1  FEIL_STRUC,                                                           
          2  FEIL_NR               FIXED DEC(5),                                
          2  FEIL_MELDING          CHAR     (78),                               
          2  KOM_OMR_PEKER         POINTER;                                     
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
    /* NULLET UT ETTER KONF. MED PATHAK 10.08.2000 MARTIN */                    
    /* DCL PLIXOPT CHAR(13) VAR STATIC EXTERNAL INIT(                           
                                                   'NOSPIE NOSTAE')             
    /* NULLET UT ETTER KONF. MED PATHAK 10.08.2000 MARTIN */                    
                                                                                
       DCL                                                                      
         ( ADDR,CSTG,LOW,STG,SUBSTR,VERIFY,NULL)  BUILTIN;                      
       DCL  SYSPRINT      EXTERNAL FILE;                                        
       DCL                                                                      
         PLITDLI ENTRY,                                                         
              BMSMAPBR  PTR;                                                    
                                                                                
    /* ************************************************************** */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
       DCL                                                                      
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );           
                                                                                
       DCL                                                                      
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )               
                                                             POINTER,           
           CURSOR_POS      FIXED BIN(15) INIT(-1),                              
                                                                                
           FEILKODE              CHAR(4),                                       
           DSNAVN                CHAR(8);                                       
       DCL LINJENR               PIC '(2)9';                                    
                                                                                
       DCL ANTALL_LEST           FIXED DEC (3);                                 
                                                                                
       DCL W_REGDATO             PIC '(6)9';                                    
                                                                                
       DCL W_REGDATO_CHAR        CHAR(6);                                       
                                                                                
       DCL W_REGDATO_NUM DEF W_REGDATO_CHAR POS(1) PIC '(6)9';                  
                                                                                
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);                   
                                                                                
       DCL BEH_KODE              CHAR (1);                                      
                                                                                
    /* DCL W01_IDENT             CHAR (4); */                                   
   DCL 01 W01_IDENT_DEF,                                                        
          02 W01_IDENT_1_4                  CHAR (4),                           
          02 W01_IDENT_5                    CHAR (1),                           
       01 W01_IDENT DEF W01_IDENT_DEF      CHAR(05) ;                           
                                                                                
       DCL IDENT_PEKER           POINTER ;                                      
       DCL IDENT_BIT             BIT  (32) BASED (IDENT_PEKER);                 
                                                                                
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                           
                                                                                
       DCL W_BLTYPE              CHAR (2);                                      
                                                                                
       DCL TRANS_KODE_VED_START  CHAR (4);                                      
                                                                                
       DCL PIC_4                 PIC '(4)9',                                    
           PIC_6                 PIC '(6)9',                                    
           PIC_8                 PIC '(8)9',                                    
           PIC_8_2               PIC '(8)9',                                    
           PIC_11                PIC '(11)9',                                   
           K                     FIXED BIN(15); /* BRUKES I 52XX */             
       DCL GRUNN_OMR1            CHAR      (1440);                              
       DCL GRUNN_OMR2            CHAR      (1440);                              
       DCL GRUNN_IDENT           CHAR      ( 8);                                
                                                                                
       DCL 1 FNR_REG,                                                           
             2 FNR1              FIXED DEC(11),                                 
             2 FNR2              FIXED DEC(11),                                 
             2 BRUKERID          CHAR     ( 4);                                 
                                                                                
    /* ************************************************************** */        
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01                       UNALIGNED,                              
              2   MER_DATA                    BIT  (1)   INIT ('1'B),           
              2   BARN_IKKE_LEST              BIT  (1)   INIT ('1'B),           
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),           
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),           
              2   TO_GRUNNBYP_LEST            BIT  (1)   INIT ('0'B),           
              2   GRUNNBYP_IKKE_LEST          BIT  (1)   INIT ('1'B),           
              2   NAVN                        CHAR (25)  INIT ((25)' '),        
              2   VIRK_DATO_ÅMD          PIC '99999999' INIT ( 0  ),            
              2   I                    FIXED  BIN  (15)  INIT (1),              
              2   J                    FIXED  BIN  (15)  INIT (1);              
                                                                                
    /* ************************************************************** */        
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_DLI_PARAM,                                                    
              2   W02_GET                 CHAR (4)   INIT ('    '),             
              2   W02_GHU                 CHAR (4)   INIT('GHU '),              
              2   W02_DLET                CHAR (4)   INIT('DLET'),              
              2   W02_GU                  CHAR (4)   INIT ('GU  '),             
              2   W02_GN                  CHAR (4)   INIT ('GN  '),             
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),             
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                  
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                  
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),                  
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');          
                                                                                
       DCL    W01_IO                CHAR (380)       INIT ( (380) ' ' ),        
              W01_HJELPE_IO         CHAR (380) BASED (W01_HJELPE_PEKER);        
                                                                                
    /* ************************************************************** */        
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
    /* ************************************************************** */        
                                                                                
       DCL    SSA_UQUAL_ROT      UNALIGNED    CHAR (9) INIT                     
                                                      ('VT0PERSN ');            
                                                                                
                                                                                
       DCL 1  SSA1_TRANHIST_CMD               ,                                 
              2    HDEL                       CHAR (17)  INIT                   
                                                ('TRANHIST(GRBLKODE'),          
              2    REL_OP_1                   CHAR (2)   INIT ('^='),           
              2    GRBLKODE                   CHAR (2)   INIT ('US'),           
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
                                                                                
                                                                                
       DCL 1  SSA1_VT0PERSN          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('VT0PERSN(FNR     '),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
              2    PKEY               FIXED   DEC  (11),                        
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
       DCL 1  SSA1_TRANHIST          UNALIGNED,                                 
              2    HDEL                       CHAR (19)  INIT                   
                                               ('TRANHIST*P(REGDATO '),         
              2    REL_OP                     CHAR (2)   INIT (' <'),           
              2    REGDATO         FIXED    DEC  (8)   INIT (99999999),         
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
       DCL 1  SSA3_TRANHIST          UNALIGNED,                                 
              2    HDEL                       CHAR (17) INIT                    
                                                ('TRANHIST(VTPBLKOD'),          
              2    REL_OP                     CHAR (2)  INIT (' ='),            
              2    VTP_KEY            FIXED   DEC  (8)  INIT ( 0 ),             
              2    BLTYPE                     CHAR (2)  INIT ('  '),            
              2    HP                         CHAR (1)  INIT (')');             
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */        
    /* ************************************************************** */        
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */        
    DCL 1 B01 BASED(B01_PEKER),%INCLUDE P0019921;                               
    DCL 1 B02 BASED(B02_PEKER),%INCLUDE P0019921;                               
    DCL 1 VT1 BASED(VT1_PCB_PEKER),%INCLUDE P0012003; /* PCB */                 
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
    /*     ---------------------------------------------------        */        
    /*                                                                */        
    /*                                                                */        
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */        
    /*                                                                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
 /*ON ERROR SNAP BEGIN       ;                                                  
      ON ERROR SYSTEM        ;                                                  
      ONKODE=ONCODE          ;                                                  
      FEILKODE   = ONK       ;                                                  
      DSNAVN     = EIBDS     ;                                                  
      GO TO FEILBEH          ;                                                  
   END;*/                                                                       
                                                                                
    /* ============================================================== */        
    EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                                  
                                                                                
    ALLOCATE /* HER KAN VI IKKE BRUKE PARANTESER !! */                          
       B01,                                                                     
       B02,                                                                     
       G_TAB_RE,                                                                
       GV_TAB_RE,                                                               
       TRANS_SEGM_OMR ;                                                         
                                                                                
  TRANS_SEGM_OMR                        = ''                           ;        
  TRANS_KODE_VED_START                  = TRANS_OPPL_OMR.TRANSKODE;             
  KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR)   ;        
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR) ;        
  KOM_OMR.PEKER_LISTE.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR)      ;        
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);        
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR)  ;        
  KOM_OMR.GV_PEKER                      = ADDR (GRUNN_OMR1           ) ;        
  KOM_OMR.G_PEKER                       = ADDR (GRUNN_OMR2           ) ;        
  ATK_KOM_PTR                          =  ADDR(KOM_OMR.ATK_COM_OMR);            
  IF FEIL_MELD_NR   = 0 THEN  /* AB08.09.01*/                                   
  DIV_PARAM_OMR.PROGRAM_ID = 'R0010480';                                        
  DB_STATUS_KODE    = '  '                         ;                            
  ANTALL_LEST       = 0                            ;                            
  FEIL_MELD_NR      = 0                            ;                            
  GV_TAB_RE         =  ''                          ;                            
  G_TAB_RE          =  ''                          ;                            
  B01               =  ''                          ;                            
  B02               =  ''                          ;                            
  DIV_PERIODE       =  ''                          ;  /*HL*/                    
                                                                                
    GRUNN_IDENT                     = 'P0019924';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                              
                                                                                
    GRUNN_IDENT                     = 'P0019925';                               
                                                                                
    CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                              
                                                                                
    FNR_REG.BRUKERID  =  DIV_PARAM_OMR.CICS_IND;                                
                                                                                
   IF SUBSTR(CICS_NAVN,1,4) = 'HELP'  THEN                                      
            SSA1_TRANHIST_CMD.REL_OP_1 = ' =' ;                                 
                                                                                
                                                                                
  /**********    H O V E D S T Y R I N G   S T A R T   *************/           
                                                                                
  IF TRANSKODE = 'R048' THEN                                                    
                                                                                
     /***  LESER INN DATA FRA VENTEMENYBILDET.   *************/                 
                                                                                
     DO;                                                                        
        EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')                     
                                                        SET(BMSMAPBR);          
        B02.STATUS.VIRK_DATO_ÅMD(13) = 0;                                       
        B02.STATUS.DØDSDATO_ÅMD(13) = 0;                                        
     END;                                                                       
  ELSE                                                                          
     IF TRANSKODE = 'R48A' THEN                                                 
        DO;                                                                     
           ALLOCATE S001481O;                                                   
           ALLOCATE S001481I;                                                   
           EXEC CICS LOAD PROGRAM('S001V03');                                   
           S001481O.CICS_INFOO = CICS_NAVN;                                     
           S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                    
                                                                                
           IF B02.STATUS.DØDSDATO_ÅMD(13) > 0 THEN                              
              DO;                                                               
                 S001481O.REGDATOO  =                                           
                            KONV_HÅMD_DMÅ(B02.STATUS.DØDSDATO_ÅMD(13));         
                 S001481I.REGDATOI  = S001481O.REGDATOO;                        
                 S001481I.REGDATOL  = 1;                                        
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                 S001481O.VIRKDATOO =                                           
                          KONV_HÅMD_MÅ(B02.STATUS.VIRK_DATO_ÅMD(13));           
                 S001481I.VIRKDATOI = S001481O.VIRKDATOO               ;        
                 S001481I.BLTYPEI   = TRANS_OPPL_OMR.BLANKETTYPE       ;        
                 S001481I.VIRKDATOL = 1;                                        
              END;                                                              
        END;                                                                    
     ELSE                                                                       
        IF TRANSKODE = 'R48B' THEN                                              
           DO;                                                                  
              ALLOCATE S001481O;                                                
              ALLOCATE S001481I;                                                
              EXEC CICS LOAD PROGRAM('S001V03');                                
              S001481O.CICS_INFOO = CICS_NAVN;                                  
              S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                 
              S001481O.FNRO     = FØDSNUMMER;                                   
              S001481I.FNRI     = S001481O.FNRO;                                
              S001481I.FNRL     = 1;                                            
           END;                                                                 
                                                                                
  IF S001481I.RETURL > 0 THEN                                                   
     DO;                                                                        
        FUNKSJONSKODE = S001481I.RETURI;                                        
        CALL OVER_OG_UT(FUNKSJONSKODE);                                         
     END;                                                                       
                                                                                
  FEILMELDING_SATT = '1'B;                                                      
  W01.MER_DATA     = '1'B;                                                      
                                                                                
  IF S001481I.FNRL > 0 THEN                                                     
     DO;                                                                        
        CALL FNR_BEHANDLING;                                                    
                                                                                
        IF FEIL_MELD_NR > 0 !                                                   
           FEILMELDING_SATT THEN                                                
           DO;                                                                  
                                                                                
              CALL DATABASE('CLOSE');   /* ENDRET 16.5.88 BRITT */              
                                        /* PGA. CICS 1.7  */                    
              GO TO L999;                                                       
           END;                                                                 
                                                                                
                                                                                
        /***  BYGGER OPP NØKKEL FOR BASELESING.  ***/                           
                                                                                
                                                                                
        TRANS_OPPL_OMR.FØDSNUMMER      = SSA1_VT0PERSN.PKEY;                    
        TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD   = (99999999 -                        
                                               SSA3_TRANHIST.VTP_KEY);          
        TRANS_OPPL_OMR.BLANKETTYPE     = W_BLTYPE;                              
        SSA3_TRANHIST.BLTYPE           = W_BLTYPE;                              
     END;                                                                       
                                                                                
  ELSE                                                                          
     IF S001481I.REGDATOL > 0 THEN                                              
        DO;                                                                     
           CALL REGDATO_BEHANDLING;                                             
                                                                                
           IF FEIL_MELD_NR > 0 THEN                                             
              GO TO L999;                                                       
              CALL DATABASE('CLOSE');   /* ENDRET 16.5.88 BRITT */              
                                        /* PGA. CICS 1.7  */                    
           IF FEIL_MELD_NR > 0 !                                                
              FEILMELDING_SATT THEN                                             
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
                                                                                
                                                                                
           TRANSKODE  = 'R48B'    ;                                             
           FØDSNUMMER = SEARCH_FNR;                                             
                                                                                
           GO TO L999;                                                          
        END;                                                                    
                                                                                
     ELSE                                                                       
        IF S001481I.VIRKDATOL > 0 THEN                                          
           DO;                                                                  
              CALL VIRKDATO_BEHANDLING;                                         
              IF FEIL_MELD_NR > 0 THEN                                          
                 GO TO L999;                                                    
                                                                                
              CALL DATABASE('CLOSE');   /* ENDRET 16.5.88 BRITT */              
                                        /* PGA. CICS 1.7  */                    
              IF FEIL_MELD_NR > 0 !                                             
                 FEILMELDING_SATT THEN                                          
                 DO;                                                            
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
              TRANSKODE  = 'R48B';                                              
              FØDSNUMMER = SEARCH_FNR;                                          
                                                                                
              GO TO L999;                                                       
           END;                                                                 
        ELSE                                                                    
           DO;                                                                  
              MAP_MELDING        = 'EN AV FELTENE MÅ UTFYLLES';                 
              FEILMELDING_SATT   = '1'B;                                        
              S001481I.FNRL      = -1;       /* CURSOR POS */                   
              S001481O.MELDINGO    = MAP_MELDING;                               
              S001481O.CICS_INFOO  = CICS_NAVN;                                 
              S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                 
              EXEC CICS SEND MAP('S001481')                                     
                             MAPSET('S001V03') CURSOR ERASE;                    
              GO TO L999;                                                       
           END;                                                                 
                                                                                
                                                                                
                                                                                
  /***  ÅPNER VT_BASEN,HVIS DEN ER LUKKET.        *********/                    
                                                                                
                                                                                
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                         
     DO;                                                                        
      CALL DATABASE('OPEN');                                                    
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                                 
     END;                                                                       
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
                                                                                
  /***  FLYTTER BASEOPPLYSNINGER OVER                                           
                                  I BLANKETT-OMR.            ***/               
                                                                                
  CALL  FLYTT_BASEDATA_TIL_BILDE_OMR;                                           
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
                                                                                
                                                                                
                                                                                
  /*** LUKKER VT_BASEN                            *********/                    
                                                                                
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                         
      CALL DATABASE('OPEN');                                                    
  ELSE                                                                          
      CALL DATABASE('CLOSE');                                                   
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
     DO;                                                                        
                                                                                
        GO TO L999;                                                             
     END;                                                                       
                                                                                
                                                                                
  CALL VELG_BEHANDLINGSKODE;                                                    
                                                                                
                                                                                
 L999:                                                                          
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     DO;                                                                        
       GO TO FEILBEH;                                                           
     END;                                                                       
                                                                                
                                                                                
                                                                                
  EXEC CICS XCTL PROGRAM('R0010480')                                            
                                       COMMAREA(KOM_OMR);                       
                                                                                
                                                                                
                                                                                
  /**********    H O V E D S T Y R I N G   S L U T T   *************/           
                                                                                
                                                                                
  FNR_BEHANDLING:                                                               
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    BYGGER OPP SKJÆRMBILDE FOR ØNSKET FØDSELSNUMMER.              */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL FNR_BEHANDLING;                                          */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
   FEILMELDING_SATT = '1'B;                                                     
                                                                                
   DO UNTIL (^FEILMELDING_SATT);                                                
      FEILMELDING_SATT = '0'B;                                                  
                                                                                
      CALL SJEKK_FNR;                                                           
                                                                                
   END;                                                                         
                                                                                
   SSA1_VT0PERSN.PKEY = PIC_11;                                                 
                                                                                
   ALLOCATE S001482O;                                                           
   EXEC CICS LOAD PROGRAM('S001V03');                                           
   S001482O.CICS_INFOO = CICS_NAVN;                                             
   S001482O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                            
   /***  LESER ALLE FOREKOMSTENE I VT-BASEN   *********/                        
   /***  MED ØNSKET FØDSELSNUMMER.            *********/                        
                                                                                
   LINJENR     = 0;                                                             
   ANTALL_LEST = 0;                                                             
                                                                                
                                                                                
  /***  ÅPNER VT_BASEN                            *********/                    
                                                                                
                                                                                
   IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                        
       CALL DATABASE('OPEN');                                                   
   ELSE                                                                         
       UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                                
                                                                                
                                                                                
   IF FEIL_MELD_NR > 0   THEN                                                   
          GO TO L999;                                                           
                                                                                
   DO WHILE (LINJENR = 0);                                                      
                                                                                
      CALL BLANKSTILL_VENTETRANS_LINJE;                                         
      CALL BYGG_VENTEBILDE_OPPL_FNR;                                            
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
           DO;                                                                  
                                                                                
              GO TO RETUR;                                                      
           END;                                                                 
      ELSE                                                                      
         IF FEILMELDING_SATT   THEN                                             
           DO;                                                                  
                                                                                
              GO TO RETUR;                                                      
           END;                                                                 
                                                                                
      IF LINJENR > 0 THEN                                                       
         DO;                                                                    
            /*** LUKKER VT_BASEN                            *********/          
                                                                                
            CALL DATABASE('CLOSE');                                             
                                                                                
            IF FEIL_MELD_NR > 0   THEN                                          
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
         END;                                                                   
                                                                                
                                                                                
      /***  SKRIVER UT VENTETRANSBILDET MED  DATA.**/                           
                                                                                
      S001482I.FNRL      = 0 ; /* CURSOR POS NULLES*/                           
      S001482I.LINJENRL  = -1; /* CURSOR POS */                                 
                                                                                
      EXEC CICS SEND MAP('S001482')                                             
                               MAPSET('S001V03')  CURSOR ERASE;                 
                                                                                
      CALL SSA_BEHANDLING;                                                      
                                                                                
   END;                                                                         
  RETUR:                                                                        
                                                                                
                                                                                
                                                                                
  END FNR_BEHANDLING;                                                           
                                                                                
                                                                                
                                                                                
 SJEKK_FNR:                                                                     
   PROC;                                                                        
     IF ^F_NUMERISK(S001481I.FNRI) THEN                                         
        DO;                                                                     
           MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';           
           FEILMELDING_SATT   = '1'B;                                           
           S001481I.FNRL      = -1; /* CURSOR POS       */                      
           S001481O.MELDINGO  = MAP_MELDING;                                    
           S001481O.CICS_INFOO  = CICS_NAVN;                                    
           S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                    
           EXEC CICS SEND MAP('S001481')                                        
                                     MAPSET('S001V03')ERASE CURSOR;             
                                                                                
           /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/            
                                                                                
           EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')                  
                                                        SET(BMSMAPBR);          
           IF S001481I.RETURL > 0 THEN                                          
              DO;                                                               
                 FUNKSJONSKODE = S001481I.RETURI;                               
                                                                                
                 CALL OVER_OG_UT(FUNKSJONSKODE);                                
                                                                                
              END;                                                              
           GO TO RETUR;                                                         
        END;                                                                    
                                                                                
     ELSE                                                                       
        IF ^F_GYLDIG_FNR(S001481O.FNRO) THEN  /* FNRO ER PIC'(11)9' */          
           DO;                                                                  
              MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                            
              FEILMELDING_SATT   = '1'B;                                        
              S001481I.FNRL      = -1; /* CURSOR POS       */                   
              S001481O.FNRO      = S001481I.FNRI;                               
              S001481O.MELDINGO  = MAP_MELDING;                                 
              S001481O.CICS_INFOO = CICS_NAVN ;                                 
              S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                 
              EXEC CICS SEND MAP('S001481')                                     
                                     MAPSET('S001V03')ERASE CURSOR;             
                                                                                
              /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/         
                                                                                
              EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')               
                                                        SET(BMSMAPBR);          
              IF S001481I.RETURL > 0 THEN                                       
                 DO;                                                            
                    FUNKSJONSKODE = S001481I.RETURI;                            
                                                                                
                    CALL OVER_OG_UT(FUNKSJONSKODE);                             
                                                                                
                 END;                                                           
              GO TO RETUR;                                                      
           END;                                                                 
                                                                                
     ELSE                                                                       
        DO;                                                                     
           FNR_REG.FNR1 = S001481O.FNRO;                                        
                                                                                
           EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);                
                                                                                
           IF FNR_REG.FNR2 > 0 THEN                                             
              DO;                                                               
                 MAP_MELDING = S001481I.FNRI !!                                 
                           ' ER ET FØDSELSNUMMER SOM ER ENDRET' !!              
                                                       ' TRYKK ENTER!';         
                 S001481O.FNRO      = FNR_REG.FNR2;                             
                 S001481O.MELDINGO  = MAP_MELDING;                              
                 S001481O.CICS_INFOO = CICS_NAVN ;                              
                 S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;              
                 EXEC CICS SEND MAP('S001481') MAPSET('S001V03')ERASE;          
                                                                                
                 GO TO RETUR;                                                   
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                 SEARCH_FNR = S001481O.FNRO;                                    
                 PIC_11     = SEARCH_FNR;                                       
                 IF F_KJØNN(PIC_11) = 'K' THEN                                  
                    SØKER_IND = 1;                                              
                 ELSE                                                           
                    SØKER_IND = 2;                                              
              END;                                                              
       END;                                                                     
 RETUR:                                                                         
 END SJEKK_FNR;                                                                 
                                                                                
                                                                                
                                                                                
 BYGG_VENTEBILDE_OPPL_FNR:                                                      
   PROC;                                                                        
                                                                                
    IF ANTALL_LEST  < 15 THEN                                                   
       DO;                                                                      
          W02_GET      = W02_GU;                                                
          CALL P005_LES_ROT_QUAL;                                               
                                                                                
          IF W01.MER_DATA THEN                                                  
             DO;                                                                
                                                                                
                SUBSTR (ADDR            (B02.RF0PERSN (14))                     
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;        
                                                                                
                S001482O.FNRO            = PIC_11;                              
                S001482O.NAVNO           = B02.RF0PERSN (14).NAVN;              
                S001482O.TKNRO           = B02.RF0PERSN (14).TKNR;              
                S001482O.SPRÅKO          = B02.RF0PERSN (14).SPRÅK;             
                S001482O.FUNKSJONSKODEO  = ' ';                                 
                S001482O.DUMMYO          = ' ';                                 
                S001482O.CICS_INFOO      = CICS_NAVN;                           
                S001482O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;               
                CALL KONTROLL_ACF2_TKNR;                                        
                IF FEIL_MELD_NR > 0 THEN                                        
                 GO TO L999;                                                    
             END;                                                               
          ANTALL_LEST  = 1;                                                     
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          ANTALL_LEST  = 1;                                                     
                                                                                
          CALL FLYTT_BASEOPPL_TIL_BL_OMR_FNR;                                   
                                                                                
          ANTALL_LEST  = ANTALL_LEST + 1;                                       
       END;                                                                     
                                                                                
    DO WHILE(W01.MER_DATA &                                                     
                           ANTALL_LEST < 15);                                   
                                                                                
                                                                                
       /*******    LES VENTE_BASE   *********/                                  
                                                                                
       CALL P020_LES_NESTE_TRANHIST;                                            
                                                                                
       IF W01.MER_DATA     THEN                                                 
          DO;                                                                   
             SUBSTR (ADDR                (TRANHIST)                             
                     ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;             
                                                                                
             CALL FLYTT_BASEOPPL_TIL_BL_OMR_FNR;                                
                                                                                
                                                                                
             ANTALL_LEST = ANTALL_LEST + 1;                                     
          END;                                                                  
    END;                                                                        
                                                                                
    IF    ANTALL_LEST > 14 THEN                                                 
          DO;                                                                   
             /*******    LES VENTE_BASE   *********/                            
                                                                                
             CALL P020_LES_NESTE_TRANHIST;                                      
                                                                                
             IF W01.MER_DATA     THEN                                           
                DO;                                                             
                   SUBSTR (ADDR                (TRANHIST)                       
                          ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;        
                   MAP_MELDING =                                                
            'FLERE EN 14 TRANSAKSJONER.TRYKK ENTER ELLER VELG LINJENR.';        
                                                                                
                   S001482O.MELDING6O = MAP_MELDING;                            
                                                                                
                END;                                                            
             ELSE                                                               
                ANTALL_LEST = 14;                                               
          END;                                                                  
                                                                                
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                                    
                          ANTALL_LEST = 1 THEN                                  
          DO;                                                                   
             FEILMELDING_SATT   = '1'B;                                         
             IF B02.STATUS.VIRK_DATO_ÅMD(13) > 0 !                              
                B02.STATUS.DØDSDATO_ÅMD(13) > 0 THEN                            
                TRANSKODE = 'R48A';                                             
             ELSE                                                               
                DO;                                                             
                   MAP_MELDING =                                                
                        'PERSONEN MED FØDSELSNUMMER: ' !! PIC_11 !!             
                                ' HAR IKKE FLERE VENTETRANSAKSJONER ';          
                   ALLOCATE S001481O;                                           
                   ALLOCATE S001481I;                                           
                                                                                
                   EXEC CICS LOAD PROGRAM('S001V03');                           
                                                                                
                   S001481I.FNRL      = -1; /* CURSOR POS       */              
                   S001481O.FNRO      = PIC_11;                                 
                   S001481O.MELDINGO  = MAP_MELDING;                            
                   S001481O.CICS_INFOO = CICS_NAVN  ;                           
                   S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;            
                                                                                
                   EXEC CICS SEND MAP('S001481')                                
                                      MAPSET('S001V03') CURSOR ERASE;           
                                                                                
                   TRANSKODE = 'R048';                                          
                END;                                                            
          END;                                                                  
                                                                                
  END BYGG_VENTEBILDE_OPPL_FNR;                                                 
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  FLYTT_BASEOPPL_TIL_BL_OMR_FNR: PROC;                                          
   /* ANTALL_LEST   TRANSER */                                                  
         S001482O.RDATOO(ANTALL_LEST)  = KONV_HÅMD_DMÅ(                         
                           TRANHIST.REGDATO_ÅMD);                               
         S001482O.BLTO(ANTALL_LEST)   = TRANHIST.GRBLKODE;                      
         S001482O.VDATOO(ANTALL_LEST)  =                                        
                           KONV_HÅMD_MÅ(TRANHIST.VIRK_DATO_ÅMD);                
                                                                                
  END FLYTT_BASEOPPL_TIL_BL_OMR_FNR;                                            
                                                                                
                                                                                
  BYGG_SSA_FNR: PROC;                                                           
    /* LINJENR PLUKKET FRA BILDE  */                                            
    SSA1_TRANHIST.REGDATO =                                                     
                       KONV_ÅMD_HÅMD(S001482O.RDATOO(LINJENR));                 
    W_BLTYPE           =    S001482O.BLTO(LINJENR);                             
                                                                                
   SSA3_TRANHIST.VTP_KEY   = 99999999 - KONV_MÅ_HÅMD(                           
                                      S001482O.VDATOO(LINJENR));                
  END BYGG_SSA_FNR;                                                             
                                                                                
                                                                                
                                                                                
  REGDATO_BEHANDLING:                                                           
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    BYGGER OPP SKJÆRMBILDE MED PERSONER SOM ER REGISTRERT         */        
  /*    FØR EN OPPGITT REGDATO.                                       */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL REGDATO_BEHANDLING;                                      */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
  FEILMELDING_SATT = '1'B;                                                      
  DO UNTIL (^FEILMELDING_SATT);                                                 
     FEILMELDING_SATT = '0'B;                                                   
     CALL SJEKK_REGDATO1;                                                       
  END;                                                                          
                                                                                
  ALLOCATE S001483O;                                                            
  EXEC CICS LOAD PROGRAM('S001V03');                                            
  S001483O.CICS_INFOO = CICS_NAVN  ;                                            
  S001483O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                             
  /***  LESER ALLE FOREKOMSTENE                                                 
                                 I VT-BASEN     ********/                       
  /***  MED REGDATO                                                             
                                  ETTER OPPGITT DATO.        ********/          
                                                                                
  SSA1_TRANHIST.REGDATO = PIC_8;                                                
                                                                                
  LINJENR     = 0;                                                              
  ANTALL_LEST = 0;                                                              
                                                                                
                                                                                
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                         
      CALL DATABASE('OPEN');                                                    
  ELSE                                                                          
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                                 
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
     DO;                                                                        
                                                                                
        GO TO L999;                                                             
     END;                                                                       
                                                                                
                                                                                
  DO WHILE (LINJENR = 0);                                                       
                                                                                
      /***  ÅPNER VT_BASEN                            *********/                
                                                                                
     CALL BYGG_VENTEBILDE_OPPL_REGDATO;                                         
     IF FEIL_MELD_NR > 0 THEN                                                   
        DO;                                                                     
           GO TO RETUR;                                                         
        END;                                                                    
     ELSE                                                                       
        IF FEILMELDING_SATT   THEN                                              
           GO TO RETUR;                                                         
                                                                                
                                                                                
     IF LINJENR > 0 THEN                                                        
        DO;                                                                     
           /***  LUKKER VT_BASEN                            *********/          
                                                                                
           CALL DATABASE('CLOSE');                                              
                                                                                
           IF FEIL_MELD_NR > 0   THEN                                           
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
        END;                                                                    
                                                                                
     S001483I.RDATOI    = PIC_6;                                                
     S001483I.TEKST1I   = 'REGDATO FØR :';                                      
     S001483I.TEKST2I   = LOW(15);                                              
     S001483I.LINJENRL  = -1; /* CURSOR POS */                                  
                                                                                
     /***  SKRIVER UT VENTETRANSBILDET MED DATA.**/                             
                                                                                
                                                                                
     EXEC CICS SEND MAP('S001483')                                              
                               MAPSET('S001V03') CURSOR ERASE;                  
                                                                                
     CALL SEARCH_FNR_BEHANDLING;                                                
                                                                                
  END;                                                                          
                                                                                
  RETUR:                                                                        
                                                                                
  END REGDATO_BEHANDLING;                                                       
                                                                                
                                                                                
                                                                                
 SJEKK_REGDATO1:                                                                
  PROC;                                                                         
      IF ^ F_NUMERISK(S001481I.REGDATOI) THEN                                   
         DO;                                                                    
            MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I REGDATO';                
            FEILMELDING_SATT          = '1'B;                                   
            S001481I.REGDATOL         = -1; /* CURSOR POS */                    
            S001481I.FNRL             =  0; /* CURSOR POS NULLES */             
            S001481O.REGDATOA         = 'I';                                    
            S001481O.MELDINGO         = MAP_MELDING;                            
            S001481O.CICS_INFOO       = CICS_NAVN ;                             
            S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                   
            EXEC CICS SEND MAP('S001481')                                       
                                   MAPSET('S001V03')ERASE CURSOR;               
                                                                                
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/           
                                                                                
            EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')                 
                                                        SET(BMSMAPBR);          
            IF S001481I.RETURL > 0 THEN                                         
               DO;                                                              
                  FUNKSJONSKODE = S001481I.RETURI;                              
                                                                                
                  CALL OVER_OG_UT(FUNKSJONSKODE);                               
                                                                                
               END;                                                             
            GO TO RETUR;                                                        
         END;                                                                   
      ELSE                                                                      
         IF ^F_GYLDIG_DATO(KONV_DMÅ_HÅMD(S001481O.REGDATOO)) THEN               
  /*     IF ^F_GYLDIG_DATO_MHÅ(S001481O.REGDATOO) THEN   2000-2  */             
            DO;                                                                 
               MAP_MELDING               = 'UGYLDIG REGDATO';                   
               FEILMELDING_SATT          = '1'B;                                
               S001481I.REGDATOL         = -1; /* CURSOR POS */                 
               S001481I.FNRL             =  0; /* CURSOR POS NULLES */          
               S001481O.REGDATOA         = 'I';                                 
               S001481O.REGDATOO         = S001481I.REGDATOI;                   
               S001481O.MELDINGO         = MAP_MELDING;                         
               S001481O.CICS_INFOO       = CICS_NAVN ;                          
               S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                
               EXEC CICS SEND MAP('S001481')                                    
                                   MAPSET('S001V03')ERASE CURSOR;               
                                                                                
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/           
                                                                                
               EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')              
                                                        SET(BMSMAPBR);          
               IF S001481I.RETURL > 0 THEN                                      
                  DO;                                                           
                     FUNKSJONSKODE = S001481I.RETURI;                           
                                                                                
                     CALL OVER_OG_UT(FUNKSJONSKODE);                            
                                                                                
                  END;                                                          
               GO TO RETUR;                                                     
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               PIC_6   = S001481O.REGDATOO;                                     
               PIC_8   = KONV_DMÅ_HÅMD(S001481O.REGDATOO);                      
               B02.STATUS.VIRK_DATO_ÅMD(13) = 0;                                
               B02.STATUS.DØDSDATO_ÅMD(13) = PIC_8 ;                            
            END;                                                                
                                                                                
 RETUR:                                                                         
 END SJEKK_REGDATO1;                                                            
                                                                                
                                                                                
                                                                                
                                                                                
 BYGG_VENTEBILDE_OPPL_REGDATO:                                                  
   PROC;                                                                        
                                                                                
                                                                                
    IF ANTALL_LEST < 21 THEN                                                    
       DO;                                                                      
          W02_GET      = W02_GU;                                                
                                                                                
          CALL P005_LES_ROT_UQUAL;                                              
                                                                                
          ANTALL_LEST               = 1;                                        
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          ANTALL_LEST               = 1;                                        
                                                                                
          S001483O.FNRO(ANTALL_LEST)   = B02.RF0PERSN(14).FNR;                  
          S001483O.NAVNO(ANTALL_LEST)  = B02.RF0PERSN (14).NAVN;                
                                                                                
          ANTALL_LEST = ANTALL_LEST + 1;                                        
                                                                                
          W02_GET      = W02_GN;                                                
                                                                                
          CALL P005_LES_ROT_UQUAL;                                              
       END;                                                                     
                                                                                
                                                                                
    DO WHILE(W01.MER_DATA &                                                     
                            ANTALL_LEST < 21);                                  
                                                                                
       SUBSTR (ADDR            (B02.RF0PERSN (14))                              
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;        
                                                                                
       SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;                       
                                                                                
       /*******    LES VENTE_BASE   *********/                                  
                                                                                
       CALL P030_LES_TRANHIST_GNP_QUAL_REG;                                     
                                                                                
                                                                                
       IF W01.MER_DATA  THEN                                                    
          DO;                                                                   
             SUBSTR (ADDR            (TRANHIST)                                 
                       ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO;            
                                                                                
                                                                                
             S001483O.FNRO(ANTALL_LEST)   = B02.RF0PERSN(14).FNR;               
             S001483O.NAVNO(ANTALL_LEST)  = B02.RF0PERSN (14).NAVN;             
                                                                                
             ANTALL_LEST = ANTALL_LEST + 1;                                     
                                                                                
          END;                                                                  
       W02_GET      = W02_GN;                                                   
       CALL P005_LES_ROT_UQUAL;                                                 
    END;                                                                        
                                                                                
                                                                                
    IF    ANTALL_LEST > 20 THEN                                                 
          DO;                                                                   
             IF W01.MER_DATA  THEN                                              
                DO;                                                             
                   SUBSTR (ADDR            (B02.RF0PERSN (14))                  
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;        
                                                                                
                   SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;           
                                                                                
                   /*******    LES VENTE_BASE   *********/                      
                                                                                
                   CALL P030_LES_TRANHIST_GNP_QUAL_REG;                         
                                                                                
                                                                                
                   IF W01.MER_DATA  THEN                                        
                      DO;                                                       
                         SUBSTR (ADDR            (TRANHIST)                     
                          ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO;         
                         MAP_MELDING =                                          
                'FLERE EN 20 PERSONER.TRYKK ENTER ELLER VELG LINJENR.';         
                                                                                
                         S001483O.MELDING6O = MAP_MELDING;                      
                                                                                
                      END;                                                      
                   ELSE                                                         
                      ANTALL_LEST = 20;                                         
                END;                                                            
             ELSE                                                               
                ANTALL_LEST = 20;                                               
          END;                                                                  
                                                                                
                                                                                
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                                    
                          ANTALL_LEST = 1 THEN                                  
                                                                                
          DO;                                                                   
             MAP_MELDING =                                                      
                       'DET FINNES INGEN TRANSAKSJONER ' !!                     
                                        'MED REGDATO FØR: ' !! PIC_6;           
             FEILMELDING_SATT   = '1'B;                                         
             TRANSKODE = 'R048';                                                
             ALLOCATE S001481O;                                                 
             ALLOCATE S001481I;                                                 
                                                                                
             EXEC CICS LOAD PROGRAM('S001V03');                                 
                                                                                
             S001481O.MELDINGO  = MAP_MELDING;                                  
             S001481I.FNRL      = 0; /*CURSOR POS NULLES */                     
             S001481I.REGDATOL  = -1; /* CURSOR POS       */                    
             S001481O.REGDATOA  = 'I';                                          
             S001481O.REGDATOO  = PIC_6;                                        
             S001481O.CICS_INFOO  = CICS_NAVN  ;                                
             S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                  
             EXEC CICS SEND MAP('S001481')                                      
                                    MAPSET('S001V03')ERASE CURSOR;              
                                                                                
          END;                                                                  
                                                                                
  END BYGG_VENTEBILDE_OPPL_REGDATO;                                             
                                                                                
                                                                                
  VIRKDATO_BEHANDLING:                                                          
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    BYGGER OPP SKJÆRMBILDE MED PERSONER SOM ER REGISTRERT         */        
  /*    PÅ EN OPPGITT VIRKDATO.                                       */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL VIRKDATO_BEHANDLING;                                     */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
  FEILMELDING_SATT = '1'B;                                                      
                                                                                
  DO UNTIL (^FEILMELDING_SATT);                                                 
     FEILMELDING_SATT = '0'B;                                                   
                                                                                
     CALL SJEKK_VIRKDATO_BLTYPE;                                                
                                                                                
  END;                                                                          
                                                                                
  ALLOCATE S001483O;                                                            
  EXEC CICS LOAD PROGRAM('S001V03');                                            
  S001483O.CICS_INFOO = CICS_NAVN  ;                                            
  S001483O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                             
  SSA3_TRANHIST.BLTYPE           =                                              
                                   W_BLTYPE;                                    
  SSA3_TRANHIST.VTP_KEY   = 99999999 - PIC_8_2;                                 
                                                                                
  /***  LESER ALLE FOREKOMSTENE                                                 
                                 I VT-BASEN     ********/                       
  /***  MED ØNSKET VIRKDATO OG BLANKETTYPE.                                     
                                                             ********/          
                                                                                
  LINJENR     = 0;                                                              
  ANTALL_LEST = 0;                                                              
                                                                                
                                                                                
   /***  ÅPNER VT_BASEN                            *********/                   
                                                                                
                                                                                
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                         
      CALL DATABASE('OPEN');                                                    
  ELSE                                                                          
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                                 
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
                                                                                
  DO WHILE (LINJENR = 0);                                                       
                                                                                
                                                                                
     CALL BYGG_VENTEBILDE_OPPL_VIRKDATO;                                        
                                                                                
     IF FEIL_MELD_NR > 0 THEN                                                   
           DO;                                                                  
                                                                                
              GO TO RETUR;                                                      
           END;                                                                 
     ELSE                                                                       
        IF FEILMELDING_SATT   THEN                                              
           GO TO RETUR;                                                         
                                                                                
     IF LINJENR > 0 THEN                                                        
        DO;                                                                     
           /*** LUKKER VT_BASEN                            *********/           
                                                                                
           CALL DATABASE('CLOSE');                                              
                                                                                
           IF FEIL_MELD_NR > 0   THEN                                           
           DO;                                                                  
                                                                                
              GO TO L999;                                                       
           END;                                                                 
        END;                                                                    
                                                                                
     S001483O.RDATOO    =  KONV_HÅMD_MÅ(PIC_8_2);                               
     S001483I.TEKST1I   =  'VIRKDATO     :' ;                                   
     S001483I.TEKST2I   =  'BLANKETTTYPE :' ;                                   
     S001483I.BLTYPEI   =  W_BLTYPE         ;                                   
     S001483I.LINJENRL  =                -1 ; /* CURSOR POS */                  
                                                                                
     /***  SKRIVER UT VENTETRANSBILDET MED DATA.**/                             
                                                                                
                                                                                
     EXEC CICS SEND MAP('S001483')                                              
                               MAPSET('S001V03') CURSOR ERASE;                  
                                                                                
     CALL SEARCH_FNR_BEHANDLING;                                                
                                                                                
  END;                                                                          
                                                                                
  RETUR:                                                                        
                                                                                
  END VIRKDATO_BEHANDLING;                                                      
                                                                                
                                                                                
 SJEKK_VIRKDATO_BLTYPE:                                                         
  PROC;                                                                         
      IF ^ F_NUMERISK(S001481I.VIRKDATOI) THEN                                  
         DO;                                                                    
            MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I VIRKDATO';               
            FEILMELDING_SATT          = '1'B;                                   
            S001481I.VIRKDATOL        = -1; /* CURSOR POS */                    
            S001481I.FNRL             =  0; /* CURSOR POS NULLES */             
            S001481O.VIRKDATOA        = 'I';                                    
            S001481O.BLTYPEO          = S001481I.BLTYPEI  ;                     
            S001481O.MELDINGO         = MAP_MELDING;                            
            S001481O.CICS_INFOO       = CICS_NAVN ;                             
            S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                   
            EXEC CICS SEND MAP('S001481')                                       
                                   MAPSET('S001V03')ERASE CURSOR;               
                                                                                
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/           
                                                                                
            EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')                 
                                                        SET(BMSMAPBR);          
            IF S001481I.RETURL > 0 THEN                                         
               DO;                                                              
                  FUNKSJONSKODE = S001481I.RETURI;                              
                                                                                
                  CALL OVER_OG_UT(FUNKSJONSKODE);                               
                                                                                
               END;                                                             
            GO TO RETUR;                                                        
         END;                                                                   
      ELSE                                                                      
         IF ^F_GYLDIG_DATO(KONV_MÅ_HÅMD(S001481O.VIRKDATOO)) THEN               
            DO;                                                                 
               MAP_MELDING               = 'UGYLDIG VIRKDATO.';                 
               FEILMELDING_SATT          = '1'B;                                
               S001481I.VIRKDATOL        = -1; /* CURSOR POS */                 
               S001481I.FNRL             =  0; /* CURSOR POS NULLES */          
               S001481O.VIRKDATOA        = 'I';                                 
               S001481O.VIRKDATOO        = S001481I.VIRKDATOI;                  
               S001481O.BLTYPEO          = S001481I.BLTYPEI  ;                  
               S001481O.MELDINGO         = MAP_MELDING;                         
               S001481O.CICS_INFOO       = CICS_NAVN ;                          
               S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                
               EXEC CICS SEND MAP('S001481')                                    
                                   MAPSET('S001V03')ERASE CURSOR;               
                                                                                
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/           
                                                                                
               EXEC CICS RECEIVE MAP('S001481') MAPSET ('S001V03')              
                                                        SET(BMSMAPBR);          
               IF S001481I.RETURL > 0 THEN                                      
                  DO;                                                           
                     FUNKSJONSKODE = S001481I.RETURI;                           
                                                                                
                     CALL OVER_OG_UT(FUNKSJONSKODE);                            
                                                                                
                  END;                                                          
               GO TO RETUR;                                                     
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               PIC_4 = S001481O.VIRKDATOO;                                      
               PIC_8_2   = KONV_MÅ_HÅMD(S001481O.VIRKDATOO);                    
               B02.STATUS.VIRK_DATO_ÅMD(13) = PIC_8_2;                          
               B02.STATUS.DØDSDATO_ÅMD(13) = 0;                                 
               IF ^(S001481I.BLTYPEI = 'AP' !                                   
                   S001481I.BLTYPEI = 'A1' !                                    
                   S001481I.BLTYPEI = 'UP' !                                    
                   S001481I.BLTYPEI = 'U2' !                                    
                   S001481I.BLTYPEI = 'U3' !                                    
                   S001481I.BLTYPEI = 'AF' !                                    
                   S001481I.BLTYPEI = 'KF' !                                    
                   S001481I.BLTYPEI = 'UF' !                                    
                   S001481I.BLTYPEI = 'EP' !                                    
                   S001481I.BLTYPEI = 'E3' !                                    
                   S001481I.BLTYPEI = 'EF' !                                    
                   S001481I.BLTYPEI = 'EE' !                                    
                   S001481I.BLTYPEI = 'E4' !                                    
                   S001481I.BLTYPEI = 'FB' !                                    
                   S001481I.BLTYPEI = 'BP' !                                    
                   S001481I.BLTYPEI = 'B6' !                                    
                   S001481I.BLTYPEI = 'FT' !                                    
                   S001481I.BLTYPEI = 'F7' !                                    
                   S001481I.BLTYPEI = 'FO' !                                    
                   S001481I.BLTYPEI = 'O1' !                                    
                   S001481I.BLTYPEI = 'O2' !                                    
                   S001481I.BLTYPEI = 'E1' !                                    
                   S001481I.BLTYPEI = 'EN' !                                    
                   S001481I.BLTYPEI = 'E2') THEN                                
                   DO;                                                          
                      MAP_MELDING = 'UGYLDIG BLANKETTYPE.';                     
                      FEILMELDING_SATT   = '1'B      ;                          
                      S001481I.BLTYPEL   = -1; /* CURSOR POS */                 
                      S001481I.FNRL      =  0; /* CURSOR POS NULLES */          
                      S001481I.VIRKDATOL =  0; /* CURSOR POS NULLES */          
                      S001481O.BLTYPEA   = 'I'       ;                          
                      S001481O.VIRKDATOO = S001481I.VIRKDATOI;                  
                      S001481O.BLTYPEO   = S001481I.BLTYPEI  ;                  
                      S001481O.MELDINGO  = MAP_MELDING       ;                  
                      S001481O.CICS_INFOO   = CICS_NAVN ;                       
                      S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;         
                      EXEC CICS SEND MAP('S001481')                             
                                   MAPSET('S001V03')ERASE CURSOR;               
                                                                                
            /***  LESER INN FNR FRA VENTEMENYBILDET.   *************/           
                                                                                
                      EXEC CICS RECEIVE MAP('S001481') MAPSET                   
                                            ('S001V03') SET(BMSMAPBR);          
                      IF S001481I.RETURL > 0 THEN                               
                         DO;                                                    
                            FUNKSJONSKODE = S001481I.RETURI;                    
                                                                                
                            CALL OVER_OG_UT(FUNKSJONSKODE);                     
                                                                                
                         END;                                                   
                   END;                                                         
                ELSE                                                            
                   DO;                                                          
                      W_BLTYPE                    = S001481I.BLTYPEI;           
                      TRANS_OPPL_OMR.BLANKETTYPE  = W_BLTYPE        ;           
                   END;                                                         
            END;                                                                
                                                                                
 RETUR:                                                                         
 END SJEKK_VIRKDATO_BLTYPE;                                                     
                                                                                
                                                                                
 BYGG_VENTEBILDE_OPPL_VIRKDATO:                                                 
   PROC;                                                                        
                                                                                
                                                                                
                                                                                
    IF ANTALL_LEST < 21 THEN                                                    
       DO;                                                                      
          W02_GET      = W02_GU;                                                
                                                                                
          CALL P005_LES_ROT_UQUAL;                                              
                                                                                
          ANTALL_LEST               = 1;                                        
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          ANTALL_LEST               = 1;                                        
                                                                                
          S001483O.FNRO(ANTALL_LEST)   = B02.RF0PERSN(14).FNR;                  
          S001483O.NAVNO(ANTALL_LEST)  = B02.RF0PERSN (14).NAVN;                
                                                                                
          ANTALL_LEST = ANTALL_LEST + 1;                                        
                                                                                
          W02_GET      = W02_GN;                                                
                                                                                
          CALL P005_LES_ROT_UQUAL;                                              
       END;                                                                     
                                                                                
                                                                                
    DO WHILE(W01.MER_DATA &                                                     
                            ANTALL_LEST < 21);                                  
                                                                                
       SUBSTR (ADDR            (B02.RF0PERSN (14))                              
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;        
                                                                                
       SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;                       
                                                                                
       /*******    LES VENTE_BASE   *********/                                  
                                                                                
       CALL P030_LES_TRANHIST_GN_QUAL_VTP;                                      
                                                                                
                                                                                
       IF W01.MER_DATA  THEN                                                    
          DO;                                                                   
             SUBSTR (ADDR            (TRANHIST)                                 
                       ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO;            
                                                                                
                                                                                
             S001483O.FNRO(ANTALL_LEST)   = B02.RF0PERSN(14).FNR;               
             S001483O.NAVNO(ANTALL_LEST)  = B02.RF0PERSN (14).NAVN;             
                                                                                
             ANTALL_LEST = ANTALL_LEST + 1;                                     
                                                                                
          END;                                                                  
       W02_GET      = W02_GN;                                                   
       CALL P005_LES_ROT_UQUAL;                                                 
    END;                                                                        
                                                                                
                                                                                
    IF    ANTALL_LEST > 20 THEN                                                 
          DO;                                                                   
             IF W01.MER_DATA  THEN                                              
                DO;                                                             
                   SUBSTR (ADDR            (B02.RF0PERSN (14))                  
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;        
                                                                                
                   SSA1_VT0PERSN.PKEY         = B02.RF0PERSN(14).FNR;           
                                                                                
                   /*******    LES VENTE_BASE   *********/                      
                                                                                
                   CALL P030_LES_TRANHIST_GN_QUAL_VTP;                          
                                                                                
                                                                                
                   IF W01.MER_DATA  THEN                                        
                      DO;                                                       
                         SUBSTR (ADDR            (TRANHIST)                     
                          ->  W01_HJELPE_IO,1,STG (TRANHIST)) = W01_IO;         
                         MAP_MELDING =                                          
                'FLERE EN 20 PERSONER.TRYKK ENTER ELLER VELG LINJENR.';         
                                                                                
                         S001483O.MELDING6O = MAP_MELDING;                      
                                                                                
                      END;                                                      
                   ELSE                                                         
                      ANTALL_LEST = 20;                                         
                END;                                                            
             ELSE                                                               
                ANTALL_LEST = 20;                                               
          END;                                                                  
                                                                                
                                                                                
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                                    
                          ANTALL_LEST = 1 THEN                                  
                                                                                
          DO;                                                                   
             MAP_MELDING =                                                      
                       'DET FINNES INGEN TRANSAKSJONER ' !!                     
                                        'MED VIRKDATO = ' !! PIC_4;             
             FEILMELDING_SATT   = '1'B;                                         
             TRANSKODE = 'R048';                                                
             ALLOCATE S001481O;                                                 
             ALLOCATE S001481I;                                                 
                                                                                
             EXEC CICS LOAD PROGRAM('S001V03');                                 
                                                                                
             S001481O.MELDINGO   = MAP_MELDING;                                 
             S001481I.FNRL       = 0; /*CURSOR POS NULLES */                    
             S001481I.VIRKDATOL  = -1; /* CURSOR POS       */                   
             S001481O.VIRKDATOA  = 'I';                                         
             S001481O.VIRKDATOO  = PIC_4;                                       
             S001481O.BLTYPEO    = S001481I.BLTYPEI;                            
             S001481O.CICS_INFOO = CICS_NAVN  ;                                 
             S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                  
             EXEC CICS SEND MAP('S001481')                                      
                                    MAPSET('S001V03')ERASE CURSOR;              
                                                                                
          END;                                                                  
                                                                                
  END BYGG_VENTEBILDE_OPPL_VIRKDATO;                                            
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  /* **************************************************************** */        
  /*                                                                  */        
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE VENTEDATABASEN.                   */        
  /*                                                                  */        
  /*  ENDRING I FEIL MELDING TEKST GJØRT DEN 09.03.2001 AV AB         */        
  /* **************************************************************** */        
  /*                                                                            
  */                                                                            
  DATABASE:                                                                     
   PROC(STYRING);                                                               
                                                                                
   DCL                                                                          
     STYRING                               CHAR(5),                             
     NULL                                  BUILTIN,                             
     UNSPEC                                BUILTIN,                             
     PLITDLI                               ENTRY;                               
                                                                                
  %SKIP;                                                                        
  /*                                                                  */        
  /***** DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-****/        
  /*     KALL                                                         */        
  /*                                                                  */        
     DCL                                                                        
       W01_PSB_NAVN                CHAR (8)       INIT('        ');             
     DCL                                                                        
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');                 
     DCL                                                                        
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
  %PAGE;                                                                        
  /*                                                                  */        
  /****  DLI CALL-PARAMETRE                               *************/        
  /*                                                                  */        
  %SKIP(2);                                                                     
     DCL 1  W01_DLI_PARAM,                                                      
            2   W02_GU             CHAR (4)       INIT('GU  '),                 
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),                      
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);                      
                                                                                
  %PAGE;                                                                        
                                                                                
                                                                                
       W01_PSB_NAVN    = DIV_PARAM_OMR.PSB_NAVN;                                
     IF STYRING = 'OPEN' THEN                                                   
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_3,                
                                                  W01_PCB_FUNCTION,             
                                                  W01_PSB_NAVN,                 
                                                  UIBPTR);                      
                                                                                
                                                                                
           IF DLIUIB.UIBFCTR                 = '00000000'B THEN                 
              DO;                                                               
                 ALLOCATE PCB_UIB_PEKER_OMR;                                    
                 KOM_OMR.PCB_UIB_PEKER       = ADDR (PCB_UIB_PEKER_OMR);        
                 ALLOCATE PCB_PEKER_OMR;                                        
                 PCB_UIB_PEKER_OMR.UIB_PEKER = UIBPTR;                          
                 PCB_UIB_PEKER_OMR.PCB_PEKER = UIBPCBAL;                        
              END;                                                              
           ELSE                                                                 
          DO;                                                                   
             FEIL_MELD_NR      =  500;                                          
 L555:                                                                          
             FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!           
                            ' GÅR I FEIL VED LABEL NR. '        !!              
             FEIL_VED_LABEL    = '555';                                         
             MAP_MELDING =                                                      
                    'VENTETRANS-BASEN ER IKKE TILGJENGELIG. KODE:'!!            
                     UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);                 
          END;                                                                  
           /*----------------------/                                            
              DO;                                                               
                 FEIL_MELD_NR      =  500;                                      
 L555:           FEIL_VED_LABEL    = '555';                                     
                 MAP_MELDING =                                                  
                         'NOE ER GALT MED DATABASEN, KODE: ' !!                 
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);           
              END; */                                                           
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_1,                
                                                  W01_TERM_FUNCTION);           
           KOM_OMR.PCB_UIB_PEKER = NULL;                                        
        END;                                                                    
                                                                                
  END DATABASE;                                                                 
                                                                                
                                                                                
                                                                                
                                                                                
  /* **************************************************************** */        
  /*                                                                  */        
  /*  PROCEDURE FOR Å HENTE SVAR OG BEKREFTELSE PÅ FJERNING           */        
  /*                                                                  */        
  /*                                                                  */        
  /* **************************************************************** */        
  /*                                                                            
  */                                                                            
  HENT_SVAR_OG_BEKREFT:                                                         
     PROC;                                                                      
                                                                                
                                                                                
     S001482O.MELDING6O = LOW(78);                                              
     EXEC CICS SEND    MAP('S001482') MAPSET('S001V03');                        
                                                                                
     S001484O.MELDINGO  = 'BEKREFT FJERNING MED: B   VENNLIGST VÆR ' !!         
                         'SNAR DA DETTE OPPTAR STORE RESSURSER';                
                                                                                
     EXEC CICS SEND    MAP('S001484') MAPSET('S001V03');                        
                                                                                
     EXEC CICS RECEIVE MAP('S001484')                                           
                           MAPSET('S001V03') INTO (S001484I);                   
                                                                                
  END HENT_SVAR_OG_BEKREFT;                                                     
                                                                                
                                                                                
                                                                                
  /* **************************************************************** */        
  /*                                                                  */        
  /*  PROCEDURE FOR Å LESE VENTEBASE OG FLYTTE OPPLYSNINGENE INN      */        
  /*  I RIKTIG BLANKETTOMRÅDE.                                        */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
  FLYTT_BASEDATA_TIL_BILDE_OMR:                                                 
    PROC;                                                                       
                                                                                
    IF   SEARCH_FNR                         =    0                 THEN         
         DO;                                                                    
            /* ********************************************** */                
            /* NULL I FNR . KJØRING AVBRYTES                  */                
            /* ********************************************** */                
  L100:                                                                         
            FEIL_MELD_NR                 =   498;                               
            FEIL_VED_LABEL               =  '100';                              
            GO TO RETUR;                                                        
         END;                                                                   
                                                                                
                                                                                
                                                                                
        GRUNNBYP_IKKE_LEST = '1'B;                                              
        TO_GRUNNBYP_LEST   = '0'B;                                              
                                                                                
    W02_GET = W02_GU;                                                           
    CALL P005_LES_ROT_QUAL;                                                     
                                                                                
                                                                                
        DO   WHILE  (W01.MER_DATA  &  W01.BARN_IKKE_LEST &                      
                     ^TO_GRUNNBYP_LEST);                                        
                                                                                
      IF FEIL_MELD_NR                    >    0                THEN             
         DO;                                                                    
           /* ********************************************** */                 
           /*  FEIL VED LES                                  */                 
           /* ********************************************** */                 
                                                                                
           GO TO RETUR;                                                         
         END;                                                                   
                                                                                
      SELECT ( VT1.SEGM_NAVN );                                                 
                                                                                
        WHEN ( 'VT0PERSN' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    V T 0 P E R S N                       */            
          /* **************************************************** */            
          DO;                                                                   
                                                                                
             SUBSTR (ADDR            (B02.RF0PERSN (14))                        
                  ->  W01_HJELPE_IO,1,STG (B02.RF0PERSN (14))) = W01_IO;        
                                                                                
             W01.NAVN            =    B02.RF0PERSN (14).NAVN      ;             
                                                                                
             TRANS_OPPL_OMR.FØDSNUMMER             =  SEARCH_FNR;               
             CALL P030_LES_TRANHIST_GN_QUAL_VTP;                                
          END;                                                                  
                                                                                
        WHEN ( 'TRANHIST' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    T R A N H I S T                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (TRANHIST)                              
                ->  W01_HJELPE_IO,1,STG (TRANHIST)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBAP' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B A P                       */            
          /*  GRUNNBAP KAN VÆRE AVTALEFESTET PENSJON OGSÅ' DA SKAL*/            
          /*  LESTE DATA LEGGES I OMRÅDET GRUNNBAF                */            
          /*  ENDRET SATISH 17.01.89                              */            
          /* **************************************************** */            
          DO;                                                                   
            IF TRANHIST.GRBLKODE = 'AP' THEN                                    
               SUBSTR (ADDR                (GRUNNBAP)                           
                     ->  W01_HJELPE_IO,1,STG (GRUNNBAP)) =  W01_IO;             
                                                                                
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBAF' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B AFP                       */            
          /* **************************************************** */            
                                                                                
          DO;                                                                   
            IF TRANHIST.GRBLKODE = 'AF' THEN                                    
               SUBSTR (ADDR                (GRUNNBAF)                           
                     ->  W01_HJELPE_IO,1,STG (GRUNNBAF)) =  W01_IO;             
            CALL    P010_LES_SEGM;                                              
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBKF' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B K F                       */            
          /* **************************************************** */            
                                                                                
          DO;                                                                   
            IF TRANHIST.GRBLKODE = 'KF' THEN                                    
               SUBSTR (ADDR                (GRUNNBKF)                           
                     ->  W01_HJELPE_IO,1,STG (GRUNNBKF)) =  W01_IO;             
            CALL    P010_LES_SEGM;                                              
                                                                                
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBA1' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B A P                       */            
          /*  GRUNNBAP KAN VÆRE AVTALEFESTET PENSJON OGSÅ' DA SKAL*/            
          /*  LESTE DATA LEGGES I OMRÅDET GRUNNBAF                */            
          /*  ENDRET SATISH 17.01.89                              */            
          /* **************************************************** */            
          DO;                                                                   
            IF TRANHIST.GRBLKODE = 'A1' THEN                                    
               SUBSTR (ADDR                (GRUNNBA1)                           
                     ->  W01_HJELPE_IO,1,STG (GRUNNBA1)) =  W01_IO;             
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
        WHEN ( 'GRUNNBUP' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B U P                       */            
          /* **************************************************** */            
          DO;                                                                   
            IF TRANHIST.GRBLKODE      =  'UP'  THEN                             
                                                                                
              SUBSTR (ADDR                (GRUNNBUP)                            
                  ->  W01_HJELPE_IO,1,STG (GRUNNBUP)) =  W01_IO;                
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBUF' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B U P                       */            
          /* **************************************************** */            
          DO;                                                                   
            IF TRANHIST.GRBLKODE      =  'UF'  THEN                             
              SUBSTR (ADDR                (GRUNNBUF)                            
                  ->  W01_HJELPE_IO,1,STG (GRUNNBUF)) =  W01_IO;                
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBU2' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B U P                       */            
          /* **************************************************** */            
          DO;                                                                   
                                                                                
            IF TRANHIST.GRBLKODE      =  'U2'  THEN                             
                                                                                
              SUBSTR (ADDR                (GRUNNBU2)                            
                  ->  W01_HJELPE_IO,1,STG (GRUNNBU2)) =  W01_IO;                
                                                                                
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBU3' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B U P                       */            
          /* **************************************************** */            
          DO;                                                                   
                                                                                
            IF TRANHIST.GRBLKODE      =  'U3'  THEN                             
                                                                                
              SUBSTR (ADDR                (GRUNNBU3)                            
                  ->  W01_HJELPE_IO,1,STG (GRUNNBU3)) =  W01_IO;                
                                                                                
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLUFST' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L U F S T                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLUFST)                              
                ->  W01_HJELPE_IO,1,STG (GRBLUFST)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLFORS' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L F O R S                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLFORS)                              
                ->  W01_HJELPE_IO,1,STG (GRBLFORS)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBIF' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L F O R S                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRUNNBIF)                              
                ->  W01_HJELPE_IO,1,STG (GRUNNBIF)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBFO' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L F O R S                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRUNNBFO)                              
                ->  W01_HJELPE_IO,1,STG (GRUNNBFO)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBEP' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B E P                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRUNNBEP)                              
                ->  W01_HJELPE_IO,1,STG (GRUNNBEP)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBEE' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B E P                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRUNNBEE)                              
                ->  W01_HJELPE_IO,1,STG (GRUNNBEE)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNEES' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B E P                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRUNNEES)                              
                ->  W01_HJELPE_IO,1,STG (GRUNNEES)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBE3' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B E 3                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRUNNBE3)                              
                ->  W01_HJELPE_IO,1,STG (GRUNNBE3)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLFAMP' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L F A M P                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLFAMP)                              
                ->  W01_HJELPE_IO,1,STG (GRBLFAMP)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLFAE4' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L F A M P                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLFAE4)                              
                ->  W01_HJELPE_IO,1,STG (GRBLFAE4)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLEBEN' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L E B E N                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLEBEN)                              
                ->  W01_HJELPE_IO,1,STG (GRBLEBEN)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLEBB6' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L E B B 6                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLEBB6)                              
                ->  W01_HJELPE_IO,1,STG (GRBLEBB6)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRBLEBBE' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R B L E B B E                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (GRBLEBBE)                              
                ->  W01_HJELPE_IO,1,STG (GRBLEBBE)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'GRUNNBYP' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    G R U N N B Y P                       */            
          /* **************************************************** */            
          DO;                                                                   
            IF GRUNNBYP_IKKE_LEST THEN                                          
               DO;                                                              
                  SUBSTR (ADDR                (GRUNNBYP)                        
                      ->  W01_HJELPE_IO,1,STG (GRUNNBYP)) =  W01_IO;            
                  CALL    P010_LES_SEGM;                                        
                  GRUNNBYP_IKKE_LEST = '0'B;                                    
               END;                                                             
            ELSE                                                                
               TO_GRUNNBYP_LEST = '1'B;                                         
          END;                                                                  
                                                                                
        WHEN ( 'ENDRBLAN' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    E N D R B L A N                       */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (ENDRBLAN)                              
                ->  W01_HJELPE_IO,1,STG (ENDRBLAN)) =  W01_IO;                  
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'ENBLAN1 ' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    E N -   B L A N K E T T               */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (EN_BLAN)                               
                ->  W01_HJELPE_IO,1,STG (EN_BLAN)) =  W01_IO;                   
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'OPPHBL1 ' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    O P P H B L 1                         */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (OPPHBL1)                               
                ->  W01_HJELPE_IO,1,STG (OPPHBL1)) =  W01_IO;                   
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'OPPHBL2 ' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    O P P H B L 2                         */            
          /* **************************************************** */            
          DO;                                                                   
            SUBSTR (ADDR                (OPPHBL2)                               
                ->  W01_HJELPE_IO,1,STG (OPPHBL2)) =  W01_IO;                   
            CALL    P010_LES_SEGM;                                              
          END;                                                                  
                                                                                
        WHEN ( 'BARN    ' )                                                     
          /* **************************************************** */            
          /*  FÅTT INN :    B A R N                               */            
          /* **************************************************** */            
          DO;                                                                   
            W01.BARN_IKKE_LEST                  =  '0'B;                        
          END;                                                                  
                                                                                
        OTHERWISE                                                               
          /* **************************************************** */            
          /*  FÅTT INN : ET UKJENT SEGMENT                        */            
          /* **************************************************** */            
          DO;                                                                   
  L105:                                                                         
            FEIL_MELD_NR                        =  500;                         
            FEIL_VED_LABEL                      = '105';                        
            GO TO RETUR;                                                        
          END;                                                                  
                                                                                
      END;/*   SELECT    :  VT1.SEGM_NAVN                       */              
                                                                                
    END;  /*   DO WHILE  (  W01.MER_DATA & W01.BARN_IKKE_LEST ) */              
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* SJEKKER OM ET TRANHIST-SEGM. ER LEST INN .                     */        
    /* ER DET DET OVERFØRES OPPLYSNINGENE TIL BLANKETTEN .            */        
    /*                                                                */        
    /* HVIS IKKE SJEKKES OM DET LEST INN NOEN I POS 1,2,3 I B02       */        
    /* ER DET IKKE DET BLANKES DEN OPPDATERTE POS 14 I B02 .          */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
                                                                                
    IF TRANHIST.REGDATO_ÅMD        >        0     THEN                          
       CALL    P40_OVERFØR_TIL_BLANKETT;                                        
    ELSE                                                                        
                                                                                
       B02.RF0PERSN.FNR (14)   =        0;                                      
                                                                                
 RETUR:                                                                         
                                                                                
                                                                                
   END FLYTT_BASEDATA_TIL_BILDE_OMR;                                            
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P005_LES_ROT_QUAL:                                                          
      PROC;                                                                     
                                                                                
      W01_IO  =    (380)' ';                                                    
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GET,                       
                                                 VT1,                           
                                                 W01_IO,                        
                                                 SSA1_VT0PERSN);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT  ( VT1.STATUS_KODE );                                          
                                                                                
            WHEN  ( '  ' )                                                      
              W01.MER_DATA                 =    '1'B;                           
                                                                                
            WHEN  ( 'GE' )                                                      
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L210:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '210';                          
                DB_STATUS_KODE             =     VT1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L220:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '220';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
    END P005_LES_ROT_QUAL;                                                      
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT-SEGM  GN UQUAL.                         */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P005_LES_ROT_UQUAL:                                                         
      PROC;                                                                     
                                                                                
      W01_IO  =    (380)' ';                                                    
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GET,                       
                                                 VT1,                           
                                                 W01_IO,                        
                                                 SSA_UQUAL_ROT);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT  ( VT1.STATUS_KODE );                                          
                                                                                
            WHEN  ( '  ' )                                                      
              W01.MER_DATA                 =    '1'B;                           
                                                                                
            WHEN  ( 'GB' )                                                      
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L230:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '230';                          
                DB_STATUS_KODE             =     VT1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L240:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '240';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
    END P005_LES_ROT_UQUAL;                                                     
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE NESTE SEGMENT UNDER TRANHIST                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P010_LES_SEGM:                                                              
      PROC;                                                                     
                                                                                
      W01_IO  =    (380)' ';                                                    
      CALL PLITDLI                              (W02_PARM_CT_3,                 
                                                 W02_GNP,                       
                                                 VT1,                           
                                                 W01_IO);                       
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( VT1.STATUS_KODE );                                           
            WHEN ( '  ' , 'GA' , 'GK' )                                         
              DO;                                                               
                     W01.MER_DATA                 =    '1'B;                    
              END;                                                              
            WHEN ( 'GE' , 'GB' )                                                
              DO;                                                               
                  W01.MER_DATA                 =    '0'B;                       
              END;                                                              
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L130:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '130';                          
                DB_STATUS_KODE             =     VT1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L140:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '140';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
    END P010_LES_SEGM;                                                          
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE NESTE TRANHIST (GN    UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P020_LES_NESTE_TRANHIST:                                                    
      PROC;                                                                     
                                                                                
      W01_IO  =    (380)' ';                                                    
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 VT1,                           
                                                 W01_IO,                        
                                                 SSA1_TRANHIST_CMD);            
                 /* ENDERET SATISH 10.10.95      SSA_UQUAL_TRANHIST); */        
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( VT1.STATUS_KODE );                                           
                                                                                
            WHEN ( '  ' )                                                       
              W01.MER_DATA                 =    '1'B;                           
                                                                                
            WHEN ( 'GE' , 'GB' )                                                
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L150:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '150';                          
                DB_STATUS_KODE             =     VT1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L160:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '160';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
    END P020_LES_NESTE_TRANHIST;                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /*  LESER NESTE TRANS MED :         REGDATO  <  OPPGITT DATO    */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
    P030_LES_TRANHIST_GNP_QUAL_REG:                                             
      PROC;                                                                     
                                                                                
      W01_IO  =    (380)' ';                                                    
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 VT1,                           
                                                 W01_IO,                        
                                                 SSA1_TRANHIST);                
                                                                                
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN              
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L170:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '170';                                
          W01.MER_DATA               =    '0'B;                                 
          GO   TO  RETUR;                                                       
        END;                                                                    
                                                                                
      SELECT ( VT1.STATUS_KODE );                                               
                                                                                
        WHEN ( '  ' )                                                           
          DO;                                                                   
            /* ************************************** */                        
            /*  TRANHIST FUNNET.                      */                        
            /* ************************************** */                        
                                                                                
            W01.MER_DATA                   =    '1'B;                           
          END;                                                                  
                                                                                
        WHEN ( 'GE' , 'GB' )                                                    
          DO;                                                                   
            /* ************************************** */                        
            /*  FINNES INGEN TRANS                    */                        
            /* ************************************** */                        
                                                                                
            W01.MER_DATA         =   '0'B;                                      
          END;                                                                  
                                                                                
        OTHERWISE                                                               
          DO;                                                                   
            /* ************************************************** */            
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */            
            /* ************************************************** */            
                                                                                
  L180:                                                                         
            FEIL_MELD_NR               =     500;                               
            FEIL_VED_LABEL             =    '180';                              
            W01.MER_DATA               =    '0'B;                               
          END;                                                                  
                                                                                
      END;  /*      SELECT  (VT1.STATUS_KODE)                      */           
                                                                                
  RETUR:                                                                        
    END P030_LES_TRANHIST_GNP_QUAL_REG;                                         
                                                                                
                                                                                
                                                                                
    /* ************************************************************ */          
    /*                                                              */          
    /*  LESER NESTE TRANS MED :         VTPKEY = 99999999 - VDATO.  */          
    /*                                                              */          
    /* ************************************************************ */          
                                                                                
    P030_LES_TRANHIST_GN_QUAL_VTP:                                              
      PROC;                                                                     
                                                                                
      W01_IO  =    (380)' ';                                                    
      CALL PLITDLI                              (W02_PARM_CT_5,                 
                                                 W02_GN,                        
                                                 VT1,                           
                                                 W01_IO,                        
                                                 SSA1_VT0PERSN,                 
                                                 SSA3_TRANHIST);                
                                                                                
      IF   UIBFCTR                        ^=     UIB_RC_OK    THEN              
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L190:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '190';                                
          W01.MER_DATA               =    '0'B;                                 
          GO   TO  RETUR;                                                       
        END;                                                                    
                                                                                
      SELECT ( VT1.STATUS_KODE );                                               
                                                                                
        WHEN ( '  ' )                                                           
          DO;                                                                   
            /* ************************************** */                        
            /*  ØNSKET TRANHIST FUNNET.               */                        
            /* ************************************** */                        
                                                                                
            W01.MER_DATA                   =    '1'B;                           
          END;                                                                  
                                                                                
        WHEN ( 'GE' , 'GB' )                                                    
          DO;                                                                   
            /* ************************************** */                        
            /*  FINNES INGEN TRANS                    */                        
            /* ************************************** */                        
                                                                                
            W01.MER_DATA         =   '0'B;                                      
          END;                                                                  
                                                                                
        OTHERWISE                                                               
          DO;                                                                   
            /* ************************************************** */            
            /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */            
            /* ************************************************** */            
                                                                                
  L195:                                                                         
            FEIL_MELD_NR               =     500;                               
            FEIL_VED_LABEL             =    '195';                              
            W01.MER_DATA               =    '0'B;                               
          END;                                                                  
                                                                                
      END;  /*      SELECT  (VT1.STATUS_KODE)                      */           
                                                                                
  RETUR:                                                                        
    END P030_LES_TRANHIST_GN_QUAL_VTP;                                          
                                                                                
                                                                                
                                                                                
    /* ********************************************************* */             
    /*                                                           */             
    /* *****  PROC SOM KALLER RIKTIG BLANKETT-OMRÅDET  *******   */             
    /*                                                           */             
    /* ********************************************************* */             
                                                                                
    P40_OVERFØR_TIL_BLANKETT:                                                   
      PROC;                                                                     
                                                                                
                                                                                
      W01.VIRK_DATO_ÅMD                 =  TRANHIST.VIRK_DATO_ÅMD   ;           
      TRANS_OPPL_OMR.FØDSNUMMER         =  SEARCH_FNR               ;           
      TRANS_OPPL_OMR.BLANKETTYPE        =  TRANHIST.GRBLKODE        ;           
      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD  =                                       
                                            (W01.VIRK_DATO_ÅMD)      ;          
             W01.NAVN            =    B02.RF0PERSN (14).NAVN      ;             
                                                                                
      SELECT ( TRANHIST.GRBLKODE );                                             
                                                                                
        WHEN ( 'AP' )                                                           
          /* **************************************************** */            
          /*  ALDERSPENSJON                                       */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P050_LES_AP_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV :  TRANS                   */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R051';                              
          END;                                                                  
                                                                                
        WHEN ( 'A1' )                                                           
          /* **************************************************** */            
          /*  ALDERSPENSJON                                       */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P050_LES_A1_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV :  TRANS                   */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN51';                              
          END;                                                                  
                                                                                
        WHEN ( 'UP' )                                                           
          /* **************************************************** */            
          /*  UFØREPENSJON                                        */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P060_LES_UP_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R061';                              
          END;                                                                  
                                                                                
        WHEN ( 'U2' )                                                           
          /* **************************************************** */            
          /*  UFØREPENSJON                                        */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P060_LES_U2_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN61';                              
          END;                                                                  
                                                                                
        WHEN ( 'U3' )                                                           
          /* **************************************************** */            
          /*  UFØREPENSJON                                        */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P060_LES_U3_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RU61';                              
          END;                                                                  
                                                                                
        WHEN ( 'UF' )                                                           
          /* **************************************************** */            
          /*  UFØREPENSJON                                        */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P183_LES_UF_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R183';                              
          END;                                                                  
                                                                                
        WHEN ( 'US' )                                                           
          /* **************************************************** */            
          /*                                                      */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P070_LES_US_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R071';                              
          END;                                                                  
                                                                                
        WHEN ( 'EP' )                                                           
          /* **************************************************** */            
          /*  ETTERLATT-PENSJON                                   */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P080_LES_EP_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R081';                              
          END;                                                                  
                                                                                
        WHEN ( 'E3' )                                                           
          /* **************************************************** */            
          /*  ETTERLATT-PENSJON                                   */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P080_LES_E3_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN81';                              
          END;                                                                  
                                                                                
        WHEN ( 'EE' )                                                           
          /* **************************************************** */            
          /*  ETTERLATT-PENSJON                                   */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P080_LES_EE_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RU81';                              
          END;                                                                  
                                                                                
        WHEN ( 'EF' )                                                           
          /* **************************************************** */            
          /*  ETTERLATT FAMILIEPLEIER                             */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P090_LES_EF_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R091';                              
          END;                                                                  
                                                                                
        WHEN ( 'E4' )                                                           
          /* **************************************************** */            
          /*  ETTERLATT FAMILIEPLEIER                             */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P090_LES_E4_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RN91';                              
          END;                                                                  
                                                                                
        WHEN ( 'FB' )                                                           
          /* **************************************************** */            
          /*  FORELDRELØSE BARN                                   */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P100_LES_FB_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R101';                              
          END;                                                                  
                                                                                
                                                                                
        WHEN ( 'BP' )                                                           
          /* **************************************************** */            
          /*  BANEPENSJONIST                                      */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P110_LES_BP_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R111';                              
          END;                                                                  
                                                                                
        WHEN ( 'B6' )                                                           
          /* **************************************************** */            
          /*  BANEPENSJONIST                                      */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P110_LES_B6_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RNB1';                              
          END;                                                                  
                                                                                
        WHEN ( 'FT' )                                                           
          /* **************************************************** */            
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P120_LES_FT_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R121';                              
          END;                                                                  
                                                                                
        WHEN ( 'F7' )                                                           
          /* **************************************************** */            
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P120_LES_F7_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RNC1';                              
          END;                                                                  
                                                                                
        WHEN ( 'FO' )                                                           
          /* **************************************************** */            
          /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P120_LES_FO_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RUC1';                              
          END;                                                                  
                                                                                
        WHEN ( 'E1' )                                                           
          /* **************************************************** */            
          /*  ENDRINGSBLANKETT                                    */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P140_LES_E1_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R141';                              
          END;                                                                  
                                                                                
        WHEN ( 'EN' )                                                           
          /* **************************************************** */            
          /*  ENDRINGSBLANKETT                                    */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P140_LES_EN_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RUE1';                              
          END;                                                                  
                                                                                
        WHEN ( 'O1' )                                                           
          /* **************************************************** */            
          /*  OPPHØRSBLANKETT .   DØD                             */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P160_LES_O1_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R161';                              
          END;                                                                  
                                                                                
        WHEN ( 'O2' )                                                           
          /* **************************************************** */            
          /*  ANDRE OPPHØRSÅRSAKER                                */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P170_LES_O2_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R171';                              
          END;                                                                  
        WHEN ( 'AF' )                                                           
          /* **************************************************** */            
          /*  AVTALEFESTET PENSJON (AFP)                          */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P190_LES_AF_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'R191';                              
          END;                                                                  
        WHEN ( 'KF' )                                                           
          /* **************************************************** */            
          /*  AVTALEFESTET PENSJON (AFP)                          */            
          /* **************************************************** */            
          DO;                                                                   
             CALL P190_LES_KF_TRANS;                                            
                                                                                
             IF   FEIL_MELD_NR              >      0       THEN                 
               DO;                                                              
                                                                                
                  /* ******************************************** */            
                  /* FEIL VED SKRIV AV TRANS                      */            
                  /* ******************************************** */            
                                                                                
                  GO TO RETUR;                                                  
               END;                                                             
          TRANS_OPPL_OMR.TRANS_RETURKODE = 'RUJ1';                              
          END;                                                                  
                                                                                
        OTHERWISE                                                               
          /* **************************************************** */            
          /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */            
          /* **************************************************** */            
          DO;                                                                   
   L190:                                                                        
             FEIL_MELD_NR           =   497;                                    
             FEIL_VED_LABEL         =  '190';                                   
          END;                                                                  
                                                                                
      END;   /* *****      SELECT ( TRANSTYPE )            ****** */            
                                                                                
  RETUR:                                                                        
                                                                                
  END P40_OVERFØR_TIL_BLANKETT;                                                 
                                                                                
                                                                                
  BLANKSTILL_VENTETRANS_LINJE: PROC;                                            
                                                                                
     DO K =  1 TO 14                                                            
        S001482O.RDATOO(K)  = LOW(6);                                           
        S001482O.BLTO(K)    = LOW(2);                                           
        S001482O.VDATOO(K)  = LOW(4);                                           
      END;                                                                      
  END BLANKSTILL_VENTETRANS_LINJE;                                              
                                                                                
                                                                                
  FJERN_VT_TRANS:                                                               
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    FJERNER TRANHIST MED ØNSKET KEY.                              */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL FJERN_VT_TRANS;                                          */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
                                                                                
  /***  ÅPNER VT_BASEN                            *********/                    
                                                                                
                                                                                
  IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                         
      CALL DATABASE('OPEN');                                                    
  ELSE                                                                          
      UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                                 
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
     GO TO L999;                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* TAR ET GHU-KALL,FØR DLET.                                      */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
                                                                                
    CALL PLITDLI                        (W02_PARM_CT_5,                         
                                         W02_GHU,                               
                                         VT1,                                   
                                         W01_IO,                                
                                         SSA1_VT0PERSN,                         
                                         SSA3_TRANHIST);                        
                                                                                
    IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                              
      ! VT1.STATUS_KODE         ^=       '  '         THEN                      
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED LES   AV :  TRANHIST                */                   
           /* ******************************************** */                   
  L110:                                                                         
           FEIL_MELD_NR             =       500 ;                               
           FEIL_VED_LABEL           =      '110';                               
           DB_STATUS_KODE           =       VT1.STATUS_KODE;                    
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
                                                                                
        /* ******************************************** */                      
        /* KALLET GHU GIKK OK . DELETER TRANHIST.       */                      
        /* ******************************************** */                      
                                                                                
    CALL PLITDLI                        (W02_PARM_CT_3,                         
                                         W02_DLET,                              
                                         VT1,                                   
                                         W01_IO);                               
                                                                                
    IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                              
      ! VT1.STATUS_KODE         ^=       '  '         THEN                      
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED DELETE  AV :  TRANHIST              */                   
           /* ******************************************** */                   
  L120:                                                                         
           FEIL_MELD_NR             =       500 ;                               
           FEIL_VED_LABEL           =      '120';                               
           GO   TO  RETUR;                                                      
        END;                                                                    
  RETUR:                                                                        
                                                                                
                                                                                
                                                                                
  /*** LUKKER VT_BASEN                            *********/                    
                                                                                
  CALL DATABASE('CLOSE');                                                       
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
     GO TO L999;                                                                
                                                                                
                                                                                
  END FJERN_VT_TRANS;                                                           
                                                                                
  OVER_OG_UT:    PROC(KODE);                                                    
     DCL KODE                 CHAR (1);                                         
     TRANSKODE = 'R031';                                                        
     CALL DATABASE('CLOSE');                                                    
     EXEC CICS XCTL  PROGRAM('R0010301') COMMAREA(KOM_OMR);                     
                                                                                
                                                                                
  END OVER_OG_UT;                                                               
                                                                                
                                                                                
  SSA_BEHANDLING:                                                               
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    BYGGER OPP SSA FOR LES AV TRANHIST.                           */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SSA_BEHANDLING;                                          */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
                                                                                
   FEILMELDING_SATT = '1'B;                                                     
   LINJENR          = 0;                                                        
                                                                                
   DO UNTIL (^FEILMELDING_SATT);                                                
                                                                                
      FEILMELDING_SATT = '0'B;                                                  
                                                                                
   /***  LESER INN DATA FRA VENTETRANSBILDET.  */                               
                                                                                
                                                                                
      EXEC CICS RECEIVE MAP('S001482')                                          
                               MAPSET('S001V03')SET (BMSMAPBR);                 
                                                                                
      EXEC CICS PURGE MESSAGE;                                                  
                                                                                
      IF S001482I.FUNKSJONSKODEL > 0 THEN                                       
         DO;                                                                    
            FUNKSJONSKODE = S001482I.FUNKSJONSKODEI;                            
            CALL OVER_OG_UT(FUNKSJONSKODE);                                     
         END;                                                                   
      /***  SJEKKER OM LINJENR                                                  
                                ER GYLDIG. ******/                              
                                                                                
      IF S001482I.LINJENRL > 0 THEN                                             
         DO;                                                                    
                                                                                
            IF ^ F_NUMERISK(S001482I.LINJENRI) THEN                             
               DO;                                                              
                  MAP_MELDING =                                                 
                               'TEGN SOM IKKE ER NUMERISK I LINJENR';           
                  FEILMELDING_SATT      = '1'B;                                 
                  S001482I.LINJENRL     = -1; /*CURSOR POS*/                    
                  S001482O.LINJENRA     = 'I';                                  
                  S001482O.MELDING6O    = MAP_MELDING;                          
                  EXEC CICS SEND MAP('S001482')                                 
                                       MAPSET('S001V03') CURSOR;                
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  LINJENR  = S001482I.LINJENRI;                                 
                  IF LINJENR < 1 !                                              
                            (LINJENR + 1 > ANTALL_LEST &                        
                             ANTALL_LEST < 14) !                                
                                           LINJENR > 14  THEN                   
                     DO;                                                        
                        MAP_MELDING = 'UGYLDIG LINJENUMMER';                    
                        FEILMELDING_SATT   = '1'B;                              
                        S001482I.LINJENRL  =                                    
                                             -1; /* CURSOR POS */               
                        S001482O.MELDING6O = MAP_MELDING;                       
                        EXEC CICS SEND MAP('S001482')                           
                                          MAPSET('S001V03') CURSOR;             
                     END;                                                       
               END;                                                             
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
            S001482O.FNRO            = PIC_11;                                  
            S001482O.NAVNO           = B02.RF0PERSN (14).NAVN;                  
            S001482O.TKNRO           = B02.RF0PERSN (14).TKNR;                  
            S001482O.SPRÅKO          = B02.RF0PERSN (14).SPRÅK;                 
            S001482O.CICS_INFOO = CICS_NAVN;                                    
            S001482O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                   
         END;                                                                   
  END;                                                                          
  IF LINJENR > 0 THEN                                                           
     CALL BYGG_SSA_FNR;                                                         
                                                                                
                                                                                
  END SSA_BEHANDLING;                                                           
                                                                                
                                                                                
  SEARCH_FNR_BEHANDLING:                                                        
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    BYGGER OPP SEARH_FNR.                                         */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SEARCH_FNR_BEHANDLING;                                   */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
   FEILMELDING_SATT = '1'B;                                                     
                                                                                
   DO UNTIL (^FEILMELDING_SATT);                                                
                                                                                
      FEILMELDING_SATT = '0'B;                                                  
                                                                                
      /***  LESER INN DATA FRA VENTETRANSBILDET.  */                            
                                                                                
                                                                                
      EXEC CICS RECEIVE MAP('S001483')                                          
                                 MAPSET('S001V03')SET (BMSMAPBR);               
                                                                                
                                                                                
      IF S001483I.FUNKSJONSKODEL > 0 THEN                                       
         DO;                                                                    
            FUNKSJONSKODE = S001483I.FUNKSJONSKODEI;                            
                                                                                
            IF FUNKSJONSKODE = 'V' THEN                                         
               DO;                                                              
                  B02.STATUS.VIRK_DATO_ÅMD(13) = 0;                             
                  B02.STATUS.DØDSDATO_ÅMD(13) = 0;                              
               END;                                                             
                                                                                
            CALL OVER_OG_UT(FUNKSJONSKODE);                                     
         END;                                                                   
                                                                                
                                                                                
      /***  SJEKKER OM LINJENR                                                  
                                       ER GYLDIG. ******/                       
                                                                                
                                                                                
      IF S001483I.LINJENRL > 0 THEN                                             
         DO;                                                                    
                                                                                
            IF ^F_NUMERISK(S001483I.LINJENRI) THEN                              
               DO;                                                              
                  MAP_MELDING =                                                 
                               'TEGN SOM IKKE ER NUMERISK I LINJENR';           
                  FEILMELDING_SATT      = '1'B;                                 
                  S001483I.LINJENRL     = -1; /*CURSOR POS*/                    
                  S001483O.LINJENRA     = 'I';                                  
                  S001483O.MELDING6O    = MAP_MELDING;                          
                                                                                
                  EXEC CICS SEND MAP('S001483')                                 
                                     MAPSET('S001V03') CURSOR;                  
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  LINJENR  = S001483I.LINJENRI;                                 
                  IF LINJENR < 1 !                                              
                                (LINJENR + 1 > ANTALL_LEST &                    
                                ANTALL_LEST < 20) !                             
                                             LINJENR > 20  THEN                 
                     DO;                                                        
                        MAP_MELDING = 'UGYLDIG LINJENUMMER';                    
                        FEILMELDING_SATT   = '1'B;                              
                        S001483I.LINJENRL  =                                    
                                             -1; /* CURSOR POS*/                
                        S001483O.MELDING6O = MAP_MELDING;                       
                                                                                
                        EXEC CICS SEND MAP('S001483')                           
                                             MAPSET('S001V03') CURSOR;          
                     END;                                                       
               END;                                                             
         END;                                                                   
                                                                                
      END;                                                                      
                                                                                
   /***  BYGGER SEARCH_FNR.  ***/                                               
                                                                                
   IF LINJENR > 0 THEN                                                          
       SEARCH_FNR    = S001483O.FNRO(LINJENR);                                  
                                                                                
   RETUR:                                                                       
                                                                                
                                                                                
   END SEARCH_FNR_BEHANDLING;                                                   
                                                                                
                                                                                
                                                                                
          /* ************************************************** */              
          /* KONTROLL AV ACF2 FOR TILLGANGE TIL TKNR            */              
          /*                                                    */              
          /*  FIRST GANG PIC_11 ER ZERO                         */              
          /* ************************************************** */              
 KONTROLL_ACF2_TKNR: PROC;                                                      
                                                                                
                IF PIC_11 = 0 THEN                                              
                      BO_TKNR  = 0001;                                          
                ELSE                                                            
                IF PIC_11 > 0 THEN                                              
                      BO_TKNR            = B02.RF0PERSN.TKNR(14);               
                IF BO_TKNR > 0  THEN                                            
                CALL  KONTROLL_ACF2;                                            
                IF FEIL_MELD_NR = 0      &                                      
                   B02.RF0PERSN.PERSN_KODE (14)  = 'S'  THEN                    
                  DO;                                                           
                     FUNKSJONSKODE  = 'M';                                      
                     CALL KONTROLL_ACF2     ;                                   
                  END;                                                          
                                                                                
                FUNKSJONSKODE = 'V';                                            
                                                                                
 END KONTROLL_ACF2_TKNR;                                                        
                                                                                
  VELG_BEHANDLINGSKODE:                                                         
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    UTFØRER BEHANDLING ETTER VALGT KODE.                          */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL VELG_BEHANDLINGSKODE;                                    */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
  FEILMELDING_SATT = '1'B;                                                      
                                                                                
  DO UNTIL (^FEILMELDING_SATT);                                                 
                                                                                
     FEILMELDING_SATT = '0'B;                                                   
     FEIL_MELD_NR     = 0;                                                      
     BEH_KODE = S001482I.BEHKODEI;                                              
                                                                                
     SELECT(BEH_KODE);                                                          
       WHEN('E')                                                                
                                                                                
       /***  FJERNING AV VENTETRANSOPPLYSNIGER    ***********/                  
                                                                                
         DO;                                                                    
            CALL HENT_SVAR_OG_BEKREFT;                                          
                                                                                
            IF S001484I.FJERNEI = 'B' THEN                                      
               DO;                                                              
                                                                                
                  /***  FJERNER ØNSKEDE DATA                                    
                                        FRA VENTEDATABASE  ***********/         
                                                                                
                                                                                
                  CALL FJERN_VT_TRANS;                                          
                  IF FEIL_MELD_NR > 0 THEN                                      
                 DO;                                                            
                     GO TO RETUR;                                               
                 END;                                                           
                                                                                
                  /***  SKRIVER DET SOM ER                                      
                                    FJERNET UT PÅ SKRIVER. *********/           
                                                                                
                  EXEC CICS LINK PROGRAM('R0010470')                            
                                                     COMMAREA(KOM_OMR);         
                  IF FEIL_MELD_NR > 0 THEN                                      
                 DO;                                                            
                     GO TO RETUR;                                               
                 END;                                                           
                                                                                
                                                                                
                                                                                
               END;                                                             
                                                                                
           /***  BYGGER SEARCH_FNR.  ***/                                       
                                                                                
            FØDSNUMMER = PIC_11;                                                
                                                                                
            TRANSKODE  = 'R48B';                                                
                                                                                
         END;                                                                   
                                                                                
       WHEN('R')                                                                
                                                                                
         /***  ENDRING/REG. AV VENTETRANSOPPLYSNIGER  ********/                 
                                                                                
         DO;                                                                    
            /***  GÅR VIDERE MED VENTETRANSOPPLYSNINGENE                        
                        INN I HOVEDSYSTEMET SOM NY-REG.        ***/             
                                                                                
                                                                                
            /* INITIERING AV DIV. STYREPARAMETERE    */                         
                                                                                
            DIV_PARAM_OMR.FRA_CICS        = '0'B;                               
            DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B;                               
            DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                               
            DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                               
                                                                                
            STYRINGS_OMR.STYREKODE = TRANS_OPPL_OMR.BLANKETTYPE ;               
                                                                                
                                                                                
            /* SAKSBEHANDLERDIALOGEN : DIALOG OG KONTROLL AV */                 
            /* REGISTRERT BLANKETT, DVS TRANS FRA VENTEBASEN */                 
                                                                                
            EXEC CICS LINK PROGRAM('R0013301')                                  
                                               COMMAREA(KOM_OMR);               
                                                                                
                                                                                
            IF FEIL_MELD_NR > 0 THEN                                            
                 DO;                                                            
                     GO TO RETUR;                                               
                 END;                                                           
                                                                                
                                                                                
            IF FUNKSJONSKODE    ^= 'B' THEN                                     
               DO;                                                              
                  /***  FJERNER ØNSKEDE DATA                                    
                                      FRA VENTEDATABASE  ***********/           
                                                                                
                  CALL FJERN_VT_TRANS;                                          
                                                                                
                                                                                
                  IF FEIL_MELD_NR > 0 THEN                                      
                     DO;                                                        
                        GO TO RETUR;                                            
                     END;                                                       
                                                                                
                  /***  SKRIVER DET SOM ER                                      
                                    FJERNET UT PÅ SKRIVER. *********/           
                                                                                
               /* EXEC CICS LINK PROGRAM('R0010470')                            
                                               COMMAREA(KOM_OMR);               
                  IF FEIL_MELD_NR > 0 THEN                                      
                     GO TO RETUR;*/                                             
                                                                                
                  /* KONTROLLEN GÅR TIL BEHANDLE_TRANS */                       
                                                                                
                  EXEC CICS XCTL PROGRAM('R0012001')                            
                                               COMMAREA(KOM_OMR);               
               END;                                                             
                                                                                
            KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    =                             
                                 ADDR(KOM_OMR.STYRINGS_OMR);                    
                                                                                
            TRANSKODE = 'R48B';                                                 
                                                                                
            STYREKODE = BLANKETTYPE;                                            
                                                                                
            FØDSNUMMER = PIC_11;                                                
                                                                                
            FUNKSJONSKODE = 'V';                                                
                                                                                
                                                                                
         END;                                                                   
                                                                                
       WHEN('F')                                                                
                                                                                
         /*----------------------------------------------------------*/         
         /*    FORESPØRSEL PÅ VENTETRANSOPPLYSNIGER                  */         
         /*    SKRIVER OPPLYSNINGENE UT PÅ SKJERM                    */         
         /*----------------------------------------------------------*/         
         DO;                                                                    
            TRANS_OPPL_OMR.BLANKETTYPE = W_BLTYPE;                              
            EXEC CICS LINK PROGRAM('R0010470')                                  
                                               COMMAREA(KOM_OMR);               
            IF FEIL_MELD_NR > 0 THEN                                            
                 DO;                                                            
                     GO TO RETUR;                                               
                 END;                                                           
                                                                                
                                                                                
            FØDSNUMMER = PIC_11;                                                
                                                                                
            TRANSKODE = 'R48B';                                                 
                                                                                
                                                                                
        END;                                                                    
                                                                                
      OTHERWISE                                                                 
        DO;                                                                     
           MAP_MELDING        = 'UGYLDIG BEHANDLINGSKODE';                      
           FEILMELDING_SATT   = '1'B;                                           
           S001482I.BEHKODEL  = -1; /* CURSOR POS */                            
           S001482I.LINJENRL  =  0; /* CURSOR POS NULLES */                     
           S001482O.MELDING6O = MAP_MELDING;                                    
                                                                                
           EXEC CICS SEND MAP('S001482')                                        
                                         MAPSET('S001V03') CURSOR;              
                                                                                
           EXEC CICS RECEIVE MAP('S001482')                                     
                                  MAPSET('S001V03')   SET(BMSMAPBR);            
           IF S001482I.FUNKSJONSKODEL > 0 THEN                                  
              DO;                                                               
                 FUNKSJONSKODE = S001482I.FUNKSJONSKODEI;                       
                 CALL OVER_OG_UT(FUNKSJONSKODE);                                
              END;                                                              
        END;                                                                    
     END;                                                                       
  END;                                                                          
                                                                                
  RETUR:                                                                        
  END VELG_BEHANDLINGSKODE;                                                     
                                                                                
                                                                                
  FEILBEH:                                                                      
                                                                                
   EXEC CICS SYNCPOINT ROLLBACK;                                                
                                                                                
   S001481I.FNRL      = -1;       /* CURSOR POS */                              
                                                                                
  ALLOCATE S001481O;                                                            
  S001481O.FNRO     = FØDSNUMMER;                                               
  IF FEIL_MELD_NR > 650 &                                                       
     FEIL_MELD_NR < 660 THEN                                                    
      S001481O.MELDINGO  = ACF2_FEIL(FEIL_MELD_NR);                             
  ELSE                                                                          
     S001481O.MELDINGO  = 'FEIL HAR OPPSTÅTT.PRØV PÅNYTT.HVIS FORTSATT'         
                                                 !!' FEIL,SØK HJELP.';          
   S001481O.CICS_INFOO = CICS_NAVN ;                                            
   S001481O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                            
   EXEC CICS SEND MAP('S001481')                                                
                             MAPSET('S001V03') CURSOR ERASE;                    
                                                                                
   KOM_OMR.PCB_UIB_PEKER = NULL;                                                
                                                                                
                                                                                
   IF S001481I.FNRL > 0 THEN                                                    
                                                                                
       TRANSKODE = 'R48B';                                                      
                                                                                
   ELSE                                                                         
       IF  S001481I.REGDATOL  > 0 !                                             
           S001481I.VIRKDATOL  > 0 THEN                                         
                                                                                
         TRANSKODE = 'R48A';                                                    
                                                                                
      ELSE                                                                      
                                                                                
         TRANSKODE = 'R048';                                                    
                                                                                
                                                                                
  EXEC CICS XCTL PROGRAM('R0010480')                                            
                                       COMMAREA(KOM_OMR);                       
                                                                                
                                                                                
                                                                                
  %INCLUDE R0019901;             /*  DATO_KONTROLL_MÅ             */            
                                                                                
  %INCLUDE R0019902;             /*  F_KJØNN                      */            
                                                                                
  %INCLUDE R0019904;             /*  FNR_KONTROLL                 */            
                                                                                
  %INCLUDE R0019910;             /*  NUMERISK-KONTROLL            */            
                                                                                
                                                                                
 /*INCLUDE R0019996;                 DATO_MHÅ     KONTROLL      */              
                                                                                
  %INCLUDE R0019912;             /*  NUM-> CHAR                   */            
                                                                                
  %INCLUDE R0019956;             /*  P9956_BER_G_CICS             */            
                                                                                
                                                                                
  %INCLUDE R0015205;             /*  P050_LES_AP_TRANS            */            
  %INCLUDE R00152N5;             /*  P050_LES_A1_TRANS            */            
                                                                                
  %INCLUDE R0015206;             /*  P060_LES_UP_TRANS            */            
  %INCLUDE R00152N6;             /*  P060_LES_U2_TRANS            */            
  %INCLUDE R00152U6;             /*  P060_LES_U3_TRANS            */            
                                                                                
  %INCLUDE R0015207;             /*  P070_LES_US_TRANS            */            
                                                                                
  %INCLUDE R0015208;             /*  P080_LES_EP_TRANS            */            
  %INCLUDE R00152N8;             /*  P080_LES_E3_TRANS            */            
  %INCLUDE R00152U8;             /*  P080_LES_EE_TRANS            */            
                                                                                
  %INCLUDE R0015209;             /*  P090_LES_EF_TRANS            */            
  %INCLUDE R00152N9;             /*  P090_LES_E4_TRANS            */            
                                                                                
  %INCLUDE R0015210;             /*  P090_LES_FB_TRANS            */            
                                                                                
  %INCLUDE R0015211;             /*  P110_LES_BP_TRANS            */            
  %INCLUDE R00152NB;             /*  P110_LES_B6_TRANS            */            
                                                                                
  %INCLUDE R0015212;             /*  P120_LES_FT_TRANS            */            
  %INCLUDE R00152NC;             /*  P120_LES_F7_TRANS            */            
  %INCLUDE R00152UC;             /*  P120_LES_FO_TRANS            */            
                                                                                
  %INCLUDE R0015214;             /*  P140_LES_E1_TRANS            */            
  %INCLUDE R00152UE;             /*  P140_LES_EN_TRANS            */            
                                                                                
  %INCLUDE R0015216;             /*  P160_LES_O1_TRANS            */            
                                                                                
  %INCLUDE R0015217;             /*  P170_LES_O2_TRANS            */            
                                                                                
  %INCLUDE R0015219;             /*  P190_LES_AF_TRANS            */            
  %INCLUDE R00152UJ;            /*   P190_LES_KF_TRANS            */            
                                                                                
  %INCLUDE R0015220;             /*  P183_LES_UF_TRANS     UF !!  */            
                                                                                
  %INCLUDE R0019988;             /*  KONV_HÅMD_ÅMD                */            
  %INCLUDE R0019990;             /*  KONV_HÅMD_DMÅ                */            
  %INCLUDE R0019989;             /*  KONV_HÅMD_MÅ                 */            
  %INCLUDE R0019983;             /*  KONV_ÅMD_HÅMD               */             
  %INCLUDE R0019985;             /*  KONV_DMÅ_HÅMD               */             
  %INCLUDE R0019984;             /*  KONV_MÅ_HÅMD               */              
  %INCLUDE R0019998;             /*  ACF2_MELD                  */              
  %INCLUDE R0019999;             /*  ACF2_KONTROLL              */              
                                                                                
  %PRINT;                                                                       
 END R001048;                                                                   
