 /*       SIST ENDRET 24/06-91 11.52.00 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 19/06-91 10.17.22 AV   HERMAN                   */00000010
 /*       SIST ENDRET 08/05-91 13.23.56 AV   DYBVIK                   */00000020
 /******************************************************************* */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /************************                                            */00000050
 /*  PROGRAM-IDENT : R001TK03 - VALG AV FUNKSJON - HOVEDPROGRAM       */00000060
 /*  PROGRAM-SPRÅK : PLI / CICS                                       */00000070
 /*  PROGRAMMERER  : TUYEN                                            */00000080
 /*  PROGRAM LAGET : NOV 90                                           */00000090
 /******************************************************************* */00000100
 /*HENSIKT:                                                           */00000110
 /************                                                        */00000120
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN TIL TK-REGISTER.         */00000130
 /*  PROGRAMMETS TRANSKODE ER RT03.                                   */00000140
 /*  PROGRAMMET BLIR AKTIVISERT NÅR OPERATØREN HAR TASTET INN         */00000150
 /*  FUNKSJONSKODEN, MAP S001013 - MAPSET S001TK3.                    */00000160
 /*  PROGRAMMET LESER INN FUNKSJONSKODEN, KONTROLLERER DEN OG SENDER  */00000170
 /*  UT NESTE BILDE SOM ER AVHENGIG AV FUNKSJONSKODEN :               */00000180
 /*   R --->  MAP S001014 MAPSET S001TK3 - MENY REGISTRERING          */00000190
 /*   H --->  MAP S001018 MAPSET S001T23 - MENY HISTORIKK             */00000200
 /*   F --->  MAP S001019 MAPSET S001T33 - MENY FORESPØRSLER          */00000210
 /*   U --->  MAP S001001 MAPSET S001T73 - MENY UTSKRIFT              */00000220
 /*   X --->  MAP S001012 MAPSET S001TK3 - PAUSEBILDE                 */00000230
 /*                                                                   */00000240
 /******************************************************************* */00000250
 /*PROGRAMTILKNYTTING:                                                */00000260
 /**********************                                              */00000270
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANS-ID = RT03.         */00000280
 /*  DENNE TRANSID SETTES I R001TK02:                                 */00000290
 /*    EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);         */00000300
 /*  KONTROLLEN GÅR VIA CICS TIL FORSKJELLIGE PROGRAM AVHENGIG AV     */00000310
 /*  HVILKEN FUNKSJONSKODE SOM BLIR SATT AV OPERATØREN:               */00000320
 /*  R - REGISTRERING                    - RT04 - R001TK04            */00000330
 /*  H - HISTORIKK                       - RT08 - R001TK08            */00000340
 /*  F - FORESPØRSEL                     - RT09 - R001TK09            */00000350
 /*  U - UTSKRIFT                        - RT70 - R001TK70            */00000360
 /*  X - FRIGJØRE TERMINAL               -      - AVSLUTTES           */00000370
 /*                                                                   */00000380
 /******************************************************************* */00000390
 /*DATASETTOPPLYSNINGER:                                              */00000400
 /*************************                                           */00000410
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000420
 /*                                                                   */00000430
 /******************************************************************* */00000440
 /*FEILMELDINGER:                                                     */00000450
 /*********************                                               */00000460
 /*  'UGYLDIG FUNKSJONSKODE' BLIR SKREVET PÅ SKJERMBILDET             */00000470
 /*  NÅR KODEN IKKE ER GYLDIG                                         */00000480
 /* ***************************************************************** */00000490
 R001TK3:                                                               00000500
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000510
                                                                        00000520
 %PAGE;                                                                 00000530
      %INCLUDE S001TK;     /* MENY MAPSETTET */                         00000540
 %PAGE;                                                                 00000550
      %INCLUDE S001T2;     /* HISTORIKK MAPSETTET */                    00000560
 %PAGE;                                                                 00000570
      %INCLUDE S001T3;     /* FORESPØRSEL MAPSETTET */                  00000580
 %PAGE;                                                                 00000590
      %INCLUDE S001T7;     /* UTSKRIFT MAPSETTET */                     00000600
 %PAGE;                                                                 00000610
      %INCLUDE P001TK03;   /* KOM_OMRÅDE (BASED) */                     00000620
      %INCLUDE P001TK04;   /* AUTORISASJON       */                     00000630
 %PAGE;                                                                 00000640
      %INCLUDE DFHBMSCA;   /* MAP HJELPEFELT          */                00000650
                                                                        00000660
   DCL                                                                  00000670
      COMMAREA_PEKER POINTER,                                           00000680
      IDENT_PEKER    POINTER,                                           00000690
      BMSMAPBR       POINTER;                                           00000700
                                                                        00000710
   DCL                                                                  00000720
      (ADDR,STG,CSTG,NULL,SUBSTR) BUILTIN,                              00000730
      IDENT_BIT      BIT(32) BASED (IDENT_PEKER),                       00000740
      CURSOR_POS     FIXED BIN (15) INIT (-1)   ;                       00000750
                                                                        00000760
 /*-------------------------------------------------------------------*/00000770
                                                                        00000780
   EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                           00000790
   EXEC CICS IGNORE CONDITION MAPFAIL;                                  00000800
                                                                        00000810
                                                                        00000820
   IDENT_PEKER      =  ADDR(BRUKERID );                                 00000830
   KOM_OMR.FUNKSJON = '';                                               00000840
   FUNKTAB          = '';                                               00000850
                                                                        00000860
 /*--------------------------------------------------------*/           00000870
 /* LESER INN BILDE MED FUNKSJONSKODEN SATT                */           00000880
 /*--------------------------------------------------------*/           00000890
                                                                        00000900
   IF SEND_MAP THEN                                                     00000910
      DO;                                                               00000920
         ALLOCATE S001013O;                                             00000930
         EXEC CICS SEND MAP('S001013') MAPSET ('S001TK3') ERASE;        00000940
                                                                        00000950
         SEND_MAP = '0'B;                                               00000960
      END;                                                              00000970
                                                                        00000980
   EXEC CICS RECEIVE MAP('S001013') MAPSET ('S001TK3')                  00000990
               SET(BMSMAPBR);                                           00001000
                                                                        00001010
   FUNKSJONSKODE = S001013I.FUNKSJONSKODEI;                             00001020
                                                                        00001030
   SELECT (FUNKSJONSKODE);                                              00001040
       WHEN('R','r')                                                    00001050
         DO;                                                            00001060
               EXEC CICS HANDLE CONDITION NOTFND(IKKE_FUNNET);          00001070
               EXEC CICS IGNORE CONDITION LENGERR;                      00001080
                                                                        00001090
               EXEC CICS READ DATASET ('BRUKAU')                        00001100
                                INTO  (FUNKTAB)                         00001110
                              RIDFLD  (IDENT_BIT);                      00001120
                                                                        00001130
               KOM_OMR.FUNKSJON = FUNKTAB.FUNK;                         00001140
                                                                        00001150
               TRANSKODE = 'RT04';                                      00001160
                                                                        00001170
               /* SKRIVER MENY-SKJERMBILDE FOR REGISTRERING */          00001180
               ALLOCATE S001014O;                                       00001190
               EXEC CICS SEND MAP('S001014') MAPSET('S001TK3') ERASE;   00001200
         END;                                                           00001210
                                                                        00001220
       WHEN('H','h')                                                    00001230
         DO;                                                            00001240
               EXEC CICS HANDLE CONDITION NOTFND(OK1);                  00001250
               EXEC CICS IGNORE CONDITION LENGERR;                      00001260
                                                                        00001270
               EXEC CICS READ DATASET ('BRUKAU')                        00001280
                                INTO  (FUNKTAB)                         00001290
                              RIDFLD  (IDENT_BIT);                      00001300
                                                                        00001310
               KOM_OMR.FUNKSJON = FUNKTAB.FUNK;                         00001320
               GOTO OK2;                                                00001330
   OK1:                                                                 00001340
               KOM_OMR.FUNKSJON = '';                                   00001350
   OK2:                                                                 00001360
               TRANSKODE = 'RT08';                                      00001370
                                                                        00001380
               /* SKRIVER MENY-SKJERMBILDE FOR HISTORIKK*/              00001390
               ALLOCATE S001018O;                                       00001400
                                                                        00001410
               EXEC CICS SEND MAP('S001018') MAPSET('S001T23')          00001420
                    ERASE;                                              00001430
         END;                                                           00001440
                                                                        00001450
       WHEN('F','f')                                                    00001460
         DO;                                                            00001470
               EXEC CICS IGNORE CONDITION NOTFND;                       00001480
               EXEC CICS IGNORE CONDITION LENGERR;                      00001490
                                                                        00001500
               EXEC CICS READ DATASET ('BRUKAU')                        00001510
                                INTO  (FUNKTAB)                         00001520
                              RIDFLD  (IDENT_BIT);                      00001530
                                                                        00001540
               KOM_OMR.FUNKSJON = FUNKTAB.FUNK;                         00001550
                                                                        00001560
               TRANSKODE       = 'RT09';                                00001570
                                                                        00001580
               /* SKRIVER MENY-SKJERMBILDE FOR FORESPØRSEL */           00001590
               ALLOCATE S001019O;                                       00001600
                                                                        00001610
               EXEC CICS SEND MAP('S001019') MAPSET('S001T33') ERASE;   00001620
         END;                                                           00001630
                                                                        00001640
       WHEN('U','u')                                                    00001650
         DO;                                                            00001660
               EXEC CICS IGNORE CONDITION NOTFND;                       00001670
               EXEC CICS IGNORE CONDITION LENGERR;                      00001680
                                                                        00001690
               EXEC CICS READ DATASET ('BRUKAU')                        00001700
                                INTO  (FUNKTAB)                         00001710
                              RIDFLD  (IDENT_BIT);                      00001720
                                                                        00001730
               KOM_OMR.FUNKSJON = FUNKTAB.FUNK;                         00001740
                                                                        00001750
               TRANSKODE       = 'RT70';                                00001760
                                                                        00001770
               /* SKRIVER MENY-SKJERMBILDE FOR UTSKRIFT */              00001780
               ALLOCATE S001001O;                                       00001790
               S001001I.VALGL  = CURSOR_POS;                            00001800
               EXEC CICS SEND MAP('S001001') MAPSET('S001T73') ERASE;   00001810
         END;                                                           00001820
                                                                        00001830
       WHEN('X','x')                                                    00001840
         DO;                                                            00001850
               /* SKRIVER PAUSEBILDET                           */      00001860
                                                                        00001870
               EXEC CICS SEND MAP ('S001012') MAPSET ('S001TK3')        00001880
                    MAPONLY ERASE ;                                     00001890
               EXEC CICS RETURN                                  ;      00001900
                                                                        00001910
         END;                                                           00001920
                                                                        00001930
       OTHERWISE                                                        00001940
         DO;                                                            00001950
              /* FEILMELDING: 'UGYLDIG FUNKSJONSKODE' SKRIVES  */       00001960
                                                                        00001970
              ALLOCATE S001013O;                                        00001980
              S001013O.FUNKSJONSKODEA = 'I'; /* MDT SET, HIGH INT*/     00001990
              S001013O.FUNKSJONSKODEO =  FUNKSJONSKODE;                 00002000
              S001013O.MELDING1O      = 'UGYLDIG FUNKSJONSKODE'   ;     00002010
                                                                        00002020
              EXEC CICS SEND MAP ('S001013') MAPSET ('S001TK3') ERASE;  00002030
                                                                        00002040
              TRANSKODE    =  'RT03'                        ;           00002050
         END;                                                           00002060
                                                                        00002070
      END;  /*  SELECT  ( ....         )                         */     00002080
                                                                        00002090
  GOTO NESTE;                                                           00002100
                                                                        00002110
  IKKE_FUNNET:                                                          00002120
     S001013O.MELDING1O = 'DU HAR IKKE TILGANG TIL DENNE FUNKSJON!';    00002130
                                                                        00002140
     EXEC CICS SEND MAP('S001013') MAPSET ('S001TK3') ERASE;            00002150
                                                                        00002160
     TRANSKODE     = 'RT03';                                            00002170
                                                                        00002180
  NESTE:                                                                00002190
                                                                        00002200
     EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);             00002210
                                                                        00002220
                                                                        00002230
  FEILBEH:                                                              00002240
   /* SKRIVER PAUSEBILDET                           */                  00002250
                                                                        00002260
   EXEC CICS SEND MAP ('S001012') MAPSET ('S001TK3')                    00002270
                                  MAPONLY  ERASE     ;                  00002280
   EXEC CICS RETURN                                  ;                  00002290
                                                                        00002300
                                                                        00002310
 END R001TK3;                                                           00002320
