 /*       SIST ENDRET 04/05-98 14.28.07 AV   JDA7339                  */00000000
 /*       SIST ENDRET 16/01-98 13.23.19 AV   SPA7339                  */00000010
                                                                        00000020
 R001352:                                                               00000030
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000040
                                                                        00000050
 /* ***************************************************************** */00000060
 /* PROGRAMMERER: PER B.,JANUAR 1982                                  */00000070
 /*                                                                   */00000080
 /* PROGRAMMET BLIR AKTIVISERT VED EXEC CICS LINK FRA:                */00000090
 /*    - AJOURFØR FAMILIESTATUS MED DIALOG                            */00000100
 /*    - AJOURFØR FAMILIESTATUS UTEN DIALOG                           */00000110
 /* UTIFRA STYREKODEN GIS DERETTER KONTROLLEN TIL ET PROGRAM SOM      */00000120
 /* KONTROLLERER TRANSAKSJONEN MOT REGISTERET. (XCTL)                 */00000130
 /*                                                                   */00000140
 /* ***************************************************************** */00000150
                                                                        00000160
 %PAGE;                                                                 00000170
 %INCLUDE P0019908;                  /*  KOM_OMR         */             00000180
                                                                        00000190
 %PAGE;                                                                 00000200
 %INCLUDE P0019906;                  /*  TRANS_OPPL_OMR  */             00000210
                                                                        00000220
 %INCLUDE P0019910;                                                     00000230
                                                                        00000240
 %INCLUDE P0019912;                                                     00000250
 %PAGE;                                                                 00000260
      DCL 1 B01 BASED(B01_PEKER), %INCLUDE P0019921;                    00000270
 %PAGE;                                                                 00000280
      DCL 1 B02 BASED(B02_PEKER), %INCLUDE P0019921;                    00000290
                                                                        00000300
 %PAGE;                                                                 00000310
    /* ************************************************************** */00000320
    /*                                                                */00000330
    /*   FEILMELDINGS-LINJE .                                         */00000340
    /*                                                                */00000350
    /* ************************************************************** */00000360
                                                                        00000370
   DCL   W01_UTLINJE           CHAR (78)     INIT ( (78)' ' );          00000380
                                                                        00000390
   DCL                                                                  00000400
      COMMAREA_PEKER PTR;                                               00000410
   DCL                                                                  00000420
      ( ADDR , CSTG , NULL )   BUILTIN;                                 00000430
   DCL                                                                  00000440
       MAP_MELDING              CHAR(78)      INIT((78)' '),            00000450
       1  FEIL_STRUC,                                                   00000460
          2  FEIL_NR               FIXED DEC(5),                        00000470
          2  FEIL_MELDING          CHAR     (78),                       00000480
          2  KOM_OMR_PEKER         POINTER;                             00000490
                                                                        00000500
 %PAGE;                                                                 00000510
                                                                        00000520
  DCL START_TRANS_OPPL_PEKER     POINTER,                               00000530
      START_TRANS_PEKER          POINTER,                               00000540
      START_DIV_PARAM_PEKER      POINTER;                               00000550
                                                                        00000560
      PROGRAM_ID = 'R0013520';                                          00000570
                                                                        00000580
      SELECT (TRANS_OPPL_OMR.BLANKETTYPE);                              00000590
         WHEN('AP')                                                     00000600
            DO;                                                         00000610
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00000620
                  CALL P10_SJEKK_DØD_AP;                                00000630
                                                                        00000640
               EXEC CICS XCTL PROGRAM('R0010520') COMMAREA(KOM_OMR);    00000650
            END;                                                        00000660
         WHEN('A1')                                                     00000670
            DO;                                                         00000680
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00000690
                  CALL P10_SJEKK_DØD_A1;                                00000700
                                                                        00000710
               EXEC CICS XCTL PROGRAM('R001N520') COMMAREA(KOM_OMR);    00000720
            END;                                                        00000730
         WHEN('AF')                                                     00000740
            DO;                                                         00000750
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00000760
                  CALL P12_SJEKK_DØD_AF;                                00000770
                                                                        00000780
               EXEC CICS XCTL PROGRAM('R0011920') COMMAREA(KOM_OMR);    00000790
            END;                                                        00000800
                                                                        00000810
         WHEN('KF')                                                     00000820
            DO;                                                         00000830
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00000840
                  CALL P12_SJEKK_DØD_KF;                                00000850
                                                                        00000860
               EXEC CICS XCTL PROGRAM('R001UJ20') COMMAREA(KOM_OMR);    00000870
            END;                                                        00000880
                                                                        00000890
         WHEN('UP')                                                     00000900
            DO;                                                         00000910
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00000920
                  CALL P15_SJEKK_DØD_UP;                                00000930
                                                                        00000940
               EXEC CICS XCTL PROGRAM('R0010620') COMMAREA(KOM_OMR);    00000950
            END;                                                        00000960
         WHEN('U2')                                                     00000970
            DO;                                                         00000980
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00000990
                  CALL P15_SJEKK_DØD_U2;                                00001000
                                                                        00001010
               EXEC CICS XCTL PROGRAM('R001N620') COMMAREA(KOM_OMR);    00001020
            END;                                                        00001030
         WHEN('U3')                                                     00001040
            DO;                                                         00001050
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001060
                  CALL P15_SJEKK_DØD_U3;                                00001070
                                                                        00001080
               EXEC CICS XCTL PROGRAM('R001U620') COMMAREA(KOM_OMR);    00001090
            END;                                                        00001100
         WHEN('EP')                                                     00001110
            EXEC CICS XCTL PROGRAM('R0010820') COMMAREA(KOM_OMR);       00001120
         WHEN('E3')                                                     00001130
            EXEC CICS XCTL PROGRAM('R001N820') COMMAREA(KOM_OMR); /*NY*/00001140
         WHEN('EE')                                                     00001150
            EXEC CICS XCTL PROGRAM('R001U820') COMMAREA(KOM_OMR); /*NY*/00001160
 /*UF*/  WHEN('UF')                                               /**/  00001170
            EXEC CICS XCTL PROGRAM('R0011840') COMMAREA(KOM_OMR); /**/  00001180
         WHEN('EF')                                                     00001190
            EXEC CICS XCTL PROGRAM('R0010920') COMMAREA(KOM_OMR);       00001200
         WHEN('E4')                                                     00001210
            EXEC CICS XCTL PROGRAM('R001N920') COMMAREA(KOM_OMR);       00001220
         WHEN('FB')                                                     00001230
            DO;                                                         00001240
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001250
                  CALL P20_SJEKK_DØD_FB;                                00001260
                                                                        00001270
               EXEC CICS XCTL PROGRAM('R0011020') COMMAREA(KOM_OMR);    00001280
            END;                                                        00001290
         WHEN('BP')                                                     00001300
            DO;                                                         00001310
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001320
                  CALL P25_SJEKK_DØD_BP;                                00001330
                                                                        00001340
               EXEC CICS XCTL PROGRAM('R0011120') COMMAREA(KOM_OMR);    00001350
            END;                                                        00001360
         WHEN('B6')                                                     00001370
            DO;                                                         00001380
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001390
                  CALL P25_SJEKK_DØD_B6;                                00001400
                                                                        00001410
               EXEC CICS XCTL PROGRAM('R001NB20') COMMAREA(KOM_OMR);    00001420
            END;                                                        00001430
         WHEN('FT')                                                     00001440
            DO;                                                         00001450
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001460
                  CALL P30_SJEKK_DØD_FT;                                00001470
                                                                        00001480
               EXEC CICS XCTL PROGRAM('R0011220') COMMAREA(KOM_OMR);    00001490
            END;                                                        00001500
         WHEN('F7')                                                     00001510
            DO;                                                         00001520
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001530
                  CALL P30_SJEKK_DØD_F7;                                00001540
                                                                        00001550
               EXEC CICS XCTL PROGRAM('R001NC20') COMMAREA(KOM_OMR);    00001560
            END;                                                        00001570
         WHEN('FO')                                                     00001580
            DO;                                                         00001590
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001600
                  CALL P30_SJEKK_DØD_FO;                                00001610
                                                                        00001620
               EXEC CICS XCTL PROGRAM('R001UC20') COMMAREA(KOM_OMR);    00001630
            END;                                                        00001640
         WHEN('E1')                                                     00001650
            DO;                                                         00001660
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001670
                  CALL P35_SJEKK_DØD_E1;                                00001680
                                                                        00001690
               EXEC CICS XCTL PROGRAM('R0011420') COMMAREA(KOM_OMR);    00001700
            END;                                                        00001710
         WHEN('EN')                                                     00001720
            DO;                                                         00001730
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001740
                  CALL P35_SJEKK_DØD_EN;                                00001750
                                                                        00001760
               EXEC CICS XCTL PROGRAM('R001UE20') COMMAREA(KOM_OMR);    00001770
            END;                                                        00001780
         WHEN('O1')                                                     00001790
            EXEC CICS XCTL PROGRAM('R0011620') COMMAREA(KOM_OMR);       00001800
         WHEN('O2')                                                     00001810
            DO;                                                         00001820
               IF DIV_PARAM_OMR.TRANS_LISTE_INDEX > 1 THEN              00001830
                  CALL P40_SJEKK_DØD_O2;                                00001840
                                                                        00001850
               EXEC CICS XCTL PROGRAM('R0011720') COMMAREA(KOM_OMR);    00001860
            END;                                                        00001870
         OTHERWISE                                                      00001880
            DO;                                                         00001890
               FEIL_MELD_NR    = 606;                                   00001900
            /* CALL SKRIV_FEILMELDING;*/                                00001910
               GO TO L999;                                              00001920
            END;                                                        00001930
      END;                                                              00001940
                                                                        00001950
                                                                        00001960
 P10_SJEKK_DØD_AP:                                                      00001970
   PROC;                                                                00001980
      %INCLUDE P0010501;                                                00001990
                                                                        00002000
      IF APS.FNR_EK > 0 THEN                                            00002010
         CALL P100_SJEKK_DØD_B01(APS.FNR_EK);                           00002020
                                                                        00002030
      DO I = 1 TO APS.BT_ANT;                                           00002040
         CALL P100_SJEKK_DØD_B01(APB.FNR_BARN(I));                      00002050
      END;                                                              00002060
                                                                        00002070
                                                                        00002080
 END P10_SJEKK_DØD_AP;                                                  00002090
                                                                        00002100
 P10_SJEKK_DØD_A1:                                                      00002110
   PROC;                                                                00002120
      %INCLUDE P001N501;                                                00002130
                                                                        00002140
      IF A1S.FNR_EK > 0 THEN                                            00002150
         CALL P100_SJEKK_DØD_B01(A1S.FNR_EK);                           00002160
                                                                        00002170
      DO I = 1 TO A1S.BT_ANT;                                           00002180
         CALL P100_SJEKK_DØD_B01(A1B.FNR_BARN(I));                      00002190
      END;                                                              00002200
                                                                        00002210
                                                                        00002220
 END P10_SJEKK_DØD_A1;                                                  00002230
                                                                        00002240
                                                                        00002250
 P12_SJEKK_DØD_AF:                                                      00002260
   PROC;                                                                00002270
      %INCLUDE P0011901;                                                00002280
                                                                        00002290
      IF AFP.FNR_EK > 0 THEN                                            00002300
         CALL P100_SJEKK_DØD_B01(AFP.FNR_EK);                           00002310
                                                                        00002320
                                                                        00002330
 END P12_SJEKK_DØD_AF;                                                  00002340
                                                                        00002350
                                                                        00002360
 P12_SJEKK_DØD_KF:                                                      00002370
   PROC;                                                                00002380
      %INCLUDE P001UJ01;                                                00002390
                                                                        00002400
      IF KFP.FNR_EK > 0 THEN                                            00002410
         CALL P100_SJEKK_DØD_B01(KFP.FNR_EK);                           00002420
                                                                        00002430
 END P12_SJEKK_DØD_KF;                                                  00002440
                                                                        00002450
                                                                        00002460
 P15_SJEKK_DØD_UP:                                                      00002470
   PROC;                                                                00002480
      %INCLUDE P0010601;                                                00002490
                                                                        00002500
      IF UPS.FNR_EK > 0 THEN                                            00002510
         CALL P100_SJEKK_DØD_B01(UPS.FNR_EK);                           00002520
                                                                        00002530
      DO I = 1 TO UPS.BT_ANT;                                           00002540
         CALL P100_SJEKK_DØD_B01(UPB.FNR_BARN(I));                      00002550
      END;                                                              00002560
                                                                        00002570
                                                                        00002580
 END P15_SJEKK_DØD_UP;                                                  00002590
                                                                        00002600
 P15_SJEKK_DØD_U2:                                                      00002610
   PROC;                                                                00002620
      %INCLUDE P001N601;                                                00002630
                                                                        00002640
      IF U2S.FNR_EK > 0 THEN                                            00002650
         CALL P100_SJEKK_DØD_B01(U2S.FNR_EK);                           00002660
                                                                        00002670
      DO I = 1 TO U2S.BT_ANT;                                           00002680
         CALL P100_SJEKK_DØD_B01(U2B.FNR_BARN(I));                      00002690
      END;                                                              00002700
                                                                        00002710
                                                                        00002720
 END P15_SJEKK_DØD_U2;                                                  00002730
                                                                        00002740
                                                                        00002750
 P15_SJEKK_DØD_U3:                                                      00002760
   PROC;                                                                00002770
      %INCLUDE P001U601;                                                00002780
                                                                        00002790
      IF U3S.FNR_EK > 0 THEN                                            00002800
         CALL P100_SJEKK_DØD_B01(U3S.FNR_EK);                           00002810
                                                                        00002820
                                                                        00002830
 END P15_SJEKK_DØD_U3;                                                  00002840
                                                                        00002850
                                                                        00002860
 P20_SJEKK_DØD_FB:                                                      00002870
   PROC;                                                                00002880
      %INCLUDE P0011001;                                                00002890
                                                                        00002900
                                                                        00002910
      DO I = 2 TO 12 WHILE(BARN.FNR_B(I) > 0);                          00002920
         CALL P100_SJEKK_DØD_B01(BARN.FNR_B(I));                        00002930
      END;                                                              00002940
                                                                        00002950
                                                                        00002960
 END P20_SJEKK_DØD_FB;                                                  00002970
                                                                        00002980
                                                                        00002990
 P25_SJEKK_DØD_BP:                                                      00003000
   PROC;                                                                00003010
      %INCLUDE P0011101;                                                00003020
                                                                        00003030
                                                                        00003040
      DO I = 2 TO 10 WHILE (BPB.TAB.FNR_BARN(I) > 0);                   00003050
         CALL P100_SJEKK_DØD_B01(BPB.TAB.FNR_BARN(I));                  00003060
      END;                                                              00003070
                                                                        00003080
                                                                        00003090
 END P25_SJEKK_DØD_BP;                                                  00003100
                                                                        00003110
 P25_SJEKK_DØD_B6:                                                      00003120
   PROC;                                                                00003130
      %INCLUDE P001NB01;                                                00003140
                                                                        00003150
                                                                        00003160
      DO I = 2 TO 10 WHILE (B6B.TAB.FNR_BARN(I) > 0);                   00003170
         CALL P100_SJEKK_DØD_B01(B6B.TAB.FNR_BARN(I));                  00003180
      END;                                                              00003190
                                                                        00003200
                                                                        00003210
 END P25_SJEKK_DØD_B6;                                                  00003220
                                                                        00003230
                                                                        00003240
 P30_SJEKK_DØD_FT:                                                      00003250
   PROC;                                                                00003260
      %INCLUDE P0011201;                                                00003270
                                                                        00003280
      IF FTS.FNR_EK > 0 THEN                                            00003290
         CALL P100_SJEKK_DØD_B01(FTS.FNR_EK);                           00003300
                                                                        00003310
      DO I = 1 TO FTS.BT_ANT;                                           00003320
         CALL P100_SJEKK_DØD_B01(FTB.FNR_BARN(I));                      00003330
      END;                                                              00003340
                                                                        00003350
                                                                        00003360
 END P30_SJEKK_DØD_FT;                                                  00003370
                                                                        00003380
 P30_SJEKK_DØD_F7:                                                      00003390
   PROC;                                                                00003400
      %INCLUDE P001NC01;                                                00003410
                                                                        00003420
      IF F7S.FNR_EK > 0 THEN                                            00003430
         CALL P100_SJEKK_DØD_B01(F7S.FNR_EK);                           00003440
                                                                        00003450
      DO I = 1 TO F7S.BT_ANT;                                           00003460
         CALL P100_SJEKK_DØD_B01(F7B.FNR_BARN(I));                      00003470
      END;                                                              00003480
                                                                        00003490
                                                                        00003500
 END P30_SJEKK_DØD_F7;                                                  00003510
                                                                        00003520
 P30_SJEKK_DØD_FO:                                                      00003530
   PROC;                                                                00003540
      %INCLUDE P001UC01;                                                00003550
                                                                        00003560
      IF FOS.FNR_EK > 0 THEN                                            00003570
         CALL P100_SJEKK_DØD_B01(FOS.FNR_EK);                           00003580
                                                                        00003590
      DO I = 1 TO FOS.BT_ANT;                                           00003600
         CALL P100_SJEKK_DØD_B01(FOB.FNR_BARN(I));                      00003610
      END;                                                              00003620
                                                                        00003630
                                                                        00003640
 END P30_SJEKK_DØD_FO;                                                  00003650
                                                                        00003660
                                                                        00003670
 P35_SJEKK_DØD_E1:                                                      00003680
   PROC;                                                                00003690
      %INCLUDE P0011401;                                                00003700
                                                                        00003710
      IF E1S.FNR_EK > 0 THEN                                            00003720
         CALL P100_SJEKK_DØD_B01(E1S.FNR_EK);                           00003730
                                                                        00003740
 END P35_SJEKK_DØD_E1;                                                  00003750
                                                                        00003760
                                                                        00003770
 P35_SJEKK_DØD_EN:                                                      00003780
   PROC;                                                                00003790
      %INCLUDE P001UE01;                                                00003800
                                                                        00003810
      IF ENS.FNR_EK > 0 THEN                                            00003820
         CALL P100_SJEKK_DØD_B01(ENS.FNR_EK);                           00003830
                                                                        00003840
 END P35_SJEKK_DØD_EN;                                                  00003850
                                                                        00003860
                                                                        00003870
 P40_SJEKK_DØD_O2:                                                      00003880
   PROC;                                                                00003890
      %INCLUDE P0011701;                                                00003900
                                                                        00003910
                                                                        00003920
      DO I = 1 TO 5 WHILE(O2.FNR_BARN(I) > 0);                          00003930
         CALL P100_SJEKK_DØD_B01(O2.FNR_BARN(I));                       00003940
      END;                                                              00003950
                                                                        00003960
                                                                        00003970
 END P40_SJEKK_DØD_O2;                                                  00003980
                                                                        00003990
                                                                        00004000
 P100_SJEKK_DØD_B01:                                                    00004010
   PROC(H_FNR);                                                         00004020
      DCL H_FNR    PIC '(11)9';                                         00004030
                                                                        00004040
      DO I = 1 TO 14;                                                   00004050
         IF B01.FNR(I) = H_FNR THEN                                     00004060
            IF B01.DØDSDATO_ÅMD(I) > 0   THEN                           00004070
               DO;                                                      00004080
                  FEIL_MELD_NR = 602;                                   00004090
             /*   CALL SKRIV_FEILMELDING(H_FNR);*/                      00004100
                  GO TO L999;                                           00004110
               END;                                                     00004120
      END;                                                              00004130
                                                                        00004140
                                                                        00004150
 END P100_SJEKK_DØD_B01;                                                00004160
                                                                        00004170
                                                                        00004180
                                                                        00004190
                                                                        00004200
  L999:                                                                 00004210
        EXEC CICS RETURN;                                               00004220
                                                                        00004230
                                                                        00004240
  SKRIV_FEILMELDING:                                                    00004250
     PROC(FNR_PIC);                                                     00004260
                                                                        00004270
  /* **************************************************************** */00004280
  /*HENSIKT:                                                          */00004290
  /*    GIR UT FEILMELDING.                                           */00004300
  /*                                                                  */00004310
  /*                                                                  */00004320
  /*BRUK:                                                             */00004330
  /*    CALL SKRIV_FEILMELDING;                                       */00004340
  /*                                                                  */00004350
  /* **************************************************************** */00004360
                                                                        00004370
                                                                        00004380
   DCL                                                                  00004390
       FNR_PIC                  PIC '(11)9';                            00004400
   DCL                                                                  00004410
       FNR_CHAR   DEF FNR_PIC   CHAR(11);                               00004420
                                                                        00004430
                                                                        00004440
   START_TRANS_OPPL_PEKER = KOM_OMR.TRANS_OPPL_PEKER;                   00004450
   START_TRANS_PEKER      = KOM_OMR.TRANS_PEKER;                        00004460
   START_DIV_PARAM_PEKER  = KOM_OMR.DIV_PARAM_PEKER;                    00004470
                                                                        00004480
     TERMINERINGS_IND = FORKASTE                          ;             00004490
                                                                        00004500
     DIV_PARAM_OMR.FRA_CICS        = '0'B                 ;             00004510
     DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B                 ;             00004520
     DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B                 ;             00004530
     DIV_PARAM_OMR.FRA_UTEN_DIALOG = '1'B                 ;             00004540
     TRANS_OPPL_OMR.TRANS_RETURKODE = 'R041'              ;             00004550
                                                                        00004560
     EXEC CICS SYNCPOINT ROLLBACK                         ;             00004570
                                                                        00004580
     KOM_OMR.TRANS_OPPL_PEKER = START_TRANS_OPPL_PEKER    ;             00004590
     KOM_OMR.TRANS_PEKER      = START_TRANS_PEKER         ;             00004600
     KOM_OMR.DIV_PARAM_PEKER  = START_DIV_PARAM_PEKER     ;             00004610
                                                                        00004620
     FUNKSJONSKODE            = 'R'                       ;             00004630
                                                                        00004640
     EXEC CICS LINK PROGRAM('R0013301') COMMAREA (KOM_OMR);             00004650
                                                                        00004660
     TRANS_OPPL_OMR.TRANSKODE = 'R041'                    ;             00004670
                                                                        00004680
     EXEC CICS XCTL PROGRAM('R0010401') COMMAREA (KOM_OMR);             00004690
                                                                        00004700
                                                                        00004710
 END SKRIV_FEILMELDING;                                                 00004720
                                                                        00004730
   END R001352;                                                         00004740
