 /*   SIST ENDRET PÅ PROD   2004.12.17 15.34.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.17.39 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.03.15 12.06.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.12 13.47.22 AV   JDA2970          */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R0018A12  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : SATISH PATHAK                                    */        
 /*  PROGRAMMET BLE LAGET : DESEMBER 2003                             */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */        
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */        
 /*    FORHÅND.                                                       */        
 /*    ALLE MAPS HØRER INN UNDER MAPSET 'S001T1'.                     */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010410 - FORESPØRSEL ELLER */        
 /*                                  FRA R0010450 - ENDRINGER.        */        
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */        
 /*    BRUK :                                                         */        
 /*    EXEC CICS XCTL PROGRAM ('R0010412') COMMAREA(KOM_OMR);         */        
 /*    PROGRAMMET INCLUDER :                                          */        
 /*               R0010506   FLYTT FRA ARB.OMRÅDE TIL MAP    AP       */        
 /*               R0010507   FORTEKSTER OG ATTRIBUTTER       AP       */        
 /*               R0010606   FLYTT FRA ARB.OMRÅDE TIL MAP    UP       */        
 /*               R0010607   FORTEKSTER OG ATTRIBUTTER       UP       */        
 /*               R0010706   FLYTT FRA ARB.OMRÅDE TIL MAP    ST       */        
 /*               R0010806   FLYTT FRA ARB.OMRÅDE TIL MAP    EP       */        
 /*               R0010807   FORTEKSTER OG ATTRIBUTTER       EP       */        
 /*               R0010906   FLYTT FRA ARB.OMRÅDE TIL MAP    EF       */        
 /*               R0010907   FORTEKSTER OG ATTRIBUTTER       EF       */        
 /*               R0011006   FLYTT FRA ARB.OMRÅDE TIL MAP    FB       */        
 /*               R0011106   FLYTT FRA ARB.OMRÅDE TIL MAP    BP       */        
 /*               R001NB06   FLYTT FRA ARB.OMRÅDE TIL MAP    B6       */        
 /*               R0011206   FLYTT FRA ARB.OMRÅDE TIL MAP    FT       */        
 /*               R0011207   FORTEKSTER OG ATTRIBUTTER       FT       */        
 /*               R0011406   FLYTT FRA ARB.OMRÅDE TIL MAP    E1       */        
 /*               R001UE06   FLYTT FRA ARB.OMRÅDE TIL MAP    EN       */        
 /*               R0011506   FLYTT FRA ARB.OMRÅDE TIL MAP    E2       */        
 /*               R0011606   FLYTT FRA ARB.OMRÅDE TIL MAP    O1       */        
 /*               R0011706   FLYTT FRA ARB.OMRÅDE TIL MAP    O2       */        
 /*               R0011836   FLYTT FRA ARB.OMRÅDE TIL MAP    UF       */        
 /*               R0019912   PIC TIL CHAR OG MOTSATT                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R0018A1: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                                   
                                                                                
 %PAGE;                                                                         
 %INCLUDE S001F1;    /* MAPPER FOR BLANKETTENE    */                            
 %PAGE;                                                                         
                                                                                
 %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                            
 %PAGE;                                                                         
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                            
 %PAGE;                                                                         
 %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                            
 %PAGE;                                                                         
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                            
 %PAGE;                                                                         
 %INCLUDE P0019913;  /* LOKAL - KOM_OMR (BASED)   */                            
 %PAGE;                                                                         
 DCL  FORKASTES      BIT (1)  INIT ('0'B);                                      
                                                                                
 DCL                                                                            
    QUENAME                CHAR(8),                                             
       QTERMID             CHAR(4) DEF QUENAME POS(1),                          
       REST                CHAR(4) DEF QUENAME POS(5);                          
                                                                                
 DCL                                                                            
    1 ROUTELIST,                                                                
      2 PRINTER,                                                                
        3 TERMID           CHAR(4),                                             
        3 REST             CHAR(12),                                            
      2 SISTE,                                                                  
        3 SLUTT            FIXED BIN(15),                                       
        3 REST             CHAR(14);                                            
                                                                                
 DCL      (CSTG,ADDR )                   BUILTIN;                               
                                                                                
 DCL  COMMAREA_PEKER         PTR,                                               
      LOKAL_KOM_PTR          PTR,                                               
                                                                                
      LOW_CHAR_BASED        CHAR(1200)  BASED(BMSMAPBR),                        
      LENGTH                 FIXED BIN(15);                                     
                                                                                
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/                  
 DCL                                                                            
    CURSOR_POS FIXED BIN(15) INIT(-1),                                          
    DFHBMUNP             CHAR(1) INIT(' '),                                     
    DFHBMBRY             CHAR(1) INIT('H'),                                     
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */              
    FEIL_FUNNET          BIT(1)  INIT('1'B),                                    
    MELDING6O            CHAR(10),                                              
    YMELDING6O           CHAR(10);                                              
                                                                                
                                                                                
 QTERMID        = EIBTRMID;                                                     
 REST           = 'COMA';                                                       
 ROUTELIST      = '';                                                           
 PRINTER.TERMID = 'R41J';                                                       
 SISTE.SLUTT    = -1;                                                           
                                                                                
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                            
                                                                                
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);           
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);                
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);             
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);            
                                                                                
 /*                                                                             
 EXEC CICS LOAD PROGRAM('S001F13') SET(MAPSET_PTR);    TRANS - MAPSET */        
 EXEC CICS LOAD PROGRAM('S001F13') SET(BMSMAPBR); /* TRANS - MAPSET */          
 ALLOCATE  LOW_CHAR_BASED;                                                      
                                                                                
 EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW);                                 
                                                                                
                                                                                
                                                                                
    IF FUNKSJONSKODE = 'E' & EIBAID = '8' THEN       /* PF8  */                 
       EXEC CICS ROUTE LIST(ROUTELIST);                                         
                                                                                
    /* **************** NY LOGIC DEL    **************** */                     
      KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =                                    
                                 TRANS_OPPL_PTR(W01_TRANS_IND);                 
      KOM_OMR.PEKER_LISTE.TRANS_PEKER = TRANS_PTR(W01_TRANS_IND);               
                                                                                
       CALL LOW_VALUES_TIL_MAP;                                                 
       CALL SELECT_BLANKETTYPE;                                                 
                                                                                
       IF W01_LOOP  = W01_SIDE_ANTALL THEN                                      
              SISTE_SIDE = '1'B;                                                
                                                                                
       /* DETTE BARE FOR Å FÅ SATT OVERFLOW-CONDITION */                        
       EXEC CICS SEND MAP('ÅTTELI') MAPSET('S001F13') ACCUM PAGING              
                                                        MAPONLY;                
    /* **************** HITT TIL        **************** */                     
                                                                                
    /** SLUTT PÅ EKSEKVERING I BYGG_TRANS  **/                                  
                                                                                
    SELECT_BLANKETTYPE:                                                         
      PROC;                                                                     
                                                                                
                                                                                
        HOVED_KOM_OMR_PTR  =    COMMAREA_PEKER;                                 
        SELECT(TRANS_OPPL_OMR.BLANKETTYPE);                                     
           WHEN('AP')                                                           
              DO;                                                               
                                                                                
                                                                                
                EXEC CICS LINK PROGRAM('R00104AP')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001051') MAPSET('S001F13') ACCUM           
                                                  PAGING   ERASE;               
              END;                                                              
                                                                                
           WHEN('AF')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104AF')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001191') MAPSET('S001F13') ACCUM           
                                                  PAGING   ERASE;               
               END;                                                             
                                                                                
           WHEN('UF')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104UF')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001831') MAPSET('S001F13') ACCUM           
                                                  PAGING   ERASE;               
               END;                                                             
                                                                                
           WHEN('UP')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104UP')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                IF W01_MAP = 'S001061' THEN                                     
                      EXEC CICS SEND MAP('S001061') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
                ELSE                                                            
                IF W01_MAP = 'S001201' THEN                                     
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
               END;                                                             
                                                                                
           WHEN('US')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104US')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001071') MAPSET('S001F13') ACCUM           
                                                  PAGING   ERASE;               
               END;                                                             
           WHEN('EP')                                                           
              DO;                                                               
                EXEC CICS LINK PROGRAM('R00104EP')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                IF W01_MAP = 'S001081' THEN                                     
                      EXEC CICS SEND MAP('S001081') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
                ELSE                                                            
                IF W01_MAP = 'S001201' THEN                                     
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
              END;                                                              
                                                                                
                                                                                
                                                                                
           WHEN('EF')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104EF')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001091') MAPSET('S001F13')                 
                                                 ACCUM  PAGING   ERASE;         
              END;                                                              
           WHEN('FB')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104FB')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                IF W01_MAP = 'S001101' THEN                                     
                      EXEC CICS SEND MAP('S001101') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
                ELSE                                                            
                IF W01_MAP = 'S001201' THEN                                     
                      EXEC CICS SEND MAP('S001201') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
               END;                                                             
                                                                                
           WHEN('BP')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104BP')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001111') MAPSET('S001F13')                 
                                                 ACCUM  PAGING   ERASE;         
              END;                                                              
           WHEN('FT')                                                           
              DO;                                                               
                EXEC CICS LINK PROGRAM('R00104FT')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001121') MAPSET('S001F13')                 
                                                 ACCUM  PAGING   ERASE;         
              END;                                                              
                                                                                
           WHEN('E1')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104E1')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001141') MAPSET('S001F13')                 
                                                 ACCUM  PAGING   ERASE;         
               END;                                                             
         /*                                                                     
           WHEN('E2')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104E2')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                EXEC CICS SEND MAP('S001151') MAPSET('S001F13')                 
                                                 ACCUM  PAGING   ERASE;         
               END;                                                             
         */                                                                     
           WHEN('O1')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104O1')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                                                                                
                      EXEC CICS SEND MAP('S001161') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
               END;                                                             
           WHEN('O2')                                                           
               DO;                                                              
                EXEC CICS LINK PROGRAM('R00104O2')                              
                                         COMMAREA (LOKAL_KOM_OMR);              
                                                                                
                      EXEC CICS SEND MAP('S001171') MAPSET('S001F13')           
                                                 ACCUM  PAGING   ERASE;         
               END;                                                             
           OTHERWISE;                                                           
        END;                         /*   SELECT     */                         
                                                                                
                                                                                
                                                                                
                                                                                
    END SELECT_BLANKETTYPE;                                                     
                                                                                
                                                                                
                                                                                
                                                                                
 OVERFLOW:                                                                      
   CALL LOW_VALUES_TIL_MAP;                                                     
   TRAIL02O.SIDEO            = TRANS_ANT;                                       
   TRAIL02O.CICS_INFOO       = CICS_NAVN;                                       
   TRAIL02O.ROLLEO       =  DIV_PARAM_OMR.ATK_ROLLE ;                           
    /*  BLADDING KOMMANDO                                */                     
   IF ^ SISTE_SIDE THEN                                                         
     TRAIL02O.BLADN_KOMMANDOO = 'P/N ';                                         
   ELSE                                                                         
     DO;                                                                        
       TRAILERO.BLADN_KOMMANDOO = 'P/1 ';                                       
     END;                                                                       
                                                                                
   EXEC CICS SEND MAP('TRAIL02') MAPSET('S001F13') ACCUM PAGING;                
   /***** HIT KOMMER EN BARE DERSOM DET ER MER INFO IGJEN  *****/               
                                                                                
                                                                                
   EXEC CICS RETURN;                                                            
   /********      SLUTT PÅ OVERFLOW - RUTINE     ***********/                   
                                                                                
                                                                                
 LOW_VALUES_TIL_MAP:                                                            
   PROC;                                                                        
      LOW_CHAR_BASED = (1200)' ';   /* X'00'    */                              
 END LOW_VALUES_TIL_MAP;                                                        
                                                                                
                                                                                
   %INCLUDE R0019912;               /* PIC TIL CHAR OG MOTSATT */               
 END R0018A1;                                                                   
