 /*   SIST ENDRET PÅ PROD   2005.06.24 12.55.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.57.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.07.16 12.47.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.12 13.46.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.56.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.14.10 AV   JDA7339          */        
 /*       SIST ENDRET 02/09-98 10.18.32 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*  PROGRAM NAME:  R001I201                                          */        
 /*  LANGUAGE :     PL/1                                              */        
 /*  **************************************************************   */        
 /*  PROGRAMMET FORTAR OVERFØRINGER AV INNTEKTER FRA ETT FNR TIL      */        
 /*  ETT ANNET OG FJERNER INNTEKTENE TIL FRA-FNR.                     */        
 /*  PROGRAMMET KALLES OPP FRA R001I101.                              */        
 /*                                                                   */        
 /*  PROGRAMMERER ROLF FARVIK, DATA-UTVIKLING A/S ,     JUNI  1983    */        
 /* ***************************************************************** */        
 /* ENDRET 29.01.85 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */        
 /* ---------------                                                   */        
 /*    LEGGER UT DATA TIL NORTRYGD. TKNR FINNES VED 1. OG SJEKKE OM   */        
 /*    DET FINNES I ROT-SEGM. ER RF0PERSN.TKNR = 0 BRUKES KOMMNR. I   */        
 /*    SISTE INNTEKTS-SEGM.                                           */        
 /*                                                                   */        
 /* ENDRET 06.01.88 AV SVERRE LUNDEBY FRA DATA-UTVIKLING A/S.         */        
 /* ---------------                                                   */        
 /*    FEILRAPPORT : 540 OG 564                                       */        
 /*    OPPRETTER TIL PERSON VED OVERFØRING AV INNTEKTET.              */        
 /*    ROT OPPLYSNINGENE ER LIK FRA-FNR'S ROT-OPPLYSNINGER.           */        
 /*                                                                   */        
 /*ENDRET: 06.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */        
 /* ******                                                            */        
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */        
 /*    OM FNR ER ENDRET (R0019906).                                   */        
 /*                                                                   */        
 /*ENDRET: 13.09.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */        
 /* ******                                                            */        
 /*    LEGGER INN STYRING AV CICS-OPPL. I MAP.                        */        
 /*                                                                   */        
 /*ENDRET: 08.06.98 AV O.GØYTIL         ÅR2000-TILPASNING             */        
 /* ******                                                            */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001I20:                                                                       
   PROC (INTERN_KOM_PTR) OPTIONS(MAIN);                                         
                                                                                
                                                                                
 %PAGE;                                                                         
      %INCLUDE S001I1;     /*  INNTEKTMAPSET1    (BASED) */                     
                                                                                
 %PAGE;                                                                         
      %INCLUDE S001I2;     /*  INNTEKTMAPSET2    (BASED) */                     
                                                                                
 %PAGE;                                                                         
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */                    
 %PAGE;                                                                         
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                            
 %PAGE;                                                                         
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */                       
 %PAGE;                                                                         
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */                      
 %PAGE;                                                                         
 %SKIP(1);                                                                      
   DCL                                                                          
       MAP_MELDING              CHAR(78)      INIT((78)' '),                    
       1  FEIL_STRUC,                                                           
          2  FEIL_NR               FIXED DEC(5),                                
          2  FEIL_MELDING          CHAR     (78),                               
          2  KOM_OMR_PEKER         POINTER;                                     
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
       DCL                                                                      
         ( DATETIME , TIME , ADDR , CSTG , LOW , STG , VERIFY ,                 
           SUBSTR , ONCODE , NULL )  BUILTIN;                                   
                                                                                
       DCL   PLITDLI ENTRY;                                                     
       DCL   BMSMAPBR  PTR;                                                     
       DCL   FRA_PEKER    PTR;                                                  
       DCL   TIL_PEKER    PTR;                                                  
       DCL FUNK_KODE                CHAR( 2)     ;                              
                                                                                
    /* *********W01_IO;     ***************************************** */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
                                                                                
       DCL                                                                      
           UIB_RC_OK                 BIT  (8)             INIT ( 0 );           
                                                                                
       DCL                                                                      
         ( COMMAREA_PEKER , W01_HJELPE_PEKER , TRANS_SEGM_PEKER )               
                                               POINTER;                         
                                                                                
       DCL GAMMEL_AKSJONSKODE        CHAR (2)     ;                             
                                                                                
       DCL INNT_ALDER_FRA            PIC '(2)9'   ;                             
                                                                                
       DCL INNT_ALDER_TIL            PIC '(2)9'   ;                             
                                                                                
                                                                                
       DCL FNR_PIC                   PIC '(11)9'  ;                             
                                                                                
       DCL FNR_CHAR   DEF FNR_PIC    CHAR (11)    ;                             
                                                                                
       DCL ANTALL_FRA_LEST           FIXED DEC (3);                             
                                                                                
       DCL ANTALL_TIL_LEST           FIXED DEC (3);                             
                                                                                
       DCL W02_INNT_MÅ               PIC '(6)9'   ;                             
                                                                                
       DCL ANTALL_LEST               FIXED DEC (3);                             
                                                                                
       DCL LOW_VALUES            CHAR(6)          ;                             
                                                                                
       DCL LOW_VALUES_1500       CHAR(1500)       ;                             
                                                                                
       DCL MAP_OMR               CHAR(1500) BASED (BMSMAPBR);                   
                                                                                
       DCL FATAL_FEIL            CHAR (1) INIT ('S');                           
                                                                                
       DCL 1 FNR_REG,                                                           
             2 FNR1              FIXED DEC(11),                                 
             2 FNR2              FIXED DEC(11),                                 
             2 BRUKERID          CHAR     ( 4);                                 
                                                                                
       DCL HUSK_PI_ÅR_FRA        FIXED    DEC   (5)    ,         /*Y2K*/        
           HUSK_PI_ÅR_TIL        FIXED    DEC   (5)    ,         /*Y2K*/        
           HUSK_PI_TYPE_FRA               CHAR  (1)    ,                        
           HUSK_PI_TYPE_TIL               CHAR  (1)    ;                        
                                                                                
                                                                                
    /*----------------------------------------------------------------*/        
    /*   RF0PERSN                                                     */        
    /*----------------------------------------------------------------*/        
                                                                                
       DCL 1  RF0PERSN_FRA    BASED(FRA_PEKER),                                 
                                                                                
       %INCLUDE P0019927;                                                       
                                                                                
       DCL 1  RF0PERSN_TIL    BASED (TIL_PEKER),                                
       %INCLUDE P0019927;                                                       
                                                                                
    /*----------------------------------------------------------------*/        
    /*   INNTEKT-SEGMENTET                                            */        
    /*----------------------------------------------------------------*/        
                                                                                
       DCL 1  W01_PINT               UNALIGNED,                                 
       %INCLUDE P0019928;                                                       
                                                                                
       DCL IO_AREA_FRA               CHAR(100);                                 
       DCL IO_AREA_TIL               CHAR(100);                                 
                                                                                
    /* ************************************************************** */        
    /*   INNTEKTSTABELL.                                              */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W03                    UNALIGNED,                                 
              2  W02(24),                                                       
                 3   TAB_PI_ÅR          FIXED    DEC   (5) ,     /*Y2K*/        
                 3   TAB_PI_KODE,                                               
                     4   TAB_PI_TYPE             CHAR  (1) ,                    
                     4   TAB_PI_MERKE            PIC  '9'  ,                    
                 3   TAB_PI             FIXED    DEC   (9) , /*7->9*/           
                 3   TAB_PI_KOMMNR      FIXED    DEC   (5) ,                    
                 3   TAB_PI_RAPPDATO    FIXED    DEC   (7) ;     /*Y2K*/        
                                                                                
                                                                                
       DCL INTERN_KOM_PTR        POINTER;                                       
                                                                                
       DCL 1 INTERN_KOM_OMR  BASED (INTERN_KOM_PTR),                            
             2 HOVED_KOM_PTR        POINTER,                                    
             2 FRA_FNR              PIC '(11)9',                                
             2 TIL_FNR              PIC '(11)9';                                
                                                                                
    /* ************************************************************** */        
    /*   OPPTELINGS- OG LOOP-PARAMETRE M.M                            */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01                       UNALIGNED,                              
              2   MER_DATA                    BIT  (1)   INIT ('1'B),           
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),           
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('0'B),           
              2   AKSJONSKODE                 CHAR (2),                         
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),           
              2   NAVN                        CHAR (25)  INIT ((25)' '),        
    /*Y2K*/   2   VIRK_DATO_ÅMD        PIC '99999999'    INIT ( 0  ),           
              2   I                    FIXED  BIN  (15)  INIT (1),              
              2   J                    FIXED  BIN  (15)  INIT (1);              
                                                                                
    /* ************************************************************** */        
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_DLI_PARAM,                                                    
              2   W02_GET                 CHAR (4)   INIT('    '),              
              2   W02_GHU                 CHAR (4)   INIT('GHU '),              
              2   W02_DLET                CHAR (4)   INIT('DLET'),              
              2   W02_ISRT                CHAR (4)   INIT('ISRT'),              
              2   W02_GU                  CHAR (4)   INIT ('GU  '),             
              2   W02_GN                  CHAR (4)   INIT ('GN  '),             
              2   W02_GNP                 CHAR (4)   INIT ('GNP '),             
              2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                  
              2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                  
              2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5),                  
              2   W02_OUT2                CHAR (20)  INIT ( (20) ' ');          
                                                                                
       DCL    W01_IO            CHAR (150)       INIT ( (150) ' ' );            
       DCL    CICSINFO              CHAR (08);                                  
                                                                                
    /* ************************************************************** */        
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
    /* ************************************************************** */        
                                                                                
       DCL    SSA_UQUAL_ROT        STATIC CHAR ( 9) INIT('RF0PERSN ')  ;        
       DCL 1  SSA_UQUAL_PINNTEKT   STATIC CHAR ( 9) INIT('PINNTEKT ')  ;        
       DCL 1  SSA_UQUAL_PINNTEKT_L STATIC CHAR (11) INIT('PINNTEKT*L ');        
                                                                                
       DCL 1  SSA1_RF0PERSN          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('RF0PERSN(FNR     '),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
              2    PKEY               FIXED   DEC  (11),                        
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
       DCL 1  SSA1_PINNTEKT          UNALIGNED,                                 
              2    HDEL                       CHAR (17)  INIT                   
                   ('PINNTEKT(INNTÅRTY'),                                       
              2    REL_OP                     CHAR (2)   INIT (' ='),           
    /*Y2K*/   2    ÅR                 FIXED   DEC  (4),                         
              2    TYPE                       CHAR (1),                         
              2    HP                         CHAR (1)   INIT (')');            
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   PCB-PEKER-OMR    OG    PCB-OMR                               */        
    /* ************************************************************** */        
                                                                                
    %PAGE;                                                                      
    %INCLUDE P0012002;                         /* PCB_UIB_PEKER_OMR   */        
    %PAGE;                                                                      
                                                                                
       DCL 1  B01              BASED (B01_PEKER),                               
    %INCLUDE P0019921;                         /* B01_OMR (BASED)     */        
                                                                                
                                                                                
    %PAGE;                                                                      
       DCL 1  B02              BASED (B02_PEKER),                               
    %INCLUDE P0019921;                         /* B02_OMR (BASED)     */        
                                                                                
    %PAGE;                                                                      
       DCL 1  RF1              BASED (RF1_PCB_PEKER),                           
    %INCLUDE P0012003;                         /* PCB                 */        
                                                                                
                                                                                
    DCL ONKODE PIC '9999',                                                      
    ONK DEF ONKODE CHAR(4);                                                     
                                                                                
    %PAGE;                                                                      
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
    /*     ---------------------------------------------------        */        
    /*                                                                */        
    /*                                                                */        
    /*      INITIERING AV PARAMETRE TIL DIV OMR.     .                */        
    /*                                                                */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
                                                                                
  COMMAREA_PEKER                        = HOVED_KOM_PTR;                        
                                                                                
 %PAGE;                                                                         
      ON ERROR SNAP BEGIN;                                                      
      ON ERROR SYSTEM;                                                          
         ONKODE=ONCODE;                                                         
         EXEC CICS ABEND ABCODE(ONK);                                           
      END;                                                                      
                                                                                
  EXEC CICS HANDLE CONDITION ERROR(ERRBEH);                                     
                                                                                
  EXEC CICS HANDLE AID PF2(PF2);                                                
                                                                                
  IF FEIL_MELD_NR = 0 THEN                                                      
  PROGRAM_ID            =  'R001I201'                   ;                       
  DB_STATUS_KODE        =  '  '                         ;                       
  FEIL_MELD_NR          =   0                           ;                       
  FNR_REG.BRUKERID      =   DIV_PARAM_OMR.CICS_IND      ;                       
 /*  CICSINFO              =   DIV_PARAM_OMR.CICS_IND ; */                      
                                                                                
  FRA_PEKER       = ADDR(IO_AREA_FRA);                                          
  TIL_PEKER       = ADDR(IO_AREA_TIL);                                          
                                                                                
  LOW_VALUES        = (6)' '                       ;/* HEXA LOW-VALUES*/        
  LOW_VALUES_1500   = (1500)' '                    ;/* HEXA LOW-VALUES*/        
  %PAGE;                                                                        
                                                                                
                                                                                
  /**********    H O V E D S T Y R I N G   S T A R T   *************/           
                                                                                
  IF TRANSKODE = 'R0I2' !                                                       
     TRANSKODE = 'RI2A' THEN                                                    
     DO;                                                                        
                                                                                
  /***  ÅPNER RF_BASEN                            *********/                    
                                                                                
        IF  KOM_OMR.PCB_UIB_PEKER = NULL THEN                                   
            CALL DATABASE('OPEN');                                              
                                                                                
        ELSE                                                                    
            UIBPTR     = PCB_UIB_PEKER_OMR.UIB_PEKER;                           
                                                                                
                                                                                
        IF FEIL_MELD_NR > 0   THEN                                              
           DO;                                                                  
              TERMINERINGS_IND = FATAL_FEIL;                                    
              GO TO L999;                                                       
           END;                                                                 
     END;                                                                       
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     CALL SKRIV_FEILMELDING;                                                    
  ELSE                                                                          
     PROGRAM_ID = 'R001I201'     ;                                              
                                                                                
                                                                                
  FEILMELDING_SATT       = '1'B    ;                                            
  AKSJON_IKKE_SATT       = '1'B    ;                                            
  W01.MER_DATA           = '1'B    ;                                            
  ANTALL_FRA_LEST        = 0       ;                                            
  ANTALL_TIL_LEST        = 0       ;                                            
  ANTALL_LEST            = 0       ;                                            
                                                                                
                                                                                
                                                                                
  GAMMEL_AKSJONSKODE = 'DU';  /* GIS DUMMY-INIT-VERDI*/                         
                                                                                
  DO WHILE (GAMMEL_AKSJONSKODE ^= '  ');                                        
                                                                                
     CALL BYGG_OVERFØRINGSBILDE;                                                
                                                                                
     IF FEIL_MELD_NR > 0 THEN                                                   
        DO;                                                                     
           TERMINERINGS_IND = FATAL_FEIL;                                       
           GO TO L999;                                                          
        END;                                                                    
                                                                                
                                                                                
     IF GAMMEL_AKSJONSKODE = 'BE' THEN                                          
        DO;                                                                     
           /*--------------------------------------------------------*/         
           /* SKRIVER UT OVERFØRINGSBILDET MED  DATA.                */         
           /*--------------------------------------------------------*/         
                                                                                
           MAP_MELDING           = 'INNTEKT(ER) OVERFØRT.TRYKK ENTER.';         
           S001I02O.MELDING6O    = MAP_MELDING;                                 
           S001I02I.AKSJONL      = -1; /* CURSOR POS */                         
           S001I02O.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN ;                    
                                                                                
           EXEC CICS SEND MAP('S001I02')                                        
                               MAPSET('S001I23')  CURSOR ERASE;                 
           EXEC CICS RECEIVE MAP('S001I02')                                     
                               MAPSET('S001I23');                               
           GAMMEL_AKSJONSKODE = '  ';                                           
                                                                                
           GO TO FERDIG;                                                        
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           S001I02I.MRK1L        = -1; /* CURSOR POS */                         
           S001I02O.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN ;                    
                                                                                
           EXEC CICS SEND MAP('S001I02')                                        
                               MAPSET('S001I23')  CURSOR ERASE;                 
                                                                                
                                                                                
        END;                                                                    
                                                                                
     IF GAMMEL_AKSJONSKODE     = 'ME'                          THEN             
        AKSJON_IKKE_SATT       = '1'B    ;                                      
                                                                                
                                                                                
     DO WHILE (AKSJON_IKKE_SATT);                                               
        CALL   AKSJON_BEHANDLING;                                               
     END;                                                                       
                                                                                
                                                                                
   FERDIG:                                                                      
  END;                                                                          
                                                                                
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     DO;                                                                        
        TERMINERINGS_IND = FATAL_FEIL;                                          
        GO TO L999;                                                             
     END;                                                                       
                                                                                
                                                                                
  /***** O M R E G N I N G   P.G.A. I N N T E K T S E N D R I N G **/           
                                                                                
                                                                                
  FØDSNUMMER = FRA_FNR;                                                         
  SEARCH_FNR = FRA_FNR;                                                         
                                                                                
  IF INNT_ALDER_FRA = '66' THEN                                                 
     ØNSKET_STATUS  = '6';                                                      
  ELSE                                                                          
     IF INNT_ALDER_FRA = '69' THEN                                              
     ØNSKET_STATUS  = '9';                                                      
                                                                                
                                                                                
  EXEC CICS LINK PROGRAM('R001I601') COMMAREA (KOM_OMR);                        
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     DO;                                                                        
        GOTO L999;                                                              
     END;                                                                       
  ELSE                                                                          
     PROGRAM_ID = 'R001I201';                                                   
                                                                                
                                                                                
                                                                                
  FØDSNUMMER = TIL_FNR;                                                         
  SEARCH_FNR = TIL_FNR;                                                         
                                                                                
                                                                                
  IF INNT_ALDER_TIL = '66' THEN                                                 
     ØNSKET_STATUS  = '6';                                                      
  ELSE                                                                          
     IF INNT_ALDER_TIL = '69' THEN                                              
     ØNSKET_STATUS  = '9';                                                      
                                                                                
                                                                                
  EXEC CICS LINK PROGRAM('R001I601') COMMAREA (KOM_OMR);                        
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     DO;                                                                        
        GOTO L999;                                                              
     END;                                                                       
  ELSE                                                                          
     PROGRAM_ID = 'R001I201';                                                   
                                                                                
 L999:                                                                          
                                                                                
  IF FEIL_MELD_NR > 0 THEN                                                      
     CALL SKRIV_FEILMELDING;                                                    
                                                                                
  ALLOCATE S001I01O;                                                            
  ALLOCATE S001I01I;                                                            
                                                                                
  EXEC CICS LOAD PROGRAM('S001I13');                                            
                                                                                
  S001I01I.STYREKODEL   = -1;                                                   
  S001I01O.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                              
                                                                                
  EXEC CICS SEND MAP('S001I01')                                                 
                                MAPSET('S001I13') CURSOR ERASE;                 
  CALL DATABASE('CLOSE');                                                       
                                                                                
  IF FEIL_MELD_NR > 0   THEN                                                    
     DO;                                                                        
        TERMINERINGS_IND = FATAL_FEIL;                                          
        GO TO L999;                                                             
     END;                                                                       
                                                                                
  EXEC CICS RETURN;                                                             
                                                                                
                                                                                
                                                                                
  /**********    H O V E D S T Y R I N G   S L U T T   *************/           
                                                                                
                                                                                
                                                                                
                                                                                
 BYGG_OVERFØRINGSBILDE:                                                         
   PROC;                                                                        
                                                                                
    ALLOCATE S001I02O;                                                          
    ALLOCATE S001I02I;                                                          
                                                                                
    EXEC CICS LOAD PROGRAM('S001I23');                                          
                                                                                
    S001I02O.FRAFNRO         = FRA_FNR;                                         
    S001I02O.TILFNRO         = TIL_FNR;                                         
    S001I02O.CICS_INFOO      = DIV_PARAM_OMR.CICS_NAVN;                         
                                                                                
                                                                                
    SSA1_RF0PERSN.PKEY       = FRA_FNR;                                         
                                                                                
    IF ANTALL_FRA_LEST  < 25 THEN                                               
        DO;                                                                     
          CALL P005_LES_ROT_QUAL_FNRFRA;                                        
                                                                                
          IF W01.MER_DATA THEN                                                  
             ANTALL_FRA_LEST  = 1;                                              
          ELSE                                                                  
             DO;                                                                
             /* ******************************************** */                 
             /* FRA-FNR IKKE I DATABASE--> FEILMELDING.     */                  
             /* ******************************************** */                 
                IF FEIL_MELD_NR > 0  THEN                                       
                   MAP_MELDING =                                                
                   ' DU HAR IKKE TILGANG TIL FNR ' !! FRA_FNR;                  
                ELSE                                                            
                                                                                
                MAP_MELDING =                                                   
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!                 
                                  ' ER IKKE I DATABASEN.' ;                     
                                                                                
                ALLOCATE S001I01O;                                              
                ALLOCATE S001I01I;                                              
                                                                                
                EXEC CICS LOAD PROGRAM('S001I13');                              
                                                                                
                S001I01O.FRAFNRA      = 'I';                                    
                S001I01O.FRAFNRO      = FRA_FNR;                                
                S001I01I.FRAFNRL      = -1; /* CURSOR POS       */              
                S001I01O.TILFNRA      = 'I';                                    
                S001I01O.TILFNRO      = TIL_FNR;                                
                S001I01O.STYREKODEO   = STYREKODE;                              
                S001I01O.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;                
                S001I01O.MELDINGO     = MAP_MELDING;                            
                                                                                
                EXEC CICS SEND MAP('S001I01')                                   
                                      MAPSET('S001I13') CURSOR ERASE;           
                                                                                
                TRANSKODE = 'R0I1';                                             
                                                                                
                CALL DATABASE('CLOSE');                                         
      /* AV SATISH 19.08.2003                                                   
                IF FEIL_MELD_NR > 0   THEN                                      
                   DO;                                                          
                      TERMINERINGS_IND = FATAL_FEIL;                            
                      GO TO L999;                                               
                   END;                                                         
        */                                                                      
                EXEC CICS RETURN;                                               
             END;                                                               
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          ANTALL_FRA_LEST  = 1;                                                 
                                                                                
          SSA1_RF0PERSN.PKEY       = FRA_FNR;                                   
                                                                                
          CALL P005_LES_ROT_QUAL_FNRFRA;                                        
                                                                                
                                                                                
          SSA1_PINNTEKT.ÅR           =     HUSK_PI_ÅR_FRA     ;                 
          SSA1_PINNTEKT.TYPE         =     HUSK_PI_TYPE_FRA   ;                 
                                                                                
          CALL P010_LES_INNT_QUAL;                                              
                                                                                
          CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                                  
                                                                                
          ANTALL_FRA_LEST  = ANTALL_FRA_LEST + 1;                               
       END;                                                                     
                                                                                
                                                                                
    DO WHILE(W01.MER_DATA &                                                     
                           ANTALL_FRA_LEST < 25);                               
                                                                                
                                                                                
       /*******    LES NESTE PINNTEKT     *********/                            
                                                                                
       CALL P020_LES_NESTE_PINNTEKT_FNR;                                        
                                                                                
       IF W01.MER_DATA     THEN                                                 
          DO;                                                                   
                                                                                
             CALL FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                               
                                                                                
                                                                                
             ANTALL_FRA_LEST = ANTALL_FRA_LEST + 1;                             
          END;                                                                  
    END;                                                                        
                                                                                
    ANTALL_LEST = ANTALL_FRA_LEST - 1;                                          
                                                                                
    IF ANTALL_FRA_LEST > 24 THEN                                                
       DO;                                                                      
          CALL SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                                 
       END;                                                                     
    ELSE                                                                        
       CALL SJEKK_OM_INGEN_INNTEKTER;                                           
                                                                                
                                                                                
                                                                                
    /***  B E H A N D L I N G  A V  T I L - F N R ***/                          
                                                                                
                                                                                
                                                                                
    SSA1_RF0PERSN.PKEY       = TIL_FNR;                                         
                                                                                
    IF ANTALL_TIL_LEST  < 25 THEN                                               
       DO;                                                                      
          CALL P006_LES_ROT_QUAL_FNRTIL;                                        
                                                                                
                                                                                
          IF W01.MER_DATA THEN                                                  
             ANTALL_TIL_LEST  = 1;                                              
          ELSE                                                                  
             DO;                                                                
                /* ******************************************** */              
                /* TIL-FNR IKKE I DATABASE--> PERSON OPPRETTES  */              
                /* ******************************************** */              
                IF FEIL_MELD_NR > 0  THEN                                       
                   DO;                                                          
                      MAP_MELDING =                                             
                      ' DU HAR IKKE TILGANG TIL FNR ' !! TIL_FNR;               
                      ALLOCATE S001I01O;                                        
                      ALLOCATE S001I01I;                                        
                                                                                
                      EXEC CICS LOAD PROGRAM('S001I13');                        
                                                                                
                      S001I01O.FRAFNRA      = 'I';                              
                      S001I01O.FRAFNRO      = FRA_FNR;                          
                      S001I01I.TILFNRL      = -1; /* CURSOR POS  */             
                      S001I01O.TILFNRA      = 'I';                              
                      S001I01O.TILFNRO      = TIL_FNR;                          
                      S001I01O.STYREKODEO   = STYREKODE;                        
                      S001I01O.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN;          
                      S001I01O.MELDINGO     = MAP_MELDING;                      
                                                                                
                      EXEC CICS SEND MAP('S001I01')                             
                                       MAPSET('S001I13') CURSOR ERASE;          
                                                                                
                      TRANSKODE = 'R0I1';                                       
                                                                                
                      CALL DATABASE('CLOSE');                                   
                      EXEC CICS RETURN;                                         
                   END;                                                         
                ELSE                                                            
                 DO;                                                            
                     ANTALL_TIL_LEST  = 1;                                      
                     RF0PERSN_TIL = '';                                         
                     CALL P030_OPPRETT_ROT;                                     
                     CALL P006_LES_ROT_QUAL_FNRTIL;                             
                                                                                
                 END;                                                           
             END;                                                               
       END;                                                                     
    ELSE                                                                        
       DO;                                                                      
          ANTALL_TIL_LEST            =     1;                                   
                                                                                
          SSA1_RF0PERSN.PKEY         =     TIL_FNR;                             
                                                                                
          CALL P006_LES_ROT_QUAL_FNRTIL;                                        
                                                                                
          SSA1_PINNTEKT.ÅR           =     HUSK_PI_ÅR_TIL     ;                 
          SSA1_PINNTEKT.TYPE         =     HUSK_PI_TYPE_TIL   ;                 
                                                                                
          CALL P010_LES_INNT_QUAL;                                              
                                                                                
          CALL FLYTT_DBOPPL_TIL_BL_OMR_TILFNR;                                  
                                                                                
          ANTALL_TIL_LEST  = ANTALL_TIL_LEST + 1;                               
       END;                                                                     
                                                                                
                                                                                
    DO WHILE(W01.MER_DATA &                                                     
                           ANTALL_TIL_LEST < 25 );                              
                                                                                
                                                                                
       /*******    LES NESTE PINNTEKT     *********/                            
                                                                                
       CALL P020_LES_NESTE_PINNTEKT_FNR;                                        
                                                                                
       IF W01.MER_DATA     THEN                                                 
          DO;                                                                   
                                                                                
             CALL FLYTT_DBOPPL_TIL_BL_OMR_TILFNR;                               
                                                                                
                                                                                
             ANTALL_TIL_LEST = ANTALL_TIL_LEST + 1;                             
          END;                                                                  
    END;                                                                        
                                                                                
    IF    ANTALL_TIL_LEST > 24 &                                                
                                W01.MER_DATA   THEN                             
          CALL SJEKK_OM_FLERE_INNTEKTER_TILFNR;                                 
                                                                                
  BYGG99:                                                                       
                                                                                
  END BYGG_OVERFØRINGSBILDE;                                                    
                                                                                
                                                                                
                                                                                
 SJEKK_OM_FLERE_INNTEKTER_FRAFNR:                                               
   PROC;                                                                        
                                                                                
     /*******    LES RF_BASE   *********/                                       
                                                                                
  CALL P020_LES_NESTE_PINNTEKT_FNR;                                             
                                                                                
  IF W01.MER_DATA     THEN                                                      
     DO;                                                                        
                                                                                
        MAP_MELDING =                                                           
                     'FLERE EN 24 INNTEKTER REGISTERT PÅ FRA-FNR. ' !!          
                               'AKSJON = ME ==> NESTE SIDE. ';                  
                                                                                
                                                                                
        S001I02O.MELDING6O = MAP_MELDING;                                       
                                                                                
        HUSK_PI_ÅR_FRA   = W02_PI_ÅR;                                           
        HUSK_PI_TYPE_FRA = W02_PI_TYPE;                                         
                                                                                
     END;                                                                       
  ELSE                                                                          
     ANTALL_FRA_LEST = 24;                                                      
                                                                                
  END SJEKK_OM_FLERE_INNTEKTER_FRAFNR;                                          
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
 SJEKK_OM_FLERE_INNTEKTER_TILFNR:                                               
   PROC;                                                                        
                                                                                
     /*******    LES RF_BASE   *********/                                       
                                                                                
  CALL P020_LES_NESTE_PINNTEKT_FNR;                                             
                                                                                
  IF W01.MER_DATA     THEN                                                      
     DO;                                                                        
                                                                                
        MAP_MELDING =                                                           
                     'FLERE EN 24 INNTEKTER REGISTERT PÅ TIL-FNR. ' !!          
                               'AKSJON = ME ==> NESTE SIDE. ';                  
                                                                                
        S001I02O.MELDING6O = MAP_MELDING;                                       
                                                                                
        HUSK_PI_ÅR_TIL   = W02_PI_ÅR;                                           
        HUSK_PI_TYPE_TIL = W02_PI_TYPE;                                         
                                                                                
                                                                                
     END;                                                                       
  ELSE                                                                          
     ANTALL_TIL_LEST = 24;                                                      
                                                                                
  END SJEKK_OM_FLERE_INNTEKTER_TILFNR;                                          
                                                                                
                                                                                
                                                                                
                                                                                
 SJEKK_OM_INGEN_INNTEKTER:                                                      
   PROC;                                                                        
                                                                                
                                                                                
    IF    ^W01.MER_DATA & FEIL_MELD_NR = 0 &                                    
                          ANTALL_FRA_LEST = 1 THEN                              
          DO;                                                                   
                                                                                
             IF GAMMEL_AKSJONSKODE = 'OA' THEN                                  
                DO;                                                             
                     FEILMELDING_SATT   = '1'B;                                 
                     MAP_MELDING =                                              
                        'ALLE INNTEKT FOR FNR : ' !! FRA_FNR !!                 
                         ' ER OVERFORT TIL FNR' !! TIL_FNR  ;                   
                END;                                                            
            ELSE                                                                
                DO;                                                             
                     FEILMELDING_SATT   = '1'B;                                 
                     MAP_MELDING =                                              
                        'PERSONEN MED FRA-FNR : ' !! FRA_FNR !!                 
                                  ' HAR IKKE REGISTERTE INNTEKTER.' ;           
                END;                                                            
                                                                                
             ALLOCATE S001I01O;                                                 
             ALLOCATE S001I01I;                                                 
                                                                                
             EXEC CICS LOAD PROGRAM('S001I13');                                 
                                                                                
             S001I01I.FRAFNRL      = -1; /* CURSOR POS       */                 
             S001I01O.FRAFNRA      = 'I';                                       
             S001I01O.FRAFNRO      = FRA_FNR;                                   
             S001I01O.STYREKODEO   = STYREKODE;                                 
             S001I01O.CICS_INFOO   = DIV_PARAM_OMR.CICS_NAVN ;                  
             S001I01O.MELDINGO     = MAP_MELDING;                               
                                                                                
             EXEC CICS SEND MAP('S001I01')                                      
                                      MAPSET('S001I13') CURSOR ERASE;           
                                                                                
             TRANSKODE = 'R0I1';                                                
                                                                                
             CALL DATABASE('CLOSE');                                            
                                                                                
             IF FEIL_MELD_NR > 0   THEN                                         
                DO;                                                             
                   TERMINERINGS_IND = FATAL_FEIL;                               
                   GO TO L999;                                                  
                END;                                                            
                                                                                
             EXEC CICS RETURN;                                                  
          END;                                                                  
                                                                                
                                                                                
  END SJEKK_OM_INGEN_INNTEKTER;                                                 
                                                                                
                                                                                
                                                                                
  AKSJON_BEHANDLING:                                                            
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    UTFØRER ØNSKET AKSJON.                                                  
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL AKSJON_BEHANDLING;                                                 
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
   DCL W_TKNR               FIXED DEC ( 4)   INIT ( 0 ),                        
       W_FNR                FIXED DEC (11)   INIT ( 0 );                        
                                                                                
                                                                                
   FEILMELDING_SATT       = '1'B;                                               
   AKSJON_IKKE_SATT       = '1'B;                                               
                                                                                
   DO UNTIL (^FEILMELDING_SATT);                                                
                                                                                
      FEILMELDING_SATT = '0'B;                                                  
                                                                                
      /***  LESER INN DATA FRA OVERFØRINGSBILDET.  */                           
                                                                                
                                                                                
      EXEC CICS RECEIVE MAP('S001I02')                                          
                               MAPSET('S001I23')SET (BMSMAPBR);                 
                                                                                
                                                                                
      IF S001I02I.FUNKSJONSKODEL > 0 THEN                                       
         DO;                                                                    
            FUNKSJONSKODE = S001I02I.FUNKSJONSKODEI;                            
            IF FUNKSJONSKODE = 'I' THEN                                         
               GO TO L999;                                                      
            ELSE                                                                
               DO;                                                              
                  CALL DATABASE('CLOSE');                                       
                                                                                
                  EXEC CICS RETURN;                                             
                                                                                
               END;                                                             
         END;                                                                   
                                                                                
      /*------------------------------------------------------------*/          
      /* SJEKKER OM AKSJONØNSKET ER GYLDIG                          */          
      /*------------------------------------------------------------*/          
                                                                                
      S001I02O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                           
                                                                                
      IF S001I02I.AKSJONL > 0 THEN                                              
         DO;                                                                    
            AKSJONSKODE = S001I02I.AKSJONI;                                     
            SELECT(AKSJONSKODE);                                                
                                                                                
               WHEN('OA')                                                       
                  DO;                                                           
                     DO I = 1 TO ANTALL_LEST;                                   
                                                                                
                        CALL MARKER_LINJE;                                      
                                                                                
                     END;                                                       
                                                                                
                     IF GAMMEL_AKSJONSKODE = 'DU' THEN /*DUMMY-INIT-*/          
                        CALL BLANK_TIL_OPPL;           /*VERDI      */          
                                                                                
                     CALL BEHANDLE_MARKERTE_LINJER;                             
                                                                                
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                          
                                                                                
                     S001I02I.AKSJONL    = -1; /* CURSOR POS */                 
                                                                                
                     MAP_MELDING        = 'BEKREFT ENDRINGENE / BE   ';         
                     S001I02O.MELDING6O = MAP_MELDING;                          
                     EXEC CICS SEND MAP('S001I02')                              
                               MAPSET('S001I23')  CURSOR ERASE;                 
                                                                                
                  END;                                                          
               WHEN('OM')                                                       
                  DO;                                                           
                                                                                
                     IF GAMMEL_AKSJONSKODE = 'DU' THEN /*DUMMY-INIT-*/          
                        CALL BLANK_TIL_OPPL;           /*VERDI      */          
                                                                                
                     CALL BEHANDLE_MARKERTE_LINJER;                             
                                                                                
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                          
                                                                                
                                                                                
                     S001I02I.AKSJONL    = -1; /* CURSOR POS */                 
                                                                                
                     MAP_MELDING        = 'BEKREFT ENDRINGENE / BE   ';         
                     S001I02O.MELDING6O = MAP_MELDING;                          
                                                                                
                     EXEC CICS SEND MAP('S001I02')                              
                               MAPSET('S001I23')  CURSOR ERASE;                 
                                                                                
                  END;                                                          
                                                                                
               WHEN('BE')                                                       
                  DO;                                                           
                     IF GAMMEL_AKSJONSKODE = 'OA' !                             
                        GAMMEL_AKSJONSKODE = 'ME' !                             
                        GAMMEL_AKSJONSKODE = 'OM' THEN                          
                        DO;                                                     
                           SSA1_RF0PERSN.PKEY = TIL_FNR;                        
                                                                                
                           CALL OVERFØR_INNTEKTER(                              
                                   W01_PINT,INNT_ALDER_FRA,                     
                                   INNT_ALDER_TIL,FRA_FNR,TIL_FNR);             
                           IF FEIL_MELD_NR > 0 THEN                             
                              DO;                                               
                                 TERMINERINGS_IND = FATAL_FEIL         ;        
                                 AKSJON_IKKE_SATT = '0'B               ;        
                                 GO TO RETUR;                                   
                              END;                                              
                                                                                
                            /*----------------------------------------*/        
                            /* DATA TIL NORTRYGD   :   TIL - FNR      */        
                            /*----------------------------------------*/        
                                                                                
                            W_FNR  = TIL_FNR                           ;        
                            W_TKNR = F100_FINN_TKNR (TIL_FNR)          ;        
                                                                                
                            IF FEIL_MELD_NR  >    0                 THEN        
                               DO;                                              
                                  FATAL_FEIL    =   '1'B               ;        
                                  GO TO RETUR;                                  
                               END;                                             
                                                                                
                    /*      CALL P900_NOR_DATA (W_FNR , W_TKNR) ;*/             
                                                                                
                            IF FEIL_MELD_NR  >    0                 THEN        
                               DO;                                              
                                  FATAL_FEIL    =   '1'B               ;        
                                  GO TO RETUR;                                  
                               END;                                             
                            ELSE                                                
                               PROGRAM_ID    =   'R001I201'            ;        
                                                                                
                            /*----------------------------------------*/        
                            /* DATA TIL NORTRYGD   :   FRA - FNR      */        
                            /* SJEKKER OM ROT-SEGM HAR TKNR .         */        
                            /*----------------------------------------*/        
                                                                                
                            W_FNR              =   FRA_FNR             ;        
                            SSA1_RF0PERSN.PKEY =   FRA_FNR             ;        
                            CALL P005_LES_ROT_QUAL_FNRFRA;                      
                                                                                
                            IF RF0PERSN_FRA.TKNR  >  0         THEN             
                               W_TKNR   =   RF0PERSN_FRA.TKNR  ;                
                                                                                
                      /*    CALL P900_NOR_DATA (W_FNR , W_TKNR);*/              
                                                                                
                            IF FEIL_MELD_NR  >    0                 THEN        
                               DO;                                              
                                  FATAL_FEIL    =   '1'B               ;        
                                  GO TO RETUR;                                  
                               END;                                             
                            ELSE                                                
                               PROGRAM_ID    =   'R001I201'            ;        
                                                                                
                                                                                
                           GAMMEL_AKSJONSKODE = 'BE';                           
                           AKSJON_IKKE_SATT   = '0'B;                           
                        END;                                                    
                      ELSE                                                      
                        DO;                                                     
                           MAP_MELDING       = 'OA/OM MÅ OPPGIS FØRST.';        
                           FEILMELDING_SATT  = '1'B;                            
                           S001I02I.AKSJONL  =                                  
                                                -1; /* CURSOR POS */            
                           S001I02O.MELDING6O = MAP_MELDING;                    
                                                                                
                            EXEC CICS SEND MAP('S001I02')                       
                                  MAPSET('S001I23') CURSOR ERASE;               
                        END;                                                    
                  END;                                                          
               WHEN('SI')                                                       
                  DO;                                                           
                     TRANSKODE = 'RI2A';                                        
                     EXEC CICS XCTL PROGRAM('R001I201')                         
                                         COMMAREA(INTERN_KOM_OMR);              
                  END;                                                          
               WHEN('ME')                                                       
                  DO;                                                           
                     AKSJON_IKKE_SATT       = '0'B;                             
                     GAMMEL_AKSJONSKODE = AKSJONSKODE;                          
                  END;                                                          
               OTHERWISE                                                        
                  DO;                                                           
                     FEILMELDING_SATT   = '1'B;                                 
                                                                                
                     S001I02I.AKSJONL  =  -1; /* CURSOR POS */                  
                     MAP_MELDING        = 'UGYLDIG AKSJONSKODE';                
                     S001I02O.MELDING6O = MAP_MELDING;                          
                                                                                
                     EXEC CICS SEND MAP('S001I02')                              
                                  MAPSET('S001I23') CURSOR ERASE;               
                  END;                                                          
            END;                                                                
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
            MAP_MELDING        = 'AKSJONSKODE MÅ OPPGIS.';                      
            FEILMELDING_SATT   = '1'B;                                          
            S001I02I.AKSJONL   =                                                
                                 -1; /* CURSOR POS */                           
            S001I02O.MELDING6O = MAP_MELDING;                                   
                                                                                
            EXEC CICS SEND MAP('S001I02')                                       
                                       MAPSET('S001I23') CURSOR ERASE;          
         END;                                                                   
  END;                                                                          
                                                                                
  RETUR:                                                                        
                                                                                
  END AKSJON_BEHANDLING;                                                        
                                                                                
                                                                                
  FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR:                                               
     PROC;                                                                      
                                                                                
     S001I02O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                            
                                                                                
     SELECT(ANTALL_FRA_LEST);                                                   
        WHEN(1)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR1O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE1O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP1O = W02_PI;        /*200504*/                  
               W02.TAB_PI_ÅR(1)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(1)     = W02_PI_KODE;                            
               W02.TAB_PI(1)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(1)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(1) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(2)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR2O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE2O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP2O = W02_PI;      /*200504*/                    
               W02.TAB_PI_ÅR(2)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(2)     = W02_PI_KODE;                            
               W02.TAB_PI(2)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(2)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(2) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(3)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR3O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE3O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP3O = W02_PI;    /*200504*/                      
               W02.TAB_PI_ÅR(3)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(3)     = W02_PI_KODE;                            
               W02.TAB_PI(3)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(3)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(3) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(4)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR4O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE4O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP4O = W02_PI;          /*200504*/                
               W02.TAB_PI_ÅR(4)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(4)     = W02_PI_KODE;                            
               W02.TAB_PI(4)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(4)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(4) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(5)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR5O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE5O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP5O = W02_PI;    /*200504*/                      
               W02.TAB_PI_ÅR(5)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(5)     = W02_PI_KODE;                            
               W02.TAB_PI(5)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(5)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(5) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(6)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR6O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE6O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP6O = W02_PI;      /*200504*/                    
               W02.TAB_PI_ÅR(6)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(6)     = W02_PI_KODE;                            
               W02.TAB_PI(6)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(6)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(6) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(7)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR7O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE7O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP7O = W02_PI;       /*200504*/                   
               W02.TAB_PI_ÅR(7)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(7)     = W02_PI_KODE;                            
               W02.TAB_PI(7)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(7)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(7) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(8)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR8O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE8O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP8O = W02_PI;     /*200504*/                     
               W02.TAB_PI_ÅR(8)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(8)     = W02_PI_KODE;                            
               W02.TAB_PI(8)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(8)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(8) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(9)                                                                 
            DO;                                                                 
               S001I02O.FRAÅR9O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.FRATYPE9O  = W02_PI_TYPE;                               
               S001I02O.FRABELØP9O = W02_PI;   /* 200504*/                      
               W02.TAB_PI_ÅR(9)       = W02_PI_ÅR;                              
               W02.TAB_PI_KODE(9)     = W02_PI_KODE;                            
               W02.TAB_PI(9)          = W02_PI;                                 
               W02.TAB_PI_KOMMNR(9)   = W02_PI_KOMMNR;                          
               W02.TAB_PI_RAPPDATO(9) = W02_PI_RAPPDATO;                        
            END;                                                                
        WHEN(10)                                                                
            DO;                                                                 
               S001I02O.FRAÅR10O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE10O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP10O = W02_PI;       /*200504*/                  
               W02.TAB_PI_ÅR(10)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(10)     = W02_PI_KODE;                           
               W02.TAB_PI(10)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(10)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(10) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(11)                                                                
            DO;                                                                 
               S001I02O.FRAÅR11O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE11O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP11O = W02_PI;        /*200504*/                 
               W02.TAB_PI_ÅR(11)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(11)     = W02_PI_KODE;                           
               W02.TAB_PI(11)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(11)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(11) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(12)                                                                
            DO;                                                                 
               S001I02O.FRAÅR12O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE12O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP12O = W02_PI;      /*200504*/                   
               W02.TAB_PI_ÅR(12)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(12)     = W02_PI_KODE;                           
               W02.TAB_PI(12)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(12)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(12) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(13)                                                                
            DO;                                                                 
               S001I02O.FRAÅR13O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE13O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP13O = W02_PI;     /*200504*/                    
               W02.TAB_PI_ÅR(13)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(13)     = W02_PI_KODE;                           
               W02.TAB_PI(13)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(13)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(13) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(14)                                                                
            DO;                                                                 
               S001I02O.FRAÅR14O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE14O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP14O = W02_PI;      /*200504*/                   
               W02.TAB_PI_ÅR(14)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(14)     = W02_PI_KODE;                           
               W02.TAB_PI(14)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(14)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(14) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(15)                                                                
            DO;                                                                 
               S001I02O.FRAÅR15O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE15O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP15O = W02_PI;    /*200504*/                     
               W02.TAB_PI_ÅR(15)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(15)     = W02_PI_KODE;                           
               W02.TAB_PI(15)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(15)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(15) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(16)                                                                
            DO;                                                                 
               S001I02O.FRAÅR16O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE16O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP16O = W02_PI;       /*200504*/                  
               W02.TAB_PI_ÅR(16)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(16)     = W02_PI_KODE;                           
               W02.TAB_PI(16)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(16)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(16) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(17)                                                                
            DO;                                                                 
               S001I02O.FRAÅR17O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE17O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP17O = W02_PI;     /*200504*/                    
               W02.TAB_PI_ÅR(17)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(17)     = W02_PI_KODE;                           
               W02.TAB_PI(17)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(17)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(17) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(18)                                                                
            DO;                                                                 
               S001I02O.FRAÅR18O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE18O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP18O = W02_PI;   /*200504*/                      
               W02.TAB_PI_ÅR(18)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(18)     = W02_PI_KODE;                           
               W02.TAB_PI(18)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(18)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(18) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(19)                                                                
            DO;                                                                 
               S001I02O.FRAÅR19O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE19O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP19O = W02_PI;     /*200504*/                    
               W02.TAB_PI_ÅR(19)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(19)     = W02_PI_KODE;                           
               W02.TAB_PI(19)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(19)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(19) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(20)                                                                
            DO;                                                                 
               S001I02O.FRAÅR20O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE20O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP20O = W02_PI;    /*200504*/                     
               W02.TAB_PI_ÅR(20)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(20)     = W02_PI_KODE;                           
               W02.TAB_PI(20)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(20)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(20) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(21)                                                                
            DO;                                                                 
               S001I02O.FRAÅR21O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE21O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP21O = W02_PI;     /*200504*/                    
               W02.TAB_PI_ÅR(21)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(21)     = W02_PI_KODE;                           
               W02.TAB_PI(21)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(21)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(21) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(22)                                                                
            DO;                                                                 
               S001I02O.FRAÅR22O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE22O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP22O = W02_PI;     /*200504*/                    
               W02.TAB_PI_ÅR(22)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(22)     = W02_PI_KODE;                           
               W02.TAB_PI(22)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(22)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(22) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(23)                                                                
            DO;                                                                 
               S001I02O.FRAÅR23O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE23O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP23O = W02_PI;    /*200504*/                     
               W02.TAB_PI_ÅR(23)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(23)     = W02_PI_KODE;                           
               W02.TAB_PI(23)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(23)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(23) = W02_PI_RAPPDATO;                       
            END;                                                                
        WHEN(24)                                                                
            DO;                                                                 
               S001I02O.FRAÅR24O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.FRATYPE24O  = W02_PI_TYPE;                              
               S001I02O.FRABELØP24O = W02_PI;     /*200504*/                    
               W02.TAB_PI_ÅR(24)       = W02_PI_ÅR;                             
               W02.TAB_PI_KODE(24)     = W02_PI_KODE;                           
               W02.TAB_PI(24)          = W02_PI;                                
               W02.TAB_PI_KOMMNR(24)   = W02_PI_KOMMNR;                         
               W02.TAB_PI_RAPPDATO(24) = W02_PI_RAPPDATO;                       
            END;                                                                
        OTHERWISE;                                                              
     END;                                                                       
  END FLYTT_DBOPPL_TIL_BL_OMR_FRAFNR;                                           
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  FLYTT_DBOPPL_TIL_BL_OMR_TILFNR:                                               
     PROC;                                                                      
                                                                                
     S001I02O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                            
                                                                                
     SELECT(ANTALL_TIL_LEST);                                                   
        WHEN(1)                                                                 
            DO;                                                                 
               S001I02O.TILÅR1O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE1O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP1O = W02_PI;                                    
            END;                                                                
        WHEN(2)                                                                 
            DO;                                                                 
               S001I02O.TILÅR2O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE2O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP2O = W02_PI;                                    
            END;                                                                
        WHEN(3)                                                                 
            DO;                                                                 
               S001I02O.TILÅR3O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE3O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP3O = W02_PI;                                    
            END;                                                                
        WHEN(4)                                                                 
            DO;                                                                 
               S001I02O.TILÅR4O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE4O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP4O = W02_PI;                                    
            END;                                                                
        WHEN(5)                                                                 
            DO;                                                                 
               S001I02O.TILÅR5O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE5O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP5O = W02_PI;                                    
            END;                                                                
        WHEN(6)                                                                 
            DO;                                                                 
               S001I02O.TILÅR6O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE6O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP6O = W02_PI;                                    
            END;                                                                
        WHEN(7)                                                                 
            DO;                                                                 
               S001I02O.TILÅR7O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE7O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP7O = W02_PI;                                    
            END;                                                                
        WHEN(8)                                                                 
            DO;                                                                 
               S001I02O.TILÅR8O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE8O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP8O = W02_PI;                                    
            END;                                                                
        WHEN(9)                                                                 
            DO;                                                                 
               S001I02O.TILÅR9O    = KONV_HÅ_Å(W02_PI_ÅR);                      
               S001I02O.TILTYPE9O  = W02_PI_TYPE;                               
               S001I02O.TILBELØP9O = W02_PI;                                    
            END;                                                                
        WHEN(10)                                                                
            DO;                                                                 
               S001I02O.TILÅR10O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE10O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP10O = W02_PI;                                   
            END;                                                                
        WHEN(11)                                                                
            DO;                                                                 
               S001I02O.TILÅR11O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE11O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP11O = W02_PI;                                   
            END;                                                                
        WHEN(12)                                                                
            DO;                                                                 
               S001I02O.TILÅR12O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE12O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP12O = W02_PI;                                   
            END;                                                                
        WHEN(13)                                                                
            DO;                                                                 
               S001I02O.TILÅR13O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE13O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP13O = W02_PI;                                   
            END;                                                                
        WHEN(14)                                                                
            DO;                                                                 
               S001I02O.TILÅR14O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE14O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP14O = W02_PI;                                   
            END;                                                                
        WHEN(15)                                                                
            DO;                                                                 
               S001I02O.TILÅR15O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE15O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP15O = W02_PI;                                   
            END;                                                                
        WHEN(16)                                                                
            DO;                                                                 
               S001I02O.TILÅR16O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE16O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP16O = W02_PI;                                   
            END;                                                                
        WHEN(17)                                                                
            DO;                                                                 
               S001I02O.TILÅR17O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE17O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP17O = W02_PI;                                   
            END;                                                                
        WHEN(18)                                                                
            DO;                                                                 
               S001I02O.TILÅR18O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE18O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP18O = W02_PI;                                   
            END;                                                                
        WHEN(19)                                                                
            DO;                                                                 
               S001I02O.TILÅR19O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE19O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP19O = W02_PI;                                   
            END;                                                                
        WHEN(20)                                                                
            DO;                                                                 
               S001I02O.TILÅR20O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE20O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP20O = W02_PI;                                   
            END;                                                                
        WHEN(21)                                                                
            DO;                                                                 
               S001I02O.TILÅR21O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE21O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP21O = W02_PI;                                   
            END;                                                                
        WHEN(22)                                                                
            DO;                                                                 
               S001I02O.TILÅR22O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE22O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP22O = W02_PI;                                   
            END;                                                                
        WHEN(23)                                                                
            DO;                                                                 
               S001I02O.TILÅR23O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE23O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP23O = W02_PI;                                   
            END;                                                                
        WHEN(24)                                                                
            DO;                                                                 
               S001I02O.TILÅR24O    = KONV_HÅ_Å(W02_PI_ÅR);                     
               S001I02O.TILTYPE24O  = W02_PI_TYPE;                              
               S001I02O.TILBELØP24O = W02_PI;                                   
            END;                                                                
        OTHERWISE;                                                              
     END;                                                                       
  END FLYTT_DBOPPL_TIL_BL_OMR_TILFNR;                                           
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  BLANK_TIL_OPPL:                                                               
    PROC;                                                                       
          S001I02I.TILÅR1I    = LOW_VALUES;                                     
          S001I02I.TILTYPE1I  = LOW_VALUES;                                     
          S001I02I.TILBELØP1I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR2I    = LOW_VALUES;                                     
          S001I02I.TILTYPE2I  = LOW_VALUES;                                     
          S001I02I.TILBELØP2I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR3I    = LOW_VALUES;                                     
          S001I02I.TILTYPE3I  = LOW_VALUES;                                     
          S001I02I.TILBELØP3I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR4I    = LOW_VALUES;                                     
          S001I02I.TILTYPE4I  = LOW_VALUES;                                     
          S001I02I.TILBELØP4I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR5I    = LOW_VALUES;                                     
          S001I02I.TILTYPE5I  = LOW_VALUES;                                     
          S001I02I.TILBELØP5I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR6I    = LOW_VALUES;                                     
          S001I02I.TILTYPE6I  = LOW_VALUES;                                     
          S001I02I.TILBELØP6I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR7I    = LOW_VALUES;                                     
          S001I02I.TILTYPE7I  = LOW_VALUES;                                     
          S001I02I.TILBELØP7I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR8I    = LOW_VALUES;                                     
          S001I02I.TILTYPE8I  = LOW_VALUES;                                     
          S001I02I.TILBELØP8I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR9I    = LOW_VALUES;                                     
          S001I02I.TILTYPE9I  = LOW_VALUES;                                     
          S001I02I.TILBELØP9I = LOW_VALUES;                                     
                                                                                
                                                                                
          S001I02I.TILÅR10I    = LOW_VALUES;                                    
          S001I02I.TILTYPE10I  = LOW_VALUES;                                    
          S001I02I.TILBELØP10I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR11I    = LOW_VALUES;                                    
          S001I02I.TILTYPE11I  = LOW_VALUES;                                    
          S001I02I.TILBELØP11I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR12I    = LOW_VALUES;                                    
          S001I02I.TILTYPE12I  = LOW_VALUES;                                    
          S001I02I.TILBELØP12I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR13I    = LOW_VALUES;                                    
          S001I02I.TILTYPE13I  = LOW_VALUES;                                    
          S001I02I.TILBELØP13I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR14I    = LOW_VALUES;                                    
          S001I02I.TILTYPE14I  = LOW_VALUES;                                    
          S001I02I.TILBELØP14I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR15I    = LOW_VALUES;                                    
          S001I02I.TILTYPE15I  = LOW_VALUES;                                    
          S001I02I.TILBELØP15I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR16I    = LOW_VALUES;                                    
          S001I02I.TILTYPE16I  = LOW_VALUES;                                    
          S001I02I.TILBELØP16I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR17I    = LOW_VALUES;                                    
          S001I02I.TILTYPE17I  = LOW_VALUES;                                    
          S001I02I.TILBELØP17I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR18I    = LOW_VALUES;                                    
          S001I02I.TILTYPE18I  = LOW_VALUES;                                    
          S001I02I.TILBELØP18I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR19I    = LOW_VALUES;                                    
          S001I02I.TILTYPE19I  = LOW_VALUES;                                    
          S001I02I.TILBELØP19I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR20I    = LOW_VALUES;                                    
          S001I02I.TILTYPE20I  = LOW_VALUES;                                    
          S001I02I.TILBELØP20I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR21I    = LOW_VALUES;                                    
          S001I02I.TILTYPE21I  = LOW_VALUES;                                    
          S001I02I.TILBELØP21I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR22I    = LOW_VALUES;                                    
          S001I02I.TILTYPE22I  = LOW_VALUES;                                    
          S001I02I.TILBELØP22I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR23I    = LOW_VALUES;                                    
          S001I02I.TILTYPE23I  = LOW_VALUES;                                    
          S001I02I.TILBELØP23I = LOW_VALUES;                                    
                                                                                
                                                                                
          S001I02I.TILÅR24I    = LOW_VALUES;                                    
          S001I02I.TILTYPE24I  = LOW_VALUES;                                    
          S001I02I.TILBELØP24I = LOW_VALUES;                                    
                                                                                
  END BLANK_TIL_OPPL;                                                           
                                                                                
  MARKER_LINJE:                                                                 
     PROC;                                                                      
                                                                                
     S001I02O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                            
                                                                                
     SELECT(I);                                                                 
        WHEN(1)                                                                 
            S001I02I.MRK1I    = 'M';                                            
        WHEN(2)                                                                 
            S001I02I.MRK2I    = 'M';                                            
        WHEN(3)                                                                 
            S001I02I.MRK3I    = 'M';                                            
        WHEN(4)                                                                 
            S001I02I.MRK4I    = 'M';                                            
        WHEN(5)                                                                 
            S001I02I.MRK5I    = 'M';                                            
        WHEN(6)                                                                 
            S001I02I.MRK6I    = 'M';                                            
        WHEN(7)                                                                 
            S001I02I.MRK7I    = 'M';                                            
        WHEN(8)                                                                 
            S001I02I.MRK8I    = 'M';                                            
        WHEN(9)                                                                 
            S001I02I.MRK9I    = 'M';                                            
        WHEN(10)                                                                
            S001I02I.MRK10I    = 'M';                                           
        WHEN(11)                                                                
            S001I02I.MRK11I    = 'M';                                           
        WHEN(12)                                                                
            S001I02I.MRK12I    = 'M';                                           
        WHEN(13)                                                                
            S001I02I.MRK13I    = 'M';                                           
        WHEN(14)                                                                
            S001I02I.MRK14I    = 'M';                                           
        WHEN(15)                                                                
            S001I02I.MRK15I    = 'M';                                           
        WHEN(16)                                                                
            S001I02I.MRK16I    = 'M';                                           
        WHEN(17)                                                                
            S001I02I.MRK17I    = 'M';                                           
        WHEN(18)                                                                
            S001I02I.MRK18I    = 'M';                                           
        WHEN(19)                                                                
            S001I02I.MRK19I    = 'M';                                           
        WHEN(20)                                                                
            S001I02I.MRK20I    = 'M';                                           
        WHEN(21)                                                                
            S001I02I.MRK21I    = 'M';                                           
        WHEN(22)                                                                
            S001I02I.MRK22I    = 'M';                                           
        WHEN(23)                                                                
            S001I02I.MRK23I    = 'M';                                           
        WHEN(24)                                                                
            S001I02I.MRK24I    = 'M';                                           
        OTHERWISE;                                                              
     END;                                                                       
  END MARKER_LINJE;                                                             
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  BEHANDLE_MARKERTE_LINJER:                                                     
   PROC;                                                                        
                                                                                
     S001I02O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                            
                                                                                
     IF S001I02I.MRK1I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR1O    = S001I02O.FRAÅR1O;                              
           S001I02O.TILTYPE1O  = S001I02O.FRATYPE1O;                            
           S001I02O.TILBELØP1O = S001I02O.FRABELØP1O;                           
           S001I02O.MRK1O      = '*';                                           
           S001I02I.FRAÅR1I    = LOW_VALUES;                                    
           S001I02I.FRATYPE1I  = LOW_VALUES;                                    
           S001I02I.FRABELØP1I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK2I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR2O    = S001I02O.FRAÅR2O;                              
           S001I02O.TILTYPE2O  = S001I02O.FRATYPE2O;                            
           S001I02O.TILBELØP2O = S001I02O.FRABELØP2O;                           
           S001I02O.MRK2O      = '*';                                           
           S001I02I.FRAÅR2I    = LOW_VALUES;                                    
           S001I02I.FRATYPE2I  = LOW_VALUES;                                    
           S001I02I.FRABELØP2I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK3I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR3O    = S001I02O.FRAÅR3O;                              
           S001I02O.TILTYPE3O  = S001I02O.FRATYPE3O;                            
           S001I02O.TILBELØP3O = S001I02O.FRABELØP3O;                           
           S001I02O.MRK3O      = '*';                                           
           S001I02I.FRAÅR3I    = LOW_VALUES;                                    
           S001I02I.FRATYPE3I  = LOW_VALUES;                                    
           S001I02I.FRABELØP3I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK4I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR4O    = S001I02O.FRAÅR4O;                              
           S001I02O.TILTYPE4O  = S001I02O.FRATYPE4O;                            
           S001I02O.TILBELØP4O = S001I02O.FRABELØP4O;                           
           S001I02O.MRK4O      = '*';                                           
           S001I02I.FRAÅR4I    = LOW_VALUES;                                    
           S001I02I.FRATYPE4I  = LOW_VALUES;                                    
           S001I02I.FRABELØP4I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK5I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR5O    = S001I02O.FRAÅR5O;                              
           S001I02O.TILTYPE5O  = S001I02O.FRATYPE5O;                            
           S001I02O.TILBELØP5O = S001I02O.FRABELØP5O;                           
           S001I02O.MRK5O      = '*';                                           
           S001I02I.FRAÅR5I    = LOW_VALUES;                                    
           S001I02I.FRATYPE5I  = LOW_VALUES;                                    
           S001I02I.FRABELØP5I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK6I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR6O    = S001I02O.FRAÅR6O;                              
           S001I02O.TILTYPE6O  = S001I02O.FRATYPE6O;                            
           S001I02O.TILBELØP6O = S001I02O.FRABELØP6O;                           
           S001I02O.MRK6O      = '*';                                           
           S001I02I.FRAÅR6I    = LOW_VALUES;                                    
           S001I02I.FRATYPE6I  = LOW_VALUES;                                    
           S001I02I.FRABELØP6I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK7I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR7O    = S001I02O.FRAÅR7O;                              
           S001I02O.TILTYPE7O  = S001I02O.FRATYPE7O;                            
           S001I02O.TILBELØP7O = S001I02O.FRABELØP7O;                           
           S001I02O.MRK7O      = '*';                                           
           S001I02I.FRAÅR7I    = LOW_VALUES;                                    
           S001I02I.FRATYPE7I  = LOW_VALUES;                                    
           S001I02I.FRABELØP7I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK8I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR8O    = S001I02O.FRAÅR8O;                              
           S001I02O.TILTYPE8O  = S001I02O.FRATYPE8O;                            
           S001I02O.TILBELØP8O = S001I02O.FRABELØP8O;                           
           S001I02O.MRK8O      = '*';                                           
           S001I02I.FRAÅR8I    = LOW_VALUES;                                    
           S001I02I.FRATYPE8I  = LOW_VALUES;                                    
           S001I02I.FRABELØP8I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK9I = 'M' THEN                                               
        DO;                                                                     
           S001I02O.TILÅR9O    = S001I02O.FRAÅR9O;                              
           S001I02O.TILTYPE9O  = S001I02O.FRATYPE9O;                            
           S001I02O.TILBELØP9O = S001I02O.FRABELØP9O;                           
           S001I02O.MRK9O      = '*';                                           
           S001I02I.FRAÅR9I    = LOW_VALUES;                                    
           S001I02I.FRATYPE9I  = LOW_VALUES;                                    
           S001I02I.FRABELØP9I = LOW_VALUES;                                    
        END;                                                                    
     IF S001I02I.MRK10I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR10O    = S001I02O.FRAÅR10O;                            
           S001I02O.TILTYPE10O  = S001I02O.FRATYPE10O;                          
           S001I02O.TILBELØP10O = S001I02O.FRABELØP10O;                         
           S001I02O.MRK10O      = '*';                                          
           S001I02I.FRAÅR10I    = LOW_VALUES;                                   
           S001I02I.FRATYPE10I  = LOW_VALUES;                                   
           S001I02I.FRABELØP10I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK11I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR11O    = S001I02O.FRAÅR11O;                            
           S001I02O.TILTYPE11O  = S001I02O.FRATYPE11O;                          
           S001I02O.TILBELØP11O = S001I02O.FRABELØP11O;                         
           S001I02O.MRK11O      = '*';                                          
           S001I02I.FRAÅR11I    = LOW_VALUES;                                   
           S001I02I.FRATYPE11I  = LOW_VALUES;                                   
           S001I02I.FRABELØP11I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK12I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR12O    = S001I02O.FRAÅR12O;                            
           S001I02O.TILTYPE12O  = S001I02O.FRATYPE12O;                          
           S001I02O.TILBELØP12O = S001I02O.FRABELØP12O;                         
           S001I02O.MRK12O      = '*';                                          
           S001I02I.FRAÅR12I    = LOW_VALUES;                                   
           S001I02I.FRATYPE12I  = LOW_VALUES;                                   
           S001I02I.FRABELØP12I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK13I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR13O    = S001I02O.FRAÅR13O;                            
           S001I02O.TILTYPE13O  = S001I02O.FRATYPE13O;                          
           S001I02O.TILBELØP13O = S001I02O.FRABELØP13O;                         
           S001I02O.MRK13O      = '*';                                          
           S001I02I.FRAÅR13I    = LOW_VALUES;                                   
           S001I02I.FRATYPE13I  = LOW_VALUES;                                   
           S001I02I.FRABELØP13I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK14I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR14O    = S001I02O.FRAÅR14O;                            
           S001I02O.TILTYPE14O  = S001I02O.FRATYPE14O;                          
           S001I02O.TILBELØP14O = S001I02O.FRABELØP14O;                         
           S001I02O.MRK14O      = '*';                                          
           S001I02I.FRAÅR14I    = LOW_VALUES;                                   
           S001I02I.FRATYPE14I  = LOW_VALUES;                                   
           S001I02I.FRABELØP14I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK15I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR15O    = S001I02O.FRAÅR15O;                            
           S001I02O.TILTYPE15O  = S001I02O.FRATYPE15O;                          
           S001I02O.TILBELØP15O = S001I02O.FRABELØP15O;                         
           S001I02O.MRK15O      = '*';                                          
           S001I02I.FRAÅR15I    = LOW_VALUES;                                   
           S001I02I.FRATYPE15I  = LOW_VALUES;                                   
           S001I02I.FRABELØP15I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK16I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR16O    = S001I02O.FRAÅR16O;                            
           S001I02O.TILTYPE16O  = S001I02O.FRATYPE16O;                          
           S001I02O.TILBELØP16O = S001I02O.FRABELØP16O;                         
           S001I02O.MRK16O      = '*';                                          
           S001I02I.FRAÅR16I    = LOW_VALUES;                                   
           S001I02I.FRATYPE16I  = LOW_VALUES;                                   
           S001I02I.FRABELØP16I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK17I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR17O    = S001I02O.FRAÅR17O;                            
           S001I02O.TILTYPE17O  = S001I02O.FRATYPE17O;                          
           S001I02O.TILBELØP17O = S001I02O.FRABELØP17O;                         
           S001I02O.MRK17O      = '*';                                          
           S001I02I.FRAÅR17I    = LOW_VALUES;                                   
           S001I02I.FRATYPE17I  = LOW_VALUES;                                   
           S001I02I.FRABELØP17I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK18I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR18O    = S001I02O.FRAÅR18O;                            
           S001I02O.TILTYPE18O  = S001I02O.FRATYPE18O;                          
           S001I02O.TILBELØP18O = S001I02O.FRABELØP18O;                         
           S001I02O.MRK18O      = '*';                                          
           S001I02I.FRAÅR18I    = LOW_VALUES;                                   
           S001I02I.FRATYPE18I  = LOW_VALUES;                                   
           S001I02I.FRABELØP18I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK19I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR19O    = S001I02O.FRAÅR19O;                            
           S001I02O.TILTYPE19O  = S001I02O.FRATYPE19O;                          
           S001I02O.TILBELØP19O = S001I02O.FRABELØP19O;                         
           S001I02O.MRK19O      = '*';                                          
           S001I02I.FRAÅR19I    = LOW_VALUES;                                   
           S001I02I.FRATYPE19I  = LOW_VALUES;                                   
           S001I02I.FRABELØP19I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK20I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR20O    = S001I02O.FRAÅR20O;                            
           S001I02O.TILTYPE20O  = S001I02O.FRATYPE20O;                          
           S001I02O.TILBELØP20O = S001I02O.FRABELØP20O;                         
           S001I02O.MRK20O      = '*';                                          
           S001I02I.FRAÅR20I    = LOW_VALUES;                                   
           S001I02I.FRATYPE20I  = LOW_VALUES;                                   
           S001I02I.FRABELØP20I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK21I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR21O    = S001I02O.FRAÅR21O;                            
           S001I02O.TILTYPE21O  = S001I02O.FRATYPE21O;                          
           S001I02O.TILBELØP21O = S001I02O.FRABELØP21O;                         
           S001I02O.MRK21O      = '*';                                          
           S001I02I.FRAÅR21I    = LOW_VALUES;                                   
           S001I02I.FRATYPE21I  = LOW_VALUES;                                   
           S001I02I.FRABELØP21I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK22I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR22O    = S001I02O.FRAÅR22O;                            
           S001I02O.TILTYPE22O  = S001I02O.FRATYPE22O;                          
           S001I02O.TILBELØP22O = S001I02O.FRABELØP22O;                         
           S001I02O.MRK22O      = '*';                                          
           S001I02I.FRAÅR22I    = LOW_VALUES;                                   
           S001I02I.FRATYPE22I  = LOW_VALUES;                                   
           S001I02I.FRABELØP22I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK23I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR23O    = S001I02O.FRAÅR23O;                            
           S001I02O.TILTYPE23O  = S001I02O.FRATYPE23O;                          
           S001I02O.TILBELØP23O = S001I02O.FRABELØP23O;                         
           S001I02O.MRK23O      = '*';                                          
           S001I02I.FRAÅR23I    = LOW_VALUES;                                   
           S001I02I.FRATYPE23I  = LOW_VALUES;                                   
           S001I02I.FRABELØP23I = LOW_VALUES;                                   
        END;                                                                    
     IF S001I02I.MRK24I = 'M' THEN                                              
        DO;                                                                     
           S001I02O.TILÅR24O    = S001I02O.FRAÅR24O;                            
           S001I02O.TILTYPE24O  = S001I02O.FRATYPE24O;                          
           S001I02O.TILBELØP24O = S001I02O.FRABELØP24O;                         
           S001I02O.MRK24O      = '*';                                          
           S001I02I.FRAÅR24I    = LOW_VALUES;                                   
           S001I02I.FRATYPE24I  = LOW_VALUES;                                   
           S001I02I.FRABELØP24I = LOW_VALUES;                                   
        END;                                                                    
                                                                                
  END BEHANDLE_MARKERTE_LINJER;                                                 
                                                                                
                                                                                
                                                                                
                                                                                
  OVERFØR_INNTEKTER:                                                            
     PROC(W01_PINT,INNT_ALDER_FRA,INNT_ALDER_TIL,FRA_FNR,TIL_FNR);              
                                                                                
     DCL INNT_ALDER_FRA CHAR (2);                                               
     DCL INNT_ALDER_TIL CHAR (2);                                               
     DCL FRA_FNR        PIC '(11)9';                                            
     DCL TIL_FNR        PIC '(11)9';                                            
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   INNTEKT-SEGMENTET                                            */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01_PINT               UNALIGNED,                                 
       %INCLUDE P0019928;                                                       
                                                                                
                                                                                
                                                                                
     IF S001I02O.MRK1O = '*' THEN                                               
        CALL SKRIV_INNT(1,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK2O = '*' THEN                                               
        CALL SKRIV_INNT(2,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK3O = '*' THEN                                               
        CALL SKRIV_INNT(3,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK4O = '*' THEN                                               
        CALL SKRIV_INNT(4,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK5O = '*' THEN                                               
        CALL SKRIV_INNT(5,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK6O = '*' THEN                                               
        CALL SKRIV_INNT(6,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK7O = '*' THEN                                               
        CALL SKRIV_INNT(7,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK8O = '*' THEN                                               
        CALL SKRIV_INNT(8,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK9O = '*' THEN                                               
        CALL SKRIV_INNT(9,INNT_ALDER_TIL,INNT_ALDER_FRA);                       
                                                                                
     IF S001I02O.MRK10O = '*' THEN                                              
        CALL SKRIV_INNT(10,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK11O = '*' THEN                                              
        CALL SKRIV_INNT(11,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK12O = '*' THEN                                              
        CALL SKRIV_INNT(12,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK13O = '*' THEN                                              
        CALL SKRIV_INNT(13,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK14O = '*' THEN                                              
        CALL SKRIV_INNT(14,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK15O = '*' THEN                                              
        CALL SKRIV_INNT(15,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK16O = '*' THEN                                              
        CALL SKRIV_INNT(16,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK17O = '*' THEN                                              
        CALL SKRIV_INNT(17,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK18O = '*' THEN                                              
        CALL SKRIV_INNT(18,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK19O = '*' THEN                                              
        CALL SKRIV_INNT(19,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK20O = '*' THEN                                              
        CALL SKRIV_INNT(20,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK21O = '*' THEN                                              
        CALL SKRIV_INNT(21,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK22O = '*' THEN                                              
        CALL SKRIV_INNT(22,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK23O = '*' THEN                                              
        CALL SKRIV_INNT(23,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
     IF S001I02O.MRK24O = '*' THEN                                              
        CALL SKRIV_INNT(24,INNT_ALDER_TIL,INNT_ALDER_FRA);                      
                                                                                
  END OVERFØR_INNTEKTER;                                                        
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
  P10_SKRIV_PINNTEKT:                                                           
    PROC;                                                                       
                                                                                
      SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR         ;                
      SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE       ;                
                                                                                
      CALL PLITDLI                          (W02_PARM_CT_5,                     
                                             W02_ISRT,                          
                                             RF1,                               
                                             W01_PINT,                          
                                             SSA1_RF0PERSN,                     
                                             SSA_UQUAL_PINNTEKT);               
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  PINNTEKT                */                   
           /* ******************************************** */                   
  L105:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '105';                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
      IF   RF1.STATUS_KODE             =   'II'    THEN                         
        DO;                                                                     
           SSA1_RF0PERSN.PKEY               =     TIL_FNR;                      
           SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR         ;           
           SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE       ;           
                                                                                
          /* ******************************************** */                    
          /* SAMME PINNTEKT LIGGER INNE FRA FØR           */                    
          /* DETTE FJERNES FØR DET NYE LEGGES INN.        */                    
          /* ******************************************** */                    
                                                                                
          CALL PLITDLI                        (W02_PARM_CT_5,                   
                                               W02_GHU,                         
                                               RF1,                             
                                               W01_IO,                          
                                               SSA1_RF0PERSN,                   
                                               SSA1_PINNTEKT);                  
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! RF1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED LES   AV :  PINNTEKT                */                
              /* ******************************************** */                
  L110:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '110';                            
              DB_STATUS_KODE           =       RF1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
          /* ******************************************** */                    
          /* OPPLYSING SOM SKAL FJERNES FRA RFMAIN MÅ     */                    
          /* REGISTRERES PÅ  SPORBARHET DATABASE DRMAIN    */                   
          /* ******************************************** */                    
            FUNK_KODE      =     'IF' ;                                         
                                                                                
            CALL OPPDATE_DR_INNTEKT(TIL_FNR, W01_IO );                          
            IF FEIL_MELD_NR > 0 THEN                                            
                    GOTO L999;                                                  
                                                                                
          /* ******************************************** */                    
          /* KALLET GHU GIKK OK . DELETER PINNTEKT        */                    
          /* ******************************************** */                    
                                                                                
          CALL PLITDLI                        (W02_PARM_CT_3,                   
                                               W02_DLET,                        
                                               RF1,                             
                                               W01_IO);                         
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! RF1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED DELETE  AV :  PINNTEKT              */                
              /* ******************************************** */                
  L120:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '120';                            
              DB_STATUS_KODE           =       RF1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
          /* ************************************************* */               
          /* GML. PINNTEKT ER FJERNET . DET NYE LEGGES INN     */               
          /* ************************************************* */               
                                                                                
          CALL PLITDLI                        (W02_PARM_CT_5,                   
                                               W02_ISRT,                        
                                               RF1,                             
                                               W01_PINT,                        
                                               SSA1_RF0PERSN,                   
                                               SSA_UQUAL_PINNTEKT);             
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! RF1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED SKRIV AV :  PINNTEKT                */                
              /* ******************************************** */                
  L130:                                                                         
              FEIL_MELD_NR             =    500              ;                  
              FEIL_VED_LABEL           =   '130'             ;                  
              DB_STATUS_KODE           =    RF1.STATUS_KODE  ;                  
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
        END;                                                                    
      ELSE                                                                      
         IF  RF1.STATUS_KODE           ^=       '  '         THEN               
             DO;                                                                
             /* ************************************************/               
             /* RF1.STATUS_KODE ^= 'II','  ' EL 'GE'): DB-FEIL */               
             /* ************************************************/               
  L135:                                                                         
                FEIL_MELD_NR                =    500 ;                          
                FEIL_VED_LABEL              =   '135';                          
                DB_STATUS_KODE              =    RF1.STATUS_KODE;               
                GO   TO  RETUR;                                                 
             END;                                                               
  RETUR:                                                                        
                                                                                
  END P10_SKRIV_PINNTEKT;                                                       
                                                                                
                                                                                
                                                                                
  P20_FJERN_PINNTEKT:                                                           
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    FJERNER PINNTEKT FOR FRA_FNR ETTER AT INNTEKTENE ER           */        
  /*    OVERFØRT TIL TIL_FNR.                                         */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL P20_FJERN_PINNTEKT;                                      */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
      SSA1_PINNTEKT.ÅR                 =     W02_PI_ÅR;                         
      SSA1_PINNTEKT.TYPE               =     W02_PI_TYPE;                       
                                                                                
    /* ************************************************************** */        
    /* TAR ET GHU-KALL,FØR DLET.                                      */        
    /* ************************************************************** */        
                                                                                
                                                                                
      CALL PLITDLI                        (W02_PARM_CT_5,                       
                                           W02_GHU,                             
                                           RF1,                                 
                                        /* W01_PINT, */                         
                                           W01_IO  ,                            
                                           SSA1_RF0PERSN,                       
                                           SSA1_PINNTEKT);                      
                                                                                
                                                                                
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                            
          ! RF1.STATUS_KODE         ^=       '  '         THEN                  
          DO;                                                                   
              /* ******************************************** */                
              /* FEIL VED LES   AV :  PINNTEKT                */                
              /* ******************************************** */                
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)                    
                                                         ACCUM PAGING;          
  L140:                                                                         
             FEIL_MELD_NR             =       500 ;                             
             FEIL_VED_LABEL           =      '140';                             
             DB_STATUS_KODE           =       RF1.STATUS_KODE;                  
             GO   TO  RETUR;                                                    
          END;                                                                  
                                                                                
                                                                                
       /* ******************************************** */                       
       /* OPPLYSING SOM SKAL FJERNES FRA RFMAIN MÅ     */                       
       /* REGISTRERES PÅ  SPORBARHET DATABASE DRMAIN    */                      
       /* ******************************************** */                       
         FUNK_KODE    = 'IO';                                                   
                                                                                
         CALL OPPDATE_DR_INNTEKT(FRA_FNR, W01_IO  );                            
         IF FEIL_MELD_NR > 0 THEN                                               
                    GOTO L999;                                                  
                                                                                
       /* ******************************************** */                       
       /* KALLET GHU GIKK OK . DELETER PINNTEKT        */                       
       /* ******************************************** */                       
                                                                                
       CALL PLITDLI                        (W02_PARM_CT_3,                      
                                           W02_DLET,                            
                                           RF1,                                 
                                           W01_IO  );                           
                                                                                
       IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                           
         ! RF1.STATUS_KODE         ^=       '  '         THEN                   
         DO;                                                                    
              /* ******************************************** */                
              /* FEIL VED DELETE  AV :  PINNTEKT              */                
              /* ******************************************** */                
  L145:                                                                         
            FEIL_MELD_NR             =       500 ;                              
            FEIL_VED_LABEL           =      '145';                              
            DB_STATUS_KODE           =       RF1.STATUS_KODE;                   
            GO   TO  RETUR;                                                     
         END;                                                                   
                                                                                
                                                                                
    /* ************************************************************** */        
    /* SJEKKER OM DET ER FLERE SEGMENTER UNDER ROT.                   */        
    /* HVIS IKKE,FJERNES ROT.                                         */        
    /* TAR ET GU-KALL,FØR GNP.                                       */         
    /* ************************************************************** */        
                                                                                
                                                                                
      CALL PLITDLI                        (W02_PARM_CT_4,                       
                                           W02_GU,                              
                                           RF1,                                 
                                           W01_IO,                              
                                           SSA1_RF0PERSN);                      
                                                                                
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !                          
          RF1.STATUS_KODE         ^=       '  '             THEN                
          DO;                                                                   
              /* ******************************************** */                
              /* FEIL VED LES   AV :  ROT                     */                
              /* ******************************************** */                
  L150:                                                                         
             FEIL_MELD_NR             =       500 ;                             
             FEIL_VED_LABEL           =      '150';                             
             GO   TO  RETUR;                                                    
          END;                                                                  
                                                                                
      CALL PLITDLI                        (W02_PARM_CT_3,                       
                                           W02_GNP,                             
                                           RF1,                                 
                                           W01_IO);                             
                                                                                
      IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK THEN                       
          DO;                                                                   
              /* ******************************************** */                
              /* FEIL VED LES   AV :  ROT                     */                
              /* ******************************************** */                
  L155:                                                                         
             FEIL_MELD_NR             =       500 ;                             
             FEIL_VED_LABEL           =      '155';                             
             GO   TO  RETUR;                                                    
          END;                                                                  
      ELSE                                                                      
         IF RF1.STATUS_KODE           =   'GE'             THEN                 
            DO;                                                                 
                                                                                
                                                                                
    /* ************************************************************** */        
    /* TAR ET GHU-KALL,FØR DLET.                                      */        
    /* ************************************************************** */        
                                                                                
               CALL PLITDLI                        (W02_PARM_CT_4,              
                                                    W02_GHU,                    
                                                    RF1,                        
                                                    W01_IO,                     
                                                    SSA1_RF0PERSN);             
                                                                                
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK !                 
                   RF1.STATUS_KODE         ^=       '  '    THEN                
                   DO;                                                          
              /* ******************************************** */                
              /* FEIL VED LES   AV :  ROT                     */                
              /* ******************************************** */                
  L160:                                                                         
                      FEIL_MELD_NR             =       500 ;                    
                      FEIL_VED_LABEL           =      '160';                    
                      GO   TO  RETUR;                                           
                   END;                                                         
                                                                                
          /* ******************************************** */                    
          /* OPPLYSING SOM SKAL FJERNES FRA RFMAIN MÅ     */                    
          /* REGISTRERES PÅ  SPORBARHET DATABASE DRMAIN    */                   
          /* ******************************************** */                    
            CALL OPPDATE_DR_FNR (FRA_FNR,TIL_FNR,'FR');                         
            IF FEIL_MELD_NR > 0   THEN GOTO L999;                               
                                                                                
       /* ******************************************** */                       
       /* BARE ROT IGJEN.ROT FJERNES.                  */                       
       /* ******************************************** */                       
                                                                                
               CALL PLITDLI                       (W02_PARM_CT_3,               
                                                   W02_DLET,                    
                                                   RF1,                         
                                                   W01_IO);                     
                                                                                
               IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                   
                 ! RF1.STATUS_KODE         ^=       '  '         THEN           
                   DO;                                                          
              /* ******************************************** */                
              /* FEIL VED DELETE  AV :  ROT                   */                
              /* ******************************************** */                
  L165:                                                                         
                      FEIL_MELD_NR             =       500 ;                    
                      FEIL_VED_LABEL           =      '165';                    
                      DB_STATUS_KODE           =       RF1.STATUS_KODE;         
                      GO   TO  RETUR;                                           
                   END;                                                         
            END;                                                                
                                                                                
  RETUR:                                                                        
                                                                                
  END P20_FJERN_PINNTEKT;                                                       
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE ROT-SEGM GU QUAL.                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P005_LES_ROT_QUAL_FNRFRA:                                                   
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GU,                        
                                                 RF1,                           
                                                 RF0PERSN_FRA,                  
                                                 SSA1_RF0PERSN);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT  ( RF1.STATUS_KODE );                                          
                                                                                
            WHEN  ( '  ' )                                                      
              DO;                                                               
                BO_TKNR = RF0PERSN_FRA.TKNR;                                    
                CALL  KONTROLL_ACF2 ;                                           
                IF FEIL_MELD_NR > 0  THEN                                       
                   W01.MER_DATA             =    '0'B;                          
                ELSE                                                            
                   W01.MER_DATA             =    '1'B;                          
              END;                                                              
                                                                                
            WHEN  ( 'GE' )                                                      
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L170:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '170';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L180:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '180';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
                                                                                
                                                                                
    END P005_LES_ROT_QUAL_FNRFRA;                                               
                                                                                
                                                                                
    P006_LES_ROT_QUAL_FNRTIL:                                                   
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GU,                        
                                                 RF1,                           
                                                 RF0PERSN_TIL,                  
                                                 SSA1_RF0PERSN);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT  ( RF1.STATUS_KODE );                                          
                                                                                
            WHEN  ( '  ' )                                                      
              DO;                                                               
                BO_TKNR = RF0PERSN_TIL.TKNR;                                    
                CALL  KONTROLL_ACF2 ;                                           
                IF FEIL_MELD_NR > 0  THEN                                       
                   W01.MER_DATA             =    '0'B;                          
                ELSE                                                            
                   W01.MER_DATA             =    '1'B;                          
              END;                                                              
                                                                                
            WHEN  ( 'GE' )                                                      
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L171:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '171';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L181:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '181';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
                                                                                
                                                                                
    END P006_LES_ROT_QUAL_FNRTIL;                                               
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE INNT-SEGM GN QUAL.                          */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P010_LES_INNT_QUAL:                                                         
      PROC;                                                                     
                                                                                
                                                                                
      CALL PLITDLI                          (W02_PARM_CT_4,                     
                                             W02_GNP,                           
                                             RF1,                               
                                             W01_PINT,                          
                                             SSA1_PINNTEKT);                    
                                                                                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT  ( RF1.STATUS_KODE );                                          
                                                                                
            WHEN  ( '  ' )                                                      
              W01.MER_DATA                 =    '1'B;                           
                                                                                
            WHEN  ( 'GE' )                                                      
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L190:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '190';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L200:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '200';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
                                                                                
                                                                                
    END P010_LES_INNT_QUAL;                                                     
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR LESE NESTE PINNTEKT (GNP   UKVALIFISERT  )       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P020_LES_NESTE_PINNTEKT_FNR:                                                
      PROC;                                                                     
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_PINT,                      
                                                 SSA_UQUAL_PINNTEKT);           
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT ( RF1.STATUS_KODE );                                           
                                                                                
            WHEN ( '  ' )                                                       
              W01.MER_DATA                 =    '1'B;                           
                                                                                
            WHEN ( 'GE' , 'GB' )                                                
              W01.MER_DATA                 =    '0'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L210:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '210';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L215:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '215';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
                                                                                
                                                                                
    END P020_LES_NESTE_PINNTEKT_FNR;                                            
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE SOM OPPRETTER ROT.                                   */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P030_OPPRETT_ROT:                                                           
      PROC;                                                                     
                                                                                
      RF0PERSN_TIL.FNR          =     TIL_FNR            ;                      
                                                                                
      CALL PLITDLI                              (W02_PARM_CT_4,                 
                                                 W02_ISRT,                      
                                                 RF1,                           
                                                 RF0PERSN_TIL,                  
                                                 SSA_UQUAL_ROT);                
                                                                                
      IF   UIBFCTR                         =     UIB_RC_OK    THEN              
        DO;                                                                     
          SELECT  ( RF1.STATUS_KODE );                                          
                                                                                
            WHEN  ( '  ' )                                                      
              W01.MER_DATA                 =    '1'B;                           
                                                                                
            OTHERWISE                                                           
              DO;                                                               
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
  L230:                                                                         
                FEIL_MELD_NR               =     500;                           
                FEIL_VED_LABEL             =    '230';                          
                DB_STATUS_KODE             =     RF1.STATUS_KODE;               
                W01.MER_DATA               =    '0'B;                           
              END;                                                              
          END;                                                                  
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
  L240:                                                                         
          FEIL_MELD_NR               =     500;                                 
          FEIL_VED_LABEL             =    '240';                                
          W01.MER_DATA               =    '0'B;                                 
        END;                                                                    
                                                                                
                                                                                
    END P030_OPPRETT_ROT;                                                       
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR FINNE RETT TKNR .   (GU KVAL. PÅ ROT OG PINNTEKT)*/        
    /*                                                                */        
    /*     TKNR FINNES VED 1. OG SJEKKE OM ROTSEGM. FNR > 0  . ER DET */        
    /*     IKKE DET BENYTTES KOMMNR. I SISTE INNTEKTS-SEGM.           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    F100_FINN_TKNR:                                                             
      PROC            ( W100_FNR)   RETURNS (FIXED DEC(4))            ;         
                                                                                
      DCL W100_FNR      FIXED DEC   (11)                              ,         
          W100_TKNR     FIXED DEC   ( 4)     INIT     (0)             ;         
                                                                                
                                                                                
      SSA1_RF0PERSN.PKEY                  =      W100_FNR             ;         
      CALL P006_LES_ROT_QUAL_FNRTIL;                                            
                                                                                
                                                                                
                                                                                
      IF RF0PERSN_TIL.TKNR      >      0                THEN                    
         W100_TKNR          =      RF0PERSN_TIL.TKNR        ;                   
      ELSE                                                                      
         DO;                                                                    
            CALL PLITDLI                        (W02_PARM_CT_4,                 
                                                 W02_GNP,                       
                                                 RF1,                           
                                                 W01_PINT,                      
                                                 SSA_UQUAL_PINNTEKT_L);         
                                                                                
            IF   UIBFCTR                   =     UIB_RC_OK    THEN              
              DO;                                                               
                 SELECT ( RF1.STATUS_KODE );                                    
                                                                                
                    WHEN ( '  ' )                                               
                        W100_TKNR          =     W01_PINT.W02_PI_KOMMNR;        
                                                                                
                    WHEN ( 'GE' , 'GB' );                                       
                                                                                
                    OTHERWISE                                                   
                                                                                
                       /* ******************************************* */        
                       /*UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES*/        
                       /* ******************************************* */        
                       DO;                                                      
  L250:                                                                         
                          FEIL_MELD_NR         =     500;                       
                          FEIL_VED_LABEL       =    '250';                      
                          DB_STATUS_KODE       =     RF1.STATUS_KODE;           
                       END;                                                     
                 END;                                                           
              END;                                                              
            ELSE                                                                
              DO;                                                               
                 /* ******************************************* */              
                 /* UIB'S RETUR-CODE ER UAKSEPTABEL             */              
                 /* ******************************************* */              
  L260:                                                                         
                  FEIL_MELD_NR               =     500;                         
                  FEIL_VED_LABEL             =    '260';                        
              END;                                                              
         END;                                                                   
                                                                                
      RETURN (W100_TKNR);                                                       
                                                                                
                                                                                
    END F100_FINN_TKNR;                                                         
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  PF2:                                                                          
                                                                                
     MAP_MELDING              = 'TRANSAKSJONEN FORKASTET';                      
     FEILMELDING_SATT         = '1'B;                                           
     S001I01I.STYREKODEL      = -1;     /* CURSOR POS */                        
     S001I01O.CICS_INFOO      = DIV_PARAM_OMR.CICS_NAVN;                        
     S001I01O.MELDINGO        = MAP_MELDING;                                    
                                                                                
     EXEC CICS SEND MAP('S001I01')                                              
                                       MAPSET('S001I13') CURSOR ERASE;          
                                                                                
     TRANSKODE = 'R0I1';                                                        
     EXEC CICS RETURN TRANSID(TRANSKODE)                                        
                                         COMMAREA(KOM_OMR);                     
                                                                                
                                                                                
                                                                                
  ERRBEH:                                                                       
     EXEC CICS HANDLE CONDITION ERROR;                                          
     EXEC CICS PURGE MESSAGE;                                                   
     EXEC CICS ABEND ABCODE('FEIL');                                            
                                                                                
                                                                                
                                                                                
  SKRIV_FEILMELDING:                                                            
     PROC;                                                                      
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    GIR UT FEILMELDING.                                           */        
  /*                                                                  */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SKRIV_FEILMELDING;                                       */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
  IF TERMINERINGS_IND = FATAL_FEIL THEN                                         
     DO;                                                                        
        EXEC CICS PURGE MESSAGE;                                                
        FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!                
                               ' GÅR I FEIL VED LABEL NR. '        !!           
                                        DIV_PARAM_OMR.FEIL_VED_LABEL;           
        EXEC CICS SEND TEXT FROM (FEIL_MELDING) ACCUM ERASE PAGING              
                                                           JUSTIFY(10);         
                                                                                
        FEIL_STRUC.KOM_OMR_PEKER = COMMAREA_PEKER;                              
        FEIL_STRUC.FEIL_NR       = FEIL_MELD_NR;                                
        EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);                
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(14)                    
                                                         ACCUM PAGING;          
                                                                                
        IF FEIL_MELD_NR        =     500              THEN                      
           DO;                                                                  
                                                                                
              /* *************************************************** */         
              /*     DATA-BASE FEIL . RETUR_KODEN LEGGES UT .        */         
              /* *************************************************** */         
                                                                                
              FEIL_MELDING     =  '  RETUR_KODE   =  '                          
                      !! DIV_PARAM_OMR.DB_STATUS_KODE !! UIBFCTR ;              
              EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM                    
                                               PAGING   JUSTIFY (18);           
           END;                                                                 
                                                                                
        ELSE                                                                    
           IF FEIL_MELD_NR   =     499              THEN                        
              DO;                                                               
                                                                                
               /* *************************************************** */        
               /*     PERSON ER UNDER BEHANDLING AV EN ANNEN TRANS    */        
               /* *************************************************** */        
                                                                                
                                                                                
                 FNR_PIC          =  DIV_PARAM_OMR.SEARCH_FNR  ;                
                 FEIL_MELDING     =  '  FNR  =  ' !!  FNR_CHAR ;                
                 EXEC CICS SEND TEXT FROM  (FEIL_MELDING) ACCUM                 
                                                  PAGING   JUSTIFY (18);        
              END;                                                              
                                                                                
        FEIL_MELDING = 'TASKEN BLIR KANSELERT !!!!     ' !!                     
                                  'INGEN OPPDATERING ER BLITT UTFØRT. ';        
        EXEC CICS SEND TEXT FROM (FEIL_MELDING)  JUSTIFY(22)                    
                                                           ACCUM PAGING;        
        EXEC CICS SEND PAGE;                                                    
                                                                                
        /******** NB!   NB! TASKEN BLIR KANSELERT  ********/                    
                                                                                
         EXEC CICS ABEND;                                                       
                 /*  ABCODE(STOP);   */                                         
     END;                                                                       
                                                                                
  END SKRIV_FEILMELDING;                                                        
                                                                                
                                                                                
                                                                                
  /* **************************************************************** */        
  /*                                                                  */        
  /*  PROCEDURE FOR Å FLYTTE DATA FRA BLANKETTOMR TIL SEGM,           */        
  /*  SKRIVE TIL-FNR-OPPL,FJERNE FRA-FNR_OPPLY OG KALLE OMREGNING.    */        
  /*                                                                  */        
  /* **************************************************************** */        
  /*                                                                            
  */                                                                            
  SKRIV_INNT:                                                                   
   PROC(I,INNT_ALDER_TIL,INNT_ALDER_FRA);                                       
                                                                                
                                                                                
   DCL I                                  PIC '99';                             
   DCL INNT_ALDER                         PIC '99';                             
   DCL FNR                                PIC '(11)9';                          
   DCL FNR_ÅRH                            PIC '9'  DEF FNR POS(7);              
   DCL FNR_ÅR                             PIC '99' DEF FNR POS(5);              
   DCL INNT_ALDER_TIL                     CHAR(2);                              
   DCL INNT_ALDER_FRA                     CHAR(2);                              
                                                                                
   W02_PI_ÅR           = W02.TAB_PI_ÅR      (I);                                
   W02_PI_KODE         = W02.TAB_PI_KODE    (I);                                
   W02_PI              = W02.TAB_PI         (I);                                
   W02_PI_KOMMNR       = W02.TAB_PI_KOMMNR  (I);                                
   W02_PI_RAPPDATO     = W02.TAB_PI_RAPPDATO(I);                                
                                                                                
   SSA1_RF0PERSN.PKEY  = TIL_FNR;                                               
   FNR                 = TIL_FNR;                                               
                                                                                
   CALL P10_SKRIV_PINNTEKT;                                                     
                                                                                
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SKRIVER OPPLYSNINGER UT PÅ R001.OLINNTE FOR BRUK VED UTSKRIFT */        
  /*    AV KONTROLLISTE.                                              */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL SKRIV_LISTEDATA;                                         */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
                                                                                
   DCL                                                                          
      OLI_PEKER                  POINTER    ; /*Y2K        */                   
   DCL                                                                          
      OLI_REC                    CHAR(103)  ; /*Y2K 97->103*/                   
   DCL                                                                          
      01 OLI_OMR  DEF OLI_REC,                                                  
         02 KONTOR               CHAR(3)    ,                                   
         02 TERMID               CHAR(4)    ,                                   
         02 FNR                  PIC '(11)9',                                   
         02 REGTPK               CHAR(6)    ,                                   
         02 IÅR                  PIC '(4)9' , /*Y2K*/                           
         02 BLTYPE               CHAR(1)    ,                                   
         02 IART                 CHAR(1)    ,                                   
         02 KOMMNR1              PIC '(4)9' ,                                   
         02 AGIVNR               PIC '(3)9' ,                                   
         02 RAPPDATO             PIC '(8)9' , /*Y2K*/                           
         02 NAVN                 CHAR(25)   ,                                   
         02 INNTEKT              PIC '(7)9' ,                                   
         02 ETYPE                CHAR(1)    ,                                   
         02 MERKE                CHAR(1)    ,                                   
         02 DÅR                  PIC '(4)9' , /*Y2K*/                           
         02 KOMMNR2              PIC '(2)9' ,                                   
         02 KOMMNR3              CHAR(2),                                       
         02 BRUKERID             CHAR(4)    ,                                   
         02 FNR2                 PIC '(11)9',                                   
         02 INDEKS               CHAR(1)    ;                                   
   DCL                                                                          
      01 HDATO                   PIC '(8)9'; /*Y2K*/                            
   DCL                                                                          
      01 HDATO_REDEF DEF HDATO,                                                 
         02 ÅR                   PIC '(4)9', /*Y2K*/                            
         02 MND                  PIC '(2)9',                                    
         02 DAG                  PIC '(2)9';                                    
   /*                                                                           
   DCL                                                                          
      01 NYKKEL     DEF KEY,                                                    
         02 KONTOR_N             CHAR(3)    ,                                   
         02 TERMID_N             CHAR(4)    ,                                   
         02 FNR_N                PIC '(11)9',                                   
         02 REGTPK_N             CHAR(6)    ,                                   
         02 IÅR_N                PIC '(4)9' ,                                   
         02 BLTYPE_N             CHAR(1)    ,                                   
         02 IART_N               CHAR(1)    ,                                   
         02 KOMMNR1_N            PIC '(4)9' ,                                   
         02 AGIVNR_N             PIC '(3)9' ,                                   
         02 RAPPDATO_N           PIC '(8)9' ;                                   
 */                                                                             
   DCL                                                                          
      01 DATO                    PIC '(8)9';  /*Y2K*/                           
   DCL                                                                          
      01 DATO_REDEF DEF DATO,                                                   
         02 DAG                  PIC '(2)9',                                    
         02 MND                  PIC '(2)9',                                    
         02 ÅR                   PIC '(4)9';  /*Y2K*/                           
                                                                                
   DCL                                                                          
      01 W02_BLTYPE              CHAR(1),                                       
      01 W02_ART                 CHAR(1);                                       
                                                                                
                                                                                
   DCL FNR13                     PIC '(13)9'  ;                                 
                                                                                
   DCL                                                                          
      1 FNRH DEF FNR13,                                                         
         2 DG             PIC                 '99',                             
         2 MN             PIC                 '99',                             
         2 ÅR             PIC                 '9999',                           
         2 PERSNR,                                                              
            3 ÅRHUNDRE    PIC                '999',                             
            3 REST        PIC                 '99';                             
                                                                                
   DCL 1  TID,                                                                  
          2  TID1                          CHAR (6), /* TT,MM,.SEK    */        
          2  TID2                          CHAR (3); /* MILL.SEK.     */        
  DCL TID_D          DEFINED   TID         CHAR (9);                            
                                                                                
                                                                                
                                                                                
     SELECT(W02_PI_TYPE);                                                       
                                                                                
        WHEN('B','C','D')                                                       
                                                                                
           DO;                                                                  
              W02_BLTYPE = 'B';                                                 
                                                                                
              IF W02_PI_TYPE = 'B' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'C' THEN                                      
                    W02_ART    = '2';                                           
                 ELSE                                                           
                    IF W02_PI_TYPE = 'D' THEN                                   
                       W02_ART    = '3';                                        
           END;                                                                 
                                                                                
        WHEN('E','F')                                                           
                                                                                
           DO;                                                                  
              W02_BLTYPE = 'C';                                                 
                                                                                
              IF W02_PI_TYPE = 'E' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'F' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        WHEN('H','I')                                                           
                                                                                
           DO;                                                                  
              W02_BLTYPE = 'D';                                                 
                                                                                
              IF W02_PI_TYPE = 'H' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'I' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        WHEN('S','T')                                                           
                                                                                
           DO;                                                                  
              W02_BLTYPE = 'S';                                                 
                                                                                
              IF W02_PI_TYPE = 'S' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'T' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        WHEN('V','W')                                                           
                                                                                
           DO;                                                                  
              W02_BLTYPE = 'U';                                                 
                                                                                
              IF W02_PI_TYPE = 'V' THEN                                         
                 W02_ART    = '1';                                              
              ELSE                                                              
                 IF W02_PI_TYPE = 'W' THEN                                      
                    W02_ART    = '2';                                           
           END;                                                                 
                                                                                
        OTHERWISE                                                               
           ;                                                                    
     END;                                                                       
                                                                                
      HDATO             = DATO_2000              ;  /*Y2K*/                     
      TID_D             = TIME  ;                                               
                                                                                
      DATO_REDEF.ÅR     = HDATO_REDEF.ÅR ;                                      
      DATO_REDEF.MND    = HDATO_REDEF.MND;                                      
      DATO_REDEF.DAG    = HDATO_REDEF.DAG;                                      
                                                                                
      OLI_REC           = ''               ;                                    
      OLI_OMR.KONTOR    = 'OVR'            ;                                    
      OLI_OMR.TERMID    = DIV_PARAM_OMR.TERMINAL_NR ;                           
      OLI_OMR.FNR       = TIL_FNR          ;                                    
      OLI_OMR.REGTPK    = TID1             ;                                    
      OLI_OMR.IÅR       = W02_PI_ÅR        ;                                    
      OLI_OMR.BLTYPE    = W02_BLTYPE       ;                                    
      OLI_OMR.IART      = W02_ART          ;                                    
      OLI_OMR.KOMMNR1   = W02_PI_KOMMNR    ;                                    
      OLI_OMR.RAPPDATO  = DATO             ;                                    
      OLI_OMR.NAVN      = 'OVERF. FRA ' !! FRA_FNR;                             
      OLI_OMR.INNTEKT   = W02_PI           ;   /*200504*/                       
      OLI_OMR.MERKE     = W02_PI_MERKE     ;                                    
      OLI_OMR.AGIVNR    = 0                ;                                    
      OLI_OMR.BRUKERID  = STYRINGS_OMR.BRUKERID;                                
      OLI_OMR.FNR2      = FRA_FNR          ;                                    
      OLI_OMR.INDEKS    = '3'              ;                                    
      IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2) = 'G' THEN                            
      OLI_OMR.KOMMNR3   = DIV_PARAM_OMR.CICS_IND ;                              
                                                                                
 /*                                                                             
      NYKKEL.KONTOR_N   = 'OVR'            ;                                    
      NYKKEL.TERMID_N   = DIV_PARAM_OMR.TERMINAL_NR ;                           
      NYKKEL.FNR_N      = TIL_FNR          ;                                    
      NYKKEL.REGTPK_N   = TID1             ;                                    
      NYKKEL.IÅR_N      = W02_PI_ÅR        ;                                    
      NYKKEL.IART_N     = W02_ART          ;                                    
      NYKKEL.BLTYPE_N   = W02_BLTYPE       ;                                    
      NYKKEL.KOMMNR1_N  = W02_PI_KOMMNR    ;                                    
      NYKKEL.AGIVNR_N   = 0                ;                                    
      NYKKEL.RAPPDATO_N = DATO             ;                                    
      KEY_PEKER         = ADDR(KEY)        ;                                    
      KEY_RECL          = LISTE_RECL       ;                                    
                                                                                
 */                                                                             
                                                                                
      EXEC CICS HANDLE CONDITION ERROR    (L125)             ;                  
      EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK)           ;                  
      EXEC CICS WRITE  DATASET ('OLINNTE') RIDFLD  (OLI_PEKER)                  
                                   FROM    (OLI_REC) RBA;                       
      GOTO ALT_OK;                                                              
                                                                                
    L125:                                                                       
      FEIL_MELD_NR                =    505 ;                                    
      FEIL_VED_LABEL              =   '125';                                    
      FATAL_FEIL                  =   '1'B ;                                    
                                                                                
    ALT_OK:                                                                     
                                                                                
      FNR13    = KONV_FNR11_FNR13(TIL_FNR);                                     
                                                                                
      INNT_ALDER      = W02_PI_ÅR - SUBSTR(FNR13,5,4);                          
                                                                                
      IF INNT_ALDER = 66 THEN                                                   
         INNT_ALDER_TIL  = '66';                                                
      ELSE                                                                      
         IF INNT_ALDER = 69 THEN                                                
            INNT_ALDER_TIL  = '69';                                             
                                                                                
      IF FEIL_MELD_NR = 0 THEN                                                  
         DO;                                                                    
            SSA1_RF0PERSN.PKEY  = FRA_FNR;                                      
            FNR                 = FRA_FNR;                                      
                                                                                
            FNR13    = KONV_FNR11_FNR13(FRA_FNR);                               
            CALL P20_FJERN_PINNTEKT;                                            
                                                                                
                  OLI_OMR.FNR       = FRA_FNR          ;                        
                  OLI_OMR.FNR2      = 0                ;                        
                                                                                
                  OLI_OMR.NAVN      = 'FJERNING VED OVERFØRING';                
                  OLI_OMR.MERKE     = ' '                      ;                
                  OLI_OMR.INDEKS    = '4'              ;                        
                  IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2) = 'G' THEN                
                    OLI_OMR.KOMMNR3   = DIV_PARAM_OMR.CICS_IND ;                
                                                                                
                                                                                
                  EXEC CICS HANDLE CONDITION ERROR    (L270);                   
                  EXEC CICS HANDLE CONDITION DUPREC   (ALT_OK2);                
                  EXEC CICS WRITE DATASET ('OLINNTE') RIDFLD (OLI_PEKER)        
                                           FROM (OLI_REC) RBA;                  
                  GOTO ALT_OK2;                                                 
                                                                                
  L270:                                                                         
                  FEIL_MELD_NR                =    505 ;                        
                  FEIL_VED_LABEL              =   '270';                        
                  FATAL_FEIL                  =   '1'B ;                        
                                                                                
  ALT_OK2:                                                                      
                                                                                
                  INNT_ALDER       = W02_PI_ÅR - SUBSTR(FNR13,5,4);             
                                                                                
                  IF INNT_ALDER       =  66                      THEN           
                     INNT_ALDER_FRA   = '66';                                   
                  ELSE                                                          
                     IF INNT_ALDER            =  69 THEN                        
                        INNT_ALDER_FRA        = '69';                           
                                                                                
          /* END; */                                                            
      END;                                                                      
                                                                                
                                                                                
  END SKRIV_INNT;                                                               
                                                                                
  %INCLUDE R0018032;             /*  OPPDATE_DR_INNTEKT        */               
  %INCLUDE R0018033;             /*  OPPDATE_DR_FNR            */               
  %INCLUDE R0019905;             /*  )_ALDER                      */            
  %INCLUDE R0019912;             /*  NUM-> CHAR                   */            
  %INCLUDE R0019920;             /*  OPEN-> LUKKE DB              */            
  %INCLUDE R0019995;             /*  KONV_FNR11_FNR13             */            
  %INCLUDE R0019986;             /*  KONV_HÅ_Å                    */            
  %INCLUDE R0019999;             /*  ATK-KON                      */            
                                                                                
                                                                                
 END R001I20;                                                                   
