 /*   SIST ENDRET PÅ PROD   2006.09.05  8.42.18 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.08.24  9.53.21 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 13.58.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.08.11  8.23.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.10.16 12.58.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.16 12.55.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.02.07 12.57.38 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.03.23 11.37.58 AV   JDA7339          */        
 /*       SIST ENDRET 04/09-98 11.51.23 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 14.40.27 AV   JDA7339                  */        
 /*                                                                   */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014151 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER PER F. BERGESTAD, JUNI 1982                       */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN NULLSTILLER ARBEIDSTABELLEN OG LEGGER INN VEIET        */        
 /*    GRUNNBELØP FOR DE ENKELTE ÅR                                   */        
 /* PROGRAMTILKNYTTNING:                                              */        
 /*    PROGRAMMET BLIR INCLUDET I / CALL FRA                          */        
 /*       4101 / 4135                                                 */        
 /*       4141 / 4141                                                 */        
 /*       4201 / 4135                                                 */        
 /*       4251 / 4135                                                 */        
 /*       7001 / 4135                                                 */        
 /* ***************************************************************** */        
 KLARGJØR_TAB:PROC;                                                             
    DCL I   FIXED BIN (15);                                                     
                                                                                
       DO I = 1963 TO 2060;      /*HL*/                                         
          TAB.UFØR_START_MND(I)        = 0;                                     
          TAB.UFØR_GRAD(I)             = 0;                                     
          TAB.UFØR_KRIT(I)             = 0;                                     
          TAB.UFØR_PERIODE(I)          = ' ';                                   
          TAB.UFØR_SLUTT_MND(I)        = 0;                                     
          TAB.UFØR_SLUTT_KODE(I)       = ' ';                                   
          TAB.POENGGARANTI(I)          = 0;                                     
          TAB.POENGGARANTI_KODE(I)     = ' ';                                   
          TAB.YRKE_GRAD(I)             = 0;                                     
          TAB.PAÅ(I)                   = 0;                                     
          TAB.BUP_FPP(I)               = 0;                                     
          TAB.NY_3_19                  = ' ';                                   
          TAB.OMSORG_KODE (I)          = ' ';                                   
          TAB.NULL_KODE   (I)          = ' ';   /*TS/HL161003*/                 
          TAB.VERNEPL_POENG(I)         = 0;                                     
          TAB.VERNEPL_POENG_LOV92(I)   = 0;                                     
          TAB.GV(I)                    = 0;                                     
          TAB.INNTEKT(I)               = 0;                                     
          TAB.INNT_POENG(I)            = 0;                                     
          TAB.INNT_POENG_LOV92(I)      = 0;                                     
          TAB.POENG_ANVENDT(I)         = 0;                                     
          TAB.POENG_ANVENDT_LOV92(I)   = 0;                                     
          TAB.POENG_KODE(I)            = ' ';                                   
          TAB.POENG_ALTERNATIV(I)      = 0;                                     
          TAB.POENG_ALTERNATIV_KODE(I) = ' ';                                   
          TAB.SISTE_BUP_ÅR(I)          = ' ';                                   
       END;                                                                     
                                                                                
       DO I = 1963 TO 2010;     /*2000*/                                        
              TAB.GV(I)     = GV_TAB_ARRAY.G_V(I);                              
       END;                                                                     
   END KLARGJØR_TAB;                                                            
