 /*       SIST ENDRET 16/01-98 13.10.56 AV   SPA7339                  */00000000
 %PAGE;                                                                 00000010
 /* ************************************************************ */     00000020
 /*                                                              */     00000030
 /*  PROCDURE FOR Å SORTERE TRANS_LISTE MED SEKVENS PÅ           */     00000040
 /*                                                              */     00000050
 /*           VIRKNINGSDATO OG TRANSKODE-PRIORITET               */     00000060
 /*                                                              */     00000070
 /*                                                              */     00000080
 /*      START_POS ANGIR DEN FØRSTE  POSISJON I TRANS_LISTE      */     00000090
 /*      SOM SKAL SORTERES . DE EVENTUELLE TRANSER SOM LIGGER    */     00000100
 /*      FØR ER BEHANDLET TIDLIGERE .                            */     00000110
 /*                                                              */     00000120
 /* ************************************************************ */     00000130
                                                                        00000140
 P_SORTER_TRANS_LISTE_OMR:                                              00000150
   PROC   ( START_POS )  ;                                              00000160
                                                                        00000170
   DCL    ( I,J,K,START_POS,PRIOR_KODE,                                 00000180
            WORK_TRANS_LISTE_PRIOR_KODE,                                00000190
            TRANS_LISTE_LINJE_PRIOR_KODE)          FIXED BIN (15);      00000200
                                                                        00000210
                                                                        00000220
   DO  I   =  START_POS  TO  4                                          00000230
       WHILE (TRANS_LISTE_LINJE.VIRKNINGSDATO_ÅMD(I) > 0);              00000240
                                                                        00000250
       WORK_TRANS_LISTE   =  TRANS_LISTE_LINJE (I);                     00000260
                                                                        00000270
       DO J = I + 1 TO 5                                                00000280
                    WHILE (TRANS_LISTE_LINJE.VIRKNINGSDATO_ÅMD(J) > 0); 00000290
                                                                        00000300
          CALL P010_SETT_PRIOR_KODE (WORK_TRANS_LISTE.BLANKETTYPE)     ;00000310
          WORK_TRANS_LISTE_PRIOR_KODE   =  PRIOR_KODE                  ;00000320
                                                                        00000330
          CALL P010_SETT_PRIOR_KODE (TRANS_LISTE_LINJE.BLANKETTYPE (J));00000340
          TRANS_LISTE_LINJE_PRIOR_KODE  =  PRIOR_KODE                  ;00000350
                                                                        00000360
          IF ( WORK_TRANS_LISTE.VIRKNINGSDATO_ÅMD    >                  00000370
              TRANS_LISTE_LINJE.VIRKNINGSDATO_ÅMD (J) ) !               00000380
                                                                        00000390
             (  WORK_TRANS_LISTE.VIRKNINGSDATO_ÅMD =                    00000400
                TRANS_LISTE_LINJE.VIRKNINGSDATO_ÅMD (J) &               00000410
               WORK_TRANS_LISTE_PRIOR_KODE                         >    00000420
               TRANS_LISTE_LINJE_PRIOR_KODE                      )  THEN00000430
             DO;                                                        00000440
                WORK_TRANS_LISTE = TRANS_LISTE_LINJE      (J);          00000450
                K = J;                                                  00000460
             END;                                                       00000470
                                                                        00000480
       END;  /***   DO J = I + 1 TO 5   ***/                            00000490
                                                                        00000500
       CALL P010_SETT_PRIOR_KODE (WORK_TRANS_LISTE.BLANKETTYPE)     ;   00000510
       WORK_TRANS_LISTE_PRIOR_KODE   =  PRIOR_KODE                  ;   00000520
                                                                        00000530
       CALL P010_SETT_PRIOR_KODE (TRANS_LISTE_LINJE.BLANKETTYPE (I));   00000540
       TRANS_LISTE_LINJE_PRIOR_KODE  =  PRIOR_KODE                  ;   00000550
                                                                        00000560
       IF (   WORK_TRANS_LISTE.VIRKNINGSDATO_ÅMD    <                   00000570
              TRANS_LISTE_LINJE.VIRKNINGSDATO_ÅMD (I) ) !               00000580
                                                                        00000590
          (   WORK_TRANS_LISTE.VIRKNINGSDATO_ÅMD     =                  00000600
              TRANS_LISTE_LINJE.VIRKNINGSDATO_ÅMD (I)     &             00000610
              WORK_TRANS_LISTE_PRIOR_KODE            <                  00000620
              TRANS_LISTE_LINJE_PRIOR_KODE         )         THEN       00000630
          DO;                                                           00000640
             TRANS_LISTE_LINJE (K)  =  TRANS_LISTE_LINJE (I);           00000650
             TRANS_LISTE_LINJE (I)  =  WORK_TRANS_LISTE     ;           00000660
          END;                                                          00000670
                                                                        00000680
    END;  /***   DO I = 1 TO 4   ***/                                   00000690
                                                                        00000700
                                                                        00000710
                                                                        00000720
    /* ************************************************************ */  00000730
    /* HER SETTES PRIORITETS-KODEN.                                 */  00000740
    /* ************************************************************ */  00000750
                                                                        00000760
    P010_SETT_PRIOR_KODE:                                               00000770
      PROC   ( BL_TYPE ) ;                                              00000780
                                                                        00000790
      DCL      BL_TYPE                 CHAR  (2)  ;                     00000800
                                                                        00000810
                                                                        00000820
      SELECT ( BL_TYPE ) ;                                              00000830
                                                                        00000840
        WHEN ('O1' , 'O2')                                              00000850
             PRIOR_KODE     =   1             ;                         00000860
                                                                        00000870
        WHEN ('E1' , 'EN')                                              00000880
             PRIOR_KODE     =   2             ;                         00000890
                                                                        00000900
        OTHERWISE                                                       00000910
             PRIOR_KODE     =   3             ;                         00000920
      END;                                                              00000930
                                                                        00000940
    END P010_SETT_PRIOR_KODE;                                           00000950
                                                                        00000960
                                                                        00000970
 END P_SORTER_TRANS_LISTE_OMR;                                          00000980
                                                                        00000990
                                                                        00001000
