 /*       SIST ENDRET 04/05-98 14.15.28 AV   JDA7339                  */00000000
 /*       SIST ENDRET 24/01-98 10.06.47 AV   SPA7339                  */00000010
                                                                        00000020
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000030
                                                                        00000040
          %INCLUDE P0019906;                                            00000050
          %INCLUDE P0019908;                                            00000060
          %INCLUDE P0019910;                                            00000070
          %INCLUDE P0019912;                                            00000080
          %INCLUDE P0019913;                                            00000090
                                                                        00000100
 DCL                                                                    00000110
      (CSTG, ADDR)                   BUILTIN;                           00000120
 DCL  COMMAREA_PEKER         PTR,                                       00000130
      LOKAL_KOM_PTR          PTR;                                       00000140
                                                                        00000150
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000160
 DCL                                                                    00000170
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000180
    DFHBMUNP             CHAR(1) INIT(' '),                             00000190
    DFHBMBRY             CHAR(1) INIT('H'),                             00000200
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000210
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000220
    MELDING6O            CHAR(10),                                      00000230
    YMELDING6O           CHAR(10);                                      00000240
                                                                        00000250
          %INCLUDE S001F1  ;                                            00000260
          %INCLUDE P0011831;                                            00000270
                                                                        00000280
                                                                        00000290
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000300
                                                                        00000310
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000320
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000330
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000340
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000350
                                                                        00000360
                                                                        00000370
                                                                        00000380
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000390
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000400
                                                                        00000410
                                                                        00000420
           CALL OVERFØR_SØKER_TIL_MAP;               /* R0011836 */     00000430
           S001831O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000440
      /*                                                                00000450
           FREE TRANS_OMR,TRANS_OPPL_OMR;                               00000460
      */                                                                00000470
                                                                        00000480
      EXEC CICS RETURN;                                                 00000490
                                                                        00000500
                                                                        00000510
                                                                        00000520
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000530
      PROC(FIXED_DEC_5);                                                00000540
                                                                        00000550
      DCL                                                               00000560
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00000570
                                                                        00000580
   END SKRIV_FEIL;                                                      00000590
                                                                        00000600
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00000610
                                                                        00000620
           DCL                                                          00000630
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00000640
                                                                        00000650
   END SKRIV_FEIL_YP;                                                   00000660
                                                                        00000670
   SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00000680
                                                                        00000690
           DCL                                                          00000700
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00000710
                                                                        00000720
   END SKRIV_FEIL_SP;                                                   00000730
                                                                        00000740
   %INCLUDE  R0019912;                                                  00000750
   %INCLUDE  R0011836;                                                  00000760
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00000770
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00000780
   %INCLUDE  R0019990;                        /*  KONV_HÅMD_DMÅ       */00000790
                                                                        00000800
 END R001041;                                                           00000810
