 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.55 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.48 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.56.44 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.40.34 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO15  UNDERPROGRAM SOM BRUKES AV R001NO10.   */        
 /*                            KONTROLL FT-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : OKTOBER 1986                              */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NO15                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R0011202   BLANK FT TRANSOMR                                   */        
 /*    R0011203   KONTR FT SØKER                                      */        
 /*    R0011204   KONTR FT BARN                                       */        
 /*    FUNKSJONER SOM BRUKES ER INKLUDERT I HOVEDPROGRAMMET.          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR FT OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P112_BEHANDLE_FT: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P0011201;                               /* TRANSOMR FT */             
                                                                                
                                                                                
          CALL BLANK_FT_SØKER;                        /* R0011202 */            
          CALL BLANK_FT_MELDNR;                       /* R0011202 */            
          CALL BLANK_FT_BARN;                         /* R0011202 */            
          CALL OVERFØR_FT_BLANKETT;                                             
          CALL KONTROLL_FT_SØKER(FEIL_FUNNET);        /* R0011203 */            
                                                                                
          IF ^FEIL_FUNNET                         &                             
             F_FELT_PIC_CHAR2(FTS.BT_ANT) ^= '00' THEN                          
             DO;                                                                
                CALL OVERF_FT_BARN;                                             
                CALL KONTROLL_FT_BARN(FEIL_FUNNET);   /* R0011204 */            
             END;                                                               
                                                                                
          IF FTS.BOSATT_UTL = 'J' THEN                                          
             DO;                                                                
                FEIL_I_BOSATT = '1'B;                                           
                FEIL_FUNNET = '1'B;                                             
             END;                                                               
                                                                                
          IF FEIL_FUNNET     THEN                                               
             CALL FINN_FEIL_FT;                                                 
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA OVERFØRINGSRECORD TIL         */        
 /*   FT_TRANS_OMR I KOM_OMR FOR FT_SøKER.                            */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERFØR_FT_BLANKETT:                                                           
   PROC;                                                                        
                                                                                
     DCL HJELPEDATO    PIC '(8)9';                                              
                                                                                
                                                                                
          FTS.REGDATO_ÅMD  = BLANKETT_RECORD.TRANS_DATO_ÅMD;                    
          FTS.TERMID       = DIV_PARAM_OMR.TERMINAL_NR;                         
          FTS.FNR          = BLANKETT_RECORD.FNR;                               
          FTS.TKNR         = BLANKETT_RECORD.TKNR;                              
          FTS.TILL_EK      = FT_BLANKETT.TILL_EK;                               
                                                                                
          IF F_FELT_PIC_CHAR2(FT_BLANKETT.BT_ANT) ^= '  '   THEN                
             FTS.BT_ANT    = FT_BLANKETT.BT_ANT;                                
                                                                                
          HJELPEDATO        = FT_BLANKETT.VIRK_DATO_ÅMD / 100;                  
          FTS.VIRK_DATO_ÅMD = HJELPEDATO * 100;                                 
                                                                                
          IF F_FELT_PIC_CHAR11(FT_BLANKETT.FNR_EK) ^= (11)' '  THEN             
             FTS.FNR_EK    = FT_BLANKETT.FNR_EK;                                
                                                                                
          FTS.EK_INNT      = FT_BLANKETT.EK_INNT;                               
                                                                                
                                                                                
    END OVERFØR_FT_BLANKETT;                                                    
                                                                                
 /* ***************************************************************** */        
 /*                                                                   */        
 /* PROSEDYREN OVERFØRER OPPL. OM BARN FRA SKJERMBILDET TIL           */        
 /*    FT_TRANS_OMR I KOM_OMR.                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 OVERF_FT_BARN:                                                                 
   PROC;                                                                        
                                                                                
                                                                                
          DO I = 1 TO 8 WHILE(F_FELT_PIC_CHAR11                                 
                              (FT_BLANKETT.FNR_BARN(I)) ^= (11)' ');            
                                                                                
             FTB.FNR_BARN(I) = FT_BLANKETT.FNR_BARN(I);                         
             FTB.RBT_BARN(I) = FT_BLANKETT.RBT_BARN(I);                         
                                                                                
          END;                                                                  
                                                                                
                                                                                
    END OVERF_FT_BARN;                                                          
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*  PROSEDYRE SOM FINNER OG TAR VARE PÅ FEILMELDINGSNUMRENE NÅR DET  */        
 /*  ER FEIL I DEN OVERFØRTE RECORDEN.                                */        
 /* ***************************************************************** */        
 FINN_FEIL_FT:PROC;                                                             
                                                                                
                                                                                
    DCL ANT_BARN              FIXED BIN (15);                                   
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF FTS.FNRNR ^= 0   &                                                 
             FTS.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF FTS.TKNRNR ^= 0   &                                                
             FTS.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.TKNRNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF FTS.TILL_EKNR ^= 0   &                                             
             FTS.TILL_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.TILL_EKNR;                          
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.BT_ANTNR ^= 0   &                                              
             FTS.BT_ANTNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.BT_ANTNR;                           
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.VIRK_DATO_ÅMDNR ^= 0  &                                        
             FTS.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.FNR_EKNR ^= 0   &                                              
             FTS.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.FNR_EKNR;                           
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.BOSATT_UTLNR ^= 0   &                                          
             FTS.BOSATT_UTLNR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.BOSATT_UTLNR;                       
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.TT_F67_EKNR ^= 0   &                                           
             FTS.TT_F67_EKNR ^= 999 THEN                                        
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.TT_F67_EKNR;                        
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.TT_E66_Å_EKNR ^= 0   &                                         
             FTS.TT_E66_Å_EKNR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.TT_E66_Å_EKNR;                      
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.TT_E66_M_EKNR ^= 0   &                                         
             FTS.TT_E66_M_EKNR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.TT_E66_M_EKNR;                      
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
          IF FTS.EK_INNTNR ^= 0   &                                             
             FTS.EK_INNTNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = FTS.EK_INNTNR;                          
                IF FEIL_IND ^= 3  THEN                                          
                   FEIL_IND = FEIL_IND + 1;                                     
             END;                                                               
                                                                                
                                                                                
          DO ANT_BARN = 1 TO 8;                                                 
                                                                                
             IF FTB.FNR_BARNNR(ANT_BARN) ^= 0  &                                
                FTB.FNR_BARNNR(ANT_BARN) ^= 999 THEN                            
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = FTB.FNR_BARNNR(ANT_BARN);            
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND = FEIL_IND + 1;                                  
                END;                                                            
                                                                                
             IF FTB.RBT_BARNNR(ANT_BARN) ^= 0  &                                
                FTB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                            
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = FTB.RBT_BARNNR(ANT_BARN);            
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND = FEIL_IND + 1;                                  
                END;                                                            
                                                                                
          END;                                                                  
                                                                                
                                                                                
    END FINN_FEIL_FT;                                                           
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 %PAGE;                                                                         
 %INCLUDE R0011202;          /*     BLANK FT TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R0011203;          /*     KONTR FT SØKER      */                      
 %PAGE;                                                                         
 %INCLUDE R0011204;          /*     KONTR FT BARN       */                      
                                                                                
                                                                                
 END P112_BEHANDLE_FT;                                                          
                                                                                
                                                                                
