 /*       SIST ENDRET 04/05-98 14.14.26 AV   JDA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R00104FO  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000040
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000050
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000060
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000120
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000130
 /*    FORHÅND.                                                       */00000140
 /*    MAPS HØRER INN UNDER MAPSET 'S001F3'.                         */ 00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*PROGRAMTILKNYTTING:                                                */00000180
 /* ********************                                              */00000190
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000200
 /*                                                                   */00000210
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000220
 /*    BRUK :                                                         */00000230
 /*    EXEC CICS XCTL PROGRAM ('R00104FO') COMMAREA(KOM_OMR);         */00000240
 /*    PROGRAMMET INCLUDER :                                          */00000250
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    FO       */00000260
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       FO       */00000270
 /* ***************************************************************** */00000280
 /*DATASETTOPPLYSNINGER:                                              */00000290
 /* ***********************                                           */00000300
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*FEILMELDINGER:                                                     */00000340
 /* *******************                                               */00000350
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000390
                                                                        00000400
          %INCLUDE P0019906;                                            00000410
          %INCLUDE P0019908;                                            00000420
          %INCLUDE P0019910;                                            00000430
          %INCLUDE P0019912;                                            00000440
          %INCLUDE P0019913;                                            00000450
                                                                        00000460
 DCL                                                                    00000470
    CSTG                   BUILTIN,                                     00000480
    COMMAREA_PEKER         PTR,                                         00000490
    LOKAL_KOM_PTR          PTR,                                         00000500
    SIDE_TELL              FIXED BIN(15) INIT (1),                      00000510
    I                      FIXED BIN(15),                               00000520
    START                  FIXED BIN(15) INIT(1),                       00000530
    LENGTH                 FIXED BIN(15),                               00000540
    LABEL_Y                LABEL,                                       00000550
    LOW_CHAR_BASED         CHAR(1200) BASED(BMSMAPBR),                  00000560
    ADDR                   BUILTIN;                                     00000570
                                                                        00000580
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000590
 DCL                                                                    00000600
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000610
    DFHBMUNP             CHAR(1) INIT(' '),                             00000620
    DFHBMBRY             CHAR(1) INIT('H'),                             00000630
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000640
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000650
    MELDING6O            CHAR(10),                                      00000660
    YMELDING6O           CHAR(10);                                      00000670
                                                                        00000680
          %INCLUDE S001F3  ;                                            00000690
          %INCLUDE P001UC01;                                            00000700
                                                                        00000710
                                                                        00000720
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000730
                                                                        00000740
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000750
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000760
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000770
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000780
                                                                        00000790
                                                                        00000800
                                                                        00000810
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000820
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000830
                                                                        00000840
           CALL OVERFØR_FO_SØKER_MAP;               /* R001UC06 */      00000850
           CALL TEKST_SØKER2;                       /* R001UC07 */      00000860
           CALL OVERFØR_FO_SØKER2_MAP;               /* R001UC06 */     00000870
           S001UC1O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000880
           IF TRANS_OMR.FOS.BT_ANT > 0 THEN                             00000890
              DO;                                                       00000900
                 CALL TEKST_BARN;                   /* R0011207 */      00000910
                 CALL OVERFØR_FO_BARN_MAP;    /* R0011206 */            00000920
              END;                                                      00000930
                                                                        00000940
           /* FREE TRANS_OMR,TRANS_OPPL_OMR; */                         00000950
                                                                        00000960
                                                                        00000970
                                                                        00000980
      EXEC CICS RETURN;                                                 00000990
                                                                        00001000
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001010
      PROC(FIXED_DEC_5);                                                00001020
                                                                        00001030
      DCL                                                               00001040
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001050
                                                                        00001060
   END SKRIV_FEIL;                                                      00001070
                                                                        00001080
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00001090
                                                                        00001100
           DCL                                                          00001110
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001120
                                                                        00001130
        END SKRIV_FEIL_YP;                                              00001140
                                                                        00001150
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001160
                                                                        00001170
           DCL                                                          00001180
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001190
                                                                        00001200
   END SKRIV_FEIL_SP;                                                   00001210
                                                                        00001220
   %INCLUDE R0019912;                                                   00001230
   %INCLUDE R001UC06;                                                   00001240
   %INCLUDE R001UC07;                                                   00001250
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00001260
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00001270
   %INCLUDE  R0019990;                        /*  KONV_HÅMD_MÅ        */00001280
                                                                        00001290
 END R001041;                                                           00001300
