 /*       SIST ENDRET 04/05-98 12.59.09 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/02-98 09.57.20 AV   RFA9991                  */00000010
 /* ******************************************************************/ 00000020
 /* IDENTIFIKASJON                                                    */00000030
 /*     R0014181 -F_ET_UTLAND                                         */00000040
 /*     PROGRAMMERER: TRUDE SPONBERG JANUAR 1990                      */00000050
 /* HENSIKT                                                           */00000060
 /*     BEREGNE EKTEFELLETILLEGG - PENSJONISTEN BOSATT I UTLANDET     */00000070
 /* PROGRAMTILKNYTNING                                                */00000080
 /*     PROSEDYREN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.             */00000090
 /*                                                                   */00000100
 /*                                                                   */00000110
 /*                                                                   */00000120
 /* ENDRET DATO:             AV:                                      */00000130
 /* ENDRINGEN GJELDER :                                               */00000140
 /*                                                                   */00000150
 /* ***************************************************************** */00000160
                                                                        00000170
  F_ET_UTLAND:                                                          00000180
    PROC(TT_F67_EG,TT_F67_EK,TT_E66_EG,TT_E66_EK)                       00000190
                            RETURNS(FIXED DEC(5));                      00000200
   DCL                                                                  00000210
       TT_F67_EG            FIXED DEC (3) ,                             00000220
       TT_F67_EK            FIXED DEC (3) ,                             00000230
       TT_E66_EG            FIXED DEC (3) ,                             00000240
       TT_E66_EK            FIXED DEC (3) ;                             00000250
                                                                        00000260
   DCL                                                                  00000270
       TT_ANV_EG            FIXED DEC (3) INIT(0),                      00000280
       TT_ANV_EK            FIXED DEC (3) INIT(0),                      00000290
       TT_MINST             FIXED DEC (3) INIT(0);                      00000300
                                                                        00000310
  DCL W_ET                  FIXED DEC (5) INIT(0);                      00000320
  DCL W_ET1                 FIXED DEC (9,2) INIT(0);                    00000330
  DCL W_FNR_EK                 PIC'(11)9';                              00000340
                                                                        00000350
                                                                        00000360
   DCL TT_ETTER_1966_ÅR_EG   PIC'99' INIT (0);                          00000370
   DCL TT_ETTER_1966_ÅR_EK   PIC'99' INIT (0);                          00000380
                                                                        00000390
   DCL W_TT_ETTER_1966_ÅR_EG   FIXED DEC (5,3) INIT (0);                00000400
   DCL W_TT_ETTER_1966_ÅR_EK   FIXED DEC (5,3) INIT (0);                00000410
                                                                        00000420
                                                                        00000430
  W_TT_ETTER_1966_ÅR_EG   = (TT_E66_EG + 11) / 12;                      00000440
  W_TT_ETTER_1966_ÅR_EK   = (TT_E66_EK + 11) / 12;                      00000450
                                                                        00000460
  TT_ETTER_1966_ÅR_EG   = W_TT_ETTER_1966_ÅR_EG;                        00000470
  TT_ETTER_1966_ÅR_EK   = W_TT_ETTER_1966_ÅR_EK;                        00000480
                                                                        00000490
  IF  TT_ETTER_1966_ÅR_EG > 40 THEN                                     00000500
      TT_ETTER_1966_ÅR_EG = 40;                                         00000510
                                                                        00000520
  IF  TT_ETTER_1966_ÅR_EK > 40 THEN                                     00000530
      TT_ETTER_1966_ÅR_EK = 40;                                         00000540
                                                                        00000550
  TT_ANV_EG  = TT_ETTER_1966_ÅR_EG + TT_F67_EG;                         00000560
  TT_ANV_EK  = TT_ETTER_1966_ÅR_EK + TT_F67_EK;                         00000570
                                                                        00000580
  IF TT_ANV_EG  > 40  THEN                                              00000590
     TT_ANV_EG  = 40;                                                   00000600
                                                                        00000610
  IF TT_ANV_EK  > 40  THEN                                              00000620
     TT_ANV_EK  = 40;                                                   00000630
                                                                        00000640
   IF B02.BOSATT(BER_SØ_IND)  > 0  &                                    00000650
      TT_ANV_EG               >= 3 THEN                                 00000660
       DO;                                                              00000670
          IF B02.TT_FØR_1967(BER_SØ_IND) = 0  THEN /*LIK MED BOSATT */  00000680
               DO;                                                      00000690
                  W_ET1 = (B02.ALDERSP.GP(BER_SØ_IND) * 0.5);           00000700
                  W_ET =  W_ET1 + 0.5;                                  00000710
               END;                                                     00000720
                                                                        00000730
          IF TT_E66_EG  = 0 THEN                                        00000740
            DO;                                                         00000750
               IF  TT_F67_EG > TT_F67_EK    THEN                        00000760
                   TT_MINST      =  TT_F67_EK;                          00000770
               ELSE                                                     00000780
                   TT_MINST      =  TT_F67_EK;                          00000790
               W_ET1 = (0.5 * G * TT_MINST);                            00000800
               W_ET1 = W_ET1 / ( 40 * 12)  ;                            00000810
               W_ET =  W_ET1 + 0.5;                                     00000820
          END;                                                          00000830
                                                                        00000840
          IF TT_F67_EG  >  0 &                                          00000850
             TT_E66_EG  >  0    THEN                                    00000860
            DO;                                                         00000870
               IF TT_ANV_EK < TT_ETTER_1966_ÅR_EG  THEN                 00000880
                DO;                                                     00000890
                  W_ET1 = (0.5 * G );                                   00000900
                  W_ET1 = W_ET1 * TT_ETTER_1966_ÅR_EG;                  00000910
                  W_ET1 = W_ET1 / (40 * 12);                            00000920
                  W_ET =  W_ET1 + 0.5;                                  00000930
                END;                                                    00000940
               ELSE                                                     00000950
                DO;                                                     00000960
                  W_ET1 = 0.5 * G ;                                     00000970
                  W_ET1 = W_ET1 * TT_ANV_EK;                            00000980
                  W_ET1 = W_ET1 / (40 * 12);                            00000990
                  W_ET =  W_ET1 + 0.5;                                  00001000
                END;                                                    00001010
            END;                                                        00001020
                                                                        00001030
          IF B02.FRAVIK_19_3(BER_SØ_IND)  = '2'  THEN                   00001040
           DO;                                                          00001050
            W_ET1 = (0.5 * G );                                         00001060
            W_ET1 = W_ET1 / 12 ;                                        00001070
            W_ET =  W_ET1 + 0.5;                                        00001080
           END;                                                         00001090
       END;                                                             00001100
                                                                        00001110
              /*---------------------------------------------------*/   00001120
              /*  PENSJONEN TILSTÅTT I NORGE FLYTTER TIL UTLANDET   */  00001130
              /*---------------------------------------------------*/   00001140
                                                                        00001150
       IF (B01.ALDERSP.ET(BER_SØ_IND) > 0 &                             00001160
           B01.BOSATT    (BER_SØ_IND) = 0 ) &                           00001170
           B02.BOSATT    (BER_SØ_IND) > 0  THEN                         00001180
         DO;                                                            00001190
           W_ET1 = ( B02.ALDERSP.GP(BER_SØ_IND) * 0.5);                 00001200
           W_ET  = W_ET1 + 0.5;                                         00001210
         END;                                                           00001220
      /*-------------------------------------------------*/             00001230
      /* PENSJONEN TILSTÅTT I UTLANDET FLYTTER TIL NORGE */             00001240
      /* BEREGNING LIK SOM BOSATT                        */             00001250
      /*-------------------------------------------------*/             00001260
                                                                        00001270
    RETURN (W_ET);                                                      00001280
   END F_ET_UTLAND;                                                     00001290
                                                                        00001300
