 /*   SIST ENDRET PÅ PROD   2002.04.19 12.02.35 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.37 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.31 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.46.48 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.39.59 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NN11  UNDERPROGRAM SOM BRUKES AV R001NO10    */        
 /*                            KONTROLL A1-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */        
 /*  PROGRAMMET BLE LAGET : NOV 1990                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*                                                                   */        
 /*                                                                   */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NN11                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R001N502   BLANK TRANSOMR                                      */        
 /*    R001N503   KONTR A1 SØKER                                      */        
 /*    R001N504   KONTR A1 BARN                                       */        
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR A1 OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P105_BEHANDLE_A1: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P001N501;                      /* TRANSOMRÅDE A1 */                   
                                                                                
                                                                                
          CALL BLANK_A1_SØKER;                         /* R001N502 */           
          CALL BLANK_A1_BARN;                          /* R001N502 */           
          CALL BLANK_A1_MELDNR;                        /* R001N502 */           
          CALL OVERF_A1_BLANKETT;                    /* INTERN PROC */          
          CALL KONTROLL_A1_SØKER(FEIL_FUNNET);         /* R001N503 */           
                                                                                
          IF ^FEIL_FUNNET                         &                             
             F_FELT_PIC_CHAR2(A1S.BT_ANT) ^= '00' THEN                          
             DO;                                                                
                CALL OVERF_A1_BARN;                                             
                CALL KONTROLL_A1_BARN(FEIL_FUNNET);    /* R001N504 */           
             END;                                                               
                                                                                
          IF A1S.NORSK_BOSATT = 'N'   THEN                                      
             DO;                                                                
                FEIL_I_BOSATT = TRUE;                                           
                FEIL_FUNNET   = TRUE;                                           
             END;                                                               
                                                                                
          IF FEIL_FUNNET      THEN                                              
             CALL FINN_FEIL_A1;                                                 
                                                                                
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL A1 TRANSOMRÅDE FOR A1 SØKER.                      */        
 /* ***************************************************************** */        
 OVERF_A1_BLANKETT:PROC;                                                        
                                                                                
     DCL HJELPEDATO  PIC  '(8)9';                                               
                                                                                
          A1S.REGDATO_ÅMD  =  BLANKETT_RECORD.TRANS_DATO_ÅMD;                   
          A1S.TERMID       = DIV_PARAM_OMR.TERMINAL_NR;                         
          HJELPEDATO        = A1_BLANKETT.VIRK_DATO_ÅMD / 100;                  
          A1S.VIRK_DATO_ÅMD = HJELPEDATO * 100;                                 
          A1S.NAVN         =  BLANKETT_RECORD.NAVN;                             
          A1S.FNR          =  BLANKETT_RECORD.FNR;                              
          A1S.TKNR         =  BLANKETT_RECORD.TKNR;                             
          A1S.SPRÅK        =  A1_BLANKETT.SPRÅK;                                
          A1S.SIVILSTAND   =  A1_BLANKETT.SIVILSTAND;                           
          A1S.TILL_EK      =  A1_BLANKETT.EKTEFELLETILLEGG;                     
                                                                                
          IF F_FELT_PIC_CHAR3 (A1_BLANKETT.ANT_BARN) ^= '   '    THEN           
             A1S.BT_ANT    =  A1_BLANKETT.ANT_BARN;                             
                                                                                
          A1S.NORSK_BOSATT =  A1_BLANKETT.NORSK_BOSATT;                         
                                                                                
          IF F_FELT_PIC_CHAR5 (A1_BLANKETT.FAI) ^= '     '       THEN           
             A1S.FAI       =  A1_BLANKETT.FAI * 100;                            
                                                                                
          IF F_FELT_PIC_CHAR5 (A1_BLANKETT.INNTEKT_EK) ^= '     '  THEN         
             A1S.INNT_EK   =  A1_BLANKETT.INNTEKT_EK ; /*   * 100 ?? */         
                                                                                
          IF F_FELT_PIC_CHAR7                                                   
                    (A1_BLANKETT.PENSJONS_BELØP) ^= '     ' THEN                
             A1S.PENSJON_BELØP =  A1_BLANKETT.PENSJONS_BELØP;                   
                                                                                
          IF F_FELT_PIC_CHAR3 (A1_BLANKETT.APD) ^= '   '         THEN           
             A1S.APD       =  A1_BLANKETT.APD;                                  
                                                                                
          IF F_FELT_PIC_CHAR11 (A1_BLANKETT.FNR_EK) ^= (11)' '   THEN           
             A1S.FNR_EK    =  A1_BLANKETT.FNR_EK;                               
                                                                                
          A1S.NAVN_EK      =  A1_BLANKETT.NAVN_EK;                              
          A1S.MINST4G      =  A1_BLANKETT.MINST4G;                              
          A1S.EK_INNT_OVER_2G  =  A1_BLANKETT.EK_INNT_OVER_2G; /*HL*/           
                                                                                
          A1S.RED_GP_3_2_5       =  A1_BLANKETT.RED_GP_3_2_5;                   
                                                                                
    END OVERF_A1_BLANKETT;                                                      
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL A1 TRANSOMRÅDE FOR A1 BARN.                       */        
 /* ***************************************************************** */        
 OVERF_A1_BARN:PROC;                                                            
                                                                                
                                                                                
          DO I = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                               
                               (A1_BLANKETT.FNR_BARN (I)) ^= (11)' ');          
             A1B.FNR_BARN(I) = A1_BLANKETT.FNR_BARN(I);                         
 /*NB!       A1B.RBT_BARN(I) = A1_BLANKETT.RED_BT(I);   */                      
          END;                                                                  
                                                                                
                                                                                
    END OVERF_A1_BARN;                                                          
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */        
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */        
 /* ***************************************************************** */        
 FINN_FEIL_A1:PROC;                                                             
                                                                                
    DCL ANT_BARN              FIXED BIN (15);                                   
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF A1S.FNRNR ^= 0 &                                                   
             A1S.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF A1S.TKNRNR ^= 0 &                                                  
             A1S.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.TKNRNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF A1S.NAVNNR ^= 0 &                                                  
             A1S.NAVNNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.NAVNNR;                             
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.SPRÅKNR ^= 0 &                                                 
             A1S.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.SPRÅKNR;                            
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.SIVILSTANDNR ^= 0 &                                            
             A1S.SIVILSTANDNR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.SIVILSTANDNR;                       
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.TILL_EKNR ^= 0 &                                               
             A1S.TILL_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.TILL_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.NORSK_BOSATTNR ^= 0 &                                          
             A1S.NORSK_BOSATTNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.NORSK_BOSATTNR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.BT_ANTNR ^= 0 &                                                
             A1S.BT_ANTNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.BT_ANTNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.FAINR ^= 0 &                                                   
             A1S.FAINR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.FAINR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
  /*NY*/  IF A1S.INNT_EKNR ^= 0 &                                               
             A1S.INNT_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.INNT_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
  /*NY*/  IF A1S.PENSJON_BELØPNR ^= 0 &                                         
             A1S.INNT_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.PENSJON_BELØPNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.APDNR ^= 0 &                                                   
             A1S.APDNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.APDNR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.VIRK_DATO_ÅMDNR ^= 0 &                                         
             A1S.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.FNR_EKNR ^= 0 &                                                
             A1S.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.FNR_EKNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.NAVN_EKNR ^= 0 &                                               
             A1S.NAVN_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.NAVN_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.MINST4GNR ^= 0 &                                               
             A1S.MINST4GNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.MINST4GNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.EK_INNT_OVER_2GNR ^= 0 &                                       
             A1S.EK_INNT_OVER_2GNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.EK_INNT_OVER_2GNR;                  
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.INNT_EKNR ^= 0 &                                               
             A1S.INNT_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.INNT_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.RED_GP_3_2_5NR ^= 0 &                                          
             A1S.RED_GP_3_2_5NR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.RED_GP_3_2_5NR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF A1S.PENSJON_BELØPNR ^= 0 &                                         
             A1S.PENSJON_BELØPNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = A1S.PENSJON_BELØPNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
          DO ANT_BARN = 1 TO 12 WHILE (F_FELT_PIC_CHAR11                        
                                   (A1B.FNR_BARN(ANT_BARN)) ^= (11)'0');        
                                                                                
             IF A1B.FNR_BARNNR(ANT_BARN) ^= 0   &                               
                A1B.FNR_BARNNR(ANT_BARN) ^= 999 THEN                            
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = A1B.FNR_BARNNR(ANT_BARN);            
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
        /*   IF APB.RBT_BARNNR(ANT_BARN) ^= 0   &                               
                APB.RBT_BARNNR(ANT_BARN) ^= 999 THEN                            
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = APB.RBT_BARNNR(ANT_BARN);            
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
          */                                                                    
          END;                                                                  
                                                                                
                                                                                
                                                                                
    END FINN_FEIL_A1;                                                           
                                                                                
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001N502;          /*     BLANK A1 TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R001N503;          /*     KONTR A1 SØKER      */                      
 %PAGE;                                                                         
 %INCLUDE R001N504;          /*     KONTR A1 BARN       */                      
                                                                                
                                                                                
 END P105_BEHANDLE_A1;                                                          
