 /*       SIST ENDRET 26/11-97 12.54.24 AV   SPA7339                  */00000000
 /* ***************************************************************  */ 00000010
 /* PROC FOR KONVERTERING AV DATO  6 CHAR / 7 CHAR TIL 9 CHAR        */ 00000020
 /* ***************************************************************  */ 00000030
  KONV_HÅMD_ÅMD:     PROC(IN_DATO) RETURNS( PIC '(6)9' );               00000040
  DCL IN_DATO     PIC '(8)9';                                           00000050
  DCL UT_DATO     PIC '(6)9' ;                                          00000060
                                                                        00000070
  DCL 1 H_DATO,                                                         00000080
        02 HH     PIC '99'  INIT (00),                                  00000090
        02 ÅR     PIC '99'  INIT (00),                                  00000100
        02 MM     PIC '99'  INIT (00),                                  00000110
        02 DD     PIC '99'  INIT (00),                                  00000120
      1 H_DATO_IN DEF H_DATO PIC '99999999';                            00000130
                                                                        00000140
  DCL 1 H_DATO_UT,                                                      00000150
        02 ÅR     PIC '99'  INIT (00),                                  00000160
        02 MM     PIC '99'  INIT (00),                                  00000170
        02 DD     PIC '99'  INIT (00),                                  00000180
      1 H_DATO_UT_PK  DEF H_DATO_UT  PIC '999999';                      00000190
  /*              ************                  */                      00000200
  IF IN_DATO > 0 THEN                                                   00000210
     DO;                                                                00000220
         H_DATO_IN = IN_DATO;                                           00000230
         H_DATO_UT = H_DATO, BY NAME;                                   00000240
     END;                                                               00000250
  ELSE                                                                  00000260
         H_DATO_UT_PK = 0;                                              00000270
                                                                        00000280
     UT_DATO = H_DATO_UT_PK;                                            00000290
                                                                        00000300
     RETURN (UT_DATO);                                                  00000310
  END KONV_HÅMD_ÅMD;                                                    00000320
                                                                        00000330
