 /*   SIST ENDRET PÅ PROD   2008.11.05 16.23.29 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2007.03.29  8.04.47 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.47.47 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.12 14.24.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.02 13.04.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.01.14 12.32.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.01.14 12.31.39 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.11.26 10.23.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.26 10.23.43 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.10.16 12.58.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.10.16 12.55.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.04.08 11.39.39 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.02.07 12.57.32 AV   JDA7339          */        
 /*       SIST ENDRET 03/08-99 12.45.57 AV   JDA7339                  */        
 /*       SIST ENDRET 03/08-99 12.45.08 AV   JDA7339                  */        
 /*       SIST ENDRET 02/12-98 10.09.24 AV   JDA7339                  */        
 /*       SIST ENDRET 02/12-98 10.08.43 AV   JDA7339                  */        
 /*       SIST ENDRET 25/11-98 10.29.48 AV   JDA7339                  */        
 /*       SIST ENDRET 25/11-98 10.27.44 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.58.30 AV   JDA7339                  */        
 /*                                                                   */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014161 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */        
 /*HENSIKT:                                                           */        
 /*                                                                   */        
 /*                                                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
  LEGG_UFØREHIST_I_TAB:                                                         
    PROC(IND,FØDSELSÅR);                                                        
  /* PROC(IND,FØDSELSÅR,TAB)      ENDERET  AVSATISH  21.4.91        */          
  /*   %INCLUDE P0014003           ENDERET AV SATISH  21.4.91       */          
   DCL IND               FIXED BIN(15);                                         
   DCL FØDSELSÅR         PIC '9999';                                            
   DCL I                 FIXED BIN(15) INIT(0);                                 
   DCL TABIND            FIXED BIN(15) INIT(0);                                 
   DCL W_IND             FIXED BIN(15) INIT(0);                                 
   DCL INDEKS            FIXED BIN(15) INIT(0);                                 
   DCL VIRK_IND          FIXED BIN(15) INIT(0);                                 
   DCL UFTPKT            PIC'(6)9'     INIT(0);                                 
    DCL                                                                         
       1 UF_ÅM DEF UFTPKT,                                                      
         2 UF_ÅR         PIC'9999',                                             
         2 UF_MND        PIC'99';                                               
   DCL VIRK_FRA          PIC'(6)9'     INIT(0);                                 
    DCL                                                                         
       1 VIRK_ÅM DEF VIRK_FRA,                                                  
         2 VIRK_ÅR         PIC'9999',                                           
         2 VIRK_MND        PIC'99';                                             
   DCL OPPH_DATO         PIC'(6)9'     INIT(0);                                 
    DCL                                                                         
       1 OPPHØRSDATO     DEF OPPH_DATO,                                         
         2 UF_OPPH_ÅR    PIC'9999',                                             
         2 UF_OPPH_MND   PIC'99';                                               
   DCL UF_GRAD_ÅM        PIC'(6)9'     INIT(0);                                 
    DCL                                                                         
       1 UFG_DATO        DEF UF_GRAD_ÅM,                                        
         2 UFG_DATO_ÅR   PIC'9999',                                             
         2 UFG_DATO_MND  PIC'99';                                               
                                                                                
   DCL UFG_STOPP         PIC'(4)9'     INIT(0);                                 
   DCL W_TIDLIGERE_GRAD  FIXED(3)      INIT(0);                                 
   DCL W_POENG_GARANTI   FIXED DEC (3,2)  INIT (0);                             
                                                                                
                                                                                
 /* ****************************************************************  */        
 /*  LOOPER 7 GANGER, DA DET KAN VÆRE 7 UFØREPERIODER :               */        
 /* ================================================================= */        
  DO INDEKS = 1 TO 7;          /*0697 HL*/                                      
     IF B02.UFT_ÅMD(IND,INDEKS) > 0 THEN                                        
        DO;                                                                     
   /*TEST PÅ 'B' ER FLYTTET INN I DENNE LOOPEN 9811 */                          
           IF B02.BUP_GAR_KODE(IND,INDEKS) = 'B'      THEN                      
              IF VIRK_LOV92_ÅM                < 198805       THEN               
                 IF VIRK_LOV92_ÅM             < 198705       THEN               
                    IF VIRK_LOV92_ÅM          < 198401       THEN;              
                    ELSE                                                        
                       W_POENG_GARANTI = 2.00;                                  
                 ELSE                                                           
                    W_POENG_GARANTI = 2.50;                                     
              ELSE                                                              
              IF VIRK_LOV92_ÅM             < 199105       THEN                  
                 W_POENG_GARANTI = 3.00;                                        
              ELSE                                                              
              IF VIRK_LOV92_ÅM             < 200805       THEN                  
                 W_POENG_GARANTI = 3.30;                                        
              ELSE                                                              
              IF FØDSELSÅR                 > 1940         THEN                  
                 DO;                                                            
                    W_POENG_GARANTI = 3.50;                                     
                    B02.BUP_GARANTI(IND,INDEKS) = 3.50;                         
                 END;                                                           
              ELSE                                                              
                 W_POENG_GARANTI = 3.30;                                        
     /*HIT 9811*/                                                               
           /* SE (FEILMELDING 72 - 4 NYE LINJER */                              
     /* FJERNET - STI SKAL IKKE BRUKES SOM UFT */                               
     /*    IF (B02.UFØRPENS.STI_ÅMD(IND) > 0) THEN        */                    
              /* VI STARTET FEIL PÅ DE MED STI OG GARANTI */                    
     /*       UFTPKT = B02.UFØRPENS.STI_ÅMD(IND)/100;     */                    
     /*    ELSE                                           */                    
              UFTPKT = B02.UFØRHIST.UFT_ÅMD(IND,INDEKS)/100;                    
   /*NY 3-19.  200405 HL:  */                                                   
           IF B02.VIRK_UFØRHIST_ÅMD(IND,INDEKS) > 20040100 THEN                 
              DO;                                                               
                 VIRK_FRA =                                                     
                   B02.VIRK_UFØRHIST_ÅMD(IND,INDEKS)/100;                       
                 IF VIRK_MND = 1        THEN                                    
                    VIRK_ÅR = VIRK_ÅR - 1;                                      
                 IF VIRK_ÅR > UF_ÅR       THEN                                  
                 DO;                                                            
                    VIRK_IND = UF_ÅR +1;                                        
                    DO VIRK_IND = VIRK_IND   TO VIRK_ÅR;                        
    /*TILLEGG 200510 HL: */                                                     
                       IF VIRK_IND > 2003          THEN                         
                          TAB.NY_3_19(VIRK_IND) = 'J';                          
                    END;                                                        
                 END;                                                           
              END;                                                              
           OPPH_DATO = B02.OPPHØRSDATO_ÅMD(IND,INDEKS)/100;                     
                                                                                
 /* OPPHØRSDATO ER FRA JAN 91 MÅNEDEN ETTER 67 ÅR FYLLES (0196 HL)*/            
                                                                                
           IF FØDSELSÅR > 1923            &                                     
              UF_OPPH_ÅR > (FØDSELSÅR + 67)   THEN                              
              DO;                                                               
                 UF_OPPH_ÅR = UF_OPPH_ÅR - 1;                                   
                 UF_OPPH_MND = 12;                                              
              END;                                                              
                                                                                
 /*                                                                   */        
 /*        FOR HVER UFØREPERIODE UTFØRES FØLGENDE :                   */        
 /*                                                                   */        
           IF UF_ÅR < 1967                THEN                                  
              DO;                                                               
                 UF_ÅR    = 1966;                                               
                 UF_MND   = 12;                                                 
                 TAB.POENGGARANTI(1967)    = W_POENG_GARANTI;                   
                 TAB.POENGGARANTI_KODE(1967) =                                  
                      B02.BUP_GAR_KODE(IND,INDEKS);                             
                 TAB.BUP_FPP     (1967)    = W_POENG_GARANTI;                   
              END;                                                              
           TAB.UFØR_START_MND(UF_ÅR)   = UF_MND;                                
           IF TAB.UFØR_GRAD(UF_ÅR) < B02.UFØRHIST.UFG(IND,INDEKS)               
                                                                  THEN          
 /*                                                                   */        
 /*              I DE TILFELLER HVOR VI HAR LAGT UT EN UFØREPERIODE   */        
 /*              OG HOLDER PÅ MED NESTE, LEGGER VI DEN NYE UFØRE-     */        
 /*              GRADEN OVER DEN SOM LIGGER I TABELLEN FRA FØR.       */        
 /*              VI SKAL BRUKE HØYESTE UFØREGRAD FOR HVERT ENKELT ÅR  */        
 /*                                                                   */        
             DO;  /*200703 HL : */                                              
                TAB.UFØR_GRAD(UF_ÅR) = B02.UFØRHIST.UFG(IND,INDEKS);            
                TAB.NULL_KODE(UF_ÅR) = ' ';                                     
                TAB.NULL_KODE(UF_ÅR + 1) = ' ';                                 
             END;                                                               
           ELSE                                                                 
 /*                                                                   */        
 /*     I DE TILFELLER HVOR VI HAR LAGT UT EN UFØREPERIODE OG HOLDER  */        
 /*     PÅ MED NESTE, LEGGER VI DEN NYE UFØREGRADEN UT I TABELLEN     */        
 /*     PÅ NESTE ÅR NÅR UFØREGRADEN ER MINDRE                         */        
 /*     VI SKAL BRUKE HØYESTE UFØREGRAD FOR HVERT ENKELT ÅR.          */        
 /*                                                                   */        
              TAB.UFØR_GRAD(UF_ÅR + 1)    =                                     
                                        B02.UFØRHIST.UFG(IND,INDEKS);           
           TAB.UFØR_KRIT(UF_ÅR)        =                                        
                                        B02.UFKRITERIER(IND,INDEKS);            
           TAB.UFØR_PERIODE(UF_ÅR)     =                                        
                                        'S';                                    
  /*200703 - HL : */                                                            
           IF TAB.UFØR_PERIODE(UF_ÅR - 1)  = 'L'    THEN                        
              TAB.UFØR_PERIODE(UF_ÅR - 1)  = 'M';                               
           TAB.POENGGARANTI(UF_ÅR)     = W_POENG_GARANTI;                       
           TAB.POENGGARANTI_KODE(UF_ÅR) =                                       
                                        B02.BUP_GAR_KODE(IND,INDEKS);           
           IF B02.OPPHØRSDATO_ÅMD(IND,INDEKS) > 0 THEN                          
              DO;                                                               
                 TAB.UFØR_SLUTT_MND(UF_OPPH_ÅR) = UF_OPPH_MND;                  
                 TAB.UFØR_SLUTT_KODE(UF_OPPH_ÅR)=                               
                                         B02.OPPHØRSKODE(IND,INDEKS);           
                 TAB.UFØR_PERIODE(UF_OPPH_ÅR)   =                               
                                         B02.OPPHØRSKODE(IND,INDEKS);           
                 TAB.UFØR_GRAD(UF_OPPH_ÅR + 1)  = 0;                            
                                                                                
              END;                                                              
                                                                                
           W_TIDLIGERE_GRAD = B02.UFØRHIST.UFG(IND,INDEKS);                     
      /*   IF TAB.UFØR_KRIT(UF_ÅR) = 0 THEN                                     
              DO;     MARTIN MARS 2004 */                                       
      /*         TABIND = UF_ÅR;                                                
                 IF UF_OPPH_ÅR > TABIND           !                             
                    UF_OPPH_ÅR = 0                THEN                          
                    DO W_IND = TABIND TO 2060;                                  
      /*               TAB.SISTE_BUP_ÅR(W_IND) = 'J';                           
                    END;                                                        
              END;    MARTIN MARS 2004                                          
           ELSE  */                                                             
           IF B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(IND,INDEKS) > 0 THEN             
              DO;                                                               
                 TABIND = UF_ÅR +                                               
                    B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(IND,INDEKS) - 1;           
                 IF UF_OPPH_ÅR > TABIND           !                             
                    UF_OPPH_ÅR = 0                THEN                          
                    DO W_IND = TABIND TO 2060;                                  
                       TAB.SISTE_BUP_ÅR(W_IND) = 'J';                           
                    END;                                                        
              END;                                                              
                                                                                
           /* REMEDY 65: MARTIN 151203 FRA HER                                  
           IF (B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(IND,INDEKS) > 0 & */            
              /* VI SKAL IKKE REDUSERE FRAMTIDIGE VED UFT FØR 1991 */           
           /*  B02.UFØRHIST.UFT_ÅMD(IND,1) > 19910000           &               
               VERIFY(B02.PENSJONSTYPE1(IND),'UY')          = 0 &               
               B02.STATUS.TT_FRAMT(IND)                     = 0 ) THEN          
              DO;                                                               
                 TABIND = UF_ÅR +                                               
                    B02.UFØRHIST.REDUSERT_ANT_BUP_ÅR(IND,INDEKS) - 1;           
                 IF UF_OPPH_ÅR > TABIND           !                             
                    UF_OPPH_ÅR = 0                THEN                          
                    DO W_IND = TABIND TO 2060;                                  
                       TAB.SISTE_BUP_ÅR(W_IND) = 'J';                           
                    END;                                                        
              END;                                                              
           /* REMEDY 65: MARTIN 151203 TIL HIT */                               
                                                                                
  /*       DO I = 1 TO 7;   */                                                  
           DO I = 1 TO 12;  /*HL*/                                              
 /*                                                                   */        
 /*    LOOPER 12 GANGER FORDI DET KAN VÆRE 12 UFØREGRADPERIODER      */         
 /*        UNDER HVER UFØREPERIODE                                    */        
 /*                                                                   */        
              IF B02.UFG_DATO_ÅMD(IND,INDEKS,I) > 0 THEN                        
                 DO;                                                            
                    UF_GRAD_ÅM = B02.UFG_DATO_ÅMD(IND,INDEKS,I)/100;            
                    IF W_TIDLIGERE_GRAD < B02.UFG_ØVRIGE(                       
                                                      IND,INDEKS,I) !           
                       UFG_DATO_MND = 01                      THEN              
 /*                                                                   */        
 /*                    SAMME REGEL SOM FOR NY UFØREPERIODE. HØYESTE   */        
 /*                    UFØREGRAD FOR HVERT ÅR SKAL BENYTTES.          */        
 /*                                                                   */        
                       DO;                                                      
                          TAB.UFØR_GRAD(UFG_DATO_ÅR) =                          
                                     B02.UFG_ØVRIGE(IND,INDEKS,I);              
      /*FRYS MED NULL I GRAD - 200311 HL :              */                      
                          IF TAB.UFØR_GRAD(UFG_DATO_ÅR) = 0   THEN              
                             TAB.NULL_KODE(UFG_DATO_ÅR) = 'J';                  
                          IF (TAB.UFØR_GRAD(UFG_DATO_ÅR + 1) > 0) !             
                    (TAB.NULL_KODE(UFG_DATO_ÅR + 1) = 'J') THEN                 
                            DO;                                                 
                               TAB.UFØR_GRAD(UFG_DATO_ÅR + 1) =                 
                                        B02.UFG_ØVRIGE(IND,INDEKS,I);           
                               TAB.NULL_KODE(UFG_DATO_ÅR + 1) = ' ';            
                            END;                                                
                       END;                                                     
                    ELSE                                                        
                      IF TAB.UFØR_SLUTT_MND(UFG_DATO_ÅR + 1) ^= 01 THEN         
 /*                                                                   */        
 /*                      SAMME REGEL SOM FOR NY UFØREPERIODE. HØYESTE */        
 /*                      UFØREGRAD FOR HVERT ÅR SKAL BENYTTES. DETTE  */        
 /*                      GJØRES BARE HVIS NESTE ÅR IKKE ER ET OPPHØRS-*/        
 /*                      ÅR.                                          */        
                         DO; /* REMEDY 366 */                                   
                         TAB.UFØR_GRAD(UFG_DATO_ÅR + 1) =                       
                                        B02.UFG_ØVRIGE(IND,INDEKS,I);           
                                                                                
      /*FRYS MED NULL I GRAD - 200311 HL :                */                    
                    IF TAB.UFØR_GRAD(UFG_DATO_ÅR + 1) = 0  THEN                 
                       TAB.NULL_KODE(UFG_DATO_ÅR + 1) = 'J';                    
                         END; /* REMEDY 366 */                                  
                    W_TIDLIGERE_GRAD = B02.UFG_ØVRIGE(IND,INDEKS,I);            
                 END;                                                           
              ELSE                                                              
   /*            I = 7;    */                                                   
                 I = 12;   /*HL*/                                               
           END;                                                                 
                                                                                
           IF UF_OPPH_ÅR > 0 THEN                                               
 /*                                                                   */        
 /*          HER SETTER VI STOPPÅR FOR DENNE UFØREPERIODEN NÅR UFØRE- */        
 /*          PERIODEN HAR ET OPPHØR. HVIS OPPHØRET ET ÅR ER I JANUAR, */        
 /*          SETTES STOPPÅR TIL ÅRET FØR.                             */        
 /*                                                                   */        
              DO;                                                               
                UFG_STOPP = UF_OPPH_ÅR;                                         
                IF TAB.UFØR_SLUTT_MND(UF_OPPH_ÅR) = 01 THEN                     
                   DO;                                                          
                      TAB.UFØR_GRAD(UF_OPPH_ÅR) = 0;                            
                      UFG_STOPP                 = UFG_STOPP - 1;                
                   END;                                                         
                 TAB.UFØR_GRAD(UFG_STOPP + 1) = 0;  /*9908*/                    
              END;                                                              
           ELSE                                                                 
 /*                                                                   */        
 /*           STOPPÅR FOR DENNE UFØREPERIODEN SETTES TIL DET ÅRET     */        
 /*           PERSONEN FYLLER 66 ÅR NÅR UFØREPERIODEN IKKE ER OPPHØRT.*/        
 /*                                                                   */        
              DO;                                                               
                IF UF_ÅR < 1973 THEN                                            
                   UFG_STOPP = FØDSELSÅR + 69;                                  
                ELSE                                                            
                   UFG_STOPP = FØDSELSÅR + 66;                                  
                                                                                
              END;                                                              
           IF UF_ÅR < UFG_STOPP THEN                                            
              DO I = UF_ÅR + 1 TO UFG_STOPP;                                    
      /*FRYS MED NULL I GRAD - 200311 HL :    */                                
                 IF TAB.UFØR_GRAD(I) = 0       &                                
                       TAB.NULL_KODE(I) = ' '   THEN                            
 /*                                                                   */        
 /*               HER FYLLER VI UT MELLOMLIGGENDE ÅR MED UFØREGRADEN  */        
 /*               FOR ÅRET FØR HVIS DET IKKE LÅ EN GRAD DER FRA FØR.  */        
 /*                                                                   */        
                    DO;                                                         
                       TAB.UFØR_GRAD(I) = TAB.UFØR_GRAD(I - 1);                 
                       TAB.UFØR_KRIT(I) = TAB.UFØR_KRIT(I - 1);                 
                    END;                                                        
                 IF TAB.UFØR_PERIODE(I) = ' '      !                            
   /*200703 HL : */                                                             
                    TAB.UFØR_PERIODE(I) = 'L' THEN                              
                    IF UF_OPPH_ÅR > 0 THEN                                      
 /*                                                                   */        
 /*                    MELLOMLIGGENDE ÅR MERKES MED 'M' NÅR PERIODEN  */        
 /*                    HAR EN STARTDATO OG OPPHØRSDATO.               */        
 /*                                                                   */        
                       TAB.UFØR_PERIODE(I) = 'M';                               
                    ELSE                                                        
 /*                                                                   */        
 /*                 ÅR SOM TILHØRER EN LØPENDE UFØREPERIODE MERKES 'L'*/        
 /*                                                                   */        
                       TAB.UFØR_PERIODE(I) = 'L';                               
              END;                                                              
    END;                                                                        
  ELSE                                                                          
     INDEKS = 7;     /*0697 HL*/                                                
 END;                                                                           
                                                                                
  END LEGG_UFØREHIST_I_TAB;                                                     
