 /*       SIST ENDRET 11/03-98 12.06.08 AV   JDA7339                  */00000000
 /* ***************************************************************** */00000010
 /* IDENTIFIKASJON:                                                   */00000020
 /*     R0017044 - PROSEDYRE I PLI                                    */00000030
 /*     PROGRAMMERER: JAN JANUAR 83                                   */00000040
 /* HENSIKT:                                                          */00000050
 /*     RUTINEN SETTER INN KODER FOR TEKSTTYPE U I TEKSTTABELLEN      */00000060
 /*     FOR STØNADSBREV.                                              */00000070
 /*     TEKSTTYPE U FORTELLER OM AT FASTSETTELSE AV STØRRELSEN PÅ     */00000080
 /*     PENSJONEN.                                                    */00000090
 /* PROGRAMTILKNYTNING:                                               */00000100
 /*     INCLUDES I R0017001                                           */00000110
 /* BRUK:                                                             */00000120
 /*     CALL PLASSER_TEKSTTYPE_U_KODE(IND,EK_IND)                     */00000130
 /* ***************************************************************** */00000140
                                                                        00000150
 %PAGE;                                                                 00000160
                                                                        00000170
 PLASSER_TEKSTTYPE_U_KODE:                                              00000180
                                                                        00000190
    PROC(IND,IND_EK);                                                   00000200
                                                                        00000210
                                                                        00000220
    DCL                                                                 00000230
       IND      FIXED BIN (15),                                         00000240
       W_VIRK   PIC '99999999',                                         00000250
       IND_EK   FIXED BIN (15);                                         00000260
    DCL                                                                 00000270
       F_NUM13   PIC '(13)9';                                           00000280
    DCL                                                                 00000290
       F_NUM13_EK  PIC '(13)9';                                         00000300
    DCL                                                                 00000310
       F_AAR DEF F_NUM13 POS (5) PIC '9999';                            00000320
    DCL                                                                 00000330
       F_ÅMD DEF F_NUM13 POS (1) PIC '99999999';                        00000340
    DCL                                                                 00000350
       F_ÅMD_EK DEF F_NUM13_EK POS (1) PIC '99999999';                  00000360
    DCL                                                                 00000370
       UFØR_ALDER FIXED DEC(4);                                         00000380
 /*  HJELPE DCL FOR Å SNU DATO           */                             00000390
                                                                        00000400
   DCL                                                                  00000410
      HJ_VIRK_DATO_ÅMD                       PIC '99999999',            00000420
      VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅMD POS(1) PIC '9999',               00000430
      VIRK_DATO_M DEF HJ_VIRK_DATO_ÅMD POS(5) PIC '99',                 00000440
      HJ_UFT_ÅMD                             PIC '99999999',            00000450
      UFT_Å DEF HJ_UFT_ÅMD POS(1)            PIC '9999',                00000460
      UFT_M DEF HJ_UFT_ÅMD POS(5)            PIC '99';                  00000470
                                                                        00000480
 /*DCL                                                                  00000490
      HJ_VIRK_DATO_ÅMD                          PIC '99999999',         00000500
      HJ_VIRK_DATO_M DEF HJ_VIRK_DATO_ÅMD POS(1) PIC '99',              00000510
      HJ_VIRK_DATO_Å DEF HJ_VIRK_DATO_ÅMD POS(3) PIC '9999',            00000520
      HJ_UFT_ÅMD                                PIC '99999999',         00000530
      HJ_UFT_M DEF HJ_UFT_ÅMD POS(1)            PIC '99',               00000540
      HJ_UFT_Å DEF HJ_UFT_ÅMD POS(3)            PIC '9999'; */          00000550
                                                                        00000560
          DCL                                                           00000570
            SISTE  FIXED BIN(15);                                       00000580
          DCL UFØR_ALDER_DØD   FIXED DEC(5) INIT (0);                   00000590
          DCL W_DØDSDATO_ÅMD    PIC  '(8)9';                            00000600
   DCL                                                                  00000610
      ALDER                   FIXED DEC (5);                            00000620
                                                                        00000630
                                                                        00000640
                                                                        00000650
 /* ***************************************************************** */00000660
 /* PROGRAMMET STARTER HER                                            */00000670
 /* ***************************************************************** */00000680
                                                                        00000690
    F_NUM13             = KONV_FNR11_FNR13(B02.FNR(IND));               00000700
    F_NUM13_EK          = KONV_FNR11_FNR13(B02.FNR(IND_EK));            00000710
    UFØR_ALDER          = B02.UFØRHIST.UFT_ÅMD(IND,1) - F_ÅMD;          00000720
    DCL TRUDE_ÅMD PIC '99999999';                                       00000730
    DCL TRUDE_UFT PIC '99999999';                                       00000740
    TRUDE_ÅMD       = F_ÅMD;                                            00000750
    TRUDE_UFT       = B02.UFØRHIST.UFT_ÅMD(IND,1);                      00000760
    HJ_VIRK_DATO_ÅMD    = B01.VIRK_DATO_ÅMD(IND);                       00000770
    W_VIRK              = B02.VIRK_DATO_ÅMD(IND);                       00000780
    ALDER           = F_ALDER(F_NUM13,W_VIRK);                          00000790
    TEKSTTYPE_U_KODE    = '';                                           00000800
    J                   = 1;                                            00000810
    M                   = 1;                                            00000820
       /*------------------------------------------------------------ */00000830
       /*VI MÅ  FINNE ALDER PÅ DØDSTIDSPUNKTET På AVDøDE DERSOM AVDøDE*/00000840
       /*IKKE HADDE BUP-GARANTI FRA FØR. TIDLIGERE I PGM ER DET FUNNET*/00000850
       /*UFØR_ALDER PÅ SØKER. TRUDE 120692                            */00000860
       /*NB!! DENNE TEST SKAL NOK OGSÅ GJELDE  FLERE TILFELLER!!      */00000870
       /*------------------------------------------------------------ */00000880
                                                                        00000890
    W_DØDSDATO_ÅMD = B02.STATUS.DØDSDATO_ÅMD(IND_EK);                   00000900
    IF B02.BUP_GARANTI(IND_EK,1) > 0  THEN                              00000910
       UFØR_ALDER_DØD  = B02.UFØRHIST.UFT_ÅMD(IND_EK,1)                 00000920
                       - F_ÅMD_EK;                                      00000930
    ELSE                                                                00000940
       UFØR_ALDER_DØD  = W_DØDSDATO_ÅMD                                 00000950
                       - F_ÅMD_EK;                                      00000960
                                                                        00000970
    IF B02.PENSJONSTYPE2(IND) = 'O' THEN                                00000980
       DO;                                                              00000990
          TEKSTTYPE_U_KODE(J) = 'U002';                                 00001000
          J = J + 1;                                                    00001010
       END;                                                             00001020
    ELSE                                                                00001030
       DO;                                                              00001040
          TEKSTTYPE_U_KODE(J) = 'U001';                                 00001050
          J = J + 1;                                                    00001060
       END;                                                             00001070
    IF B02.PENSJONSTYPE1(IND) = 'Y' THEN                                00001080
       DO;                                                              00001090
          IF DIV_PARAM_OMR.ENGANGSBELØP_11_7(IND) > 0 THEN              00001100
           DO;                                                          00001110
             TEKSTTYPE_U_KODE(J) = 'U300';                              00001120
             J = J + 1;                                                 00001130
           END;                                                         00001140
        END;                                                            00001150
                                                                        00001160
                                                                        00001170
    IF B02.PENSJONSTYPE2(IND) = 'E' THEN                                00001180
                                                                        00001190
       DO;                                                              00001200
          IF B02.ETTEPENS.TP_BRUTTO(IND) > 0   &                        00001210
             B02.PENSJONSTYPE3     (IND) ^= 'A' THEN                    00001220
                                                                        00001230
                                                                        00001240
             DO;                                                        00001250
                TEKSTTYPE_U_KODE(J) = 'U005';                           00001260
                                                                        00001270
                J = J + 1;                                              00001280
                                                                        00001290
             END;                                                       00001300
          ELSE                                                          00001310
                                                                        00001320
                                                                        00001330
             IF (B02.YRKEPENS.TP(IND)  +                                00001340
                 B02.UFØRPENS.TP(IND)) > B02.ETTEPENS.TP_BRUTTO(IND) &  00001350
                 B02.PENSJONSTYPE1    (IND) = 'Y'                    &  00001360
                 B02.PENSJONSTYPE3     (IND) ^= 'A'                 &   00001370
                B02.ETTEPENS.TP_PROSENT(IND) > 0 THEN                   00001380
                DO;                                                     00001390
                   TEKSTTYPE_U_KODE(J) = 'U336';                        00001400
                   J                   = J + 1;                         00001410
                END;                                                    00001420
             ELSE                                                       00001430
                IF B02.ETTEPENS.TP_PROSENT(IND) > 0        &            00001440
                  (B02.ALDERSP.FAI      (IND)                           00001450
                 + B02.ETTEPENS.FORVENTET (IND) = 0)  &                 00001460
                   B02.PENSJONSTYPE3    (IND) ^= 'A'       &            00001470
                   B02.PENSJONSTYPE1    (IND) ^= 'Y'      THEN          00001480
                                                                        00001490
                  DO;                                                   00001500
                                                                        00001510
                   TEKSTTYPE_U_KODE(J) = 'U006';                        00001520
                                                                        00001530
                   J = J + 1;                                           00001540
                                                                        00001550
                  END;                                                  00001560
                                                                        00001570
       END;                                                             00001580
                                                                        00001590
    SELECT(B02.PENSJONSTYPE1(IND));                                     00001600
                                                                        00001610
       WHEN('A')                                                        00001620
          DO;                                                           00001630
                                                                        00001640
 /* ***************************************************************** */00001650
 /* ALDERSPENSJONIST                                                  */00001660
 /* ***************************************************************** */00001670
                                                                        00001680
             IF W_HENDELSE.GARANTITILLEGG_TP > 0 THEN                   00001690
                DO;                                                     00001700
                   TEKSTTYPE_U_KODE(J) = 'U108';                        00001710
                   J                   = J + 1;                         00001720
                END;                                                    00001730
             IF B02.FORSI.GARANTITILLEGG_EK(IND) > 0        !           00001740
                B02.FORSI.GARANTITILLEGG_BARN(IND) > 0      !           00001750
                B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0   THEN        00001760
                DO;                                                     00001770
                   TEKSTTYPE_U_KODE(J) = 'U110';                        00001780
                   J                   = J + 1;                         00001790
                END;                                                    00001800
             IF F_AAR > 1924 & B02.SUM_YTELSE(IND) = 0 THEN             00001810
                DO;                                                     00001820
                   TEKSTTYPE_U_KODE(J) = 'U115';                        00001830
                   J                   = J + 1;                         00001840
                END;                                                    00001850
             IF F_AAR > 1924  & ALDER < 7001 THEN                       00001860
                DO;                                                     00001870
                   TEKSTTYPE_U_KODE(J) = 'U113';                        00001880
                   J                   = J + 1;                         00001890
                END;                                                    00001900
             ELSE                                                       00001910
                IF B02.ALDERSP.FAI(IND) > 0  &                          00001920
                   B02.APD        (IND) < 100  THEN                     00001930
                   DO;                                                  00001940
                      TEKSTTYPE_U_KODE(J) = 'U008';                     00001950
                      J                   = J + 1;                      00001960
                   END;                                                 00001970
                ELSE                                                    00001980
                   DO;                                                  00001990
                      TEKSTTYPE_U_KODE(J) = 'U088';                     00002000
                      J                   = J + 1;                      00002010
                   END;                                                 00002020
             IF B02.P67_KODE(IND) = '1'  & F_AAR < 1925 THEN            00002030
                DO;                                                     00002040
                   TEKSTTYPE_U_KODE(J) = 'U009';                        00002050
                   J                   = J + 1;                         00002060
                END;                                                    00002070
             ELSE                                                       00002080
                DO;                                                     00002090
                   IF B02.P67_KODE(IND) = '2' THEN                      00002100
                      DO;                                               00002110
                         IF B02.KONV_P_KODE(IND) = 'U' THEN             00002120
                            DO;                                         00002130
                               IF IND = SØKER_IND THEN                  00002140
                                  DO;                                   00002150
                                     TEKSTTYPE_U_KODE(J) = 'U010';      00002160
                                     J = J + 1;                         00002170
                                  END;                                  00002180
                            END;                                        00002190
                         ELSE                                           00002200
                            IF B02.APD(IND) > B02.KONV_GRAD(IND) THEN   00002210
                               DO;                                      00002220
                                  TEKSTTYPE_U_KODE(J) = 'U012';         00002230
                                  J = J + 1;                            00002240
                               END;                                     00002250
                      END;                                              00002260
                END;                                                    00002270
                                                                        00002280
             IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 &                      00002290
                B02.ALDERSP .GP       (IND) ^= 0  THEN                  00002300
             IF B02.PENSJONSTYPE2(IND) ^= 'E'    THEN                   00002310
                                                                        00002320
                DO;                                                     00002330
                   TEKSTTYPE_U_KODE(J) = 'U019';                        00002340
                   J                   = J + 1;                         00002350
                END;                                                    00002360
                                                                        00002370
            ELSE                                                        00002380
             IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 &                      00002390
                B02.ALDERSP .GP       (IND) ^= 0  THEN                  00002400
                DO;                                                     00002410
                   TEKSTTYPE_U_KODE(J) = 'U090';                        00002420
                   J = J + 1;                                           00002430
                END;                                                    00002440
                                                                        00002450
            IF (B02.APD(IND) ^= 0 & B02.YRKEPENS.YUG(IND) ^= 0) &       00002460
               (B02.APD(IND) = B02.YRKEPENS.YUG(IND))  THEN             00002470
                DO;                                                     00002480
                   TEKSTTYPE_U_KODE(J) = 'U323';                        00002490
                   J                   = J + 1;                         00002500
                END;                                                    00002510
                                                                        00002520
            IF  B02.PENSJONSTYPE2(IND   )  = 'E' &                      00002530
               (B02.DØD_AV_YRKESSKADE(IND) = 'E' !                      00002540
                B02.DØD_AV_YRKESSKADE(IND) = 'Y' ) THEN                 00002550
                    DO;                                                 00002560
                       TEKSTTYPE_U_KODE(J) = 'U361';                    00002570
                       J                   = J + 1;                     00002580
                    END;                                                00002590
                                                                        00002600
            IF   B02.YRKEPENS.YUG(IND) > 0 &                            00002610
                 B02.YRKEPENS.YUG(IND) < 100 THEN                       00002620
                DO;                                                     00002630
                   TEKSTTYPE_U_KODE(J) = 'U324';                        00002640
                   J                   = J + 1;                         00002650
                END;                                                    00002660
                                                                        00002670
          END;                                                          00002680
       WHEN('K')                                                        00002690
          DO;                                                           00002700
                                                                        00002710
 /* ***************************************************************** */00002720
 /* AVTALEFESTET PENSJON                                              */00002730
 /* ***************************************************************** */00002740
                                                                        00002750
             IF B02.ALDERSP.UTTAKSDATO_ÅMD(IND) > 19920000 &            00002760
                B02.SUM_YTELSE(IND)            = 0   THEN               00002770
                DO;                                                     00002780
                   TEKSTTYPE_U_KODE(J) = 'U215';                        00002790
                   J                   = J + 1;                         00002800
                END;                                                    00002810
                                                                        00002820
             IF (B02.ALDERSP.UTTAKSDATO_ÅMD(IND) > 19970900 &           00002830
                 B02.ALDERSP.UTTAKSDATO_ÅMD(IND) < 19980100) &          00002840
                 B02.PENSJONSTYPE3        (IND) ^= 'B' THEN             00002850
                DO;                                                     00002860
                   TEKSTTYPE_U_KODE(J) = 'U214';                        00002870
                   J                   = J + 1;                         00002880
                END;                                                    00002890
             ELSE                                                       00002900
             IF B02.ALDERSP.UTTAKSDATO_ÅMD(IND) > 19980000 THEN         00002910
                DO;                                                     00002920
                   TEKSTTYPE_U_KODE(J) = 'U214';                        00002930
                   J                   = J + 1;                         00002940
                END;                                                    00002950
             ELSE                                                       00002960
             IF B02.ALDERSP.UTTAKSDATO_ÅMD(IND) > 19920000 THEN         00002970
                DO;                                                     00002980
                   TEKSTTYPE_U_KODE(J) = 'U213';                        00002990
                   J                   = J + 1;                         00003000
                END;                                                    00003010
             ELSE                                                       00003020
                IF B02.ALDERSP.FAI(IND) > 0  &                          00003030
                   B02.APD        (IND) < 100  THEN                     00003040
                   DO;                                                  00003050
                      TEKSTTYPE_U_KODE(J) = 'U208';                     00003060
                      J                   = J + 1;                      00003070
                   END;                                                 00003080
                ELSE                                                    00003090
                   DO;                                                  00003100
                      TEKSTTYPE_U_KODE(J) = 'U288';                     00003110
                      J                   = J + 1;                      00003120
                   END;                                                 00003130
                                                                        00003140
                                                                        00003150
             IF B02.P67_KODE(IND) = '1' THEN                            00003160
                DO;                                                     00003170
                   TEKSTTYPE_U_KODE(J) = 'U009';                        00003180
                   J                   = J + 1;                         00003190
                END;                                                    00003200
                                                                        00003210
                                                                        00003220
             IF B02.PENSJONSTYPE2(IND) = 'S'       !                    00003230
                (B02.PENSJONSTYPE2(IND) = 'N'  &                        00003240
                 B02.PENSJONSTYPE2(IND_EK) = 'P'  &                     00003250
                 B02.SIVILSTAND   (IND) = 'G'    )   THEN               00003260
                DO;                                                     00003270
                   TEKSTTYPE_U_KODE(J) = 'U021';                        00003280
                   J                   = J + 1;                         00003290
                END;                                                    00003300
                                                                        00003310
             ELSE                                                       00003320
                DO;                                                     00003330
                   TEKSTTYPE_U_KODE(J) = 'U019';                        00003340
                   J                   = J + 1;                         00003350
                END;                                                    00003360
          END;                                                          00003370
       WHEN('U')                                                        00003380
          DO;                                                           00003390
                                                                        00003400
 /* ***************************************************************** */00003410
 /* UFØREPENSJONIST                                                   */00003420
 /* ***************************************************************** */00003430
                                                                        00003440
             IF W_HENDELSE.GARANTITILLEGG_TP > 0 THEN                   00003450
                DO;                                                     00003460
                   TEKSTTYPE_U_KODE(J) = 'U108';                        00003470
                   J                   = J + 1;                         00003480
                END;                                                    00003490
                                                                        00003500
             IF B02.FORSI.GARANTITILLEGG_EK(IND) > 0        !           00003510
                B02.FORSI.GARANTITILLEGG_BARN(IND) > 0      !           00003520
                B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0   THEN        00003530
                DO;                                                     00003540
                   TEKSTTYPE_U_KODE(J) = 'U110';                        00003550
                   J                   = J + 1;                         00003560
                END;                                                    00003570
                                                                        00003580
            IF  B02.PENSJONSTYPE2(IND   )  = 'E' &                      00003590
               (B02.DØD_AV_YRKESSKADE(IND) = 'E' !                      00003600
                B02.DØD_AV_YRKESSKADE(IND) = 'Y' ) THEN                 00003610
                    DO;                                                 00003620
                       TEKSTTYPE_U_KODE(J) = 'U361';                    00003630
                       J                   = J + 1;                     00003640
                    END;                                                00003650
                                                                        00003660
             IF (B02.YRKEPENS.TP(IND)  +                                00003670
                 B02.UFØRPENS.TP(IND)) < B02.ETTEPENS.TP_BRUTTO(IND) &  00003680
                B02.PENSJONSTYPE2(IND   )  = 'E' &                      00003690
                B02.PENSJONSTYPE3(IND   )  = 'A' &                      00003700
                B02.DØD_AV_YRKESSKADE(IND) = 'E' THEN                   00003710
                DO;                                                     00003720
                   TEKSTTYPE_U_KODE(J) = 'U407';                        00003730
                   J                   = J + 1;                         00003740
                END;                                                    00003750
                                                                        00003760
             IF B02.PENSJONSTYPE2(IND) = 'E' THEN                       00003770
                                                                        00003780
                DO;                                                     00003790
                   IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 &                00003800
                      B02.UFØRPENS.GP       (IND) ^= 0  THEN            00003810
                      DO;                                               00003820
                         TEKSTTYPE_U_KODE(J) = 'U090';                  00003830
                         J = J + 1;                                     00003840
                      END;                                              00003850
                   IF (B02.ETTEPENS.FORVENTET(IND) * 100) >             00003860
                      (G / 2)                                THEN       00003870
                      DO;                                               00003880
                         TEKSTTYPE_U_KODE(J) = 'U093';                  00003890
                         J = J + 1;                                     00003900
                      END;                                              00003910
                   ELSE                                                 00003920
                      DO;                                               00003930
                         TEKSTTYPE_U_KODE(J) = 'U092';                  00003940
                         J = J + 1;                                     00003950
                      END;                                              00003960
                END;                                                    00003970
             ELSE                                                       00003980
                DO;                                                     00003990
                   TEKSTTYPE_U_KODE(J) = 'U014';                        00004000
                   J                   = J + 1;                         00004010
                                                                        00004020
                   IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 &                00004030
                      B02.UFØRPENS.GP       (IND) ^= 0  THEN            00004040
                      DO;                                               00004050
                         TEKSTTYPE_U_KODE(J) = 'U019';                  00004060
                         J                   = J + 1;                   00004070
                      END;                                              00004080
                END;                                                    00004090
                                                                        00004100
            IF B02.BEREGN_FOLKETRYGD(IND) ^= ' ' THEN                   00004110
               CALL EØS_TEKSTER(IND,IND_EK);                            00004120
                                                                        00004130
                                                                        00004140
          END;                                                          00004150
       WHEN('Y')                                                        00004160
          DO;                                                           00004170
                                                                        00004180
 /* ***************************************************************** */00004190
 /* YRKESPENSJONIST                                                   */00004200
 /* ***************************************************************** */00004210
                                                                        00004220
            /** FINNE SISTE UTFYLTE YUFT_ÅMD  **/                       00004230
            DO L = 5 TO 1 BY -1 UNTIL(B02.YRKEHIST.YUFT_ÅMD             00004240
                                         (IND,L) > 0);                  00004250
              SISTE = L;                                                00004260
            END;                                                        00004270
                                                                        00004280
                                                                        00004290
             IF W_HENDELSE.GARANTITILLEGG_TP > 0 THEN                   00004300
                DO;                                                     00004310
                   TEKSTTYPE_U_KODE(J) = 'U108';                        00004320
                   J                   = J + 1;                         00004330
                END;                                                    00004340
                                                                        00004350
             IF B02.FORSI.GARANTITILLEGG_EK(IND) > 0        !           00004360
                B02.FORSI.GARANTITILLEGG_BARN(IND) > 0      !           00004370
                B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0   THEN        00004380
                DO;                                                     00004390
                   TEKSTTYPE_U_KODE(J) = 'U110';                        00004400
                   J                   = J + 1;                         00004410
                END;                                                    00004420
                                                                        00004430
             IF B02.YRKEHIST.KAP_11_7_UTLØST(IND,SISTE) = 'J' THEN      00004440
                DO;                                                     00004450
                    IF B02.YRKEHIST.PAÅ(IND,SISTE)  >                   00004460
                           B02.UFØRPENS.SPT(IND)    THEN                00004470
                      DO;                                               00004480
                        TEKSTTYPE_U_KODE(J) = 'U014';                   00004490
                        J                   = J + 1;                    00004500
                        TEKSTTYPE_U_KODE(J) = 'U301';                   00004510
                        J                   = J + 1;                    00004520
                      END;                                              00004530
                    ELSE                                                00004540
                      DO;                                               00004550
                        TEKSTTYPE_U_KODE(J) = 'U014';                   00004560
                        J                   = J + 1;                    00004570
                        TEKSTTYPE_U_KODE(J) = 'U340';                   00004580
                        J                   = J + 1;                    00004590
                      END;                                              00004600
                END;                                                    00004610
                                                                        00004620
             IF B02.YRKEPENS.YUG(IND) = B02.UFØRPENS.UFG(IND)   THEN    00004630
                DO;                                                     00004640
                   TEKSTTYPE_U_KODE(J) = 'U302';                        00004650
                   J                   = J + 1;                         00004660
                   IF B02.YRKEPENS.TP (IND) > 0    &                    00004670
                      B02.YRKEPENS.YUG(IND) < 50 THEN                   00004680
                      DO;                                               00004690
                         TEKSTTYPE_U_KODE(J) = 'U310';                  00004700
                         J                   = J + 1;                   00004710
                      END;                                              00004720
                                                                        00004730
                   IF B02.YRKEPENS.TP (IND) = 0    &                    00004740
                      B02.YRKEPENS.YUG(IND) < 50 THEN                   00004750
                      DO;                                               00004760
                         TEKSTTYPE_U_KODE(J) = 'U309';                  00004770
                         J                   = J + 1;                   00004780
                      END;                                              00004790
                END;                                                    00004800
                                                                        00004810
                                                                        00004820
                                                                        00004830
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'A'  &                 00004840
                B02.YRKEPENS.TP    (IND) > 0    THEN                    00004850
                DO;                                                     00004860
                   TEKSTTYPE_U_KODE(J) = 'U363';                        00004870
                   J                   = J + 1;                         00004880
                END;                                                    00004890
                                                                        00004900
            IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) &                    00004910
               (B02.YRKEPENS.TP    (IND) > 0     ) &                    00004920
               (B02.UFØRPENS.UFG(IND) =  B02.YRKEPENS.YUG(IND)) &       00004930
               (B02.PENSJONSTYPE2  (IND)   = 'S' ) &                    00004940
               (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN                 00004950
                DO;                                                     00004960
                   TEKSTTYPE_U_KODE(J) = 'U311';                        00004970
                   J                   = J + 1;                         00004980
                END;                                                    00004990
                                                                        00005000
            IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) &                    00005010
               (B02.YRKEPENS.TP    (IND) > 0     ) &                    00005020
               (B02.PENSJONSTYPE2  (IND)   = 'S' ) &                    00005030
               (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN                 00005040
                DO;                                                     00005050
                   TEKSTTYPE_U_KODE(J) = 'U312';                        00005060
                   J                   = J + 1;                         00005070
                END;                                                    00005080
                                                                        00005090
            IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &                    00005100
                                                                        00005110
  /*YS         'A' = POENGBEREGNING ETTER ANTATT ÅRLIG INNTEKT */       00005120
                                                                        00005130
               (B02.YRKEPENS.TP    (IND) > 0     ) &                    00005140
               (B02.PENSJONSTYPE2  (IND)   = 'S' ) &                    00005150
               (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN                 00005160
                DO;                                                     00005170
                   TEKSTTYPE_U_KODE(J) = 'U315';                        00005180
                   J                   = J + 1;                         00005190
                END;                                                    00005200
                                                                        00005210
            IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &                    00005220
               (B02.YRKEPENS.TP    (IND) > 0     ) &                    00005230
               (B02.PENSJONSTYPE2  (IND)   = 'S' ) &                    00005240
               (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN                 00005250
                DO;                                                     00005260
                   TEKSTTYPE_U_KODE(J) = 'U316';                        00005270
                   J                   = J + 1;                         00005280
                END;                                                    00005290
                                                                        00005300
            IF (B02.UFØRPENS.UFG(IND) > B02.YRKEPENS.YUG(IND)) &        00005310
               (B02.UFØRPENS.TP    (IND)    >   0    )         &        00005320
               (B02.PENSJONSTYPE3  (IND)  ^= 'A'     )         &        00005330
               (B02.POENGTILLEGG_KODE(IND)  = ' '    ) THEN             00005340
                DO;                                                     00005350
                   TEKSTTYPE_U_KODE(J) = 'U317';                        00005360
                   J                   = J + 1;                         00005370
                END;                                                    00005380
                                                                        00005390
            IF (B02.UFØRPENS.UFG(IND) > B02.YRKEPENS.YUG(IND)) &        00005400
               (B02.UFØRPENS.TP    (IND) > 0     ) &                    00005410
               (B02.PENSJONSTYPE2  (IND)   = 'S' ) &                    00005420
               (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN                 00005430
                DO;                                                     00005440
                   TEKSTTYPE_U_KODE(J) = 'U318';                        00005450
                   J                   = J + 1;                         00005460
                END;                                                    00005470
                                                                        00005480
            IF  B02.ETTEPENS.TP_BRUTTO (IND) > 0 THEN                   00005490
                IF  B02.YRKEPENS.TP    (IND) > 0 THEN                   00005500
                    DO;                                                 00005510
                       TEKSTTYPE_U_KODE(J) = 'U349';                    00005520
                       J                   = J + 1;                     00005530
                    END;                                                00005540
                ELSE                                                    00005550
                    DO;                                                 00005560
                       TEKSTTYPE_U_KODE(J) = 'U348';                    00005570
                       J                   = J + 1;                     00005580
                    END;                                                00005590
            IF (B02.UFØRPENS.UFG(IND) > B02.YRKEPENS.YUG(IND)) &        00005600
               (B02.UFØRPENS.TP    (IND) > 0     ) &                    00005610
               (B02.YRKEPENS.YPT_KODE(IND) ^= 'V' ) &                   00005620
               (B02.PENSJONSTYPE2  (IND)   = 'S' ) &                    00005630
               (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN                 00005640
                DO;                                                     00005650
                   TEKSTTYPE_U_KODE(J) = 'U319';                        00005660
                   J                   = J + 1;                         00005670
                END;                                                    00005680
                                                                        00005690
            IF (B02.PENSJONSTYPE3  (IND)   = 'A' ) &                    00005700
               (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) THEN                 00005710
                DO;                                                     00005720
                   TEKSTTYPE_U_KODE(J) = 'U332';                        00005730
                   J                   = J + 1;                         00005740
                END;                                                    00005750
                                                                        00005760
                                                                        00005770
            IF (B02.UFØRPENS.UFG(IND) > B02.YRKEPENS.YUG(IND)) &        00005780
               (B02.PENSJONSTYPE3  (IND)   = 'A' ) &                    00005790
               (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) THEN                 00005800
                DO;                                                     00005810
                   TEKSTTYPE_U_KODE(J) = 'U333';                        00005820
                   J                   = J + 1;                         00005830
                END;                                                    00005840
                                                                        00005850
            IF (B02.PENSJONSTYPE3  (IND)   = 'A' ) &                    00005860
               (B02.DØD_AV_YRKESSKADE(IND) = 'E' ) THEN                 00005870
                DO;                                                     00005880
                   TEKSTTYPE_U_KODE(J) = 'U334';                        00005890
                   J                   = J + 1;                         00005900
                END;                                                    00005910
                                                                        00005920
             IF B02.PENSJONSTYPE2(IND) = 'P' THEN                       00005930
                DO;                                                     00005940
                   TEKSTTYPE_U_KODE(J) = 'U360';                        00005950
                   J                   = J + 1;                         00005960
                END;                                                    00005970
                                                                        00005980
                                                                        00005990
                                                                        00006000
            IF  B02.PENSJONSTYPE2(IND   )  = 'E' &                      00006010
               (B02.DØD_AV_YRKESSKADE(IND) = 'E' !                      00006020
                B02.DØD_AV_YRKESSKADE(IND) = 'Y' ) THEN                 00006030
                    DO;                                                 00006040
                       TEKSTTYPE_U_KODE(J) = 'U361';                    00006050
                       J                   = J + 1;                     00006060
                    END;                                                00006070
                                                                        00006080
            IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' )  &                   00006090
                                                                        00006100
  /*YS         'V' = POENGBEREGNING ETTER VANLIGE REGLER - IKKE KAP11*/ 00006110
               (B02.YRKEPENS.TP    (IND)   >  0  )  &                   00006120
               (B02.POENGTILLEGG_KODE(IND) = ' ' )  THEN                00006130
                DO;                                                     00006140
                   TEKSTTYPE_U_KODE(J) = 'U313';                        00006150
                   J                   = J + 1;                         00006160
                END;                                                    00006170
                                                                        00006180
             IF B02.YRKEPENS.YPT_KODE(IND) = 'A' THEN                   00006190
                DO;                                                     00006200
                   TEKSTTYPE_U_KODE(J) = 'U368';                        00006210
                   J                   = J + 1;                         00006220
                END;                                                    00006230
                                                                        00006240
             IF (B02.YRKEPENS.YPT_KODE(IND) =   'V' )  &                00006250
                (B01.PENSJONSTYPE1(IND)     =   ' ' )  THEN             00006260
                DO;                                                     00006270
                   TEKSTTYPE_U_KODE(J) = 'U370';                        00006280
                   J                   = J + 1;                         00006290
                END;                                                    00006300
                                                                        00006310
             IF B02.YRKEPENS.TP(IND) > 0  &                             00006320
                B02.YRKEPENS.YPT_KODE(IND) ^= 'V' THEN                  00006330
                DO;                                                     00006340
                   TEKSTTYPE_U_KODE(J) = 'U373';                        00006350
                   J                   = J + 1;                         00006360
                END;                                                    00006370
                                                                        00006380
            IF (B02.YRKEPENS.YPT_KODE(IND) = 'A'  )  &                  00006390
               (B02.YRKEPENS.TP    (IND)   >  0   )  &                  00006400
               (B02.UFØRPENS.UFG(IND) =  B02.YRKEPENS.YUG(IND)) &       00006410
               (B02.POENGTILLEGG_KODE(IND) = ' '  )  THEN               00006420
                DO;                                                     00006430
                   TEKSTTYPE_U_KODE(J) = 'U314';                        00006440
                   J                   = J + 1;                         00006450
                END;                                                    00006460
                                                                        00006470
             IF (B02.YRKEPENS.TP(IND)  +                                00006480
                 B02.UFØRPENS.TP(IND)) < B02.ETTEPENS.TP_BRUTTO(IND) &  00006490
                (B02.PENSJONSTYPE2    (IND) = 'E'                    &  00006500
                 B02.PENSJONSTYPE3    (IND) = 'A')          THEN        00006510
                DO;                                                     00006520
                   TEKSTTYPE_U_KODE(J) = 'U405';                        00006530
                   J                   = J + 1;                         00006540
                END;                                                    00006550
                                                                        00006560
             IF (B02.YRKEPENS.TP(IND)  +                                00006570
                 B02.UFØRPENS.TP(IND)) > B02.ETTEPENS.TP_BRUTTO(IND) &  00006580
                (B02.PENSJONSTYPE2    (IND) = 'E'                    &  00006590
                 B02.PENSJONSTYPE3    (IND) = 'A')          THEN        00006600
                DO;                                                     00006610
                   TEKSTTYPE_U_KODE(J) = 'U406';                        00006620
                   J                   = J + 1;                         00006630
                END;                                                    00006640
                                                                        00006650
             IF (B02.YRKEPENS.TP(IND)  +                                00006660
                 B02.UFØRPENS.TP(IND)) < B02.ETTEPENS.TP_BRUTTO(IND) &  00006670
                B02.PENSJONSTYPE2(IND   )  = 'E' &                      00006680
                B02.PENSJONSTYPE3(IND   )  = 'A' &                      00006690
                B02.DØD_AV_YRKESSKADE(IND) = 'E' THEN                   00006700
                DO;                                                     00006710
                   TEKSTTYPE_U_KODE(J) = 'U407';                        00006720
                   J                   = J + 1;                         00006730
                END;                                                    00006740
                                                                        00006750
                                                                        00006760
             IF (B02.BUP_GARANTI(IND_EK,1) > 0     &                    00006770
                 B02.BUP_GARANTI(IND_EK,1) = B02.YPT(IND_EK)) &         00006780
                (B02.YRKEHIST.YUG(IND,SISTE) > 0 ) THEN                 00006790
                DO;                                                     00006800
                   TEKSTTYPE_U_KODE(J) = 'U352';                        00006810
                   J                   = J + 1;                         00006820
                END;                                                    00006830
                                                                        00006840
            IF (UFØR_ALDER < 2001) &                                    00006850
               (B02.BUP_GARANTI(IND,1) = 3.00) THEN                     00006860
               DO;                                                      00006870
                  TEKSTTYPE_U_KODE(J) = 'U379';                         00006880
                  J                   = J + 1;                          00006890
               END;                                                     00006900
                                                                        00006910
                                                                        00006920
             IF (B02.BUP_GARANTI(IND_EK,1) > 0     &                    00006930
                 B02.BUP_GARANTI(IND_EK,1) = B02.ETTEPENS.SPT_AVD(IND)) 00006940
                                              &                         00006950
                (B02.BUP_GARANTI(IND,1) > 0 )   &                       00006960
                (B02.BUP_GARANTI(IND,1) = B02.UFØRPENS.SPT(IND) !       00006970
                 B02.BUP_GARANTI(IND,1) = B02.YRKEPENS.YPT(IND)) &      00006980
                (B02.YRKEHIST.YUG(IND,SISTE) > 0 ) THEN                 00006990
                DO;                                                     00007000
                   TEKSTTYPE_U_KODE(J) = 'U353';                        00007010
                   J                   = J + 1;                         00007020
                END;                                                    00007030
                                                                        00007040
             IF B02.YRKEPENS.YPT_KODE(IND) = 'V' &                      00007050
                B01.PENSJONSTYPE1(IND) = 'U' THEN                       00007060
                DO;                                                     00007070
                   TEKSTTYPE_U_KODE(J) = 'U395';                        00007080
                   J                   = J + 1;                         00007090
                END;                                                    00007100
                                                                        00007110
             IF B02.YRKEPENS.YPT_KODE(IND) = 'A' &                      00007120
                B01.PENSJONSTYPE1(IND) = 'U' THEN                       00007130
                DO;                                                     00007140
                   TEKSTTYPE_U_KODE(J) = 'U372';                        00007150
                   J                   = J + 1;                         00007160
                END;                                                    00007170
                                                                        00007180
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'F'  THEN              00007190
                DO;                                                     00007200
                   IF B02.YRKEPENS.YPT_KODE(IND) = 'V' THEN             00007210
                      DO;                                               00007220
                         TEKSTTYPE_U_KODE(J) = 'U385';                  00007230
                         J                   = J + 1;                   00007240
                      END;                                              00007250
                   ELSE                                                 00007260
                      DO;                                               00007270
                         TEKSTTYPE_U_KODE(J) = 'U384';                  00007280
                         J                   = J + 1;                   00007290
                         TEKSTTYPE_U_KODE(J) = 'U385';                  00007300
                         J                   = J + 1;                   00007310
                      END;                                              00007320
                END;                                                    00007330
                                                                        00007340
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'V'  &                 00007350
                B02.YRKEPENS.YPT_KODE(IND) = 'Y' THEN                   00007360
                DO;                                                     00007370
                   TEKSTTYPE_U_KODE(J) = 'U393';                        00007380
                   J                   = J + 1;                         00007390
                END;                                                    00007400
                                                                        00007410
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'M'  &                 00007420
                B02.YRKEPENS.YPT_KODE(IND) = 'Y' THEN                   00007430
                DO;                                                     00007440
                   TEKSTTYPE_U_KODE(J) = 'U388';                        00007450
                   J                   = J + 1;                         00007460
                END;                                                    00007470
                                                                        00007480
             IF (B02.YRKEHIST.YRKE11(IND,SISTE)     = 'U'   !           00007490
                 B02.YRKEHIST.YRKE11(IND,SISTE)     = 'M'   !           00007500
                 B02.YRKEHIST.YRKE11(IND,SISTE)     = 'E'   !           00007510
                 B02.YRKEHIST.YRKE11(IND,SISTE)     = 'V')  &           00007520
                (B02.DØD_AV_YRKESSKADE(IND)     = 'E')  THEN            00007530
                DO;                                                     00007540
                   TEKSTTYPE_U_KODE(J) = 'U389';                        00007550
                   J                   = J + 1;                         00007560
                END;                                                    00007570
                                                                        00007580
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'F'  THEN              00007590
                DO;                                                     00007600
                   TEKSTTYPE_U_KODE(J) = 'U383';                        00007610
                   J                   = J + 1;                         00007620
                END;                                                    00007630
                                                                        00007640
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'V'  THEN              00007650
                DO;                                                     00007660
                   TEKSTTYPE_U_KODE(J) = 'U392';                        00007670
                   J                   = J + 1;                         00007680
                END;                                                    00007690
                                                                        00007700
             IF (B02.YRKEHIST.YRKE11(IND,SISTE)     = 'U')  &           00007710
                (B02.DØD_AV_YRKESSKADE(IND)     = ' ')  THEN            00007720
                DO;                                                     00007730
                   TEKSTTYPE_U_KODE(J) = 'U390';                        00007740
                   J                   = J + 1;                         00007750
                END;                                                    00007760
                                                                        00007770
             IF (B02.YRKEHIST.YRKE11(IND,SISTE)     = 'E')  &           00007780
                (B02.DØD_AV_YRKESSKADE(IND)     = ' ')  THEN            00007790
                DO;                                                     00007800
                   TEKSTTYPE_U_KODE(J) = 'U394';                        00007810
                   J                   = J + 1;                         00007820
                END;                                                    00007830
                                                                        00007840
             IF (B02.YRKEHIST.YRKE11(IND,SISTE)     = 'S')  &           00007850
                (B02.DØD_AV_YRKESSKADE(IND)     = ' ')  THEN            00007860
                DO;                                                     00007870
                   TEKSTTYPE_U_KODE(J) = 'U381';                        00007880
                   J                   = J + 1;                         00007890
                END;                                                    00007900
                                                                        00007910
             IF B02.YRKEPENS.YPT_KODE(IND) = 'Y' THEN                   00007920
                                                                        00007930
  /*YS         'Y' = POENGBEREGNING ETTER YRKESKODE - PARAGR. 11-11*/   00007940
                                                                        00007950
                DO;                                                     00007960
                   TEKSTTYPE_U_KODE(J) = 'U374';                        00007970
                   J                   = J + 1;                         00007980
                END;                                                    00007990
                                                                        00008000
             IF B02.YRKEHIST.YRKE11(IND,SISTE) = 'M'  THEN              00008010
                DO;                                                     00008020
                   TEKSTTYPE_U_KODE(J) = 'U386';                        00008030
                   J                   = J + 1;                         00008040
                   TEKSTTYPE_U_KODE(J) = 'U387';                        00008050
                   J                   = J + 1;                         00008060
                END;                                                    00008070
                                                                        00008080
            IF (B02.YRKEHIST.YRKE11(IND,SISTE) = 'U'  !                 00008090
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'E'  !                 00008100
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'V') &                 00008110
                B01.YRKEPENS.YPT(IND) < B02.YRKEPENS.SPT(IND) THEN      00008120
                DO;                                                     00008130
                   TEKSTTYPE_U_KODE(J) = 'U378';                        00008140
                   J                   = J + 1;                         00008150
                END;                                                    00008160
                                                                        00008170
            IF (B02.YRKEHIST.YRKE11(IND,SISTE) = 'U'  !                 00008180
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'V'  !                 00008190
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'E'  !                 00008200
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'F'  !                 00008210
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'M') &                 00008220
                B02.YRKEPENS.TP    (IND) > 0    THEN                    00008230
                DO;                                                     00008240
                   TEKSTTYPE_U_KODE(J) = 'U364';                        00008250
                   J                   = J + 1;                         00008260
                END;                                                    00008270
                                                                        00008280
            IF (B02.YRKEHIST.YRKE11(IND,SISTE) = 'U'  !                 00008290
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'E'  !                 00008300
                B02.YRKEHIST.YRKE11(IND,SISTE) = 'V') &                 00008310
                B02.YRKEPENS.YPT_KODE(IND) = 'Y' THEN                   00008320
                DO;                                                     00008330
                   TEKSTTYPE_U_KODE(J) = 'U377';                        00008340
                   J                   = J + 1;                         00008350
                   TEKSTTYPE_U_KODE(J) = 'U391';                        00008360
                   J                   = J + 1;                         00008370
                END;                                                    00008380
                                                                        00008390
             IF B02.BUP_GARANTI   (IND,1) > B02.YPT(IND)   THEN         00008400
                DO;                                                     00008410
                   TEKSTTYPE_U_KODE(J) = 'U380';                        00008420
                   J                   = J + 1;                         00008430
                END;                                                    00008440
  /* HVIS DEN YRKESKADDE HAR ETTERLATTERETTIGHETER OG AVDØDE DØDE */    00008450
  /* FØR FYLTE 24 ÅR (UNGE DØDE) LAGT INN 10.92  JD               */    00008460
                                                                        00008470
            IF (B02.ETTEPENS.SPT_AVD(IND) = 3.30 &                      00008480
                B02.ETTEPENS.TP_BRUTTO(IND) > 0  &                      00008490
                B02.PENSJONSTYPE2   (IND) = 'E') THEN                   00008500
                DO;                                                     00008510
                   IF (UFØR_ALDER_DØD < 2001) THEN                      00008520
                     DO;                                                00008530
                        TEKSTTYPE_U_KODE(J) = 'U051';                   00008540
                        J                   = J + 1;                    00008550
                     END;                                               00008560
                    ELSE                                                00008570
                    IF (UFØR_ALDER_DØD > 2000 &                         00008580
                        UFØR_ALDER_DØD < 2101) THEN                     00008590
                       DO;                                              00008600
                         TEKSTTYPE_U_KODE(J) = 'U095';                  00008610
                         J                   = J + 1;                   00008620
                       END;                                             00008630
                    ELSE                                                00008640
                    IF (UFØR_ALDER_DØD > 2100 &                         00008650
                        UFØR_ALDER_DØD < 2201) THEN                     00008660
                       DO;                                              00008670
                         TEKSTTYPE_U_KODE(J) = 'U100';                  00008680
                         J                   = J + 1;                   00008690
                       END;                                             00008700
                    ELSE                                                00008710
                    IF (UFØR_ALDER_DØD > 2200 &                         00008720
                        UFØR_ALDER_DØD < 2401) THEN                     00008730
                       DO;                                              00008740
                         TEKSTTYPE_U_KODE(J) = 'U121';                  00008750
                         J                   = J + 1;                   00008760
                       END;                                             00008770
                    ELSE                                                00008780
                    IF (UFØR_ALDER_DØD > 2400 &                         00008790
                        UFØR_ALDER_DØD < 2601) THEN                     00008800
                       DO;                                              00008810
                         TEKSTTYPE_U_KODE(J) = 'U132';                  00008820
                         J                   = J + 1;                   00008830
                       END;                                             00008840
                 END;                                                   00008850
    /* TIL HIT UNGE DØDE JD 10.92   */                                  00008860
                                                                        00008870
     /*TESTI_ÅMDNG. TRUDE*/                                             00008880
    DCL SPT11   PIC '9.99';                                             00008890
    DCL SPT8    PIC '9.99';                                             00008900
        SPT11  = B02.UFØRPENS.SPT(IND);                                 00008910
        SPT8   = B02.YRKEPENS.YPT(IND);                                 00008920
    DCL KAP8_UFG PIC '999';                                             00008930
    DCL KAP11_UFG PIC '999';                                            00008940
    DCL KAP11_7   CHAR (1);                                             00008950
        KAP8_UFG      = B02.UFØRPENS.UFG(IND);                          00008960
        KAP11_UFG      = B02.YRKEPENS.YUG(IND);                         00008970
        KAP11_7 =                                                       00008980
                B02.YRKEHIST.KAP_11_7_UTLØST(IND,1);                    00008990
             IF B02.YRKEHIST.KAP_11_7_UTLØST(IND,1)   ^= 'J' &          00009000
               ( B02.YRKEPENS.YUG(IND) < B02.UFØRPENS.UFG(IND)) THEN    00009010
                DO;                                                     00009020
                   TEKSTTYPE_U_KODE(J) = 'U303';                        00009030
                   J                   = J + 1;                         00009040
                END;                                                    00009050
             IF (B02.YRKEPENS.TP(IND)  +                                00009060
                 B02.UFØRPENS.TP(IND)) < B02.ETTEPENS.TP_BRUTTO(IND) &  00009070
                 B02.PENSJONSTYPE2    (IND) = 'E'                    &  00009080
                 B02.DØD_AV_YRKESSKADE(IND) = 'E'                 THEN  00009090
                DO;                                                     00009100
                   TEKSTTYPE_U_KODE(J) = 'U337';                        00009110
                   J                   = J + 1;                         00009120
                END;                                                    00009130
                                                                        00009140
                                                                        00009150
 /* ***************************************************************** */00009160
 /* DØD AV YRKESSKADE                                                 */00009170
 /* ***************************************************************** */00009180
                                                                        00009190
               IF B02.DØD_AV_YRKESSKADE(IND) = 'E' !                    00009200
                  B02.DØD_AV_YRKESSKADE(IND) = 'Y' THEN                 00009210
                  DO;                                                   00009220
                                                                        00009230
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00009240
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00009250
                        DO;                                             00009260
                           TEKSTTYPE_U_KODE(J) = 'U320';                00009270
                           J                   = J + 1;                 00009280
                        END;                                            00009290
                                                                        00009300
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00009310
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00009320
                        DO;                                             00009330
                           TEKSTTYPE_U_KODE(J) = 'U321';                00009340
                           J                   = J + 1;                 00009350
                        END;                                            00009360
                                                                        00009370
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00009380
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00009390
                        DO;                                             00009400
                           TEKSTTYPE_U_KODE(J) = 'U322';                00009410
                           J                   = J + 1;                 00009420
                        END;                                            00009430
                                                                        00009440
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00009450
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00009460
                        DO;                                             00009470
                           TEKSTTYPE_U_KODE(J) = 'U325';                00009480
                           J                   = J + 1;                 00009490
                        END;                                            00009500
                                                                        00009510
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00009520
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00009530
                        DO;                                             00009540
                           TEKSTTYPE_U_KODE(J) = 'U326';                00009550
                           J                   = J + 1;                 00009560
                        END;                                            00009570
                                                                        00009580
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00009590
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00009600
                        DO;                                             00009610
                           TEKSTTYPE_U_KODE(J) = 'U327';                00009620
                           J                   = J + 1;                 00009630
                        END;                                            00009640
                                                                        00009650
                     IF B02.YRKEHIST.YRKE11(IND_EK,1) = 'A' THEN        00009660
                        DO;                                             00009670
                           TEKSTTYPE_U_KODE(J) = 'U366';                00009680
                           J                   = J + 1;                 00009690
                        END;                                            00009700
                                                                        00009710
                     IF (B02.YRKEHIST.YRKE11(IND_EK,1) = 'S' ) THEN     00009720
                        DO;                                             00009730
                           TEKSTTYPE_U_KODE(J) = 'U382';                00009740
                           J                   = J + 1;                 00009750
                        END;                                            00009760
                                                                        00009770
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00009780
                        (B02.YRKEPENS.YUG(IND_EK) < 100)       &        00009790
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00009800
                        DO;                                             00009810
                           TEKSTTYPE_U_KODE(J) = 'U328';                00009820
                           J                   = J + 1;                 00009830
                        END;                                            00009840
                                                                        00009850
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00009860
                        (B02.YRKEPENS.YUG(IND_EK) < 100 )      &        00009870
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00009880
                        DO;                                             00009890
                           TEKSTTYPE_U_KODE(J) = 'U329';                00009900
                           J                   = J + 1;                 00009910
                        END;                                            00009920
                                                                        00009930
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00009940
                        (B02.YRKEPENS.YUG(IND_EK) <  100)      &        00009950
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00009960
                        DO;                                             00009970
                           TEKSTTYPE_U_KODE(J) = 'U330';                00009980
                           J                   = J + 1;                 00009990
                        END;                                            00010000
                                                                        00010010
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00010020
                        (B02.POENGTILLEGG_KODE(IND) = ' ' ) THEN        00010030
                        DO;                                             00010040
                           TEKSTTYPE_U_KODE(J) = 'U331';                00010050
                           J                   = J + 1;                 00010060
                        END;                                            00010070
                                                                        00010080
                   END;                                                 00010090
          END;                                                          00010100
       WHEN('E','J')                                                    00010110
          DO;                                                           00010120
                                                                        00010130
 /* ***************************************************************** */00010140
 /* ETTERLATTEPENSJONISTER ELLER ETTERLATT FAMILIEPLEIER             */ 00010150
 /* ***************************************************************** */00010160
                                                                        00010170
             IF W_HENDELSE.GARANTITILLEGG_TP > 0 THEN                   00010180
                DO;                                                     00010190
                   TEKSTTYPE_U_KODE(J) = 'U108';                        00010200
                   J                   = J + 1;                         00010210
                END;                                                    00010220
                                                                        00010230
             IF B02.FORSI.GARANTITILLEGG_BARN(IND) > 0      !           00010240
                B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0   THEN        00010250
                DO;                                                     00010260
                   TEKSTTYPE_U_KODE(J) = 'U110';                        00010270
                   J                   = J + 1;                         00010280
                END;                                                    00010290
                                                                        00010300
                                                                        00010310
            IF (B02.DØD_AV_YRKESSKADE(IND) = 'E' !                      00010320
                B02.DØD_AV_YRKESSKADE(IND) = 'Y' ) THEN                 00010330
                    DO;                                                 00010340
                       TEKSTTYPE_U_KODE(J) = 'U361';                    00010350
                       J                   = J + 1;                     00010360
                    END;                                                00010370
             IF B02.PENSJONSTYPE2(IND) = 'O' THEN                       00010380
                DO;                                                     00010390
                   TEKSTTYPE_U_KODE(J) = 'U091';                        00010400
                   J = J + 1;                                           00010410
                END;                                                    00010420
             ELSE                                                       00010430
                IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 THEN                00010440
                   DO;                                                  00010450
                      TEKSTTYPE_U_KODE(J) = 'U090';                     00010460
                      J = J + 1;                                        00010470
                   END;                                                 00010480
                                                                        00010490
             IF B02.ETTEPENS.GP_NETTO (IND) ^=                          00010500
                B02.ETTEPENS.GP_BRUTTO(IND)        THEN                 00010510
                DO;                                                     00010520
                   IF B02.PENSJONSTYPE2(IND) = 'O' THEN                 00010530
                      DO;                                               00010540
                         TEKSTTYPE_U_KODE(J) = 'U016';                  00010550
                         J = J + 1;                                     00010560
                      END;                                              00010570
                   ELSE                                                 00010580
                      DO;                                               00010590
                         TEKSTTYPE_U_KODE(J) = 'U015';                  00010600
                         J = J + 1;                                     00010610
                      END;                                              00010620
                END;                                                    00010630
             ELSE                                                       00010640
                DO;                                                     00010650
                   IF B02.PENSJONSTYPE2(IND) = 'O' THEN                 00010660
                      DO;                                               00010670
                         TEKSTTYPE_U_KODE(J) = 'U018';                  00010680
                         J = J + 1;                                     00010690
                      END;                                              00010700
                   ELSE                                                 00010710
                      DO;                                               00010720
                         TEKSTTYPE_U_KODE(J) = 'U017';                  00010730
                         J = J + 1;                                     00010740
                      END;                                              00010750
                END;                                                    00010760
 /* TESTEN NEDENFOR ER FLYTTET  - HL 1195 :*/                           00010770
 /* ****                       IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0      00010780
                                  THEN                                  00010790
                                  DO                                    00010800
                                    IF B02.TT_ANV(IND) = 0 THEN         00010810
                                      DO                                00010820
                                        TEKSTTYPE_U_KODE(J) = 'U130'    00010830
                                        J = J + 1                       00010840
                                      END                               00010850
                                    ELSE                                00010860
                                      DO;                               00010870
                                        TEKSTTYPE_U_KODE(J) = 'U020'    00010880
                                        J = J + 1                       00010890
                                      END                               00010900
                                  END                                   00010910
  **** */                                                               00010920
            IF B02.BEREGN_FOLKETRYGD(IND_EK) ^= ' ' THEN                00010930
               CALL EØS_TEKSTER(IND_EK,IND);          /*EØS*/           00010940
          END;                                                          00010950
       WHEN('N')                                                        00010960
          DO;                                                           00010970
                                                                        00010980
 /* ***************************************************************** */00010990
 /* BARNEPENSJONIST EN AV FORELDRENE DØD                              */00011000
 /* ***************************************************************** */00011010
                                                                        00011020
              TEKSTTYPE_U_KODE(J) = 'U109';                             00011030
              J                   = J + 1;                              00011040
          END;                                                          00011050
       WHEN('B')                                                        00011060
          DO;                                                           00011070
                                                                        00011080
 /* ***************************************************************** */00011090
 /* BARNEPENSJONIST BEGGE FORELDRE DØD                                */00011100
 /* ***************************************************************** */00011110
                                                                        00011120
             IF B02.DØD_AV_YRKESSKADE(IND) = 'E'  THEN                  00011130
                DO;                                                     00011140
                   TEKSTTYPE_U_KODE(J) = 'U375';                        00011150
                   J                   = J + 1;                         00011160
                END;                                                    00011170
              ELSE                                                      00011180
                DO;                                                     00011190
                   TEKSTTYPE_U_KODE(J) = 'U075';                        00011200
                   J                   = J + 1;                         00011210
                END;                                                    00011220
                                                                        00011230
               IF (UFØR_ALDER < 2001) &                                 00011240
                 (B02.BUP_GARANTI(IND_EK,1) > 0) &                      00011250
                 (B02.BUP_GARANTI(IND_EK,1) =                           00011260
                  B02.ETTEPENS.SPT_AVD(IND)) THEN                       00011270
                  DO;                                                   00011280
                     TEKSTTYPE_U_KODE(J) = 'U051';                      00011290
                     J                   = J + 1;                       00011300
                  END;                                                  00011310
               ELSE                                                     00011320
                                                                        00011330
 /*ENDRET 25.3.87 HL : FRA 2001 TIL 2000 I LINJEN NEDENFOR */           00011340
                                                                        00011350
                    IF (UFØR_ALDER > 2000  &                            00011360
                        UFØR_ALDER < 2101) &                            00011370
                       (B02.BUP_GARANTI(IND_EK,1) > 0) &                00011380
                       (B02.BUP_GARANTI(IND_EK,1) =                     00011390
                       B02.ETTEPENS.SPT_AVD(IND)) THEN                  00011400
                       DO;                                              00011410
                         TEKSTTYPE_U_KODE(J) = 'U095';                  00011420
                         J                   = J + 1;                   00011430
                       END;                                             00011440
                    ELSE                                                00011450
                       IF B02.ETTEBARN.SPT_MOR(IND) > 0 !               00011460
                          B02.ETTEBARN.SPT_FAR(IND) > 0 THEN            00011470
                          DO;                                           00011480
                             TEKSTTYPE_U_KODE(J) = 'U047';              00011490
                             J                   = J + 1;               00011500
                          END;                                          00011510
          END;                                                          00011520
       OTHERWISE;                                                       00011530
    END;  /*SELECT*/                                                    00011540
                                                                        00011550
                                                                        00011560
    IF B02.BEREGN_FOLKETRYGD(IND) = ' ' THEN      /*HL 1194*/           00011570
                                                                        00011580
    SELECT(B02.PENSJONSTYPE1(IND));                                     00011590
                                                                        00011600
 /* ***************************************************************** */00011610
 /* INNSETTING AV TEKSTKODER FOR PERSONER SOM AV EN ELLER ANNEN GRUNN */00011620
 /* FÅR REDUSERT GRUNNPENSJON.                                        */00011630
 /* ***************************************************************** */00011640
                                                                        00011650
       WHEN('A')                                                        00011660
          DO;                                                           00011670
                                                                        00011680
 /* ***************************************************************** */00011690
 /* ALDERSPENSJON                                                     */00011700
 /* ***************************************************************** */00011710
                                                                        00011720
             IF B02.ALDERSP.APD(IND) = 100 THEN                         00011730
                DO;                                                     00011740
                   IF B02.PENSJONSTYPE2(IND) ^= 'S' THEN                00011750
                      DO;                                               00011760
                         IF B02.TT_ANV(IND) < 40 THEN                   00011770
                            DO;                                         00011780
                 /*JD 8.90*/   IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 !    00011790
  /*ENDRET TIL ! 0891 TRUDE*/     B02.ALDERSP .GP       (IND) ^= 0      00011800
  /*TEKST ANG TT RED KOM IKKE*/   THEN                                  00011810
                                  DO;                                   00011820
                                     TEKSTTYPE_U_KODE(J) = 'U020';      00011830
                                     J                   = J + 1;       00011840
                                  END;                                  00011850
    /*U39 OG U41 KOMPTILL*/    IF B02.ALDERSP.ST(IND) > 0 THEN          00011860
    /*FJERNET 5.91 JD    */       DO;                                   00011870
                                     TEKSTTYPE_U_KODE(J) = 'U040';      00011880
                                     J = J + 1;                         00011890
                                  END;                                  00011900
                            END;                                        00011910
                      END;                                              00011920
                   ELSE     /*PT2 ER DA = 'S' */                        00011930
                      DO;                                               00011940
                         IF B02.TT_ANV(IND) = 40 THEN                   00011950
                            DO;                                         00011960
                                /*2.2.87 J.D */                         00011970
 /*8.1.88-HL               IF B02.PENSJONSTYPE1(IND_EK) ^= 'U' &    */  00011980
 /*FRAPP 556                    B02.ALDERSP.APD  (IND_EK) ^= 0 THEN */  00011990
                                  TEKSTTYPE_U_KODE(J) = 'U021';         00012000
                                  J                = J + 1;             00012010
                                   /* HIT J.D 2.2.87 */                 00012020
                               IF  (B02.TT_FØR_1967(IND) +              00012030
                                   (B02.TT_ETTER_1966(IND) +11) / 12 +  00012040
                                   (B02.TT_FRAMT (IND) +11) / 12 +      00012050
                  /*JD 4.91*/       B02.TT_16_66(IND)  +                00012060
                                    B02.TT_67_TIL_70 (IND))             00012070
                                    < 40 THEN                           00012080
                                    DO;                                 00012090
                                       TEKSTTYPE_U_KODE(J) = 'U022';    00012100
                                       J               = J + 1;         00012110
                                    END;                                00012120
          /* JD 11.92*/           TEKSTTYPE_U_KODE(J) = 'U040';         00012130
          /* JD 11.92*/           J                = J + 1;             00012140
                            END;                                        00012150
                         ELSE                                           00012160
                            DO;                                         00012170
                    /*JD 8.90*/IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 !    00012180
  /*ENDRES TIL ! TRUDE 0891*/     B02.ALDERSP .GP       (IND) ^= 0      00012190
  /*TEKST ANG TT RED KOM IKKE*/   THEN                                  00012200
                                  DO;                                   00012210
                                     TEKSTTYPE_U_KODE(J) = 'U020';      00012220
                                     J                   = J + 1;       00012230
                                  END;                                  00012240
     /* U39 OG U41 KOMPTILL*/  IF B02.ALDERSP.ST(IND) > 0 THEN          00012250
     /* FJERNET 5.91 JD    */     DO;                                   00012260
                                     TEKSTTYPE_U_KODE(J) = 'U040';      00012270
                                     J                   = J + 1;       00012280
                                  END;                                  00012290
                            END;                                        00012300
                      END;                                              00012310
             END;                                                       00012320
          ELSE                                                          00012330
             DO;                                                        00012340
                IF B02.PENSJONSTYPE2(IND) = 'S' THEN                    00012350
                   DO;                                                  00012360
                      TEKSTTYPE_U_KODE(J) = 'U029';                     00012370
                      J = J + 1;                                        00012380
                      IF B02.TT_ANV(IND) < 40 THEN                      00012390
                         DO;                                            00012400
                            TEKSTTYPE_U_KODE(J) = 'U030';               00012410
                            J = J + 1;                                  00012420
                            IF  (B02.TT_FØR_1967(IND) +                 00012430
                                (B02.TT_ETTER_1966(IND) +11) / 12 +     00012440
                                (B02.TT_FRAMT (IND) +11) / 12 +         00012450
             /* JD 4.91*/        B02.TT_16_66 (IND)   +                 00012460
                                 B02.TT_67_TIL_70 (IND)) <              00012470
                                 B02.TT_ANV(IND) THEN                   00012480
                                 DO;                                    00012490
                                    TEKSTTYPE_U_KODE(J) = 'U031';       00012500
                                    J = J + 1;                          00012510
                                 END;                                   00012520
                         END;                                           00012530
                   END;                                                 00012540
                ELSE                                                    00012550
                   DO;                                                  00012560
                      IF B02.TT_ANV(IND) < 40 THEN                      00012570
                         DO;                                            00012580
                            TEKSTTYPE_U_KODE(J) = 'U074';               00012590
                            J = J + 1;                                  00012600
                         /* IF  (B02.TT_FØR_1967(IND) +                 00012610
                                (B02.TT_ETTER_1966(IND) +11) / 12 +     00012620
                                (B02.TT_FRAMT (IND) +11) / 12 +         00012630
                                 B02.TT_16_66 (IND)   +                 00012640
                                 B02.TT_67_TIL_70 (IND)) <              00012650
                                 B02.TT_ANV(IND) THEN                   00012660
                                 DO;                                    00012670
                                    TEKSTTYPE_U_KODE(J) = 'U032'        00012680
                                    J = J + 1                           00012690
                                 END  */                                00012700
                         END;                                           00012710
                   END;                                                 00012720
                                                                        00012730
                IF B02.TT_ANV(IND) < 40 THEN                            00012740
                   DO;                                                  00012750
     /* U39 U41 KOMP*/IF B02.ALDERSP.ST(IND) > 0 THEN                   00012760
     /*FJERNET 5.91 JD*/ DO;                                            00012770
                            TEKSTTYPE_U_KODE(J) = 'U040';               00012780
                            J = J + 1;                                  00012790
                         END;                                           00012800
                   END;                                                 00012810
                END;                                                    00012820
          END;                                                          00012830
       WHEN('U')                                                        00012840
          DO;                                                           00012850
                                                                        00012860
 /* ***************************************************************** */00012870
 /* UFØREPENSJON                                                      */00012880
 /* ***************************************************************** */00012890
                                                                        00012900
             IF B02.UFØRPENS.UFG(IND) = 100 THEN                        00012910
                DO;                                                     00012920
                   IF B02.PENSJONSTYPE2(IND) ^= 'S' THEN                00012930
                      DO;                                               00012940
                         IF B02.TT_ANV(IND) < 40 THEN                   00012950
                            DO;                                         00012960
                    /*JD 8.90*/IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 !    00012970
                                  B02.UFØRPENS.GP       (IND) ^= 0      00012980
                                  THEN                                  00012990
                                  DO;                                   00013000
                                     TEKSTTYPE_U_KODE(J) = 'U020';      00013010
                                     J                   = J + 1;       00013020
                                  END;                                  00013030
     /*U39 OG U41 KOMPTILL*/   IF B02.UFØRPENS.ST(IND) > 0 THEN         00013040
     /*FJERNET 5.91  JD   */      DO;                                   00013050
                                     TEKSTTYPE_U_KODE(J) = 'U040';      00013060
                                     J = J + 1;                         00013070
                                  END;                                  00013080
                            END;                                        00013090
                      END;                                              00013100
                   ELSE                                                 00013110
                      DO;                                               00013120
                         IF B02.TT_ANV(IND) = 40 THEN                   00013130
                            DO;                                         00013140
                               TEKSTTYPE_U_KODE(J) = 'U021';            00013150
                               J           = J + 1;                     00013160
                                                                        00013170
                               IF  (B02.TT_FØR_1967(IND) +              00013180
                                   (B02.TT_ETTER_1966(IND) +11) / 12 +  00013190
                                   (B02.TT_FRAMT (IND) +11) / 12 +      00013200
                /* JD 4.91 */       B02.TT_16_66 (IND)   +              00013210
                                    B02.TT_67_TIL_70 (IND))             00013220
                                   < 40 THEN                            00013230
                                    DO;                                 00013240
                                       TEKSTTYPE_U_KODE(J) = 'U022';    00013250
                                       J           = J + 1;             00013260
                                    END;                                00013270
     /*HL 0397*/               IF B02.UFØRPENS.ST(IND) > 0 THEN         00013280
                                  DO;                                   00013290
                                     TEKSTTYPE_U_KODE(J) = 'U040';      00013300
                                     J = J + 1;                         00013310
                                  END;                                  00013320
                            END;                                        00013330
                         ELSE                                           00013340
                            DO;                                         00013350
                    /*JD 8.90*/IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 !    00013360
                                  B02.UFØRPENS.GP       (IND) ^= 0      00013370
                                  THEN                                  00013380
                                  DO;                                   00013390
                                     TEKSTTYPE_U_KODE(J) = 'U020';      00013400
                                     J                   = J + 1;       00013410
                                  END;                                  00013420
       /*U39 OG U41 KOMPTILL*/ IF B02.UFØRPENS.ST(IND) > 0 THEN         00013430
       /* FJERNET 5.91 JD   */    DO;                                   00013440
                                     TEKSTTYPE_U_KODE(J) = 'U040';      00013450
                                     J = J + 1;                         00013460
                                  END;                                  00013470
                            END;                                        00013480
                      END;                                              00013490
             END;                                                       00013500
          ELSE                                                          00013510
             DO;                                                        00013520
                IF B02.PENSJONSTYPE2(IND) = 'S' THEN                    00013530
                   DO;                                                  00013540
                      TEKSTTYPE_U_KODE(J) = 'U024';                     00013550
                      J = J + 1;                                        00013560
                      IF B02.TT_ANV(IND) < 40 THEN                      00013570
                         DO;                                            00013580
                            TEKSTTYPE_U_KODE(J) = 'U025';               00013590
                            J = J + 1;                                  00013600
                            IF  (B02.TT_FØR_1967(IND) +                 00013610
                                (B02.TT_ETTER_1966(IND) +11) / 12 +     00013620
                                (B02.TT_FRAMT (IND) +11) / 12 +         00013630
                /*JD 4.91*/      B02.TT_16_66 (IND)   +                 00013640
                                 B02.TT_67_TIL_70 (IND)) <              00013650
                                 B02.TT_ANV(IND) THEN                   00013660
                                 DO;                                    00013670
                                    TEKSTTYPE_U_KODE(J) = 'U026';       00013680
                                    J = J + 1;                          00013690
                                 END;                                   00013700
                         END;                                           00013710
                   END;                                                 00013720
                ELSE                                                    00013730
                   DO;                                                  00013740
                      IF B02.TT_ANV(IND) < 40 THEN                      00013750
                         DO;                                            00013760
                /*JD 5.91*/ TEKSTTYPE_U_KODE(J) = 'U020';               00013770
                            J = J + 1;                                  00013780
                /*JD 8.90*/IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0 &        00013790
                              B02.UFØRPENS.GP       (IND) ^= 0  THEN    00013800
                              DO;                                       00013810
                                 TEKSTTYPE_U_KODE(J) = 'U073';          00013820
                                 J = J + 1;                             00013830
                              END;                                      00013840
                            IF  (B02.TT_FØR_1967(IND) +                 00013850
                /*JD 4.91*/      B02.TT_16_66   (IND) +                 00013860
                                (B02.TT_ETTER_1966(IND) +11) / 12 +     00013870
                                (B02.TT_FRAMT (IND) +11) / 12 +         00013880
                                 B02.TT_67_TIL_70 (IND)) <              00013890
                                 B02.TT_ANV(IND) &                      00013900
               /*JD 7.94*/       B02.SIVILSTAND(IND) ='E' THEN          00013910
                                 DO;                                    00013920
                                    TEKSTTYPE_U_KODE(J) = 'U027';       00013930
                                    J = J + 1;                          00013940
                                 END;                                   00013950
                         END;                                           00013960
                   END;                                                 00013970
                IF B02.TT_ANV(IND) < 40 THEN                            00013980
                   DO;                                                  00013990
    /*U39,U41 KOMP*/  IF B02.UFØRPENS.ST(IND) > 0 THEN                  00014000
    /*FJERNET 5.91 JD */ DO;                                            00014010
                            TEKSTTYPE_U_KODE(J) = 'U040';               00014020
                            J = J + 1;                                  00014030
                         END;                                           00014040
                   END;                                                 00014050
              END;                                                      00014060
          END;                                                          00014070
       WHEN('Y')                                                        00014080
          DO;                                                           00014090
                                                                        00014100
 /* ***************************************************************** */00014110
 /* YRKESSKADE KAPITEL 11                                             */00014120
 /* ***************************************************************** */00014130
                                                                        00014140
             IF B02.TT_ANV(IND) < 40    THEN                            00014150
                DO;                                                     00014160
                   IF (B02.PENSJONSTYPE2(IND) ^= 'S'  &                 00014170
                       B02.PENSJONSTYPE2(IND) ^= 'E') &                 00014180
                      (B02.UFØRPENS.UFG(IND) ^= B02.YRKEPENS.YUG(IND))  00014190
                      THEN                                              00014200
                      DO;                                               00014210
                                  TEKSTTYPE_U_KODE(J) = 'U305';         00014220
                                  J                   = J + 1;          00014230
                      END;                                              00014240
                   IF B02.PENSJONSTYPE2(IND)  = 'S'  &                  00014250
                      B02.UFØRPENS.UFG(IND) ^= B02.YRKEPENS.YUG(IND)    00014260
                      THEN                                              00014270
                      DO;                                               00014280
                                  TEKSTTYPE_U_KODE(J) = 'U306';         00014290
                                  J                   = J + 1;          00014300
                      END;                                              00014310
                   IF B02.PENSJONSTYPE2(IND)  = 'E'  &                  00014320
                      B01.UFØRPENS.UFG(IND) ^= B01.YRKEPENS.YUG(IND)    00014330
                      THEN                                              00014340
                      DO;                                               00014350
                                  TEKSTTYPE_U_KODE(J) = 'U307';         00014360
                                  J                   = J + 1;          00014370
                      END;                                              00014380
                END;                                                    00014390
          END;                                                          00014400
       WHEN('E','J')                                                    00014410
          DO;                                                           00014420
                                                                        00014430
 /* ***************************************************************** */00014440
 /* ETTERLATT EKTEFELLE OG FAMILIEPLEIER                              */00014450
 /* ***************************************************************** */00014460
                                                                        00014470
             IF B02.PENSJONSTYPE2(IND) = 'O' THEN                       00014480
                                                                        00014490
                DO;                                                     00014500
                   IF B02.ETTEPENS.GP_NETTO(IND) <                      00014510
                      B02.ETTEPENS.GP_BRUTTO(IND)     THEN              00014520
                                                                        00014530
                      DO;                                               00014540
 /*1195 HL */            IF W_HENDELSE.TT   < 40 THEN                   00014550
                                                                        00014560
                            DO;                                         00014570
                               TEKSTTYPE_U_KODE(J) = 'U037';            00014580
                               J = J + 1;                               00014590
 /* FJERNET 1195 HL :                                                   00014600
                               IF  (B02.TT_FØR_1967(IND) +              00014610
                                   (B02.TT_ETTER_1966(IND) +11) / 12 +  00014620
                                   (B02.TT_FRAMT (IND) +11) / 12 +      00014630
                                    B02.TT_16_66 (IND)   +              00014640
                                    B02.TT_67_TIL_70 (IND)) <           00014650
                                    B02.TT_ANV(IND) THEN                00014660
                                    DO                                  00014670
                                       TEKSTTYPE_U_KODE(J) = 'U038'     00014680
                                       J = J + 1                        00014690
                                    END                                 00014700
    HIT HL */                                                           00014710
                            END;                                        00014720
                                                                        00014730
                         ELSE                                           00014740
                                                                        00014750
                            DO;                                         00014760
                               TEKSTTYPE_U_KODE(J) = 'U036';            00014770
                               J = J + 1;                               00014780
                            END;                                        00014790
                      END;                                              00014800
                                                                        00014810
                   ELSE                                                 00014820
                                                                        00014830
 /*1195 HL */         IF W_HENDELSE.TT   < 40 THEN                      00014840
                                                                        00014850
                         DO;                                            00014860
                            TEKSTTYPE_U_KODE(J) = 'U082';               00014870
                            J = J + 1;                                  00014880
 /*FJERNET 1195 HL                                                      00014890
                            IF  (B02.TT_FØR_1967(IND) +                 00014900
                                (B02.TT_ETTER_1966(IND) +11) / 12 +     00014910
                                (B02.TT_FRAMT (IND) +11) / 12 +         00014920
                                 B02.TT_16_66 (IND)   +                 00014930
                                 B02.TT_67_TIL_70 (IND)) <              00014940
                                 B02.TT_ANV(IND) THEN                   00014950
                                 DO                                     00014960
                                    TEKSTTYPE_U_KODE(J) = 'U083'        00014970
                                    J = J + 1                           00014980
                                 END                                    00014990
  HIT HL */                                                             00015000
                         END;                                           00015010
                                                                        00015020
                END;                                                    00015030
                                                                        00015040
             ELSE                                                       00015050
                                                                        00015060
                DO;                                                     00015070
                   IF B02.ETTEPENS.GP_NETTO(IND) <                      00015080
                      B02.ETTEPENS.GP_BRUTTO(IND)     THEN              00015090
                                                                        00015100
                      DO;                                               00015110
  /*1195 HL*/            IF W_HENDELSE.TT   < 40 THEN                   00015120
                                                                        00015130
                            DO;                                         00015140
 /* U035 LAGT INN IGJEN JD 31.01.96 */                                  00015150
                               IF   B02.TT_ANV(IND) >                   00015160
                                    B02.TT_ANV(IND_EK) THEN             00015170
                                    DO;                                 00015180
                                       TEKSTTYPE_U_KODE(J) = 'U034';    00015190
                                       J = J + 1;                       00015200
                                    END;                                00015210
                                ELSE                                    00015220
                                   DO;                                  00015230
                                     TEKSTTYPE_U_KODE(J) = 'U035';      00015240
                                     J = J + 1;                         00015250
                                   END;                                 00015260
                                                                        00015270
                            END;                                        00015280
                                                                        00015290
                         ELSE                                           00015300
                                                                        00015310
                            DO;                                         00015320
                               TEKSTTYPE_U_KODE(J) = 'U033';            00015330
                               J = J + 1;                               00015340
                            END;                                        00015350
                      END;                                              00015360
                                                                        00015370
                   ELSE                                                 00015380
                                                                        00015390
 /*1195 HL*/         IF W_HENDELSE.TT   < 40 THEN                       00015400
                                                                        00015410
                       DO;                                              00015420
                         IF (B02.YRKEPENS.YUG(IND_EK) > 0   &           00015430
           /*JD 8.90*/      B02.YRKEPENS.YUG(IND_EK) < 100)             00015440
                            THEN                                        00015450
                            DO;                                         00015460
                               TEKSTTYPE_U_KODE(J) = 'U308';            00015470
                               J                   = J + 1;             00015480
                            END;                                        00015490
                         ELSE                                           00015500
                            DO;                                         00015510
 /*TEST FLYTTET HIT :*/                                                 00015520
                               IF B02.ETTEPENS.GP_BRUTTO(IND) ^= 0      00015530
                                  THEN                                  00015540
                                  DO;                                   00015550
                                    IF B02.TT_ANV(IND) = 0 THEN         00015560
                                      DO;                               00015570
                                        TEKSTTYPE_U_KODE(J) = 'U130';   00015580
                                        J = J + 1;                      00015590
                                      END;                              00015600
                                    ELSE                                00015610
                                      DO;                               00015620
                                         IF B02.TT_ANV(IND) >           00015630
                                            B02.TT_ANV(IND_EK) THEN     00015640
                                            DO;                         00015650
                                        TEKSTTYPE_U_KODE(J) = 'U020';   00015660
                                        J = J + 1;                      00015670
                                            END;                        00015680
                                         ELSE                           00015690
                                            DO;                         00015700
                                        TEKSTTYPE_U_KODE(J) = 'U032';   00015710
                                        J = J + 1;                      00015720
                                            END;                        00015730
                                      END;                              00015740
                                  END;                                  00015750
  /*HIT 1195 HL*/                                                       00015760
                                                                        00015770
    /* FJERNET 1195 HL:       IF  (B02.TT_FØR_1967(IND) +               00015780
                                   B02.TT_16_66(IND) +                  00015790
                                  (B02.TT_ETTER_1966(IND) +11) / 12 +   00015800
                                  (B02.TT_FRAMT (IND) +11) / 12 +       00015810
                                   B02.TT_67_TIL_70 (IND)) <            00015820
                                   B02.TT_ANV(IND) THEN                 00015830
                                   DO                                   00015840
                                     TEKSTTYPE_U_KODE(J) = 'U081'       00015850
                                     J = J + 1                          00015860
                                   END                                  00015870
   ***** HIT HL */                                                      00015880
                            END;                                        00015890
                       END;                                             00015900
                                                                        00015910
                END;                                                    00015920
                                                                        00015930
                                                                        00015940
 /*HL*/      IF W_HENDELSE.TT   < 40 THEN                               00015950
                                                                        00015960
                DO;                                                     00015970
                   IF B02.ETTEPENS.ST(IND) > 0 THEN                     00015980
           /* U39 OG U41 KOMPTILL FJERNET 5.91 JD */                    00015990
                      DO;                                               00016000
                         TEKSTTYPE_U_KODE(J) = 'U040';                  00016010
                                                                        00016020
                         J = J + 1;                                     00016030
                      END;                                              00016040
                                                                        00016050
                END;                                                    00016060
                                                                        00016070
          END;                                                          00016080
       WHEN('B')                                                        00016090
          DO;                                                           00016100
                                                                        00016110
 /* ***************************************************************** */00016120
 /* FORELDRELØSE BARN     (  12.6 85 J.D )                            */00016130
 /* ***************************************************************** */00016140
                                                                        00016150
               IF B02.TT_ANV(IND) < 40 THEN                             00016160
                  DO;                                                   00016170
                     TEKSTTYPE_U_KODE(J) = 'U020';                      00016180
                     J                   = J + 1;                       00016190
    /*U39 U41 KOMP*/ IF B02.ETTEBARN.ST(IND) > 0 THEN                   00016200
    /*FJERNET 5.91 JD*/ DO;                                             00016210
                           TEKSTTYPE_U_KODE(J) = 'U040';                00016220
                              J = J + 1;                                00016230
                        END;                                            00016240
                  END;                                                  00016250
          END;                                                          00016260
       OTHERWISE;                                                       00016270
    END; /*SELECT*/                                                     00016280
                                                                        00016290
 /* ***************************************************************** */00016300
 /* HVIS INNVILGET REDUSERT BARNETILLEGG                              */00016310
 /* ***************************************************************** */00016320
                                                                        00016330
    IF (B02.PENSJONSTYPE1(IND) = 'A' !                                  00016340
        B02.PENSJONSTYPE1(IND) = 'U') &                                 00016350
        W_HENDELSE.ANT_BT_REDUSERT > 0 THEN                             00016360
        DO;                                                             00016370
           TEKSTTYPE_U_KODE(J) = 'U098';                                00016380
           J                   = J + 1;                                 00016390
        END;                                                            00016400
                                                                        00016410
    IF B02.ALDERSP.TP (IND) > 0 !                                       00016420
       B02.UFØRPENS.TP(IND) > 0 !                                       00016430
       B02.YRKEPENS.TP(IND) > 0 !                                       00016440
       B02.ETTEPENS.TP_BRUTTO(IND) > 0 !                                00016450
       B02.ETTEBARN.TP(IND) > 0  THEN                                   00016460
       DO;                                                              00016470
                                                                        00016480
 /* ***************************************************************** */00016490
 /* TEKSTER VED TILLEGGSPENSJON                                       */00016500
 /* ***************************************************************** */00016510
                                                                        00016520
          SELECT(B02.PENSJONSTYPE1(IND));                               00016530
             WHEN('A')                                                  00016540
              DO;                                                       00016550
                                                                        00016560
 /* ***************************************************************** */00016570
 /* ALDERPENSJON                                                      */00016580
 /* ***************************************************************** */00016590
                                                                        00016600
                 IF B02.YRKEPENS.YUG(IND) > 0 THEN                      00016610
                    DO;                                                 00016620
                       TEKSTTYPE_U_KODE(J) = 'U354';                    00016630
                       J                   = J + 1;                     00016640
                    END;                                                00016650
                                                                        00016660
                                                                        00016670
 /* ***************************************************************** */00016680
 /* DØD AV YRKESSKADE                                                 */00016690
 /* ***************************************************************** */00016700
                                                                        00016710
               IF B02.DØD_AV_YRKESSKADE(IND) = 'E' !                    00016720
                  B02.DØD_AV_YRKESSKADE(IND) = 'Y' THEN                 00016730
                  DO;                                                   00016740
                                                                        00016750
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00016760
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00016770
                        DO;                                             00016780
                           TEKSTTYPE_U_KODE(J) = 'U320';                00016790
                           J                   = J + 1;                 00016800
                        END;                                            00016810
                                                                        00016820
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00016830
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00016840
                        DO;                                             00016850
                           TEKSTTYPE_U_KODE(J) = 'U321';                00016860
                           J                   = J + 1;                 00016870
                        END;                                            00016880
                                                                        00016890
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00016900
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00016910
                        DO;                                             00016920
                           TEKSTTYPE_U_KODE(J) = 'U322';                00016930
                           J                   = J + 1;                 00016940
                        END;                                            00016950
                                                                        00016960
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00016970
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00016980
                        DO;                                             00016990
                           TEKSTTYPE_U_KODE(J) = 'U325';                00017000
                           J                   = J + 1;                 00017010
                        END;                                            00017020
                                                                        00017030
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00017040
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00017050
                        DO;                                             00017060
                           TEKSTTYPE_U_KODE(J) = 'U326';                00017070
                           J                   = J + 1;                 00017080
                        END;                                            00017090
                                                                        00017100
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00017110
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00017120
                        DO;                                             00017130
                           TEKSTTYPE_U_KODE(J) = 'U327';                00017140
                           J                   = J + 1;                 00017150
                        END;                                            00017160
                                                                        00017170
                     IF B02.YRKEHIST.YRKE11(IND_EK,1) = 'A' THEN        00017180
                        DO;                                             00017190
                           TEKSTTYPE_U_KODE(J) = 'U366';                00017200
                           J                   = J + 1;                 00017210
                        END;                                            00017220
                                                                        00017230
                     IF (B02.YRKEHIST.YRKE11(IND_EK,1) = 'S' ) THEN     00017240
                        DO;                                             00017250
                           TEKSTTYPE_U_KODE(J) = 'U382';                00017260
                           J                   = J + 1;                 00017270
                        END;                                            00017280
                                                                        00017290
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00017300
                        (B02.YRKEPENS.YUG(IND_EK) < 100)       &        00017310
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00017320
                        DO;                                             00017330
                           TEKSTTYPE_U_KODE(J) = 'U328';                00017340
                           J                   = J + 1;                 00017350
                        END;                                            00017360
                                                                        00017370
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00017380
                        (B02.YRKEPENS.YUG(IND_EK)  < 100)      &        00017390
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00017400
                        DO;                                             00017410
                           TEKSTTYPE_U_KODE(J) = 'U329';                00017420
                           J                   = J + 1;                 00017430
                        END;                                            00017440
                                                                        00017450
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00017460
                        (B02.YRKEPENS.YUG(IND_EK)   < 100)     &        00017470
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00017480
                        DO;                                             00017490
                           TEKSTTYPE_U_KODE(J) = 'U330';                00017500
                           J                   = J + 1;                 00017510
                        END;                                            00017520
                                                                        00017530
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00017540
                        (B02.POENGTILLEGG_KODE(IND) = ' ' ) THEN        00017550
                        DO;                                             00017560
                           TEKSTTYPE_U_KODE(J) = 'U331';                00017570
                           J                   = J + 1;                 00017580
                        END;                                            00017590
                                                                        00017600
                   END;                                                 00017610
                 IF B02.PENSJONSTYPE2(IND) = 'S' THEN                   00017620
                    DO;                                                 00017630
                    IF B02.TP_GAR_KODE(IND) = 'E' THEN                  00017640
                      DO;                                               00017650
                         IF F_AAR < 1925 THEN                           00017660
                           DO;                                          00017670
                             TEKSTTYPE_U_KODE(J) = 'U104';              00017680
                             J                   = J + 1;               00017690
                           END;                                         00017700
                         ELSE                                           00017710
                         IF (F_AAR = 1925) THEN                         00017720
                           DO;                                          00017730
                             TEKSTTYPE_U_KODE(J) = 'U104';              00017740
                             J                   = J + 1;               00017750
                             TEKSTTYPE_U_KODE(J) = 'U105';              00017760
                             J                   = J + 1;               00017770
                           END;                                         00017780
                         ELSE                                           00017790
                         IF F_AAR > 1925      &                         00017800
  /*TS 110992  DIV_PARAM_OMR.U_TEXT_KODE = 'F'  THEN       */           00017810
  /*HL 060397*/             UFØR_ALDER < 2201            THEN           00017820
                           DO;                                          00017830
                             TEKSTTYPE_U_KODE(J) = 'U104';              00017840
                             J                   = J + 1;               00017850
                             TEKSTTYPE_U_KODE(J) = 'U105';              00017860
                             J                   = J + 1;               00017870
                             TEKSTTYPE_U_KODE(J) = 'U116';              00017880
                             J                   = J + 1;               00017890
                             TEKSTTYPE_U_KODE(J) = 'U126';              00017900
                             J                   = J + 1;               00017910
                             IF F_AAR > 1930      THEN                  00017920
                             TEKSTTYPE_U_KODE(J) = 'U127';              00017930
                             J                   = J + 1;               00017940
                           END;                                         00017950
                         ELSE                                           00017960
                         IF UFØR_ALDER < 2401 THEN                      00017970
                           DO;                                          00017980
                             TEKSTTYPE_U_KODE(J) = 'U125';              00017990
                             J                   = J + 1;               00018000
                             IF F_AAR > 1930      THEN                  00018010
                             TEKSTTYPE_U_KODE(J) = 'U127';              00018020
                             J                   = J + 1;               00018030
                           END;                                         00018040
                         ELSE                                           00018050
                         IF UFØR_ALDER < 2601 THEN                      00018060
                           DO;                                          00018070
                             TEKSTTYPE_U_KODE(J) = 'U133';              00018080
                             J                   = J + 1;               00018090
                           END;                                         00018100
                         IF B02.TT_ANV(IND) < 40  THEN                  00018110
                           DO;                                          00018120
                             TEKSTTYPE_U_KODE(J) = 'U107';              00018130
                             J                   = J + 1;               00018140
                           END;                                         00018150
                      END;                                              00018160
                    ELSE                                                00018170
                       IF B02.ALDERSP.TP(IND_EK) > 0 !                  00018180
                          B02.YRKEPENS.TP(IND_EK) > 0 !                 00018190
                          B02.UFØRPENS.TP(IND_EK) > 0 THEN              00018200
                          DO;                                           00018210
                                                                        00018220
 /*ENDRET 25.3.87 HL : NYTT FELTNAVN ER POENGTILLEGG_KODE */            00018230
                                                                        00018240
                             IF B02.POENGTILLEGG_KODE(IND) = 'B'   &    00018250
                                B02.YPT_KODE(IND)          = ' ' THEN   00018260
                                     TEKSTTYPE_U_KODE(J) = 'U045';      00018270
                             ELSE                                       00018280
                                                                        00018290
                             IF B02.POENGTILLEGG_KODE(IND) = 'A'    &   00018300
                                B02.YPT_KODE(IND)          = ' ' THEN   00018310
                                                                        00018320
 /*HIT 25.3.87 HL */                                                    00018330
                                                                        00018340
                                    TEKSTTYPE_U_KODE(J) = 'U046';       00018350
                                                                        00018360
                             ELSE                                       00018370
                                    TEKSTTYPE_U_KODE(J) = 'U047';       00018380
                                                                        00018390
                             J = J + 1;                                 00018400
                          END;                                          00018410
                       ELSE                                             00018420
                          DO;                                           00018430
                             TEKSTTYPE_U_KODE(J)  = 'U047';             00018440
                             J                    = J + 1;              00018450
                          END;                                          00018460
                    END;                                                00018470
                                                                        00018480
                 ELSE                                                   00018490
                                                                        00018500
                    DO;                                                 00018510
                       IF B02.PENSJONSTYPE2(IND) = 'E' &                00018520
                                                                        00018530
  /* ENDRET 28.1.86 - HL - DET SKAL OGSå TESTES På SIVILSTAND = 'S' */  00018540
                                                                        00018550
                          (B02.SIVILSTAND   (IND) = 'E'  !              00018560
  /* FEILRAPP 277 */       B02.SIVILSTAND   (IND) = 'S')          THEN  00018570
                          DO;                                           00018580
                            IF B02.TP_GAR_KODE(IND) = 'E' THEN          00018590
                               DO;                                      00018600
                                  IF F_AAR < 1925 THEN                  00018610
                                     DO;                                00018620
                                        TEKSTTYPE_U_KODE(J) = 'U104';   00018630
                                        J                   = J + 1;    00018640
                                     END;                               00018650
                                  ELSE                                  00018660
                                  IF (F_AAR = 1925) THEN                00018670
                                      DO;                               00018680
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00018690
                                         J                   = J + 1;   00018700
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00018710
                                         J                   = J + 1;   00018720
                                      END;                              00018730
                                  ELSE                                  00018740
                                  IF F_AAR > 1925 &                     00018750
                                                                        00018760
  /*HL 060397*/                      UFØR_ALDER < 2201            THEN  00018770
                                      DO;                               00018780
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00018790
                                         J                   = J + 1;   00018800
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00018810
                                         J                   = J + 1;   00018820
                                         TEKSTTYPE_U_KODE(J) = 'U116';  00018830
                                         J                   = J + 1;   00018840
                                         TEKSTTYPE_U_KODE(J) = 'U126';  00018850
                                         J                   = J + 1;   00018860
                                         IF F_AAR > 1930      THEN      00018870
                                           TEKSTTYPE_U_KODE(J) = 'U127';00018880
                                           J                   = J + 1; 00018890
                                      END;                              00018900
                                   ELSE                                 00018910
                                   IF UFØR_ALDER < 2401 THEN            00018920
                                     DO;                                00018930
                                       TEKSTTYPE_U_KODE(J) = 'U125';    00018940
                                       J                   = J + 1;     00018950
                                       IF F_AAR > 1930      THEN        00018960
                                       TEKSTTYPE_U_KODE(J) = 'U127';    00018970
                                       J                   = J + 1;     00018980
                                     END;                               00018990
                                   ELSE                                 00019000
                                   IF UFØR_ALDER < 2601 THEN            00019010
                                   DO;                                  00019020
                                     TEKSTTYPE_U_KODE(J) = 'U133';      00019030
                                     J                   = J + 1;       00019040
                                   END;                                 00019050
                                   IF B02.TT_ANV(IND) < 40  THEN        00019060
                                      DO;                               00019070
                                        TEKSTTYPE_U_KODE(J) = 'U107';   00019080
                                        J                   = J + 1;    00019090
                                      END;                              00019100
                              END;                                      00019110
                           ELSE                                         00019120
                             IF B02.ETTEPENS.TP_BRUTTO(IND) > 0   THEN  00019130
                                                                        00019140
                                IF B02.ALDERSP.TP(IND)      > 0   THEN  00019150
                                                                        00019160
                                   DO;                                  00019170
                                                                        00019180
                                                                        00019190
                      IF B02.POENGTILLEGG_KODE(IND) = 'B'  &            00019200
                                B02.YPT_KODE(IND_EK)       = ' ' THEN   00019210
                                                                        00019220
                             TEKSTTYPE_U_KODE(J) = 'U084';              00019230
                                                                        00019240
                      ELSE                                              00019250
                                                                        00019260
                      IF B02.POENGTILLEGG_KODE(IND) = 'A'   &           00019270
                                B02.YPT_KODE(IND_EK)       = ' ' THEN   00019280
                                                                        00019290
                             TEKSTTYPE_U_KODE(J) =  'U085';             00019300
                                                                        00019310
                      ELSE                                              00019320
                                                                        00019330
                      IF B02.POENGTILLEGG_KODE(IND)= 'C'  &             00019340
                                B02.YPT_KODE(IND_EK)       = ' ' THEN   00019350
                                                                        00019360
                             TEKSTTYPE_U_KODE(J) =  'U089';             00019370
                      ELSE                                              00019380
                                                                        00019390
                             TEKSTTYPE_U_KODE(J) =  'U047';             00019400
                                                                        00019410
                                                                        00019420
                                      J                    = J + 1;     00019430
                                      TEKSTTYPE_U_KODE(J)  = 'U049';    00019440
                                      J                    = J + 1;     00019450
                                   END;                                 00019460
                                                                        00019470
                                ELSE   /* BARE TP ETTER AVDØDE   */     00019480
                                                                        00019490
                                   DO;                                  00019500
                                      TEKSTTYPE_U_KODE(J)  = 'U047';    00019510
                                      J                    = J + 1;     00019520
                                                                        00019530
                                      TEKSTTYPE_U_KODE(J)  = 'U048';    00019540
                                      J                    = J + 1;     00019550
                                   END;                                 00019560
                             ELSE   /*TP_BRUTTO = 0 */                  00019570
                                DO;                                     00019580
                                   TEKSTTYPE_U_KODE(J)  = 'U047';       00019590
                                   J                    = J + 1;        00019600
                                END;                                    00019610
                          END;                                          00019620
                       ELSE   /*PT2 ^=E ELLER SIVILSTAND ^=E/S */       00019630
                          DO;                                           00019640
                            IF B02.TP_GAR_KODE(IND) = 'E' THEN          00019650
                               DO;                                      00019660
                                  IF F_AAR < 1925 THEN                  00019670
                                     DO;                                00019680
                                        TEKSTTYPE_U_KODE(J) = 'U104';   00019690
                                        J                   = J + 1;    00019700
                                     END;                               00019710
                                  ELSE                                  00019720
                                  IF (F_AAR = 1925) THEN                00019730
                                      DO;                               00019740
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00019750
                                         J                   = J + 1;   00019760
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00019770
                                         J                   = J + 1;   00019780
                                      END;                              00019790
                                  ELSE                                  00019800
                                  IF F_AAR > 1925 &                     00019810
  /*HL 060397*/                      UFØR_ALDER < 2201            THEN  00019820
                                      DO;                               00019830
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00019840
                                         J                   = J + 1;   00019850
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00019860
                                         J                   = J + 1;   00019870
                                         TEKSTTYPE_U_KODE(J) = 'U116';  00019880
                                         J                   = J + 1;   00019890
                                         TEKSTTYPE_U_KODE(J) = 'U126';  00019900
                                         J                   = J + 1;   00019910
                                         IF F_AAR > 1930      THEN      00019920
                                           TEKSTTYPE_U_KODE(J) = 'U127';00019930
                                           J                   = J + 1; 00019940
                                      END;                              00019950
                                   ELSE                                 00019960
                                   IF UFØR_ALDER < 2401 THEN            00019970
                                     DO;                                00019980
                                       TEKSTTYPE_U_KODE(J) = 'U125';    00019990
                                       J                   = J + 1;     00020000
                                       IF F_AAR > 1930      THEN        00020010
                                       TEKSTTYPE_U_KODE(J) = 'U127';    00020020
                                       J                   = J + 1;     00020030
                                     END;                               00020040
                                   ELSE                                 00020050
                                   IF UFØR_ALDER < 2601 THEN            00020060
                                   DO;                                  00020070
                                     TEKSTTYPE_U_KODE(J) = 'U133';      00020080
                                     J                   = J + 1;       00020090
                                   END;                                 00020100
                                   IF B02.TT_ANV(IND) < 40  THEN        00020110
                                      DO;                               00020120
                                        TEKSTTYPE_U_KODE(J) = 'U107';   00020130
                                        J                   = J + 1;    00020140
                                      END;                              00020150
                              END;                                      00020160
                           ELSE                                         00020170
                             IF B02.ETTEPENS.TP_BRUTTO(IND) > 0   THEN  00020180
                                                                        00020190
                                IF B02.ALDERSP.TP(IND)      > 0   THEN  00020200
                                                                        00020210
                                   DO;                                  00020220
                                      TEKSTTYPE_U_KODE(J)  = 'U047';    00020230
                                      J                    = J + 1;     00020240
                                                                        00020250
   /*                                 TEKSTTYPE_U_KODE(J)  = 'U049' */  00020260
                                      TEKSTTYPE_U_KODE(J)  = 'U349';    00020270
                                      J                    = J + 1;     00020280
                                   END;                                 00020290
                                                                        00020300
                                ELSE   /* BARE TP ETTER AVDØDE   */     00020310
                                                                        00020320
                                   DO;                                  00020330
                                      TEKSTTYPE_U_KODE(J)  = 'U047';    00020340
                                      J                    = J + 1;     00020350
                                                                        00020360
 /*                                   TEKSTTYPE_U_KODE(J)  = 'U048'*/   00020370
                                      TEKSTTYPE_U_KODE(J)  = 'U348';    00020380
                                      J                    = J + 1;     00020390
                                   END;                                 00020400
                             ELSE                                       00020410
                                DO;                                     00020420
                                   TEKSTTYPE_U_KODE(J)  = 'U047';       00020430
                                   J                    = J + 1;        00020440
                                END;                                    00020450
                          END;                                          00020460
                    END;                                                00020470
             END;                                                       00020480
          WHEN('K')                                                     00020490
             DO;                                                        00020500
                                                                        00020510
 /* ***************************************************************** */00020520
 /* AVTALEFESTET PENSJON                                              */00020530
 /* ***************************************************************** */00020540
                                                                        00020550
                TEKSTTYPE_U_KODE(J) = 'U047';                           00020560
                J                   = J + 1;                            00020570
                                                                        00020580
             END;                                                       00020590
          WHEN('U')                                                     00020600
             DO;                                                        00020610
                                                                        00020620
 /* ***************************************************************** */00020630
 /* UFØREPENSJON                                                      */00020640
 /* ***************************************************************** */00020650
                                                                        00020660
                                                                        00020670
 /* ***************************************************************** */00020680
 /* DØD AV YRKESSKADE                                                 */00020690
 /* ***************************************************************** */00020700
                                                                        00020710
               IF B02.DØD_AV_YRKESSKADE(IND) = 'E' !                    00020720
                  B02.DØD_AV_YRKESSKADE(IND) = 'Y' THEN                 00020730
                  DO;                                                   00020740
                                                                        00020750
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00020760
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00020770
                        DO;                                             00020780
                           TEKSTTYPE_U_KODE(J) = 'U320';                00020790
                           J                   = J + 1;                 00020800
                        END;                                            00020810
                                                                        00020820
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00020830
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00020840
                        DO;                                             00020850
                           TEKSTTYPE_U_KODE(J) = 'U321';                00020860
                           J                   = J + 1;                 00020870
                        END;                                            00020880
                                                                        00020890
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00020900
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00020910
                        DO;                                             00020920
                           TEKSTTYPE_U_KODE(J) = 'U322';                00020930
                           J                   = J + 1;                 00020940
                        END;                                            00020950
                                                                        00020960
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00020970
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00020980
                        DO;                                             00020990
                           TEKSTTYPE_U_KODE(J) = 'U325';                00021000
                           J                   = J + 1;                 00021010
                        END;                                            00021020
                                                                        00021030
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00021040
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00021050
                        DO;                                             00021060
                           TEKSTTYPE_U_KODE(J) = 'U326';                00021070
                           J                   = J + 1;                 00021080
                        END;                                            00021090
                                                                        00021100
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00021110
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00021120
                        DO;                                             00021130
                           TEKSTTYPE_U_KODE(J) = 'U327';                00021140
                           J                   = J + 1;                 00021150
                        END;                                            00021160
                                                                        00021170
                     IF B02.YRKEHIST.YRKE11(IND_EK,1) = 'A'  THEN       00021180
                        DO;                                             00021190
                           TEKSTTYPE_U_KODE(J) = 'U366';                00021200
                           J                   = J + 1;                 00021210
                        END;                                            00021220
                                                                        00021230
                     IF (B02.YRKEHIST.YRKE11(IND_EK,1) = 'S' ) THEN     00021240
                        DO;                                             00021250
                           TEKSTTYPE_U_KODE(J) = 'U382';                00021260
                           J                   = J + 1;                 00021270
                        END;                                            00021280
                                                                        00021290
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00021300
                        (B02.YRKEPENS.YUG(IND_EK)   < 100)     &        00021310
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00021320
                        DO;                                             00021330
                           TEKSTTYPE_U_KODE(J) = 'U328';                00021340
                           J                   = J + 1;                 00021350
                        END;                                            00021360
                                                                        00021370
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00021380
                        (B02.YRKEPENS.YUG(IND_EK)  < 100)      &        00021390
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00021400
                        DO;                                             00021410
                           TEKSTTYPE_U_KODE(J) = 'U329';                00021420
                           J                   = J + 1;                 00021430
                        END;                                            00021440
                                                                        00021450
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'A' ) &        00021460
                        (B02.YRKEPENS.YUG(IND_EK)  < 100)      &        00021470
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00021480
                        DO;                                             00021490
                           TEKSTTYPE_U_KODE(J) = 'U330';                00021500
                           J                   = J + 1;                 00021510
                        END;                                            00021520
                                                                        00021530
                     IF (B02.YRKEPENS.YPT_KODE(IND_EK) = 'V' ) &        00021540
                        (B02.POENGTILLEGG_KODE(IND) = ' ' ) THEN        00021550
                        DO;                                             00021560
                           TEKSTTYPE_U_KODE(J) = 'U331';                00021570
                           J                   = J + 1;                 00021580
                        END;                                            00021590
                                                                        00021600
                   END;                                                 00021610
                IF B02.PENSJONSTYPE2(IND) = 'S' THEN                    00021620
                   DO;                                                  00021630
                            IF B02.TP_GAR_KODE(IND) = 'E' THEN          00021640
                               DO;                                      00021650
                                  IF F_AAR < 1925 THEN                  00021660
                                     DO;                                00021670
                                        TEKSTTYPE_U_KODE(J) = 'U104';   00021680
                                        J                   = J + 1;    00021690
                                     END;                               00021700
                                  ELSE                                  00021710
                                  IF (F_AAR = 1925) THEN                00021720
                                      DO;                               00021730
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00021740
                                         J                   = J + 1;   00021750
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00021760
                                         J                   = J + 1;   00021770
                                      END;                              00021780
                                  ELSE                                  00021790
                                  IF F_AAR > 1925 &                     00021800
  /*HL 060397*/                      UFØR_ALDER < 2201            THEN  00021810
                                      DO;                               00021820
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00021830
                                         J                   = J + 1;   00021840
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00021850
                                         J                   = J + 1;   00021860
                                         TEKSTTYPE_U_KODE(J) = 'U116';  00021870
                                         J                   = J + 1;   00021880
                                         TEKSTTYPE_U_KODE(J) = 'U126';  00021890
                                         J                   = J + 1;   00021900
                                         IF F_AAR > 1930      THEN      00021910
                                           TEKSTTYPE_U_KODE(J) = 'U127';00021920
                                           J                   = J + 1; 00021930
                                      END;                              00021940
                                  ELSE                                  00021950
                                      DO;                               00021960
                                         TEKSTTYPE_U_KODE(J) = 'U125';  00021970
                                         J                   = J + 1;   00021980
                                         IF F_AAR > 1930      THEN      00021990
                                           TEKSTTYPE_U_KODE(J) = 'U127';00022000
                                           J                   = J + 1; 00022010
                                      END;                              00022020
                                   IF B02.TT_ANV(IND) < 40  THEN        00022030
                                      DO;                               00022040
                                        TEKSTTYPE_U_KODE(J) = 'U107';   00022050
                                        J                   = J + 1;    00022060
                                      END;                              00022070
                              END;                                      00022080
                    ELSE                                                00022090
                      IF (UFØR_ALDER < 2001) &                          00022100
                         (B02.BUP_GARANTI(IND,1) > 0) &                 00022110
                         (B02.BUP_GARANTI(IND,1) =                      00022120
                          B02.ETTEPENS.SPT_AVD(IND)) THEN               00022130
                          DO;                                           00022140
                            TEKSTTYPE_U_KODE(J) = 'U050';               00022150
                            J                   = J + 1;                00022160
                          END;                                          00022170
                       ELSE                                             00022180
                                                                        00022190
                                                                        00022200
                           IF (UFØR_ALDER > 2000  &                     00022210
                               UFØR_ALDER < 2101) &                     00022220
                              (B02.BUP_GARANTI(IND,1) > 0) &            00022230
                              (B02.BUP_GARANTI(IND,1) =                 00022240
                              B02.ETTEPENS.SPT_AVD(IND)) THEN           00022250
                              DO;                                       00022260
                                TEKSTTYPE_U_KODE(J) = 'U094';           00022270
                                J                   = J + 1;            00022280
                              END;                                      00022290
                            ELSE                                        00022300
                                                                        00022310
                           IF (UFØR_ALDER > 2100  &                     00022320
                               UFØR_ALDER < 2201) &                     00022330
                              (B02.BUP_GARANTI(IND,1) > 0) &            00022340
                              (B02.BUP_GARANTI(IND,1) =                 00022350
                              B02.ETTEPENS.SPT_AVD(IND)) THEN           00022360
                              DO;                                       00022370
                                TEKSTTYPE_U_KODE(J) = 'U099';           00022380
                                J                   = J + 1;            00022390
                              END;                                      00022400
 /*ENDRET 20.5.92 JD : FRA 2201 TIL 2401 I LINJEN NEDENFOR */           00022410
                           ELSE                                         00022420
                           IF (UFØR_ALDER > 2200  &                     00022430
                               UFØR_ALDER < 2401) &                     00022440
                              (B02.BUP_GARANTI(IND,1) > 0) &            00022450
                              (B02.BUP_GARANTI(IND,1) =                 00022460
                              B02.ETTEPENS.SPT_AVD(IND)) THEN           00022470
                              DO;                                       00022480
                                TEKSTTYPE_U_KODE(J) = 'U120';           00022490
                                J                   = J + 1;            00022500
                              END;                                      00022510
 /*UFØR ALDER FRA 24 TIL 26 åR JD 08.97                    */           00022520
                           ELSE                                         00022530
                           IF (UFØR_ALDER > 2400  &                     00022540
                               UFØR_ALDER < 2601) &                     00022550
                              (B02.BUP_GARANTI(IND,1) > 0) &            00022560
                              (B02.BUP_GARANTI(IND,1) =                 00022570
                              B02.ETTEPENS.SPT_AVD(IND)) THEN           00022580
                              DO;                                       00022590
                                TEKSTTYPE_U_KODE(J) = 'U131';           00022600
                                J                   = J + 1;            00022610
                              END;                                      00022620
                            ELSE                                        00022630
                              DO;                                       00022640
                               IF B02.ALDERSP.TP(IND_EK) > 0 !          00022650
                                B02.YRKEPENS.TP(IND_EK) > 0  !          00022660
                                B02.UFØRPENS.TP(IND_EK) > 0 THEN        00022670
                                DO;                                     00022680
                                                                        00022690
                                                                        00022700
                       IF B02.POENGTILLEGG_KODE(IND) = 'B'  &           00022710
                         B02.YRKEPENS.YPT_KODE(IND)  = ' '  THEN        00022720
                                                                        00022730
                                      TEKSTTYPE_U_KODE(J) = 'U045';     00022740
                                                                        00022750
                                   ELSE                                 00022760
                                                                        00022770
                       IF B02.POENGTILLEGG_KODE(IND) = 'A'  &           00022780
                         B02.YRKEPENS.YPT_KODE(IND)  = ' '  THEN        00022790
                                                                        00022800
                                                                        00022810
                                          TEKSTTYPE_U_KODE(J) = 'U046'; 00022820
                                                                        00022830
                                      ELSE                              00022840
                                                                        00022850
                                          TEKSTTYPE_U_KODE(J) = 'U047'; 00022860
                                   J = J + 1;                           00022870
                                END;                                    00022880
                            ELSE                                        00022890
                               DO;                                      00022900
                                  TEKSTTYPE_U_KODE(J) = 'U047';         00022910
                                  J                   = J + 1;          00022920
                               END;                                     00022930
                         END;                                           00022940
                  END;                                                  00022950
                                                                        00022960
                 ELSE                                                   00022970
                                                                        00022980
                    DO;                                                 00022990
                       IF B02.PENSJONSTYPE2(IND) = 'E' &                00023000
                          (B02.SIVILSTAND   (IND) = 'E'     !           00023010
                           B02.SIVILSTAND   (IND) = 'S'   )      THEN   00023020
                          DO;                                           00023030
                            IF B02.TP_GAR_KODE(IND) = 'E' THEN          00023040
                               DO;                                      00023050
                                  IF F_AAR < 1925 THEN                  00023060
                                     DO;                                00023070
                                        TEKSTTYPE_U_KODE(J) = 'U104';   00023080
                                        J                   = J + 1;    00023090
                                     END;                               00023100
                                  ELSE                                  00023110
                                  IF (F_AAR = 1925) THEN                00023120
                                      DO;                               00023130
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00023140
                                         J                   = J + 1;   00023150
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00023160
                                         J                   = J + 1;   00023170
                                      END;                              00023180
                                  ELSE                                  00023190
                                  IF F_AAR > 1925 &                     00023200
  /*HL 060397*/                      UFØR_ALDER < 2201            THEN  00023210
                                      DO;                               00023220
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00023230
                                         J                   = J + 1;   00023240
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00023250
                                         J                   = J + 1;   00023260
                                         TEKSTTYPE_U_KODE(J) = 'U116';  00023270
                                         J                   = J + 1;   00023280
                                         TEKSTTYPE_U_KODE(J) = 'U126';  00023290
                                         J                   = J + 1;   00023300
                                         IF F_AAR > 1930      THEN      00023310
                                           TEKSTTYPE_U_KODE(J) = 'U127';00023320
                                           J                   = J + 1; 00023330
                                      END;                              00023340
                                   ELSE                                 00023350
                                   IF UFØR_ALDER < 2401 THEN            00023360
                                     DO;                                00023370
                                       TEKSTTYPE_U_KODE(J) = 'U125';    00023380
                                       J                   = J + 1;     00023390
                                       IF F_AAR > 1930      THEN        00023400
                                       TEKSTTYPE_U_KODE(J) = 'U127';    00023410
                                       J                   = J + 1;     00023420
                                     END;                               00023430
                                   ELSE                                 00023440
                                   IF UFØR_ALDER < 2601 THEN            00023450
                                   DO;                                  00023460
                                     TEKSTTYPE_U_KODE(J) = 'U133';      00023470
                                     J                   = J + 1;       00023480
                                   END;                                 00023490
                                   IF B02.TT_ANV(IND) < 40  THEN        00023500
                                      DO;                               00023510
                                        TEKSTTYPE_U_KODE(J) = 'U107';   00023520
                                        J                   = J + 1;    00023530
                                      END;                              00023540
                              END;                                      00023550
                             IF B02.ETTEPENS.TP_BRUTTO(IND) > 0   THEN  00023560
                                                                        00023570
                                IF B02.UFØRPENS.TP(IND)     > 0   THEN  00023580
                                                                        00023590
                                   DO;                                  00023600
                                                                        00023610
                     IF B02.POENGTILLEGG_KODE(IND) = 'B'   &            00023620
                        B02.YRKEPENS.YPT_KODE(IND_EK) = ' '  THEN       00023630
                                                                        00023640
                                         TEKSTTYPE_U_KODE(J) = 'U084';  00023650
                                                                        00023660
                                      ELSE                              00023670
                                                                        00023680
                     IF B02.POENGTILLEGG_KODE(IND) = 'A'   &            00023690
                        B02.YRKEPENS.YPT_KODE(IND_EK) = ' '  THEN       00023700
                                                                        00023710
                                         TEKSTTYPE_U_KODE(J) = 'U085';  00023720
                                                                        00023730
                                      ELSE                              00023740
                                                                        00023750
                     IF B02.POENGTILLEGG_KODE(IND) = 'C'   &            00023760
                        B02.YRKEPENS.YPT_KODE(IND_EK) = ' '  THEN       00023770
                                                                        00023780
                                         TEKSTTYPE_U_KODE(J) = 'U089';  00023790
                                                                        00023800
                                      ELSE                              00023810
                                        IF B02.TP_GAR_KODE(IND) = ' '   00023820
                                         THEN                           00023830
                                         TEKSTTYPE_U_KODE(J) = 'U047';  00023840
                                                                        00023850
                                      IF (B02.BUP_GARANTI               00023860
                                                      (IND_EK,1) > 0 &  00023870
                                           B02.BUP_GARANTI              00023880
                                                      (IND_EK,1) =      00023890
                                           B02.ETTEPENS.SPT_AVD         00023900
                                                      (IND))            00023910
                                                       &                00023920
                                          (B02.BUP_GARANTI              00023930
                                                      (IND,1)  > 0 &    00023940
                                           B02.BUP_GARANTI              00023950
                                                      (IND,1)  =        00023960
                                           B02.UFØRPENS.SPT(IND))       00023970
                                                                  THEN  00023980
                                                                        00023990
                                            TEKSTTYPE_U_KODE(J)= 'U053';00024000
                                      J                    = J + 1;     00024010
                                                                        00024020
                                      TEKSTTYPE_U_KODE(J)  = 'U049';    00024030
                                      J                    = J + 1;     00024040
                                                                        00024050
                                 IF (B02.ETTEPENS.SPT_AVD(IND) = 3.30 & 00024060
                                    B02.ETTEPENS.TP_BRUTTO(IND) > 0  &  00024070
                                  B02.PENSJONSTYPE2   (IND) = 'E') THEN 00024080
                                    DO;                                 00024090
                                     IF (UFØR_ALDER_DØD < 2001) THEN    00024100
                                       DO;                              00024110
                                          TEKSTTYPE_U_KODE(J) = 'U051'; 00024120
                                          J                   = J + 1;  00024130
                                       END;                             00024140
                                     ELSE                               00024150
                                     IF (UFØR_ALDER_DØD > 2000 &        00024160
                                         UFØR_ALDER_DØD < 2101) THEN    00024170
                                       DO;                              00024180
                                         TEKSTTYPE_U_KODE(J) = 'U095';  00024190
                                         J                   = J + 1;   00024200
                                       END;                             00024210
                                     ELSE                               00024220
                                     IF (UFØR_ALDER_DØD > 2100 &        00024230
                                         UFØR_ALDER_DØD < 2201) THEN    00024240
                                       DO;                              00024250
                                          TEKSTTYPE_U_KODE(J) = 'U100'; 00024260
                                          J                = J + 1;     00024270
                                       END;                             00024280
                                     ELSE                               00024290
                                     IF (UFØR_ALDER_DØD > 2200 &        00024300
                                         UFØR_ALDER_DØD < 2401) THEN    00024310
                                       DO;                              00024320
                                          TEKSTTYPE_U_KODE(J) = 'U121'; 00024330
                                          J                   = J + 1;  00024340
                                       END;                             00024350
                                     ELSE                               00024360
                                     IF (UFØR_ALDER_DØD > 2400 &        00024370
                                         UFØR_ALDER_DØD < 2601) THEN    00024380
                                       DO;                              00024390
                                          TEKSTTYPE_U_KODE(J) = 'U132'; 00024400
                                          J                   = J + 1;  00024410
                                       END;                             00024420
                                    END;                                00024430
                                   END;                                 00024440
                                                                        00024450
                                ELSE                                    00024460
                                                                        00024470
                                   DO;                                  00024480
                                    IF B02.TP_GAR_KODE(IND) = ' '       00024490
                                         THEN                           00024500
                                      TEKSTTYPE_U_KODE(J)  = 'U047';    00024510
                                                                        00024520
                                                                        00024530
                                 IF (B02.ETTEPENS.SPT_AVD(IND) = 3.30 & 00024540
                                    B02.ETTEPENS.TP_BRUTTO(IND) > 0  &  00024550
                                  B02.PENSJONSTYPE2   (IND) = 'E') THEN 00024560
                                    DO;                                 00024570
                                     IF (UFØR_ALDER_DØD < 2001) THEN    00024580
                                       DO;                              00024590
                                          TEKSTTYPE_U_KODE(J) = 'U051'; 00024600
                                          J                   = J + 1;  00024610
                                       END;                             00024620
                                     ELSE                               00024630
                                     IF (UFØR_ALDER_DØD > 2000 &        00024640
                                         UFØR_ALDER_DØD < 2101) THEN    00024650
                                       DO;                              00024660
                                         TEKSTTYPE_U_KODE(J) = 'U095';  00024670
                                         J                   = J + 1;   00024680
                                       END;                             00024690
                                     ELSE                               00024700
                                     IF (UFØR_ALDER_DØD > 2100 &        00024710
                                         UFØR_ALDER_DØD < 2201) THEN    00024720
                                       DO;                              00024730
                                          TEKSTTYPE_U_KODE(J) = 'U100'; 00024740
                                          J                = J + 1;     00024750
                                       END;                             00024760
                                     ELSE                               00024770
                                     IF (UFØR_ALDER_DØD > 2200 &        00024780
                                         UFØR_ALDER_DØD < 2401) THEN    00024790
                                       DO;                              00024800
                                          TEKSTTYPE_U_KODE(J) = 'U121'; 00024810
                                          J                   = J + 1;  00024820
                                       END;                             00024830
                                     ELSE                               00024840
                                     IF (UFØR_ALDER_DØD > 2400 &        00024850
                                         UFØR_ALDER_DØD < 2601) THEN    00024860
                                       DO;                              00024870
                                          TEKSTTYPE_U_KODE(J) = 'U132'; 00024880
                                          J                   = J + 1;  00024890
                                       END;                             00024900
                                    END;                                00024910
                                                                        00024920
                                      J                    = J + 1;     00024930
                                      TEKSTTYPE_U_KODE(J)  = 'U048';    00024940
                                      J                    = J + 1;     00024950
                                   END;                                 00024960
                             ELSE                                       00024970
                                DO;                                     00024980
                                  IF B02.TP_GAR_KODE(IND) = ' ' THEN    00024990
                                                                        00025000
                                     TEKSTTYPE_U_KODE(J)  = 'U047';     00025010
                                                                        00025020
                                   IF (UFØR_ALDER < 2001) &             00025030
                                     (B02.BUP_GARANTI(IND,1) > 0) &     00025040
                                     (B02.BUP_GARANTI(IND,1) =          00025050
                                      B02.UFØRPENS.SPT(IND))   THEN     00025060
                                      TEKSTTYPE_U_KODE(J) = 'U050';     00025070
                                                                        00025080
                                   ELSE                                 00025090
                                     IF (UFØR_ALDER > 2000 &            00025100
                                         UFØR_ALDER < 2101) &           00025110
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00025120
                                       (B02.BUP_GARANTI(IND,1) =        00025130
                                        B02.UFØRPENS.SPT(IND))   THEN   00025140
                                                                        00025150
                                      TEKSTTYPE_U_KODE(J) = 'U094';     00025160
                                   ELSE                                 00025170
                                   IF (UFØR_ALDER > 2100 &              00025180
                                         UFØR_ALDER < 2201) &           00025190
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00025200
                                       (B02.BUP_GARANTI(IND,1) =        00025210
                                        B02.UFØRPENS.SPT(IND))   THEN   00025220
                                                                        00025230
                                      TEKSTTYPE_U_KODE(J) = 'U099';     00025240
                                   ELSE                                 00025250
                                   IF (UFØR_ALDER > 2200 &              00025260
                                         UFØR_ALDER < 2401) &           00025270
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00025280
                                       (B02.BUP_GARANTI(IND,1) =        00025290
                                        B02.UFØRPENS.SPT(IND))   THEN   00025300
                                                                        00025310
                                      TEKSTTYPE_U_KODE(J) = 'U120';     00025320
                                                                        00025330
                                   ELSE                                 00025340
                                   IF (UFØR_ALDER > 2400 &              00025350
                                         UFØR_ALDER < 2601) &           00025360
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00025370
                                       (B02.BUP_GARANTI(IND,1) =        00025380
                                        B02.UFØRPENS.SPT(IND))   THEN   00025390
                                      TEKSTTYPE_U_KODE(J) = 'U131';     00025400
                                                                        00025410
                                   J                    = J + 1;        00025420
                                END;                                    00025430
                          END;                                          00025440
                       ELSE                                             00025450
                          DO;                                           00025460
                             IF B02.ETTEPENS.TP_BRUTTO(IND) > 0   THEN  00025470
                                                                        00025480
                                IF B02.UFØRPENS.TP(IND)      > 0   THEN 00025490
                                                                        00025500
                                   DO;                                  00025510
                                      TEKSTTYPE_U_KODE(J)  = 'U047';    00025520
                                      J                    = J + 1;     00025530
                                                                        00025540
                                      TEKSTTYPE_U_KODE(J)  = 'U349';    00025550
                                      J                    = J + 1;     00025560
                                   END;                                 00025570
                                                                        00025580
                                ELSE                                    00025590
                                                                        00025600
                                   DO;                                  00025610
                                      TEKSTTYPE_U_KODE(J)  = 'U047';    00025620
                                                                        00025630
                                      IF (UFØR_ALDER < 2001) &          00025640
                                         (B02.BUP_GARANTI               00025650
                                                      (IND_EK,1) > 0) & 00025660
                                         (B02.BUP_GARANTI               00025670
                                                      (IND_EK,1) =      00025680
                                         B02.ETTEPENS.SPT_AVD           00025690
                                                      (IND))      THEN  00025700
                                        TEKSTTYPE_U_KODE(J)  = 'U051';  00025710
                                      ELSE                              00025720
                                         IF (UFØR_ALDER > 2000 &        00025730
                                             UFØR_ALDER < 2101) &       00025740
                                           (B02.BUP_GARANTI             00025750
                                                      (IND_EK,1) > 0) & 00025760
                                           (B02.BUP_GARANTI             00025770
                                                      (IND_EK,1) =      00025780
                                           B02.ETTEPENS.SPT_AVD         00025790
                                                      (IND))      THEN  00025800
                                          TEKSTTYPE_U_KODE(J)  = 'U095';00025810
                                                                        00025820
                                       ELSE                             00025830
                                       IF (UFØR_ALDER > 2100 &          00025840
                                             UFØR_ALDER < 2201) &       00025850
                                           (B02.BUP_GARANTI             00025860
                                                      (IND_EK,1) > 0) & 00025870
                                           (B02.BUP_GARANTI             00025880
                                                      (IND_EK,1) =      00025890
                                           B02.ETTEPENS.SPT_AVD         00025900
                                                      (IND))      THEN  00025910
                                          TEKSTTYPE_U_KODE(J)  = 'U100';00025920
                                       ELSE                             00025930
                                       IF (UFØR_ALDER > 2200 &          00025940
                                             UFØR_ALDER < 2401) &       00025950
                                           (B02.BUP_GARANTI             00025960
                                                      (IND_EK,1) > 0) & 00025970
                                           (B02.BUP_GARANTI             00025980
                                                      (IND_EK,1) =      00025990
                                           B02.ETTEPENS.SPT_AVD         00026000
                                                      (IND))      THEN  00026010
                                          TEKSTTYPE_U_KODE(J)  = 'U121';00026020
                                       ELSE                             00026030
 /*UNG UFØR 26 ÅR  JD  08.97*/         IF (UFØR_ALDER > 2400 &          00026040
                                             UFØR_ALDER < 2601) &       00026050
                                           (B02.BUP_GARANTI             00026060
                                                      (IND_EK,1) > 0) & 00026070
                                           (B02.BUP_GARANTI             00026080
                                                      (IND_EK,1) =      00026090
                                           B02.ETTEPENS.SPT_AVD         00026100
                                                      (IND))      THEN  00026110
                                          TEKSTTYPE_U_KODE(J)  = 'U132';00026120
                                                                        00026130
                                      J                    = J + 1;     00026140
                                                                        00026150
                                      TEKSTTYPE_U_KODE(J)  = 'U348';    00026160
                                      J                    = J + 1;     00026170
                                   END;                                 00026180
                             ELSE                                       00026190
                                DO;                                     00026200
                                 IF B02.TP_GAR_KODE(IND) = 'E' THEN     00026210
                                  DO;                                   00026220
                                  IF F_AAR < 1925 THEN                  00026230
                                     DO;                                00026240
                                        TEKSTTYPE_U_KODE(J) = 'U104';   00026250
                                        J                   = J + 1;    00026260
                                     END;                               00026270
                                  ELSE                                  00026280
                                  IF (F_AAR = 1925)   THEN              00026290
                                      DO;                               00026300
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00026310
                                         J                   = J + 1;   00026320
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00026330
                                         J                   = J + 1;   00026340
                                      END;                              00026350
                                  ELSE                                  00026360
                                  IF F_AAR > 1925 &                     00026370
  /*HL 060397*/                      UFØR_ALDER < 2201            THEN  00026380
                                      DO;                               00026390
                                         TEKSTTYPE_U_KODE(J) = 'U104';  00026400
                                         J                   = J + 1;   00026410
                                         TEKSTTYPE_U_KODE(J) = 'U105';  00026420
                                         J                   = J + 1;   00026430
                                         TEKSTTYPE_U_KODE(J) = 'U116';  00026440
                                         J                   = J + 1;   00026450
                                         TEKSTTYPE_U_KODE(J) = 'U126';  00026460
                                         J                   = J + 1;   00026470
                                         IF F_AAR > 1930      THEN      00026480
                                           TEKSTTYPE_U_KODE(J) = 'U127';00026490
                                           J                   = J + 1; 00026500
                                      END;                              00026510
                                   ELSE                                 00026520
                                   IF UFØR_ALDER < 2401 THEN            00026530
                                     DO;                                00026540
                                       TEKSTTYPE_U_KODE(J) = 'U125';    00026550
                                       J                   = J + 1;     00026560
                                       IF F_AAR > 1930      THEN        00026570
                                       TEKSTTYPE_U_KODE(J) = 'U127';    00026580
                                       J                   = J + 1;     00026590
                                     END;                               00026600
                                   ELSE                                 00026610
                                   IF UFØR_ALDER < 2601 THEN            00026620
                                   DO;                                  00026630
                                     TEKSTTYPE_U_KODE(J) = 'U133';      00026640
                                     J                   = J + 1;       00026650
                                   END;                                 00026660
                                   IF B02.TT_ANV(IND) < 40  THEN        00026670
                                      DO;                               00026680
                                        TEKSTTYPE_U_KODE(J) = 'U107';   00026690
                                        J                   = J + 1;    00026700
                                      END;                              00026710
                                   END;                                 00026720
                                  ELSE                                  00026730
                                  DO;                                   00026740
                                   TEKSTTYPE_U_KODE(J)  = 'U047';       00026750
                                                                        00026760
                                   IF (UFØR_ALDER < 2001)  &            00026770
                                     (B02.BUP_GARANTI(IND,1) > 0) &     00026780
                                     (B02.BUP_GARANTI(IND,1) =          00026790
                                      B02.UFØRPENS.SPT(IND))  THEN      00026800
                                                                        00026810
                                      TEKSTTYPE_U_KODE(J) = 'U050';     00026820
                                   ELSE                                 00026830
                                     IF (UFØR_ALDER > 2000   &          00026840
                                         UFØR_ALDER < 2101 ) &          00026850
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00026860
                                       (B02.BUP_GARANTI(IND,1) =        00026870
                                        B02.UFØRPENS.SPT(IND))  THEN    00026880
                                                                        00026890
                                      TEKSTTYPE_U_KODE(J) = 'U094';     00026900
                                   ELSE                                 00026910
                                   IF (UFØR_ALDER > 2100   &            00026920
                                         UFØR_ALDER < 2201 ) &          00026930
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00026940
                                       (B02.BUP_GARANTI(IND,1) =        00026950
                                        B02.UFØRPENS.SPT(IND))  THEN    00026960
                                                                        00026970
                                      TEKSTTYPE_U_KODE(J) = 'U099';     00026980
                                   ELSE                                 00026990
                                   IF (UFØR_ALDER > 2200   &            00027000
                                         UFØR_ALDER < 2401 ) &          00027010
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00027020
                                       (B02.BUP_GARANTI(IND,1) =        00027030
                                        B02.UFØRPENS.SPT(IND))  THEN    00027040
                                                                        00027050
                                      TEKSTTYPE_U_KODE(J) = 'U120';     00027060
                                   ELSE                                 00027070
 /*UNG UFØR 26 ÅR  JD 08.97*/      IF (UFØR_ALDER > 2400   &            00027080
                                         UFØR_ALDER < 2601 ) &          00027090
                                       (B02.BUP_GARANTI(IND,1) > 0) &   00027100
                                       (B02.BUP_GARANTI(IND,1) =        00027110
                                        B02.UFØRPENS.SPT(IND))  THEN    00027120
                                                                        00027130
                                      TEKSTTYPE_U_KODE(J) = 'U131';     00027140
                                   J                    = J + 1;        00027150
                                  END;                                  00027160
                                END;                                    00027170
                         END;                                           00027180
                   END;                                                 00027190
             END;                                                       00027200
          WHEN('E')                                                     00027210
             DO;                                                        00027220
                                                                        00027230
 /* ***************************************************************** */00027240
 /* ETTERLATT EKTEFELLE                                               */00027250
 /* ***************************************************************** */00027260
                                                                        00027270
                  IF B02.SIVILSTAND(IND) = 'U' THEN                     00027280
                     DO;                                                00027290
                        TEKSTTYPE_U_KODE(J) = 'U348';                   00027300
                        J            = J + 1;                           00027310
                     END;                                               00027320
                  ELSE                                                  00027330
                     DO;                                                00027340
                        TEKSTTYPE_U_KODE(J) = 'U048';                   00027350
                        J            = J + 1;                           00027360
                     END;                                               00027370
               IF (UFØR_ALDER_DØD < 2001) &                             00027380
                 (B02.ETTEPENS.SPT_AVD(IND) = 3.30    !                 00027390
                  B02.TP_GAR_KODE     (IND) = 'E' ) THEN                00027400
                  DO;                                                   00027410
                     TEKSTTYPE_U_KODE(J) = 'U051';                      00027420
                     J                   = J + 1;                       00027430
                  END;                                                  00027440
               ELSE                                                     00027450
                                                                        00027460
                    IF (UFØR_ALDER_DØD > 2000 &                         00027470
                        UFØR_ALDER_DØD < 2101) &                        00027480
                 (B02.ETTEPENS.SPT_AVD(IND) = 3.30    !                 00027490
                  B02.TP_GAR_KODE     (IND) = 'E' ) THEN                00027500
                       DO;                                              00027510
                         TEKSTTYPE_U_KODE(J) = 'U095';                  00027520
                         J                   = J + 1;                   00027530
                       END;                                             00027540
                    ELSE                                                00027550
                    IF (UFØR_ALDER_DØD > 2100 &                         00027560
                        UFØR_ALDER_DØD < 2201) &                        00027570
                 (B02.ETTEPENS.SPT_AVD(IND) = 3.30    !                 00027580
                  B02.TP_GAR_KODE     (IND) = 'E' ) THEN                00027590
                       DO;                                              00027600
                         TEKSTTYPE_U_KODE(J) = 'U100';                  00027610
                         J                   = J + 1;                   00027620
                       END;                                             00027630
                    ELSE                                                00027640
                    IF (UFØR_ALDER_DØD > 2200 &                         00027650
                        UFØR_ALDER_DØD < 2401) &                        00027660
                 (B02.ETTEPENS.SPT_AVD(IND) = 3.30    !                 00027670
                  B02.TP_GAR_KODE     (IND) = 'E' ) THEN                00027680
                       DO;                                              00027690
                         TEKSTTYPE_U_KODE(J) = 'U121';                  00027700
                         J                   = J + 1;                   00027710
                       END;                                             00027720
                    ELSE                                                00027730
                    IF (UFØR_ALDER_DØD > 2400 &                         00027740
                        UFØR_ALDER_DØD < 2601) &                        00027750
                 (B02.ETTEPENS.SPT_AVD(IND) = 3.30    !                 00027760
                  B02.TP_GAR_KODE     (IND) = 'E' ) THEN                00027770
                       DO;                                              00027780
                         TEKSTTYPE_U_KODE(J) = 'U132';                  00027790
                         J                   = J + 1;                   00027800
                       END;                                             00027810
                    ELSE                                                00027820
                      IF B02.BEREGN_FOLKETRYGD(IND_EK) = ' ' THEN       00027830
                       DO;                                              00027840
                         TEKSTTYPE_U_KODE(J) = 'U047';                  00027850
                         J                   = J + 1;                   00027860
                       END;                                             00027870
                                                                        00027880
 /* ***************************************************************** */00027890
 /* DØD AV YRKESSKADE                                                 */00027900
 /* ***************************************************************** */00027910
                                                                        00027920
               DO L = 5 TO 1 BY -1 UNTIL(B02.YRKEHIST.YUFT_ÅMD          00027930
                                            (IND_EK,L) > 0);            00027940
                  SISTE = L;                                            00027950
               END;                                                     00027960
                                                                        00027970
               IF B02.DØD_AV_YRKESSKADE(IND) = 'E' !                    00027980
                  B02.DØD_AV_YRKESSKADE(IND) = 'Y' THEN                 00027990
                  DO;                                                   00028000
                                                                        00028010
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) &           00028020
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00028030
                        DO;                                             00028040
                           TEKSTTYPE_U_KODE(J) = 'U320';                00028050
                           J                   = J + 1;                 00028060
                        END;                                            00028070
                                                                        00028080
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) &           00028090
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00028100
                        DO;                                             00028110
                           TEKSTTYPE_U_KODE(J) = 'U321';                00028120
                           J                   = J + 1;                 00028130
                        END;                                            00028140
                                                                        00028150
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) &           00028160
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00028170
                        DO;                                             00028180
                           TEKSTTYPE_U_KODE(J) = 'U322';                00028190
                           J                   = J + 1;                 00028200
                        END;                                            00028210
                                                                        00028220
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &           00028230
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00028240
                        DO;                                             00028250
                           TEKSTTYPE_U_KODE(J) = 'U325';                00028260
                           J                   = J + 1;                 00028270
                        END;                                            00028280
                                                                        00028290
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &           00028300
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00028310
                        DO;                                             00028320
                           TEKSTTYPE_U_KODE(J) = 'U326';                00028330
                           J                   = J + 1;                 00028340
                        END;                                            00028350
                                                                        00028360
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &           00028370
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00028380
                        DO;                                             00028390
                           TEKSTTYPE_U_KODE(J) = 'U327';                00028400
                           J                   = J + 1;                 00028410
                        END;                                            00028420
                                                                        00028430
                                                                        00028440
                     IF B02.YRKEHIST.YRKE11(IND_EK,SISTE) = 'A'         00028450
                        THEN                                            00028460
                        DO;                                             00028470
                           TEKSTTYPE_U_KODE(J) = 'U366';                00028480
                           J                   = J + 1;                 00028490
                        END;                                            00028500
                                                                        00028510
                                                                        00028520
                     IF (B02.YRKEHIST.YRKE11(IND_EK,SISTE) = 'S' )      00028530
                        THEN                                            00028540
                        DO;                                             00028550
                           TEKSTTYPE_U_KODE(J) = 'U382';                00028560
                           J                   = J + 1;                 00028570
                        END;                                            00028580
                                                                        00028590
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &           00028600
                        (B02.YRKEPENS.YUG(IND)  < 100)      &           00028610
                        (B02.POENGTILLEGG_KODE(IND) = 'B' ) THEN        00028620
                        DO;                                             00028630
                           TEKSTTYPE_U_KODE(J) = 'U328';                00028640
                           J                   = J + 1;                 00028650
                        END;                                            00028660
                                                                        00028670
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &           00028680
                        (B02.YRKEPENS.YUG(IND)  < 100)      &           00028690
                        (B02.POENGTILLEGG_KODE(IND) = 'A' ) THEN        00028700
                        DO;                                             00028710
                           TEKSTTYPE_U_KODE(J) = 'U329';                00028720
                           J                   = J + 1;                 00028730
                        END;                                            00028740
                                                                        00028750
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'A' ) &           00028760
                        (B02.YRKEPENS.YUG(IND)   < 100)     &           00028770
                        (B02.POENGTILLEGG_KODE(IND) = 'C' ) THEN        00028780
                        DO;                                             00028790
                           TEKSTTYPE_U_KODE(J) = 'U330';                00028800
                           J                   = J + 1;                 00028810
                        END;                                            00028820
                                                                        00028830
                     IF (B02.YRKEPENS.YPT_KODE(IND) = 'V' ) &           00028840
                        (B02.POENGTILLEGG_KODE(IND) = ' ' ) THEN        00028850
                        DO;                                             00028860
                           TEKSTTYPE_U_KODE(J) = 'U331';                00028870
                           J                   = J + 1;                 00028880
                        END;                                            00028890
                                                                        00028900
                   END;                                                 00028910
             END;                                                       00028920
          OTHERWISE;                                                    00028930
       END; /*SELECT*/                                                  00028940
                                                                        00028950
       IF F_AAR < 1937 THEN                                             00028960
          DO;                                                           00028970
             IF B02.TP_GAR_KODE(IND) ^= 'E' THEN                        00028980
                DO;                                                     00028990
                   TEKSTTYPE_U_KODE(J) = 'U065';                        00029000
                   J                   = J + 1;                         00029010
                END;                                                    00029020
             IF B02.ALDERSP.OPT(IND) > 0 !                              00029030
                B02.UFØRPENS.OPT(IND) > 0 !                             00029040
                B02.ETTEPENS.OPT_AVD(IND) > 0 THEN                      00029050
                DO;                                                     00029060
                    TEKSTTYPE_U_KODE(J) = 'U067';                       00029070
                    J = J + 1;                                          00029080
                END;                                                    00029090
          END;                                                          00029100
       ELSE                                                             00029110
          IF B02.TP_GAR_KODE(IND) ^= 'E'  THEN                          00029120
             DO;                                                        00029130
                TEKSTTYPE_U_KODE(J) = 'U066';                           00029140
                J                   = J + 1;                            00029150
             END;                                                       00029160
                                                                        00029170
       IF B02.VT_TP(IND) > 0 &                                          00029180
          B02.ALDERSP.PÅ(IND) ^= B02.VT_PÅ(IND)    THEN                 00029190
          DO;                                                           00029200
             TEKSTTYPE_U_KODE(J) = 'U068';                              00029210
             J                   = J + 1;                               00029220
          END;                                                          00029230
                                                                        00029240
                                                                        00029250
       IF B02.ALDERSP.ST(IND) > 0 !                                     00029260
          B02.UFØRPENS.ST(IND) > 0 !                                    00029270
          B02.ETTEPENS.ST(IND) > 0 THEN                                 00029280
          DO;                                                           00029290
             TEKSTTYPE_U_KODE(J) = 'U070';                              00029300
             J                   = J + 1;                               00029310
          END;                                                          00029320
                                                                        00029330
    END;                                                                00029340
                                                                        00029350
    IF B02.VT_GP(IND) > 0 THEN                                          00029360
       DO;                                                              00029370
          TEKSTTYPE_U_KODE(J) = 'U071';                                 00029380
          J                   = J + 1;                                  00029390
       END;                                                             00029400
                                                                        00029410
                                                                        00029420
   IF (B02.STATUS.GT_LOV92(IND) > B02.STATUS.GARANTI_TP(IND) &          00029430
       B02.STATUS.GT_TILLEGG_LOV92(IND) > 0 ) &                         00029440
             (B02.FORSI.GARANTITILLEGG_EK(IND) > 0        !             00029450
              B02.FORSI.GARANTITILLEGG_BARN(IND) > 0      !             00029460
              B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0)  THEN          00029470
       DO;                                                              00029480
          TEKSTTYPE_U_KODE(J) = 'U114';                                 00029490
          J = J + 1;                                                    00029500
          IF B02.PENSJONSTYPE1(IND) = 'Y'    THEN                       00029510
             DO;                                                        00029520
                TEKSTTYPE_U_KODE(J) = 'U118';                           00029530
                J = J + 1;                                              00029540
             END;                                                       00029550
       END;                                                             00029560
   IF (B02.STATUS.GT_LOV92(IND) > B02.STATUS.GARANTI_TP(IND) &          00029570
       B02.STATUS.GT_TILLEGG_LOV92(IND) > 0 ) &                         00029580
             (B02.FORSI.GARANTITILLEGG_EK(IND) = 0        &             00029590
              B02.FORSI.GARANTITILLEGG_BARN(IND) = 0      &             00029600
              B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) = 0)  THEN          00029610
       DO;                                                              00029620
          TEKSTTYPE_U_KODE(J) = 'U119';                                 00029630
          J = J + 1;                                                    00029640
          IF B02.PENSJONSTYPE1(IND) = 'Y'    THEN                       00029650
             DO;                                                        00029660
                TEKSTTYPE_U_KODE(J) = 'U118';                           00029670
                J = J + 1;                                              00029680
             END;                                                       00029690
       END;                                                             00029700
    IF B02.FT_SKAL_BEREGNES(IND) = 'J'   THEN                           00029710
  DO;                                                                   00029720
                                                                        00029730
   IF (B02.FORSI.GARANTITILLEGG_EK(IND) = 0 &                           00029740
       B02.ALDERSP.ET             (IND) = 0 &                           00029750
       B02.YRKEPENS.ET            (IND) = 0 &                           00029760
       B02.UFØRPENS.ET            (IND) = 0 ) &                         00029770
     (B02.FORSI.ARBEIDSINNTEKT_EK(IND)  > 0 !                           00029780
      W_HENDELSE.FOLKETRYGD_EK          > 0 !                           00029790
      B02.FORSI.PENSJONSINNTEKT_EK(IND) > 0) THEN                       00029800
          DO;                                                           00029810
                IF (B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0 !         00029820
                    B02.FORSI.BT_SÆRBARN            (IND) > 0 ) &       00029830
                   (B02.UFØRPENS.BT(IND)   > 0 !                        00029840
                    B02.ALDERSP.BT(IND)    > 0 !                        00029850
                    B02.YRKEPENS.BT(IND)   > 0 !                        00029860
                    B02.FORSI.GARANTITILLEGG_BARN(IND) > 0 )  THEN      00029870
                     DO;                                                00029880
                      TEKSTTYPE_U_KODE(J) = 'U112';                     00029890
                      J                   = J + 1;                      00029900
                     END;                                               00029910
                ELSE                                                    00029920
                   DO;                                                  00029930
                   IF (B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) +          00029940
                       B02.FORSI.BT_SÆRBARN            (IND) = 0)  THEN 00029950
                      DO;                                               00029960
                       IF(B02.UFØRPENS.BT(IND)                  +       00029970
                          B02.ALDERSP.BT(IND)                   +       00029980
                          B02.YRKEPENS.BT(IND)                  +       00029990
                          B02.FORSI.GARANTITILLEGG_BARN(IND) > 0 ) THEN 00030000
                         DO;                                            00030010
                           TEKSTTYPE_U_KODE(J) = 'U039';                00030020
                           J                   = J + 1;                 00030030
                         END;                                           00030040
                      END;                                              00030050
                   ELSE                                                 00030060
                   IF (B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) +          00030070
                       B02.FORSI.BT_SÆRBARN            (IND) > 0) THEN  00030080
                      DO;                                               00030090
                    IF(B02.UFØRPENS.BT(IND)                  +          00030100
                       B02.ALDERSP.BT(IND)                   +          00030110
                       B02.YRKEPENS.BT(IND)                  +          00030120
                       B02.FORSI.GARANTITILLEGG_BARN(IND) = 0 ) THEN    00030130
                         DO;                                            00030140
                           TEKSTTYPE_U_KODE(J) = 'U041';                00030150
                           J                   = J + 1;                 00030160
                         END;                                           00030170
                      END;                                              00030180
                  END;                                                  00030190
          END;                                                          00030200
                                                                        00030210
   IF (B02.FORSI.GARANTITILLEGG_EK(IND) > 0 !                           00030220
       B02.ALDERSP.ET             (IND) > 0 !                           00030230
       B02.YRKEPENS.ET            (IND) > 0 !                           00030240
       B02.UFØRPENS.ET            (IND) > 0 ) !                         00030250
     (B02.FORSI.ARBEIDSINNTEKT_EK(IND)  = 0 &                           00030260
      W_HENDELSE.FOLKETRYGD_EK          = 0 &                           00030270
      B02.FORSI.PENSJONSINNTEKT_EK(IND) = 0) THEN                       00030280
       DO;                                                              00030290
          IF B02.PENSJONSTYPE1(IND) = 'K' THEN                          00030300
             DO;                                                        00030310
                TEKSTTYPE_U_KODE(J) = 'U241';                           00030320
                J                   = J + 1;                            00030330
             END;                                                       00030340
          ELSE                                                          00030350
             DO;                                                        00030360
                DO K = 1 TO 13 WHILE (B02.FNR_TILKN(IND,K) > 0);        00030370
                IF (B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0 !         00030380
                    B02.TILKNYTNINGSKODE          (IND,K) = 'V' !       00030390
                    B02.FORSI.BT_SÆRBARN            (IND) > 0 ) &       00030400
                   (B02.UFØRPENS.BT(IND)   > 0 !                        00030410
                    B02.ALDERSP.BT(IND)    > 0 !                        00030420
                    B02.YRKEPENS.BT(IND)   > 0 !                        00030430
                    B02.TILKNYTNINGSKODE          (IND,K) = 'W' !       00030440
                    B02.FORSI.GARANTITILLEGG_BARN(IND) > 0 )  THEN      00030450
                   DO;                                                  00030460
                      TEKSTTYPE_U_KODE(J) = 'U111';                     00030470
                      J                   = J + 1;                      00030480
                   END;                                                 00030490
                ELSE                                                    00030500
                   DO;                                                  00030510
                      IF (B02.FORSI.GARANTITILLEGG_EK(IND) +            00030520
                          B02.ALDERSP.ET             (IND) +            00030530
                          B02.YRKEPENS.ET            (IND) +            00030540
                          B02.UFØRPENS.ET            (IND) )  > 0 THEN  00030550
                           DO;                                          00030560
                            TEKSTTYPE_U_KODE(J) = 'U041';               00030570
                            J                 = J + 1;                  00030580
                           END;                                         00030590
                   END;                                                 00030600
                   K = 13;                                              00030610
                END;                                                    00030620
             END;                                                       00030630
       END;                                                             00030640
   IF B02.FORSI.ARBEIDSINNTEKT_EK(IND)  > 0 !                           00030650
      W_HENDELSE.FOLKETRYGD_EK          > 0 !                           00030660
      B02.FORSI.PENSJONSINNTEKT_EK(IND) > 0  THEN                       00030670
      DO;                                                               00030680
      END;                                                              00030690
    ELSE                                                                00030700
      DO;                                                               00030710
       IF(B02.UFØRPENS.BT(IND)   = 0 &                                  00030720
          B02.ALDERSP.BT(IND)   = 0 &                                   00030730
          B02.YRKEPENS.BT(IND)   = 0 &                                  00030740
          B02.UFØRPENS.ET(IND)   = 0 &                                  00030750
          B02.ALDERSP.ET(IND)   = 0 &                                   00030760
          B02.YRKEPENS.ET(IND)   = 0 &                                  00030770
          B02.FORSI.BT_SÆRBARN(IND) = 0)  &                             00030780
        ( B02.FORSI.GARANTITILLEGG_BARN(IND) > 0 &                      00030790
          B02.FORSI.GARANTITILLEGG_EK(IND)   = 0 ) &                    00030800
          B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) = 0   THEN              00030810
             DO;                                                        00030820
                TEKSTTYPE_U_KODE(J) = 'U041';                           00030830
                J                   = J + 1;                            00030840
             END;                                                       00030850
       IF(B02.UFØRPENS.BT(IND)   +                                      00030860
          B02.ALDERSP.BT(IND)    +                                      00030870
          B02.YRKEPENS.BT(IND)   +                                      00030880
          B02.UFØRPENS.ET(IND)   +                                      00030890
          B02.ALDERSP.ET(IND)    +                                      00030900
          B02.YRKEPENS.ET(IND)   +                                      00030910
          B02.FORSI.GARANTITILLEGG_BARN(IND) +                          00030920
          B02.FORSI.GARANTITILLEGG_EK(IND)   = 0) &                     00030930
         (B02.FORSI.BT_SÆRBARN(IND) +                                   00030940
          B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0 ) THEN              00030950
             DO;                                                        00030960
                TEKSTTYPE_U_KODE(J) = 'U041';                           00030970
                J                   = J + 1;                            00030980
             END;                                                       00030990
       IF(B02.UFØRPENS.BT(IND)   +                                      00031000
          B02.FORSI.GARANTITILLEGG_BARN(IND) +                          00031010
          B02.ALDERSP.BT(IND)    +                                      00031020
          B02.YRKEPENS.BT(IND) )  >  0   &                              00031030
         (B02.UFØRPENS.ET(IND)   +                                      00031040
          B02.ALDERSP.ET(IND)    +                                      00031050
          B02.YRKEPENS.ET(IND)   +                                      00031060
          B02.FORSI.BT_SÆRBARN(IND) +                                   00031070
          B02.FORSI.GARANTITILLEGG_EK(IND)  +                           00031080
          B02.FORSI.GARANTITILLEGG_SÆRBARN(IND)) =  0   THEN            00031090
             DO;                                                        00031100
                TEKSTTYPE_U_KODE(J) = 'U041';                           00031110
                J                   = J + 1;                            00031120
             END;                                                       00031130
       IF(B02.UFØRPENS.BT(IND)   = 0 &                                  00031140
          B02.ALDERSP.BT(IND)   = 0 &                                   00031150
          B02.YRKEPENS.BT(IND)   = 0 &                                  00031160
          B02.UFØRPENS.ET(IND)   = 0 &                                  00031170
          B02.ALDERSP.ET(IND)   = 0 &                                   00031180
          B02.YRKEPENS.ET(IND)   = 0 &                                  00031190
          B02.FORSI.BT_SÆRBARN(IND) = 0)  &                             00031200
          B02.FORSI.GARANTITILLEGG_SÆRBARN(IND) > 0      &              00031210
        ( B02.FORSI.GARANTITILLEGG_EK(IND)      > 0      !              00031220
          B02.FORSI.GARANTITILLEGG_BARN(IND)    > 0 )    THEN           00031230
             DO;                                                        00031240
                TEKSTTYPE_U_KODE(J) = 'U111';                           00031250
                J                   = J + 1;                            00031260
             END;                                                       00031270
      END;                                                              00031280
                                                                        00031290
 END;                                                                   00031300
   DCL U_TEKST1 CHAR(4),                                                00031310
    U_TEKST2 CHAR(4),                                                   00031320
    U_TEKST3 CHAR(4),                                                   00031330
    U_TEKST4 CHAR(4),                                                   00031340
    U_TEKST5 CHAR(4),                                                   00031350
    U_TEKST6 CHAR(4),                                                   00031360
    U_TEKST7 CHAR(4),                                                   00031370
    U_TEKST8 CHAR(4),                                                   00031380
    U_TEKST9 CHAR(4),                                                   00031390
    U_TEKST10 CHAR(4);                                                  00031400
    U_TEKST1   = TEKSTTYPE_U_KODE(1);                                   00031410
    U_TEKST2   = TEKSTTYPE_U_KODE(2);                                   00031420
    U_TEKST3   = TEKSTTYPE_U_KODE(3);                                   00031430
    U_TEKST4   = TEKSTTYPE_U_KODE(4);                                   00031440
    U_TEKST5   = TEKSTTYPE_U_KODE(5);                                   00031450
    U_TEKST6   = TEKSTTYPE_U_KODE(6);                                   00031460
    U_TEKST7   = TEKSTTYPE_U_KODE(7);                                   00031470
    U_TEKST8   = TEKSTTYPE_U_KODE(8);                                   00031480
    U_TEKST9   = TEKSTTYPE_U_KODE(9);                                   00031490
    U_TEKST10  = TEKSTTYPE_U_KODE(10);                                  00031500
                                                                        00031510
 /* ***************************************************************** */00031520
 /* HVIS PTYPE3 = 'A' ENDRES TEKSTKODE TIL Å GJELDE ATTFØRING         */00031530
 /* ***************************************************************** */00031540
                                                                        00031550
  IF (B02.STATUS.PENSJONSTYPE3(IND)   = 'A')    &                       00031560
     (B02.STATUS.PENSJONSTYPE1(IND)  ^= 'Y')    THEN                    00031570
     DO;                                                                00031580
        IF TEKSTTYPE_U_KODE(J) = 'U100' !                               00031590
           TEKSTTYPE_U_KODE(J) = 'U101' !                               00031600
           TEKSTTYPE_U_KODE(J) = 'U102' !                               00031610
           TEKSTTYPE_U_KODE(J) = 'U121' !                               00031620
           TEKSTTYPE_U_KODE(J) = 'U132' THEN                            00031630
           DO;                                                          00031640
              K                         = 1;                            00031650
              DO K = K TO J - 1;                                        00031660
                 SUBSTR(TEKSTTYPE_U_KODE(K),2,1) = '7';                 00031670
              END;                                                      00031680
           END;                                                         00031690
        ELSE                                                            00031700
           DO;                                                          00031710
              K                         = 1;                            00031720
              DO K = K TO J - 1;                                        00031730
                 SUBSTR(TEKSTTYPE_U_KODE(K),2,1) = '6';                 00031740
              END;                                                      00031750
           END;                                                         00031760
     END;                                                               00031770
                                                                        00031780
 EØS_TEKSTER:                                                           00031790
    PROC(IND,IND_EK);                                                   00031800
                                                                        00031810
    DCL                                                                 00031820
       IND      FIXED BIN (15),                                         00031830
       IND_EK   FIXED BIN (15);                                         00031840
                                                                        00031850
                                                                        00031860
  IF B02.BEREGN_FOLKETRYGD     (IND) = 'J' THEN                         00031870
     DO;                                                                00031880
        TEKSTTYPE_U_KODE(J) = 'U511';                                   00031890
        J    = J + 1                ;                                   00031900
        IF B02.PRO_RATA_BEREGNING    (IND) = 'J' THEN                   00031910
           DO;                                                          00031920
              TEKSTTYPE_U_KODE(J) = 'U512';                             00031930
              J    = J + 1                ;                             00031940
           END;                                                         00031950
        ELSE                                                            00031960
           DO;                                                          00031970
              TEKSTTYPE_U_KODE(J) = 'U513';                             00031980
              J    = J + 1                ;                             00031990
           END;                                                         00032000
                                                                        00032010
        IF B02.ALTERNATIV_GP(IND) > 0 THEN                              00032020
           DO;                                                          00032030
             TEKSTTYPE_U_KODE(J) = 'U514';                              00032040
             J    = J + 1                ;                              00032050
           END;                                                         00032060
        IF B02.ALTERNATIV_TP(IND) > 0 THEN                              00032070
           DO;                                                          00032080
              TEKSTTYPE_U_KODE(J) = 'U515';                             00032090
              J    = J + 1                ;                             00032100
            END;                                                        00032110
                                                                        00032120
         IF B02.ALTERNATIV_ET(IND) > 0 THEN                             00032130
            DO;                                                         00032140
              TEKSTTYPE_U_KODE(J) = 'U516';                             00032150
              J    = J + 1                ;                             00032160
            END;                                                        00032170
                                                                        00032180
         IF B02.ALTERNATIV_BT(IND) > 0 THEN                             00032190
            DO;                                                         00032200
              TEKSTTYPE_U_KODE(J) = 'U517';                             00032210
              J    = J + 1                ;                             00032220
            END;                                                        00032230
                                                                        00032240
         IF B02.ALTERNATIV_ST(IND) > 0 THEN                             00032250
            DO;                                                         00032260
              TEKSTTYPE_U_KODE(J) = 'U518';                             00032270
              J    = J + 1                ;                             00032280
            END;                                                        00032290
                                                                        00032300
         IF B02.ALTERNATIV_SUM_PENSJON(IND) > 0 THEN                    00032310
            DO;                                                         00032320
              TEKSTTYPE_U_KODE(J) = 'U522';                             00032330
              J    = J + 1                ;                             00032340
            END;                                                        00032350
         IF B02.PRO_RATA_BEREGNING    (IND) = 'J' THEN                  00032360
            DO;                                                         00032370
               IF (B02.UFØRPENS.ST(IND) > 0 )      !                    00032380
                  (B02.ETTEPENS.ST(IND) > 0 )      THEN                 00032390
                  DO;                                                   00032400
                     TEKSTTYPE_U_KODE(J) = 'U040';                      00032410
                     J    = J + 1                ;                      00032420
                  END;                                                  00032430
           /*  TEKSTTYPE_U_KODE(J) = 'U559';  EØS-NORDEN */             00032440
               TEKSTTYPE_U_KODE(J) = 'U519';                            00032450
               J    = J + 1                ;                            00032460
                                                                        00032470
                                                                        00032480
               IF (B02.UFØRPENS.TP(IND) > 0 )      !                    00032490
                  (B02.ETTEPENS.TP_NETTO(IND_EK) > 0 )  THEN            00032500
                  DO;                                                   00032510
                     TEKSTTYPE_U_KODE(J) = 'U520';                      00032520
                     J    = J + 1                ;                      00032530
               /*    TEKSTTYPE_U_KODE(J) = 'U561';  EØS-NORDEN */       00032540
                     TEKSTTYPE_U_KODE(J) = 'U521';                      00032550
                     J    = J + 1                ;                      00032560
                  END;                                                  00032570
            END;                                                        00032580
     END;                                                               00032590
   ELSE                                                                 00032600
      DO;                                                               00032610
         IF (B02.UFØRPENS.ST(IND) > 0 )      !                          00032620
            (B02.ETTEPENS.ST(IND) > 0 )       THEN                      00032630
            DO;                                                         00032640
               TEKSTTYPE_U_KODE(J) = 'U040';                            00032650
               J    = J + 1                ;                            00032660
            END;                                                        00032670
         TEKSTTYPE_U_KODE(J) = 'U510';                                  00032680
         J    = J + 1                ;                                  00032690
    /*   TEKSTTYPE_U_KODE(J) = 'U559';   EØS-NORDEN */                  00032700
         TEKSTTYPE_U_KODE(J) = 'U519';                                  00032710
         J    = J + 1                ;                                  00032720
                                                                        00032730
         IF (B02.UFØRPENS.TP(IND) > 0 )      !                          00032740
            (B02.ETTEPENS.TP_NETTO(IND_EK) > 0 )       THEN             00032750
            DO;                                                         00032760
               TEKSTTYPE_U_KODE(J) = 'U520';                            00032770
               J    = J + 1                ;                            00032780
           /*  TEKSTTYPE_U_KODE(J) = 'U561'; EØS-NORDEN */              00032790
               TEKSTTYPE_U_KODE(J) = 'U521';                            00032800
               J    = J + 1                ;                            00032810
            END;                                                        00032820
      END;                                                              00032830
                                                                        00032840
 END EØS_TEKSTER;                                                       00032850
                                                                        00032860
 END PLASSER_TEKSTTYPE_U_KODE;                                          00032870
