 /*       SIST ENDRET 19/06-91 10.17.09 AV   HERMAN                   */00000000
 /*       SIST ENDRET 08/05-91 13.23.42 AV   DYBVIK                   */00000010
 /******************************************************************* */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /************************                                            */00000040
 /*  PROGRAM-IDENT : R001TK02- LES IN BRUKER-ID - HOVEDPROGRAM        */00000050
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000060
 /*  PROGRAMMERER  : TUYEN                                            */00000070
 /*  PROGRAM LAGET : NOV 90                                           */00000080
 /*                                                                   */00000090
 /******************************************************************* */00000100
 /*HENSIKT:                                                           */00000110
 /************                                                        */00000120
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN TIL TK-REGISTER.         */00000130
 /*  PROGRAMMET AKTIVISERES NÅR OPERATØREN                            */00000140
 /*  HAR TASTET INN BRUKER-IDENTEN, MAP S001011 - MAPSET S001TK3.     */00000150
 /*  PROGRAMMET LESER INN BRUKER-IDENTEN, SKRIVER NESTE BILDE         */00000160
 /*  FOR VALG AV FUNKSJON UT -                                        */00000170
 /*  MAP S001013 - MAPSET S001TK3, OG TRANSKODEN SETTES TIL RT03.     */00000180
 /*                                                                   */00000190
 /******************************************************************* */00000200
 /*PROGRAMTILKNYTTING:                                                */00000210
 /**********************                                              */00000220
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANS-ID = RT02.         */00000230
 /*  DENNE TRANSID SETTES I R001TK02:                                 */00000240
 /*   EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_NR);           */00000250
 /*  KONTROLLEN GÅR VIDERE VIA CICS TIL R001TK03 FOR VALG AV FUNKSJON */00000260
 /*  OG KONTROLL AV FUNKSJONSKODE, TRANSKODE ER RT03.                 */00000270
 /******************************************************************* */00000280
 /*DATASETTOPPLYSNINGER:                                              */00000290
 /*************************                                           */00000300
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000310
 /*                                                                   */00000320
 /******************************************************************* */00000330
 /*FEILMELDINGER:                                                     */00000340
 /*********************                                               */00000350
 /* DET BLIR IKKE SKREVET UT FEILMELDINGER I DETTE PROGRAMMET.        */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 R001TK2:                                                               00000390
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000400
                                                                        00000410
 %PAGE;                                                                 00000420
      %INCLUDE S001TK;     /* MENY-MAPSETTET                       */   00000430
 %PAGE;                                                                 00000440
      %INCLUDE P001TK03;   /* KOM_OMR (BASED) */                        00000450
 %SKIP(2);                                                              00000460
                                                                        00000470
   DCL                                                                  00000480
      (COMMAREA_PEKER ,                                                 00000490
       BMSMAPBR)                     POINTER;                           00000500
   DCL                                                                  00000510
      (ADDR , CSTG , LOW , STG )     BUILTIN ;                          00000520
                                                                        00000530
                                                                        00000540
   /* *************************************************************** */00000550
   /* ****************                         ********************** */00000560
   /* **************     EKSEKVERING STARTER      ******************  */00000570
   /* ****************                         ********************** */00000580
   /* *************************************************************** */00000590
                                                                        00000600
      EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                        00000610
      EXEC CICS IGNORE CONDITION MAPFAIL;                               00000620
                                                                        00000630
      EXEC CICS RECEIVE MAP ('S001011') MAPSET ('S001TK3')              00000640
                SET (BMSMAPBR);                                         00000650
                                                                        00000660
                                                                        00000670
      /*-------------------------------------------------------*/       00000680
      /*   LES INN BRUKERID I KOM-OMR                          */       00000690
      /*-------------------------------------------------------*/       00000700
                                                                        00000710
      BRUKERID              = S001011I.BRUKER_IDI;                      00000720
                                                                        00000730
      /*-------------------------------------------------------*/       00000740
      /*   SKRIVER SKJERMBILDE MED SPØRSMÅL OM FUNKSJONSKODE   */       00000750
      /*-------------------------------------------------------*/       00000760
                                                                        00000770
      ALLOCATE S001013O;                                                00000780
      EXEC CICS SEND MAP('S001013') MAPSET('S001TK3') ERASE;            00000790
                                                                        00000800
      TRANSKODE  = 'RT03';                                              00000810
      SEND_MAP   = '0'B;                                                00000820
                                                                        00000830
      EXEC CICS RETURN TRANSID (TRANSKODE) COMMAREA (KOM_OMR) ;         00000840
                                                                        00000850
                                                                        00000860
 FEILBEH:                                                               00000870
      EXEC CICS SEND MAP('S001012') MAPSET('S001TK3')                   00000880
                                                    MAPONLY ERASE;      00000890
      /* SKRIVER PAUSEBILDET */                                         00000900
                                                                        00000910
      EXEC CICS RETURN;                                                 00000920
                                                                        00000930
 END R001TK2;                                                           00000940
