 /*       SIST ENDRET 30/11-98 12.07.31 AV   SPA7339                  */00000000
 /*       SIST ENDRET 30/11-98 12.07.02 AV   SPA7339                  */00000010
 /* ***************************************************************  */ 00000020
 /* PROC FOR Å HENTE DATO MED 8 BYTE I FORMAT HHAAMMDD               */ 00000030
 /* ***************************************************************  */ 00000040
  DATE_8BYTE: PROC RETURNS(CHAR (08)   );                               00000050
  DCL UT_DATO     CHAR (08)     ;                                       00000060
                                                                        00000070
  DCL 1 H_DATO    CHAR (17);                                            00000080
                                                                        00000090
  DCL (SUBSTR, DATETIME) BUILTIN;                                       00000100
  /*              ************                  */                      00000110
  H_DATO   =  DATETIME;                                                 00000120
  UT_DATO  = SUBSTR(H_DATO,1,8);                                        00000130
  RETURN (UT_DATO);                                                     00000140
  END DATE_8BYTE;                                                       00000150
                                                                        00000160
