 /*       SIST ENDRET 20/07-98 13.06.41 AV   JDA7339                  */00000000
 /*       SIST ENDRET 06/07-98 11.34.04 AV   JDA7339                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014722 - PROSEDYRE I PLI                                     */00000040
 /*    PROGRAMMERER: JAN, JUNI-82.                                    */00000050
 /*HENSIKT:                                                           */00000060
 /*    BEREGNE TILLEGGSPENSJON BARN                                   */00000070
 /*PROGRAMTILKNYTNING:                                                */00000080
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTEPEN-  */00000090
 /*    SJONSBEREGNINGEN BARN                                          */00000100
 /*    INCLUDES I R0014701                                            */00000110
 /*BRUK:                                                              */00000120
 /*    CALL BEREGN_TP_BARN(TP,ÅR,POREKKE(IND));                       */00000130
 /* ***************************************************************** */00000140
 /*   */                                                                00000150
 BEREGN_TP_BARN:                                                        00000160
   PROC(TP_MF,W_ÅR,W_POREKKE);                                          00000170
 /*   TP               FIXED DEC(7,2),   */                             00000180
   DCL                                                                  00000190
      TP_MF            FIXED DEC(7),                                    00000200
      TP_YP            FIXED DEC(5),                                    00000210
      GRAD             FIXED DEC(3),                                    00000220
      W_ÅR             PIC '(4)9';                               /*Y2K*/00000230
   DCL TP_WORK         FIXED DEC (13,4);                                00000240
   DCL TP_KAP10        FIXED DEC (5) INIT (0);                          00000250
   DCL FAKTOR1         FIXED DEC (13,4);                                00000260
   DCL FAKTOR2         FIXED DEC (13,4);                                00000270
    DCL W_GARANTI_TP      FIXED DEC (11,4) INIT (0);  /*HL*/            00000280
    DCL W_GAR_TP        FIXED DEC (5)    INIT (0);  /*HL*/              00000290
    DCL RETUR_POENG     FIXED DEC (3,2)  INIT (0);  /*HL*/              00000300
                                                                        00000310
   %INCLUDE   P0014002;                                                 00000320
                                                                        00000330
 /* ***************************************************************** */00000340
 /* KALL UNDERPROGRAM SOM BEREGNER POENGREKKEN.                       */00000350
 /* ***************************************************************** */00000360
                                                                        00000370
    B01_B02_IND = 2;                                                    00000380
    EXEC CICS LINK PROGRAM ('R0014141') COMMAREA(KOM_OMR);              00000390
                                                                        00000400
    IF FEIL_MELD_NR > 0  THEN                                           00000410
       GO TO RETUR;                                                     00000420
    ELSE                                                                00000430
       PROGRAM_ID = 'R0014701';                                         00000440
                                                                        00000450
    IF ^(DØDSÅR       > 1991   &                                 /*Y2K*/00000460
         W_FNR_R13.ÅR > 1925   )      THEN                       /*Y2K*/00000470
                                                                        00000480
         POREKKE.PÅ_ETTER91(IND) = 0;                                   00000490
                                                                        00000500
     IF B02.YRKEPENS.YUG(IND) > 0       THEN                            00000510
        DO;                                                             00000520
                                                                        00000530
           TP_WORK  = G * B02.YRKEPENS.YPT(IND) * 0.55;                 00000540
           TP_WORK  = TP_WORK * B02.YRKEPENS.YUG(IND) /100;             00000550
           TP_WORK  = TP_WORK / 12;                                     00000560
           IF B02.YRKEPENS.PÅ_ETTER91(IND) = 0       THEN               00000570
              TP_WORK  = TP_WORK * 0.45;                                00000580
           ELSE                                                         00000590
              DO;                                                       00000600
                 FAKTOR1 = (B02.YRKEPENS.PÅ(IND)                        00000610
                            - B02.YRKEPENS.PÅ_ETTER91(IND) )            00000620
                            / B02.YRKEPENS.PÅ(IND) * 0.45;              00000630
                 FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(IND)                 00000640
                            / B02.YRKEPENS.PÅ(IND) * 0.42;              00000650
                 TP_WORK = TP_WORK * (FAKTOR1 + FAKTOR2 + 0.00005);     00000660
              END;                                                      00000670
                                                                        00000680
           TP_YP = TP_WORK + 0.5;                                       00000690
                                                                        00000700
           IF B02.YRKEPENS.YUG(IND) < 100       THEN                    00000710
              DO;                                                       00000720
                 GRAD = B02.YRKEPENS.YUG(IND);                          00000730
                 TP_MF = F_TP92 (W_ÅR,G,                                00000740
                            POREKKE.SPT(IND),                           00000750
                            POREKKE.OPT(IND),                           00000760
                            POREKKE.PÅ (IND),                           00000770
                    POREKKE.PÅ_ETTER91 (IND),                           00000780
                            GRAD,55,'J');                               00000790
                                                                        00000800
                  TP_MF = TP_MF + TP_YP;                                00000810
              END;                                                      00000820
           ELSE                                                         00000830
             DO;                                                        00000840
              TP_MF = TP_YP;                                            00000850
               /* BLE IKKE SAMMENLIGNET MED VANLIG KAP 10 BEREGNING*/   00000860
                                                /* TRUDE 040995    */   00000870
              TP_KAP10 =F_TP92 (W_ÅR,G,                                 00000880
                            POREKKE.SPT(IND),                           00000890
                            POREKKE.OPT(IND),                           00000900
                            POREKKE.PÅ (IND),                           00000910
                    POREKKE.PÅ_ETTER91 (IND),                           00000920
                            100,55,'J');                                00000930
                                                                        00000940
              IF TP_KAP10  >  TP_MF   THEN                              00000950
                 TP_MF=  TP_KAP10;                                      00000960
             END;                                                       00000970
        END;                                                            00000980
    ELSE                                                                00000990
                                                                        00001000
       TP_MF = F_TP92         (W_ÅR,G,                                  00001010
                            POREKKE.SPT(IND),                           00001020
                            POREKKE.OPT(IND),                           00001030
                            POREKKE.PÅ (IND),                           00001040
                    POREKKE.PÅ_ETTER91 (IND),                           00001050
                            100,55,'J');                                00001060
                                                                        00001070
                                                                        00001080
  IF B02.BUP_GAR_KODE(IND,1) = 'E'        THEN                          00001090
     DO;                                                                00001100
        CALL SPT_GARANTI_E                                       /*Y2K*/00001110
                    (W_FNR_R13.ÅR,VIRK_ÅM,RETUR_POENG); /*4199*/ /*Y2K*/00001120
                                                                        00001130
        IF RETUR_POENG > 0                        THEN                  00001140
                                                                        00001150
           DO;                                                          00001160
              W_GARANTI_TP      =  G * 0.45 * RETUR_POENG;              00001170
              W_GARANTI_TP      =  W_GARANTI_TP * B02.TT_ANV(IND) / 40; 00001180
              W_GARANTI_TP      =  W_GARANTI_TP * 55;                   00001190
              W_GARANTI_TP      =  W_GARANTI_TP / 100;                  00001200
              W_GARANTI_TP      =  W_GARANTI_TP / 12 ;                  00001210
              W_GAR_TP          =  W_GARANTI_TP + 0.5;                  00001220
                                                                        00001230
              IF W_GAR_TP  >  TP_MF                     THEN            00001240
                 DO;                                                    00001250
                    TP_MF  = W_GAR_TP;                                  00001260
                    GARANTI_HØYEST(IND) = 'J';                          00001270
                 END;                                                   00001280
           END;                                                         00001290
    END;                                                                00001300
    RETUR:                                                              00001310
                                                                        00001320
   END BEREGN_TP_BARN;                                                  00001330
