 /*   SIST ENDRET PÅ PROD   2003.02.28  9.46.43 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.08.19 11.12.30 AV   SPA2970          */        
 /*       SIST ENDRET 04/05-98 14.31.39 AV   JDA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0019921 - FEIL_ML - HOVEDPROGRAM  I CICS/PLI.                 */        
 /*    PROGRAMMERER: KRISTENSEN, MAI 1982.                            */        
 /*    ENDRET AV DYBVIK JULI 1987.                                    */        
 /*HENSIKT:                                                           */        
 /*    PROGRAMMET HENTER UT EN FEILMELDING FRA FEILMELDINGS - BASEN   */        
 /*    PÅ GRUNNLAG AV ET FEILMELDINGSNUMMER.                          */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR LINKET TIL FRA SKRIV_FEIL SOM ER INTERN PROC   */        
 /*    I DIALOG - PROGRAMMENE.                                        */        
 /*BRUK:                                                              */        
 /*    EXEC CICS LINK PROGRAM ('R0019921') COMMAREA(FEIL_STRUC);      */        
 /* ***************************************************************** */        
 ACF2_FEIL: PROC(FEIL_NR) RETURNS(CHAR (78));                                   
                                                                                
    DCL FEIL_NR          FIXED DEC      (5);                                    
    DCL                                                                         
      1 FEILTAB,                                                                
        2 FEILNUMMER            CHAR(4),                                        
        2 FEILBLANK             CHAR(1),                                        
        2 FEILMELDING           CHAR(73),                                       
        F_MELD DEF FEILTAB      CHAR(78);                                       
   DCL W01_FEIL                   PIC'9999';                                    
   DCL W01_TKNR                   PIC'9999';                                    
   DCL (NULL,ADDR,CSTG,LOW,SUBSTR,UNSPEC)     BUILTIN;                          
                                                                                
      F_MELD  = ((78)' ');                                                      
                                                                                
      EXEC CICS HANDLE CONDITION NOTFND (NOT_FOUND);                            
                                                                                
      W01_FEIL            = FEIL_NR;                                            
                                                                                
            EXEC CICS READ DATASET ('FEILTAB')                                  
                INTO (FEILTAB)                                                  
                RIDFLD (W01_FEIL);                                              
     IF FEIL_NR     = '0658'  THEN                                              
        DO;                                                                     
           W01_TKNR  =    DIV_PARAM_OMR.BO_TKNR;                                
           SUBSTR(FEILMELDING,36,4) = W01_TKNR ;                                
           F_MELD = FEILNUMMER !!FEILBLANK!!FEILMELDING ;                       
                                                                                
        END;                                                                    
                                                                                
 NOT_FOUND:                                                                     
 RETURN(F_MELD);                                                                
 END ACF2_FEIL;                                                                 
