 /*   SIST ENDRET PÅ PROD   2008.11.05 16.25.09 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2005.06.08 13.21.17 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.32.36 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.01 10.11.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 13.21.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.25.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.03.02 10.19.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.02 10.14.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.09.29 14.39.39 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.09.29 14.39.07 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.05.27 10.45.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.27 10.34.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.27 14.14.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.07  8.30.20 AV   HLA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.05.16  9.00.47 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.45.17 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.06.11  8.36.24 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2001.05.30  9.32.50 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.05.09 13.18.07 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.01.05 12.44.59 AV   JDA7339          */        
 /*       SIST ENDRET 27/10-99 09.40.26 AV   JDA7339                  */        
 /*       SIST ENDRET 27/10-99 09.40.05 AV   JDA7339                  */        
 /*       SIST ENDRET 16/09-99 09.39.21 AV   JDA7339                  */        
 /*       SIST ENDRET 23/04-99 13.19.27 AV   JDA7339                  */        
 /*       SIST ENDRET 23/04-99 13.17.57 AV   JDA7339                  */        
 /*       SIST ENDRET 20/07-98 10.05.02 AV   JDA7339                  */        
 /*       SIST ENDRET 17/06-98 09.55.03 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014501 - RUTINE I PLI                                        */        
 /*    PROGRAMMERER: PER F. BERGESTAD, JUNI 1982                      */        
 /*HENSIKT:                                                           */        
 /*    RUTINEN BEREGNER ETTERLATT_UP.                                 */        
 /*ENDRING:                                                           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 R001450: PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                   
                                                                                
    %INCLUDE P0014002;   /*  W_POENG_REKKE                            */        
    %INCLUDE P0014003;   /*  TAB                                      */        
    %INCLUDE P0014009;   /*  POTALL_OPPL (BASED)                      */        
    %INCLUDE P0019906;   /*  TRANS OPPLYSNINGS OMRÅDE                 */        
    %INCLUDE P0019908;   /*  KOMMUNIKASJONS OMRÅDE                    */        
    %INCLUDE P0019912;   /*  DIV. PARAMETER OMRÅDE                    */        
    %INCLUDE P0019924;   /*  GV_TAB_ARRAY                             */        
    %INCLUDE P0019925;   /*  G_TAB_PERIODE                            */        
                                                                                
    DCL 1 W_B02 , %INCLUDE P0019921;                                            
    DCL 1 B01 BASED (B01_PEKER), %INCLUDE P0019921;                             
    DCL 1 B02 BASED (B02_PEKER), %INCLUDE P0019921;                             
    DCL                                                                         
       COMMAREA_PEKER    PTR;                                                   
    DCL                                                                         
       (I,J,K,UF_IND)        FIXED BIN(15) INIT (0);                            
    DCL(                                                                        
       ADDR,                                                                    
       CSTG,                                                                    
       HBOUND,                                                                  
       SUBSTR)           BUILTIN;                                               
   DCL ÅFT_MAX           FIXED DEC (5) INIT (0),                                
       GP_UP             FIXED DEC (7) INIT (0),                                
       GP_YP             FIXED DEC (7) INIT (0),                                
       GP_EGEN           FIXED DEC (7) INIT (0),                                
       GP_EP             FIXED DEC (7) INIT (0),                                
       ETTERLATTEPENSJON FIXED DEC (9)   INIT (0),                              
       UFØREPENSJON      FIXED DEC (9)   INIT (0),                              
       FRADRAG_F         FIXED DEC (9)   INIT (0),                              
       FRADRAGET         FIXED DEC (9)   INIT (0),                              
       ST_FRADRAG        FIXED DEC (5)   INIT (0),                              
       GAR92_EGEN        FIXED DEC (5)   INIT (0),                              
       GAR92_EGEN_55     FIXED DEC (5)   INIT (0),                              
       GAR92_AVD         FIXED DEC (5)   INIT (0),                              
       BRUKT_TT          FIXED DEC (3)   INIT (0),                              
       TT_ANV_UP         FIXED DEC (3)   INIT (0),                              
       TT_ANV_EP         FIXED DEC (3)   INIT (0),                              
       TT_ANV_AVD        FIXED DEC (3)   INIT (0),                              
       TP_AVD            FIXED DEC (5)   INIT (0),                              
       TP_UP             FIXED DEC (5)   INIT (0),                              
       TP_UP_55          FIXED DEC (5)   INIT (0),                              
       TP_EGEN          FIXED DEC (5)   INIT (0),                               
       TP_EGEN_55       FIXED DEC (5)   INIT (0),                               
       TP_YP            FIXED DEC (5)   INIT (0),                               
       TP_YP_55         FIXED DEC (5)   INIT (0),                               
       TILLEGGSBLANKETT_YRKESSKADE CHAR (1) INIT (' '),                         
       UP_GARANTI       FIXED DEC (5)   INIT (0),                               
       EP_GARANTI       FIXED DEC (5)   INIT (0),                               
       UFGRAD            FIXED DEC (3)   INIT (0),                              
       YRKE_ÅRSTP        FIXED DEC (7)   INIT (0),                              
       U_UFT_ÅMD        PIC '(8)9',                                             
       W_BT              FIXED DEC (5)   INIT (0),                              
       W_ST              FIXED DEC (5)   INIT (0),                              
       W_TP              FIXED DEC (5)   INIT (0),                              
       W_TP1             FIXED DEC (5)   INIT (0);                              
    DCL                                                                         
       W_FNR             PIC '(11)9',                                           
       W_FNR13           PIC '(13)9';                                           
    DCL                                                                         
       1 FNR_R13 DEF W_FNR13,                                                   
         2 DAG           PIC '99',                                              
         2 MND           PIC '99',                                              
         2 ÅR            PIC '9999',                                            
         2 ÅRHUNDRE      PIC '9',                                               
         2 FILLER        PIC '(4)9';                                            
    DCL                                                                         
       FØDSNUMMER_EK    PIC '(11)9';                                            
    DCL                                                                         
       FØDSNUMMER13_EK  PIC '(13)9';                                            
    DCL                                                                         
       1 FNR13_EK_R     DEF FØDSNUMMER13_EK,                                    
         2 DAG_EK       PIC'99',                                                
         2 MND_EK       PIC'99',                                                
         2 ÅR_EK        PIC'9999',                                              
         2 ÅRHUNDRE_EK      PIC'9',                                             
         2 FILLER_EK    PIC'(4)9';                                              
                                                                                
        DCL W_VIRKDATO_ÅMD PIC '(8)9';                                          
        DCL W_VIRKDATO_Å   DEF W_VIRKDATO_ÅMD POS(1) PIC '(4)9';                
        DCL W_VIRKDATO_ÅM  DEF W_VIRKDATO_ÅMD POS(1) PIC '(6)9';                
        DCL W_DØDSDATO_ÅMD PIC '(8)9';                                          
        DCL W_DØDSDATO_Å   DEF W_DØDSDATO_ÅMD POS(1) PIC '(4)9';                
        DCL W_UFØRETID_ÅMD PIC '(8)9';                                          
        DCL W_UFØRETID_Å   DEF W_UFØRETID_ÅMD POS(1) PIC '(4)9';                
                                                                                
        DCL W_BEREGNING_KONVENSJON  CHAR (1) INIT (' ');                        
        DCL W_KONVENSJON_ÅR         FIXED DEC (5) INIT (0);                     
                                                                                
        DCL FAKTOR             FIXED DEC (3) INIT (0); /*PGA 8-5-1*/            
        DCL ST_FRADRAG_AVD     FIXED DEC (7) INIT (0);                          
    DCL      RETUR_POENG      FIXED DEC (3,2)    INIT (0);   /*HL*/             
    DCL FIXED_DEC5      FIXED DEC (5)    INIT (0);  /*HL*/                      
    DCL DØDSDATO_ÅMD     PIC '99999999'  INIT (0);  /*HL*/                      
    DCL ALDER_VED_DØD    PIC 'S99999'    INIT (0);  /*HL*/                      
    DCL      W_GARANTI_TP     FIXED DEC (13,4)   INIT (0);   /*UF*/             
    DCL      W_GAR_TP         FIXED DEC (5)      INIT (0);   /*UF*/             
    DCL      SPT_GARANTI      FIXED DEC (3,2)    INIT (0);   /*UF*/             
    DCL      TP_UP_GARANTI    FIXED DEC (13,4)   INIT (0);   /*UF*/             
    DCL      TP_GARANTI_YP    FIXED DEC (13,4)   INIT (0);   /*UF*/             
    DCL      TP_GARANTI_YP1   FIXED DEC (13,4)   INIT (0);   /*UF*/             
    DCL      TP_GARANTI       FIXED DEC (7)      INIT (0);   /*UF*/             
 DCL OPPH_ÅM                         PIC'(6)9';                                 
 DCL OPPH_ÅR DEF OPPH_ÅM POS(1)      PIC'(4)9';                                 
 DCL OPPH_MN DEF OPPH_ÅM POS(5)      PIC'(2)9';                                 
 DCL UFT_ÅRM                         PIC'(6)9';                                 
 DCL UFT_ÅR DEF UFT_ÅRM POS(1)       PIC'(4)9';                                 
 DCL UFT_MN DEF UFT_ÅRM POS(5)       PIC'(2)9';                                 
 DCL JA           BIT(1)  INIT ('1'B);                                          
 DCL SKAL_TESTES  BIT(1)  INIT ('0'B);                                          
                                                                                
    /* START R0014501 =============================================== */        
                                                                                
    W_DØDSDATO_ÅMD = B02.DØDSDATO_ÅMD(BER_EK_IND);                              
    W_VIRKDATO_ÅMD = B02.VIRK_DATO_ÅMD(BER_SØ_IND);                             
                                                                                
    DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = 0;                            
    DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND)  = 0;                            
                                                                                
    FØDSNUMMER_EK       = B02.FNR(BER_EK_IND);                                  
    FØDSNUMMER13_EK     = KONV_FNR11_FNR13(FØDSNUMMER_EK);                      
    W_FNR               = B02.FNR(BER_SØ_IND);                                  
    W_FNR13             = KONV_FNR11_FNR13(W_FNR);                              
                                                                                
    UFGRAD = B02.UFØRPENS.UFG(BER_SØ_IND) -                                     
             B02.YRKEPENS.YUG(BER_SØ_IND);                                      
    IF UFGRAD < 0      THEN                                                     
       UFGRAD = 0;                                                              
                                                                                
    IF (TRANSTYPE = 3) THEN                                                     
       DO;  /* TRANSTYPE = 3 */                                                 
          IF TRANS_OPPL_OMR.BLANKETTYPE  = 'E3' THEN                            
             CALL HENT_FRA_E3;                                                  
          ELSE                                                                  
          IF TRANS_OPPL_OMR.BLANKETTYPE  = 'EE' THEN   /*0195 HL*/              
             CALL HENT_FRA_EE;                                                  
          ELSE                                                                  
             CALL HENT_FRA_EP;                                                  
                                                                                
          IF TILLEGGSBLANKETT_YRKESSKADE = 'J'   THEN                           
             CALL BEREGN_POENG_AÅI_AVDØD;          /*4128*/                     
       END; /* TRANSTYPE = 3 */                                                 
    ELSE                                                                        
       DO;  /* TRANSTYPE ^= 3 */                                                
          IF TRANS_OPPL_OMR.BLANKETTYPE  = 'U3' THEN                            
             CALL HENT_FRA_U3;    /*TRUDE 090394 */                             
          IF TRANS_OPPL_OMR.BLANKETTYPE  = 'U2' THEN                            
             CALL HENT_FRA_U2;                                                  
          IF TRANS_OPPL_OMR.BLANKETTYPE  = 'UP' THEN                            
             CALL HENT_FRA_UP;                                                  
       END; /* TRANSTYPE ^= 3 */                                                
                                                                                
    /*TILLEGG 12.3.90 HL : */                                                   
    B02.ETTEPENS.ST(BER_SØ_IND) = 0;                                            
                                                                                
      /* -----------------------------------------------------------*/          
      /* BYTTER OM PÅ REKKEFØLGEN TIL BEREGNING AV TP OG GP, SLIK   */          
      /* AT TP KOMMER FØRST. PENSJON UTLAND, TRUDE.                 */          
      /* -----------------------------------------------------------*/          
                                                                                
    CALL BEREGN_TP_ETTERLATT_UP;                      /*4522*/                  
                                                                                
    IF (B02.TT_16_66(BER_SØ_IND)  =  0   &                                      
        B02.TT_16_66(BER_EK_IND)  =  0   &                                      
        B02.BOSATT(BER_SØ_IND)    >  0 ) THEN                                   
       CALL BEREGN_GP_ETTERLATT_UP_UTLAND;            /*4580*/                  
    ELSE                                                                        
       CALL BEREGN_GP_ETTERLATT_UP;                  /*4521*/                   
                                                                                
    IF FEIL_MELD_NR > 0  THEN                                                   
       GO TO L999;                                                              
    ELSE                                                                        
       PROGRAM_ID = 'R0014501';                                                 
                                                                                
    IF (TRANSTYPE = 2) THEN                                                     
       /* VI MÅ UNDERSØKE OM DET ER FLER ENN ETT MULIG UFØRETIDSPUNKT.*/        
       /* (DEN NYE UFØREPERIODEN ER LAGT INN).                        */        
       DO;  /* TRANSTYPE = 2, GRUNNBLANKETT UFØREPENSJON */                     
        IF B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,2) > 0 THEN                          
           DO;  /* HAR FLERE UFØRETIDSPUNKT */                                  
              DO J = 2 TO 7;                                                    
                 IF B02.OPPHØRSDATO_ÅMD(BER_SØ_IND,J) = 0 THEN                  
                    DO;  /* FØRSTE UFØRETIDSPUNKT */                            
                         /* FRA 9812 SKAL OPPHØR IKKE VÆRE I JANUAR */          
                         /* (BLIR DA DESEMBER ÅRET FØR)             */          
                        OPPH_ÅM =                                               
                           B02.OPPHØRSDATO_ÅMD(BER_SØ_IND,(J-1))/100;           
                        UFT_ÅRM =  B02.UFT_ÅMD(BER_SØ_IND,J) / 100;             
                        IF OPPH_ÅR > 1997 &                                     
                           OPPH_MN = 12 &                                       
                           UFT_ÅR  = OPPH_ÅR + 1  &                             
                           UFT_MN  = 1                THEN                      
                           SKAL_TESTES = JA;                                    
                        ELSE                                                    
                        IF (OPPH_ÅM = UFT_ÅRM)  &                               
                           ((B02.UFT_ÅMD(BER_SØ_IND,J) > 19970400 ) !           
                           (B02.UFØRHIST.UFG(BER_SØ_IND,(J-1)) >= 50))          
                                                                THEN            
                           SKAL_TESTES = JA;                                    
                        IF SKAL_TESTES = JA        THEN                         
  /*     HL:*/                                                                  
                                                                                
  /* *****          IF B02.UFØRHIST.OPPHØRSDATO_ÅMD(BER_SØ_IND,(J-1)) =         
                       B02.UFØRHIST.UFT_ÅMD(BER_SØ_IND,J) THEN  ** */           
                       DO;  /* SKAL TESTES */                                   
                                       /* TS 160896*/                           
                        IF B01.UFØRPENS.SPT_1291(BER_SØ_IND) >                  
                           B01.UFØRPENS.SPT(BER_SØ_IND)    THEN                 
                            W_TP = F_TP92                                       
                             (FNR_R13.ÅR,                                       
                              G,                                                
                              (B01.UFØRPENS.SPT_1291(BER_SØ_IND)),              
                              (B01.UFØRPENS.OPT_1291(BER_SØ_IND)),              
                              (B01.UFØRPENS.PÅ_1291(BER_SØ_IND)),               
                              (B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),            
                              (B02.UFØRPENS.UFG(BER_SØ_IND)),                   
                              55,                                               
                              'J'                                               
                             );                                                 
                        ELSE      /*TS 160896*/                                 
                              /*ENDRET NEDF. STM FRA B01 TIL B02 TS */          
                            W_TP = F_TP92                                       
                             (FNR_R13.ÅR,                                       
                              G,                                                
     /*ENDRET TILBAKE         (B02.UFØRPENS.SPT(BER_SØ_IND)),                   
       17.4.2001 - HL         (B02.UFØRPENS.OPT(BER_SØ_IND)),                   
                              (B02.UFØRPENS.PÅ(BER_SØ_IND)),                    
                              (B02.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),            
                              (B02.UFØRPENS.UFG(BER_SØ_IND)), */                
                              (B01.UFØRPENS.SPT(BER_SØ_IND)),                   
                              (B01.UFØRPENS.OPT(BER_SØ_IND)),                   
                              (B01.UFØRPENS.PÅ(BER_SØ_IND)),                    
                              (B01.UFØRPENS.PÅ_ETTER91(BER_SØ_IND)),            
   /*11.6.01 HL               (B01.UFØRPENS.UFG(BER_SØ_IND)),  */               
                              (B02.UFØRPENS.UFG(BER_SØ_IND)),                   
                              55,                                               
                              'J'                                               
                              );                                                
                                                                                
                                                                                
      /*                 W_TP1 = F_TILLEGGSPENSJON(FNR_R13.ÅR,G,*/              
                         W_TP1 = F_TP92(FNR_R13.ÅR,G,    /*9904*/               
                                  POREKKE.SPT(BER_SØ_IND),                      
                                  POREKKE.OPT(BER_SØ_IND),                      
                                  POREKKE.PÅ(BER_SØ_IND),                       
                                  POREKKE.PÅ_ETTER91(BER_SØ_IND),               
                                  (B02.UFØRPENS.UFG(BER_SØ_IND)),               
                                  55,'J');                                      
                         IF W_TP >= W_TP1    THEN                               
 /* GAMMELT UFØRETIDSPUNKT LØNNER SEG.                                */        
                            DO;                                                 
                               CALL OPPDATER_GAMMEL_UFØRHISTORIKK;              
                               IF FEIL_MELD_NR > 0 THEN                         
                                  J = 7;                                        
                               ELSE                                             
                                 CALL BEREGN_TP_ETTERLATT_UP;                   
                            END;                                                
                       END; /* SKAL TESTES */                                   
                    J = 7;                                                      
                  END; /* FØRSTE UFØRETIDSPUNKT */                              
             END; /* DO J = 2 TO 7 */                                           
           END; /* HAR FLERE UFØRETIDSPUNKT */                                  
      END; /* TRANTSTYPE = 2 */                                                 
   ELSE         /*200205 HL*/                                                   
   IF ((TRANSTYPE = 22 )    /*INNTEKTSENDRING*/    &                            
        ( DIV_PARAM_OMR.INTENDR_ÅR        > 1991                                
          & DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = ' '                               
          & DIV_PARAM_OMR.REGN_1291 ^= '3'                                      
          & B02.PRO_RATA_BEREGNING(BER_SØ_IND) ^= 'J'                           
          & B02.PENSJONSTYPE3(BER_SØ_IND) ^= 'A'        )) !                    
      ((TRANSTYPE = 31 )     /*UNG UFØR*/          &                            
        ( DIV_PARAM_OMR.INTENDR_ÅR        > 1991))        THEN                  
                                                                                
                                                                                
 /* VI MÅ SJEKKE OM DETTE PÅVIRKER VALG AV BESTE UFØRETIDSPUNKT.      */        
      CALL FINN_BESTE_UFT(TP_UP); /*4410*/                                      
                                                                                
                                                                                
    IF FEIL_MELD_NR > 0 THEN                                                    
       GO TO L999;                                                              
    ELSE                                                                        
       PROGRAM_ID = 'R0014501';                                                 
                                                                                
    /*GARANTI FLYTTET FRA 4522 - 9708 HL :*/                                    
                                                                                
    DØDSDATO_ÅMD= B02.DØDSDATO_ÅMD(BER_EK_IND);                                 
    /*FIXED_DEC5  = F_ALDER(FØDSNUMMER_EK,DØDSDATO_ÅMD)                         
    ALDER_VED_DØD = FIXED_DEC5 */                                               
    ALDER_VED_DØD = F_ALDER(FØDSNUMMER_EK,DØDSDATO_ÅMD);                        
                                                                                
    IF B02.BUP_GAR_KODE(BER_EK_IND,1)  = 'E' THEN                               
       CALL SPT_GARANTI_E(FNR13_EK_R.ÅR_EK,                                     
             W_VIRKDATO_ÅM,RETUR_POENG); /*4199*/                               
    /* MARTIN: 9908 ENDRA TIL FNR13 & VIRKDATO ! */                             
    ELSE                                                                        
     IF B02.TP_GAR_KODE(BER_EK_IND) = 'E'     THEN                              
        CALL UNGE_DØDE_E((B02.VIRK_DATO_ÅMD(BER_SØ_IND)),                       
             FNR13_EK_R.ÅR_EK,ALDER_VED_DØD,RETUR_POENG); /*4327*/              
                                                                                
     IF RETUR_POENG > 0                      THEN                               
        DO;  /* RETUR_POENG > O */                                              
 /*   W_GARANTI_TP      =  G * 0.45 * B02.BUP_GARANTI(BER_EK_IND,1) */          
           W_GARANTI_TP = G * 0.45 * RETUR_POENG;                               
           W_GARANTI_TP = W_GARANTI_TP * B02.TT_ANV(BER_EK_IND) / 40;           
           W_GARANTI_TP = W_GARANTI_TP / 100;                                   
           W_GARANTI_TP = W_GARANTI_TP * B02.TP_PROSENT(BER_SØ_IND);            
           W_GARANTI_TP = W_GARANTI_TP / 12 ;                                   
           W_GAR_TP     = W_GARANTI_TP + 0.5;                                   
                                                                                
           IF W_GAR_TP  >  TP_AVD THEN                                          
              TP_AVD = W_GAR_TP;                                                
        END; /* RETUR_POENG > 0 */                                              
                                                                                
    IF ((B02.FORVENTET(BER_SØ_IND) * 100) <= (0.5 * G)) THEN                    
       B02.FORVENTET(BER_SØ_IND) = 0;                                           
    ELSE                                                                        
       FRADRAGET =  (B02.FORVENTET(BER_SØ_IND) * 100);                          
                                                                                
    IF B02.FRADRAG_2G(BER_SØ_IND) = 'J'       THEN                              
       DO;                                                                      
          IF FRADRAGET < (2 * G)          THEN                                  
             DO;                                                                
                FRADRAGET = 2 * G;                                              
                DIV_PARAM_OMR.FRADRAG_2G = 'J';                                 
             END;                                                               
       END;                                                                     
                                                                                
    IF FRADRAGET > 0        THEN                                                
       FRADRAG_F =  0.4 * (FRADRAGET - (0.5 * G)) / 12;                         
    ELSE                                                                        
       FRADRAG_F = 0;                                                           
                                                                                
    IF B02.ANTALL_BARN(BER_SØ_IND) > 0 THEN                                     
       DO;                                                                      
          CALL BEREGN_BT(W_BT,(B02.UFØRPENS.UFG(BER_SØ_IND)));                  
          B02.UFØRPENS.BT(BER_SØ_IND) = W_BT;                                   
       END;                                                                     
    ELSE                                                                        
       B02.UFØRPENS.BT(BER_SØ_IND) = 0;                                         
                                                                                
 /*                                                                   */        
 /* FINNER INDEKSEN UF_IND FOR SISTE UFØRHIST-SEGMENT                 */        
 /*                                                                   */        
                                                                                
    DO I = 1 TO 7 WHILE(B02.UFT_ÅMD(BER_SØ_IND,I) > 0);                         
       UF_IND = I;                                                              
    END;                                                                        
                                                                                
                                                                                
                                                                                
    IF B02.UFT_ÅMD(BER_SØ_IND,UF_IND) < 19730700 &                              
       B02.UFØRPENS.UFG(BER_SØ_IND)  > 65  &                                    
       B02.UFØRPENS.UFG(BER_SØ_IND) ^= 100 THEN                                 
                                                                                
       DO;                                                                      
          B02.UFØRPENS.GP(BER_SØ_IND) = GP_EGEN;                                
          B02.UFØRPENS.TP(BER_SØ_IND) = TP_UP;                                  
          CALL ÅFT_TILLEGG                                                      
                 ((B02.UFØRPENS.ÅFT(BER_SØ_IND)),ÅFT_MAX,UF_IND);               
       END;                                                                     
                                                                                
    ELSE                                                                        
                                                                                
       DO;                                                                      
                                                                                
                    ÅFT_MAX = 0;                                                
 /* 7.6.84 - HL */  B02.UFØRPENS.ÅFT(BER_SØ_IND) = 0;                           
                                                                                
       END;                                                                     
                                                                                
  /* ENDRINGER FORETATT 9708 HL : */                                            
                                                                                
  IF B02.BUP_GAR_KODE(BER_SØ_IND,1)    =   'E'   THEN                           
     DO;  /* BUP_GAR_KODE SØKER = E */                                          
        IF (B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19910100) THEN                      
           SPT_GARANTI = 1.6;                                                   
        ELSE  /*VIRK 9101 TIL 9112 : */                                         
        IF (B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19920100) THEN                      
           SPT_GARANTI = 2;                                                     
        ELSE /*VIRK 9201 TIL 9204 :*/                                           
        IF (B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19920500) THEN                      
             DO;                                                                
                IF FNR_R13.ÅR     = 1925 THEN                                   
                   SPT_GARANTI = 2;                                             
                ELSE                                                            
                IF FNR_R13.ÅR     > 1925 & /* MARTIN 9908 */                    
                   FNR_R13.ÅR     < 1945 THEN                                   
                   SPT_GARANTI  = 2.5;                                          
             END;                                                               
        ELSE  /*VIRK 9205 TIL 9704 : */                                         
        IF (B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19970500) THEN                      
           DO;                                                                  
              IF FNR_R13.ÅR     = 1925 THEN                                     
                 SPT_GARANTI = 2;                                               
              ELSE                                                              
                 SPT_GARANTI = 3;                                               
           END;                                                                 
        ELSE  /*VIRK 9705 ->       : */                                         
        IF (B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 20080500) THEN                      
           DO;                                                                  
              IF FNR_R13.ÅR     < 1931 THEN                                     
                 SPT_GARANTI = 3;                                               
              ELSE                                                              
                 SPT_GARANTI = 3.3;                                             
           END;                                                                 
        ELSE  /*VIRK 0805 ->       : */                                         
           DO;                                                                  
              IF FNR_R13.ÅR     < 1941 THEN                                     
                 SPT_GARANTI = 3.3;                                             
              ELSE                                                              
                 SPT_GARANTI = 3.5;                                             
           END;                                                                 
                                                                                
        TP_UP_GARANTI  = ( SPT_GARANTI * 0.45 * G );                            
        TP_UP_GARANTI  = TP_UP_GARANTI / 40;                                    
        TP_UP_GARANTI  = TP_UP_GARANTI * B02.TT_ANV(BER_SØ_IND);                
        TP_UP_GARANTI  = TP_UP_GARANTI / 12;                                    
        TP_UP_GARANTI  = TP_UP_GARANTI                                          
                      * UFGRAD / 100;                                           
        TP_GARANTI    = TP_UP_GARANTI + 0.5;                                    
                                                                                
                                                                                
        IF B02.PENSJONSTYPE1(BER_SØ_IND)  = 'Y'  THEN                           
           DO;                                                                  
              TP_GARANTI_YP  = (SPT_GARANTI * 0.45 * G);                        
              TP_GARANTI_YP  = TP_GARANTI_YP / 100;                             
              TP_GARANTI_YP  = TP_GARANTI_YP                                    
                               * B02.YRKEPENS.YUG(BER_SØ_IND);                  
              TP_GARANTI_YP  = TP_GARANTI_YP / (40 * 12);                       
              TP_GARANTI_YP1 = TP_GARANTI_YP + 0.5;                             
                                                                                
           END;                                                                 
        IF (TP_GARANTI + TP_GARANTI_YP1)  >                                     
           (TP_EGEN + B02.ÅFT(BER_SØ_IND))         THEN                         
           DO;                                                                  
              TP_UP   =  TP_GARANTI;                                            
              TP_EGEN = (TP_GARANTI + TP_GARANTI_YP1);                          
              B02.ÅFT(BER_SØ_IND)  = 0;                                         
              B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = 'E';                         
              TP_YP   = TP_GARANTI_YP1;                                         
              B02.YRKEPENS.TP(BER_SØ_IND) = TP_GARANTI_YP1;                     
              B02.UFØRPENS.TP(BER_SØ_IND) = TP_GARANTI;                         
           END;                                                                 
        ELSE                                                                    
              B02.STATUS.TP_GAR_KODE(BER_SØ_IND) = ' ';                         
     END; /* BUP_GAR_KODE SØKER = E */                                          
                                                                                
  /* ---------------------------------------------------------------- */        
  /* DET VISES TIL LOVENS PARAGRAF 12-15 OM SAMMENLIGNENDE BEREGNING. */        
  /* DET FRAMGÅR DER AT SÆRTILLEGG SKAL FASTSETTES ETTER AT DET ER    */        
  /* FORETATT VALG AV "HØYESTE" ALTERNATIV, GARANTI FOR AT YTELSEN    */        
  /* IKKE SKAL BLI MINDRE KOMMER SENERE I PGM.                        */        
  /* ---------------------------------------------------------------- */        
  ETTERLATTEPENSJON = GP_EP + TP_AVD + TP_EGEN_55                               
                                     - FRADRAG_F;                               
  /* MARTIN - SE REMEDY 101 */                                                  
  IF (ETTERLATTEPENSJON < 0) THEN                                               
     ETTERLATTEPENSJON = 0;                                                     
                                                                                
  UFØREPENSJON      = GP_EGEN + TP_EGEN + B02.ÅFT(BER_SØ_IND);                  
                                                                                
                                                                                
  ST_FRADRAG        = TP_EGEN;                                                  
                                                                                
  IF (B02.PENSJONSTYPE3(BER_SØ_IND) = 'A') THEN                                 
     /* TILLEGG 24.10.84 HL - IKKE ST TIL ATTFØRING */                          
     B02.UFØRPENS.ST(BER_SØ_IND) = 0;                                           
  ELSE                                                                          
  IF (B02.BOSATT(BER_SØ_IND)    > 0  &            /*PENSJON UTLAND  */          
      B02.TT_16_66(BER_SØ_IND)  > 0) THEN         /*PENSJON UTLAND  */          
     B02.UFØRPENS.ST(BER_SØ_IND) = F_SÆRTILLEGG_UTLAND_EP                       
                                     (ST_FRADRAG);                              
  ELSE                                                                          
     B02.UFØRPENS.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                         
                                         ST_FRADRAG,                            
                                         ÅFT_MAX,'J',                           
                                         (ST_PROSENT_ENSLIG),                   
                                         (B02.UFØRPENS.UFG(BER_SØ_IND)),        
                                         (B02.TT_ANV(BER_SØ_IND)));             
                                                                                
                                                                                
                                                                                
  /* HIT 24.10.84  HL                                              */           
                                                                                
    ST_FRADRAG = TP_EGEN_55 + TP_AVD;                                           
                                                                                
                                                                                
   IF (B02.BOSATT(BER_SØ_IND)  > 0    &            /*PENSJON UTLAND  */         
       B02.TT_16_66(BER_SØ_IND)  > 0) THEN         /*PENSJON UTLAND  */         
      W_ST = F_SÆRTILLEGG_UTLAND_EP(ST_FRADRAG);                                
   ELSE                                                                         
      DO;                                                                       
         IF B02.DØDSDATO_ÅMD(BER_EK_IND) > 19930000   THEN                      
            BRUKT_TT = B02.TT_ANV(BER_EK_IND);                                  
         ELSE                                                                   
            BRUKT_TT = TT_ANV_UP;                                               
                                                                                
         W_ST = F_BEREGN_SÆRTILLEGG(                                            
                               ST_FRADRAG,                                      
                               0,'J',                                           
                               (ST_PROSENT_ENSLIG),                             
                               100,                                             
                               BRUKT_TT);                                       
      END;                                                                      
   /*-------------------------------------------------------------*/            
   /*NYE REGLER FRA 0193 FOR BEREGNING AV ETTERLATTEPENSJON       */            
   /*VED N I NORSK BOSATT SKAL KUN AVDØDES RETTIGHETER BRUKES VED */            
   /*BEREGNING AV ETTERLATTEDELEN . TRUDE 0193                    */            
   /*-------------------------------------------------------------*/            
 /* **************9911**************                                            
    ST_FRADRAG_AVD    = TP_AVD                                                  
 ******************************************** */                                
    DCL W_ST_AVD   FIXED DEC (5) INIT (0);                                      
                                                                                
 /*IF (B02.BOSATT(BER_EK_IND)    > 0  &              93*/                       
   IF (B02.BOSATT(BER_EK_IND)    > 0  &  /*L OVER SATT INN 28.2.01 JFA*/        
       B02.TT_ANV(BER_EK_IND)    < 40 &            /*9911*/                     
       B02.TT_16_66(BER_EK_IND)  > 0  &                                         
       B02.DØDSDATO_ÅMD(BER_EK_IND) > 19930100 ) THEN                           
         DO;                                                                    
            W_ST_AVD              = F_BEREGN_SÆRTILLEGG(                        
  /*                                     (ST_FRADRAG_AVD), */                   
                                         (ST_FRADRAG),                          
                                         0,'J',                                 
                                         (ST_PROSENT_ENSLIG),                   
                                         100,                                   
                                         (B02.TT_ANV(BER_EK_IND)));             
                                                                                
                                                                                
           CALL NY_EP0193;                       /* R0010193*/                  
           GO TO L999;                                                          
         END;                                                                   
   /*-----TIL HIT 0193--------------------------------------------*/            
                                                                                
                                                                                
    IF B02.GARANTI_TP(BER_SØ_IND) > 0        THEN                               
        IF (G > 34100)                       !                                  
           ((G = 34100) & (TRANSTYPE ^= 27))      THEN                          
       DO;                                                                      
          UP_GARANTI = B02.GARANTI_TP(BER_SØ_IND) - TP_EGEN -                   
                       B02.UFØRPENS.ST(BER_SØ_IND);                             
                                                                                
          IF UP_GARANTI < 0 THEN UP_GARANTI = 0;                                
                                                                                
          EP_GARANTI = B02.GARANTI_TP(BER_SØ_IND) * 0.55 + 0.5                  
                       - TP_EGEN_55 - W_ST;                                     
                                                                                
          IF EP_GARANTI < 0 THEN EP_GARANTI = 0;                                
                                                                                
       END;                                                                     
                                                                                
    IF (B02.STATUS.TP_GAR_KODE(BER_SØ_IND) ) =  'E' &                           
       (ETTERLATTEPENSJON         >  UFØREPENSJON ) THEN                        
       DO;                                             /* 19.12.89    */        
          B02.STATUS.TP_GAR_KODE(BER_SØ_IND)  = ' ';   /* STATUS KODE */        
       END;                                            /*BLANKES.TRUDE*/        
                                                                                
    IF B02.GT_LOV92(BER_SØ_IND) > 0       !                                     
       B02.GT_LOV92(BER_EK_IND) > 0       THEN                                  
       DO;                                                                      
          CALL BEREGN_TP_ETTERLATT_GARANTI;            /*4523*/                 
                                                                                
             IF (GAR92_EGEN_55 + GAR92_AVD) >                                   
                                (TP_EGEN_55 + TP_AVD)       THEN                
                ETTERLATTEPENSJON = ETTERLATTEPENSJON                           
                              + (GAR92_EGEN_55 + GAR92_AVD)                     
                              - (TP_EGEN_55 + TP_AVD);                          
             IF GAR92_EGEN > TP_EGEN             THEN                           
                UFØREPENSJON = UFØREPENSJON + GAR92_EGEN - TP_EGEN;             
                                                                                
                                                                                
          IF ETTERLATTEPENSJON > UFØREPENSJON       THEN                        
             DO;                                                                
               IF (GAR92_EGEN_55 + GAR92_AVD) >                                 
                                (TP_EGEN_55 + TP_AVD)       THEN                
                  DO;                                                           
                     B02.GT_LOV92(BER_SØ_IND) =                                 
                                        (GAR92_EGEN_55 + GAR92_AVD);            
                     B02.GT_TILLEGG_LOV92(BER_SØ_IND) =                         
                                     B02.GT_LOV92(BER_SØ_IND)                   
                                   - TP_EGEN_55                                 
                                   - TP_AVD                                     
                                   - W_ST;                                      
                     IF B02.GT_TILLEGG_LOV92(BER_SØ_IND) < 0   THEN             
                        B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                   
                  END;                                                          
               ELSE                                                             
                  DO;                                                           
                     B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                      
                   /* TEST PÅ FT_SKAL_BER..VAR GLEMT HER. TRUDE 0892*/          
                     IF B02.FT_SKAL_BEREGNES(BER_SØ_IND) = ' ' THEN             
                        B02.GT_LOV92(BER_SØ_IND) = 0;                           
                  END;                                                          
             END;                                                               
          ELSE                                                                  
             DO;                                                                
               IF GAR92_EGEN > TP_EGEN             THEN                         
                  DO;                                                           
                     B02.GT_LOV92(BER_SØ_IND) = GAR92_EGEN;                     
                     B02.GT_TILLEGG_LOV92(BER_SØ_IND) =                         
                                     B02.GT_LOV92(BER_SØ_IND)                   
                                   - TP_EGEN                                    
                                   - B02.UFØRPENS.ST(BER_SØ_IND);               
                     IF B02.GT_TILLEGG_LOV92(BER_SØ_IND) < 0  THEN              
                        B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                   
                  END;                                                          
               ELSE                                                             
                  DO;                                                           
                     B02.GT_LOV92(BER_SØ_IND) = 0;                              
                     B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                      
                  END;                                                          
             END;                                                               
       END;                                                                     
                                                                                
  /*  IF ETTERLATTEPENSJON > UFØREPENSJON       THEN */                         
      IF (ETTERLATTEPENSJON > UFØREPENSJON !                                    
          B02.UFØRPENS.UFG(BER_SØ_IND) = 0 ) THEN                               
 /*    OPPDATERER UFØRPENS-SEGMENTET OG ETTEPENS-SEGMENTET            */        
 /* YS : OG EVT YRKEPENS                                              */        
                                                                                
       DO;  /* ETTERLATTEPENSJON > UFØREPENSJON */                              
                                                                                
    IF B02.YRKEPENS.YPT(BER_SØ_IND) > 0     THEN                                
       DO;                                                                      
          B02.YRKEPENS.SPT(BER_SØ_IND) =                                        
                               POREKKE.SPT(BER_SØ_IND);                         
          IF (POREKKE.SPT(BER_SØ_IND) >                                         
                  B02.YRKEPENS.YPT(BER_SØ_IND)  )     &                         
             (POREKKE.SPT(BER_SØ_IND) >                                         
                  B02.YRKE_POENG_1291(BER_SØ_IND)  )   THEN                     
          DO;                                                                   
             B02.YRKEPENS.YPT(BER_SØ_IND) =                                     
                                POREKKE.SPT(BER_SØ_IND);                        
             B02.YRKEPENS.YPT_KODE(BER_SØ_IND) = 'V';                           
          END;                                                                  
       END;                                                                     
                                                                                
          B02.UFØRPENS.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);              
          B02.UFØRPENS.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);              
          B02.UFØRPENS.PÅ(BER_SØ_IND)   = POREKKE.PÅ(BER_SØ_IND);               
          B02.UFØRPENS.GP(BER_SØ_IND)   = 0;                                    
          B02.UFØRPENS.TP(BER_SØ_IND)   = TP_UP_55;                             
 /*       B02.STATUS.TT_ANV(BER_SØ_IND) = TT_ANV_EP  200211 HL*/                
          B02.STATUS.TT_ANV(BER_SØ_IND) = TT_ANV_UP;                            
          B02.GP_BRUTTO(BER_SØ_IND)     = GP_EP;                                
          B02.TP_BRUTTO(BER_SØ_IND)     = TP_AVD;                               
          B02.SPT_AVD(BER_SØ_IND)       = POREKKE.SPT(BER_EK_IND);              
          B02.OPT_AVD(BER_SØ_IND)       = POREKKE.OPT(BER_EK_IND);              
          B02.PÅ_AVD(BER_SØ_IND)        = POREKKE.PÅ (BER_EK_IND);              
          B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) =                                 
                                 POREKKE.PÅ_ETTER91 (BER_EK_IND);               
          B02.YRKEPENS.GP(BER_SØ_IND)   = 0;                                    
          B02.YRKEPENS.TP(BER_SØ_IND)   = TP_YP_55;                             
                                                                                
                                                                                
                                                                                
        B02.UFØRPENS.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(            
                                      B02.PENSJONSTYPE1(BER_SØ_IND),            
                                      B02.PENSJONSTYPE2(BER_SØ_IND),            
                                      B02.TT_ANV(BER_SØ_IND),0,1,'J');          
                                                                                
  /*      IF B02.FORVENTET(BER_SØ_IND) * 100 <= 0.5 * G     THEN*/              
          /* STMT UNDER ER FLYTTA HIT REMEDY 101 MARTIN */                      
          B02.ETTEPENS.ST_BRUTTO(BER_SØ_IND) = W_ST;                            
          IF FRADRAG_F = 0                THEN                                  
             DO;                                                                
               B02.ETTEPENS.ST(BER_SØ_IND) = W_ST;                              
  /* MOVE      B02.ETTEPENS.ST_BRUTTO(BER_SØ_IND) = W_ST  */                    
               B02.GP_NETTO(BER_SØ_IND) = B02.GP_BRUTTO(BER_SØ_IND);            
               B02.TP_NETTO(BER_SØ_IND) = B02.TP_BRUTTO(BER_SØ_IND);            
               IF B02.GT_LOV92(BER_SØ_IND) > 0       THEN                       
                  B02.GT_TILLEGG_LOV92(BER_SØ_IND) =                            
                                    B02.GT_LOV92(BER_SØ_IND)                    
                                 -  B02.ETTEPENS.ST(BER_SØ_IND)                 
                                 -  B02.TP_NETTO(BER_SØ_IND)                    
                                 -  B02.UFØRPENS.TP(BER_SØ_IND)                 
                                 -  B02.YRKEPENS.TP(BER_SØ_IND);                
                                                                                
               IF B02.GT_TILLEGG_LOV92(BER_SØ_IND) < 0     THEN                 
                  B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                         
                                                                                
             END;                                                               
                                                                                
          ELSE                                                                  
                                                                                
             CALL JUSTER_MED_FORVENTET_INNTEKT(0);                              
                                                                                
                                                                                
          ETTERLATTEPENSJON = B02.ETTEPENS.GP_NETTO(BER_SØ_IND) +               
                              B02.GT_TILLEGG_LOV92(BER_SØ_IND)  +               
                              B02.ETTEPENS.TP_NETTO(BER_SØ_IND) +               
                              B02.UFØRPENS.TP(BER_SØ_IND)       +               
                              B02.YRKEPENS.TP(BER_SØ_IND);                      
                                                                                
                                                                                
          IF ETTERLATTEPENSJON + B02.ETTEPENS.ST(BER_SØ_IND) <                  
             UFØREPENSJON      +                                                
             B02.UFØRPENS.ST(BER_SØ_IND)  THEN                                  
             /* GARANTI ETTER LOVENS PARAGRAF ... */                            
             DO;  /* REMEDY 208 - MARTIN 290403 - ST_BRUTTO GLEMT */            
                B02.ETTEPENS.ST(BER_SØ_IND) =                                   
                   UFØREPENSJON +                                               
                   B02.UFØRPENS.ST(BER_SØ_IND) -                                
                   ETTERLATTEPENSJON;                                           
                B02.ETTEPENS.ST_BRUTTO(BER_SØ_IND) =                            
                   B02.ETTEPENS.ST(BER_SØ_IND);                                 
             END; /* REMEDY 208 - MARTIN 290403 - ST_BRUTTO GLEMT */            
                                                                                
          IF B02.GT_TILLEGG_LOV92(BER_SØ_IND)  > 0      THEN                    
             IF B02.GT_TILLEGG_LOV92(BER_SØ_IND)  <                             
                        B02.ETTEPENS.ST(BER_SØ_IND)    THEN                     
                DO;                                                             
                   B02.ETTEPENS.ST(BER_SØ_IND) =                                
                      B02.ETTEPENS.ST(BER_SØ_IND)                               
                    - B02.GT_TILLEGG_LOV92(BER_SØ_IND);                         
                   B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0;                        
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   B02.GT_TILLEGG_LOV92(BER_SØ_IND)  =                          
                             B02.GT_TILLEGG_LOV92(BER_SØ_IND)                   
                           - B02.ETTEPENS.ST(BER_SØ_IND);                       
                   B02.ETTEPENS.ST(BER_SØ_IND) = 0;                             
                END;                                                            
                                                                                
          B02.ÅFT(BER_SØ_IND)         = 0;                                      
          B02.ETTEPENS.KT(BER_SØ_IND) = 0;                                      
          B02.UFØRPENS.ST(BER_SØ_IND) = 0;                                      
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                            
                                                                                
  IF G > 34100 THEN                                                             
     IF B02.UFØRPENS.KT(BER_SØ_IND) > B02.ETTEPENS.ST(BER_SØ_IND) THEN          
        B02.UFØRPENS.KT(BER_SØ_IND) =                                           
        B02.UFØRPENS.KT(BER_SØ_IND) - B02.ETTEPENS.ST(BER_SØ_IND);              
     ELSE                                                                       
        B02.UFØRPENS.KT(BER_SØ_IND) = 0;                                        
  ELSE;                                                                         
                                                                                
          B02.SUM_YTELSE(BER_SØ_IND)  = ETTERLATTEPENSJON +                     
                B02.ETTEPENS.ST(BER_SØ_IND) +                                   
                B02.UFØRPENS.KT(BER_SØ_IND) +                                   
                EP_GARANTI                  +  /*HL*/                           
                B02.UFØRPENS.BT(BER_SØ_IND);                                    
          DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = EP_GARANTI;             
  /*OPPDRAG 04269 - HL 200502 : */                                              
     IF B02.LØNNSTILSKUDD(BER_SØ_IND) = 'J'      THEN                           
        DO;                                                                     
           B02.INNTEKTSKODE1(BER_SØ_IND) = 'A';                                 
           B02.INNTEKTSKODE2(BER_SØ_IND) = '0';                                 
           B02.UFØRPENS.LOVLIG_INNTEKT(SØKER_IND) = 0;                          
        END;                                                                    
     ELSE                                                                       
          CALL OPPDATER_INNTEKTSGRENSE(BER_SØ_IND);                             
      /*  B02.UFØRPENS.LOVLIG_INNTEKT(BER_SØ_IND) =   /*= 0 */                  
      /*     B_LOVLIG_INNT                                                      
                ((B02.UFØRHIST.UFT_ÅMD(SØKER_IND,1)),                           
                 (B02.UFØRPENS.UFG(SØKER_IND)),                                 
                 (B02.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND)),                      
                 (B02.UFØRPENS.INNT_DATO_ÅMD(SØKER_IND)),                       
                 (B02.UFØRPENS.REAKTIVISERING(SØKER_IND)),                      
          /*     (B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND)), */                    
         /*      (B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND)),                     
                 (B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1)),                      
                 (B02.STATUS.YRKES_KODE(SØKER_IND)),                            
                 (DIV_PARAM_OMR.DATO_2000)); */                                 
       END; /* ETTERLATTEPENSJON > UFØREPENSJON */                              
    ELSE                                                                        
       DO;  /* UFØREPENSJON >= ETTERLATTEPENSJON */                             
 /*                                                                   */        
 /*       UFØREPENSJONEN STØRRE ELLER LIK ETTERLATTE-ALTERNATIVET     */        
          IF B02.SIVILSTAND(BER_SØ_IND) ^= 'S'    THEN                          
             POREKKE(BER_SØ_IND) = POREKKE(14);                                 
                                                                                
      /*  DIV_PERIODE.BRUK_AVDØDES_TT = ' ';  /*NY 200410 HL*/                  
          B02.UFØRPENS.TP(BER_SØ_IND)   = TP_UP_55;                             
          B02.YRKEPENS.TP(BER_SØ_IND)   = TP_YP_55;                             
 /*YS     B02.YRKEPENS.TP(BER_SØ_IND)  ER OPPDATERT VED CALL 4425*/             
          B02.YRKEPENS.GP(BER_SØ_IND)   = GP_YP;                                
          B02.UFØRPENS.GP(BER_SØ_IND)   = GP_UP;                                
          B02.GP_BRUTTO(BER_SØ_IND)     = GP_EP;                                
          B02.TP_BRUTTO(BER_SØ_IND)     = TP_AVD;                               
                                                                                
          /* REMEDY 283: TESTES VED 9H21 */                                     
          B02.ETTEPENS.ST_BRUTTO(BER_SØ_IND) = 0;                               
      /*  B02.ETTEPENS.ST_BRUTTO(BER_SØ_IND) = W_ST; */                         
                                                                                
   /*     IF B02.FORVENTET(BER_SØ_IND) * 100 <= 0.5 * G     THEN*/              
          IF FRADRAG_F = 0                     THEN                             
             B02.ETTEPENS.ST(BER_SØ_IND) = W_ST;                                
          ELSE                                                                  
             DO;                                                                
                IF B02.GT_TILLEGG_LOV92(BER_SØ_IND) = 0    THEN                 
                   CALL JUSTER_MED_FORVENTET_INNTEKT(0);                        
                ETTERLATTEPENSJON = B02.GP_NETTO   (BER_SØ_IND) +               
                                    B02.TP_NETTO   (BER_SØ_IND) +               
                                    B02.UFØRPENS.TP(BER_SØ_IND) +               
                                    B02.YRKEPENS.TP(BER_SØ_IND);                
             END;                                                               
                                                                                
                                                                                
          B02.UFØRPENS.SPT(BER_SØ_IND)  = POREKKE.SPT(BER_SØ_IND);              
          B02.UFØRPENS.OPT(BER_SØ_IND)  = POREKKE.OPT(BER_SØ_IND);              
          B02.UFØRPENS.PÅ(BER_SØ_IND)   = POREKKE.PÅ(BER_SØ_IND);               
          B02.UFØRPENS.TP(BER_SØ_IND)   = TP_UP;                                
          B02.UFØRPENS.GP(BER_SØ_IND)   = GP_UP;                                
          B02.YRKEPENS.TP(BER_SØ_IND)   = TP_YP;                                
          B02.YRKEPENS.GP(BER_SØ_IND)   = GP_YP;                                
          B02.STATUS.TT_ANV(BER_SØ_IND) = TT_ANV_UP;                            
          B02.GP_BRUTTO(BER_SØ_IND)     = 0;                                    
          B02.GP_NETTO(BER_SØ_IND)      = 0;                                    
          B02.ETTEPENS.KT(BER_SØ_IND)   = 0;                                    
          B02.TP_BRUTTO(BER_SØ_IND)     = 0;                                    
          B02.TP_NETTO(BER_SØ_IND)      = 0;     /* TRUDE          */           
          B02.SPT_AVD(BER_SØ_IND)       = POREKKE.SPT(BER_EK_IND);              
          B02.OPT_AVD(BER_SØ_IND)       = POREKKE.OPT(BER_EK_IND);              
          B02.PÅ_AVD(BER_SØ_IND)        = POREKKE.PÅ(BER_EK_IND);               
          B02.ETTEPENS.PÅ_ETTER91(BER_SØ_IND) =                                 
                                 POREKKE.PÅ_ETTER91 (BER_EK_IND);               
                                                                                
          B02.POENGTILLEGG_DATO_ÅMD(BER_SØ_IND) = 0;                            
          B02.POENGTILLEGG_DATO_ÅMD(BER_EK_IND) = 0;                            
          B02.POENGTILLEGG_KODE   (BER_SØ_IND) = ' ';                           
          B02.POENGTILLEGG_KODE   (BER_EK_IND) = ' ';                           
                                                                                
                                                                                
        B02.UFØRPENS.KT(BER_SØ_IND) = F_BEREGN_KOMPENSASJONSTILLEGG(            
                                      B02.PENSJONSTYPE1(BER_SØ_IND),            
                                      B02.PENSJONSTYPE2(BER_SØ_IND),            
                                      B02.TT_ANV(BER_SØ_IND),0,1,'J');          
                                                                                
          /* TILLEGGSTEST MARTIN - REMEDY 101 */                                
          IF (B02.UFØRPENS.UFG(BER_SØ_IND) > 0) THEN                            
             IF ETTERLATTEPENSJON + B02.ETTEPENS.ST(BER_SØ_IND) >=              
               (UFØREPENSJON + B02.UFØRPENS.ST(BER_SØ_IND)) THEN                
                                                                                
                B02.UFØRPENS.ST(BER_SØ_IND) = ETTERLATTEPENSJON +               
                      B02.ETTEPENS.ST(BER_SØ_IND) -                             
                      (UFØREPENSJON );                                          
                                                                                
          B02.ETTEPENS.ST(BER_SØ_IND) = 0;                                      
                                                                                
 /*KOMP.TILLEGGET ENDRET FRA 1.5.91 ( G > 34100 ) */                            
                                                                                
  /*OPPDRAG 04269 - HL 200502 : */                                              
                                                                                
   IF B02.LØNNSTILSKUDD(BER_SØ_IND) = 'J'      THEN                             
      DO;                                                                       
         B02.INNTEKTSKODE1(BER_SØ_IND) = 'A';                                   
         B02.INNTEKTSKODE2(BER_SØ_IND) = '0';                                   
         B02.UFØRPENS.LOVLIG_INNTEKT(SØKER_IND) = 0;                            
      END;                                                                      
   ELSE                                                                         
   CALL OPPDATER_INNTEKTSGRENSE(BER_SØ_IND);                                    
   /*                                                                           
   B02.UFØRPENS.LOVLIG_INNTEKT(BER_SØ_IND) =                                    
      B_LOVLIG_INNT                                                             
         ((B02.UFØRHIST.UFT_ÅMD(SØKER_IND,1)),                                  
          (B02.UFØRPENS.UFG(SØKER_IND)),                                        
          (B02.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND)),                             
          (B02.UFØRPENS.INNT_DATO_ÅMD(SØKER_IND)),                              
          (B02.UFØRPENS.REAKTIVISERING(SØKER_IND)),                             
      /*  (B02.UFØRPENS.TIDSBEGR_ATTF(SØKER_IND)), */                           
   /*     (B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND)),                            
          (B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1)),                             
          (B02.STATUS.YRKES_KODE(SØKER_IND)),                                   
          (DIV_PARAM_OMR.DATO_2000));                                           
          */                                                                    
  IF G > 34100 THEN                                                             
     IF B02.UFØRPENS.KT(BER_SØ_IND) > B02.UFØRPENS.ST(BER_SØ_IND) THEN          
        B02.UFØRPENS.KT(BER_SØ_IND) =                                           
        B02.UFØRPENS.KT(BER_SØ_IND) - B02.UFØRPENS.ST(BER_SØ_IND);              
     ELSE                                                                       
        B02.UFØRPENS.KT(BER_SØ_IND) = 0;                                        
  ELSE;                                                                         
                                                                                
                                                                                
          B02.SUM_YTELSE(BER_SØ_IND)  =  UFØREPENSJON +                         
   /*TRUDE 230692                B02.GT_TILLEGG_LOV92(BER_SØ_IND)   + */        
                                         B02.UFØRPENS.ST(BER_SØ_IND) +          
                                         B02.UFØRPENS.KT(BER_SØ_IND) +          
  /*HL*/                                 UP_GARANTI                  +          
                                         B02.UFØRPENS.BT(BER_SØ_IND);           
          DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = UP_GARANTI;             
                                                                                
       END; /* UFØREPENSJON >= ETTERLATTEPENSJON */                             
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 HENT_FRA_EP : PROC;                                                            
    %INCLUDE P0010801;   /*  TRANS OMRÅDE ETTERLATTEPENSJON      */             
    IF EPS.YSKADE_TILLEGG = 'J'         THEN                                    
       TILLEGGSBLANKETT_YRKESSKADE = 'J';                                       
 END HENT_FRA_EP;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 HENT_FRA_E3 : PROC;                         /*NY0191*/                         
   %INCLUDE P001N801;   /*  TRANS OMRÅDE ETTERLATTEPENSJON      */              
   IF E3S.YSKADE_TILLEGG = 'J'         THEN                                     
      TILLEGGSBLANKETT_YRKESSKADE = 'J';                                        
   /* BEREGNING ETTER TT KONVENSJON VAR GLEMT. TRUDE 240293   */                
   IF E3SP.BEREGNING_KONVENSJON   = 'J'    THEN                                 
      DO;                                                                       
         W_BEREGNING_KONVENSJON      = 'J';                                     
         W_KONVENSJON_ÅR             = E3SP.TT_KONVENSJON_ÅR;                   
      END;                                                                      
 END HENT_FRA_E3;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 HENT_FRA_EE : PROC;                                                            
    %INCLUDE P001U801;                                                          
    IF EES.YSKADE_TILLEGG = 'J'         THEN                                    
       TILLEGGSBLANKETT_YRKESSKADE = 'J';                                       
    IF EESP.TT_KONVENSJON_ÅR_EK > 0 THEN                                        
       DO;                                                                      
          W_BEREGNING_KONVENSJON = 'J';                                         
          W_KONVENSJON_ÅR        = EESP.TT_KONVENSJON_ÅR_EK;                    
       END;                                                                     
 END HENT_FRA_EE;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 HENT_FRA_UP : PROC;                                                            
    %INCLUDE P0010601;   /*  TRANS OMRÅDE UFØREPENSJON           */             
    U_UFT_ÅMD = TRANS_OMR.UPS.UFT_ÅMD;                                          
 END HENT_FRA_UP;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 HENT_FRA_U2 : PROC;                                                            
    %INCLUDE P001N601;   /*  TRANS OMRÅDE UFØREPENSJON           */             
    U_UFT_ÅMD = TRANS_OMR.U2S.UFT_ÅMD;                                          
 END HENT_FRA_U2;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 HENT_FRA_U3 : PROC;                                                            
    %INCLUDE P001U601;   /*  TRANS OMRÅDE UFØREPENSJON           */             
    U_UFT_ÅMD = TRANS_OMR.U3S.UFT_ÅMD;                                          
 END HENT_FRA_U3;                                                               
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
        %INCLUDE R0014128;   /*  BEREGN_POENG_AÅI_AVDØD              */         
        %INCLUDE R0014133;   /*  F_BEREGN_SÆRTILLEGG                 */         
        %INCLUDE R0014134;   /*  F_BEREGN_KOMPENSASJONSTILLEGG       */         
        %INCLUDE R0014142;   /*  F_TILLEGGSPENSJON                   */         
        %INCLUDE R0014148;   /*  F_TP92                              */         
        %INCLUDE R0014143;   /*  POENG_TILLEGG                       */         
        %INCLUDE R0014153;   /*  BEREGN_SPT_OPT_PÅ                   */         
        %INCLUDE R0014156;   /*  BEREGN_SPT_OPT_PÅ_ALT               */         
        %INCLUDE R0014183;   /*  F_SÆRTILLEGG_UTLAND_EP              */         
        %INCLUDE R0014199;   /*  SPT_GARANTI_E                       */         
        %INCLUDE R0014233;   /*  BEREGN_BT             30.1.86 - HL  */         
        %INCLUDE R0014322;   /*  REGN_TT_67_TIL_70_DØD               */         
        %INCLUDE R0014324;   /*  JUSTER_MED_FORVENTET_INNTEKT        */         
        %INCLUDE R0014327;   /*  UNGE_DøDE_E                         */         
        %INCLUDE R0014410;   /*  FINN_BESTE_UFT                      */         
        %INCLUDE R0014423;   /*  OPPDATER_GAMMEL_UFØRHISTORIKK       */         
        %INCLUDE R0014424;   /*  BEREGN_POENG_AV_AÅI                 */         
        %INCLUDE R0014425;   /*  BEREGN_TP_YP                        */         
    /*  %INCLUDE R0014427    /*  B_LOVLIG_INNT                       */         
        %INCLUDE R0014428;   /*  OPPDATER INNTEKSGRENSE OG KODER     */         
        %INCLUDE R0014431;   /*  ÅFT_TILLEGG          - BRUK 4233 -  */         
        %INCLUDE R0014521;   /*  BEREGN_GP_ETTERLATT_UP              */         
        %INCLUDE R0014522;   /*  BEREGN_TP_ETTERLATT_UP              */         
        %INCLUDE R0014523;   /*  BEREGN_TP_ETTERLATT_GARANTI         */         
        %INCLUDE R0014525;   /*  NY_EP0193                         93*/         
        %INCLUDE R0014580;   /*  BEREGN_GP_ETTERLATT_UP_UTLAND TRUDE */         
        %INCLUDE R0019905;   /*  F_ALDER                             */         
        %INCLUDE R0019995;   /*  KONV_FNR11_FNR13    2000-3          */         
                                                                                
                                                                                
  L999:                                                                         
                                                                                
  END R001450;                                                                  
