 /*       SIST ENDRET 25/08-99 08.56.56 AV   JDA7339                  */00000000
 /*       SIST ENDRET 22/06-98 10.22.03 AV   JDA7339                  */00000010
 /*       SIST ENDRET 17/06-98 09.46.01 AV   RFA9991                  */00000020
 /*       SIST ENDRET 19/09-90 14.53.13 AV   DYBVIK                   */00000030
 /*       SIST ENDRET 05/07-90 09.24.22 AV   DYBVIK                   */00000040
 /* ******************************************************************/ 00000050
 /* IDENTIFIKASJON                                                    */00000060
 /*     R0014183 - F_SÆRTILLEGG_UTLAND    FUNKSJON  I PLI.            */00000070
 /*     PROGRAMMERER: TRUDE SPONBERG JANUAR 1990                      */00000080
 /* HENSIKT                                                           */00000090
 /*     BEREGNE SÆRTILLEGG - BOSATT I UTLANDET                        */00000100
 /* PROGRAMTILKNYTNING                                                */00000110
 /*     PROSEDYREN BLIR INKLUDERT I OVERLIGGENDE PROGRAM.             */00000120
 /* BRUK                                                              */00000130
 /*     ST = F_SÆRTILLEGG(SUM_TP,ÅFT_MAX,FORH_INDIKATOR,              */00000140
 /*                              ST_PROSENT,GRAD,TT_ANV)              */00000150
 /* ENDRET :                                                          */00000160
 /* ***************************************************************** */00000170
                                                                        00000180
 F_SÆRTILLEGG_UTLAND_EP:                                                00000190
  PROC(SUM_TP) RETURNS(FIXED DEC (5));                                  00000200
                                                                        00000210
   DCL SUM_TP                   FIXED DEC (5);                          00000220
   DCL W_ST_UTLAND              FIXED DEC (5) INIT (0);                 00000230
   DCL TT_ETTER_1966_EGEN       FIXED DEC (3) INIT (0),                 00000240
       TT_ETTER_1966_EK         FIXED DEC (3) INIT (0),                 00000250
       TT_ETTER_1966_ANV        FIXED DEC (3) INIT (0);                 00000260
                                                                        00000270
   DCL A                        BIT (1) INIT ('0'B),                    00000280
       B                        BIT (1) INIT ('0'B),                    00000290
       C                        BIT (1) INIT ('0'B);                    00000300
                                                                        00000310
                                                                        00000320
                                                                        00000330
                                                                        00000340
   /*------------------------------------------------------------*/     00000350
   /*-TESTER ST EP FRA HIT . TRUDE 090590------------------------*/     00000360
   /*------------------------------------------------------------*/     00000370
                                                                        00000380
    TT_ETTER_1966_EGEN = (B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12;     00000390
    TT_ETTER_1966_EK   = (B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12;     00000400
                                                                        00000410
    IF TT_ETTER_1966_EGEN   <=   TT_ETTER_1966_EK  THEN                 00000420
       TT_ETTER_1966_ANV    =   TT_ETTER_1966_EK;                       00000430
                                                                        00000440
                                            /*--------------------*/    00000450
                                            /*BEREGN.REGL.6.1.4.1 */    00000460
                                            /*--------------------*/    00000470
                                            /*--------------------*/    00000480
                                            /*BEREGN.REGL.6.1.4.2 */    00000490
                                            /*--------------------*/    00000500
                                            /*----NR 1-2.2-2.3----*/    00000510
                                            /*--------------------*/    00000520
                                                                        00000530
   /*------------------------------------------------------------*/     00000540
   /*-ALLE DISSE FÅR SÆRTILLEGG BEREGNET ETTER SAMME TT SOM GP   */     00000550
   /*------------------------------------------------------------*/     00000560
                                                                        00000570
    IF (B02.TT_FØR_1967(BER_SØ_IND) = 0 &                               00000580
        B02.TT_FØR_1967(BER_EK_IND) = 0 ) !   /*1.INGEN HAR TT FØR 67*/ 00000590
       (B01.BOSATT(BER_SØ_IND)      = 0 &     /*2.BOSATT VED KRAV    */ 00000600
        B01.ETTEPENS.ST(BER_SØ_IND) > 0 ) THEN  /*FLYTTER TIL UTLAND */ 00000610
           DO;                                                          00000620
                 W_ST_UTLAND = F_BEREGN_SÆRTILLEGG(                     00000630
                                           SUM_TP,                      00000640
                                           0,                           00000650
                                           'J',                         00000660
                                           (ST_PROSENT_ENSLIG),         00000670
                                           100,                         00000680
                                           (B02.TT_ANV(BER_SØ_IND)));   00000690
                 A = '1'B;                                              00000700
           END;                                                         00000710
    IF (B02.TT_FØR_1967(BER_SØ_IND)  > 0 !                              00000720
        B02.TT_FØR_1967(BER_EK_IND)  > 0 ) &                            00000730
       (B02.TT_ETTER_1966(BER_SØ_IND)  > 0 !                            00000740
        B02.TT_ETTER_1966(BER_EK_IND)  > 0 ) THEN                       00000750
      DO;                                                               00000760
         IF (B02.FRAVIK_19_3(BER_SØ_IND) = '2'   !                      00000770
             B02.FRAVIK_19_3(BER_SØ_IND) = '5'   !     /*ETTER 19-3  */ 00000780
             B02.FRAVIK_19_3(BER_SØ_IND) = '7' ) !     /*ETTER 19-3  */ 00000790
            (B02.FRAVIK_10_1(BER_SØ_IND) = 'J' ) THEN    /* DISP.  */   00000800
                                              /*  ETTER 10-1 PARA.13 */ 00000810
           DO;                                                          00000820
             W_ST_UTLAND                 = F_BEREGN_SÆRTILLEGG(         00000830
                                           SUM_TP,                      00000840
                                           0,                           00000850
                                           'J',                         00000860
                                           (ST_PROSENT_ENSLIG),         00000870
                                           100,                         00000880
                                           (B02.TT_ANV(BER_SØ_IND)));   00000890
             B = '1'B;                                                  00000900
           END;                                                         00000910
                /*--------------------------------------------------*/  00000920
                /*I TILFELLENE NEDENFOR, HENVISES DET TIL SAMME TT  */  00000930
                /*SOM GRUNNPENSJON. DENNE HAR VI TIDLIGERE REGNET OG*/  00000940
                /*LAGT INN I B02.TT_ANV.                            */  00000950
                /*--------------------------------------------------*/  00000960
                                                                        00000970
                                                                        00000980
                                                                        00000990
         IF (B02.FRAVIK_19_3(BER_SØ_IND) = '8' ) &                      00001000
            (B02.TRYGDET_DØD(BER_SØ_IND) = 'J' !                        00001010
             B02.TRYGDET_DØD(BER_EK_IND) = 'J' ) !                      00001020
            (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) = 'J' !                    00001030
             B02.TRYGDET_3ÅR_DØD(BER_EK_IND) = 'J' ) THEN               00001040
           DO;                                                          00001050
             W_ST_UTLAND  = F_BEREGN_SÆRTILLEGG                         00001060
                               (                                        00001070
                                SUM_TP,                                 00001080
                                0,                                      00001090
                                'J',                                    00001100
                                (ST_PROSENT_ENSLIG),                    00001110
                                100,                                    00001120
                                (B02.TT_ANV(BER_SØ_IND)));              00001130
             C   = '1'B;                                                00001140
           END;                                                         00001150
      END;                                                              00001160
                                                                        00001170
                  /*-----------------------------------------------*/   00001180
                  /*DERSOM VI IKKE HAR FÅTT REGNET ST TIL NÅ,      */   00001190
                  /*SKAL ST REGNES KUN MED TT_ETTER_1966    TRUDE -*/   00001200
                  /*-----------------------------------------------*/   00001210
      IF A = '0'B   &                                                   00001220
         B = '0'B   &                                                   00001230
         C = '0'B   THEN                                                00001240
             W_ST_UTLAND = F_BEREGN_SÆRTILLEGG                          00001250
                              (                                         00001260
                               SUM_TP,                                  00001270
                               0,                                       00001280
                               'J',                                     00001290
                               (ST_PROSENT_ENSLIG),                     00001300
                               100,                                     00001310
                               TT_ETTER_1966_ANV);                      00001320
                                                                        00001330
              /*------------------------------------------------------*/00001340
              /*DERSOM BARE RETTIGHETER ETTER KAP11 IKKE ST!!!!!!     */00001350
              /*------------------------------------------------------*/00001360
                                                                        00001370
       IF B02.DØD_AV_YRKESSKADE(BER_SØ_IND) = 'E' &                     00001380
          B02.YRKEPENS.YUG(BER_EK_IND)               = 100 THEN         00001390
          W_ST_UTLAND                       = 0;                        00001400
                                                                        00001410
   RETURN(W_ST_UTLAND);                                                 00001420
  END F_SÆRTILLEGG_UTLAND_EP;                                           00001430
