 /*       SIST ENDRET 04/05-98 13.26.04 AV   JDA7339                  */00000000
 /*       SIST ENDRET 11/03-98 12.06.22 AV   JDA7339                  */00000010
 /* **************************************************************** */ 00000020
 /*IDENTIFIKASJON:                                                   */ 00000030
 /*    R0017049 - PROSEDYRE I PLI                                    */ 00000040
 /*    PROGRAMMERER: JAN DYBVIK JULI 1988                            */ 00000050
 /*HENSIKT:                                                          */ 00000060
 /*    RUTINEN SETTER INN KODER FOR TEKSTTYPE V I TEKSTTABELLEN FOR  */ 00000070
 /*    STØNADSBREV GJELDER KUN KAP.11                                */ 00000080
 /*PROGRAMTILKNYTNING:                                               */ 00000090
 /*    KALLES OPP AV PROGRAM R0017001                                */ 00000100
 /*    INCLUDES I R0017001;                                          */ 00000110
 /*BRUK:                                                             */ 00000120
 /*   CALL YRKE_TEKSTTYPE_V_KODE(IND)                                */ 00000130
 /* **************************************************************** */ 00000140
 %PAGE;                                                                 00000150
 YRKE_TEKSTTYPE_V_KODE:                                                 00000160
   PROC(IND);                                                           00000170
 %PAGE;                                                                 00000180
   DCL                                                                  00000190
      IND                     FIXED BIN (15);                           00000200
                                                                        00000210
   DCL                                                                  00000220
      W_HELP_ÅMD              PIC '99999999',                           00000230
      W_HELP_M  DEF W_HELP_ÅMD POS (5) PIC '99',                        00000240
      W_HELP_Å  DEF W_HELP_ÅMD POS (1) PIC '9999',                      00000250
      W_VIRK_ÅMD              PIC '99999999',                           00000260
      W_VIRK_Å  DEF W_VIRK_ÅMD POS (1) PIC '9999',                      00000270
      W_VIRK_M  DEF W_VIRK_ÅMD POS (5) PIC '99',                        00000280
      W_VIRK_ÅMD_FIX          FIXED DEC (9);                            00000290
   DCL HUNDREDEL              FIXED DEC (9);                            00000300
                                                                        00000310
                                                                        00000320
 /* ***************************************************************** */00000330
 /* PROGRAMMET STARTER HER                                            */00000340
 /* ***************************************************************** */00000350
                                                                        00000360
   TEKSTTYPE_V_YRKE = '    ';                                           00000370
   W_VIRK_Å                  = W_HELP_Å;                                00000380
   W_VIRK_M                  = W_HELP_M;                                00000390
   W_VIRK_ÅMD_FIX            = W_VIRK_ÅMD;                              00000400
                                                                        00000410
   IF (B02.PENSJONSTYPE1(IND) = 'Y'           &                         00000420
       B02.PENSJONSTYPE3(IND) = 'A' )         &                         00000430
      (B02.YRKEPENS.YUG(IND) = B02.UFØRPENS.UFG(IND)) THEN              00000440
                                                                        00000450
                TEKSTTYPE_V_YRKE = 'V309';                              00000460
                                                                        00000470
   IF (B01.PENSJONSTYPE1(IND) = 'Y'           &                         00000480
       B02.PENSJONSTYPE1(IND) = 'Y' )         &                         00000490
      (B01.UFØRPENS.UFG(IND) ^= B02.UFØRPENS.UFG(IND)) THEN             00000500
                                                                        00000510
                TEKSTTYPE_V_YRKE = 'V344';                              00000520
                                                                        00000530
                                                                        00000540
                                                                        00000550
   END YRKE_TEKSTTYPE_V_KODE;                                           00000560
