 /*   SIST ENDRET PÅ PROD   2006.12.13 13.27.47 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.11.21 13.15.10 AV   JDA2990          */        
 /*   SIST ENDRET PÅ QASS   2006.11.06 12.18.01 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.11.06 12.16.54 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2005.11.21 11.44.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.11.11 14.37.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.01 11.50.21 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.10.19  8.15.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.03.22  8.28.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 13.58.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.06  9.21.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.02  8.28.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.04.21 14.49.26 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.04.21 14.48.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.03.12 14.24.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.03.02 13.04.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.05.19 12.54.04 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.12  9.15.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.05.08 12.13.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.08 12.08.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.06.07  8.35.19 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.02.18 12.03.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.08.27 10.35.50 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.14 14.50.16 AV   HLA7339          */        
 /*       SIST ENDRET 04/05-98 12.58.53 AV   JDA7339                  */        
 /*       SIST ENDRET 29/08-96 15.22.05 AV   HLB0310                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014168 - SUBRUTINE I PLI                                     */        
 /*    PROGRAMMERER: HERMAN LARSSEN, OKT 1988                         */        
 /*HENSIKT:                                                           */        
 /*    LEGGE HISTORIKK OM AFP INN I TABELL - SOM OM DET VAR UFØRE-    */        
 /*                                                        HISTORIKK  */        
 /*    PROGRAMMET CALLES FRA 4152 I DE TILFELLER HVOR PERSONEN HAR    */        
 /*    PENSJONSTYPE1 = 'K' ELLER KONV_P_KODE = 'K' ELLER 'O'          */        
 /*    ELLER VENTØVR ER UTFYLT FOR AFP (FNR_ÅR > 1924)                */        
 /*                                                                   */        
 /*KODEFORKLARING MV. (TAB) :                                         */        
 /*    UFØR_START_MND: FYLLES UT FOR ET START-ÅR. DET TESTES SENERE   */        
 /*                    BARE PÅ OM > 0.                                */        
 /*    UFØR_GRAD     : SKAL VÆRE HØYESTE GRAD I ÅRET. AFP GIR 100     */        
 /*                    FRA 1992.  AFP FØR 1992 KUNNE VÆRE GRADERT.    */        
 /*    UFØR_KRIT     : 6 = AFP (1, 2, 3 = RETT TIL BUP)               */        
 /*    UFØR_PERIODE  : A = ALDERSPENSJON DETTE ÅR, D = DØD DETTE ÅR   */        
 /*                    F = FREMTIDIG PENSJONSPOENG, J = UP OPPHØRT    */        
 /*                    DETTE ÅR, L = LØPENDE UP/AFP, M = MELLOM-      */        
 /*                    LIGGENDE UP/AFP-ÅR - MELLOM TO START-ÅR ELLER  */        
 /*                    ET START OG ET OPPHØRSÅR, S = START-ÅR         */        
 /*    UFØR_SLUTT_MND: FYLLES UT FOR ET SLUTT-ÅR.  01 BETYR AT DET    */        
 /*                    VAR OPPHØR PR. 31.12. ÅRET FØR.                */        
 /*    UFØR_SLUTT_KODE: A = OPPHØR PGA ALDERSPENSJON, D =OPPHØRT PGA */         
 /*                     DØD, J = OPPØRT PGA UFØREPENSJON             */         
 /*                                                                  */         
 /*BRUKEN AV VENTEPERIODENE: NÅR AFP AVSLUTTES MED EN O2-BLANKETT,   */         
 /*                    SÅ FYLLES FØRSTE VENTØVR MED DATO FOR OPPHØR. */         
 /*                    HVIS AFP DERETTER REGISTRERES PÅ NYTT, SÅ BLIR*/         
 /*                    NY STARTDATO LAGT INN I ANDRE VENTØVR.        */         
 /*                                                                  */         
 /* **************************************************************** */         
 LEGG_AFPHIST_I_TAB:PROC(IND,FØDSELSÅR);                                        
    DCL   1  W1,                                                                
             2   APD     FIXED DEC (3) INIT(0);                                 
    DCL     SAVE_UFG     FIXED DEC (3) INIT(0);                                 
    DCL                                                                         
       I                 FIXED BIN(15) INIT(0),                                 
       INDEKS            FIXED BIN(15),                                         
       IND               FIXED BIN(15),                                         
       AP_DATO           FIXED BIN(15)  INIT(0),                                
       TIL_DATO          FIXED BIN(15)  INIT(0),                                
       SAVE_ÅR           FIXED BIN(15)  INIT(0),                                
       SAVE_IND          FIXED BIN(15)  INIT(1),                                
       PERIODE_IND       FIXED BIN (15) INIT (0),                               
       TAB_IND           FIXED BIN (15) INIT (0);                               
    DCL                                                                         
       FØDSELSÅR         PIC '9999';            /*2000*/                        
    DCL                                                                         
       1 TID,                                                                   
         2 TID_ÅR     PIC '9999',               /*2000*/                        
         2 TID_MND    PIC '99';                                                 
    DCL W_START_MND   PIC '99';                                                 
    DCL TID_ÅM DEF TID  PIC '999999';           /*2000*/                        
  DCL  ALDER_PÅ_VIRKDATO                         PIC'(5)9' INIT(0),             
       ALDER_ÅR DEF ALDER_PÅ_VIRKDATO POS(1)     PIC'(3)9';                     
  DCL FIXED_DEC5             FIXED DEC  (5)     INIT(0);                        
  DCL MELLOM_KODE            CHAR (1)           INIT('L');                      
  DCL SIST_REG               FIXED BIN (15);                                    
                                                                                
 /*HVIS GAMMEL UP TAS TILBAKE :  */                                             
  IF B02.UFT_ÅMD(IND,1) > 0   THEN                                              
  DO;                                                                           
     DO I = 1 TO 7 WHILE(B02.UFT_ÅMD(IND,I) > 0);                               
        SIST_REG = I;                                                           
     END;                                                                       
  END;                                                                          
  IF B02.PENSJONSTYPE1(IND) = 'U'            THEN                               
  DO;                                                                           
     IF B02.UFT_ÅMD(IND,SIST_REG) < B02.UTTAKSDATO_ÅMD(IND)  &                  
        B02.OPPHØRSDATO_ÅMD(IND,SIST_REG) = 0          THEN                     
            GOTO SLUTT_4168;                                                    
  END;                                                                          
                                                                                
  FIXED_DEC5 = F_ALDER(W_FNR11,(B02.VIRK_DATO_ÅMD(IND)));  /*2000*/             
  ALDER_PÅ_VIRKDATO = FIXED_DEC5;                                               
  AP_DATO = FØDSELSÅR + 67;                                                     
                                                                                
    TID_ÅM    = B02.UTTAKSDATO_ÅMD(IND)/100;                                    
    TAB_IND   = TID_ÅR;                                                         
    W_START_MND   = TID_MND;                                                    
                                                                                
 /* SISTE ÅR MED BUP ER DET ÅRET PERSONEN FYLLER 66 ÅR    */                    
 /* OFFENTLIG AFP SKAL BARE REGNES TIL 64 ÅR              */                    
                                                                                
  IF B02.KONV_P_KODE(IND) = 'O'   THEN                                          
    DO;                                    /*200103*/                           
      TIL_DATO = FØDSELSÅR + 64;                                                
      IF TID_ÅR > TIL_DATO          THEN                                        
         GOTO SLUTT_4168; /*IKKE RETT TIL BUP.REMEDY 393: 200402 HL*/           
 /*   IF TAB.UFØR_GRAD(TIL_DATO) < 100            THEN  */                      
      IF TAB.UFØR_GRAD(TIL_DATO) = 0       THEN   /*200504 HL*/                 
  /* DA HAR HAN RETT TIL 100 I SLUTTÅRET                  */                    
         DO;                                                                    
            TAB.UFØR_SLUTT_MND(TIL_DATO) = 2;                                   
            TAB.UFØR_SLUTT_KODE(TIL_DATO) = 'J';                                
            TAB.UFØR_PERIODE   (TIL_DATO) = 'J';                                
         END;                                                                   
    END;                                                                        
  ELSE                                                                          
  IF (B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,1) > 0   &                                  
      B02.APD_ØVRIGE(IND,1)            = 0   &                                  
       FØDSELSÅR > 1924                          )   THEN                       
  /* DA ER AFP-PERIODEN AVSLUTTET I DETTE ÅRET - HVIS DET       */              
  /* NESTE ÅR ER EN LØPENDE UFØREPENSJON, SÅ SKAL AFP-PERIODEN  */              
  /* ANSES SOM EN DEL AV DENNE - MEN MED HØYERE GRAD. 200402 HL */              
                                                                                
    DO;                                    /*200206*/                           
      TID_ÅM   = B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,1)/100;                          
      IF TID_MND = 01                  THEN                                     
         TIL_DATO = TID_ÅR - 1;                                                 
      ELSE                                                                      
         TIL_DATO = TID_ÅR;                                                     
 /*   IF TAB.UFØR_GRAD(TIL_DATO) < 100            THEN */                       
      IF TAB.UFØR_GRAD(TIL_DATO) = 0       THEN   /*200402 HL*/                 
         DO;                                                                    
            IF TAB.UFØR_PERIODE(TIL_DATO + 1) ^= 'S'   THEN                     
            DO;                                                                 
               TAB.UFØR_SLUTT_MND(TIL_DATO) = 2;                                
               TAB.UFØR_SLUTT_KODE(TIL_DATO) = 'J';                             
               TAB.UFØR_PERIODE   (TIL_DATO) = 'J';                             
            END;                                                                
         END;                                                                   
      ELSE                                                                      
      IF (TAB.UFØR_GRAD(TIL_DATO + 1) > 0 )        &                            
         (TAB.UFØR_PERIODE(TIL_DATO + 1) = 'L' )       THEN                     
         DO;                                                                    
            TAB.UFØR_START_MND(TAB_IND)   = W_START_MND;                        
            TAB.UFØR_PERIODE  (TAB_IND)   = 'S';                                
            TAB.UFØR_KRIT     (TAB_IND)   =  6;                                 
            DO I = TAB_IND TO TIL_DATO;                                         
               IF TAB.UFØR_GRAD(I) = 0         &                                
                  TAB.UFØR_PERIODE  (I)  ^= 'S'       THEN                      
                  TAB.UFØR_PERIODE  (I)   = 'M';                                
               TAB.UFØR_GRAD(I) = 100;                                          
            END;                                                                
            PERIODE_IND = TAB_IND - 1;                                          
            DO WHILE (TAB.UFØR_PERIODE(PERIODE_IND) = 'L');                     
               TAB.UFØR_PERIODE(PERIODE_IND) = 'M';                             
               PERIODE_IND = PERIODE_IND - 1;                                   
            END;                                                                
            GOTO SLUTT_4168;                                                    
         END;                                                                   
  /*AFP - UP - AFP  200501 : */                                                 
                                                                                
         IF B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,2) > 0    THEN                        
            DO;                                                                 
               TID_ÅM   = B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,2)/100;                 
               IF (TIL_DATO + 1) < TID_ÅR          THEN                         
                  DO;                                                           
                     SAVE_UFG = TAB.UFØR_GRAD(TIL_DATO + 1);                    
                     SAVE_ÅR  = TIL_DATO + 1;                                   
                  END;                                                          
               TAB.UFØR_PERIODE    (TID_ÅR)   = 'S';                            
               TAB.UFØR_KRIT       (TID_ÅR)   =  6;                             
               TAB.UFØR_GRAD       (TID_ÅR)   = 100;                            
               TAB.UFØR_START_MND  (TID_ÅR)   = TID_MND;                        
               TAB.UFØR_SLUTT_MND  (TID_ÅR)   = 0;                              
               TAB.UFØR_SLUTT_KODE (TID_ÅR)   = ' ';                            
               TIL_DATO = FØDSELSÅR + 66;                                       
            END;                                                                
    END;                                                                        
  ELSE                                                                          
    TIL_DATO = FØDSELSÅR + 66;                                                  
                                                                                
  IF TAB.UFØR_PERIODE(TIL_DATO) = 'S'     !                                     
     TAB.UFØR_PERIODE(TIL_DATO + 1) = 'S'      THEN                             
     MELLOM_KODE = 'M';                                                         
                                                                                
  /*200402 HL :  */                                                             
                                                                                
    PERIODE_IND = TAB_IND - 1;                                                  
    DO WHILE (TAB.UFØR_PERIODE(PERIODE_IND) = 'L');                             
       TAB.UFØR_PERIODE(PERIODE_IND) = 'M';                                     
       PERIODE_IND = PERIODE_IND - 1;                                           
    END;                                                                        
  /* HIT 200402*/                                                               
                                                                                
       TAB.UFØR_START_MND(TAB_IND)   = TID_MND;                                 
                                                                                
                                                                                
 /* UTTAKS_APD ER IKKE OPPDATERT FOR NYE TILFELLER : */                         
                                                                                
           IF B02.UTTAKS_APD(IND) = 0        THEN                               
              W1.APD              = 100;                                        
           ELSE                                                                 
              W1.APD              = B02.UTTAKS_APD(IND);                        
                                                                                
 /*                                                                   */        
 /*              HVIS APD ER HØYERE ENN EN UFØREGRAD FOR SAMME ÅR,    */        
 /*              SÅ BRUKER VI APD.                                    */        
                                                                                
         IF TAB.UFØR_GRAD(TAB_IND) < W1.APD     THEN                            
          DO;                                                                   
             TAB.UFØR_GRAD(TAB_IND) = W1.APD;                                   
                                                                                
             IF ALDER_PÅ_VIRKDATO < 7001        THEN                            
                TAB.UFØR_KRIT(TAB_IND) = 6;                                     
             TAB.UFØR_PERIODE(TAB_IND) = 'S';                                   
          END;                                                                  
                                                                                
                                                                                
      I = 1;                                                                    
                                                                                
   TAB.SISTE_BUP_ÅR(TAB_IND-1) = ' ';    /*REMEDY 1536 - HL 200510*/            
   DO TAB_IND = TAB_IND TO TIL_DATO;     /*2000 : */                            
      TAB.SISTE_BUP_ÅR(TAB_IND) = ' ';   /*REMEDY 1536 - HL 200510*/            
      IF FØDSELSÅR > 1924                        THEN                           
      DO I = I TO 5 WHILE (B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,I) > 0);               
         TID_ÅM = B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,I)/100;                         
         IF TAB_IND = TID_ÅR                    THEN                            
            IF B02.APD_ØVRIGE(IND,I) > W1.APD       THEN                        
               W1.APD = B02.APD_ØVRIGE(IND,I);                                  
            ELSE;                                                               
         ELSE                                                                   
            SAVE_IND = I;                                                       
      END;                                                                      
      I = SAVE_IND;                                                             
      IF TAB.UFØR_GRAD(TAB_IND) < W1.APD     THEN                               
 /*                                                                   */        
 /*              HVIS APD ER HØYERE ENN EN UFØREGRAD FOR SAMME ÅR,    */        
 /*              SÅ BRUKER VI APD.                                    */        
                                                                                
          DO;                                                                   
             TAB.UFØR_GRAD(TAB_IND) = W1.APD;                                   
             IF ALDER_PÅ_VIRKDATO < 7001        THEN                            
                TAB.UFØR_KRIT(TAB_IND) = 6;                                     
             IF TAB.UFØR_PERIODE(TAB_IND - 1) = ' '   THEN                      
                TAB.UFØR_PERIODE(TAB_IND) = 'S';                                
             ELSE                                                               
             IF TAB.UFØR_PERIODE(TAB_IND) ^= 'S'    THEN                        
                DO;                                                             
                   IF B02.PENSJONSTYPE1(IND) = 'D'   !                          
                      ALDER_PÅ_VIRKDATO > 7000         THEN                     
                      TAB.UFØR_PERIODE(TAB_IND) = 'M';                          
                   ELSE                                                         
      /*           IF B02.KONV_P_KODE(IND) ^= 'O'   THEN    200103*/            
      /*              TAB.UFØR_PERIODE(TAB_IND) = 'L'     */                    
      /*              TAB.UFØR_PERIODE(TAB_IND) = MELLOM_KODE;  */              
                   IF TAB.UFØR_PERIODE (TAB_IND) ^= 'J'      THEN               
                      IF B02.KONV_P_KODE(IND)  = 'O'       THEN                 
                         TAB.UFØR_PERIODE(TAB_IND) = 'M';                       
                      ELSE                                                      
    /*TILLEGG 200305 HL : */                                                    
                      IF TAB.UFØR_PERIODE(TAB_IND + 1) = 'S'   !                
    /*200501*/           TAB.UFØR_PERIODE(TAB_IND + 1) = 'M'   !                
    /*TILLEGG 200407 HL : */                                                    
                         TAB.UFØR_PERIODE(TAB_IND + 1) = 'J'    THEN            
                         DO;                                                    
                            TAB.UFØR_PERIODE(TAB_IND) = 'M';                    
                            IF TAB.UFØR_PERIODE(TAB_IND -1) = 'L' THEN          
                               TAB.UFØR_PERIODE(TAB_IND -1) = 'M';              
                            IF TAB.UFØR_PERIODE(TAB_IND -2) = 'L' THEN          
                               TAB.UFØR_PERIODE(TAB_IND -2) = 'M';              
                            IF TAB.UFØR_PERIODE(TAB_IND -3) = 'L' THEN          
                               TAB.UFØR_PERIODE(TAB_IND -3) = 'M';              
                         END;                                                   
                      ELSE                                                      
                         TAB.UFØR_PERIODE(TAB_IND) = 'L';                       
                END;                                                            
          END;                                                                  
       IF TID_MND = 1     &                                                     
          TID_ÅR  = TIL_DATO     &                                              
          FØDSELSÅR > 1924       &                                              
          B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,SAVE_IND) > 0   THEN /*2000*/           
                                                                                
          W1.APD  = B02.APD_ØVRIGE(IND,SAVE_IND);                               
                                                                                
    END;                                                                        
    IF ALDER_PÅ_VIRKDATO > 7000      THEN                                       
       TAB.UFØR_PERIODE(AP_DATO) = 'A';                                         
                                                                                
 /*AFP - UP - AFP  200501 : */                                                  
                                                                                
    IF SAVE_UFG > 0      THEN                                                   
       DO;                                                                      
          TAB.UFØR_GRAD(SAVE_ÅR) = SAVE_UFG;                                    
          TAB.UFØR_KRIT(SAVE_ÅR) = 2;                                           
    /*200504 : */                                                               
          I = SAVE_ÅR - 1;                                                      
          DO WHILE (TAB.UFØR_PERIODE(I) = 'M');                                 
             TAB.UFØR_GRAD(I) = SAVE_UFG;                                       
             TAB.UFØR_KRIT(I) = 2;                                              
             I = I - 1;                                                         
          END;                                                                  
          IF TAB.UFØR_PERIODE(I) = 'S'          THEN                            
             TAB.UFØR_KRIT(I)    = 2;                                           
       END;                                                                     
                                                                                
 SLUTT_4168:                                                                    
    IF B02.DØDSDATO_ÅMD(IND) > 0  THEN                                          
       DO;                                                                      
          TID_ÅM = B02.DØDSDATO_ÅMD(IND) / 100;                                 
          IF FØDSELSÅR + 67 > TID_ÅR    THEN                                    
          DO;                                                                   
             TAB.UFØR_GRAD(TID_ÅR) = 100;                                       
             TAB.UFØR_KRIT(TID_ÅR) = 2;                                         
             TAB.UFØR_PERIODE(TID_ÅR) = 'D';                                    
             TAB.UFØR_SLUTT_MND(TID_ÅR) = TID_MND;                              
             TAB.UFØR_SLUTT_KODE(TID_ÅR) = 'D';                                 
             TAB_IND = TID_ÅR - 1;                                              
             DO WHILE (TAB.UFØR_PERIODE(TAB_IND) = 'L');                        
                TAB.UFØR_PERIODE(TAB_IND) = 'M';                                
                TAB_IND = TAB_IND - 1;                                          
             END;                                                               
             TAB_IND = TID_ÅR + 1;                                              
             DO WHILE (TAB.UFØR_KRIT(TAB_IND) = 6);                             
                TAB.UFØR_KRIT(TAB_IND) = 0;                                     
                TAB_IND = TAB_IND + 1;                                          
             END;                                                               
          END;                                                                  
       END;                                                                     
                                                                                
  /*NY KODE FOR Å ORDNE AT GAMMEL UP-BUP BLIR BRUKT */                          
  /*REMEDY 2392 - 27.10.2006*/                                                  
                                                                                
   IF B02.KONV_P_KODE(IND) = 'U'             &                                  
      B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,1) > 0   &                                  
      B02.UFT_ÅMD(IND,SIST_REG) < B02.UTTAKSDATO_ÅMD(IND)  THEN                 
      DO;                                                                       
         TID_ÅM   = B02.UTTAKSDATO_ÅMD_ØVRIGE(IND,1)/100;                       
         IF TID_MND = 12                  THEN                                  
            TIL_DATO = TID_ÅR + 1;                                              
         ELSE                                                                   
         IF TID_MND = 1                   THEN                                  
            TIL_DATO = TID_ÅR - 1;                                              
         ELSE                                                                   
            TIL_DATO = TID_ÅR;                                                  
         DO I = TIL_DATO TO (AP_DATO - 1);                                      
            TAB.UFØR_PERIODE(I)  = 'M'   ;                                      
            TAB.POENGGARANTI_KODE(I) = 'C';                                     
            TAB.NY_3_19(I)  = ' ';                                              
         END;                                                                   
      END;                                                                      
                                                                                
 END LEGG_AFPHIST_I_TAB;                                                        
