 /*   SIST ENDRET PÅ PROD   2006.07.18 11.36.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.42.15 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.37 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.42 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.08.12 11.55.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.08.11  8.40.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.43.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 13.57.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.47.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.11.28  9.07.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.24  7.38.56 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.09.13 11.56.32 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.03.28 14.50.29 AV   HLA7339          */        
 /*       SIST ENDRET 12/10-99 09.31.48 AV   JDA7339                  */        
 /*       SIST ENDRET 12/10-99 09.30.07 AV   JDA7339                  */        
 /*       SIST ENDRET 02/09-98 12.57.13 AV   SPA7339                  */        
 /*       SIST ENDRET 20/07-98 13.06.32 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 13.21.35 AV   JDA7339                  */        
 /*       SIST ENDRET 11/06-98 08.47.25 AV   RFA9991                  */        
           /* ************************ */                                       
           /* IDENTIFIKASJON: R0011622 */                                       
           /*   AJOURFØR_HIST_AVDØDE_  */                                       
           /*     I_STATUS             */                                       
           /* PROGRAMMERER: HELEN      */                                       
           /* DATO:    MAI   1982      */                                       
           /* HENSIKT:  OPPRETTER      */                                       
           /*   DØDSHISTORIKK FOR EN   */                                       
           /*   PERSON SOM HAR         */                                       
           /*   PENSJONSSTATUS FRA     */                                       
           /*   FØR.                   */                                       
           /* BRUK: BRUKES I DEN       */                                       
           /*   GENERERTE DØDSMELDING. */                                       
           /*   ANDRE OPPLYSNINGER     */                                       
           /*   REGISTRERES NÅR DE     */                                       
           /*   ENKELTE BLANKETTER     */                                       
           /*   BEHANDLES.             */                                       
           /* ************************ */                                       
 AJOURFØR_HIST_AVDØDE_I_STATUS:                                                 
  PROC(IND);                                                                    
 DCL IND           FIXED BIN(15);                                               
 DCL INDEX         FIXED BIN(15);                                               
 DCL 1 HJ_ÅMD_PIC   PIC '(8)9';                                                 
 DCL 1 HJ_ÅM DEF HJ_ÅMD_PIC,                                                    
       2 HJ_ÅR4    PIC '(4)9',                                                  
       2 HJ_MND    PIC '(2)9',                                                  
       2 HJ_DAG    PIC '(2)9';                                                  
 DCL   HJ_ÅR2 DEF HJ_ÅMD_PIC POS(3) PIC '(2)9';                                 
 DCL IKKE_AKTUELT_PI_ÅR PIC '(4)9';                                             
 DCL INNT_ÅR            PIC '(4)9';                                             
                                                                                
 IKKE_AKTUELT_PI_ÅR = ÅR13 + 70;                                                
 IF IND > 2 THEN                                                                
    DO;                                                                         
      B02.DØDSDATO_ÅMD(IND)      =  O1.DØDSDATO_ÅMD;                            
      B02.VIRK_DATO_ÅMD(IND)      =  VIRKNINGSDATO_ÅMD;                         
    END;                                                                        
    B02.FØRSTE_GANG_REG(IND)    =  'N';                                         
    B02.STATUS_KODE_HIST(IND)   =  'X';                                         
 /* B02.GT_LOV92        (IND)   =    0;             HL*/                        
    B02.GT_TILLEGG_LOV92(IND)   =    0;                                         
    B02.FNR_TILKN(IND,*)        =    0;                                         
    B02.TILKNYTNINGSKODE(IND,*) =  ' ';                                         
    B02.FT_FØR_91       (IND,*) =  ' ';                                         
                                                                                
    /* SETTE INN NULLELEMENT I AFPHIST FLYTTA FRA 1620 241002 MARTIN */         
    IF (B01.AFPDATO_ÅMD(IND,1) > 0   &                                          
        B01.PENSJONSTYPE1(IND) = 'K' ) THEN                                     
       DO;  /* SETT INN NULLELEMENT I AFPHIST SEGMENTET */                      
                                                                                
          /* FØRST BLANKER VI AFPHIST MED SENERE DATO : */                      
          DO I = 1 TO 30; /* ENDRET 20->30 SP 18.07.05 */                       
             IF (VIRKNINGSDATO_ÅMD <= B02.AFPDATO_ÅMD(IND,I)) THEN              
                B02.AFPHIST(IND,I) = '';                                        
          END; /* DO I = 1 TO 20 */                                             
                                                                                
             /* ENDRET 20->30 SP 18.07.05 */                                    
          DO INDEX = 1 TO 30 UNTIL (B02.AFPDATO_ÅMD(IND,INDEX) = 0);            
          END;                                                                  
                                                                                
          IF (INDEX > 1) THEN                                                   
             DO;  /* VI DANNER NULLELEMENT BARE DERSOM TIDL AFP */              
                B02.AFPHIST.TEI_FAKTOR(IND,INDEX) =                             
                   B02.AFPHIST.TEI_FAKTOR(IND,INDEX-1);                         
                B02.AFPDATO_ÅMD(IND,INDEX)=                                     
                   TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;                            
                B02.FEI_I_100KR(IND,INDEX) = 0;                                 
                B02.GRAD_UTBET(IND,INDEX)  = 0;                                 
                B02.FULL_AFP(IND,INDEX)    = 0;                                 
                B02.RED_AFP(IND,INDEX)     = 0;                                 
                B02.ET_REG(IND,INDEX)      = ' ';                               
             END; /* VI DANNER NULLELEMENT BARE DERSOM TIDL AFP */              
       END; /* SETT INN NULLELEMENT I AFPHIST SEGMENTET */                      
                                                                                
 /*9807: OFFENTLIG AFP AVGIR BARE BUP TIL 64-ÅRS_ÅRET - KODE 'O'*/              
    IF B02.AFP_BUP    (IND)     >  0     THEN    /*9803-FEIL 11A*/              
       DO;                                                                      
          IF (B01.PENSJONSTYPE3(IND) = 'K'  !                                   
              B01.PENSJONSTYPE3(IND) = 'S')   THEN                              
              B02.KONV_P_KODE(IND)     = 'O';                                   
          ELSE                                                                  
          IF  B01.PENSJONSTYPE1(IND) ^= 'A'   THEN                              
              B02.KONV_P_KODE(IND)     = 'K';                                   
       END;                                                                     
    ELSE                                                                        
       B02.ALDERSP(IND)         =   '';                                         
  /*    B02.UFØRPENS(IND)           =   '';     */                              
                                                                                
 /* VI LAR YRKEPENS.YUG , YPT OG YPT_KODE BLI STÅENDE*/                         
 /* OGSÅ PÅ_ETTER91 OG YRKE_POENG_1291   BLIR STÅENDE*/                         
                                                                                
    B02.YRKEPENS.GP(IND)           =   0;                                       
    B02.YRKEPENS.BT(IND)           =   0;                                       
    B02.YRKEPENS.TP(IND)           =   0;                                       
 /* B02.YRKEPENS.SPT(IND)          =   0      HL  */                            
    B02.ETTEPENS(IND)           =   '';                                         
    B02.PENSJONSTYPE1(IND)      =  'D';                                         
    B02.PENSJONSTYPE2(IND)      =  ' ';                                         
    B02.ETTEBARN (IND)          =   '';                                         
    B02.ANTALL_BARN(IND)        =    0;                                         
    B02.SUM_YTELSE (IND)        =    0;                                         
 /* ***************************************************************** */        
 /*  AVDØD HAR EKTEFELLE MED PENSJON .                                */        
 /* ***************************************************************** */        
    IF B01.PENSJONSTYPE2(IND) = 'S' THEN                                        
                                                                                
 /* FJERNET OPPDATERING AV TT_ETTER_1966 FOR PERSONER OVER 67 ÅR      */        
 /* 12.11.84  HL                                                      */        
                                                                                
 /*    IF HJ_DØDSDATO_ÅM   <  SEKSTISJU_ÅRSDATO           THEN                  
          DO;                                                                   
                                                                                
             HJ_ÅMD_PIC             =                                           
                        (SEKSTISJU_ÅRSDATO - HJ_DØDSDATO_ÅM4) * 100;            
             B02.TT_FRAMT_DØD(IND)  = (HJ_ÅR2 *12) + HJ_MND;                    
             B02.TT_FRAMT(IND)      = B02.TT_FRAMT_DØD(IND);                    
             B02.TT_ETTER_1966(IND) = B01.TT_ETTER_1966(IND) +                  
                                      B01.TT_FRAMT(IND)      -                  
                                      B02.TT_FRAMT_DØD(IND);                    
                                                                                
   HIT 9.6.87 HL   */                                                           
       DO;  /*FORBEDRING 200009 - HL */                                         
          B02.TT_FRAMT(IND) =                                                   
                 F_BEREGN_TT_FRAMT((B02.FNR(IND)),O1.DØDSDATO_ÅMD);             
          B02.TT_FRAMT_DØD(IND) = B02.TT_FRAMT(IND);                            
          IF (B01.TT_16_66(IND) > 0) THEN                                       
             B02.TT_16_66(IND)  = B01.TT_16_66(IND) +                           
                                  B01.TT_FRAMT(IND)      -                      
                                  B02.TT_FRAMT_DØD(IND);                        
          ELSE                                                                  
             B02.TT_ETTER_1966(IND) = B01.TT_ETTER_1966(IND) +                  
                                   B01.TT_FRAMT(IND)      -                     
                                   B02.TT_FRAMT_DØD(IND);                       
                                                                                
       END;                                                                     
 /* ***************************************************************** */        
 /*  AVDØDE ER UFØRE-/YRKEPENSJONIST - ELLER ENGANGS-UTLØST (9910)    */        
 /* ***************************************************************** */        
    IF B01.PENSJONSTYPE1(IND) = 'U' !                                           
       B01.PENSJONSTYPE1(IND) = 'Y' !                                           
      (B01.YUFT_ÅMD   (IND,1) >  0  &           /*9910*/                        
       B01.OPPH_DATO_ÅMD  (IND,1) =  0  )!                                      
                                B01.PENSJONSTYPE3(IND) = 'U' THEN               
       DO;                                                                      
          B02.STATUS.VILKÅR_8_4_3A(IND) =                                       
                                    B01.UFØRPENS.VILKÅR_8_4_3A(IND);            
          DO I = 1 TO 7 WHILE (B01.UFT_ÅMD(IND,I) > 0);                         
             IF B02.OPPHØRSDATO_ÅMD(IND,I) = 0 THEN                             
                DO;                                                             
                   IF B02.PENSJONSTYPE3(IND) = 'A' THEN                         
                      B02.UFØRHIST(IND,I)    = '';                              
                   ELSE                                                         
                      DO;                                                       
                         HJ_ÅMD_PIC           =      O1.DØDSDATO_ÅMD;           
                         HJ_DAG               = 01;                             
                         IF ^(HJ_ÅR4  > 1997  &                                 
                              HJ_MND = 12    )   THEN                           
                            HJ_MND         =      HJ_MND + 1;                   
                         IF HJ_MND > 12   THEN                                  
                            DO;                                                 
                               HJ_MND = 1;                                      
                               HJ_ÅR4  = HJ_ÅR4 + 1;                            
                            END;                                                
                         B02.OPPHØRSDATO_ÅMD(IND,I) = HJ_ÅMD_PIC;               
                         B02.OPPHØRSKODE(IND,I)    = 'D';                       
                                                                                
                      END;                                                      
                   I = 7;                             /*0697 HL*/               
                END;                                                            
          END;                                                                  
   /*     IF B01.PENSJONSTYPE1(IND) = 'Y'     THEN  9910  */                    
          DO I = 1 TO 10  WHILE (B01.YUFT_ÅMD(IND,I) > 0);                      
             IF B02.OPPH_DATO_ÅMD(IND,I) = 0 THEN                               
                DO;                                                             
                   IF B02.PENSJONSTYPE3(IND) = 'A' THEN                         
                      B02.YRKEHIST(IND,I)    = '';                              
                   ELSE                                                         
                      DO;                                                       
                         B02.OPPH_DATO_ÅMD(IND,I) =                             
                                                    O1.DØDSDATO_ÅMD;            
                         B02.OPPH_KODE(IND,I)    = 'D';                         
                                                                                
                      END;                                                      
                   I = 10 ;                                                     
                END;                                                            
          END;                                                                  
       END;                                                                     
                                                                                
    B02.PENSJONSTYPE3(IND)      =  ' ';                                         
                                                                                
  /* ENDRET 200103 HL : */                                                      
          INNT_ÅR = HJ_DØDSDATO_ÅR_RE - 1;                                      
  /*TILLEGGSTEST 200110 HL */                                                   
          IF (INNT_ÅR                   > 1966)     &                           
             (INNT_ÅR   < IKKE_AKTUELT_PI_ÅR  )     &                           
             (O1.PI_DØD ^= 9999999           )      &                           
             (O1.PI_DØD > 0                   )     THEN                        
            DO;                                                                 
               IF B01.PI_KODE( IND,INNT_ÅR) = ' ' !                             
                  B01.PI_KODE( IND,INNT_ÅR) = 'F' THEN                          
                  DO;                                                           
                     B02.PI_KODE(IND,INNT_ÅR) = 'F';                            
                     B02.PI(IND,INNT_ÅR) = O1.PI_DØD; /* /100;JFA */            
                  END;                                                          
               ELSE   /*        KODE M BETYR OMSORG + FORELØPIG*/               
               IF B01.PI_KODE(IND,INNT_ÅR) = 'M'               THEN             
                     DO;                                                        
                        B02.PI_KODE(IND,INNT_ÅR) = 'M';                         
                        B02.PI(IND,INNT_ÅR) = O1.PI_DØD; /*/ 100;JFA*/          
                     END;                                                       
               ELSE                                                             
               IF  (B01.PI_KODE(IND,INNT_ÅR) = 'J' !                            
                    B01.PI_KODE(IND,INNT_ÅR) = 'K' !                            
                    B01.PI_KODE(IND,INNT_ÅR) = 'L' ) &                          
                        B01.PI(IND,INNT_ÅR) = 0                  THEN           
                     DO;                                                        
                        B02.PI_KODE(IND,INNT_ÅR) = 'M';                         
                        B02.PI(IND,INNT_ÅR) =  O1.PI_DØD; /*/ 100;JFA*/         
                     END;                                                       
            END;                                                                
                                                                                
  END AJOURFØR_HIST_AVDØDE_I_STATUS;                                            
