 /*   SIST ENDRET PÅ PROD   2004.10.14 13.53.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.09.21 12.11.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.06.18 12.23.53 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.05.03 12.32.02 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.19 15.33.32 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.51.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.22.44 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.07 13.00.37 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.24 10.22.48 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.14 12.21.36 AV   JDA7339          */        
 /*       SIST ENDRET 20/09-99 09.33.56 AV   JDA7339                  */        
 /*       SIST ENDRET 20/09-99 09.15.49 AV   JDA7339                  */        
 /*       SIST ENDRET 04/05-98 12.59.28 AV   JDA7339                  */        
 /*       SIST ENDRET 25/02-98 09.47.55 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*    R0014241 - UNDERPROGRAM I PLI                                  */        
 /*    PROGRAMMERER: HERMAN LARSSEN - JULI 88                         */        
 /* HENSIKT:                                                          */        
 /*    BEREGNE ALDERSPENSJON VED OVERGANG FRA YRKESSKADEPENSJON       */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*    INCLUDES I R0014201 - ALDERSPENSJON                            */        
 /* BRUK:                                                             */        
 /*    CALL BEREGN_AP_OVERGANG_FRA_YP                                 */        
 /*                                                                   */        
 /*ENDRINGER                                                          */        
 /* ***************************************************************** */        
 BEREGN_AP_OVERGANG_FRA_YP:PROC;                                                
    DCL   ALDERSPENSJON   FIXED DEC (7)   INIT (0),                             
          DIFF            FIXED DEC (3)   INIT (0),                             
          DIFF_GP         FIXED DEC (7)   INIT (0),                             
          DIFF_PENSJON    FIXED DEC (7)   INIT (0),                             
          DIFF_ST         FIXED DEC (7)   INIT (0),                             
          DIFF_TP         FIXED DEC (7)   INIT (0),                             
          PROSENT         FIXED DEC (5,2) INIT (0),                             
          YRKE_GP         FIXED DEC (7)   INIT (0),                             
          YRKE_GP_RED     FIXED DEC (7)   INIT (0),                             
          YRKE_ST         FIXED DEC (7)   INIT (0),                             
          YRKE_ST_RED     FIXED DEC (7)   INIT (0),                             
          YRKE_GARANTI    FIXED DEC (7)   INIT (0),                             
          YRKE_TP         FIXED DEC (7)   INIT (0),                             
          YRKE_TP_RED     FIXED DEC (7)   INIT (0),                             
          YRKEPENSJON     FIXED DEC (7)   INIT (0),                             
          YRKEPENSJON_RED FIXED DEC (7)   INIT (0),                             
          YRKEAPD         FIXED DEC (7)   INIT (0),                             
          YRKEAPD_TP      FIXED DEC (7)   INIT (0),                             
          YRKEAPD_GP      FIXED DEC (7)   INIT (0),                             
          YRKEAPD_ST      FIXED DEC (7)   INIT (0),                             
          W1              FIXED DEC (11,4) INIT (0),                            
          W2_GP           FIXED DEC (11,4) INIT (0),                            
          W3_GP           FIXED DEC (11,4) INIT (0),                            
          W4_GP           FIXED DEC (11,4) INIT (0),                            
          W5_GP           FIXED DEC (11,4) INIT (0),                            
          W2_TP           FIXED DEC (11,4) INIT (0),                            
          W3_TP           FIXED DEC (11,4) INIT (0),                            
          H1_GP           FIXED DEC (11,4) INIT (0),                            
          H2_GP           FIXED DEC (11,4) INIT (0);                            
    /*    W_FNR_EK        FIXED DEC (11)   INIT (0)      HL*/                   
     DCL  W_DATO_ÅMD      PIC       '(8)9';            /*2000*/                 
     DCL  W_HH DEF W_DATO_ÅMD POS(1) PIC'99';          /*2000*/                 
     DCL  W_ÅR DEF W_DATO_ÅMD POS(3) PIC'99';          /*HL*/                   
     DCL  W_MN DEF W_DATO_ÅMD POS(5) PIC'99';          /*HL*/                   
     DCL  W_DD DEF W_DATO_ÅMD POS(7) PIC'99';          /*2000*/                 
     DCL  FAKTOR1         FIXED DEC  (7) INIT (0);     /*HL*/                   
     DCL  FAKTOR2         FIXED DEC  (7) INIT (0);     /*HL*/                   
     DCL  TP_WORK         FIXED DEC  (13,4) INIT (0);  /*HL*/                   
                                                                                
    /* ============================================================== */        
                                                                                
                                                                                
    W_DATO_ÅMD = TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD;    /*0002*/                  
                                                                                
    IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S' THEN                                 
       PROSENT = ST_PROSENT_SAMST;                                              
    ELSE                                                                        
       PROSENT = ST_PROSENT_ENSLIG;                                             
                                                                                
    IF (B02.PENSJONSTYPE2(BER_SØ_IND) = 'F'               &                     
        F_ALDER((B02.FNR(BER_EK_IND)),W_DATO_ÅMD) >= 6000)    THEN              
        IF W_DATO_ÅMD                   >  19940000     THEN                    
           PROSENT = ST_PROSENT_ENSLIG * 2;                                     
        ELSE                                                                    
        IF W_DATO_ÅMD                   >  19890300     THEN                    
           PROSENT = ST_PROSENT_SAMST * 2;      /*200010*/                      
                                                                                
  IF B02.YRKEPENS.YPT(BER_SØ_IND) < B02.YRKE_POENG_1291(BER_SØ_IND) THEN        
     B02.YRKEPENS.YPT(BER_SØ_IND) = B02.YRKE_POENG_1291(BER_SØ_IND);            
                                                                                
  /*ENDRING 0196 HL : */                                                        
                                                                                
    IF B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) > 0       THEN                       
       DO;  /* HAR PÅ ETTER 1991 */                                             
          FAKTOR1 = (B02.YRKEPENS.PÅ(BER_SØ_IND)                                
                     - B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) )                    
                     * 45000                                                    
                   / B02.YRKEPENS.PÅ(BER_SØ_IND) ;                              
          FAKTOR2 = B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) * 42000                 
                   / B02.YRKEPENS.PÅ(BER_SØ_IND) ;                              
          TP_WORK = G * B02.YRKEPENS.YPT(BER_SØ_IND);                           
          TP_WORK = TP_WORK * (FAKTOR1 + FAKTOR2) * 0.00001;                    
          YRKEAPD_TP = TP_WORK / 12 + 0.5;                                      
          YRKE_TP =(TP_WORK/12)*B02.YRKEPENS.YUG(BER_SØ_IND)/100+0.5;           
       END; /* HAR PÅ ETTER 1991 */                                             
     ELSE                                                                       
       DO;  /* HAR IKKE PÅ ETTER 1991 (KUN 45%) */                              
          W2_TP      = G * 45 / 100;                                            
          W2_TP      = W2_TP * B02.YRKEPENS.YPT(BER_SØ_IND);                    
          W2_TP      = W2_TP /12;                                               
          W3_TP      = W2_TP * B02.ALDERSP.APD(BER_SØ_IND)  / 100;              
          YRKEAPD_TP = W3_TP + 0.5;                                             
          W2_TP      = W2_TP * B02.YRKEPENS.YUG(BER_SØ_IND) / 100;              
          YRKE_TP    = W2_TP + 0.5;                                             
       END; /* HAR IKKE PÅ ETTER 1991 (KUN 45%) */                              
                                                                                
     W2_GP      = G * B02.YRKEPENS.YUG(BER_SØ_IND);                             
     W2_GP      = W2_GP /100 ;                                                  
     /* W2_GP      = W2_GP /(100 * 12)  */                                      
     W4_GP      = G * B02.ALDERSP.APD(BER_SØ_IND);                              
     W4_GP      = W4_GP /(100 * 12);                                            
                                                                                
                                                                                
    /*TILLEGG 13.9.89 HL - LOVENDRING 7.2 NR 2 B - 2. SETNING UTGÅR*/           
                                                                                
     IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S'      THEN                           
        DO;                                                                     
           IF (B01.PENSJONSTYPE2(BER_SØ_IND)    = 'S'      &                    
               B01.STATUS_KODE_HIST(BER_SØ_IND) = ' '      &                    
               B01.UFØRPENS.UFG    (BER_EK_IND) < 100      &                    
               B01.UFØRPENS.UFG    (BER_EK_IND) >   0      &                    
               B01.VIRK_DATO_ÅMD   (BER_SØ_IND) < 19900100 ) THEN               
              B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J';                   
                                                                                
       IF (B02.PENSJONSTYPE1(BER_EK_IND) = 'U' !                                
           B02.PENSJONSTYPE1(BER_EK_IND) = 'Y')     THEN                        
          DO;                                                                   
             IF (B02.VIRK_DATO_ÅMD(BER_SØ_IND) < 19900100 !                     
                B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'J') THEN            
                DO;                                                             
                   H1_GP = 1 - REST_PROSENT                                     
                           * B02.UFØRPENS.UFG(BER_EK_IND)/100;                  
                   IF (H1_GP < GP_PROSENT) THEN                                 
                      H1_GP = GP_PROSENT;                                       
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   B02.GAMMEL_SAMMENSTØTS_REGEL(BER_SØ_IND) = 'N';              
                   H1_GP  = GP_PROSENT;                                         
                END;                                                            
                                                                                
             W3_GP  = (W2_GP * H1_GP) / 12  + 0.5;                              
                                                                                
             YRKE_GP    = W3_GP;                                                
                                                                                
  /*REMEDY 577 - HL 20040921: */                                                
    /*       W5_GP  =  W4_GP * H2_GP + 0.5;  */                                 
             W5_GP  =  W4_GP * H1_GP + 0.5;                                     
                                                                                
             YRKEAPD_GP = W5_GP;                                                
                                                                                
          END;                                                                  
       ELSE                                                                     
           DO;                                                                  
                                                                                
              W3_GP      = ((W2_GP * GP_PROSENT) / 12) + 0.5;                   
              YRKE_GP    = W3_GP;                                               
              W5_GP      = W4_GP * GP_PROSENT + 0.5;                            
              YRKEAPD_GP = W5_GP;                                               
           END;                                                                 
                                                                                
 /*HIT 13.9.89 HL */                                                            
                                                                                
     END;                                                                       
  ELSE                                                                          
  IF DIV_PARAM_OMR.REDUSERT_GP_2G(BER_SØ_IND) ^= ' '  THEN   /*2000-2*/         
     DO;                                                                        
        W3_GP      = ((W2_GP * GP_PROSENT) / 12) + 0.5;                         
        YRKE_GP    = W3_GP;                                                     
        W5_GP      = W4_GP * GP_PROSENT + 0.5;                                  
        YRKEAPD_GP = W5_GP;                                                     
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
                                                                                
        W3_GP      = W2_GP / 12 + 0.5;                                          
        YRKE_GP    = W3_GP;                                                     
        W5_GP      = W4_GP + 0.5;                                               
        YRKEAPD_GP = W5_GP;                                                     
     END;                                                                       
                                                                                
  IF B02.YRKEPENS.YUG(BER_SØ_IND) >= 50    THEN                                 
                                                                                
     DO;                                                                        
                                                                                
        YRKE_ST = F_BEREGN_SÆRTILLEGG                                           
                     (                                                          
                      (YRKE_TP),                                                
                      0,                                                        
                      'J',                                                      
                      PROSENT,                                                  
                      (B02.YRKEPENS.YUG(BER_SØ_IND)),                           
                      (B02.TT_ANV(BER_SØ_IND))                                  
                     );                                                         
        YRKEAPD_ST = F_BEREGN_SÆRTILLEGG((YRKE_TP),0,'J',PROSENT,               
                           (B02.ALDERSP.APD(BER_SØ_IND)),                       
                           (B02.TT_ANV(BER_SØ_IND)));                           
                                                                                
     END;                                                                       
                                                                                
  ELSE                                                                          
                                                                                
     DO;                                                                        
        YRKE_ST    = 0;                                                         
        YRKEAPD_ST = 0;                                                         
     END;                                                                       
                                                                                
    /*YRKEPENSJON ER KAP11-PENSJON REGNET ETTER AKTUELL KAP11-UFG*/             
                                                                                
    YRKEPENSJON = YRKE_GP + YRKE_TP + YRKE_ST;                                  
                                                                                
    /*YRKEAPD ER KAP11-PENSJON SOM FULL UFØR, MEN REDUSERT MED APD*/            
                                                                                
    YRKEAPD = YRKEAPD_GP + YRKEAPD_TP + YRKEAPD_ST;                             
                                                                                
    /*ALDERSPENSJON ER AP REDUSERT MED APD                        */            
    ALDERSPENSJON   = B02.ALDERSP.TP(BER_SØ_IND) +                              
                      B02.ALDERSP.GP(BER_SØ_IND) +                              
                      B02.ALDERSP.ST(BER_SØ_IND);                               
                                                                                
    IF (YRKEAPD > ALDERSPENSJON) THEN                                           
       DO;  /* YRKEAPD > ALDERSPENSJON */                                       
           DIFF = 100 - B02.YRKEPENS.YUG(BER_SØ_IND);                           
           W1          = YRKE_TP * B02.ALDERSP.APD(BER_SØ_IND) /100;            
           W1          = W1 + B02.ALDERSP.TP(BER_SØ_IND) * DIFF/100;            
           B02.ALDERSP.TP(BER_SØ_IND) = W1 + 0.5;                               
                                                                                
           W1          = YRKE_GP * B02.ALDERSP.APD(BER_SØ_IND) /100;            
           W1          = W1 + B02.ALDERSP.GP(BER_SØ_IND) * DIFF/100;            
           B02.ALDERSP.GP(BER_SØ_IND) = W1 + 0.5;                               
                                                                                
           B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                    
                         (B02.ALDERSP.TP(BER_SØ_IND)),0,'J',PROSENT,            
                         (B02.ALDERSP.APD(BER_SØ_IND)),                         
                         (B02.TT_ANV(BER_SØ_IND)));                             
       END; /* YRKEAPD > ALDERSPENSJON */                                       
    ELSE                                                                        
    IF (YRKEAPD_TP > B02.ALDERSP.TP(BER_SØ_IND)) THEN                           
       DO;                                                                      
          DIFF = 100 - B02.YRKEPENS.YUG(BER_SØ_IND);                            
                                                                                
          W1          = YRKE_TP * B02.ALDERSP.APD(BER_SØ_IND) /100;             
          W1          = W1 + B02.ALDERSP.TP(BER_SØ_IND) * DIFF/100;             
          B02.ALDERSP.TP(BER_SØ_IND) = W1 + 0.5;                                
                                                                                
          B02.ALDERSP.ST(BER_SØ_IND) = F_BEREGN_SÆRTILLEGG(                     
                      (B02.ALDERSP.TP(BER_SØ_IND)),0,'J',PROSENT,               
                      (B02.ALDERSP.APD(BER_SØ_IND)),                            
                      (B02.TT_ANV(BER_SØ_IND)));                                
       END;                                                                     
                                                                                
    IF (B02.YRKE_POENG_1291(BER_SØ_IND) > 0) THEN                               
       DO;  /* YRKE_POENG_1291 > 0 */                                           
          W2_TP      = 35500 * 45 / 100;                                        
          W2_TP      = W2_TP * B02.YRKE_POENG_1291(BER_SØ_IND);                 
          W2_TP      = W2_TP /12;                                               
          W2_TP      = W2_TP * B02.YRKEPENS.YUG(BER_SØ_IND) / 100;              
          YRKE_GARANTI    = W2_TP + 0.5;                                        
                                                                                
          IF (YRKE_GARANTI > YRKE_TP) THEN                                      
             DO;  /* YRKE_GARANTI > YRKE_TP */                                  
                B02.GT_TILLEGG_LOV92(BER_SØ_IND) =                              
                     B02.GT_TILLEGG_LOV92(BER_SØ_IND)                           
                   + YRKE_GARANTI                                               
                   - YRKE_TP;                                                   
                B02.GT_LOV92(BER_SØ_IND) =                                      
                     B02.GT_LOV92(BER_SØ_IND)                                   
                   + YRKE_GARANTI                                               
                   - YRKE_TP;                                                   
             END; /* YRKE_GARANTI > YRKE_TP */                                  
       END; /* YRKE_POENG_1291 > 0 */                                           
                                                                                
    B02.ALDERSP.AP_ST_NETTO(BER_SØ_IND) =                                       
           B02.ALDERSP.ST(BER_SØ_IND);        /*200010*/                        
                                                                                
 END BEREGN_AP_OVERGANG_FRA_YP;                                                 
