 /*       SIST ENDRET 08/09-98 10.33.06 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/03-98 10.24.25 AV   MEA9991                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R0019946 PLI                                                   */00000030
 /*    PROC       ER LAGET I OKTOBER 1982 AV GRÆSMO.                  */00000040
 /*HENSIKT:                                                           */00000050
 /*    SØKER PÅ CHAR DEFINERT LINJE ETTER OPPGITT VARIABEL            */00000060
 /*    OG ENDRER DETTE TIL PARAMETERGITT VERDI.                       */00000070
 /*BRUKES:                                                            */00000080
 /*    LINJE = SUBSTITUTE(LINJE,GAMMEL_VERDI,NY_VERDI)                */00000090
 /*PARAMETRE INN:                                                     */00000100
 /*    1 LINJEN SOM SKAL ENDRE NOE AV INNHOLDET                       */00000110
 /*    2 VARIABEL SOM SKAL ENDRES                                     */00000120
 /*    3 FELTET SOM SKAL ERSTATTE DEN GAMLE VERDI                     */00000130
 /*PARAMETRE UT :                                                     */00000140
 /*    SVAR                                                           */00000150
 /* ***************************************************************** */00000160
 %PAGE;                                /*   */                          00000170
 SUBSTITUTE:                                                            00000180
    PROC (X1,X2,X3)  RETURNS (CHAR (255) VARYING );                     00000190
    /*                                                               */ 00000200
    /* ************************************************************* */ 00000210
    /*                                                               */ 00000220
    /* ENDRER VARIABLE TEKST DATA  A_1                               */ 00000230
    /*                                                               */ 00000240
    /* ************************************************************* */ 00000250
    /*                                                               */ 00000260
    DCL    (X1,X2,X3)         CHAR (*);                                 00000270
    DCL    SVAR               CHAR (255)  VARYING;                      00000280
    DCL    (L1,L2,L3)    FIXED BIN (15) STATIC;                         00000290
                                                                        00000300
    L1                       =     LENGTH(X1);                          00000310
    L2                       =     LENGTH(X2);                          00000320
    L3                       =     LENGTH(X3);                          00000330
                                                                        00000340
    IF  L1  >  0  &                                                     00000350
        L2  >  0  &                                                     00000360
        L3  >  0  THEN                                                  00000370
       DO;                                                              00000380
          IF  INDEX (X1,X2) > 0    THEN                                 00000390
             SVAR            =     SUBSTR (X1,1,INDEX(X1,X2) - 1) !!    00000400
                                   X3 !!                                00000410
                                   SUBSTR                               00000420
                                     (X1,                               00000430
                                      INDEX(X1,X2) +  L2,               00000440
                                      L1 - (INDEX(X1,X2) - L2));        00000450
          ELSE                                                          00000460
            SVAR            =     X1;                                   00000470
                                                                        00000480
       END;                                                             00000490
    ELSE                                                                00000500
       SVAR = '';                                                       00000510
   RETURN (SVAR);                                                       00000520
 END SUBSTITUTE;                                                        00000530
