 /*       SIST ENDRET 04/05-98 13.48.33 AV   SPA7339                  */00000000
 /*       SIST ENDRET 02/02-94 14.58.11 AV   DYBVIK                   */00000010
 /*       SIST ENDRET 16/10-86 12.28.23 AV   DYBVIK                   */00000020
 /*IDENTIFIKASJON:                                                  */  00000030
 /*    R0019904 - FUNKSJON I PLI.                                   */  00000040
 /*    FUNKSJONEN ER LAGET I APRIL 1981 AV JAN H KRISTENSEN.        */  00000050
 /*HENSIKT:                                                         */  00000060
 /*    KONTROLLERE OM FØDSELSNUMMERET ER GYLDIG.                    */  00000070
 /*    DERSOM DET IKKE ER NUMERISK ELLER INNEHOLDER FEIL            */  00000080
 /*    RETURNERES '0'B.                                             */  00000090
 /*    DERSOM FØDSELSNUMMERET BLIR AKSEPTERT RETURNERES '1'B.       */  00000100
 /*PARAMETER INN:                                                   */  00000110
 /*    FNR.                                                         */  00000120
 /*PARAMETER UT:                                                    */  00000130
 /*    RETUR.                                                       */  00000140
 /*BRUK:                                                            */  00000150
 /*    IF ^ F_GYLDIG_FNR(FNR) THEN (SKRIV FEIL)                     */  00000160
 /*******************************************************************/  00000170
 %PAGE;                                                                 00000180
 F_GYLDIG_FNR:    PROC(FNR) RETURNS(BIT(1)) OPTIONS(REENTRANT);         00000190
 /*DEKLARASJONER:                                                   */  00000200
 %SKIP(2);                                                              00000210
       DCL W1      PIC '9';                                             00000220
       DCL W2      PIC '9';                                             00000230
       DCL MOD BUILTIN,                                                 00000240
           FNR     PIC'(11)9',                                          00000250
           ÅRHUNDRE DEF FNR POS(7) PIC '999',                           00000260
           1 FNR_MND  DEF FNR POS(3) PIC '99',                          00000260
           1 FNR_AG DEF FNR,                                            00000270
             2 (S1,S2,S3,S4,S5,S6,S7,S8,S9,S10,S11) PIC '9',            00000280
           SJEKK10 FIXED DEC(2),                                        00000290
           SJEKK11 FIXED DEC(2),                                        00000300
           REST10 FIXED DEC(2),                                         00000310
           REST11 FIXED DEC(2),                                         00000320
           RETUR BIT(1) INIT ('1'B);                                    00000330
 %SKIP(1);                                                              00000340
 /*SELVE PROGRAMUTFØRELSEN:                                         */  00000350
 %SKIP(1);                                                              00000360
           REST10 = MOD((3*S1 + 7*S2 + 6*S3 + 1*S4 + 8*S5 +             00000370
                         9*S6 + 4*S7 + 5*S8 + 2*S9), 11);               00000380
           REST11 = MOD((5*S1 + 4*S2 + 3*S3 + 2*S4 + 7*S5 +             00000390
                         6*S6 + 5*S7 + 4*S8 + 3*S9 + 2*S10), 11);       00000400
           SJEKK10 = 11 - REST10;                                       00000410
           SJEKK11 = 11 - REST11;                                       00000420
           IF REST10 = 0 THEN SJEKK10 = 0;                              00000430
           IF REST11 = 0 THEN SJEKK11 = 0;                              00000440
           IF (SJEKK10 ^= S10 ! SJEKK11 ^= S11 ! FNR = 00000000000 !    00000450
       /*  ÅRHUNDRE > 749 ! FNR_MND > 12 ) THEN */                      00000460
           FNR_MND > 12 ) THEN                                          00000460
              RETUR = '0'B;                                             00000470
                                                                        00000480
   /*        NEW TEST                 */                                00000490
           W1 = S1;                                                     00000500
           W2 = S2;                                                     00000510
                                                                        00000520
           IF W1 > 3   THEN                                             00000530
              W1 = W1 - 4;                                              00000540
                                                                        00000550
           IF (W1*10 + W2 ) = 0 !                                       00000560
              (W1*10 + W2 ) > 301  THEN                                 00000570
               RETUR = '0'B;                                            00000580
                                                                        00000590
           IF (S3*10 + S4) = 0  !                                       00000600
              (S3*10 + S4) > 102  THEN                                  00000610
               RETUR = '0'B;                                            00000620
                                                                        00000630
   /*        NEW TEST                 */                                00000640
                                                                        00000650
                                                                        00000660
                                                                        00000670
           RETURN(RETUR);                                               00000680
 END F_GYLDIG_FNR;                                                      00000690
