 /*       SIST ENDRET 04/05-98 13.14.55 AV   JDA7339                  */00000000
 /*       SIST ENDRET 12/03-98 10.34.56 AV   SLA9300                  */00000010
 /*       SIST ENDRET 13/12-91 12.33.35 AV   DYBVIK                   */00000020
 /*********************************************************************/00000030
 /* IDENTIFIKASJON:                                                   */00000040
 /*    R0016051 - R0016021 (PROC-SAMLING) DELT OPP. BØ9112            */00000050
 /* HENSIKT:                                                          */00000060
 /*    EN PROGRAMMERT FUNKSJON SOM REGNER UT EN PERSONS ALDER         */00000070
 /* PROGRAMTILKNYTNING:                                               */00000080
 /*    LOKAL PROSEDYRE I R0016001                                     */00000090
 /* BRUK:                                                             */00000100
 /*    W_FELT = ALDER (FNR, TIDSPUNKT_AAMM)                           */00000110
 /*********************************************************************/00000120
                                                                        00000130
 ALDER: PROC (FNR,PR_TIDSPKT) RETURNS (PIC '999') OPTIONS(REENTRANT);   00000140
                                                                        00000150
    /*----------------------------------------------------------------*/00000160
    /*                                                                */00000170
    /* FUNKSJONEN TAR FØDSELSNUMMER OG EN AKTUELL MÅNED ANGITT PÅ     */00000180
    /* FORMEN ÅÅMM (F.EKS: MAI 1982 = 8205) OG PRODUSERER PERSONENS   */00000190
    /* ALDER VED TIDSPUNKT PR_MÅNED.                                  */00000200
    /*                                                                */00000210
    /*----------------------------------------------------------------*/00000220
                                                                        00000230
    DCL FNR                  PIC '(11)9',                               00000240
        MND                  PIC '99'  DEF FNR POS(3),                  00000250
        ÅR                   PIC '99'  DEF FNR POS(5),                  00000260
        LØPENR               PIC '999' DEF FNR POS(7);                  00000270
    DCL PR_TIDSPKT           PIC '9999',                                00000280
        PR_ÅR                PIC '99'  DEF PR_TIDSPKT POS(1),           00000290
        PR_MND               PIC '99'  DEF PR_TIDSPKT POS(3);           00000300
    DCL HJELP                PIC 'S(6)9' STATIC;                        00000310
    DCL SVAR                 PIC '999' STATIC;                          00000320
                                                                        00000330
    HJELP = ÅR * 12 + MND;                                              00000340
    HJELP = PR_ÅR * 12 + PR_MND - HJELP;                                00000350
                                                                        00000360
 /* TEST OM NOEN ER OVER 100 ÅR */                                      00000370
                                                                        00000380
    IF LØPENR >= 500 & LØPENR <= 749 THEN                               00000390
       HJELP = HJELP + 1200;  /* 100 ÅR A 12 MÅNEDER */                 00000400
                                                                        00000410
    IF HJELP < 0 THEN HJELP = HJELP + 100 * 12;                         00000420
    SVAR = HJELP / 12;        /* SKAL VÆRE HELTALLSDIVISJON */          00000430
    RETURN(SVAR);                                                       00000440
 END ALDER;                                                             00000450
                                                                        00000460
