 /*   SIST ENDRET PÅ PROD   2000.05.18 14.12.35 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.04.12 10.12.40 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.57.13 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.41.13 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NO1B  UNDERPROGRAM SOM BRUKES AV R001NO10    */        
 /*                            KONTROLL AU-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : BRITT FOSSUM                                     */        
 /*  PROGRAMMET BLE LAGET : APR 1989                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NO1B                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R0011802   BLANK TRANSOMR                                      */        
 /*    R0011803   KONTR AP SØKER                                      */        
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR AU OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
 P118_BEHANDLE_AU: PROC;                                                        
    %INCLUDE P0011801;                      /* TRANSOMRÅDE AP */                
    /* ============================================================== */        
    CALL BLANK_AU_SØKER;                         /* R0011802 */                 
    CALL BLANK_AU_MELDNR;                        /* R0011802 */                 
    CALL OVERF_AU_BLANKETT;                                                     
    CALL KONTROLLER_AU_SØKER(FEIL_FUNNET);       /* R0011803 */                 
    IF (FEIL_FUNNET) THEN                                                       
       CALL FINN_FEIL_AU;                                                       
                                                                                
    /* ************************************************************** */        
    /*  PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-  */        
    /*  RECORDEN TIL AU TRANSOMRÅDE FOR AU SØKER.                     */        
    /* ************************************************************** */        
                                                                                
    OVERF_AU_BLANKETT:PROC;                                                     
       AUS.FNR          =  BLANKETT_RECORD.FNR;                                 
       AUS.STBREV       =  AU_BLANKETT.STØNADSBREV_ØNSKES;                      
                                                                                
       IF F_FELT_PIC_CHAR2(AU_BLANKETT.STBREV_TRANS_TYPE) ^= '  ' THEN          
          AUS.TRANSTYPE =  AU_BLANKETT.STBREV_TRANS_TYPE;                       
                                                                                
    END OVERF_AU_BLANKETT;                                                      
                                                                                
    /* ************************************************************** */        
    /*   PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER  */        
    /*   FEIL I DEN OVERFØRTE RECORDEN.                               */        
    /* ************************************************************** */        
                                                                                
    FINN_FEIL_AU:PROC;                                                          
       FEIL_IND = 1;                                                            
                                                                                
       IF AUS.FNRNR ^= 0 &                                                      
          AUS.FNRNR ^= 999 THEN                                                 
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = AUS.FNRNR;                                 
             FEIL_IND = FEIL_IND + 1;                                           
          END;                                                                  
                                                                                
       IF AUS.STBREVNR ^= 0 &                                                   
          AUS.STBREVNR ^= 999 THEN                                              
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = AUS.STBREVNR;                              
             FEIL_IND = FEIL_IND + 1;                                           
          END;                                                                  
                                                                                
       IF AUS.TRANSTYPENR ^= 0 &                                                
          AUS.TRANSTYPENR ^= 999 THEN                                           
          DO;                                                                   
             W01_FEIL_NR(FEIL_IND) = AUS.TRANSTYPENR;                           
             IF FEIL_IND ^= 3 THEN                                              
                FEIL_IND  = FEIL_IND + 1;                                       
          END;                                                                  
                                                                                
    END FINN_FEIL_AU;                                                           
    /* ************************************************************** */        
    /*          E K S T E R N E    P R O C E D U R E R                */        
    /* ************************************************************** */        
    %INCLUDE R0011802;          /*     BLANK AU TRANSOMR   */                   
    %INCLUDE R0011803;          /*     KONTR AU SØKER      */                   
    /* ************************************************************** */        
 END P118_BEHANDLE_AU;                                                          
