 /*       SIST ENDRET 09/06-98 08.41.49 AV   SPA7339                  */00000000
 /*       SIST ENDRET 04/05-98 14.15.52 AV   JDA7339                  */00000010
 /*       SIST ENDRET 19/01-98 11.23.08 AV   SPA7339                  */00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /* **********************                                            */00000050
 /*  PROGRAM-IDENT : R00104U2  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000060
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000070
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000080
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000090
 /*                                                                   */00000100
 /* ***************************************************************** */00000110
 /*HENSIKT:                                                           */00000120
 /* **********                                                        */00000130
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000140
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000150
 /*    FORHÅND.                                                       */00000160
 /*    MAPS HØRER INN UNDER MAPSET 'S001F2'.                         */ 00000170
 /*                                                                   */00000180
 /* ***************************************************************** */00000190
 /*PROGRAMTILKNYTTING:                                                */00000200
 /* ********************                                              */00000210
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000220
 /*                                                                   */00000230
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000240
 /*    BRUK :                                                         */00000250
 /*    EXEC CICS XCTL PROGRAM ('R00104U2') COMMAREA(KOM_OMR);         */00000260
 /*    PROGRAMMET INCLUDER :                                          */00000270
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    U2       */00000280
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       U2       */00000290
 /* ***************************************************************** */00000300
 /*DATASETTOPPLYSNINGER:                                              */00000310
 /* ***********************                                           */00000320
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000330
 /*                                                                   */00000340
 /* ***************************************************************** */00000350
 /*FEILMELDINGER:                                                     */00000360
 /* *******************                                               */00000370
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000380
 /*                                                                   */00000390
 /* ***************************************************************** */00000400
                                                                        00000410
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000420
                                                                        00000430
          %INCLUDE P0019906;                                            00000440
          %INCLUDE P0019908;                                            00000450
          %INCLUDE P0019910;                                            00000460
          %INCLUDE P0019912;                                            00000470
          %INCLUDE P0019913;                                            00000480
                                                                        00000490
                                                                        00000500
 DCL                                                                    00000510
      (CSTG, ADDR)                   BUILTIN;                           00000520
 DCL  COMMAREA_PEKER         PTR,                                       00000530
      LOKAL_KOM_PTR          PTR;                                       00000540
                                                                        00000550
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000560
 DCL                                                                    00000570
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000580
    DFHBMUNP             CHAR(1) INIT(' '),                             00000590
    DFHBMBRY             CHAR(1) INIT('H'),                             00000600
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000610
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000620
    MELDING6O            CHAR(10),                                      00000630
    YMELDING6O           CHAR(10);                                      00000640
                                                                        00000650
          %INCLUDE S001F2  ;                                            00000660
          %INCLUDE P001N601;                                            00000670
                                                                        00000680
                                                                        00000690
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000700
                                                                        00000710
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000720
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000730
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000740
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000750
                                                                        00000760
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000770
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000780
                                                                        00000790
           IF ^W01_YSKADE THEN                                          00000800
              DO;                                                       00000810
                 CALL OVERFØR_U2SØKER_MAP;          /* R001N606 */      00000820
                 IF U2S.NORSK_BOSATT = 'N'  THEN                        00000830
                    DO;                                                 00000840
                       CALL TEKST_SPES_U2;          /* R001N607 */      00000850
                       CALL OVERFØR_U2SPES_MAP;     /* R001N606 */      00000860
                    END;                                                00000870
                 IF U2S.BT_ANT > 0 THEN                                 00000880
                    DO;                                                 00000890
                       CALL TEKST_BARN_U2;          /* R001N607 */      00000900
                       CALL OVERFØR_U2BARN_MAP;     /* R001N606 */      00000910
                    END;                                                00000920
                                                                        00000930
                 IF U2S.YSKADE_TILLEGG = 'J' THEN                       00000940
                    DO;                                                 00000950
                       W01_YSKADE = '1'B;                               00000960
                       W01_SIDE_ANTALL = W01_SIDE_ANTALL + 1;           00000970
                    END;                                                00000980
                                                                        00000990
                 S001N61O.DUMMYA = 'Ø';             /* PROT,DARK  */    00001000
                 W01_MAP  =  'S001N61';                                 00001010
              END;                                                      00001020
           ELSE                                                         00001030
              DO;                                                       00001040
                                                                        00001050
                 CALL OVERFØR_YP_MAP_U2;            /* R0010606 */      00001060
                                                                        00001070
                 W01_YSKADE = '0'B;                                     00001080
                                                                        00001090
                 S001201O.DUMMYA = 'Ø';             /* PROT,DARK  */    00001100
                                                                        00001110
                                                                        00001120
                 W01_MAP  =  'S001201';                                 00001130
                                                                        00001140
              END;                                                      00001150
                                                                        00001160
      EXEC CICS RETURN;                                                 00001170
                                                                        00001180
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00001190
      PROC(FIXED_DEC_5);                                                00001200
                                                                        00001210
      DCL                                                               00001220
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00001230
                                                                        00001240
   END SKRIV_FEIL;                                                      00001250
                                                                        00001260
        SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001270
                                                                        00001280
           DCL                                                          00001290
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001300
                                                                        00001310
        END SKRIV_FEIL_YP;                                              00001320
                                                                        00001330
        SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/            00001340
                                                                        00001350
           DCL                                                          00001360
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001370
                                                                        00001380
        END SKRIV_FEIL_SP;                                              00001390
                                                                        00001400
   %INCLUDE R0019912;                                                   00001410
   %INCLUDE R001N606;                                                   00001420
   %INCLUDE R001N607;                                                   00001430
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00001440
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00001450
                                                                        00001460
 END R001041;                                                           00001470
