 /*   SIST ENDRET PÅ PROD   2001.02.02  7.28.54 AV   HLA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.09.15 12.57.27 AV   JDA7339          */        
 /*       SIST ENDRET 21/07-98 14.29.49 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 10.34.45 AV   JDA7339                  */        
 /*       SIST ENDRET 04/06-98 15.42.24 AV   RFA9991                  */        
 /*       SIST ENDRET 12/01-83 12.13.16 AV   OLAV                     */        
 /*       SIST ENDRET 30/11-82 13.50.23 AV   OLAV                     */        
 /* *************************************************************** */          
 /*IDENTIFIKASJON:                                                  */          
 /*    R0019949 - PROSEDYRE I PLI                                   */          
 /*    PROGRAMMERER: OLAV NOV. 1982.                                */          
 /*HENSIKT:                                                         */          
 /*    BEREGNER FRAMTIDIG TRYGDETID.                                */          
 /*BRUK:                                                            */          
 /*    CALL BEREGN_TT_FRAMT(FNR,DATO_ÅMD)                           */          
 /*          FNR      SKAL VÆRE DCL FIXED(11)                       */          
 /*          DATO_ÅMD SKAL VÆRE DCL PIC '99999999'                  */          
 /*          TT_FRAMT SKAL VÆRE DCL FIXED(3)                        */          
 /*                                                                 */          
 /* *************************************************************** */          
 F_BEREGN_TT_FRAMT:PROC(FØDSELSNR,DATO_ÅMD) RETURNS(FIXED DEC(5));              
    %INCLUDE P0019980; /* DCL AV DIVERSE FNR */                                 
   DCL                                                                          
      FØDSELSNR                           DEC    FIXED(11),                     
      DATO_ÅMD                            PIC '99999999',                       
      TT_FRAMT                            DEC   FIXED(5) INIT (0),              
      W_TT_FRAMT1                         DEC   FIXED(7) INIT (0),              
      W_TT_FRAMT2                         DEC   FIXED(7) INIT (0);              
   DCL                                                                          
      W_DATO_ÅMD                                     PIC '99999999',            
      W_DATO_ÅM       DEF W_DATO_ÅMD        POS (1)  PIC '999999',              
      W_DATO_ÅR       DEF W_DATO_ÅMD        POS (1)  PIC '9999',                
      W_DATO_MND      DEF W_DATO_ÅMD        POS (5)  PIC '99';                  
   DCL                                                                          
      W_TT_FRAM_TIL_DATO                                PIC '(6)9',             
      W_TT_FRAM_TIL_ÅR  DEF W_TT_FRAM_TIL_DATO POS (1)  PIC '9999',             
      W_TT_FRAM_TIL_MND DEF W_TT_FRAM_TIL_DATO POS (5)  PIC '99';               
                                                                                
 /* ***************************************************************** */        
 /* BEREGNING AV B02.FRAMT                                            */        
 /* ***************************************************************** */        
      W_FNR        = FØDSELSNR;                                                 
      W_FNR_13     = KONV_FNR11_FNR13((W_FNR));                                 
      W_DATO_ÅMD   = DATO_ÅMD;                                                  
  /*  IF W_DATO_ÅM < 197301 THEN                                                
         W_TT_FRAM_TIL_DATO =                                                   
                         (ÅR13 + 70) * 100 + MND13;                             
      ELSE                                                                      
         W_TT_FRAM_TIL_DATO =                                                   
                          (ÅR13 + 67) * 100 + MND13; */                         
      /* ENDRET 150900 MARTIN */                                                
      IF W_DATO_ÅM < 197301 THEN                                                
         W_TT_FRAM_TIL_DATO =                                                   
            (W_FNR_R13.ÅR + 70) * 100 + W_FNR_R13.MND;                          
      ELSE                                                                      
      IF (F_KJØNN(W_FNR) = 'M'             &                                    
          B02.PENSJONSRETT_FØR_91(2) = 'J' ) !                                  
         (F_KJØNN(W_FNR) = 'K'             &                                    
          B02.PENSJONSRETT_FØR_91(1) = 'J' ) THEN                               
         W_TT_FRAM_TIL_DATO =                                                   
            (W_FNR_R13.ÅR + 67) * 100 + W_FNR_R13.MND;                          
      ELSE                                                                      
         W_TT_FRAM_TIL_DATO =                                                   
            (W_FNR_R13.ÅR + 66) * 100 + 12 ;                                    
                                                                                
      W_TT_FRAMT1 = (W_TT_FRAM_TIL_ÅR * 12)+ W_TT_FRAM_TIL_MND;                 
      W_TT_FRAMT2 = (W_DATO_ÅR  * 12) + W_DATO_MND;                             
                                                                                
      TT_FRAMT      = (W_TT_FRAMT1 - W_TT_FRAMT2);                              
                                                                                
      IF TT_FRAMT < 0 THEN                                                      
         TT_FRAMT = 0;                                                          
                                                                                
      RETURN(TT_FRAMT);                                                         
                                                                                
   END F_BEREGN_TT_FRAMT;                                                       
