 /*   SIST ENDRET PÅ PROD   2005.08.12 11.54.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.08.11  8.39.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.03.01  9.31.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.06.18 12.23.24 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.05.03 12.31.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.12.03  9.05.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.18  8.37.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.10.13 13.05.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.15  9.09.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.06.26  8.33.39 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.05.27 10.45.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.05.27 10.25.30 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.14 10.49.07 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.03.14 10.26.53 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2002.05.15 11.49.30 AV   HLA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.15.34 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.11.16 10.05.56 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.11.16  8.05.42 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.22.26 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.07 12.59.57 AV   JDA7339          */        
 /*   VERSJON R001MH10 SOM LÅ PÅ QASS                                 */        
 /*       SIST ENDRET 26/04-99 14.08.48 AV   JDA7339                  */        
 /*       SIST ENDRET 26/04-99 14.05.46 AV   JDA7339                  */        
 /*       SIST ENDRET 02/09-98 11.17.57 AV   SPA7339                  */        
 /*       SIST ENDRET 04/05-98 12.40.23 AV   JDA7339                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0014010 - GARANTI  SÆRTILLEGG - FUNKSJON  I PLI.             */        
 /*     PROGRAMMERER: TRUDE SPONBERG DES 93 .                         */        
 /*     ENDRET:                                                       */        
 /* HENSIKT                                                           */        
 /*     BEREGNE GARANTI SÆRTILLEGG. REGLEENDRING FRA 0194             */        
 /* PROGRAMTILKNYTNING                                                */        
 /*     PROSEDYREN BLIR INKLUDERT I 4001                              */        
 /* BRUK                                                              */        
 /* TEST I 4001 FOR BRUKE AV UNDERMODUL:                              */        
 /* PT1 = 'S' ELLER                                                   */        
 /* PT2 = 'F' OG                                                      */        
 /*IF B02.IKKE_GP(BER_SØ_IND) ^= 'J' THEN                            */         
 /*                                                                   */        
 /*ENDRET: 10.01.93 ALLE GAMLE FFU-SAKER FEIL. 19-3 KODE = 1,4,6      */        
 /*        SKAL IKKE HA ST FOR TT FØR 1967                            */        
 /*                                                                   */        
 /*ENDRET: 07.03.94 FØRELØPIG UFØRESTØNAD IKKE RETT TIL SÆRTILLEGG    */        
 /*        EVNT. EKTEFELLE MED PENSJON SKAL DERSOM 'RETT' OPP TIL     */        
 /*        ENSLIG SATS. TRUDE 070394                                  */        
 /*                                                                   */        
 /*ENDRET: 0894 - GARANTIEN BLE TESTET MOT UREDUSERT TP - BLE FEIL    */        
 /*        FOR DE SOM HAR REDUKSJON PGA INNTEKT.                      */        
 /* ***************************************************************** */        
 GARANTI_ST:PROC;                                                               
    DCL 1 ALDER_AFP_SØKER, %INCLUDE P0019932;      /*9904*/                     
    DCL 1 ALDER_AFP_EKTEF, %INCLUDE P0019932;      /*9904*/                     
    DCL SPAR_SUM_SØKER          FIXED DEC (5);                                  
    DCL SPAR_SUM_EKTEF          FIXED DEC (5);                                  
                                                                                
    DCL SUM_TP                   FIXED DEC (5),                                 
        ÅFT_MAX(2)               FIXED DEC (5),                                 
        FORH_INDIKATOR           CHAR      (1),                                 
        ST_PROSENT               FIXED DEC (5,2),                               
        GRAD                     FIXED DEC (3),                                 
        TT_ANV                   FIXED DEC (3);                                 
                                                                                
    DCL TT_ANV_EGEN              FIXED DEC (3) INIT (0),                        
        TT_ANV_EK                FIXED DEC (3) INIT (0);                        
                                                                                
    DCL SUM_EGEN                 FIXED DEC (5) INIT (0),                        
        SUM_EK                   FIXED DEC (5) INIT (0),                        
        SUM_TILSAMMEN            FIXED DEC (5) INIT (0),                        
        GARANTI_ST               FIXED DEC (5) INIT (0);                        
                                                                                
    DCL GARANTI_ST_EGEN          FIXED DEC (15,4) INIT (0),                     
        GARANTI_ST_EK            FIXED DEC (15,4) INIT (0),                     
        W_TILLEGG                FIXED DEC (5)    INIT (0),                     
        ST_TILLEGG_EGEN          FIXED DEC (5)    INIT (0),                     
        ST_TILLEGG_EK            FIXED DEC (5)    INIT (0),                     
        GAR_ST_EGEN              FIXED DEC (5)    INIT (0),                     
        GAR_ST_EK                FIXED DEC (5)    INIT (0),                     
        AP_ST_TILLEGG            FIXED DEC (5)    INIT (0),                     
        W_ST_TILLEGG             FIXED DEC (7,3)  INIT (0),                     
        A                        FIXED DEC (5)    INIT (0),                     
        B                        FIXED DEC (5)    INIT (0),                     
        FRADRAG_GARANTI_TP       FIXED DEC (5)    INIT (0),                     
        GARANTERT_ST             FIXED DEC (5)    INIT (0),                     
        HJELP_ST_EGEN            FIXED DEC (5)    INIT (0),                     
        HJELP_ST_EK /* NY */     FIXED DEC (5)    INIT (0),                     
        HJELP2_ST_EGEN           FIXED DEC (5)    INIT (0),                     
        W_GRAD_EGEN              FIXED DEC (7,3)  INIT (0),                     
        W_GRAD_EK                FIXED DEC (7,3)  INIT (0),                     
        GRAD_EGEN                FIXED DEC (3)    INIT (0),                     
        GRAD_EK                  FIXED DEC (3)    INIT (0),                     
        W_ST_FRADRAG             FIXED DEC (5)    INIT (0),                     
        IND                      FIXED BIN(15);                                 
                                                                                
   /* --------------------------------------------------------------- */        
   /* DEKLARERER SPESIELLE VARIABLER FOR EØSTILFELLER                 */        
   /* --------------------------------------------------------------- */        
   DCL TT_TEORETISK             FIXED DEC(15) INIT(0),                          
       TT_EØS_TEORETISK         FIXED DEC(15) INIT(0),                          
       TT_PRORATA               FIXED DEC(15) INIT(0),                          
       TT_EØS_PRORATA           FIXED DEC(15) INIT(0),                          
       TT_NORSK                 FIXED DEC(15) INIT(0);                          
                                                                                
   DCL ALDER_EK     FIXED DEC (5) INIT (0);                                     
   DCL FNR_EK       PIC'(11)9';                                                 
   DCL DATO_ÅM      PIC'(6)9';                      /*2000*/                    
   DCL DATO_ÅM_00   PIC'(8)9';                      /*2000*/                    
   DCL W_DATO_ÅMD   PIC'(8)9';                      /*2000*/                    
   DCL W_ÅR  DEF W_DATO_ÅMD POS(1) PIC '9999';      /*2000*/                    
   DCL W_MND DEF W_DATO_ÅMD POS(5) PIC '99';        /*2000*/                    
   /* DCL W_DATO_MÅ    FIXED DEC (5) INIT (0); */     /*2000*/                  
   DCL BRUTTO_ST_EGEN    FIXED DEC (5) INIT (0);                                
   DCL BRUTTO_ST_EK      FIXED DEC (5) INIT (0);                                
   DCL F_KODE_EGEN       CHAR      (1) INIT (' ');                              
   DCL F_KODE_EK         CHAR      (1) INIT (' ');                              
   DCL INDEX             FIXED BIN (15);                                        
                                                                                
    /* == START 4010 ================================================ */        
                                                                                
    ALDER_AFP_SØKER = B02.ALDERSP(BER_SØ_IND), BY NAME;  /*9904*/               
    ALDER_AFP_EKTEF = B02.ALDERSP(BER_EK_IND), BY NAME;  /*9904*/               
    SPAR_SUM_SØKER  = B02.SUM_YTELSE(BER_SØ_IND);        /*9904*/               
    SPAR_SUM_EKTEF  = B02.SUM_YTELSE(BER_EK_IND);        /*9904*/               
                                                                                
    W_DATO_ÅMD  = B02.VIRK_DATO_ÅMD(BER_SØ_IND);      /*2000*/                  
    FNR_EK    = B02.FNR(BER_EK_IND);                                            
                                                                                
    ALDER_EK  = F_ALDER((FNR_EK),(W_DATO_ÅMD));       /*2000*/                  
                                                                                
          /* UTENLADSBOENDE MED 19_3 KODE LIK 1,2,3,4,6 SKAL IKKE  */           
          /* HA MEDREGNET TT FØR 1967 I SÆRTILLEGG, TRUDE 10.01.94 */           
          /* TRYGDETID ETTER 66 MÅ VÆRE >= 3 ÅR FOR RETT TIL SÆRT.,*/           
          /* ELLERS MÅ DET VÆRE EN KONVENSJONSSAK.                 */           
                                                                                
   IF (B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND) = '1' !                             
       B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND) = '4' !                             
       B02.SPESOPPL.FRAVIK_19_3(BER_SØ_IND) = '6' ) THEN                        
      DO;  /* KUN TT FØR 1967 VED ST */                                         
         TT_ANV_EGEN  = B02.TT_ANV(BER_SØ_IND)                                  
                      - B02.TT_FØR_1967(BER_SØ_IND);                            
         IF (TT_ANV_EGEN < 0) THEN                                              
            TT_ANV_EGEN = 0;                                                    
      END; /* KUN TT FØR 1967 VED ST */                                         
   ELSE                                                                         
      TT_ANV_EGEN = B02.TT_ANV(BER_SØ_IND);                                     
                                                                                
   IF (B02.SPESOPPL.FRAVIK_19_3(BER_EK_IND) = '1' !                             
       B02.SPESOPPL.FRAVIK_19_3(BER_EK_IND) = '4' !                             
       B02.SPESOPPL.FRAVIK_19_3(BER_EK_IND) = '6' ) THEN                        
      DO; /* KUN TT FØR 1967 VED ST */                                          
         TT_ANV_EK = B02.TT_ANV(BER_EK_IND)                                     
                   - B02.TT_FØR_1967(BER_EK_IND);                               
         IF (TT_ANV_EK < 0) THEN                                                
            TT_ANV_EK = 0 ;                                                     
      END; /* KUN TT FØR 1967 VED ST */                                         
   ELSE                                                                         
      TT_ANV_EK = B02.TT_ANV(BER_EK_IND);                                       
                                                                                
        /* DERSOM TRYGDETID ER MINDRE ENN TRE ÅR, OG DET IKKE ER EN */          
        /* KONVENSJONS-SAK , FORELIGGER DET IKKE RETT TIL SÆRTILLEGG*/          
        /* FFU HAR PRØVD DETTE FOR RTV. TRUDE  24.010.93            */          
                                                                                
    IF (TT_ANV_EGEN                 <  3  &                                     
        B02.KONVENSJON(BER_SØ_IND) ^= 'J' ) THEN                                
       DO;  /* IKKE RETT TIL SÆRTILLEGG */                                      
          TT_ANV_EGEN                    = 0;                                   
    /*   B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND) -              
                                     (B02.ALDERSP.ST(BER_SØ_IND)+               
                                      B02.UFØRPENS.ST(BER_SØ_IND));             
         B02.ALDERSP.ST(BER_SØ_IND)    = 0;                                     
         ENDRA IFBM AP_ST_NETTO INNFØRING 111000 MARTIN */                      
          B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND) -             
                                      (B02.AP_ST_NETTO(BER_SØ_IND)+             
                                       B02.UFØRPENS.ST(BER_SØ_IND));            
          IF (B02.SUM_YTELSE(BER_SØ_IND) < 0) THEN                              
             B02.SUM_YTELSE(BER_SØ_IND) = 0;                                    
          B02.AP_ST_NETTO(BER_SØ_IND)    = 0;                                   
          B02.UFØRPENS.ST(BER_SØ_IND)   = 0;                                    
       END; /* IKKE RETT TIL SÆRTILLEGG */                                      
                                                                                
    IF (TT_ANV_EK                    <  3  &                                    
        B02.KONVENSJON (BER_EK_IND) ^= 'J' ) THEN                               
       DO;  /* IKKE RETT TIL SÆRTILLEGG */                                      
          TT_ANV_EK                      = 0;                                   
       /* B02.SUM_YTELSE(BER_EK_IND) = B02.SUM_YTELSE(BER_EK_IND) -             
                                      (B02.ALDERSP.ST(BER_EK_IND) +             
                                       B02.UFØRPENS.ST(BER_SØ_IND));            
          B02.ALDERSP.ST  (BER_EK_IND)   = 0;                                   
          ENDRA IFBM AP_ST_NETTO INNFØRING 111000 MARTIN */                     
          B02.SUM_YTELSE(BER_EK_IND) = B02.SUM_YTELSE(BER_EK_IND) -             
                                     (B02.AP_ST_NETTO(BER_EK_IND) +             
                                      B02.UFØRPENS.ST(BER_EK_IND));             
          B02.AP_ST_NETTO (BER_EK_IND)   = 0;                                   
          IF B02.SUM_YTELSE(BER_EK_IND) < 0       THEN                          
             B02.SUM_YTELSE(BER_EK_IND) = 0;                                    
          B02.AP_ST_NETTO(BER_EK_IND)    = 0;                                   
          B02.UFØRPENS.ST (BER_EK_IND)   = 0;                                   
       END; /* IKKE RETT TIL SÆRTILLEGG */                                      
                                                                                
         /*HIT TRUDE, 10.1.94  24.01.94*/                                       
                                                                                
    SELECT(B02.PENSJONSTYPE1(BER_SØ_IND));                                      
       WHEN('A','K')                                                            
          DO;  /* ALDERSPENSJON / AFP */                                        
             IF (B02.ALDERSP.APD(BER_SØ_IND) = 0) THEN                          
                DO;  /* NULL I APD */                                           
                   GRAD_EGEN     = 100;                                         
                   IF (B02.ALDERSP.AP_GP_NETTO(BER_SØ_IND) ^=                   
                       B02.ALDERSP.GP(BER_SØ_IND)           ) THEN              
                      F_KODE_EGEN   = 'J' ;                                     
                END; /* NULL I APD */                                           
             ELSE                                                               
                GRAD_EGEN  = B02.ALDERSP.APD(BER_SØ_IND);                       
             IF (B02.AP_GP_NETTO(BER_SØ_IND) = 0) THEN                          
                GRAD_EGEN   =  0;                                               
          END; /* ALDERSPENSJON / AFP */                                        
       WHEN('U','Y')                                                            
          DO;  /* UFØREPENSJON M/UTEN YRKESSKADE */                             
             GRAD_EGEN  = B02.UFØRPENS.UFG(BER_SØ_IND);                         
             IF (DIV_PARAM_OMR.RETT_TIL_ÅFT(BER_SØ_IND) = 'J') THEN             
                GRAD_EGEN  = 100;                                               
          END; /* UFØREPENSJON M/UTEN YRKESSKADE */                             
       OTHER;                                                                   
    END; /*SELECT PENSJONSTYPE1 SØKER */                                        
                                                                                
    SELECT(B02.PENSJONSTYPE1(BER_EK_IND));                                      
       WHEN('A','K')                                                            
          DO;  /* ALDERSPENSJON / AFP */                                        
            IF (B02.ALDERSP.APD(BER_EK_IND) = 0) THEN                           
               DO;  /* NULL I APD */                                            
                   GRAD_EK = 100;                                               
                   IF (B02.ALDERSP.AP_GP_NETTO(BER_EK_IND) ^=                   
                       B02.ALDERSP.GP(BER_EK_IND)           ) THEN              
                      F_KODE_EK     = 'J' ;                                     
               END; /* NULL I APD */                                            
            ELSE                                                                
               GRAD_EK = B02.ALDERSP.APD(BER_EK_IND);                           
            IF (B02.AP_GP_NETTO(BER_EK_IND) = 0) THEN                           
               GRAD_EK = 0;                                                     
          END; /* ALDERSPENSJON / AFP */                                        
       WHEN('U','Y')                                                            
          DO; /* UFØREPENSJON M/UTEN YRKESSKADE */                              
             GRAD_EK = B02.UFØRPENS.UFG(BER_EK_IND);                            
             IF (DIV_PARAM_OMR.RETT_TIL_ÅFT(BER_EK_IND) = 'J') THEN             
                GRAD_EK = 100;                                                  
         END; /* UFØREPENSJON M/UTEN YRKESSKADE */                              
      OTHER;                                                                    
   END; /*SELECT PENSJONSTYPE 1 EKTEFELLE */                                    
                                                                                
    /* SØKER */                                                                 
    SUM_EGEN = B02.AP_TP_NETTO(BER_SØ_IND) +                                    
            /* B02.ALDERSP.ST (BER_SØ_IND) + MARTIN 111000 */                   
               B02.AP_ST_NETTO(BER_SØ_IND) +                                    
               B02.VT_TP      (BER_SØ_IND) +                                    
               B02.UFØRPENS.TP(BER_SØ_IND) +                                    
               B02.UFØRPENS.ST(BER_SØ_IND) +                                    
          /*   B02.ÅFT        (BER_SØ_IND) +  TRUDE 220295*/                    
               B02.YRKEPENS.TP(BER_SØ_IND) +                                    
               B02.YRKEPENS.ST(BER_SØ_IND) +                                    
               B02.GT_TILLEGG_LOV92(BER_SØ_IND);                                
           /*  DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) */                   
                                                                                
    IF (F_KODE_EGEN = 'J') THEN                                                 
       SUM_EGEN = SUM_EGEN                                                      
                + (  B02.ALDERSP.TP(BER_SØ_IND)                                 
                   - B02.AP_TP_NETTO(BER_SØ_IND))                               
                + (  B02.ALDERSP.ST(BER_SØ_IND)                                 
                   - B02.AP_ST_NETTO(BER_SØ_IND));                              
                                                                                
    IF (DIV_PARAM_OMR.RETT_TIL_ÅFT(BER_SØ_IND) = 'J' &  /*9809*/                
        (B02.PENSJONSTYPE1(BER_SØ_IND) = 'U'       !                            
         B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y'       ) ) THEN                     
       DO; /* FINN ÅTTE-FEM-EN TILLEGGET */                                     
          IND = BER_SØ_IND;                                                     
          CALL BEREGN_ÅFT_MAX;                                                  
          SUM_EGEN = SUM_EGEN - ÅFT_MAX(IND);                                   
       END; /* FINN ÅTTE-FEM-EN TILLEGGET */                                    
                                                                                
    /* EKTEFELLE */                                                             
    SUM_EK   = B02.AP_TP_NETTO(BER_EK_IND) +                                    
      /*       B02.ALDERSP.ST (BER_EK_IND) + MARTIN 111000 IFBM NETTO */        
               B02.AP_ST_NETTO(BER_EK_IND) +                                    
               B02.VT_TP      (BER_EK_IND) +                                    
               B02.UFØRPENS.TP(BER_EK_IND) +                                    
               B02.UFØRPENS.ST(BER_EK_IND) +                                    
         /*    B02.ÅFT        (BER_EK_IND) +  TRUDE 220295 */                   
               B02.YRKEPENS.TP(BER_EK_IND) +                                    
               B02.YRKEPENS.ST(BER_EK_IND) +                                    
               B02.GT_TILLEGG_LOV92(BER_EK_IND);                                
            /*  B02.GARANTI_TP(BER_SØ_IND) ??????????*/                         
    IF (F_KODE_EK = 'J') THEN                                                   
       SUM_EK = SUM_EK                                                          
              + (  B02.ALDERSP.TP (BER_EK_IND)                                  
                 - B02.AP_TP_NETTO(BER_EK_IND) )                                
              + (  B02.ALDERSP.ST (BER_EK_IND)                                  
                 - B02.AP_ST_NETTO(BER_EK_IND) );                               
                                                                                
    IF (DIV_PARAM_OMR.RETT_TIL_ÅFT(BER_EK_IND) = 'J' &  /*9809*/                
        (B02.PENSJONSTYPE1 (BER_EK_IND) = 'U'      !                            
         B02.PENSJONSTYPE1(BER_EK_IND) = 'Y'       ) ) THEN                     
       DO;  /* FINN ÅTTE-FEM-EN TILLEGGET */                                    
          IND  = BER_EK_IND;                                                    
          CALL BEREGN_ÅFT_MAX;                                                  
          SUM_EK = SUM_EK - ÅFT_MAX(IND);                                       
       END; /* FINN ÅTTE-FEM-EN TILLEGGET */                                    
                                                                                
    IF B02.PENSJONSTYPE2(BER_SØ_IND) = 'S'  !                                   
       (B02.PENSJONSTYPE2(BER_SØ_IND) = 'N' &    /* TRUDE 0897 */               
        B02.PENSJONSTYPE2(BER_EK_IND) = 'P' &                                   
        B02.SIVILSTAND   (BER_SØ_IND) = 'G')    THEN                            
       DO;  /* SKAL HA SAMMENSTØT */                                            
          /* -------------------------------------------------------- */        
          /* SØKEREN   BEHANDLES                                      */        
          /* -------------------------------------------------------- */        
          GARANTI_ST_EGEN = ST_PROSENT_ENSLIG * G /100;                         
          IF (B02.PENSJONSTYPE1       (BER_SØ_IND) ^= 'A' &                     
              B02.GUNSTIGSTE_ALTERNATIV(BER_SØ_IND) = '2' ) !                   
             B02.PRO_RATA_BEREGNING   (BER_SØ_IND) = 'A'  THEN                  
             DO;  /* SPESIELLE REGLER FOR EØS-TILFELLER */                      
                IF B02.TT_16_66(BER_SØ_IND) > 0 THEN                            
                   TT_NORSK = B02.TT_16_66(BER_SØ_IND);                         
                ELSE                                                            
                   TT_NORSK                                                     
                      = B02.TT_FØR_1967(BER_SØ_IND) * 12;                       
               TT_EØS_TEORETISK                                                 
                  = B02.TT_TEORETISK_EØS_MND(BER_SØ_IND);                       
               TT_EØS_PRORATA                                                   
                  = B02.TT_PRO_RATA_MND(BER_SØ_IND);                            
               TT_TEORETISK                                                     
                  = TT_NORSK+TT_EØS_TEORETISK;                                  
               TT_PRORATA                                                       
                  = TT_NORSK+TT_EØS_PRORATA;                                    
               IF TT_TEORETISK > 480 THEN                                       
                  TT_TEORETISK = 480;                                           
               IF TT_PRORATA > 480 THEN                                         
                  TT_PRORATA = 480;                                             
      /*       IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'A' THEN   */                 
                  GARANTI_ST_EGEN                                               
                  = GARANTI_ST_EGEN * B02.TT_EØS_ANV_ÅR(BER_SØ_IND)/40;         
      /*       ELSE                                                             
                  GARANTI_ST_EGEN                                               
                  = GARANTI_ST_EGEN                                             
                  * TT_TEORETISK / 480;        */                               
                GARANTI_ST_EGEN                                                 
                   = GARANTI_ST_EGEN                                            
                   * TT_NORSK / TT_PRORATA;                                     
             END; /* SPESIELLE REGLER FOR EØS-TILFELLER */                      
          ELSE                                                                  
             DO;  /* ORDINÆRE REGLER */                                         
                GARANTI_ST_EGEN = GARANTI_ST_EGEN * TT_ANV_EGEN;                
                GARANTI_ST_EGEN = GARANTI_ST_EGEN / 40;                         
             END; /* ORDINÆRE REGLER */                                         
         GARANTI_ST_EGEN  =  GARANTI_ST_EGEN  / 12;                             
         BRUTTO_ST_EGEN   =  GARANTI_ST_EGEN + 0.5;                             
         GARANTI_ST_EGEN  =  GARANTI_ST_EGEN * GRAD_EGEN / 100;                 
          /* -------------------------------------------------------- */        
          /* EKTEFELLEN BEHANDLES                                     */        
          /* -------------------------------------------------------- */        
          GARANTI_ST_EK = ST_PROSENT_ENSLIG * G /100;                           
          IF (B02.PENSJONSTYPE1        (BER_EK_IND) ^= 'A' &                    
              B02.GUNSTIGSTE_ALTERNATIV(BER_EK_IND)  = '2' ) !                  
             B02.PRO_RATA_BEREGNING   (BER_EK_IND) = 'A'  THEN                  
             DO;  /* SPESIELLE REGLER FOR EØS-TILFELLER */                      
                IF B02.TT_16_66(BER_EK_IND) > 0 THEN                            
                   TT_NORSK = B02.TT_16_66(BER_EK_IND);                         
                ELSE                                                            
                   TT_NORSK                                                     
                      = B02.TT_FØR_1967(BER_EK_IND) * 12;                       
               TT_EØS_TEORETISK                                                 
                  = B02.TT_TEORETISK_EØS_MND(BER_EK_IND);                       
               TT_EØS_PRORATA                                                   
                  = B02.TT_PRO_RATA_MND(BER_EK_IND);                            
               TT_TEORETISK                                                     
                  = TT_NORSK+TT_EØS_TEORETISK;                                  
               TT_PRORATA                                                       
                  = TT_NORSK+TT_EØS_PRORATA;                                    
               IF TT_TEORETISK > 480 THEN                                       
                  TT_TEORETISK = 480;                                           
               IF TT_PRORATA > 480 THEN                                         
                  TT_PRORATA = 480;                                             
      /*       IF B02.PENSJONSTYPE1(BER_EK_IND) = 'A' THEN  */                  
                  GARANTI_ST_EK                                                 
                  = GARANTI_ST_EK * B02.TT_EØS_ANV_ÅR(BER_EK_IND)/ 40;          
     /*        ELSE                                                             
                  GARANTI_ST_EK                                                 
                  = GARANTI_ST_EGEN                                             
                  * TT_TEORETISK / 480;          */                             
               GARANTI_ST_EK                                                    
                  = GARANTI_ST_EK                                               
                  * TT_NORSK / TT_PRORATA;                                      
             END; /* SPESIELLE REGLER FOR EØS-TILFELLER */                      
          ELSE                                                                  
             DO;  /* ORDINÆRE REGLER */                                         
                GARANTI_ST_EK = GARANTI_ST_EK * TT_ANV_EK;                      
                GARANTI_ST_EK = GARANTI_ST_EK / 40;                             
             END; /* ORDINÆRE REGLER */                                         
         GARANTI_ST_EK    =  GARANTI_ST_EK / 12;                                
         BRUTTO_ST_EK     =  GARANTI_ST_EK + 0.5;                               
         GARANTI_ST_EK    =  GARANTI_ST_EK * GRAD_EK / 100;                     
         GAR_ST_EGEN  =  GARANTI_ST_EGEN + 0.5;                                 
         GAR_ST_EK    =  GARANTI_ST_EK   + 0.5;                                 
      END; /* SKAL HA SAMMENSTØT */                                             
                                                                                
    /* -------------------------------------------------------------- */        
    /* BOSATT > 0 BARE RETT TIL Y-PENSJON IKKE ST.TS 031195           */        
    /* -------------------------------------------------------------- */        
    IF (B02.BOSATT(BER_SØ_IND) > 0 &                                            
        B02.YRKEPENS.YUG(BER_SØ_IND) > 0)  &                                    
       (B02.UFØRPENS.UFG(BER_SØ_IND) =                                          
        B02.YRKEPENS.YUG(BER_SØ_IND))  THEN                                     
       GAR_ST_EGEN = 0;                                                         
    IF (B02.BOSATT(BER_EK_IND) > 0 &                                            
        B02.YRKEPENS.YUG(BER_EK_IND) > 0)  &                                    
       (B02.UFØRPENS.UFG(BER_EK_IND) =                                          
        B02.YRKEPENS.YUG(BER_EK_IND))  THEN                                     
       GAR_ST_EK = 0;                                                           
                                                                                
    /* -------------------------------------------------------------- */        
    /*FORELØPIG UFØRESTØNAD IKKE RETT TIL ST 030394  FLYTTA 0397 MH   */        
    /* -------------------------------------------------------------- */        
  /* IF B02.PENSJONSTYPE3(BER_SØ_IND) = 'A' THEN                                
       GAR_ST_EGEN  =  0;                                                       
    IF B02.PENSJONSTYPE3(BER_EK_IND) = 'A' THEN                                 
       GAR_ST_EK    =  0;                                                       
                        TRUDE REMEDY 239 */                                     
    GARANTERT_ST  = GAR_ST_EGEN + GAR_ST_EK;                                    
    SUM_TILSAMMEN = SUM_EGEN  + SUM_EK;                                         
                                                                                
    /* OVER HER ER ALT BRA - MARTIN 16112000 */                                 
                                                                                
    IF (SUM_TILSAMMEN < GARANTERT_ST) THEN                                      
       DO;  /* SUM TILSAMMEN UNDER GARANTERT SÆRTILLEGG */                      
          IF ((GAR_ST_EGEN > SUM_EGEN) &                                        
              B02.PENSJONSTYPE3(BER_SØ_IND) ^= 'A')  THEN    /*R239*/           
             SELECT  (B02.PENSJONSTYPE1(BER_SØ_IND));                           
                WHEN('A','K')                                                   
                   DO;  /* PT1 = A/K */                                         
                      HJELP_ST_EGEN                                             
                         = B02.AP_ST_NETTO(BER_SØ_IND);                         
                      B02.SUM_YTELSE(BER_SØ_IND)                                
                         = B02.SUM_YTELSE(BER_SØ_IND)                           
                         - B02.AP_ST_NETTO(BER_SØ_IND);                         
                      IF B02.SUM_YTELSE(BER_SØ_IND) < 0 THEN                    
                         B02.SUM_YTELSE(BER_SØ_IND) = 0;                        
                      ST_TILLEGG_EGEN = GAR_ST_EGEN - SUM_EGEN;                 
                      W_TILLEGG                                                 
                         = GARANTERT_ST                                         
                         - SUM_TILSAMMEN;                                       
                      IF (ST_TILLEGG_EGEN > W_TILLEGG) THEN                     
                         DO;                                                    
                            BRUTTO_ST_EGEN =                                    
                               BRUTTO_ST_EGEN - (ST_TILLEGG_EGEN                
                                                -W_TILLEGG);                    
                            ST_TILLEGG_EGEN = W_TILLEGG;                        
                         END;                                                   
                      B02.AP_ST_NETTO(BER_SØ_IND)                               
                         = B02.AP_ST_NETTO(BER_SØ_IND)                          
                         + ST_TILLEGG_EGEN;                                     
                      HJELP2_ST_EGEN                                            
                         = B02.AP_ST_NETTO(BER_SØ_IND);                         
                      BRUTTO_ST_EGEN                                            
                         = BRUTTO_ST_EGEN                                       
                         - B02.ALDERSP.TP(BER_SØ_IND);                          
                      DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND)                
                         = BRUTTO_ST_EGEN;                                      
                      B02.ALDERSP.ST(BER_SØ_IND)                                
                         = BRUTTO_ST_EGEN;                                      
                      IF (F_KODE_EGEN = 'J') THEN                               
                         DO;  /* F_KODE_EGEN = 'J' */                           
                            B02.SUM_YTELSE(BER_SØ_IND)                          
                               = B02.SUM_YTELSE(BER_SØ_IND)                     
                               - B02.AP_TP_NETTO(BER_SØ_IND)                    
                               - B02.AP_GP_NETTO(BER_SØ_IND);                   
                            IF (B02.KONV_P_KODE(BER_SØ_IND)^='K' &              
                          B02.VIRK_DATO_ÅMD(BER_SØ_IND)>19970000 ) !            
                          B02.VIRK_DATO_ÅMD(BER_SØ_IND)>20010000 THEN           
                               CALL JUSTER_40PROS(BER_SØ_IND);/*4021*/          
                            ELSE                                                
                               CALL JUSTER_FORVENTET        /*4022*/            
                                       ((B02.ALDERSP.KT(BER_SØ_IND))            
                                       ,BER_SØ_IND);                            
                            B02.SUM_YTELSE(BER_SØ_IND)                          
                               = B02.SUM_YTELSE(BER_SØ_IND)                     
                               + B02.AP_TP_NETTO(BER_SØ_IND)                    
                               + B02.AP_GP_NETTO(BER_SØ_IND);                   
                         END; /* F_KODE_EGEN = 'J' */                           
                      B02.SUM_YTELSE(BER_SØ_IND)                                
                      /* MARTIN 111000                                          
                         = B02.ALDERSP.ST(BER_SØ_IND) */                        
                         = B02.AP_ST_NETTO(BER_SØ_IND)                          
                         + B02.SUM_YTELSE(BER_SØ_IND);                          
                   END; /* PT1= A/K */                                          
                WHEN('U','Y')                                                   
                   DO;  /* PT1= U/Y */                                          
                      ST_TILLEGG_EGEN                                           
                         = GAR_ST_EGEN                                          
                         - SUM_EGEN;                                            
                      HJELP_ST_EGEN                                             
                         = B02.UFØRPENS.ST(BER_SØ_IND);                         
                      B02.SUM_YTELSE(BER_SØ_IND)                                
                         = B02.SUM_YTELSE(BER_SØ_IND)                           
                         - B02.UFØRPENS.ST(BER_SØ_IND);                         
                      W_TILLEGG                                                 
                         = GARANTERT_ST                                         
                         - SUM_TILSAMMEN;                                       
                      IF ST_TILLEGG_EGEN  > W_TILLEGG  THEN                     
                         ST_TILLEGG_EGEN  = W_TILLEGG;                          
                                                                                
                      /*ÅFT ER LAGT TIL I SUM ST_T..   */                       
                      /*TRUDE 040995                   */                       
                      IF (B02.ÅFT(BER_SØ_IND) > 0)  THEN                        
                         IF (B02.ÅFT(BER_SØ_IND)                                
                            < ST_TILLEGG_EGEN   ) THEN                          
                            ST_TILLEGG_EGEN                                     
                               = ST_TILLEGG_EGEN                                
                               - B02.ÅFT(BER_SØ_IND);                           
                         ELSE                                                   
                            ST_TILLEGG_EGEN = 0;                                
                      B02.UFØRPENS.ST(BER_SØ_IND)                               
                         = B02.UFØRPENS.ST(BER_SØ_IND)                          
                         + ST_TILLEGG_EGEN;                                     
                      HJELP2_ST_EGEN                                            
                         = B02.UFØRPENS.ST(BER_SØ_IND);                         
                      B02.SUM_YTELSE(BER_SØ_IND)                                
                         = B02.UFØRPENS.ST(BER_SØ_IND)                          
                         + B02.SUM_YTELSE(BER_SØ_IND);                          
                      BRUTTO_ST_EGEN                                            
                         = BRUTTO_ST_EGEN                                       
                         -( B02.UFØRPENS.TP(BER_SØ_IND)                         
                          + B02.YRKEPENS.TP(BER_SØ_IND));                       
                      DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND)                
                         = BRUTTO_ST_EGEN;                                      
                   END; /* PT1= U/Y */                                          
                OTHERWISE;                                                      
             END; /*SELECT PENSJONSTYPE1 BER_SØ_IND */                          
                                                                                
          IF DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) > 0 THEN               
             CALL GARTP;                                                        
                                                                                
          IF ((GAR_ST_EK > SUM_EK) &                                            
               B02.PENSJONSTYPE3(BER_EK_IND) ^= 'A')  THEN  /*R239*/            
             SELECT (B02.PENSJONSTYPE1(BER_EK_IND));                            
                WHEN('A','K')                                                   
                   DO;  /* PT1 = A/K */                                         
                      HJELP_ST_EK                                               
                         = B02.AP_ST_NETTO(BER_EK_IND);                         
                      B02.SUM_YTELSE(BER_EK_IND)                                
                         = B02.SUM_YTELSE(BER_EK_IND)                           
                         - B02.AP_ST_NETTO(BER_EK_IND);                         
                      IF (B02.SUM_YTELSE(BER_EK_IND) < 0) THEN                  
                         B02.SUM_YTELSE(BER_EK_IND) = 0;                        
                      ST_TILLEGG_EK = GAR_ST_EK - SUM_EK;                       
                      W_TILLEGG = GARANTERT_ST - SUM_TILSAMMEN;                 
                      IF (ST_TILLEGG_EK > W_TILLEGG) THEN                       
                         DO;                                                    
                            BRUTTO_ST_EK =                                      
                               BRUTTO_ST_EK - (ST_TILLEGG_EK                    
                                              -W_TILLEGG);                      
                            ST_TILLEGG_EK = W_TILLEGG;                          
                         END;                                                   
           /*   IF  FRADRAG_GARANTI_TP  > 0   THEN                              
                    ST_TILLEGG_EK       =  ST_TILLEGG_EK -                      
                                           FRADRAG_GARANTI_TP; */               
                /* KOMMENTERT UT 111000  */                                     
                      B02.AP_ST_NETTO(BER_EK_IND) =                             
                         B02.AP_ST_NETTO(BER_EK_IND) + ST_TILLEGG_EK;           
                      HJELP_ST_EK = B02.AP_ST_NETTO(BER_EK_IND);                
                      BRUTTO_ST_EK =                                            
                         BRUTTO_ST_EK - B02.ALDERSP.TP(BER_EK_IND);             
                      DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_EK_IND)                
                         = BRUTTO_ST_EK;                                        
                      B02.ALDERSP.ST(BER_EK_IND)                                
                         = BRUTTO_ST_EK;                                        
                IF F_KODE_EK   = 'J'  THEN                                      
                  DO;                                                           
                B02.SUM_YTELSE(BER_EK_IND) = B02.SUM_YTELSE(BER_EK_IND)         
                                         - B02.AP_TP_NETTO(BER_EK_IND)          
                                         - B02.AP_GP_NETTO(BER_EK_IND);         
                IF B02.SUM_YTELSE(BER_EK_IND) < 0       THEN                    
                   B02.SUM_YTELSE(BER_EK_IND) = 0;                              
                                                                                
                                    /*TILLEGG 180297 TRUDE*/                    
                IF (B02.KONV_P_KODE(BER_EK_IND) ^= 'K'    &                     
 /*2000*/           B02.VIRK_DATO_ÅMD(BER_EK_IND)> 19970000) !                  
                    B02.VIRK_DATO_ÅMD(BER_SØ_IND)>20010000 THEN                 
                    /* KORREKSJON MARTIN 10.2000  */                            
                     CALL JUSTER_40PROS(BER_EK_IND);  /*4021*/                  
                ELSE                                                            
                     CALL JUSTER_FORVENTET            /*4022*/                  
                             ((B02.ALDERSP.KT(BER_EK_IND))                      
                             ,BER_EK_IND);                                      
                                                                                
                B02.SUM_YTELSE(BER_EK_IND) = B02.SUM_YTELSE(BER_EK_IND)         
                                         + B02.AP_TP_NETTO(BER_EK_IND)          
                                         + B02.AP_GP_NETTO(BER_EK_IND);         
                  END;                                                          
                /* ENDRET 111000 MARTIN                                         
                B02.SUM_YTELSE(BER_EK_IND) =                                    
                                           B02.ALDERSP.ST(BER_EK_IND) +         
                                           B02.SUM_YTELSE(BER_EK_IND);          
                   TIL HIT MARTIN 111000 */                                     
                B02.SUM_YTELSE(BER_EK_IND) =                                    
                     B02.AP_ST_NETTO(BER_EK_IND)                                
                   + B02.SUM_YTELSE(BER_EK_IND);                                
           END;/*A,K*/                                                          
                                                                                
          WHEN('U','Y')                                                         
           DO;                                                                  
            IF  GAR_ST_EK   > SUM_EK   THEN                                     
              DO;                                                               
                ST_TILLEGG_EK    = GAR_ST_EK    - SUM_EK;                       
                                                                                
                W_TILLEGG  =  GARANTERT_ST - SUM_TILSAMMEN;                     
                IF ST_TILLEGG_EK   > W_TILLEGG  THEN                            
                   ST_TILLEGG_EK   = W_TILLEGG;                                 
                                                                                
                                                                                
                IF  FRADRAG_GARANTI_TP  > 0   THEN                              
                    ST_TILLEGG_EK       =  ST_TILLEGG_EK -                      
                                           FRADRAG_GARANTI_TP;                  
                                                                                
                B02.SUM_YTELSE(BER_EK_IND) =  B02.SUM_YTELSE(BER_EK_IND)        
                                   - B02.UFØRPENS.ST(BER_EK_IND);               
                        /*ÅFT ER LAGT TIL I SUM ST_T..   */                     
                        /*TRUDE 040995                   */                     
                                                                                
                IF  B02.ÅFT(BER_EK_IND) > 0  THEN                               
                  DO;                                                           
                    IF B02.ÅFT(BER_EK_IND)  <  ST_TILLEGG_EK THEN               
                       ST_TILLEGG_EK      = ST_TILLEGG_EK  -                    
                                                   B02.ÅFT(BER_EK_IND);         
                    ELSE                                                        
                       ST_TILLEGG_EK      = 0;                                  
                  END;                                                          
                                                                                
                B02.UFØRPENS.ST(BER_EK_IND) =                                   
                         B02.UFØRPENS.ST(BER_EK_IND) + ST_TILLEGG_EK;           
                B02.SUM_YTELSE(BER_EK_IND) =                                    
                                          B02.UFØRPENS.ST(BER_EK_IND) +         
                                          B02.SUM_YTELSE(BER_EK_IND);           
                BRUTTO_ST_EK = BRUTTO_ST_EK -                                   
                               ( B02.UFØRPENS.TP(BER_EK_IND) +                  
                                 B02.YRKEPENS.TP(BER_EK_IND));                  
           DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_EK_IND) = BRUTTO_ST_EK;           
              END;                                                              
           END;/*U,Y*/                                                          
         OTHERWISE;                                                             
        END; /*SELECT EK*/                                                      
                                                                                
    /* 13.01-94 TRUDE            */                                             
  IF  DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND) > 0 THEN                      
    DO;                                                                         
         B02.SUM_YTELSE(BER_EK_IND) =                                           
                           B02.SUM_YTELSE(BER_EK_IND) -                         
                            DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND);        
         IF  DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND) >                      
                                              ST_TILLEGG_EK  THEN               
             DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND) =                      
                            DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND)         
                            - ST_TILLEGG_EK;                                    
         ELSE                                                                   
             DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND) = 0;                   
                                                                                
         B02.SUM_YTELSE(BER_EK_IND) =                                           
                            B02.SUM_YTELSE(BER_EK_IND) +                        
                            DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND);        
                                                                                
          /* VI MÅ OGSÅ REDUSERE EKTEFELLES(SOM NÅ ER SØKER) SITT     */        
          /* EVENTUELLE SÆTILLEGGE. TRUDE, 14.01.94                   */        
                                                                                
     IF  DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND) >  0  &                    
         ST_TILLEGG_EGEN                             >  0  THEN                 
       DO;                                                                      
         IF   DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND) >                     
                                           ST_TILLEGG_EGEN  THEN                
            DO;                                                                 
              ST_TILLEGG_EGEN         = 0;                                      
              IF B02.PENSJONSTYPE1(BER_SØ_IND)  = 'A' !                         
                 B02.PENSJONSTYPE1(BER_SØ_IND)  = 'K' THEN                      
                 /* ENDRA 111000 MARTIN                                         
                 B02.ALDERSP.ST(BER_SØ_IND)   =  HJELP_ST_EGEN;                 
                 TIL HIT MARTIN */                                              
                 B02.AP_ST_NETTO(BER_SØ_IND) =  HJELP_ST_EGEN;                  
              ELSE                                                              
              IF B02.PENSJONSTYPE1(BER_SØ_IND)  = 'U' !                         
                 B02.PENSJONSTYPE1(BER_SØ_IND)  = 'Y' THEN                      
                 B02.UFØRPENS.ST(BER_SØ_IND)  =  HJELP_ST_EGEN;                 
                                                                                
              B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)           
                               - HJELP2_ST_EGEN + HJELP_ST_EGEN;                
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND) -        
                                            ST_TILLEGG_EGEN;                    
               ST_TILLEGG_EGEN  =  ST_TILLEGG_EGEN -                            
                          DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_EK_IND);          
               IF  B02.PENSJONSTYPE1(BER_SØ_IND) = 'A' !                        
                   B02.PENSJONSTYPE1(BER_SØ_IND) = 'K' THEN                     
                 DO;                                                            
                    /* ENDRA 111000 MARTIN                                      
                    B02.SUM_YTELSE(BER_SØ_IND) =                                
                                           B02.SUM_YTELSE(BER_SØ_IND) -         
                                           B02.ALDERSP.ST(BER_SØ_IND);          
                    B02.ALDERSP.ST(BER_SØ_IND)    =  ST_TILLEGG_EGEN +          
                                                     HJELP_ST_EGEN;             
                    B02.SUM_YTELSE(BER_SØ_IND) =                                
                                           B02.SUM_YTELSE(BER_SØ_IND) +         
                                           B02.ALDERSP.ST(BER_SØ_IND);          
                    TIL HIT MARTIN */                                           
                    B02.SUM_YTELSE(BER_SØ_IND) =                                
                                           B02.SUM_YTELSE(BER_SØ_IND) -         
                                           B02.AP_ST_NETTO(BER_SØ_IND);         
                    B02.AP_ST_NETTO(BER_SØ_IND)  =  ST_TILLEGG_EGEN +           
                                                   HJELP_ST_EGEN;               
                    B02.SUM_YTELSE(BER_SØ_IND) =                                
                           B02.SUM_YTELSE(BER_SØ_IND) +                         
                           B02.AP_ST_NETTO(BER_SØ_IND);                         
                 END;                                                           
               ELSE                                                             
                 IF  B02.PENSJONSTYPE1(BER_SØ_IND) = 'U' !                      
                     B02.PENSJONSTYPE1(BER_SØ_IND) = 'Y' THEN                   
                   DO;                                                          
                     B02.SUM_YTELSE(BER_SØ_IND) =                               
                                           B02.SUM_YTELSE(BER_SØ_IND) -         
                                           B02.UFØRPENS.ST(BER_SØ_IND);         
                    B02.UFØRPENS.ST(BER_SØ_IND)   =  ST_TILLEGG_EGEN +          
                                                     HJELP_ST_EGEN;             
                 B02.SUM_YTELSE(BER_SØ_IND) = B02.SUM_YTELSE(BER_SØ_IND)        
                               + B02.UFØRPENS.ST(BER_SØ_IND);                   
                  END;                                                          
            END;                                                                
       END; /*GARANTITILLEGG NÅ > 0 */                                          
    END; /*GARANTITILLEGG TIDLIGERE > 0 */                                      
                                                                                
                                                                                
   /* STM FLYTTET. BLE FEIL DER HVOR DET IKKE SKAL REGNET NYTT ST */            
   /* TRUDE 24.07.95  */                                                        
                                                                                
   /* ÅFT LEGGES TIL DOBBELT : 200002 HL: */                                    
                                                                                
   /* B02.SUM_YTELSE(BER_SØ_IND) =                                              
                    B02.SUM_YTELSE(BER_SØ_IND) +                                
                    B02.ÅFT (BER_SØ_IND);   */                                  
  /*  B02.SUM_YTELSE(BER_EK_IND) =                                              
                               B02.SUM_YTELSE(BER_EK_IND) +                     
                               B02.ÅFT (BER_EK_IND);                */          
      END;/*SUM_TILSAMMEN ..*/                                                  
 /* ----------------------------------------------------------------- */        
 GARTP:                                                                         
    PROC;                                                                       
                                                                                
    B02.SUM_YTELSE(BER_SØ_IND)                                                  
       = B02.SUM_YTELSE(BER_SØ_IND)                                             
       - DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND);                           
                                                                                
    IF (DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) >                           
        ST_TILLEGG_EGEN                             ) THEN                      
       DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND)                              
          = DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND)                         
          - ST_TILLEGG_EGEN;                                                    
    ELSE                                                                        
       DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND) = 0;                         
                                                                                
    B02.SUM_YTELSE(BER_SØ_IND)                                                  
       = B02.SUM_YTELSE(BER_SØ_IND)                                             
       + DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND);                           
                                                                                
    FRADRAG_GARANTI_TP                                                          
       = DIV_PARAM_OMR.GARANTITILLEGG_TP(BER_SØ_IND);                           
                                                                                
    IF (SUM_TILSAMMEN + FRADRAG_GARANTI_TP) > GARANTERT_ST   THEN               
       GOTO L900;                                                               
                                                                                
 END GARTP;                                                                     
 /* ----------------------------------------------------------------- */        
                                                                                
   /* NEDENF. TO STM FLYTTET INN TIDLIGERE I PGM. TRUDE 240695*/                
   /* GAV DOBBELT 8-5-1 TILLEGG                               */                
  /* *****                                                                      
   B02.SUM_YTELSE(BER_SØ_IND) =                                                 
                               B02.SUM_YTELSE(BER_SØ_IND) +                     
                               B02.ÅFT (BER_SØ_IND);    TRUDE 220295            
                                                                                
   B02.SUM_YTELSE(BER_EK_IND) =                                                 
                               B02.SUM_YTELSE(BER_EK_IND) +                     
                               B02.ÅFT (BER_EK_IND);    TRUDE 220295            
          ***** */                                                              
 /* ----------------------------------------------------------------- */        
 BEREGN_ÅFT_MAX:                                                                
    PROC;                                                                       
                                                                                
    DCL ÅFT                FIXED    (5) INIT (0),                               
        W_ÅFT              FIXED    (5) INIT (0),                               
        RETT_TIL_ÅFT       BIT      (1)  INIT('1'B),                            
        HJELP              FIXED    (9,3)   INIT(0),                            
        GP100              FIXED    (5)     INIT(0),                            
        FAKTOR             FIXED    (5)     INIT(0), /* 3 INIT (100) */         
        I                  FIXED BIN(15),                                       
        IND_EK             FIXED BIN(15);                                       
                                                                                
    IF IND  = 1  THEN                                                           
       IND_EK  = 2;                                                             
    ELSE                                                                        
       IND_EK  = 1;                                                             
                                                                                
    IF  (B02.PENSJONSTYPE1(IND_EK) = 'U' !                                      
         B02.PENSJONSTYPE1(IND_EK) = 'Y' ) THEN                                 
       DO;                                                                      
          IF B02.GAMMEL_SAMMENSTØTS_REGEL(IND) = 'J' THEN                       
             FAKTOR = B02.UFØRPENS.UFG(IND_EK);                                 
          ELSE                                                                  
             FAKTOR = 100;                                                      
       END;                                                                     
    ELSE                                                                        
       FAKTOR = 100;                                                            
                                                                                
    IF (B02.PENSJONSTYPE2(IND) = 'S') THEN                                      
       IF (B02.PENSJONSTYPE1(IND_EK) = 'A' !                                    
           B02.PENSJONSTYPE1(IND_EK) = 'K' ) THEN                               
          HJELP = GP_PROSENT;                                                   
       ELSE                                                                     
          HJELP = MAX(GP_PROSENT,(1-REST_PROSENT*(FAKTOR/100)));                
    ELSE                                                                        
       HJELP = 1;                                                               
    HJELP = HJELP * G;                                                          
    HJELP = HJELP * B02.TT_ANV(IND) / 40;                                       
    HJELP = HJELP / 12 + 0.5;                                                   
    GP100 = HJELP;                                                              
                                                                                
  /*IF B02.PENSJONSTYPE2(IND) = 'S'                THEN                         
  /*   DO;  /* PT2 = S */                                                       
  /*      IF B02.PENSJONSTYPE1(IND_EK) = 'A' !                                  
  /*         B02.PENSJONSTYPE1(IND_EK) = 'K'             THEN                   
  /*         DO;                                                                
  /*            HJELP = G     * 0.75;      */                                   
  /*            HJELP = G     * GP_PROSENT;                                     
  /*            HJELP = HJELP * B02.TT_ANV(IND) / 40;                           
  /*            HJELP = HJELP / 12 + 0.5;                                       
  /*            GP100 = HJELP;                                                  
  /*         END;                                                               
  /*      ELSE                                                                  
  /*         DO;                                                                
  /*            HJELP = 1 - 0.25 * (FAKTOR / 100);   */                         
  /*            HJELP = 1 - REST_PROSENT * (FAKTOR / 100);                      
  /*            HJELP = HJELP * G;                                              
  /*            HJELP = HJELP * B02.TT_ANV(IND) / 40;                           
  /*            HJELP = HJELP / 12 + 0.5;                                       
  /*            GP100 = HJELP;                                                  
  /*         END;                                                               
  /*   END; /* PT2 = S */                                                       
  /*ELSE                                                                        
  /*   DO;                                                                      
  /*      HJELP = G * B02.TT_ANV(IND) / 40;                                     
  /*      HJELP = HJELP / 12 + 0.5;                                             
  /*      GP100 = HJELP;                                                        
  /*   END;                                                                     
  */                                                                            
                                                                                
    W_ÅFT                                                                       
       = GP100                                                                  
       -(  B02.UFØRPENS.GP (IND)                                                
         + B02.UFØRPENS.TP (IND)                                                
         + B02.YRKEPENS.GP (IND)                                                
         + B02.YRKEPENS.TP (IND));                                              
    ÅFT_MAX                                                                     
       = W_ÅFT                                                                  
       + B02.UFØRPENS.TP(IND)                                                   
       + B02.YRKEPENS.TP(IND);                                                  
 END BEREGN_ÅFT_MAX;                                                            
                                                                                
 L900:                                                                          
                                                                                
 /*TILLEGG 9904 */                                                              
                                                                                
 /*LEGG TILBAKE UENDRET : */                                                    
    /* -------------------------------------------------------------- */        
    /* NØDLØSNING SOM VI SKAL RETTE OPP SEINERE - MARTIN 151100       */        
    /* -------------------------------------------------------------- */        
                                                                                
    IF DIV_PARAM_OMR.AFP_REDUSERT_70(BER_SØ_IND) = 'J'    THEN                  
       DO;                                                                      
          B02.ALDERSP(BER_SØ_IND) = ALDER_AFP_SØKER, BY NAME;                   
          B02.SUM_YTELSE(BER_SØ_IND) = SPAR_SUM_SØKER;                          
       END;                                                                     
    IF DIV_PARAM_OMR.AFP_REDUSERT_70(BER_EK_IND) = 'J'    THEN                  
       DO;                                                                      
          B02.ALDERSP(BER_EK_IND) = ALDER_AFP_EKTEF, BY NAME;                   
          B02.SUM_YTELSE(BER_EK_IND) = SPAR_SUM_EKTEF;                          
       END;                                                                     
                                                                                
    /*20031114 HL: VI MÅ RETTE OGSÅ AFPHIST:       */                           
                                                                                
    DATO_ÅM    = W_VIRK_DATO_ÅMD / 100;                                         
    DATO_ÅM_00 = DATO_ÅM * 100;                                                 
    IF B02.PENSJONSTYPE1(BER_SØ_IND) = 'K'        &                             
       B02.SUM_YTELSE(BER_SØ_IND) > SPAR_SUM_SØKER      THEN                    
    DO;                                                                         
              /* ENDRET 20->30 SP 18.07.05 */                                   
       DO I = 1 TO 30 UNTIL (B02.AFPDATO_ÅMD(BER_SØ_IND,I) =                    
                                             DATO_ÅM_00);                       
          IF B02.AFPDATO_ÅMD(BER_SØ_IND,I) = 0     THEN                         
             I = 30;                                                            
       END;                                                                     
       IF I > 0     &                                                           
          I < 31        THEN                                                    
       DO;                                                                      
          IF B02.RED_AFP(BER_SØ_IND,I) <                                        
                         B02.SUM_YTELSE(BER_SØ_IND) THEN                        
             DO;                                                                
                B02.FULL_AFP(BER_SØ_IND,I)  =                                   
                   B02.ALDERSP.TP(BER_SØ_IND) +                                 
                   B02.ALDERSP.GP(BER_SØ_IND) +                                 
                   B02.ALDERSP.ST(BER_SØ_IND) +                                 
                   B02.ALDERSP.AFP_TILLEGG(BER_SØ_IND);                         
                                                                                
                B02.RED_AFP(BER_SØ_IND,I) =                                     
                   B02.AP_TP_NETTO(BER_SØ_IND) +                                
                   B02.AP_GP_NETTO(BER_SØ_IND) +                                
                   B02.AP_ST_NETTO(BER_SØ_IND) +                                
                   B02.AFP_TILLEGG_NETTO(BER_SØ_IND);                           
             END;                                                               
       END;                                                                     
    END;                                                                        
    IF B02.PENSJONSTYPE1(BER_EK_IND) = 'K'        &                             
       B02.SUM_YTELSE(BER_EK_IND) > SPAR_SUM_EKTEF      THEN                    
    DO;                                                                         
            /* ENDRET 20->30 SP 18.07.05 */                                     
       DO I = 1 TO 30 UNTIL (B02.AFPDATO_ÅMD(BER_EK_IND,I) =                    
                                             DATO_ÅM_00);                       
          IF B02.AFPDATO_ÅMD(BER_EK_IND,I) = 0     THEN                         
             I = 30;                                                            
       END;                                                                     
       IF I > 0     &                                                           
          I < 31        THEN                                                    
       DO;                                                                      
          IF B02.RED_AFP(BER_EK_IND,I) <                                        
                         B02.SUM_YTELSE(BER_EK_IND) THEN                        
             DO;                                                                
                B02.FULL_AFP(BER_EK_IND,I)  =                                   
                   B02.ALDERSP.TP(BER_EK_IND) +                                 
                   B02.ALDERSP.GP(BER_EK_IND) +                                 
                   B02.ALDERSP.ST(BER_EK_IND) +                                 
                   B02.ALDERSP.AFP_TILLEGG(BER_EK_IND);                         
                                                                                
                B02.RED_AFP(BER_EK_IND,I) =                                     
                   B02.AP_TP_NETTO(BER_EK_IND) +                                
                   B02.AP_GP_NETTO(BER_EK_IND) +                                
                   B02.AP_ST_NETTO(BER_EK_IND) +                                
                   B02.AFP_TILLEGG_NETTO(BER_EK_IND);                           
             END;                                                               
       END;                                                                     
    END;                                                                        
                                                                                
    /* L.O.F PARAGRAF 3-3 FØRSTE LEDD:                                */        
    /*    "SÆRTILLEGGET YTES TIL PENSJONISTER SOM IKKE HAR RETT TIL   */        
    /*     TILLEGGSPENSJON ELLER HAR TILLEGGSPENSJON SOM ER MINDRE    */        
    /*     ENN SÆRTILLEGGET. SÆRTILLEGGET FALLER BORT I DEN           */        
    /*     UTSTREKNING DET YTES TILLEGGSPENSJON."                     */        
    /* KOMMENTAR TIL FØRSTE LEDD, ANNET AVSNITT, TO FØRSTE PUNKTUM:   */        
    /*    "TILLEGGSPENSJONEN SKAL GÅ TIL FULLT FRADRAG I SÆRTILLEGGET.*/        
    /*     VENTETILLEGG TIL TILLEGGSPENSJON, GITT ETTER TIDLIGERE     */        
    /*     LOVGIVING, REGNES I DENNE SAMMENHENG SOM TILLEGGSPENSJON   */        
    /*     OG SKAL DERFOR OGSÅ GÅ TIL FULLT FRADRAG I SÆRTILLEGGET."  */        
    /* -------------------------------------------------------------- */        
    IF (B02.ALDERSP.VT_TP(BER_SØ_IND) > 0) THEN                                 
       DO;                                                                      
          IF (B02.ALDERSP.VT_TP(BER_SØ_IND) <                                   
              B02.ALDERSP.ST(BER_SØ_IND) ) THEN                                 
             B02.ALDERSP.ST(BER_SØ_IND) = B02.ALDERSP.ST(BER_SØ_IND)            
                                        - B02.ALDERSP.VT_TP(BER_SØ_IND);        
          ELSE                                                                  
             B02.ALDERSP.ST(BER_SØ_IND) = 0;                                    
  /* ********                                                                   
          IF (B02.ALDERSP.VT_TP(BER_SØ_IND) <                                   
              B02.AP_ST_NETTO(BER_SØ_IND) ) THEN                                
             B02.AP_ST_NETTO(BER_SØ_IND) = B02.AP_ST_NETTO(BER_SØ_IND)          
                                        - B02.ALDERSP.VT_TP(BER_SØ_IND);        
          ELSE                                                                  
             B02.ALDERSP.ST(BER_SØ_IND) = 0;                                    
  *************** */                                                            
          IF B02.ALDERSP.ST(BER_SØ_IND) <                                       
                              B02.AP_ST_NETTO(BER_SØ_IND)    THEN               
             B02.ALDERSP.ST(BER_SØ_IND) = B02.AP_ST_NETTO(BER_SØ_IND);          
                                                                                
       END;                                                                     
                                                                                
                                                                                
    IF (B02.ALDERSP.VT_TP(BER_EK_IND) > 0) THEN                                 
       DO;                                                                      
          IF (B02.ALDERSP.VT_TP(BER_EK_IND) <                                   
              B02.ALDERSP.ST(BER_EK_IND) ) THEN                                 
             B02.ALDERSP.ST(BER_EK_IND) = B02.ALDERSP.ST(BER_EK_IND)            
                                        - B02.ALDERSP.VT_TP(BER_EK_IND);        
          ELSE                                                                  
             B02.ALDERSP.ST(BER_EK_IND) = 0;                                    
  /* *********************                                                      
          IF (B02.ALDERSP.VT_TP(BER_EK_IND) <                                   
              B02.AP_ST_NETTO(BER_EK_IND) ) THEN                                
             B02.AP_ST_NETTO(BER_EK_IND) = B02.AP_ST_NETTO(BER_EK_IND)          
                                        - B02.ALDERSP.VT_TP(BER_EK_IND);        
          ELSE                                                                  
             B02.ALDERSP.ST(BER_EK_IND) = 0;                                    
  ************************ */                                                   
          IF B02.ALDERSP.ST(BER_EK_IND) <                                       
                              B02.AP_ST_NETTO(BER_EK_IND)    THEN               
             B02.ALDERSP.ST(BER_EK_IND) = B02.AP_ST_NETTO(BER_EK_IND);          
                                                                                
       END;                                                                     
 END GARANTI_ST;                                                                
