 /*   SIST ENDRET PÅ PROD   2006.04.07  9.56.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.37.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.08 13.17.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 14.34.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 12.48.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.23  9.49.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.14.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.03.39 AV   JDA7339          */        
 /*       SIST ENDRET 26/03-99 13.24.43 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.12.48 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 12.41.00 AV   JDA7339                  */        
 /*       SIST ENDRET 15/06-98 08.03.28 AV   RFA9991                  */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R001UE02  -                                                    */        
 /*    PROGRAMMERER: JAN, AUGUST 81                                   */        
 /*HENSIKT:                                                           */        
 /*    R001UE02 INNHOLDER:                                            */        
 /*      PROSEDYRER FOR BLANKING AV EN_TRANS_OMR.                     */        
 /*ENDRING:                                                           */        
 /*    PROSEDYRE FOR BLANKING AV EN_MAP OG PROSEDYRER FOR OVERFØRING  */        
 /*    AV DATA FRA SKJERMBILDE TIL EN_TRANS_OMR. ER SKILT UT OG LAGT  */        
 /*    I R001UE09.                                  070587  BRITT     */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV ENDRINGSBLANKETTER TIL   */        
 /*    DET MASKINELLE FOLKETRYGDSYSTEMET.                             */        
 /*    ARBEIDSOMRÅDE: P001UE01  (LIGGER I R001.TEST.COPYLIB)          */        
 /*BRUK:                                                              */        
 /*    %INCLUDE R001UE02;                                             */        
 /*    BLANK_EN_SØKER:    BLANKER SØKERDELEN                          */        
 /*    BLANK_EN_KAP7:     BLANKER KAPITTEL 7                          */        
 /*    BLANK_EN_KAP8:     BLANKER KAPITTEL 8                          */        
 /*    BLANK_EN_KAP10:    BLANKER KAPITTEL 10                         */        
 /*    BLANK_EN_KAP11:    BLANKER KAPITTEL 11     */      /*          */        
 /*    BLANK_EN_INNTEKT   BLANKER INNTEKTENE                          */        
 /*    BLANK_EN_MELDNR:   SETTER 0 I MELDINGSNUMMERNE                 */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    PROSEDYREN BLANKER EN_SØKERDELEN I EN_TRANS_OMR I              */        
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BLANK_EN_SØKER:                                                                
   PROC;                                                                        
      ENS.REGDATO_ÅMD    = 0;                                                   
      ENS.TERMID         = '    ';                                              
      ENS.FNR            = 0;                                                   
      ENS.FNR_GML        = 0;                                                   
      ENS.TKNR           = 0;                                                   
      ENS.SPRÅK          = ' ';                                                 
      ENS.VIRK_DATO_ÅMD  = 0;                                                   
      ENS.NAVN_NYTT      = (25)' ';                                             
      ENS.NAVN_NYTT_EK   = (25)' ';                                             
      ENS.FNR_EK         = 0;                                                   
      ENS.FNR_GML_EK     = 0;                                                   
      ENS.NAVN_EK        = (25)' ';                                             
      ENS.SKILSMISSE     = ' ';                                                 
      ENS.FLYTTET_FRA    = ' ';                                                 
      ENS.FLYTTET_SAMMEN = ' ';                                                 
      ENS.OPPHØR_SAMBO   = ' ';                                                 
      ENS.EK_INNT_OVER_2G = ' ';                                                
      ENS.RED_GP_3_2_5 = ' ';                                                   
      ENS.SIVILSTAND     = ' ';                                                 
   END BLANK_EN_SØKER;                                                          
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    PROSEDYREN BLANKER EN_KAPITTEL 7 I EN_TRANS_OMR I              */        
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BLANK_EN_KAP7:                                                                 
   PROC;                                                                        
      ENK7.FAI     = 9999999;                                                   
   END BLANK_EN_KAP7;                                                           
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    PROSEDYREN BLANKER EN_KAPITTEL 8 I EN_TRANS_OMR I              */        
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BLANK_EN_KAP8:PROC;                                                            
    ENK8.UFG             = 999;                                                 
    ENK8.REAKTIVISERING  = ' ';                                                 
    ENK8.UNNTAK_VENTETID = ' ';                                                 
    ENK8.FRYSP_5ÅR_ARB   = ' ';                                                 
    ENK8.FRYSP_TIDSB     = ' ';                                                 
    ENK8.LØNNSTILSKUDD   = ' ';                                                 
    ENK8.INNTEKT_FØR_UP  = 0;                                                   
    ENK8.INNT_DATO_ÅMD   = 0;                                                   
 END BLANK_EN_KAP8;                                                             
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    PROSEDYREN BLANKER EN_KAPITTEL 10 I EN_TRANS_OMR I             */        
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                                */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BLANK_EN_KAP10:                                                                
   PROC;                                                                        
      ENK10.FORVENTET_INNT = 9999999;                                           
      ENK10.O_TIL_PENSJON  = ' ';                                               
      ENK10.FRADRAG_2G     = ' ';                                               
      ENK10.FRAML_DATO_ÅMD = 0;                                                 
      ENK10.OPPHØR_EO      = ' ';                                               
   END BLANK_EN_KAP10;                                                          
 /* *********************************************************** */              
 /*                                                             */              
 /*    PROSEDYREN BLANKER EN_KAPITTEL 11 I EN_TRANS_OMR I       */              
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                          */              
 /*                                                             */              
 /* *********************************************************** */              
 BLANK_EN_KAP11:                                                                
   PROC;                                                                        
      ENK11.YUG   = 999;                                                        
   END BLANK_EN_KAP11;                                                          
 /* *********************************************************** */              
 /*                                                             */              
 /*    PROSEDYREN BLANKER EN_INNTEKT                            */              
 /*    KOM_OMR FOR ENDRINGSBLANKETTER.                          */              
 /*                                                             */              
 /* *********************************************************** */              
 BLANK_EN_INNTEKT: PROC;                                                        
      EN_INNTEKT.PENSJONSINNT_SØKER = 9999999;                                  
      EN_INNTEKT.PENSJONSINNT_EK    = 9999999;                                  
      EN_INNTEKT.ARBEIDSINNT_SØKER =  9999999;                                  
      EN_INNTEKT.ARBEIDSINNT_EK    =  9999999;                                  
      EN_INNTEKT.MINST_4G          =  ' ';                                      
 END BLANK_EN_INNTEKT;                                                          
                                                                                
 BLANK_EN_SPES: PROC;                                                           
      EN_SPES.STATSBORGER           = 999;                                      
      EN_SPES.BOSTED                = 999;                                      
      EN_SPES.TP_NORDISK            = 9999999;                                  
      EN_SPES.TP_NORDISK_LAND       = 999;                                      
      EN_SPES.PENSJON_EØS           = 9999999;                                  
      EN_SPES.INNT_PRØVET_EØS_PENS  = ' ';                                      
      EN_SPES.TT_EØS_ANT_ÅR         = 99 ;                                      
      EN_SPES.TT_EØS_ANT_MND        = 99 ;                                      
                                                                                
 END BLANK_EN_SPES;                                                             
 /* ***************************************************************** */        
 /*                                                                   */        
 /*    PROSEDYRE FOR Å SETTE 0  MELDINGSNUMMERNE I EN_TRANS_OMR I     */        
 /*    KOM_OMR.                                                       */        
 /*                                                                   */        
 /* ***************************************************************** */        
 BLANK_EN_MELDNR:                                                               
   PROC;                                                                        
 /*  0 I MELDINGSNUMMERNE I  SØKERDELEN                               */        
      ENS.REGDATO_ÅMDNR    = 0;                                                 
      ENS.TERMIDNR         = 0;                                                 
      ENS.FNRNR            = 0;                                                 
      ENS.TKNRNR           = 0;                                                 
      ENS.SPRÅKNR          = 0;                                                 
      ENS.VIRK_DATO_ÅMDNR  = 0;                                                 
      ENS.NAVN_NYTTNR      = 0;                                                 
      ENS.NAVN_NYTT_EKNR   = 0;                                                 
      ENS.FNR_EKNR         = 0;                                                 
      ENS.NAVN_EKNR        = 0;                                                 
      ENS.SKILSMISSENR     = 0;                                                 
      ENS.FLYTTET_FRANR    = 0;                                                 
      ENS.FLYTTET_SAMMENNR = 0;                                                 
      ENS.OPPHØR_SAMBONR   = 0;                                                 
      ENS.EK_INNT_OVER_2GNR = 0;                                                
      ENS.RED_GP_3_2_5NR = 0;                                                   
      ENS.SIVILSTANDNR     = 0;                                                 
                                                                                
 /*  0 I MELDINGSNUMMERNE I  KAPITTEL 7                               */        
                                                                                
      ENK7.FAINR           = 0;                                                 
                                                                                
 /*   0 I MELDINGSNUMMERNE I KAPITTEL 8                               */        
                                                                                
      ENK8.UFGNR            = 0;                                                
      ENK8.REAKTIVISERINGNR = 0;                                                
      ENK8.UNNTAK_VENTETIDNR  = 0;                                              
      ENK8.FRYSP_5ÅR_ARBNR  = 0;                                                
      ENK8.FRYSP_TIDSBNR    = 0;                                                
      ENK8.LØNNSTILSKUDDNR  = 0;                                                
      ENK8.INNTEKT_FØR_UPNR = 0;                                                
      ENK8.INNT_DATO_ÅMDNR  = 0;                                                
                                                                                
                                                                                
 /*   0 I MELDINGSNUMMERNE I KAPITTEL 11                  */                    
                                                                                
      ENK11.YUGNR           = 0;                                                
                                                                                
 /*   0 I MELDINGSNUMMERNE I KAPITTEL 10  */                                    
      ENK10.FORVENTET_INNTNR     = 0;                                           
      ENK10.O_TIL_PENSJONNR = 0;                                                
      ENK10.FRADRAG_2GNR    = 0;                                                
      ENK10.FRAML_DATO_ÅMDNR= 0;                                                
      ENK10.OPPHØR_EONR     = 0;                                                
                                                                                
      EN_INNTEKT.PENSJONSINNT_SØKERNR = 0;                                      
      EN_INNTEKT.PENSJONSINNT_EKNR    = 0;                                      
      EN_INNTEKT.ARBEIDSINNT_SØKERNR = 0;                                       
      EN_INNTEKT.ARBEIDSINNT_EKNR    = 0;                                       
      EN_INNTEKT.MINST_4GNR          = 0;                                       
      EN_SPES.STATSBORGERNR           = 0;                                      
      EN_SPES.BOSTEDNR                = 0;                                      
      EN_SPES.TP_NORDISKNR            = 0;                                      
      EN_SPES.TP_NORDISK_LANDNR       = 0;                                      
      EN_SPES.PENSJON_EØSNR           = 0;                                      
      EN_SPES.INNT_PRØVET_EØS_PENSNR  = 0;                                      
      EN_SPES.TT_EØS_ANT_ÅRNR         = 0 ;                                     
      EN_SPES.TT_EØS_ANT_MNDNR        = 0 ;                                     
   END BLANK_EN_MELDNR;                                                         
