 /*   SIST ENDRET PÅ PROD   2008.03.19  8.58.01 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2008.03.19  8.56.37 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2008.02.04 10.12.39 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2005.11.11 12.55.42 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.33.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.28.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.03.15 12.05.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.45.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 13.15.27 AV   JDA7339          */        
 /*       SIST ENDRET 06/01-99 09.49.50 AV   JDA7339                  */        
 /*       SIST ENDRET 06/01-99 09.49.18 AV   JDA7339                  */        
 /*       SIST ENDRET 09/06-98 09.32.03 AV   SPA7339                  */        
  /* **************************************************************** */        
  /*IDENTIFIKASJON:                                                   */        
  /*    R0015301 - HOVEDPROGRAM I PLI                                 */        
  /*    PROGRAMMERER: LUNDEBY JUNI     1982                           */        
  /*                                                                  */        
  /*HENSIKT:                                                          */        
  /*    SKRIVER NY OG ENDRET TRANS TIL DB                             */        
  /*                                                                  */        
  /*PROGRAMTILKNYTNING:                                               */        
  /*                                                                  */        
  /*                                                                  */        
  /*    R005305  -->     SKRIV AP - TRANS                             */        
  /*    R005306  -->     SKRIV UP - TRANS                             */        
  /*    R0053N6  -->     SKRIV U2 - TRANS                             */        
  /*    R0053U6  -->     SKRIV U3 - TRANS                             */        
  /*    R005307  -->     SKRIV US - TRANS                             */        
  /*    R005308  -->     SKRIV EP - TRANS                             */        
  /*    R0053N8  -->     SKRIV E3 - TRANS                             */        
  /*    R005309  -->     SKRIV EF - TRANS                             */        
  /*    R0053N9  -->     SKRIV E4 - TRANS                             */        
  /*    R005310  -->     SKRIV FB - TRANS                             */        
  /*    R005311  -->     SKRIV BP - TRANS                             */        
  /*    R0053NB  -->     SKRIV B6 - TRANS                             */        
  /*    R005312  -->     SKRIV FT - TRANS                             */        
  /*    R0053NC  -->     SKRIV F7 - TRANS                             */        
  /*    R0053UC  -->     SKRIV FO - TRANS                             */        
  /*    R005314  -->     SKRIV E1 - TRANS                             */        
  /*    R0053UE  -->     SKRIV EN - TRANS                             */        
  /*    R005316  -->     SKRIV O1 - TRANS                             */        
  /*    R005317  -->     SKRIV O2 - TRANS                             */        
  /*    R005319  -->     SKRIV AF - TRANS                             */        
  /*    R0053UJ  -->     SKRIV KF - TRANS                             */        
  /*    R005320  -->     SKRIV UF - TRANS                             */        
  /*                                                                  */        
  /*BRUK:----                                                         */        
  /*                                                                  */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
  R001530 :                                                                     
    PROC            (COMMAREA_PEKER)                                            
           OPTIONS  (MAIN);                                                     
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0012001;                          /*  TRANS_SEGM_OMR (B) */         
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019906;                     /*   TRANS_OPPL_OMR (B) */             
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019908;                      /*   KOM_OMR        (B) */            
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019910;                      /*   STYRINGS_OMR   (B) */            
                                                                                
  %PAGE;                                                                        
  DCL                                                                           
      1    TRANS_LISTE_OMR (5)  UNALIGNED  BASED (TRANS_LISTE_PEKER),           
  %INCLUDE P0019911;                          /*  TRANS_LISTE_OMR(B)  */        
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019912;                      /*   DIV_PARAM_OMR  (B) */            
                                                                                
  %PAGE;                                                                        
  /* **************************************************************** */        
  /*     INNEBYGDE PLI-FUNKSJONER  + PEKER-DEF.                       */        
  /* **************************************************************** */        
                                                                                
     DCL                                                                        
         (                                                                      
          ADDR ,                                                                
          CSTG ,                                                                
          DATE ,                                                                
          DATETIME,                                                             
          LBOUND,                                                               
          LOW ,                                                                 
          HBOUND,                                                               
          SUBSTR                                                                
         )                      BUILTIN;                                        
                                                                                
     DCL                                                                        
       PLITDLI ENTRY;                                                           
                                                                                
     DCL                                                                        
         ( COMMAREA_PEKER   , W001_HJELPE_PEKER , TRANS_SEGM_PEKER ,            
           W001_TRANS_PEKER , W001_TRANS_OPPL_PEKER                )            
                                   POINTER;                                     
                                                                                
  /* **************************************************************** */        
  /*     ARBEIDSFELTER SOM BRUKES AV UIB OG PCB  .                    */        
  /* **************************************************************** */        
                                                                                
  %INCLUDE DLIUIB;                                                              
                                                                                
     DCL                                                                        
         UIB_RC_OK                 BIT (8)       INIT( 0 );                     
                                                                                
  %INCLUDE  P0012002;                  /* UIB_PCB_PEKER_OMR (BASED)   */        
                                                                                
     DCL  1 RF1                    BASED (RF1_PCB_PEKER),                       
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */         
                                                                                
  /* **************************************************************** */        
  /*     OPPTELINGS- OG LOOP-PARAMETRE M.M                            */        
  /* **************************************************************** */        
                                                                                
     DCL 1  W001_OPPTELL_OMR,                                                   
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),            
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),            
            2   FEIL_MELDNR                 PIC '9'      INIT (0),              
            2   B                           CHAR  (1)    INIT (' ');            
                                                                                
     DCL    W001_TERMID               CHAR  ( 4 )  INIT ((4)' '),               
            W001_DATO                 PIC  '(8)9'  INIT (0),                    
            W001_REG_DATO  DEF W001_DATO    PIC   '(8)9';                       
                                                                                
                                                                                
  /* **************************************************************** */        
  /*     DLI CALL-PARAMETRE                                           */        
  /* **************************************************************** */        
                                                                                
     DCL 1  W001_DLI               UNALIGNED,                                   
            2   FUNC               CHAR     (4)   INIT('    '),                 
            2   GHU                CHAR     (4)   INIT('GHU '),                 
            2   DLET               CHAR     (4)   INIT('DLET'),                 
            2   REPL               CHAR     (4)   INIT('REPL'),                 
            2   ISRT               CHAR     (4)   INIT('ISRT'),                 
            2   S_MELDNR           PIC '9'        INIT (0),                     
            2   PARM_CT_1          FIXED BIN(31)  INIT(1),                      
            2   PARM_CT_2          FIXED BIN(31)  INIT(2),                      
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),                      
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),                      
            2   PARM_CT_5          FIXED BIN(31)  INIT(5),                      
            2   PARM_CT_6          FIXED BIN(31)  INIT(6),                      
            2   PARM_CT_7          FIXED BIN(31)  INIT(7),                      
            2   OUT2               CHAR     (20)  INIT                          
                        ('                    ');                               
                                                                                
     DCL    W001_IO                CHAR (350) INIT  (   ( 350 )  ' '  ),        
            W001_HJELPE_IO         CHAR (350) BASED (W001_HJELPE_PEKER);        
  %PAGE;                                                                        
  /* **************************************************************** */        
  /*     DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
  /* **************************************************************** */        
                                                                                
     DCL    SSA_UQUAL                            CHAR (9)  INIT((9)' ');        
                                                                                
     DCL 1  SSA1_RF0PERSN          UNALIGNED,                                   
            2    HDEL                            CHAR (17) INIT                 
                 ('RF0PERSN(FNR     '),                                         
            2    REL_OP                          CHAR (2)  INIT (' ='),         
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),          
            2    HP                              CHAR (1)  INIT (')');          
                                                                                
     DCL 1  SSA1_TRANHIST          UNALIGNED,                                   
            2    HDEL                            CHAR (17) INIT                 
                 ('TRANHIST(VTPBLKOD'),                                         
            2    REL_OP                          CHAR (2)  INIT (' ='),         
            2    VTP_KEY            FIXED        DEC  (8)  INIT ( 0 ),          
            2    GRBLKODE                        CHAR (2)  INIT ('  '),         
            2    HP                              CHAR (1)  INIT (')');          
                                                                                
                                                                                
                                                                                
  %PAGE;                                                                        
  /* **************************************************************** */        
  /*                                                                  */        
  /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
  /*       ---------------------------------------------------        */        
  /*                                                                  */        
  /*                                                                  */        
  /*        INITIERER VISSE DEFAULTVERDIER.                           */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
    IF FEIL_MELD_NR    =   0  THEN                                              
        PROGRAM_ID             =   'R0015301'       ;                           
        UIBPTR                 =    UIB_PEKER       ;                           
        W001_TRANS_PEKER       =    TRANS_PEKER     ;                           
        W001_TRANS_OPPL_PEKER  =    TRANS_OPPL_PEKER;                           
                                                                                
        ALLOCATE         TRANS_SEGM_OMR;                                        
        TRANS_SEGM_OMR                          =    '' ;                       
        W001_DATO         =   DIV_PARAM_OMR.DATO_2000;                          
        W001_TERMID       =    DIV_PARAM_OMR.TERMINAL_NR;                       
                                                                                
   /* ********************************************************** */             
                                                                                
    DO  I=1 TO ANTALL_TRANS_I_TRANS_LISTE;                                      
                                                                                
      TRANS_OPPL_PEKER    =    ADDR (TRANS_LISTE_OMR.FAST_DEL (I));             
      FEIL_MELD_NR        =    0;                                               
      SSA1_RF0PERSN.PKEY  =    TRANS_OPPL_OMR.FØDSNUMMER;                       
                                                                                
      SELECT   (TRANS_OPPL_OMR.BLANKETTYPE     );                               
                                                                                
          WHEN ( 'UA' )                                                         
            /* **************************************************** */          
            /*  BLANKETTEN ER FJERNET - SKAL IKKE SKRIVES OM ATT    */          
            /* **************************************************** */          
            DO;                                                                 
            END;                                                                
          WHEN ( 'AP' )                                                         
            /* **************************************************** */          
            /*  OVRFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB         */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P050_SKRIV_AP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'A1' )                                                         
            /* **************************************************** */          
            /*  OVRFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB         */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P050_SKRIV_A1_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
         WHEN ( 'UF' )                                                          
           /* **************************************************** */           
           /*  OVRFØRER OPPLYSNINGER TIL DB OM UNGE UFØRE FØR 1967 */           
           /*                                                      */           
           /* **************************************************** */           
           DO;                                                                  
              CALL P183_SKRIV_UF_TRANS;                                         
                                                                                
              IF   FEIL_MELD_NR              >      0       THEN                
                DO;                                                             
                   /* ******************************************** */           
                   /* FEIL VED SKRIV AV :  TRANS                   */           
                   /* ******************************************** */           
                                                                                
                   GO TO L999;                                                  
                END;                                                            
           END;                                                                 
                                                                                
                                                                                
          WHEN ( 'AF' )                                                         
            /* **************************************************** */          
            /*  OVRFØRER OPPLYSNINGER TIL DB OM AVTALEFESTET        */          
            /*  PENSJON         -    AFP                            */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P190_SKRIV_AF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
                                                                                
          WHEN ( 'KF' )                                                         
            /* **************************************************** */          
            /*  OVRFØRER OPPLYSNINGER TIL DB OM AVTALEFESTET        */          
            /*  PENSJON         -    AFP                            */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P190_SKRIV_KF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                                                                                
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
                                                                                
          WHEN ( 'UP' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P060_SKRIV_UP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'U2' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P060_SKRIV_U2_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'U3' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P060_SKRIV_U3_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'US' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P070_SKRIV_US_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EP' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P080_SKRIV_EP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'E3' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P080_SKRIV_E3_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EE' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P080_SKRIV_EE_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EF' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P090_SKRIV_EF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'E4' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P090_SKRIV_E4_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'FB' )                                                         
            /* **************************************************** */          
            /*  OVRFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB         */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P100_SKRIV_FB_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
                                                                                
          WHEN ( 'BP' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P110_SKRIV_BP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'B6' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P110_SKRIV_B6_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'FT' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P120_SKRIV_FT_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'F7' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P120_SKRIV_F7_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'FO' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P120_SKRIV_FO_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'E1' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P140_SKRIV_E1_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EN' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P140_SKRIV_EN_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'O1' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P160_SKRIV_O1_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'O2' )                                                         
            /* **************************************************** */          
            /*  SJEKKER OM BEHANDLING AV ROT-SEGM. GIKK OK          */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P170_SKRIV_O2_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          OTHERWISE                                                             
            /* **************************************************** */          
            /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */          
            /* **************************************************** */          
            DO;                                                                 
   L100:                                                                        
               FEIL_MELD_NR           =    497 ;                                
               FEIL_VED_LABEL         =   '100';                                
               GO TO L999;                                                      
            END;                                                                
                                                                                
        END;   /* *****      SELECT ( BLANKETTYPE )          ****** */          
                                                                                
    END;       /* *****      DO  I=1 TO ANTALL_TRANS_I_TRANS_LISTE  */          
                                                                                
                                                                                
    /* ************************************************************** */        
    /* RESTILLER   TRANS_PEKERENE                                     */        
    /* ************************************************************** */        
                                                                                
    TRANS_PEKER                    =  W001_TRANS_PEKER     ;                    
    TRANS_OPPL_PEKER               =  W001_TRANS_OPPL_PEKER;                    
                                                                                
                                                                                
    /* ************************************************************** */        
    /* SKRIV STATISTIKK REPORT FOR REGISTERING                        */        
    /* ************************************************************** */        
   /*  CALL UPDATE_STATISTIKK_REG ( TRANS_OPPL_OMR.BLANKETTYPE,                 
                                                FEIL_MELD_NR);    */            
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P010_SKRIV_TRANHIST :                                                       
      PROC ;                                                                    
                                                                                
                                                                                
      W001_HJELPE_PEKER                =     ADDR ( TRANHIST ) ;                
      W001_IO                          =     W001_HJELPE_IO    ;                
      SSA_UQUAL                        =    'TRANHIST '        ;                
      SSA1_TRANHIST.VTP_KEY            =     TRANHIST.VTP_KEY  ;                
      SSA1_TRANHIST.GRBLKODE           =     TRANHIST.GRBLKODE ;                
                                                                                
      CALL PLITDLI                          (W001_DLI.PARM_CT_5,                
                                             W001_DLI.ISRT,                     
                                             RF1,                               
                                             W001_IO,                           
                                             SSA1_RF0PERSN,                     
                                             SSA_UQUAL);                        
                                                                                
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  TRANHIST                */                   
           /* ******************************************** */                   
  L105:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '105';                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
      IF   RF1.STATUS_KODE             =   'II'    THEN                         
        DO;                                                                     
    /* ****************************************                 */              
    /* DENNE OPPDATE I DR BASE BLIR FJERNET AV  SATISH  P.G.A                   
       FEIL OPPDATERING I SPORBARHET DATABASE                   **              
    ** TRANSER MÅ IKKE OVERFØRE TIL REVISJON DATABASE    **                     
    ** ****************************************                 **              
                                                                                
         CALL OPPDATE_DR_TRANSER (TRANS_OPPL_OMR.FØDSNUMMER);                   
         IF FEIL_MELD_NR     > 0  THEN                                          
            GO TO RETUR;                                                        
      **             OPPTIL HER                           */                    
          /* ******************************************** */                    
          /* SAMME TRANHIST LIHGGER INNE FRA FØR          */                    
          /* DETTE FJERNES FØR DET NYE LEGGES INN         */                    
          /* ******************************************** */                    
                                                                                
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,              
                                               W001_DLI.GHU,                    
                                               RF1,                             
                                               W001_IO,                         
                                               SSA1_RF0PERSN,                   
                                               SSA1_TRANHIST);                  
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! RF1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED LES   AV :  TRANHIST                */                
              /* ******************************************** */                
  L110:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '110';                            
              DB_STATUS_KODE           =       RF1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
          /* ******************************************** */                    
          /* KALLET GHU GIKK OK . DELETER TRANHIST        */                    
          /* ******************************************** */                    
                                                                                
          W001_IO                      =       W001_HJELPE_IO;                  
          CALL PLITDLI                        (W001_DLI.PARM_CT_3,              
                                               W001_DLI.DLET,                   
                                               RF1,                             
                                               W001_IO);                        
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! RF1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED DELETE  AV :  TRANHIST              */                
              /* ******************************************** */                
  L120:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '120';                            
              DB_STATUS_KODE           =       RF1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
          /* ************************************************* */               
          /* GML. TRANHIST ER FJERNET . DET NYE LEGGES INN     */               
          /* ************************************************* */               
                                                                                
          W001_IO                      =       W001_HJELPE_IO;                  
          SSA_UQUAL                    =      'TRANHIST ';                      
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,              
                                               W001_DLI.ISRT,                   
                                               RF1,                             
                                               W001_IO,                         
                                               SSA1_RF0PERSN,                   
                                               SSA_UQUAL);                      
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! RF1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED SKRIV AV :  TRANS                   */                
              /* ******************************************** */                
  L130:                                                                         
              FEIL_MELD_NR             =    500              ;                  
              FEIL_VED_LABEL           =   '130'             ;                  
              DB_STATUS_KODE           =    RF1.STATUS_KODE  ;                  
              GO   TO  RETUR;                                                   
            END;                                                                
        END;                                                                    
      ELSE                                                                      
                                                                                
        IF  RF1.STATUS_KODE           ^=       '  '         THEN                
          DO;                                                                   
             /* ******************************************** */                 
             /* RF1.STATUS_KODE =/= 'II' OG '  '  ): DB-FEIL */                 
             /* ******************************************** */                 
  L140:                                                                         
             FEIL_MELD_NR                =    500 ;                             
             FEIL_VED_LABEL              =   '140';                             
             DB_STATUS_KODE              =    RF1.STATUS_KODE;                  
             GO   TO  RETUR;                                                    
          END;                                                                  
  RETUR:                                                                        
                                                                                
    END P010_SKRIV_TRANHIST;                                                    
                                                                                
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å SKRIVE UT UNDERLIGGENDE SEGMENTER TIL TRANHIST */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P020_SKRIV_BARN_AV_TRANHIST :                                               
      PROC;                                                                     
                                                                                
      W001_IO                          =    W001_HJELPE_IO;                     
      CALL PLITDLI                         (W001_DLI.PARM_CT_6,                 
                                            W001_DLI.ISRT,                      
                                            RF1,                                
                                            W001_IO,                            
                                            SSA1_RF0PERSN,                      
                                            SSA1_TRANHIST,                      
                                            SSA_UQUAL);                         
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                           
        !  RF1.STATUS_KODE            ^=   '  '    THEN                         
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  TRANS                   */                   
           /* ******************************************** */                   
  L150:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '150';                               
           DB_STATUS_KODE              =    RF1.STATUS_KODE;                    
        END;                                                                    
    END P020_SKRIV_BARN_AV_TRANHIST;                                            
                                                                                
                                                                                
    %INCLUDE R0015305; /* PROC. P050_SKRIV_AP_TRANS                  */         
                                                                                
    %INCLUDE R00153N5; /* PROC. P050_SKRIV_A1_TRANS                  */         
                                                                                
    %INCLUDE R0015306; /* PROC. P060_SKRIV_UP_TRANS                  */         
    %INCLUDE R00153N6; /* PROC. P060_SKRIV_U2_TRANS                  */         
    %INCLUDE R00153U6; /* PROC. P060_SKRIV_U3_TRANS                  */         
                                                                                
    %INCLUDE R0015307; /* PROC. P070_SKRIV_US_TRANS                  */         
                                                                                
    %INCLUDE R0015308; /* PROC. P080_SKRIV_EP_TRANS                  */         
    %INCLUDE R00153N8; /* PROC. P080_SKRIV_E3_TRANS                  */         
    %INCLUDE R00153U8; /* PROC. P080_SKRIV_EE_TRANS                  */         
                                                                                
    %INCLUDE R0015309; /* PROC. P090_SKRIV_EF_TRANS                  */         
    %INCLUDE R00153N9; /* PROC. P090_SKRIV_E4_TRANS                  */         
                                                                                
    %INCLUDE R0015310; /* PROC. P100_SKRIV_FB_TRANS                  */         
                                                                                
    %INCLUDE R0015311; /* PROC. P110_SKRIV_BP_TRANS                  */         
    %INCLUDE R00153NB; /* PROC. P110_SKRIV_B6_TRANS                  */         
                                                                                
    %INCLUDE R0015312; /* PROC. P120_SKRIV_FT_TRANS                  */         
    %INCLUDE R00153NC; /* PROC. P120_SKRIV_F7_TRANS                  */         
    %INCLUDE R00153UC; /* PROC. P120_SKRIV_FO_TRANS                  */         
                                                                                
    %INCLUDE R0015314; /* PROC. P140_SKRIV_E1_TRANS                  */         
    %INCLUDE R00153UE; /* PROC. P140_SKRIV_EN_TRANS                  */         
                                                                                
    %INCLUDE R0015316; /* PROC. P160_SKRIV_O1_TRANS                  */         
                                                                                
    %INCLUDE R0015317; /* PROC. P170_SKRIV_O2_TRANS                  */         
                                                                                
    %INCLUDE R0015319; /* PROC. P190_SKRIV_AF_TRANS        */                   
    %INCLUDE R00153UJ; /* PROC. P190_SKRIV_KF_TRANS       */                    
                                                                                
    %INCLUDE R0015320; /* PROC. P183_SKRIV_UF_TRANS  */                         
                                                                                
   /*INCLUDE R0012004;      PROC. STASTIKK REPORT      */                       
   /* %INCLUDE R0018034;      OPPDATE_DR_TRANSER         */                     
                                                                                
                                                                                
                                                                                
  /* INCLUDE R0019913;    PROC. FOR Å SNU DATO .     MÅMDÅ -> ÅÅMM   */         
                                                                                
                                                                                
  L999:                                                                         
                                                                                
    TRANS_PEKER                    =  W001_TRANS_PEKER     ;                    
    TRANS_OPPL_PEKER               =  W001_TRANS_OPPL_PEKER;                    
    EXEC CICS RETURN;                                                           
  END  R001530;                                                                 
