 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.41 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.41 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.47.02 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.40.23 AV   HLA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NN13  UNDERPROGRAM SOM BRUKES AV R001NO10.   */        
 /*                            KONTROLL E3-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */        
 /*  PROGRAMMET BLE LAGET : NOV 1990                                  */        
 /* ***************************************************************** */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NN13                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R001N802   BLANK E3 TRANSOMR                                   */        
 /*    R001N803   KONTR E3 SØKER                                      */        
 /*    FUNKSJONER SOM BRUKES ER INCLUDET I HOVEDPROGRAMMET.           */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR E3 OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P108_BEHANDLE_E3: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P001N801;                               /* TRANSOMR E3 */             
                                                                                
                                                                                
          CALL BLANK_E3_SØKER;                         /* R001N802 */           
          CALL BLANK_E3_MELDNR;                        /* R001N802 */           
          CALL BLANK_E3_SPES_SØKER;                    /* R001N802 */           
          CALL BLANK_E3_SPES_AVDØDE;                   /* R001N802 */           
          CALL OVERF_E3_BLANKETT;                                               
          CALL KONTROLL_E3_SØKER(FEIL_FUNNET);         /* R001N803 */           
                                                                                
          IF E3S.NORSK_BOSATT = 'N'   THEN                                      
             DO;                                                                
                FEIL_I_BOSATT = TRUE;                                           
                FEIL_FUNNET   = TRUE;                                           
             END;                                                               
                                                                                
          IF FEIL_FUNNET      THEN                                              
             CALL FINN_FEIL_E3;                                                 
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE FOR Å OVERFØRE VERDIER FRA DEN OVERFØRTE BLANKETT-   */        
 /*    RECORDEN TIL E3 TRANSOMRÅDE FOR E3-BLANKETT.                   */        
 /* ***************************************************************** */        
 OVERF_E3_BLANKETT:PROC;                                                        
                                                                                
      DCL HJELPEDATO    PIC '(8)9';                                             
                                                                                
          E3S.REGDATO_ÅMD   =  BLANKETT_RECORD.TRANS_DATO_ÅMD;                  
          E3S.TERMID        = DIV_PARAM_OMR.TERMINAL_NR;                        
          E3S.FNR           =  BLANKETT_RECORD.FNR;                             
          E3S.NAVN          =  BLANKETT_RECORD.NAVN;                            
          E3S.TKNR          =  BLANKETT_RECORD.TKNR;                            
          E3S.SPRÅK         =  E3_BLANKETT.SPRÅK;                               
          E3S.SIVILSTAND    =  E3_BLANKETT.SIVILSTAND;                          
          E3S.NORSK_BOSATT  =  E3_BLANKETT.NORSK_BOSATT;                        
                                                                                
          E3S.VILKÅR_10_5   =  E3_BLANKETT.VILKÅR_10_5NR1;                      
          E3S.OMSORG_AVD_BA =  E3_BLANKETT.OMSORG_AVD_BA;                       
                                                                                
          IF F_FELT_PIC_CHAR5 (E3_BLANKETT.FORVENTET) ^= '     ' THEN           
             E3S.FORVENTET  =  E3_BLANKETT.FORVENTET * 100;                     
                                                                                
          IF F_FELT_PIC_CHAR5 (E3_BLANKETT.FAI) ^= '     '        THEN          
             E3S.FAI        =  E3_BLANKETT.FAI * 100;                           
                                                                                
          E3S.GP_OS_KODE    =  E3_BLANKETT.GP_OS_KODE;                          
                                                                                
          IF F_FELT_PIC_CHAR8 (E3_BLANKETT.FRAMLEGGSDATO_ÅMD) ^=                
                                                            '    ' THEN         
             E3S.FRAMLEGGSDATO_ÅMD = E3_BLANKETT.FRAMLEGGSDATO_ÅMD;             
                                                                                
          E3S.FRAMLEGGSKODE =  E3_BLANKETT.FRAMLEGGSKODE;                       
          HJELPEDATO        =  E3_BLANKETT.VIRK_DATO_ÅMD / 100;                 
          E3S.VIRK_DATO_ÅMD =  HJELPEDATO * 100;                                
                                                                                
          IF F_FELT_PIC_CHAR11 (E3_BLANKETT.FNR_AVD) ^= (11)' '   THEN          
             E3S.FNR_EK     =  E3_BLANKETT.FNR_AVD;                             
                                                                                
          E3S.NAVN_EK         =  E3_BLANKETT.NAVN_AVD;                          
          E3S.NORSK_BOSATT_EK =  E3_BLANKETT.NORSK_BOSATT_EK;                   
          E3S.DØDSDATO_ÅMD_EK =  E3_BLANKETT.DØDSDATO_ÅMD_EK;                   
          E3S.VILKÅR_8_4_EK   =  E3_BLANKETT.VILKÅR_8_4_EK;                     
                                                                                
          IF F_FELT_PIC_CHAR5 (E3_BLANKETT.PI_EK) ^= '     '      THEN          
             E3S.PI_EK        =  E3_BLANKETT.PI_EK * 100;                       
                                                                                
          DO I = 1 TO 4;        /*2000*/                                        
             IF F_FELT_PIC_CHAR4 (E3_BLANKETT.VP_ÅR_EK(I)) ^=                   
                                                           '  ' THEN            
                E3S.VP_ÅR_EK(I) = E3_BLANKETT.VP_ÅR_EK(I);                      
          END;                                                                  
                                                                                
                                                                                
    END OVERF_E3_BLANKETT;                                                      
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*    PROCEDURE SOM FINNER OG TAR VARE PÅ FEIL_MELD_NR NÅR DET ER    */        
 /*    FEIL I DEN OVERFØRTE RECORDEN.                                 */        
 /* ***************************************************************** */        
 FINN_FEIL_E3:PROC;                                                             
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          IF E3S.FNRNR ^= 0 &                                                   
             E3S.FNRNR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.FNRNR;                              
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF E3S.NAVNNR ^= 0 &                                                  
             E3S.NAVNNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.NAVNNR;                             
                FEIL_IND = FEIL_IND + 1;                                        
             END;                                                               
                                                                                
          IF E3S.TKNRNR ^= 0 &                                                  
             E3S.TKNRNR ^= 999 THEN                                             
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.TKNRNR;                             
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.SIVILSTANDNR ^= 0 &                                            
             E3S.SIVILSTANDNR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.SIVILSTANDNR;                       
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.SPRÅKNR ^= 0 &                                                 
             E3S.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.SPRÅKNR;                            
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.NORSK_BOSATTNR ^= 0 &                                          
             E3S.NORSK_BOSATTNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.NORSK_BOSATTNR;                     
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.VILKÅR_10_5NR ^= 0 &                                           
             E3S.VILKÅR_10_5NR ^= 999 THEN                                      
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.VILKÅR_10_5NR;                      
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.OMSORG_AVD_BANR ^= 0 &                                         
             E3S.OMSORG_AVD_BANR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.OMSORG_AVD_BANR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.FORVENTETNR ^= 0 &                                             
             E3S.FORVENTETNR ^= 999 THEN                                        
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.FORVENTETNR;                        
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.FAINR ^= 0 &                                                   
             E3S.FAINR ^= 999 THEN                                              
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.FAINR;                              
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.GP_OS_KODENR ^= 0 &                                            
             E3S.GP_OS_KODENR ^= 999 THEN                                       
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.GP_OS_KODENR;                       
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.FRAMLEGGSDATO_ÅMDNR ^= 0 &                                     
             E3S.FRAMLEGGSDATO_ÅMDNR ^= 999 THEN                                
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.FRAMLEGGSDATO_ÅMDNR;                
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.FRAMLEGGSKODENR ^= 0 &                                         
             E3S.FRAMLEGGSKODENR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.FRAMLEGGSKODENR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.VIRK_DATO_ÅMDNR ^= 0 &                                         
             E3S.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.FNR_EKNR ^= 0 &                                                
             E3S.FNR_EKNR ^= 999 THEN                                           
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.FNR_EKNR;                           
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.NAVN_EKNR ^= 0 &                                               
             E3S.NAVN_EKNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.NAVN_EKNR;                          
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.NORSK_BOSATT_EKNR ^= 0 &                                       
             E3S.NORSK_BOSATT_EKNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.NORSK_BOSATT_EKNR;                  
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.DØDSDATO_ÅMD_EKNR ^= 0 &         /*2000*/                      
             E3S.DØDSDATO_ÅMD_EKNR ^= 999 THEN                                  
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.DØDSDATO_ÅMD_EKNR;                  
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.VILKÅR_8_4_EKNR ^= 0 &                                         
             E3S.VILKÅR_8_4_EKNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.VILKÅR_8_4_EKNR;                    
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF E3S.PI_EKNR ^= 0 &                                                 
             E3S.PI_EKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = E3S.PI_EKNR;                            
                IF FEIL_IND ^= 3 THEN                                           
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          DO I = 1 TO 4;                                                        
             IF E3S.VP_ÅR_EKNR(I) ^= 0 &                                        
                E3S.VP_ÅR_EKNR(I) ^= 999 THEN                                   
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = E3S.VP_ÅR_EKNR(I);                   
                   IF FEIL_IND ^= 3 THEN                                        
                      FEIL_IND = FEIL_IND + 1;                                  
                END;                                                            
          END;                                                                  
                                                                                
                                                                                
                                                                                
    END FINN_FEIL_E3;                                                           
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001N802;          /*     BLANK E3 TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R001N803;          /*     KONTR E3 SØKER      */                      
                                                                                
                                                                                
 END P108_BEHANDLE_E3;                                                          
                                                                                
                                                                                
