 /*       SIST ENDRET 08/05-91 13.22.42 AV   DYBVIK                   */00000000
 /******************************************************************* */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /************************                                            */00000030
 /*  PROGRAM-IDENT : R001TK12 - UNDERPROGRAM                          */00000040
 /*  PROGRAM-SPRÅK : PLI                                              */00000050
 /*  PROGRAMMERER  : TUYEN                                            */00000060
 /*  PROGRAM LAGET : NOV 90                                           */00000070
 /*                                                                   */00000080
 /******************************************************************* */00000090
 /*HENSIKT:                                                           */00000100
 /************                                                        */00000110
 /*  - OVERFØRER KONTOOPPLYSNINGER FRA SKJERMBILDET TIL               */00000120
 /*    TKK (TRANS_OMR) I KOM_OMR.                                     */00000130
 /*                                                                   */00000140
 /*  - KONTROLLERER OPPLYSNINGER.                                     */00000150
 /*                                                                   */00000160
 /******************************************************************* */00000170
 /*PROGRAMBRUK:                                                       */00000180
 /***************                                                     */00000190
 /*  - CALL OVERFØR_TK                                                */00000200
 /*  - CALL KONTROL_TK(FEIL_I_TK)                                     */00000210
 /*  FRA R001TK06.                                                    */00000220
 /*                                                                   */00000230
 /******************************************************************* */00000240
 OVERFØR_TK: PROC;                                                      00000250
                                                                        00000260
   IF POST_KONTOL > 0 THEN                                              00000270
      TKK.POST_KONTO = POST_KONTOI;                                     00000280
                                                                        00000290
   IF POST_KUNDENRL > 0 THEN                                            00000300
      TKK.POST_KUNDENR = POST_KUNDENRI;                                 00000310
                                                                        00000320
   IF PKONTO_ENDRETL > 0 THEN                                           00000330
      TKK.PKONTO_ENDRET = PKONTO_ENDRETI;                               00000340
                                                                        00000350
   IF INTERIM_KONTOL > 0 THEN                                           00000360
      TKK.INTERIM_KONTO = INTERIM_KONTOI;                               00000370
                                                                        00000380
   IF INTERIM_AVTIDL > 0 THEN                                           00000390
      TKK.INTERIM_AVTALEID = INTERIM_AVTIDI;                            00000400
                                                                        00000410
   IF INTERIM_ENDRETL > 0 THEN                                          00000420
      TKK.INTERIM_ENDRET = INTERIM_ENDRETI;                             00000430
                                                                        00000440
   IF DRIFTSKONTOL > 0 THEN                                             00000450
      TKK.DRIFTSKONTO = DRIFTSKONTOI;                                   00000460
                                                                        00000470
   IF DRIFT_AVTALEIDL > 0 THEN                                          00000480
      TKK.DRIFT_AVTALEID = DRIFT_AVTALEIDI;                             00000490
                                                                        00000500
   IF DKONTO_ENDRETL > 0 THEN                                           00000510
      TKK.DKONTO_ENDRET = DKONTO_ENDRETI;                               00000520
                                                                        00000530
 END OVERFØR_TK;                                                        00000540
                                                                        00000550
 %PAGE;                                                                 00000560
 /* ***************************************************************** */00000570
 /*                                                                   */00000580
 /*    KONTROLL AV TK-OPPLYSNINGER.                                   */00000590
 /*                                                                   */00000600
 /* ***************************************************************** */00000610
                                                                        00000620
 KONTROLL_TK: PROC(FEIL_FUNNET);                                        00000630
 %SKIP;                                                                 00000640
   DCL                                                                  00000650
      FEIL_FUNNET  BIT  ( 1);                                           00000660
                                                                        00000670
   FEIL_FUNNET        = '0'B;                                           00000680
                                                                        00000690
 /*                                                                     00000700
       IF ^F_GYLDIG_KONTO(TKK.POST_KONTO) THEN                          00000710
          DO;                                                           00000720
             FEIL_FUNNET = '1'B;                                        00000730
             TKK.POST_KONTONR = 298;                                    00000740
          END;                                                          00000750
 */                                                                     00000760
                                                                        00000770
 /*                                                                     00000780
       IF ^F_GYLDIG_KONTO(TKK.INTERIM_KONTO) THEN                       00000790
          DO;                                                           00000800
             FEIL_FUNNET = '1'B;                                        00000810
             TKK.INTERIM_KONTONR = 298;                                 00000820
          END;                                                          00000830
 */                                                                     00000840
                                                                        00000850
                                                                        00000860
 /*                                                                     00000870
       IF ^F_GYLDIG_KONTO(TKK.DRIFTSKONTO) THEN                         00000880
          DO;                                                           00000890
             FEIL_FUNNET = '1'B;                                        00000900
             TKK.DRIFTSKONTONR = 298;                                   00000910
          END;                                                          00000920
 */                                                                     00000930
                                                                        00000940
                                                                        00000950
 END KONTROLL_TK;                                                       00000960
