 /*       SIST ENDRET 04/05-98 14.12.13 AV   JDA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R00104AF  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000040
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000050
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000060
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000120
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000130
 /*    FORHÅND.                                                       */00000140
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*PROGRAMTILKNYTTING:                                                */00000180
 /* ********************                                              */00000190
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000200
 /*                                                                   */00000210
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000220
 /*    BRUK :                                                         */00000230
 /*    EXEC CICS XCTL PROGRAM ('R00104AF') COMMAREA(KOM_OMR);         */00000240
 /*    PROGRAMMET INCLUDER :                                          */00000250
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    AF       */00000260
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       AF       */00000270
 /* ***************************************************************** */00000280
 /*DATASETTOPPLYSNINGER:                                              */00000290
 /* ***********************                                           */00000300
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*FEILMELDINGER:                                                     */00000340
 /* *******************                                               */00000350
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000390
                                                                        00000400
          %INCLUDE P0019906;                                            00000410
          %INCLUDE P0019908;                                            00000420
          %INCLUDE P0019910;                                            00000430
          %INCLUDE P0019912;                                            00000440
          %INCLUDE P0019913;                                            00000450
 DCL                                                                    00000460
      (CSTG, ADDR)                   BUILTIN;                           00000470
 DCL  COMMAREA_PEKER         PTR,                                       00000480
      LOKAL_KOM_PTR          PTR;                                       00000490
                                                                        00000500
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000510
 DCL                                                                    00000520
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000530
    DFHBMUNP             CHAR(1) INIT(' '),                             00000540
    DFHBMBRY             CHAR(1) INIT('H'),                             00000550
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000560
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000570
    MELDING6O            CHAR(10),                                      00000580
    YMELDING6O           CHAR(10);                                      00000590
                                                                        00000600
          %INCLUDE S001F1  ;                                            00000610
          %INCLUDE P0011901;                                            00000620
                                                                        00000630
                                                                        00000640
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000650
                                                                        00000660
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000670
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000680
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000690
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000700
                                                                        00000710
                                                                        00000720
                                                                        00000730
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000740
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000750
                                                                        00000760
           CALL OVERFØR_AFPSØKER_MAP;                /* R0011906 */     00000770
           IF AFP.NORSK_BOSATT = 'N' THEN                               00000780
              DO;                                                       00000790
                 CALL OVERFØR_AFPSPES_MAP;           /* R0011906 */     00000800
              END;                                                      00000810
           S001191O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000820
        /* FREE TRANS_OMR,TRANS_OPPL_OMR; */                            00000830
                                                                        00000840
                                                                        00000850
      EXEC CICS RETURN;                                                 00000860
                                                                        00000870
      /*   *******END HOVED PROGRAM   ***************** */              00000880
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000890
      PROC(FIXED_DEC_5);                                                00000900
                                                                        00000910
      DCL                                                               00000920
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00000930
                                                                        00000940
   END SKRIV_FEIL;                                                      00000950
                                                                        00000960
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00000970
                                                                        00000980
           DCL                                                          00000990
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001000
                                                                        00001010
   END SKRIV_FEIL_YP;                                                   00001020
                                                                        00001030
   SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00001040
                                                                        00001050
           DCL                                                          00001060
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001070
                                                                        00001080
   END SKRIV_FEIL_SP;                                                   00001090
                                                                        00001100
   %INCLUDE R0011906;                                                   00001110
   %INCLUDE R0019912;                                                   00001120
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00001130
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00001140
   %INCLUDE  R0019990;                        /*  KONV_HÅMD_DMÅ       */00001150
                                                                        00001160
 END R001041;                                                           00001170
