 /*       SIST ENDRET 26/03-99 13.24.26 AV   JDA7339                  */00000000
 /*       SIST ENDRET 26/02-99 09.12.44 AV   JDA7339                  */00000010
 /*       SIST ENDRET 09/06-98 08.31.15 AV   SPA7339                  */00000020
 /*       SIST ENDRET 25/05-98 13.59.17 AV   HLA7339                  */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R001UC09  -                                                    */00000050
 /*    PROGRAMMERER:                                                  */00000060
 /*HENSIKT:                                                           */00000070
 /*    R001UC09 INNHOLDER:                                            */00000080
 /*      PROSEDYRER FOR OVERFØRING AV DATA FRA SKJERMBILDE TIL        */00000090
 /*           FO_TRANS_OMR.                                           */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROSEDYRENE INCLUDES I BEHANDLINGA AV FORSØRGINGSTILLEGG FOR   */00000120
 /*    EKTEFELLE OG /ELLER BARN TIL DET MASKINELLE                    */00000130
 /*    FOLKETRYGDSYSTEMET.                                            */00000140
 /*    ARBEIDSOMRÅDE: P001UC01                                        */00000150
 /*BRUK:                                                              */00000160
 /*    %INCLUDE R001UC09;                                             */00000170
 /*    OVERFØR_FO_SØKER:  OVERFØRER SØKERDELEN MAP->ARBEIDSOMRÅDE     */00000180
 /* ***************************************************************** */00000190
 /*                                                                   */00000200
 /*   PROSEDYRE FOR Å BLANKE MAPEN                                    */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 %SKIP;                                                                 00000240
   BLANK_FO_MAP:                                                        00000250
      PROC;                                                             00000260
   DCL                                                                  00000270
     LOW BUILTIN;                                                       00000280
     BT_ANTO      = LOW(2);                                             00000290
     FNR_EKO      = LOW(11);                                            00000300
     TILL_EKO     = ' ';                                                00000310
     PIO          = LOW(7 );                                            00000320
     AIO          = LOW(7 );                                            00000330
     PI_EKO       = LOW(7 );                                            00000340
     AI_EKO       = LOW(7 );                                            00000350
     MINST4GO     = LOW(7 );                                            00000360
                                                                        00000370
     DO A = 1 TO 8;                                                     00000380
       FNR_BARNO(A)   = LOW(11);                                        00000390
       RBT_E0591O(A)        = LOW(1);                                   00000400
       RBT_F0591O(A)        = LOW(1);                                   00000410
     END;                                                               00000420
                                                                        00000430
     MELDING1O    = (78)' ';                                            00000440
     MELDING2O    = (78)' ';                                            00000450
     MELDING3O    = (78)' ';                                            00000460
     MELDING4O    = (78)' ';                                            00000470
     MELDING5O    = (78)' ';                                            00000480
     MELDING6O    = (78)' ';                                            00000490
   END BLANK_FO_MAP;                                                    00000500
 %PAGE;                                /*   */                          00000510
 /* ***************************************************************** */00000520
 /*                                                                   */00000530
 /*   PROSEDYRE FOR Å OVERFØRE FELT SOM ER UTFYLT,                    */00000540
 /*   EVENTUELT ENDRA PÅ SKJERMBILDET TIL FO_TRANS_OMR I              */00000550
 /*   KOM_OMR FOR FO_SØKER.                                           */00000560
 /*           MAPSET:  S001123   MAP S001121                          */00000570
 /*                                                                   */00000580
 /* ***************************************************************** */00000590
 %SKIP;                                                                 00000600
                                                                        00000610
 OVERFØR_FO_SØKER:                                                      00000620
   PROC;                                                                00000630
      IF REGDATOL > 0 THEN                                              00000640
         FOS.REGDATO_ÅMD = KONV_ÅMD_HÅMD(REGDATOI);  /*2000*/           00000650
      IF TERMIDL  > 0 THEN                                              00000660
           FOS.TERMID  = TERMIDI;                                       00000670
      IF FNRL > 0 THEN                                                  00000680
           FOS.FNR = F_FELT_CHAR_PIC11 (FNRI);                          00000690
      IF TKNRL > 0 THEN                                                 00000700
           FOS.TKNR = F_FELT_CHAR_PIC4 (TKNRI);                         00000710
      IF TILL_EKL > 0 THEN                                              00000720
           FOS.TILL_EK = TILL_EKI;                                      00000730
      IF BT_ANTL > 0 THEN                                               00000740
           FOS.BT_ANT = F_FELT_CHAR_PIC2 (BT_ANTI);                     00000750
      IF VIRK_DATO_MÅL > 0 THEN                                         00000760
         FOS.VIRK_DATO_ÅMD = KONV_MÅ_HÅMD(VIRK_DATO_MÅI);/*2000*/       00000770
      IF FNR_EKL > 0 THEN                                               00000780
           FOS.FNR_EK = F_FELT_CHAR_PIC11 (FNR_EKI);                    00000790
      IF MINST4GL > 0 THEN                                              00000800
           FOS.MINST_4G = MINST4GI;                                     00000810
                                                                        00000820
      IF INNT_PRØVET_EØS_PENSL > 0 THEN                                 00000830
           FOS.INNT_PRØVET_EØS_PENS = INNT_PRØVET_EØS_PENSI;            00000840
                                                                        00000850
      IF TT_EØS_ANT_ÅRL > 0 THEN                                        00000860
           FOS.TT_EØS_ANT_ÅR = TT_EØS_ANT_ÅRI;                          00000870
                                                                        00000880
      IF TT_EØS_ANT_MNDL > 0 THEN                                       00000890
           FOS.TT_EØS_ANT_MND = TT_EØS_ANT_MNDI;                        00000900
                                                                        00000910
   END OVERFØR_FO_SØKER;                                                00000920
 /***  ********************************* ***/                           00000930
 /*    SISTE 2 LINJE                       */                           00000940
 /******************************************/                           00000950
 OVERFØR_FO_SØKER2:                                                     00000960
   PROC;                                                                00000970
                                                                        00000980
      IF PIL         > 0 THEN                                           00000990
           FOS.PENSJONSINNTEKT = PII;                                   00001000
      IF AIL         > 0 THEN                                           00001010
           FOS.ARBEIDSINNTEKT = AII;                                    00001020
      IF PI_EKL      > 0 THEN                                           00001030
           FOS.PENSJONSINNTEKT_EK = PI_EKI;                             00001040
      IF AI_EKL      > 0 THEN                                           00001050
           FOS.ARBEIDSINNTEKT_EK = AI_EKI;                              00001060
   END OVERFØR_FO_SØKER2;                                               00001070
