 /*       SIST ENDRET 09/06-98 08.30.20 AV   SPA7339                  */00000000
 /*       SIST ENDRET 20/05-98 11.23.16 AV   SPA7339                  */00000010
 /*       SIST ENDRET 06/03-91 11.48.08 AV   DYBVIK                   */00000020
 /* ***************************************************************** */00000030
 /*               R 0 0 1 N 6 0 4                                     */00000040
 /* ***************************************************************** */00000050
 /*IDENTIFIKASJON:                                                    */00000060
 /* **********************                                            */00000070
 /*  PROGRAM-IDENT : R001N604 - BLANKER ARBEIDS-                      */00000080
 /*                             OMRÅDE UP_BARN  - SUBPROGRAM          */00000090
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000100
 /*  PROGRAMMERER  : SATISH                                           */00000110
 /*  PROGRAMMET BLE LAGET : DEC  1990                                 */00000120
 /*  ENDRINGERSDATO :                                                 */00000130
 /*  ENDRINGEN GJELDER:                                               */00000140
 /*  ENDRINGEN BLE UTFØRT AV :                                        */00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*  ENDRINGERSDATO :          220487                                 */00000180
 /*  ENDRINGEN GJELDER:        PROSEDYREN OVERFØR_UP_BARN ER SKILT UT */00000190
 /*                            OG LAGT I R0010610                     */00000200
 /*  ENDRINGEN BLE UTFØRT AV : BRITT                                  */00000210
 /*                                                                   */00000220
 /* ***************************************************************** */00000230
 /*HENSIKT:                                                           */00000240
 /* **********                                                        */00000250
 /*  BRUKES VED REGISTRERING AV GRUNNBLANKETT_UP.                     */00000260
 /*  KONTROLLERER OPPLYSNINGER OM FORSØRGET BARN.                     */00000270
 /*  PROSEDYREN KONTROLL_UP_BARN ÅMD CALLES MED PARAMETER             */00000280
 /*  (FEIL_FUNNET). VED FEIL RETURNERES '1'B, ELLERS '0'B.            */00000290
 /*                                                                   */00000300
 /* ***************************************************************** */00000310
 /*PROGRAMTILKNYTTING:                                                */00000320
 /* ********************                                              */00000330
 /*  PROGRAMMET INCLUDES AV R0010601 - KONTROLL_GRUNNBLANKETT_UP      */00000340
 /*  ARBEIDSOMRÅDET P0010601 ER INCLUDET I HOVEDPROG.                 */00000350
 /*  EXEC CICS LINK TIL R0019906 - ER FNR ENDRET ?                    */00000360
 /*  FØLGENDE FUNKSJONER BRUKES HER, MEN ER INCLUDET I HOVEDPROG :    */00000370
 /*    R0019904 - F_GYLDIG_FNR                                        */00000380
 /*    R0019905 - F_ALDER                                             */00000390
 /*    R0019910 - F_NUMERISK                                          */00000400
 /*    R0019912 - F_FELT_PIC_CHARNN  OG F_FELT_CHAR_PICNN             */00000410
 /*                                                                   */00000420
 /*  INTERNE PROSEDYRER :                                             */00000430
 /*    KONTROLL_UP_BARN  - BLANKETTKONTROLL                           */00000440
 /*                                                                   */00000450
 /*                                                                   */00000460
 /* ***************************************************************** */00000470
 /*DATASETTOPPLYSNINGER:                                              */00000480
 /* ***********************                                           */00000490
 /*   INGEN                                                           */00000500
 /* ***************************************************************** */00000510
 /*FEILMELDINGER:                                                     */00000520
 /* *******************                                               */00000530
 /*   MELDINGER LEGGES INN I TRANSAKSJONEN - SAMTIDIG SOM             */00000540
 /*   FEIL_FUNNET SETTES = '1'B.                                      */00000550
 /*   HOVEDPROG LEGGER UT TILHØRENDE FEILMELDINGER PÅ SKJERMBILDET.   */00000560
 /*                                                                   */00000570
 /*ENDRET: 13.04.88 AV SVERRE LUNDEBY, DATA-UTVIKLING A/S             */00000580
 /* ******                                                            */00000590
 /*    INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ      */00000600
 /*    OM FNR ER ENDRET (R0019906).                                   */00000610
 /*                                                                   */00000620
 /* ***************************************************************** */00000630
 %PAGE;                                /*  */                           00000640
 /* ***************************************************************** */00000650
 /*                                                                   */00000660
 /*    KONTROLL AV UP_BARN.                                           */00000670
 /*                                                                   */00000680
 /* ***************************************************************** */00000690
 %SKIP(2);                                                              00000700
 KONTROLL_U2_BARN:                                                      00000710
   PROC (FEIL_FUNNET);                                                  00000720
 %SKIP;                                                                 00000730
   DCL                                                                  00000740
      FEIL_FUNNET BIT (1);                                              00000750
   DCL                                                                  00000760
      (FEIL19,                                                          00000770
      FEIL20,                                                           00000780
      FEIL21,                                                           00000790
      FEIL22) BIT (1);                                                  00000800
      FEIL19 = '0'B;                                                    00000810
      FEIL20 = '0'B;                                                    00000820
      FEIL21 = '0'B;                                                    00000830
      FEIL22 = '0'B;                                                    00000840
      FEIL_FUNNET = '0'B;                                               00000850
   DCL                                                                  00000860
      ANT_BARN FIXED BIN(15),                                           00000870
      TELL_BARN FIXED BIN(15),                                          00000880
      TELL FIXED BIN(15),                                               00000890
                                                                        00000900
      1 FNR_REG,                                                        00000910
        2 FNR1         FIXED DEC(11),                                   00000920
        2 FNR2         FIXED DEC(11),                                   00000930
        2 BRUKERID     CHAR     ( 4);                                   00000940
   DCL                                                                  00000950
      ALDER FIXED DEC (5);                                              00000960
      TELL_BARN = 0;                                                    00000970
                                                                        00000980
      FNR_REG.BRUKERID =          DIV_PARAM_OMR.CICS_IND;               00000990
                                                                        00001000
      DO ANT_BARN = 1 TO 12;                                            00001010
                                                                        00001020
       IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN     00001030
        DO;                                                             00001040
         IF ^F_NUMERISK(F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)))      00001050
         THEN                                                           00001060
            DO;                                                         00001070
               IF ^FEIL19 THEN                                          00001080
                  DO;                                                   00001090
                     FEIL19 = '1'B;                                     00001100
                     U2B.FNR_BARNNR(ANT_BARN) = 200;                    00001110
                  END;                                                  00001120
               ELSE                                                     00001130
                  U2B.FNR_BARNNR(ANT_BARN) = 200;                       00001140
            END;                                                        00001150
         ELSE                                                           00001160
         IF ^ F_GYLDIG_FNR(U2B.FNR_BARN(ANT_BARN)) THEN                 00001170
            DO;                                                         00001180
               IF ^FEIL20 THEN                                          00001190
                  DO;                                                   00001200
                     FEIL20 = '1'B;                                     00001210
                     U2B.FNR_BARNNR(ANT_BARN) = 20;                     00001220
                  END;                                                  00001230
               ELSE                                                     00001240
                  U2B.FNR_BARNNR(ANT_BARN) = 999;                       00001250
            END;                                                        00001260
         ELSE                                                           00001270
            DO;                                                         00001280
               FNR_REG.FNR1 = U2B.FNR_BARN(ANT_BARN);                   00001290
               EXEC CICS LINK PROGRAM('R0019906')                       00001300
               COMMAREA(FNR_REG);                                       00001310
               IF FNR_REG.FNR2 > 0 THEN                                 00001320
                  DO;                                                   00001330
                    U2B.FNR_BARNNR(ANT_BARN) = 203;                     00001340
                    U2B.FNR_BARN(ANT_BARN) = FNR_REG.FNR2;              00001350
                    U2B.FNR_GML_BARN(ANT_BARN) = FNR_REG.FNR1;          00001360
                  END;                                                  00001370
               ALDER =                                                  00001380
               F_ALDER(U2B.FNR_BARN(ANT_BARN),U2S.VIRK_DATO_ÅMD);       00001390
               IF ALDER > 1800 THEN                                     00001400
                  DO;                                                   00001410
                     IF ^FEIL21 THEN                                    00001420
                        DO;                                             00001430
                           FEIL21 = '1'B;                               00001440
                           U2B.FNR_BARNNR(ANT_BARN) = 21;               00001450
                        END;                                            00001460
                     ELSE                                               00001470
                        U2B.FNR_BARNNR(ANT_BARN) = 999;                 00001480
                  END;                                                  00001490
               ELSE                                                     00001500
                  IF ALDER < 0 THEN                                     00001510
                     DO;                                                00001520
                        IF ^FEIL22 THEN                                 00001530
                           DO;                                          00001540
                              FEIL22 = '1'B;                            00001550
                              U2B.FNR_BARNNR( ANT_BARN) = 22;           00001560
                           END;                                         00001570
                        ELSE                                            00001580
                           U2B.FNR_BARNNR( ANT_BARN) = 999;             00001590
                     END;                                               00001600
                                                                        00001610
 /*LOVENDRING MED VIRKNING FRA 1.1.91 HL : */                           00001620
                                                                        00001630
               ELSE                                                     00001640
                  IF U2S.VIRK_DATO_ÅMD  > 19901200 &                    00001650
                     ALDER < 1 THEN                                     00001660
                     DO;                                                00001670
                        IF ^FEIL22 THEN                                 00001680
                           DO;                                          00001690
                              FEIL22 = '1'B;                            00001700
                              U2B.FNR_BARNNR( ANT_BARN) = 22;           00001710
                           END;                                         00001720
                        ELSE                                            00001730
                           U2B.FNR_BARNNR( ANT_BARN) = 999;             00001740
                     END;                                               00001750
                IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) =          00001760
                F_FELT_PIC_CHAR11(U2S.FNR) THEN                         00001770
                  DO;                                                   00001780
                    FEIL_FUNNET = '1'B;                                 00001790
                    U2B.FNR_BARNNR(ANT_BARN) = 165;                     00001800
                  END;                                                  00001810
                ELSE                                                    00001820
                IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) =          00001830
                F_FELT_PIC_CHAR11(U2S.FNR_EK) THEN                      00001840
                  DO;                                                   00001850
                    FEIL_FUNNET = '1'B;                                 00001860
                    U2B.FNR_BARNNR(ANT_BARN) = 165;                     00001870
                  END;                                                  00001880
              END;                                                      00001890
            IF U2B.RBT_BARN(ANT_BARN) = 'J' THEN                        00001900
              DO;                                                       00001910
                 IF U2S.VIRK_DATO_ÅMD  < 19840700 THEN                  00001920
                    DO;                                                 00001930
                       FEIL_FUNNET = '1'B;                              00001940
                       U2S.VIRK_DATO_ÅMDNR = 276;                       00001950
                    END;                                                00001960
              END;                                                      00001970
            ELSE                                                        00001980
               IF U2B.RBT_BARN(ANT_BARN) ^= ' ' THEN                    00001990
                  DO;                                                   00002000
                     FEIL_FUNNET = '1'B;                                00002010
                     U2B.RBT_BARNNR(ANT_BARN) = 271;                    00002020
                  END;                                                  00002030
             TELL_BARN = TELL_BARN + 1;                                 00002040
            END;                                                        00002050
         ELSE                                                           00002060
            LEAVE;                                                      00002070
      END;                                                              00002080
      IF ^FEIL_FUNNET THEN                                              00002090
        IF U2S.BT_ANT ^= TELL_BARN THEN                                 00002100
           DO;                                                          00002110
              FEIL_FUNNET = '1'B;                                       00002120
              U2S.BT_ANTNR = 23;                                        00002130
           END;                                                         00002140
                                                                        00002150
      FEIL_FUNNET = FEIL_FUNNET ! FEIL21 ! FEIL22 ! FEIL19 ! FEIL20;    00002160
                                                                        00002170
  /*  HER SJEKKES OM ET FØDSELSNUMMER ER SKREVET MER ENN EN GANG    */  00002180
      IF ^FEIL_FUNNET  THEN                                             00002190
        IF U2S.BT_ANT > 0 THEN                                          00002200
           DO ANT_BARN = 1 TO 12 WHILE(U2B.FNR_BARN(ANT_BARN) > 0);     00002210
              DO TELL = ANT_BARN TO 12 WHILE(U2B.FNR_BARN(TELL) > 0);   00002220
                 IF TELL ^= ANT_BARN THEN                               00002230
                    IF U2B.FNR_BARN(TELL) = U2B.FNR_BARN(ANT_BARN) THEN 00002240
                       DO;                                              00002250
                          FEIL_FUNNET = '1'B;                           00002260
                          U2B.FNR_BARNNR(ANT_BARN) = 124;               00002270
                          U2B.FNR_BARNNR(TELL) = 999;                   00002280
                       END;                                             00002290
              END;                                                      00002300
           END;                                                         00002310
                                                                        00002320
  /*  HER GÅR EN INN I TABELLEN OG SETTER NULL I ALLE FNR ETTER DET     00002330
      FØRSTE SOM ER NULL */                                             00002340
                                                                        00002350
      DO ANT_BARN = 1 TO 12 UNTIL(F_FELT_PIC_CHAR11                     00002360
      (U2B.FNR_BARN(ANT_BARN)) = (11)'0');                              00002370
        IF F_FELT_PIC_CHAR11(U2B.FNR_BARN(ANT_BARN)) = (11)'0' THEN     00002380
           DO TELL = ANT_BARN TO 12;                                    00002390
              U2B.FNR_BARN(TELL) = 0;                                   00002400
              U2B.RBT_BARN(TELL) = ' ';                                 00002410
           END;                                                         00002420
      END;                                                              00002430
   END KONTROLL_U2_BARN;                                                00002440
