 /*       SIST ENDRET 05/05-98 11.57.40 AV   JDA7339                  */00000000
 /*       SIST ENDRET 03/03-98 11.15.01 AV   SPA7339                  */00000010
                                                                        00000020
 /* ***************************************************************** */00000030
 /*IDENTIFIKASJON:                                                    */00000040
 /*    R0013601 - HOVEDPROGRAM I PLI                                  */00000050
 /*    PROGRAMMERER: KRISTENSEN, FEB 1982                             */00000060
 /*HENSIKT:                                                           */00000070
 /*    PROGRAMMET AJOURFØRER FAM-STATUS-UTEN-DIALOG OG LINKER INN     */00000080
 /*    DE AKTUELLE PROGRAM , KONTROLLER-TRANS-MOT-STATUS OG           */00000090
 /*    FLETT-WORK-TRANS-TIL-TRANS-LISTE.                              */00000100
 /*PROGRAMTILKNYTNING:                                                */00000110
 /*    PROGRAMMET BLIR LINKET FRA R0013001.                           */00000120
 /*BRUK:                                                              */00000130
 /*    EXEC CICS LINK PROGRAM('R0013601') COMMAREA(KOM_OMR);          */00000140
 /* ***************************************************************** */00000150
                                                                        00000160
 R001361: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                          00000170
                                                                        00000180
                                                                        00000190
 %PAGE;                                                                 00000200
 %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                    00000210
                                                                        00000220
 %PAGE;                                                                 00000230
 %INCLUDE P0019910;  /* STYRINGS-OMR (BASED)      */                    00000240
                                                                        00000250
 %PAGE;                                                                 00000260
 DCL                                                                    00000270
   1 TRANS_LISTE_OMR UNAL BASED (TRANS_LISTE_PEKER),                    00000280
     3 TRANS_LISTE_LINJE (5),                                           00000290
 %INCLUDE P0019911;  /* TRANS-LISTE-OMRÅDE UNDERNIVÅ)*/                 00000300
                                                                        00000310
 %PAGE;                                                                 00000320
 DCL                                                                    00000330
      1 WORK_TRANS_LISTE UNAL BASED(WORK_TRANS_LISTE_PEKER),            00000340
 %INCLUDE P0019911;  /* TRANS-LISTE UNDERNIVÅ     */                    00000350
                                                                        00000360
 %PAGE;                                                                 00000370
 %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE (BASED)  */                    00000380
                                                                        00000390
 %PAGE;                                                                 00000400
 DCL                                                                    00000410
   TELL1               FIXED BIN(15),                                   00000420
   COMMAREA_PEKER      POINTER,                                         00000430
   CSTG                BUILTIN;                                         00000440
                                                                        00000450
                                                                        00000460
                                                                        00000470
        /* INITIERING AV WORK-TRANS-LISTE    */                         00000480
                                                                        00000490
        WORK_TRANS_LISTE.FAST_DEL                     = '';             00000500
        WORK_TRANS_LISTE.VARIABEL_DEL.DATA_OMR        = (1500)' ';      00000510
                                                                        00000520
        /*  KONTROLLERER TRANS MOT STATUS FAM FORHOLD   */              00000530
                                                                        00000540
        EXEC CICS LINK PROGRAM('R0013520') COMMAREA(KOM_OMR);           00000550
        IF FEIL_MELD_NR > 0 THEN                                        00000560
                                                                        00000570
           DO;                                                          00000580
                                                                        00000590
                                                                        00000600
              DIV_PARAM_OMR.FRA_CICS        = '0'B;                     00000610
              DIV_PARAM_OMR.HENT_FRAM_MAP   = '1'B;                     00000620
              DIV_PARAM_OMR.FRA_UTEN_DIALOG = '1'B;                     00000630
              DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                     00000640
                                                                        00000650
              /* GÅR TIL SKRIV-FEILMELDING PÅ SKJERM  */                00000660
                                                                        00000670
                                                                        00000680
                                                                        00000690
                                                                        00000700
              IF KJØRINGS_TYPE ^= 'N'       THEN                        00000710
                 EXEC CICS LINK PROGRAM('R0013301') COMMAREA(KOM_OMR);  00000720
              ELSE                                                      00000730
                 DO;                                                    00000740
                    TERMINERINGS_IND = 'S';                             00000750
                    EXEC CICS RETURN;                                   00000760
                 END;                                                   00000770
                                                                        00000780
                                                                        00000790
                                                                        00000800
           END;  /* 1 */                                                00000810
                                                                        00000820
        ELSE                                                            00000830
                                                                        00000840
           CALL P_SORTER_TRANS_LISTE_OMR (1);                           00000850
                                                                        00000860
                                                                        00000870
                                                                        00000880
   /* ************************************************************** */ 00000890
   /* ************************************************************** */ 00000900
   /* ***********                                     ************** */ 00000910
   /* *******        EKSTERNE  PROCEDURER              ************* */ 00000920
   /* ***********                                     ************** */ 00000930
   /* ************************************************************** */ 00000940
   /* ************************************************************** */ 00000950
                                                                        00000960
                                                                        00000970
 %PAGE;                                                                 00000980
 %INCLUDE R0019950;  /* P_SORTER_TRANS_LISTE_OMR  */                    00000990
                                                                        00001000
                                                                        00001010
        EXEC CICS RETURN;                                               00001020
 END R001361;                                                           00001030
