 /*   SIST ENDRET PÅ PROD   2008.05.31 11.27.18 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.52.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 13.01.32 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.11.13 13.19.27 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.13 13.16.37 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.39.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.31.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.01.18 10.36.02 AV   JDA2970          */        
 /*       SIST ENDRET 28/08-98 14.49.54 AV   SPA7339                  */        
 /*       SIST ENDRET 28/08-98 11.12.20 AV   SPA7339                  */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R0010430  - HOVEDPROGRAM                         */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : PATHAK S.                                        */        
 /*  PROGRAMMET BLE LAGET : APRIL 1988                                */        
 /*  ENDRINGSDATO:                                                    */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  PROGRAMMET SKRIVER UT OPPLYSNINGER I HENHOLD TIL LOVEN OM        */        
 /*  INNSYNSRETT.                                                     */        
 /*                                                                   */        
 /*   - SENDER SKJERM-BILDE   MED ALLE OPPLYSNINGER FOR ET FNR        */        
 /*   - NØKKEL ER FNR.                                                */        
 /*   - SKRIVER RAPPORT PÅ PRINTER - DRAMMENSVEIEN                    */        
 /*   - SKRIVER RAPPORT PÅ PRINTER - DRIFT                            */        
 /*                                                                   */        
 /*  PROGRAMMET ER DEL AV ADMINISTRASJONS-RUTINA                      */        
 /*                                                                   */        
 /*                                                                   */        
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE = RA81.        */        
 /*  DENNE TRANSKODE SETTES I R0010420                                */        
 /*  PROGRAMMET BLIR AKTIVISERT FRA BILDE S001023 I PROGRAM R0010420  */        
 /*  NÅR BRUKEREN TASTER INN 'IN'                                     */        
 /*                                                                   */        
 /*  PROGRAM SENDER BILDE S001A83 MED FAST TEKST MED VALG FUNSJONER   */        
 /*                                                                   */        
 /*  'NY'   FOR SØKER NY FNR                                          */        
 /*         FNR (11 SIFFER) ER KONTROLLET MED  R0019904 FOR GYLDIG    */        
 /*         FNR (11 SIFFER) ER KONTROLLET MED  R0019910 FOR NUMERIK   */        
 /*         FØDSELSNR-ENDRINGSREG: LESES I R0019906                   */        
 /*  HVIS ALT ER OK LESER BASE FOR ALLE OPPLYSNING FOR DETTE FNR      */        
 /*  OG SENDER BILDE MED INFORMASJONER                                */        
 /*                                                                   */        
 /*  'NS'   KAN BRUKES FOR   'NEST-SIDE'                              */        
 /*         HVIS FLERE INFORMASJONER LIGGER                           */        
 /*                                                                   */        
 /*  'FS'   FOR GO TIL FORRIGE SIDE                                   */        
 /*                                                                   */        
 /*  'DR'   FOR Å SKRIVE ALL INFORMASJON I DRAMMENSVEIEN              */        
 /*                                                                   */        
 /*  'DF'   FOR Å SKRIVE ALL INFORMASJON PÅ DRIFTEN                   */        
 /*                                                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001043: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                  
   DCL  1  COMMAREA_PEKER   POINTER;                                            
   %PAGE;                                                                       
   %INCLUDE P0019906;     /* TRANS_OPPL_OMRÅDE   */                             
                                                                                
   %PAGE;                                                                       
   %INCLUDE P0019908;     /*     KOM_OMR   */                                   
                                                                                
   %PAGE;                                                                       
   %INCLUDE P0019910;     /*  STYRING-OMRÅDE (BASED) */                         
                                                                                
   %PAGE;                                                                       
   %INCLUDE P0019912;     /* DIV-PARAM-OM  */                                   
                                                                                
   %PAGE;                                                                       
   %INCLUDE S001A8;    /*  UP-MAPSETTET   */                                    
                                                                                
   %PAGE;                                                                       
  /*  %INCLUDE DFHBMSCA;    */                                                  
                                                                                
                                                                                
 %PAGE;                                                                         
 DCL 1 B01 BASED(B01_PEKER),                                                    
 %INCLUDE P0019921;                                                             
                                                                                
     DCL KOM_OMR_PEKER          POINTER,                                        
         BMSMAPBR               POINTER,                                        
         PRI_RBA                POINTER;                                        
                                                                                
 DCL                                                                            
    VERIFY              BUILTIN,                                                
    CURSOR_POS           FIXED BIN(15) INIT(-1);                                
                                                                                
 /* ************************************************* */                        
 /*  PRINTER NAVN OG ANDRE PARAMETER                  */                        
 /*                                                   */                        
 /*                                                   */                        
 /* ************************************************* */                        
 DCL                                                                            
    1 CHARLIST2,                                                                
      2 PRINTER,                                                                
        3 TERMID           CHAR(4)  INIT ('R2AK'),                              
        3 RESERV           CHAR(12) INIT (' '),                                 
      2 SISTE,                                                                  
        3 SLUTT            FIXED BIN(15) INIT(-1),                              
        3 RESERV           CHAR(14)      INIT(' ');                             
                                                                                
                                                                                
                                                                                
 DCL 1 INT_VERIBLE,                                                             
  /*   2 IÅR                   BIN FIXED (15), */                               
       2 VÅR                   BIN FIXED (15),                                  
       2 IÅR                   PIC '9999'    ,                                  
       2 UHIST                 BIN FIXED (15),                                  
       2 IX                    BIN FIXED (15) INIT (1),                         
       2 IY                    BIN FIXED (15),                                  
       2 TIL                   BIN FIXED (15),                                  
                                                                                
       2 BLANK_P  BIN FIXED (15) INIT (1),                                      
       2 BLANK_L  BIN FIXED (15) INIT (1),                                      
       2 LIND     BIN FIXED (15) INIT (1),                                      
       2 PL       BIN FIXED (15) INIT (1),                                      
       2 PP       BIN FIXED (15) INIT (0),                                      
       2 DR       BIN FIXED (15) INIT (0),                                      
       2 PRI_L    BIN FIXED (15) INIT (0),                                      
       2 PC_11     CHAR (11),                                                   
       2 FS_SIDE  PIC '9',                                                      
       2 S_SIDE   PIC '99',                                                     
       2 NY_FNR     BIN FIXED (15) INIT (0);                                    
                                                                                
 /*   1 TKNR_REC                 BASED(TKNR_PEKER),   */                        
 DCL  1 TKNR_REC,                                                               
        2 TKNR                   PIC '(4)9',                                    
        2 NAVN                   CHAR (25),                                     
        2 ADRESSE1               CHAR (35),                                     
        2 ADRESSE2               CHAR (30),                                     
        2 SORT_KRIT              CHAR (1),                                      
        2 SPRÅKKODE              CHAR (1),                                      
        2 DATA_SENTRAL           CHAR (3),                                      
        2 EDB_SYSTEM             CHAR (1),                                      
        2 REST_YSTEM             CHAR (1);                                      
                                                                                
 DCL  KEY_BIT                    BIT(32) BASED (KEY_PEKER),                     
      KEY_PEKER                  POINTER,                                       
      TKNR_PEKER                 POINTER;                                       
                                                                                
 DCL  1 STAT_REC,                                                               
        2 STAT_NR                PIC '(3)9',                                    
        2 FILLER                 CHAR (02),                                     
        2 STAT_NAVN              CHAR (30);                                     
                                                                                
 /* ************************************************* */                        
 /*  WORKING AREA FOR STORING THE INFORMATION FOR     */                        
 /*  SCREEN AND PRINTER                               */                        
 /*  - AREAR IS ALSO IN PROGRAMMEN NO. R0010420       */                        
 /* ************************************************* */                        
  DCL 1 LOKAL_OMR BASED (TRANS_LISTE_PEKER),                                    
       2 ACC_SIDE         PIC  '99',                                            
       2 MAP_SIDE         PIC  '99',                                            
       2 NY_KODE          PIC '9',                                              
       2 W01_SUM_KODE     CHAR (1),                                             
                                                                                
       2 ACC_PAGE    (04),                                                      
         5 ACC_LINJE (20)  CHAR(80);                                            
                                                                                
 DCL    1 AXX_LINE,                                                             
          5 T_END       CHAR(3),                                                
          5 T_XX        CHAR(77),                                               
          AYY_LINE DEF AXX_LINE  CHAR(80);                                      
                                                                                
 DCL    P_LINJE            CHAR (78);                                           
 DCL    PRI_LINJE       CHAR(78);                                               
                                                                                
 DCL   1 UTLINJE          CHAR(78);                                             
 DCL   ANT_GANGER         PIC '99' ;                                            
 DCL   BLK_LINJE          CHAR(78)  INIT ('');                                  
                                                                                
 DCL   1 WMNDÅR_DEF,                                                            
         2 WDD             PIC '99',                                            
         2 WMND            PIC '99',                                            
         2 WÅR             PIC '9999';                                          
 DCL   1 WMNDÅR DEF WMNDÅR_DEF  PIC '99999999';                                 
                                                                                
 DCL   1 WÅRMND_DEF,                                                            
         2 WÅR             PIC '9999',                                          
         2 WMND            PIC '99',                                            
         2 WDD             PIC '99';                                            
 DCL   1 WÅRMND DEF WÅRMND_DEF  PIC '99999999';                                 
                                                                                
                                                                                
 DCL   1 DATO_DEF,                                                              
         2 DAG             PIC '99',                                            
         2 FILLER1         CHAR (1) INIT ('.'),                                 
         2 MND             PIC '99',                                            
         2 FILLER          CHAR (1) INIT ('.'),                                 
         2 ÅR              PIC '99';                                            
 DCL   1 DATO DEF DATO_DEF        CHAR (8);                                     
                                                                                
 DCL   1 DATO_M           PIC '(8)9';                                           
 DCL   1 DATO_M_DEF DEF  DATO_M,                                                
         2 ÅR_M            PIC '9999',                                          
         2 MND_M           PIC '99',                                            
         2 DAG_M           PIC '99';                                            
                                                                                
 DCL   1 DF_PRINT_LINE,                                                         
         5 DF_PCC            CHAR (1) INIT (' '),                               
         5 DF_FIL1           CHAR (1) INIT (' '),                               
         5 DF_CC             CHAR (1) INIT (' '),                               
         5 DF_FIL            CHAR (6) INIT ('      '),                          
         5 DF_TEKST          CHAR (72),                                         
         DF_COMD  DEF  DF_PRINT_LINE  CHAR(81);                                 
                                                                                
 DCL   1 DF_KEY,                                                                
         3 DF_FNR            PIC '(11)9',                                       
         3 DF_SIDENR         PIC '99',                                          
         3 DF_LINE           PIC '999';                                         
                                                                                
                                                                                
 /* ************************************************* */                        
 /*  LINES USED ON SCREEN                             */                        
 /*         AND PRINTER                               */                        
 /*                                                   */                        
 /* ************************************************* */                        
 DCL    1 L01_FNR_DEF ,                                                         
          5 TEKST1         CHAR(38) INIT ('FØDSELSNUMMER'),                     
          5 FILLER1        CHAR(3 ) INIT (':  '),                               
          5 W01_FNR        PIC '999999B999B99',                                 
          5 FILLER2        CHAR(26) INIT ( (26) ' '),                           
          L01_FNR    DEF    L01_FNR_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_NAVN_DEF,                                                         
          5 TEKST2        CHAR(38) INIT ('NAVN'),                               
          5 FILLER1       CHAR(3 ) INIT (':  '),                                
          5 W01_NAVN      CHAR(25),                                             
          5 FILLER2       CHAR(14) INIT ( (14) ' '),                            
          L01_NAVN    DEF    L01_NAVN_DEF  CHAR(80);                            
                                                                                
 DCL    1 L01_TKNR_DEF,                                                         
          5 TEKST3        CHAR(38) INIT ('TRYGDEKONTORNUMMER'),                 
          5 FILLER1       CHAR(3 ) INIT (':  '),                                
          5 W01_TKNR      PIC '9999',                                           
          5 FILLER2       CHAR(5) INIT ( (5) ' '),                              
          5 W01_TKNAVN    CHAR(25),                                             
          5 FILLER3       CHAR(05) INIT ( (05) ' '),                            
          L01_TKNR    DEF    L01_TKNR_DEF  CHAR(80);                            
                                                                                
 DCL    1 L01_STATSBORGER_DEF,                                                  
          5 TEKST86      CHAR(38) INIT ('STATSBORGERSKAPSKODE'),                
          5 FILLER1      CHAR(04) INIT (':   '),                                
          5 W01_STAT     PIC '(3)9',                                            
          5 FILLER2      CHAR(05) INIT ( (05) ' '),                             
          5 W01_LANDNAVN CHAR(30) INIT ( (30) ' '),                             
          L01_STATSBORGER DEF L01_STATSBORGER_DEF CHAR(80);                     
                                                                                
                                                                                
 DCL    1 L01_SPRÅK_DEF,                                                        
          5 TEKST4        CHAR(38) INIT ('SPRÅKFORM'),                          
          5 FILLER1       CHAR(3 ) INIT (':  '),                                
          5 W01_SPRÅK     CHAR(11),                                             
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_SPRÅK   DEF    L01_SPRÅK_DEF  CHAR(80);                           
                                                                                
  /* DCL    1 L01_AI_DEF ,                                                      
          5 TEKST5        CHAR(38) INIT ('ANTATT INNTEKT I 1967'),              
          5 FILLER1       CHAR(06) INIT (':     '),                             
          5 W01_AI        PIC 'ZZZZ.ZZ9',                                       
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_AI      DEF    L01_AI_DEF  CHAR(80); */                           
                                                                                
                                                                                
 /* DCL 1 L01_INNTÅR_DEF,                                                       
          5 TEKST6        CHAR(38) INIT ('INNTEKTSÅR'),                         
          5 FILLER1       CHAR(12) INIT (':           '),                       
          5 W01_INNT_ÅR   PIC '(2)9',                                           
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_INNTÅR  DEF    L01_INNTÅR_DEF  CHAR(80);  */                      
                                                                                
 DCL    1 L01_INNT_DEF,                                                         
          5 TEKST7        CHAR(28) INIT ('PENSJONSGIVENDE INNTEKT'),            
          5 TEKST7_19     CHAR(2)  INIT ('  '),                                 
          5 TEKST7_ÅR     PIC '9999',                                           
          5 FILLER        CHAR(4 ) INIT ('    '),                               
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_INNT      PIC 'ZZZZ.Z99',                                       
          5 FILLER2        CHAR(07) INIT ( (07) ' '),                           
          5 FILLER_TEKST7  CHAR(10),                                            
          5 W01_P_POENG    PIC '9V,99',                                         
          5 FILLER4        CHAR(07) INIT ( (07) ' '),                           
          L01_INNT  DEF    L01_INNT_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_VERNEPL_DEF,                                                      
          5 TEKST9        CHAR(38) INIT ('VERNEPLIKTÅR'),                       
          5 FILLER1       CHAR(12) INIT (':              '),                    
          5 W01_VERNEP    PIC 'Z9',                                             
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_VERNEPL  DEF L01_VERNEPL_DEF  CHAR(80);                           
                                                                                
 DCL    1 L01_AI63_DEF,                                                         
          5 TEKST10       CHAR(38) INIT ('ANTATT INNTEKT 1963'),                
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_AI63      PIC 'ZZZZ.ZZ9',                                       
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_AI63   DEF   L01_AI63_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_AI64_DEF,                                                         
          5 TEKST11       CHAR(38) INIT ('ANTATT INNTEKT 1964'),                
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_AI64      PIC 'ZZZZ.ZZ9',                                       
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_AI64   DEF   L01_AI64_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_AI65_DEF,                                                         
          5 TEKST12      CHAR(38) INIT ('ANTATT INNTEKT 1965'),                 
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_AI65      PIC 'ZZZZ.ZZ9',                                       
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_AI65   DEF   L01_AI65_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_AI66_DEF,                                                         
          5 TEKST13      CHAR(38) INIT ('ANTATT INNTEKT 1966'),                 
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_AI66     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_AI66   DEF   L01_AI66_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_AI67_DEF,                                                         
          5 TEKST13      CHAR(38) INIT ('ANTATT INNTEKT 1967'),                 
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_AI67     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_AI67   DEF   L01_AI67_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_PI66_DEF,                                                         
          5 TEKST14      CHAR(38) INIT ('ARBEIDSINNTEKT 1966'),                 
          5 FILLER1       CHAR(6 ) INIT (':     '),                             
          5 W01_PI66     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_PI66   DEF   L01_PI66_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_VIRK_DEF,                                                         
          5 TEKST15      CHAR(38) INIT                                          
                       ('SISTE ENDRINGSDATO, MÅNED/ÅR'),                        
          5 FILLER1      CHAR(08) INIT (':       '),                            
          5 W01_VIRK     PIC '99BB99',                                          
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_VIRK   DEF   L01_VIRK_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_SIVIL_DEF,                                                        
          5 TEKST16      CHAR(38) INIT ('SIVILSTAND'),                          
          5 FILLER1      CHAR(3 ) INIT (':  '),                                 
          5 W01_SIVIL    CHAR(18),                                              
          5 FILLER2        CHAR(21) INIT ( (21) ' '),                           
          L01_SIVIL  DEF      L01_SIVIL_DEF  CHAR(80);                          
                                                                                
 DCL    1 L01_TT_DEF  ,                                                         
          5 TEKST17      CHAR(38) INIT                                          
                       ('ANVENDT TRYGDETID (I HELE ÅR) '),                      
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_TT       PIC 'ZZZ9',                                            
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_TT  DEF      L01_TT_DEF  CHAR(80);                                
                                                                                
 DCL    1 L01_SUM_DEF ,                                                         
          5 TEKST18      CHAR(38) INIT ('SUM YTELSE (KR. PR. MD.)'),            
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_SUM      PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2        CHAR(28) INIT ( (28) ' '),                           
          L01_SUM    DEF      L01_SUM_DEF  CHAR(80);                            
                                                                                
 DCL    1 L01_BT_ANT_DEF,                                                       
          5 TEKST19      CHAR(38) INIT ('ANTALL BARNETILLEGG'),                 
          5 FILLER1      CHAR(11 ) INIT (':          '),                        
          5 W01_BT_ANT   PIC 'ZZ9',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BT_ANT DEF   L01_BT_ANT_DEF  CHAR(80);                            
                                                                                
 DCL    1 L01_DØD_DEF,                                                          
          5 TEKST20      CHAR(38) INIT ('DØDSDATO, ÅR/MÅNED/DAG'),              
          5 FILLER1      CHAR(6 ) INIT (':     '),                              
          5 W01_DØD      PIC '9999B99B99',                                      
          5 FILLER2        CHAR(26) INIT ( (26) ' '),                           
          L01_DØD    DEF   L01_DØD_DEF  CHAR(80);                               
                                                                                
 DCL    1 L01_8_4_3_DEF,                                                        
          5 TEKST21      CHAR(38) INIT ('VILKÅR PARAGRAF 8-4 NR.3 A'),          
          5 FILLER1      CHAR(13) INIT (':            '),                       
          5 W01_8_4_3    CHAR(1),                                               
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_8_4_3  DEF   L01_8_4_3_DEF  CHAR(80);                             
                                                                                
 DCL    1 L01_G_DATO_DEF,                                                       
          5 TEKST22      CHAR(38) INIT ('GRUNNBELØPSDATO, MÅNED/ÅR'),           
          5 FILLER1      CHAR(8 ) INIT (':       '),                            
          5 W01_G_DATO   PIC '99BB9999',                                        
          5 FILLER2      CHAR(26) INIT ( (26) ' '),                             
          L01_G_DATO DEF   L01_G_DATO_DEF  CHAR(80);                            
                                                                                
 DCL    1 L01_P_DATO_DEF,                                                       
          5 TEKST23      CHAR(38) INIT                                          
                                  ('POENGTILLEGGSDATO, MÅNED/ÅR'),              
          5 FILLER1      CHAR(8 ) INIT (':       '),                            
          5 W01_P_DATO   PIC '99BB9999',                                        
          5 FILLER2      CHAR(26) INIT ( (26) ' '),                             
          L01_P_DATO DEF   L01_P_DATO_DEF  CHAR(80);                            
                                                                                
 DCL    1 L01_TILKN_DEF,                                                        
          5 TEKST24      CHAR(38) INIT ('EKTEFELLES FØDSELSDATO + NR'),         
          5 FILLER1      CHAR(8 ) INIT (':       '),                            
          5 W01_TILKN    PIC '(6)9B99999',                                      
          5 FILLER2      CHAR(22) INIT ( (22) ' '),                             
          L01_TILKN  DEF   L01_TILKN_DEF  CHAR(80);                             
                                                                                
 DCL    1 L01_BARN_DEF,                                                         
          5 TEKST24      CHAR(38) INIT ('BARNS FØDSELSDATO + NR'),              
          5 FILLER1      CHAR(8 ) INIT (':       '),                            
          5 W01_BARN    PIC '(6)9B99999',                                       
          5 FILLER2      CHAR(22) INIT ( (22) ' '),                             
          L01_BARN   DEF   L01_BARN_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APGP_DEF,                                                         
          5 TEKST25      CHAR(38) INIT ('GRUNNPENSJON'),                        
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_APGP     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APGP   DEF   L01_APGP_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APST_DEF,                                                         
          5 TEKST26      CHAR(38) INIT ('SÆRTILLEGG'),                          
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_APST     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APST   DEF   L01_APST_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APBT_DEF,                                                         
          5 TEKST27      CHAR(38) INIT ('BARNETILLEGG'),                        
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_APBT     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APBT   DEF   L01_APBT_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APKT_DEF,                                                         
          5 TEKST28      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),                
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_APKT     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APKT   DEF   L01_APKT_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APET_DEF,                                                         
          5 TEKST29      CHAR(38) INIT ('EKTEFELLETILLEGG'),                    
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_APET     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APET   DEF   L01_APET_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APTP_DEF,                                                         
          5 TEKST30      CHAR(38) INIT ('TILLEGGSPENSJON'),                     
          5 FILLER1      CHAR(06) INIT (': '),                                  
          5 W01_APTP     PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APTP   DEF   L01_APTP_DEF  CHAR(80);                              
                                                                                
 DCL    1 L01_APSPT_DEF,                                                        
          5 TEKST31      CHAR(38) INIT ('SLUTTPOENGTALL'),                      
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_APSPT    PIC '9V,99',                                           
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APSPT  DEF   L01_APSPT_DEF CHAR(80);                              
                                                                                
 DCL    1 L01_APOPT_DEF,                                                        
          5 TEKST32      CHAR(38) INIT                                          
                         ('SLUTTPOENGTALL M/OVERKOMPENSASJON'),                 
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_APOPT    PIC '9V,99',                                           
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APOPT DEF  L01_APOPT_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_APPÅ_DEF,                                                         
          5 TEKST33      CHAR(38) INIT ('ANTALL POENGÅR'),                      
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_APPÅ     PIC 'ZZ9',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APPÅ DEF   L01_APPÅ_DEF CHAR(80);                                 
                                                                                
 DCL    1 L01_APAPD_DEF,                                                        
          5 TEKST34      CHAR(38) INIT ('ALDERSPENSJONSGRAD'),                  
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_APAPD    PIC 'ZZ9',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APAPD DEF  L01_APAPD_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_APFAI_DEF,                                                        
          5 TEKST35      CHAR(38) INIT ('FRAMTIDIG ARBEIDSINNTEKT'),            
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_APFAI    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APFAI DEF  L01_APFAI_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_APFAI_DATO_DEF,                                                   
          5 TEKST36      CHAR(38) INIT                                          
                         ('FRAMTIDIG ARBEIDSINNTEKT FRA DATO'),                 
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_APFAI_DATO  PIC 'ZZZ9',                                         
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APFAI_DATO DEF L01_APFAI_DATO_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_APKONV_GRAD_DEF,                                                  
          5 TEKST37      CHAR(38) INIT ('KONVERTERINGSGRAD'),                   
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_APKONV_GRAD PIC 'ZZ9',                                          
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APKONV_GRAD DEF L01_APKONV_GRAD_DEF CHAR(80);                     
                                                                                
 DCL    1 L01_APTTVENT_DEF,                                                     
          5 TEKST38      CHAR(38) INIT                                          
                         ('TRYGDETID VED 67 ÅRS DATO'),                         
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_APTTVENT PIC 'ZZ9',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APTTVENT DEF L01_APTTVENT_DEF CHAR(80);                           
                                                                                
 DCL    1 L01_APVENTEFAKTOR_DEF,                                                
          5 TEKST39      CHAR(38) INIT                                          
                         ('VENTEPROSENT/ALDERSPENSJON'),                        
          5 FILLER1      CHAR(08) INIT (':       '),                            
          5 W01_APVENTEFAKTOR PIC 'ZZZV,99',                                    
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APVENTEFAKTOR DEF L01_APVENTEFAKTOR_DEF CHAR(80);                 
                                                                                
 DCL    1 L01_APVT_SPT_DEF,                                                     
          5 TEKST40      CHAR(38) INIT                                          
                         ('VENTETIDSSLUTTPOENGTALL'),                           
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_APVT_SPT PIC '9V,99',                                           
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APVT_SPT DEF L01_APVT_SPT_DEF CHAR(80);                           
                                                                                
 DCL    1 L01_APVT_OPT_DEF,                                                     
          5 TEKST41      CHAR(38) INIT                                          
                         ('VENTETIDSSLUTTPOENGTALL M/OVERKOMP.'),               
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_APVT_OPT PIC '9V,99',                                           
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APVT_OPT DEF L01_APVT_OPT_DEF CHAR(80);                           
                                                                                
 DCL    1 L01_APVT_PÅ_DEF,                                                      
          5 TEKST42      CHAR(38) INIT ('VENTETIDSPOENGÅR'),                    
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_APVT_PÅ  PIC 'ZZ9',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APVT_PÅ DEF L01_APVT_PÅ_DEF CHAR(80);                             
                                                                                
 DCL    1 L01_APGP_P67_DEF,                                                     
          5 TEKST43      CHAR(38) INIT                                          
                         ('GRUNNPENSJON VED 67 ÅRS DATO'),                      
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_AP_GP_P67   PIC 'ZZZZ.ZZ9',                                     
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APGP_P67 DEF L01_APGP_P67_DEF CHAR(80);                           
                                                                                
 DCL    1 L01_APTP_P67_DEF,                                                     
          5 TEKST44      CHAR(38) INIT                                          
                         ('TILLEGGSPENSJON VED 67 ÅRS DATO'),                   
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_AP_TP_P67  PIC 'ZZZZ.ZZ9',                                      
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APTP_P67 DEF L01_APTP_P67_DEF CHAR(80);                           
                                                                                
 DCL    1 L01_APVT_GP_DEF,                                                      
          5 TEKST45      CHAR(38) INIT                                          
                         ('VENTETILLEGG TIL GRUNNPENSJONEN'),                   
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_AP_VT_GP  PIC 'ZZZZ.ZZ9',                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APVT_GP DEF L01_APVT_GP_DEF CHAR(80);                             
                                                                                
 DCL    1 L01_APVT_TP_DEF,                                                      
          5 TEKST46      CHAR(38) INIT                                          
                         ('VENTETILLEGG TIL TILLEGGSPENSJON'),                  
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_AP_VT_TP  PIC 'ZZZZ.ZZ9',                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_APVT_TP DEF L01_APVT_TP_DEF CHAR(80);                             
                                                                                
 DCL    1 L01_UP_UFG_DEF,                                                       
          5 TEKST47      CHAR(38) INIT ('UFØREGRAD'),                           
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_UP_UFG   PIC 'Z99',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_UFG DEF L01_UP_UFG_DEF CHAR(80);                               
                                                                                
 DCL    1 L01_UP_8_4_3A_DEF,                                                    
          5 TEKST48      CHAR(38) INIT                                          
                        ('VILKÅR PARAGRAF 8-4 NR. 3 A OPPFYLT'),                
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_UP_8_4_3A  CHAR (4),                                            
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_8_4_3A DEF L01_UP_8_4_3A_DEF CHAR(80);                         
                                                                                
 DCL    1 L01_UP_GP_DEF,                                                        
          5 TEKST49      CHAR(38) INIT ('GRUNNPENSJON'),                        
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_GP    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_GP DEF  L01_UP_GP_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UP_ST_DEF,                                                        
          5 TEKST50      CHAR(38) INIT ('SÆRTILLEGG'),                          
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_ST    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_ST DEF  L01_UP_ST_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UP_ÅFT_DEF,                                                       
          5 TEKST51      CHAR(38) INIT                                          
                                ('TILLEGG ETTER PARAGRAF 8-5 NR 1'),            
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_ÅFT   PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_ÅFT DEF L01_UP_ÅFT_DEF CHAR(80);                               
                                                                                
 DCL    1 L01_UP_ET_DEF,                                                        
          5 TEKST52      CHAR(38) INIT ('EKTEFELLETILLEGG'),                    
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_ET    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_ET DEF  L01_UP_ET_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UP_BT_DEF,                                                        
          5 TEKST53      CHAR(38) INIT ('BARNETILLEGG'),                        
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_BT    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_BT DEF  L01_UP_BT_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UP_KT_DEF,                                                        
          5 TEKST54      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),                
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_KT    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_KT DEF  L01_UP_KT_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UP_TP_DEF,                                                        
          5 TEKST55      CHAR(38) INIT ('TILLEGGSPENSJON'),                     
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_UP_TP    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_TP DEF  L01_UP_TP_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UP_SPT_DEF,                                                       
          5 TEKST56      CHAR(38) INIT ('SLUTTPOENGTALL'),                      
          5 FILLER1      CHAR(09) INIT (':        '),                           
          5 W01_UP_SPT   PIC 'Z9V,99',                                          
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_SPT DEF L01_UP_SPT_DEF CHAR(80);                               
                                                                                
 DCL    1 L01_UP_OPT_DEF,                                                       
          5 TEKST57      CHAR(38) INIT                                          
                                ('SLUTTPOENGTALL M/OVERKOMP'),                  
          5 FILLER1      CHAR(09) INIT (':  '),                                 
          5 W01_UP_OPT   PIC 'Z9V,99',                                          
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_OPT DEF L01_UP_OPT_DEF CHAR(80);                               
                                                                                
 DCL    1 L01_UP_PÅ_DEF,                                                        
          5 TEKST58      CHAR(38) INIT ('ANTALL POENGÅR'),                      
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_UP_PÅ    PIC 'ZZ9',                                             
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UP_PÅ DEF  L01_UP_PÅ_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_UFØRHIST_UFT_ÅM_DEF,                                              
          5 TEKST59      CHAR(38) INIT ('UFØRETIDSPUNKT, MÅNED/ÅR'),            
          5 FILLER1      CHAR(08) INIT (':       '),                            
          5 W01_UFØRHIST_UFT_ÅMD  PIC '99BB99',                                 
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UFØRHIST_UFT_ÅMD DEF L01_UFØRHIST_UFT_ÅM_DEF CHAR(80);            
                                                                                
 DCL    1 L01_UFØRHIST_UFG_DEF,                                                 
          5 TEKST60      CHAR(38) INIT ('UFØREGRAD'),                           
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_UFØRHIST_UFG  PIC '(3)9',                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UFØRHIST_UFG DEF L01_UFØRHIST_UFG_DEF CHAR(80);                   
                                                                                
 DCL    1 L01_UFØRHIST_UFKRTERIER_DEF,                                          
          5 TEKST60   CHAR(38)                                                  
                    INIT ('FYLLER KRITERIER FOR TILLEGGSPENSJON'),              
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_UFØRHIST_UFKRITE CHAR(3),                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
      L01_UFØRHIST_UFKRTERIER DEF L01_UFØRHIST_UFKRTERIER_DEF CHAR(80);         
                                                                                
 DCL    1 L01_UFØRHIST_BUP_DEF,                                                 
          5 TEKST61      CHAR(38) INIT ('FRAMTIDIG PENSJONSPOENG'),             
          5 FILLER1      CHAR(09) INIT (':        '),                           
          5 W01_UFØRHIST_BUP  PIC 'Z9V,99',                                     
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UFØRHIST_BUP DEF L01_UFØRHIST_BUP_DEF CHAR(80);                   
                                                                                
 DCL    1 L01_UFØRHIST_OPPH_ÅM_DEF,                                             
          5 TEKST62      CHAR(38) INIT                                          
              ('OPPHØRSDATO/UFØREPENSJON, MÅNED/ÅR'),                           
          5 FILLER1      CHAR(08) INIT (':       '),                            
          5 W01_UFØRHIST_OPPH_ÅMD PIC '99BB99',                                 
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_UFØRHIST_OPPH_ÅMD DEF L01_UFØRHIST_OPPH_ÅM_DEF CHAR(80);          
                                                                                
 DCL    1 L01_ET_GP_BRUTTO_DEF,                                                 
          5 TEKST65      CHAR(38) INIT ('BRUTTO GRUNNPENSJON'),                 
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_ET_GP_BRUTTO     PIC 'ZZZZ.ZZ9',                                
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_GP_BRUTTO DEF L01_ET_GP_BRUTTO_DEF CHAR(80);                   
                                                                                
 DCL    1 L01_ET_GP_NETTO_DEF,                                                  
          5 TEKST66      CHAR(38) INIT ('NETTO GRUNNPENSJON'),                  
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_ET_GP_NETTO   PIC 'ZZZZ.ZZ9',                                   
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_GP_NETTO DEF L01_ET_GP_NETTO_DEF CHAR(80);                     
                                                                                
 DCL    1 L01_ET_ST_DEF,                                                        
          5 TEKST67      CHAR(38) INIT ('SÆRTILLEGG'),                          
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_ET_ST    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_ST DEF  L01_ET_ST_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_ET_KT_DEF,                                                        
          5 TEKST68      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),                
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_ET_KT    PIC '(3)9',                                            
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_KT DEF  L01_ET_KT_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_ET_TP_BRUTTO_DEF,                                                 
          5 TEKST69      CHAR(38) INIT ('BRUTTO TILLEGGSPENSJON'),              
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_ET_TP_BRUTTO    PIC 'ZZZZ.ZZ9',                                 
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_TP_BRUTTO DEF L01_ET_TP_BRUTTO_DEF CHAR(80);                   
                                                                                
 DCL    1 L01_ET_TP_NETTO_DEF,                                                  
          5 TEKST70      CHAR(38) INIT ('NETTO TILLEGGSPENSJON'),               
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_ET_TP_NETTO    PIC 'ZZZZ.ZZ9',                                  
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_TP_NETTO DEF L01_ET_TP_NETTO_DEF CHAR(80);                     
                                                                                
 DCL    1 L01_ET_SPT_AVD_DEF,                                                   
          5 TEKST71      CHAR(38) INIT ('AVDØDES SLUTTPOENGTALL'),              
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_ET_SPT_AVD    PIC '9V,99',                                      
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_SPT_AVD DEF L01_ET_SPT_AVD_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_ET_OPT_AVD_DEF,                                                   
          5 TEKST72      CHAR(38) INIT                                          
                         ('AVDØDES SLUTTPOENGTALL M/OVERKOMP.'),                
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_ET_OPT_AVD    PIC '9V,99',                                      
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_OPT_AVD DEF L01_ET_OPT_AVD_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_ET_PÅ_AVD_DEF,                                                    
          5 TEKST73      CHAR(38) INIT ('AVDØDES ANTALL POENGÅR'),              
          5 FILLER1      CHAR(10) INIT (':          '),                         
          5 W01_PÅ_AVD   PIC '9V,99',                                           
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_PÅ_AVD DEF L01_ET_PÅ_AVD_DEF CHAR(80);                         
                                                                                
 DCL    1 L01_ET_TP_PROSENT_DEF,                                                
          5 TEKST74      CHAR(38) INIT                                          
                        ('TILLEGGSPENSJONSPROSENT FOR FRASKILT'),               
          5 FILLER1      CHAR(10) INIT (':          '),                         
          5 W01_TP_PROSENT   PIC '9V,99',                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_TP_PROSENT DEF L01_ET_TP_PROSENT_DEF CHAR(80);                 
                                                                                
 DCL    1 L01_ET_FORVENTET_DEF,                                                 
          5 TEKST75      CHAR(38) INIT ('FORVENTET ERVERVSINNTEKT'),            
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_FORVENTET   PIC 'ZZZZ.ZZ9',                                     
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_ET_FORVENTET DEF L01_ET_FORVENTET_DEF CHAR(80);                   
                                                                                
 DCL    1 L01_ET_FRAMLEGGSDATO_DEF,                                             
          5 TEKST75      CHAR(38) INIT ('FRAMLEGG                '),            
          5 FILLER1      CHAR(3 ) INIT (':  '),                                 
          5 W01_FRAMLEGGSDATO    CHAR (20),                                     
          5 FILLER2      CHAR(19) INIT ( (19) ' '),                             
        L01_ET_FRAMLEGGSDATO DEF L01_ET_FRAMLEGGSDATO_DEF CHAR(80);             
                                                                                
 DCL    1 L01_ET_FRAMLEGG_DEF,                                                  
          5 TEKST75      CHAR(38) INIT ('FRAMLEGG                '),            
          5 FILLER1      CHAR(3 ) INIT (':  '),                                 
          5 W01_FRAMLEGGSKODE    CHAR (20),                                     
          5 FILLER2      CHAR(19) INIT ( (19) ' '),                             
          L01_ET_FRAMLEGG  DEF L01_ET_FRAMLEGG_DEF CHAR(80);                    
                                                                                
 DCL    1 L01_BP_PENSJON_DEF,                                                   
          5 TEKST75      CHAR(38) INIT ('PENSJONEN ER AVLEDET ETTER'),          
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_PENSJON  CHAR (3),                                              
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_PENSJON  DEF L01_BP_PENSJON_DEF CHAR(80);                      
                                                                                
 DCL    1 L01_BP_GP_DEF,                                                        
          5 TEKST76      CHAR(38) INIT ('GRUNNPENSJON '),                       
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_BP_GP    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_GP DEF  L01_BP_GP_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_BP_TP_DEF,                                                        
          5 TEKST77      CHAR(38) INIT ('TILLEGGSPENSJON'),                     
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_BP_TP    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_TP DEF  L01_BP_TP_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_BP_ST_DEF,                                                        
          5 TEKST78      CHAR(38) INIT ('SÆRTILLEGG'),                          
          5 FILLER1      CHAR(06) INIT (':     '),                              
          5 W01_BP_ST    PIC 'ZZZZ.ZZ9',                                        
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_ST DEF  L01_BP_ST_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_BP_KT_DEF,                                                        
          5 TEKST79      CHAR(38) INIT ('KOMPENSASJONSTILLEGG'),                
          5 FILLER1      CHAR(11) INIT (':          '),                         
          5 W01_BP_KT    PIC '(3)9',                                            
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_KT DEF  L01_BP_KT_DEF CHAR(80);                                
                                                                                
 DCL    1 L01_BP_SPT_MOR_DEF,                                                   
          5 TEKST80      CHAR(38) INIT ('MORS SLUTTPOENGTALL'),                 
          5 FILLER1      CHAR(10) INIT (':        '),                           
          5 W01_BP_SPT_MOR   PIC '9V,99',                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_SPT_MOR DEF L01_BP_SPT_MOR_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_BP_OPT_MOR_DEF,                                                   
          5 TEKST81      CHAR(38) INIT                                          
                         ('MORS SLUTTPOENGTALL M/OVERKOMP.'),                   
          5 FILLER1      CHAR(10) INIT (':        '),                           
          5 W01_BP_OPT_MOR    PIC '9V,99',                                      
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_OPT_MOR DEF L01_BP_OPT_MOR_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_BP_PÅ_MOR_DEF,                                                    
          5 TEKST82      CHAR(38) INIT ('MORS ANTALL POENGÅR'),                 
          5 FILLER1      CHAR(12) INIT (':           '),                        
          5 W01_BP_PÅ_MOR   PIC '(2)9',                                         
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_PÅ_MOR DEF L01_BP_PÅ_MOR_DEF CHAR(80);                         
                                                                                
 DCL    1 L01_BP_SPT_FAR_DEF,                                                   
          5 TEKST83      CHAR(38) INIT ('FARS SLUTTPOENGTALL'),                 
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_BP_SPT_FAR    PIC '9V,99',                                      
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_SPT_FAR DEF L01_BP_SPT_FAR_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_BP_OPT_FAR_DEF,                                                   
          5 TEKST84      CHAR(38) INIT                                          
                         ('FARS SLUTTPOENGTALL M/OVERKOMP.'),                   
          5 FILLER1      CHAR(10) INIT (':         '),                          
          5 W01_BP_OPT_FAR   PIC '9V,99',                                       
          5 FILLER2      CHAR(28) INIT ( (28) ' '),                             
          L01_BP_OPT_FAR DEF L01_BP_OPT_FAR_DEF CHAR(80);                       
                                                                                
 DCL    1 L01_BP_PÅ_FAR_DEF,                                                    
          5 TEKST85      CHAR(38) INIT ('FARS ANTALL POENGÅR'),                 
          5 FILLER1      CHAR(12) INIT (':          '),                         
          5 W01_BP_PÅ_FAR   PIC '(2)9',                                         
          5 FILLER2      CHAR(37) INIT ( (37) ' '),                             
          L01_BP_PÅ_FAR DEF L01_BP_PÅ_FAR_DEF CHAR(80);                         
                                                                                
 /*   SISTE LINE SKRIVET IN LOKAL OMRÅDE FOR VISE AT DENNE  */                  
 /*   ER EOF INFORMASJONS                                   */                  
 DCL    1 L01_END_DEF,                                                          
          5 T_END_X      CHAR(38) INIT ('********************'),                
          5 FILLER1      CHAR(3 ) INIT ('***'),                                 
          5 W01_END      CHAR(3)  INIT ('***'),                                 
          5 FILLER2      CHAR(36) INIT ( (36) ' '),                             
          L01_END DEF L01_END_DEF CHAR(80);                                     
                                                                                
 DCL    1 BOND_TX,                                                              
          05 FA1          CHAR (9)  INIT ('         '),                         
          05 BOND_TX1     CHAR (60) INIT                                        
    ('REGISTERET KAN INNEHOLDE HELSEOPPLYSNINGER SOM ER REGISTRERT'),           
          05 FB1          CHAR (9)  INIT ('         '),                         
          05 FA2          CHAR (9)  INIT ('         '),                         
          05 BOND_TX2     CHAR (60) INIT                                        
    ('MED TALLKODE.  SLIKE KODER ER  REGISTRERT UT FRA  EVENTUELLE'),           
          05 FB2          CHAR (9)  INIT ('         '),                         
          05 FA3          CHAR (9)  INIT ('         '),                         
          05 BOND_TX3     CHAR (60) INIT                                        
    ('DIAGNOSER SOM ER I TRYGDESAKEN DERES.  KRAV OM Å FÅ SE DISSE'),           
          05 FB3          CHAR (9)  INIT ('         '),                         
          05 FA4          CHAR (9)  INIT ('         '),                         
          05 BOND_TX4     CHAR (60) INIT                                        
    ('OPPLYSNINGENE KAN DE SETTE FRAM FOR TRYGDEKONTORET,  SOM VIL'),           
          05 FB4          CHAR (9)  INIT ('         '),                         
          05 FA5          CHAR (9)  INIT ('         '),                         
          05 BOND_TX5     CHAR (60) INIT                                        
    ('VURDERE  DEN  RETTEN  DE  HAR TIL Å  SE  OPPLYSNINGENE ETTER'),           
          05 FB5          CHAR (9)  INIT ('         '),                         
          05 FA6          CHAR (9)  INIT ('         '),                         
          05 BOND_TX6     CHAR (60) INIT                                        
    ('BESTEMMELSENE I FOLKETRYGDLOVENS PARAGRAF 14-10.            '),           
          05 FB6          CHAR (9)  INIT ('         '),                         
                                                                                
     BOND_TESKT (6) DEF BOND_TX  CHAR (78);                                     
                                                                                
                                                                                
 DCL    LINJETELLER      BIN FIXED (15) INIT (0);                               
 DCL    TT               BIN FIXED (15) INIT (0);                               
 DCL    W01_SUM_W        PIC  '(7)9';                                           
                                                                                
                                                                                
                                                                                
  DCL  1 MAP_STRUC,                                                             
       2 MAP_MELDING_NR         CHAR   (5),                                     
       2 MAP_MELDING            CHAR      (78);                                 
                                                                                
  DCL  1  FEIL_STRUC,                                                           
          2  FEIL_NR            FIXED DEC ( 5),                                 
          2  FEIL_MELDING       CHAR      (78);                                 
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   INNEBYGDE PLI-FUNKSJONER                                     */        
    /* ************************************************************** */        
                                                                                
       DCL                                                                      
      (DATE, ADDR , CSTG , LOW , STG , SUBSTR , ONCODE )  BUILTIN;              
                                                                                
                                                                                
       DCL                                                                      
         ( W01_HJELPE_PEKER , TRANS_SEGM_PEKER )                                
                                               POINTER;                         
                                                                                
       DCL 1 FNR_REG,                                                           
             2 FNR1              FIXED DEC(11),                                 
             2 FNR2              FIXED DEC(11),                                 
             2 BRUKERID          CHAR     (4);                                  
                                                                                
                                                                                
    /* ************************************************************** */        
    /*   OPPTELLINGS- OG  LOOP-PARAMETER                              */        
    /* ************************************************************** */        
                                                                                
       DCL 1  W01                       UNALIGNED,                              
              2   AKSJONSKODE                 CHAR (2)   INIT ('  '),           
              2   FEILMELDING_SATT            BIT  (1)   INIT ('0'B),           
              2   MER_DATA                    BIT  (1)   INIT ('1'B),           
              2   STYRINGSKODE_IKKE_SATT      BIT  (1)   INIT ('0'B),           
              2   PERSON_IKKE_FUNNET          BIT  (1)   INIT ('1'B),           
              2   AKSJON_IKKE_SATT            BIT  (1)   INIT ('1'B),           
              2   PAKKET_FNR           FIXED  DEC  (11)  INIT ( 0  ),           
              2   PAKKET_AAR           FIXED  DEC  ( 3)  INIT ( 0  ),           
              2   I                    FIXED  BIN  (15)  INIT ( 1  ),           
              2   J              FIXED  BIN  (15)  INIT ( 1  );                 
                                                                                
                                                                                
                                                                                
                                                                                
    DCL                                                                         
        FEIL_DB               BIT       ( 1)    INIT ('0'B   ),                 
        UPTRANS_OPPDATERT     BIT       ( 1)    INIT ('0'B   ),                 
        W01_GHU               CHAR      ( 4)    INIT ('GHU ' ),                 
        W01_GHNP              CHAR      ( 4)    INIT ('GHNP' ),                 
        W01_REPL              CHAR      ( 4)    INIT ('REPL' ),                 
        W01_ISRT              CHAR      ( 4)    INIT ('ISRT' ),                 
        W01_OPEN              CHAR      ( 5)    INIT ('OPEN '),                 
        W01_CLOSE             CHAR      ( 5)    INIT ('CLOSE'),                 
        MELDING_DB            CHAR      (78)    INIT (''     ),                 
        LENGDE_INN_OMR        FIXED BIN (15)    INIT ( 16    );                 
                                                                                
                                                                                
    DCL EN      FIXED BIN (31) INIT (1),                                        
        TO      FIXED BIN (31) INIT (2),                                        
        TRE     FIXED BIN (31) INIT (3),                                        
        FIRE    FIXED BIN (31) INIT (4),                                        
        FEM     FIXED BIN (31) INIT (5),                                        
        SEKS    FIXED BIN (31) INIT (6);                                        
                                                                                
                                                                                
  /* ********************************************************** */              
  /* DLI - FUNKSJONER :  PSB OG DLIUIB                          */              
  /* ********************************************************** */              
                                                                                
   %INCLUDE  P0012002;                                                          
                                                                                
   DCL 1 RF1 BASED               (RF1_PCB_PEKER),                               
   %INCLUDE  P0012003;                                                          
                                                                                
                                                                                
 %INCLUDE P0019924;         /* G_V_TAB            */                            
 %PAGE;                                                                         
 %INCLUDE P0019925;         /* G_TAB              */                            
 %PAGE;                                                                         
                                                                                
    DCL  W_AKSJON     CHAR (2) INIT ('  ');                                     
    DCL                                                                         
    FIXED_DEC5_4           FIXED DEC(5,4),                                      
    FIXED_DEC9             FIXED DEC(9),                                        
    FIXED_DEC3             FIXED DEC(3),                                        
    FIXED_BIN15            FIXED BIN(15),                                       
    INDEX_1                FIXED BIN(15),                                       
    INDEX_2                FIXED BIN(15),                                       
    MAX_UFGO               PIC '999';                                           
  DCL  GRUNN_OMR1      CHAR (1440);                                             
  DCL  GRUNN_OMR2      CHAR (1440);                                             
  DCL  GRUNN_IDENT     CHAR (8);                                                
                                                                                
                                                                                
 /* ************************************************* */                        
 /*  LINES USED ON SCREEN                             */                        
 /*         AND PRINTER                               */                        
 /*                                                   */                        
 /* ************************************************* */                        
  /* ************************************************************** */          
  /*                                                                */          
  /*      SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */          
  /*     ---------------------------------------------------        */          
  /*                                                                */          
  /*                                                                */          
  /*                                                                */          
  /* ************************************************************** */          
                                                                                
    EXEC CICS HANDLE AID  PF7(PF7)  PF8(PF8) PF3(PF3) ENTER(ENTER);             
          ALLOCATE B01;                                                         
          ALLOCATE PCB_UIB_PEKER_OMR;                                           
          ALLOCATE GV_TAB_RE;                                                   
          ALLOCATE G_TAB_RE;                                                    
                                                                                
          KOM_OMR.B01_PEKER        =  ADDR(B01);                                
          KOM_OMR.TRANS_LISTE_PEKER =  ADDR(KOM_OMR.TRANS_LISTE_OMR);           
          KOM_OMR.TRANS_OPPL_PEKER =  ADDR(KOM_OMR.TRANS_OPPL_OMR);             
          KOM_OMR.STYRINGS_PEKER   =  ADDR(KOM_OMR.STYRINGS_OMR);               
          KOM_OMR.DIV_PARAM_PEKER  =  ADDR(KOM_OMR.DIV_PARAM_OMR);              
          KOM_OMR.PCB_UIB_PEKER    =  ADDR(PCB_UIB_PEKER_OMR);                  
          KOM_OMR.GV_PEKER  = ADDR (GRUNN_OMR1             ) ;                  
          KOM_OMR.G_PEKER   = ADDR (GRUNN_OMR2             );                   
          B01       = '';                                                       
                                                                                
                                                                                
          GV_TAB_RE =  ''  ;                                                    
          G_TAB_RE  =  ''  ;                                                    
                                                                                
          GRUNN_IDENT   = 'P0019924';                                           
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                        
                                                                                
          GRUNN_IDENT   = 'P0019925';                                           
          CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                        
                                                                                
                                                                                
   /*  -------- HOVED ----------------------- */                                
   STYRINGS_OMR.FUNKSJONSKODE = 'F';                                            
    IF PROGRAM_ID = 'R0010420' THEN                                             
       DO;                                                                      
          ALLOCATE S001A81O  ;                                                  
          ALLOCATE S001A81I  ;                                                  
          EXEC CICS LOAD PROGRAM ('S001A83')      ;                             
                                                                                
          S001A81I.SFNRL   =  CURSOR_POS;                                       
          S001A81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                      
                                                                                
          EXEC CICS SEND MAP('S001A81') MAPSET('S001A83')  ERASE                
                                    ERASE   CURSOR;                             
                               /*   MAPONLY CURSOR;   */                        
          ACC_SIDE = 1;                                                         
          MAP_SIDE = 1;                                                         
          PRI_L = '1'B;                                                         
          PP    = '1'B;                                                         
          NY_KODE = 0;                                                          
       END;                                                                     
                                                                                
                                                                                
          IF  PROGRAM_ID = 'R0010430' THEN   /* DETTE PROGRAM  */               
                                                                                
         DO;                                                                    
            EXEC CICS RECEIVE MAP('S001A81') MAPSET('S001A83')                  
                                         SET  (BMSMAPBR);                       
                                                                                
            S001A81O.MELDINGO  = '';                                            
                                                                                
   NEST_KONTROLL:                                                               
                                                                                
                                                                                
            IF S001A81I.FUNKSJONSKODEL > 0 &                                    
               VERIFY(S001A81I.FUNKSJONSKODEI,'RVEFIAX') = 0 THEN               
                                                                                
             DO;                                                                
                FUNKSJONSKODE = S001A81I.FUNKSJONSKODEI;                        
                EXEC CICS XCTL PROGRAM ('R0010301') COMMAREA (KOM_OMR);         
             END;                                                               
                                                                                
             IF S001A81I.STYRE_KODEL > 0 &                                      
                S001A81I.STYRE_KODEI ^= 'IN' THEN                               
              DO;                                                               
                STYREKODE  = S001A81I.STYRE_KODEI;                              
                EXEC CICS XCTL PROGRAM ('R0010420')                             
                               COMMAREA (KOM_OMR);                              
              END;                                                              
                                                                                
             IF S001A81I.SFNRL  > 0   THEN                                      
                DO;                                                             
                   NY_KODE = 0;                                                 
                END;                                                            
      /*                                                                        
                                                                                
             ELSE                                                               
            IF  W_AKSJON  = 'NY'  !                                             
                W_AKSJON  = 'RF'  !                                             
                W_AKSJON  = '  '  !                                             
                W_AKSJON  = 'RB'  !                                             
                W_AKSJON  = 'XX'  !                                             
                W_AKSJON  = 'D1'  !                                             
                W_AKSJON  = 'D2'  !                                             
                W_AKSJON  = 'DF'  THEN;                                         
             ELSE                                                               
                W_AKSJON  = '  '      ;                                         
     */                                                                         
             SELECT (W_AKSJON );                                                
               WHEN ('NY','  ')                                                 
                DO;                                                             
                                                                                
                   CALL P005_NYFNR;                                             
                   CALL P010_SJEKK_FNR;                                         
                   IF FEILMELDING_SATT = '1'B  THEN                             
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   FEIL_DB = '0'B;                                              
                   CALL P020_DATABASE (W01_OPEN);                               
                   IF FEIL_DB = '1'B    THEN                                    
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   FEIL_DB = '0'B;                                              
                                                                                
                   CALL P095_READ_DATABASE;                                     
                                                                                
                   IF FEIL_DB = '1'B    THEN                                    
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                   LIND = 1;                                                    
                   CALL  P030_ACC_DATA_OMRADE;                                  
                                                                                
                   CALL P090_SEND_BILDE;                                        
                                                                                
                   FEIL_DB  = '0'B;                                             
                   NY_KODE = 1;                                                 
                                                                                
                   CALL P020_DATABASE (W01_CLOSE);                              
                   IF FEIL_DB = '1'B    THEN                                    
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                                                                                
                END;                                                            
                                                                                
               WHEN('RF')                                                       
                DO;                                                             
                                                                                
                   CALL P070_NESTESIDE;                                         
                   IF FEILMELDING_SATT = '1'B    THEN                           
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                   CALL P090_SEND_BILDE;                                        
                END;                                                            
                                                                                
               WHEN('RB')                                                       
                DO;                                                             
                                                                                
                   CALL P060_TILBAKE;                                           
                   IF FEILMELDING_SATT = '1'B    THEN                           
                      DO;                                                       
                      CALL P110_FEILMELD;                                       
                      GOTO M99_RETUR;                                           
                   END;                                                         
                   CALL P090_SEND_BILDE;                                        
                END;                                                            
                                                                                
               WHEN ('D1','D2')                                                 
               DO;                                                              
       /*                                                                       
               IF  S001A81I.AKSJONI = 'D1' THEN  TERMID = 'RRAV';               
               IF  S001A81I.AKSJONI = 'D2' THEN  TERMID = 'RRAU';               
      */                                                                        
                   IF NY_KODE = 0     THEN                                      
                      DO;                                                       
                         CALL P005_NYFNR;                                       
                         CALL P010_SJEKK_FNR;                                   
                         IF FEILMELDING_SATT = '1'B  THEN                       
                            DO;                                                 
                               CALL P110_FEILMELD;                              
                               GOTO M99_RETUR;                                  
                            END;                                                
                                                                                
                         FEIL_DB = '0'B;                                        
                         CALL P020_DATABASE (W01_OPEN);                         
                         IF FEIL_DB = '1'B    THEN                              
                            DO;                                                 
                               CALL P110_FEILMELD;                              
                               GOTO M99_RETUR;                                  
                            END;                                                
                                                                                
                         FEIL_DB = '0'B;                                        
                                                                                
                         CALL P095_READ_DATABASE;                               
                                                                                
                         IF FEIL_DB = '1'B    THEN                              
                            DO;                                                 
                               CALL P110_FEILMELD;                              
                               GOTO M99_RETUR;                                  
                            END;                                                
                                                                                
                         LIND = 1;                                              
                         CALL  P030_ACC_DATA_OMRADE;                            
                                                                                
                                                                                
                                                                                
                         FEIL_DB  = '0'B;                                       
                                                                                
                         CALL P020_DATABASE (W01_CLOSE);                        
                         IF FEIL_DB = '1'B    THEN                              
                            DO;                                                 
                            CALL P110_FEILMELD;                                 
                            GOTO M99_RETUR;                                     
                         END;                                                   
                                                                                
                      END;                                                      
                                                                                
                                                                                
                   NY_KODE = 1;                                                 
                   CALL P200_DRAMMEN_PRINT;                                     
                   S001A81I.SFNRL =  CURSOR_POS;  /* CURSOR */                  
                   S001A81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;             
                   EXEC CICS SEND MAP('S001A81') MAPSET('S001A83')              
                                         CURSOR  DATAONLY;                      
                END;                                                            
                                                                                
               WHEN('DF')                                                       
                DO;                                                             
                   IF NY_KODE = 0     THEN                                      
                      DO;                                                       
                         CALL P005_NYFNR;                                       
                         CALL P010_SJEKK_FNR;                                   
                         IF FEILMELDING_SATT = '1'B  THEN                       
                            DO;                                                 
                               CALL P110_FEILMELD;                              
                               GOTO M99_RETUR;                                  
                            END;                                                
                                                                                
                         FEIL_DB = '0'B;                                        
                         CALL P020_DATABASE (W01_OPEN);                         
                         IF FEIL_DB = '1'B    THEN                              
                            DO;                                                 
                               CALL P110_FEILMELD;                              
                               GOTO M99_RETUR;                                  
                            END;                                                
                                                                                
                         FEIL_DB = '0'B;                                        
                                                                                
                         CALL P095_READ_DATABASE;                               
                                                                                
                         IF FEIL_DB = '1'B    THEN                              
                            DO;                                                 
                               CALL P110_FEILMELD;                              
                               GOTO M99_RETUR;                                  
                            END;                                                
                                                                                
                         LIND = 1;                                              
                         CALL  P030_ACC_DATA_OMRADE;                            
                                                                                
                                                                                
                                                                                
                         FEIL_DB  = '0'B;                                       
                                                                                
                         CALL P020_DATABASE (W01_CLOSE);                        
                         IF FEIL_DB = '1'B    THEN                              
                            DO;                                                 
                            CALL P110_FEILMELD;                                 
                            GOTO M99_RETUR;                                     
                         END;                                                   
                                                                                
                      END;                                                      
                                                                                
                                                                                
                   NY_KODE = 1;                                                 
                   CALL P210_DRIFT_PRINT;                                       
                   S001A81I.SFNRL =  CURSOR_POS;  /* CURSOR */                  
                   S001A81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;             
                   EXEC CICS SEND MAP('S001A81') MAPSET('S001A83')              
                                         CURSOR  DATAONLY;                      
                                                                                
                END;                                                            
                                                                                
                                                                                
               WHEN('XX')                                                       
                DO;                                                             
                   PROGRAM_ID    =  'R0010301';                                 
                   TRANS_OPPL_OMR.TRANSKODE = 'RA20';                           
                   EXEC CICS XCTL PROGRAM('R0010420')                           
                                  COMMAREA (KOM_OMR);                           
                END;                                                            
               OTHERWISE                                                        
                DO;                                                             
                   S001A81O.MELDINGO = 'UGYLDIG KODE';                          
                END;                                                            
                                                                                
            END;                                                                
     END;                                                                       
                                                                                
                                                                                
  M99_RETUR:                                                                    
      TRANS_OPPL_OMR.TRANSKODE = 'RA43';                                        
      PROGRAM_ID               =  'R0010430';                                   
                                                                                
      EXEC CICS RETURN TRANSID(TRANSKODE)                                       
                             COMMAREA(KOM_OMR);                                 
                                                                                
                                                                                
   PF8:                                                                         
       W_AKSJON       = 'RF';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
   PF7:                                                                         
       W_AKSJON       = 'RB';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
                                                                                
   ENTER:                                                                       
       W_AKSJON       = '  ';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
   PF3:                                                                         
       W_AKSJON       = 'XX';                                                   
       MAP_MELDING   = (78)' ';                                                 
       GOTO   NEST_KONTROLL;                                                    
                                                                                
  /***********************************************/                             
  /*  FOR SETTING THE SWITCHES OF FOR NY PERSON  */                             
  /**********************************************/                              
                                                                                
  P005_NYFNR: PROC;                                                             
      CALL P091_BLANKING_RUTIN;                                                 
       FEILMELDING_SATT  = '0'B  ;                                              
                                                                                
       MAP_SIDE = 1;                                                            
       ACC_SIDE = 1;                                                            
       PRI_L = '1'B;                                                            
                                                                                
  END P005_NYFNR;                                                               
                                                                                
                                                                                
                                                                                
  /*************************************************/                           
  /*   DATABASE ER BEHANDLET HER        */                                      
  /*************************************************/                           
  P095_READ_DATABASE: PROC;                                                     
                                                                                
       FNR_REG.FNR1       = S001A81I.SFNRI;                                     
       PC_11              = S001A81I.SFNRI;                                     
                                                                                
       SEARCH_FNR                       = 0    ;                                
       DIV_PARAM_OMR.ØNSKET_STATUS      = 'S'  ;                                
       DIV_PARAM_OMR.POS_I_B01          = 1    ;                                
       DIV_PARAM_OMR.SEARCH_FNR         = FNR_REG.FNR1  ;                       
       DIV_PARAM_OMR.TRANS_VIRKDATO_ÅMD  = 99999999;                            
       DIV_PARAM_OMR.FEIL_MELD_NR       = 0 ;                                   
                                                                                
       EXEC CICS LINK PROGRAM('R0013110') COMMAREA (KOM_OMR);                   
       IF DIV_PARAM_OMR.FEIL_MELD_NR >  0        THEN                           
          DO;                                                                   
             FEIL_DB    = '1'B;                                                 
             MAP_MELDING = ACF2_FEIL(FEIL_MELD_NR);                             
          END;                                                                  
                                                                                
  END P095_READ_DATABASE;                                                       
                                                                                
  /* **************************************************************** */        
  /*HENSIKT:                                                          */        
  /*    SJEKKER OM FNR GYLDIG.                                        */        
  /*                                                                  */        
  /*BRUK:                                                             */        
  /*    CALL P010_SJEKK_FNR;                                          */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
   P010_SJEKK_FNR: PROC;                                                        
                                                                                
      ATK_KOM_OMR.ACF2_F_KODE               =   ' ';                            
      IF ^(S001A81I.SFNRL > 0)  THEN                                            
         DO;                                                                    
            MAP_MELDING        =  'FNR MÅ OPPGIS  !!  ';                        
            FEILMELDING_SATT   =  '1'B;                                         
         END;                                                                   
                                                                                
                                                                                
      ELSE IF ^F_NUMERISK(S001A81I.SFNRI)        THEN                           
           DO;                                                                  
              MAP_MELDING        = 'TEGN SOM IKKE ER NUMERISK ' !!              
                                       'I FØDSELSNR. ! '             ;          
              FEILMELDING_SATT   = '1'B;                                        
           END;                                                                 
                                                                                
                                                                                
      ELSE IF ^F_GYLDIG_FNR(S001A81I.SFNRI) THEN                                
           DO;                                                                  
              MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                            
              FEILMELDING_SATT   = '1'B;                                        
                                                                                
           END;                                                                 
      ELSE                                                                      
           DO;                                                                  
                                                                                
              FNR_REG.FNR1        =  S001A81I.SFNRI;                            
              EXEC CICS LINK PROGRAM ('R0019906') COMMAREA(FNR_REG);            
                                                                                
                                                                                
             IF FNR_REG.FNR2   >   0                   THEN                     
                DO;                                                             
               MAP_MELDING        =  'FNR ENDRET TIL ' !! FNR_REG.FNR2;         
               S001A81I.SFNRI     =  FNR_REG.FNR2;                              
               CALL P110_FEILMELD;                                              
                                                                                
              END;                                                              
            END;                                                                
                                                                                
 END P010_SJEKK_FNR;                                                            
                                                                                
 /* ************************************************* */                        
 /*  LESER REG (DATA BASED)                           */                        
 /*                                                   */                        
 /*                                                   */                        
 /* ************************************************* */                        
                                                                                
 P020_DATABASE:                                                                 
   PROC    (STYRING);                                                           
                                                                                
   DCL                                                                          
      STYRING             CHAR (5),                                             
      NULL                BUILTIN,                                              
      UNSPEC              BUILTIN,                                              
      PLITDLI             ENTRY;                                                
                                                                                
  /* **************************************************************** */        
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */        
  /*     KALL                                                         */        
  /* **************************************************************** */        
                                                                                
     DCL                                                                        
       W01_PSB_NAVN                CHAR (8)       INIT('        '),             
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB '),                 
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
                                                                                
                                                                                
   %INCLUDE DLIUIB;                                                             
  /* **************************************************************** */        
  /*     DLI CALL-PARAMETRE                                           */        
  /* **************************************************************** */        
                                                                                
     DCL 1  W01_DLI_PARAM,                                                      
            2   W02_PARM_CT_1      FIXED BIN (31)  INIT ( 1 ),                  
            2   W02_PARM_CT_3      FIXED BIN (31)  INIT ( 3 ),                  
            2   W02_PARM_CT_4      FIXED BIN (31)  INIT ( 4 );                  
                                                                                
                                                                                
                                                                                
       W01_PSB_NAVN  = DIV_PARAM_OMR.PSB_NAVN;                                  
     IF STYRING = 'OPEN '                         THEN                          
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_3,                
                                                  W01_PCB_FUNCTION,             
                                                  W01_PSB_NAVN,                 
                                                  UIBPTR);                      
                                                                                
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN               
             DO;                                                                
   L120 :                                                                       
                MAP_MELDING      =                                              
                 'DB-FEIL PÅ ÅPNINGSKALLET, KODE:' !!                           
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);                    
                MAP_MELDING_NR   = 500                     ;                    
                FEIL_VED_LABEL   = 'L120'                  ;                    
                FEIL_DB = '1'B;                                                 
                                                                                
             END;                                                               
           ELSE                                                                 
             DO;                                                                
                PCB_UIB_PEKER_OMR.PCB_PEKER  =  UIBPCBAL   ;                    
                PCB_UIB_PEKER_OMR.UIB_PEKER  =  UIBPTR     ;                    
             END;                                                               
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_1,                
                                                  W01_TERM_FUNCTION);           
        END;                                                                    
                                                                                
 END P020_DATABASE;                                                             
                                                                                
                                                                                
  P030_ACC_DATA_OMRADE: PROC ;                                                  
                                                                                
                                                                                
   IF B01.RF0PERSN.FNR(POS_I_B01) > 0 THEN                                      
      DO;                                                                       
                                                                                
        CALL P030_GENERELL_BEHANDLING;                                          
                                                                                
                                                                                
        CALL P030_INNTEKTS_BEHANDLING;                                          
                                                                                
                                                                                
                                                                                
        CALL P030_TILBER_BEHANDLING;                                            
                                                                                
                                                                                
        IF B01.STATUS.VIRK_DATO_ÅMD (IX) > 0 THEN                               
            DO;                                                                 
               CALL P030_STATUS_BEHANDLING;                                     
            END;                                                                
                                                                                
                                                                                
        IF B01.ALDERSP.GP (IX) > 0 THEN                                         
            DO;                                                                 
               CALL P030_ALDERSP_BEHANDLING;                                    
            END;                                                                
                                                                                
                                                                                
        IF B01.UFØRPENS.UFG (IX)  > 0  THEN                                     
           DO;                                                                  
             CALL P030_UFØRPENS_BEHANDLING;                                     
           END;                                                                 
                                                                                
                                                                                
        CALL P030_UFØRHIST_BEHANDLING;                                          
                                                                                
                                                                                
                                                                                
        IF B01.ETTEPENS.GP_BRUTTO (IX) > 0 THEN                                 
            DO;                                                                 
               CALL P030_ETTEPENS_BEHANDLING;                                   
            END;                                                                
                                                                                
                                                                                
                                                                                
        IF B01.ETTEBARN.GP (IX) > 0 THEN                                        
          DO;                                                                   
             CALL P030_ETTEBARN_BEHANDLING;                                     
          END;                                                                  
                                                                                
                                                                                
                                                                                
       /*      CALL P030_END_REC;    */                                         
                                                                                
      END;                                                                      
                                                                                
  END P030_ACC_DATA_OMRADE ;                                                    
                                                                                
  P030_GENERELL_BEHANDLING: PROC ;                                              
                                                                                
           W01_FNR    =   B01.RF0PERSN.FNR (IX);                                
                                                                                
           CALL P99_ACC_LINJE(L01_FNR);                                         
                                                                                
           W01_NAVN   =   B01.RF0PERSN.NAVN (IX);                               
                                                                                
           CALL P99_ACC_LINJE(L01_NAVN);                                        
                                                                                
           W01_TKNR   =   B01.RF0PERSN.TKNR (IX);                               
                                                                                
                                                                                
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND_TK);                       
            EXEC CICS HANDLE CONDITION IOERR(NOTFND_TK);                        
            EXEC CICS HANDLE CONDITION SYSIDERR(NOTFND_TK);                     
            EXEC CICS READ DATASET ('TKNRTAB')                                  
                           INTO    (TKNR_REC)                                   
                           RIDFLD  (W01_TKNR)                                   
                           KEYLENGTH (4);                                       
                                                                                
                                                                                
            W01_TKNAVN =  TKNR_REC.NAVN;                                        
            GO TO FND_TK;                                                       
  NOTFND_TK:                                                                    
           W01_TKNAVN =  'FINNES IKKE KOMMUNE NAVN';                            
  FND_TK:                                                                       
                                                                                
           CALL P99_ACC_LINJE(L01_TKNR);                                        
                                                                                
   /*  STATSBORG                              */                                
           W01_STAT   =   B01.SPESOPPL.STATSBORGER (IX);                        
            EXEC CICS HANDLE CONDITION NOTFND(NOTFND_ST);                       
            EXEC CICS READ DATASET ('STATTAB')                                  
                           INTO    (STAT_REC)                                   
                           RIDFLD  (W01_STAT)                                   
                           KEYLENGTH (3);                                       
                                                                                
                                                                                
            W01_LANDNAVN =  STAT_REC.STAT_NAVN;                                 
            GO TO FND_ST;                                                       
  NOTFND_ST:                                                                    
           W01_LANDNAVN =  'FINNES IKKE LANDNAVN    ';                          
  FND_ST:                                                                       
                                                                                
           CALL P99_ACC_LINJE(L01_STATSBORGER);                                 
                                                                                
           IF  B01.RF0PERSN.SPRÅK (IX) ^= ' '  THEN DO;                         
                                                                                
               SELECT (B01.RF0PERSN.SPRÅK (IX));                                
                      WHEN ('N')  DO;                                           
                                  W01_SPRÅK  = 'NYNORSK   ';                    
                                  END;                                          
                      WHEN ('B')  DO;                                           
                                  W01_SPRÅK  = 'BOKMÅL  ';                      
                                  END;                                          
                      OTHERWISE DO;                                             
                                  W01_SPRÅK  = 'FEIL_KODE';                     
                      END;                                                      
               END;                                                             
                                                                                
                                                                                
                                                                                
               CALL P99_ACC_LINJE(L01_SPRÅK);                                   
           END;                                                                 
                                                                                
                                                                                
  END P030_GENERELL_BEHANDLING   ;                                              
                                                                                
                                                                                
                                                                                
  P030_INNTEKTS_BEHANDLING: PROC ;                                              
                                                                                
      DO IÅR = 1967 TO 2010;                                                    
           IF B01.PERSON.PINNTEKT.PI (IX, IÅR) > 0 THEN                         
                                                                                
            DO;                                                                 
               TEKST7_ÅR   = IÅR;                                               
               FILLER_TEKST7  =  'P.POENG:  ';                                  
               W01_INNT    = B01.PINNTEKT.PI(IX , IÅR); /** 100;JFA*/           
                                                                                
               CALL P0301_INNTEKTS_P_POENG;                                     
                                                                                
               CALL P99_ACC_LINJE(L01_INNT);                                    
                                                                                
            END;                                                                
                                                                                
      END;                                                                      
                                                                                
                                                                                
  END P030_INNTEKTS_BEHANDLING  ;                                               
                                                                                
                                                                                
                                                                                
  P030_TILBER_BEHANDLING  : PROC  ;                                             
                                                                                
      DO VÅR = 1 TO 4;                                                          
                                                                                
                                                                                
        IF B01.TILBERPO.VERNEPLIKTÅR(IX, VÅR) > 0 THEN                          
           DO;                                                                  
                                                                                
             W01_VERNEP  = B01.TILBERPO.VERNEPLIKTÅR(IX, VÅR);                  
                                                                                
             CALL P99_ACC_LINJE(L01_VERNEPL);                                   
           END;                                                                 
      END;                                                                      
                                                                                
        IF B01.TILBERPO.AI63 (IX)  > 0  THEN                                    
           DO;                                                                  
              W01_AI63        = B01.TILBERPO.AI63 (IX)  * 100;                  
                                                                                
              CALL P99_ACC_LINJE(L01_AI63);                                     
        END;                                                                    
                                                                                
        IF B01.TILBERPO.AI64 (IX) > 0  THEN                                     
           DO;                                                                  
              W01_AI64       = B01.TILBERPO.AI64 (IX)  * 100;                   
                                                                                
              CALL P99_ACC_LINJE(L01_AI64);                                     
           END;                                                                 
                                                                                
        IF B01.TILBERPO.AI65 (IX)  > 0       THEN                               
           DO;                                                                  
               W01_AI65      = B01.TILBERPO.AI65 (IX) * 100;                    
                                                                                
               CALL P99_ACC_LINJE(L01_AI65);                                    
           END;                                                                 
                                                                                
        IF B01.TILBERPO.AI66 (IX)  > 0   THEN                                   
           DO;                                                                  
               W01_AI66       = B01.TILBERPO.AI66 (IX) * 100;                   
                                                                                
               CALL P99_ACC_LINJE(L01_AI66);                                    
           END;                                                                 
                                                                                
        IF B01.RF0PERSN.AI67 (IX)  > 0   THEN                                   
           DO;                                                                  
               W01_AI67       = B01.RF0PERSN.AI67 (IX) * 100;                   
                                                                                
               CALL P99_ACC_LINJE(L01_AI67);                                    
           END;                                                                 
                                                                                
        IF B01.TILBERPO.PI66 (IX)  > 0    THEN                                  
           DO;                                                                  
               W01_PI66       = B01.TILBERPO.AI66 (IX);                         
                                                                                
               CALL P99_ACC_LINJE(L01_PI66);                                    
           END;                                                                 
                                                                                
                                                                                
  END P030_TILBER_BEHANDLING  ;                                                 
                                                                                
                                                                                
                                                                                
  P030_STATUS_BEHANDLING  : PROC ;                                              
                                                                                
                                                                                
   IF B01.STATUS.VIRK_DATO_ÅMD (IX)  > 0  THEN                                  
      DO;                                                                       
         WÅRMND       = B01.STATUS.VIRK_DATO_ÅMD (IX);                          
         CALL P99_DATOREVERSE;                                                  
         W01_VIRK     = WMNDÅR;                                                 
                                                                                
         CALL P99_ACC_LINJE(L01_VIRK);                                          
      END;                                                                      
                                                                                
   IF B01.STATUS.SIVILSTAND (IX)  > ' '  THEN                                   
      DO;                                                                       
                                                                                
         SELECT ( B01.STATUS.SIVILSTAND (IX));                                  
           WHEN ('A')   W01_SIVIL = 'GIFT LEVER ADSKILT';                       
           WHEN ('E')   W01_SIVIL = ' ETTERLATT        ';                       
           WHEN ('G')   W01_SIVIL = '      GIFT        ';                       
           WHEN ('U')   W01_SIVIL = '     UGIFT        ';                       
           WHEN ('S')   W01_SIVIL = '     SKILT        ';                       
           OTHERWISE  DO;                                                       
                        W01_SIVIL  = 'FEIL-KODE         ';                      
           END;                                                                 
         END;                                                                   
                                                                                
         CALL P99_ACC_LINJE(L01_SIVIL)            ;                             
      END;                                                                      
                                                                                
   IF  B01.STATUS.SIVILSTAND (IX) = 'A' !                                       
       B01.STATUS.SIVILSTAND (IX) = 'G'     THEN                                
       DO;                                                                      
          CALL P030_TILKN_BEHANDLING;                                           
       END;                                                                     
                                                                                
   IF B01.STATUS.TT_ANV (IX)     > 0 THEN                                       
      DO;                                                                       
         W01_TT       = B01.STATUS.TT_ANV (IX)    ;                             
                                                                                
         CALL P99_ACC_LINJE(L01_TT);                                            
      END;                                                                      
                                                                                
   IF B01.STATUS.ANTALL_BARN (IX)  > 0 THEN                                     
      DO;                                                                       
         W01_BT_ANT   = B01.STATUS.ANTALL_BARN (IX);                            
         CALL P99_ACC_LINJE(L01_BT_ANT);                                        
      END;                                                                      
                                                                                
   IF B01.STATUS.DØDSDATO_ÅMD (IX) > 0 THEN                                     
      DO;                                                                       
         W01_DØD      = B01.STATUS.DØDSDATO_ÅMD (IX);                           
         CALL P99_ACC_LINJE(L01_DØD);                                           
      END;                                                                      
                                                                                
   IF B01.STATUS.G_DATO_ÅMD (IX)  > 0 THEN                                      
      DO;                                                                       
         WÅRMND       = B01.STATUS.G_DATO_ÅMD (IX);                             
         CALL P99_DATOREVERSE;                                                  
         W01_G_DATO   = WMNDÅR;                                                 
         CALL P99_ACC_LINJE(L01_G_DATO);                                        
      END;                                                                      
                                                                                
   IF B01.STATUS.POENGTILLEGG_DATO_ÅMD (IX) > 0 THEN                            
      DO;                                                                       
         WÅRMND       = B01.STATUS.POENGTILLEGG_DATO_ÅMD (IX);                  
         CALL P99_DATOREVERSE;                                                  
         W01_P_DATO   = WMNDÅR;                                                 
         CALL P99_ACC_LINJE(L01_P_DATO)    ;                                    
      END;                                                                      
                                                                                
     W01_SUM_KODE = ' ';                                                        
     W01_SUM_W    = 0;                                                          
   IF B01.STATUS.SUM_YTELSE (IX)   > 0  THEN                                    
      DO;                                                                       
         W01_SUM      = B01.STATUS.SUM_YTELSE (IX);                             
         CALL P99_ACC_LINJE(L01_SUM);                                           
         W01_SUM_KODE = 'J';                                                    
      END;                                                                      
                                                                                
                                                                                
  END P030_STATUS_BEHANDLING     ;                                              
                                                                                
                                                                                
                                                                                
  P030_TILKN_BEHANDLING    : PROC ;                                             
                                                                                
                                                                                
     DO TIL = 1 TO 13;                                                          
                                                                                
        IF B01.TILKN.FNR_TILKN (IX, TIL) > 0 THEN                               
           DO;                                                                  
              IF TIL = 1 THEN                                                   
                 DO;                                                            
                    W01_TILKN =                                                 
                             B01.TILKN.FNR_TILKN (IX, TIL);                     
                  /*  SUBSTR(B01.TILKN.FNR_TILKN (IX, TIL),4,  6); */           
                    CALL P99_ACC_LINJE(L01_TILKN)  ;                            
                  END;                                                          
           ELSE                                                                 
             IF TIL > 1 THEN                                                    
                 DO;                                                            
                    W01_BARN  =                                                 
                                B01.TILKN.FNR_TILKN (IX, TIL)  ;                
                   /* SUBSTR(B01.TILKN.FNR_TILKN (IX, TIL),4,  6); */           
                    CALL P99_ACC_LINJE(L01_BARN)    ;                           
                 END;                                                           
           END;                                                                 
     END;                                                                       
                                                                                
                                                                                
  P030_TILKN_RETURN:                                                            
  END P030_TILKN_BEHANDLING       ;                                             
                                                                                
                                                                                
                                                                                
  P030_ALDERSP_BEHANDLING  : PROC ;                                             
                                                                                
    IF B01.ALDERSP.GP (IX)  > 0 THEN                                            
       DO;                                                                      
          W01_APGP         = B01.ALDERSP.GP (IX);                               
          CALL P99_ACC_LINJE(L01_APGP);                                         
       END;                                                                     
                                                                                
    IF B01.ALDERSP.ST (IX)  > 0 THEN                                            
       DO;                                                                      
          W01_APST         = B01.ALDERSP.ST (IX);                               
          CALL P99_ACC_LINJE(L01_APST);                                         
       END;                                                                     
                                                                                
    IF B01.ALDERSP.BT (IX)   > 0 THEN                                           
       DO;                                                                      
          W01_APBT         = B01.ALDERSP.BT (IX);                               
          CALL P99_ACC_LINJE(L01_APBT);                                         
       END;                                                                     
                                                                                
    IF B01.ALDERSP.KT (IX)  > 0 THEN                                            
       DO;                                                                      
          W01_APKT         = B01.ALDERSP.KT (IX);                               
          CALL P99_ACC_LINJE(L01_APKT);                                         
       END;                                                                     
                                                                                
    IF B01.ALDERSP.ET (IX)  > 0 THEN                                            
       DO;                                                                      
          W01_APET         = B01.ALDERSP.ET (IX);                               
          CALL P99_ACC_LINJE(L01_APET);                                         
       END;                                                                     
                                                                                
    IF B01.ALDERSP.TP (IX)  > 0  THEN                                           
       DO;                                                                      
          W01_APTP         = B01.ALDERSP.TP (IX);                               
          CALL P99_ACC_LINJE(L01_APTP);                                         
       END;                                                                     
                                                                                
  /*    IF W01_SUM_W   > 0  THEN                                                
       DO;                                                                      
          W01_SUM  = W01_SUM_W;                                                 
          CALL P99_ACC_LINJE(L01_SUM);                                          
       END;                                       */                            
                                                                                
    IF B01.ALDERSP.SPT (IX)   > 0 THEN                                          
       DO;                                                                      
          W01_APSPT        = B01.ALDERSP.SPT (IX);                              
          CALL P99_ACC_LINJE(L01_APSPT);                                        
       END;                                                                     
                                                                                
    IF B01.ALDERSP.OPT (IX)  > 0  THEN                                          
       DO;                                                                      
          W01_APOPT        = B01.ALDERSP.OPT (IX);                              
          CALL P99_ACC_LINJE(L01_APOPT);                                        
       END;                                                                     
                                                                                
    IF B01.ALDERSP.PÅ (IX) > 0 THEN                                             
       DO;                                                                      
          W01_APPÅ         = B01.ALDERSP.PÅ (IX);                               
          CALL P99_ACC_LINJE(L01_APPÅ);                                         
       END;                                                                     
                                                                                
    IF B01.ALDERSP.APD (IX)  > 0 THEN                                           
       DO;                                                                      
          W01_APAPD        = B01.ALDERSP.APD (IX);                              
          CALL P99_ACC_LINJE(L01_APAPD);                                        
       END;                                                                     
                                                                                
    IF B01.ALDERSP.FAI (IX)  > 0 THEN                                           
       DO;                                                                      
          W01_APFAI        = B01.ALDERSP.FAI (IX) * 100;                        
          CALL P99_ACC_LINJE(L01_APFAI);                                        
       END;                                                                     
                                                                                
    IF B01.ALDERSP.KONV_GRAD (IX) > 0 THEN                                      
       DO;                                                                      
          W01_APKONV_GRAD  = B01.ALDERSP.KONV_GRAD (IX);                        
          CALL P99_ACC_LINJE(L01_APKONV_GRAD);                                  
       END;                                                                     
                                                                                
    IF B01.ALDERSP.TT_VENT (IX)  > 0 THEN                                       
       DO;                                                                      
          W01_APTTVENT     = B01.ALDERSP.TT_VENT (IX);                          
          CALL P99_ACC_LINJE(L01_APTTVENT);                                     
       END;                                                                     
                                                                                
    IF B01.ALDERSP.VENTEFAKTOR(IX)  > 0    THEN                                 
       DO;                                                                      
          W01_APVENTEFAKTOR= B01.ALDERSP.VENTEFAKTOR(IX);                       
          CALL P99_ACC_LINJE(L01_APVENTEFAKTOR);                                
                                                                                
          IF B01.ALDERSP.VT_SPT (IX)    > 0  THEN                               
             DO;                                                                
                W01_APVT_SPT     = B01.ALDERSP.VT_SPT (IX);                     
                CALL P99_ACC_LINJE(L01_APVT_SPT);                               
             END;                                                               
                                                                                
          IF B01.ALDERSP.VT_OPT (IX)   > 0    THEN                              
             DO;                                                                
                W01_APVT_OPT     = B01.ALDERSP.VT_OPT (IX);                     
                CALL P99_ACC_LINJE(L01_APVT_OPT);                               
             END;                                                               
       END;                                                                     
                                                                                
    IF B01.ALDERSP.VT_PÅ (IX)  > 0  &                                           
       B01.VENTEFAKTOR   (IX)  > 0      THEN                                    
       DO;                                                                      
          W01_APVT_PÅ      = B01.ALDERSP.VT_PÅ (IX);                            
          CALL P99_ACC_LINJE(L01_APVT_PÅ);                                      
       END;                                                                     
                                                                                
                                                                                
  END P030_ALDERSP_BEHANDLING     ;                                             
                                                                                
                                                                                
                                                                                
  P030_UFØRPENS_BEHANDLING  : PROC ;                                            
                                                                                
                                                                                
    IF B01.UFØRPENS.GP (IX)  > 0     THEN                                       
       DO;                                                                      
          W01_UP_GP        = B01.UFØRPENS.GP (IX);                              
          CALL P99_ACC_LINJE(L01_UP_GP);                                        
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.ST (IX)  > 0    THEN                                        
       DO;                                                                      
          W01_UP_ST        = B01.UFØRPENS.ST (IX);                              
          CALL P99_ACC_LINJE(L01_UP_ST);                                        
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.ÅFT (IX)   > 0 THEN                                         
       DO;                                                                      
          W01_UP_ÅFT       = B01.UFØRPENS.ÅFT (IX);                             
          CALL P99_ACC_LINJE(L01_UP_ÅFT);                                       
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.ET (IX)  > 0  THEN                                          
       DO;                                                                      
          W01_UP_ET        = B01.UFØRPENS.ET (IX);                              
          CALL P99_ACC_LINJE(L01_UP_ET);                                        
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.BT (IX)  > 0   THEN                                         
       DO;                                                                      
          W01_UP_BT        = B01.UFØRPENS.BT (IX);                              
          CALL P99_ACC_LINJE(L01_UP_BT);                                        
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.KT (IX)  > 0 THEN                                           
       DO;                                                                      
          W01_UP_KT        = B01.UFØRPENS.KT (IX);                              
          CALL P99_ACC_LINJE(L01_UP_KT);                                        
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.TP (IX)  > 0 THEN                                           
       DO;                                                                      
          W01_UP_TP        = B01.UFØRPENS.TP (IX);                              
          CALL P99_ACC_LINJE(L01_UP_TP);                                        
       END;                                                                     
                                                                                
    IF B01.STATUS.VILKÅR_8_4_3A (IX)  > ' '  THEN                               
       DO;                                                                      
         IF B01.STATUS.VILKÅR_8_4_3A (IX) = 'J'  THEN    DO;                    
                   W01_UP_8_4_3A    = 'JA  ';                                   
         END;                                                                   
         ELSE                                                                   
         IF B01.STATUS.VILKÅR_8_4_3A (IX) = 'N'  THEN    DO;                    
                   W01_UP_8_4_3A    = 'NEI ';                                   
         END;                                                                   
         ELSE DO;                                                               
                   W01_UP_8_4_3A    = 'FEIL';                                   
         END;                                                                   
          CALL P99_ACC_LINJE(L01_UP_8_4_3A);                                    
    END;                                                                        
                                                                                
    IF B01.UFØRPENS.SPT (IX)  > 0 THEN                                          
       DO;                                                                      
          W01_UP_SPT       = B01.UFØRPENS.SPT (IX);                             
          CALL P99_ACC_LINJE(L01_UP_SPT);                                       
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.OPT (IX)  > 0 THEN                                          
       DO;                                                                      
            W01_UP_OPT       = B01.UFØRPENS.OPT (IX);                           
            CALL P99_ACC_LINJE(L01_UP_OPT);                                     
       END;                                                                     
                                                                                
    IF B01.UFØRPENS.PÅ (IX)  > 0 THEN                                           
       DO;                                                                      
          W01_UP_PÅ        = B01.UFØRPENS.PÅ (IX);                              
          CALL P99_ACC_LINJE(L01_UP_PÅ);                                        
       END;                                                                     
                                                                                
                                                                                
  END P030_UFØRPENS_BEHANDLING     ;                                            
                                                                                
                                                                                
                                                                                
  P030_UFØRHIST_BEHANDLING  : PROC ;                                            
                                                                                
      DO  UHIST = 1 TO 5;                                                       
                                                                                
         IF B01.UFØRHIST.UFT_ÅMD (IX, UHIST) > 0 THEN                           
            DO;                                                                 
                                                                                
               WÅRMND    =   B01.UFØRHIST.UFT_ÅMD(IX, UHIST) ;                  
               CALL P99_DATOREVERSE;                                            
               W01_UFØRHIST_UFT_ÅMD = WMNDÅR;                                   
               CALL P99_ACC_LINJE(L01_UFØRHIST_UFT_ÅMD);                        
                                                                                
                                                                                
               IF B01.UFØRHIST.UFG(IX, UHIST)  > 0 THEN                         
                  DO;                                                           
                     W01_UFØRHIST_UFG =  B01.UFØRHIST.UFG(IX, UHIST) ;          
                     CALL P99_ACC_LINJE(L01_UFØRHIST_UFG);                      
                  END;                                                          
                                                                                
                                                                                
               IF B01.UFØRHIST.BUP(IX, UHIST)  > 0     THEN                     
                  DO;                                                           
                     W01_UFØRHIST_BUP = B01.UFØRHIST.BUP(IX, UHIST);            
                     CALL P99_ACC_LINJE(L01_UFØRHIST_BUP);                      
                  END;                                                          
                                                                                
              IF B01.UFØRHIST.UFKRITERIER (IX, UHIST)  > 0  THEN                
                  DO;                                                           
                     W01_UFØRHIST_UFKRITE   = 'JA ';                            
                     CALL P99_ACC_LINJE(L01_UFØRHIST_UFKRTERIER);               
                  END;                                                          
               ELSE                                                             
                                                                                
                  DO;                                                           
                     W01_UFØRHIST_UFKRITE   = 'NEI';                            
                     CALL P99_ACC_LINJE(L01_UFØRHIST_UFKRTERIER);               
                  END;                                                          
                                                                                
                                                                                
                                                                                
               IF B01.UFØRHIST.OPPHØRSDATO_ÅMD(IX, UHIST) > 0 THEN              
                  DO;                                                           
                     WÅRMND =                                                   
                             B01.UFØRHIST.OPPHØRSDATO_ÅMD(IX, UHIST);           
                     CALL P99_DATOREVERSE;                                      
                     W01_UFØRHIST_OPPH_ÅMD = WMNDÅR;                            
                     CALL P99_ACC_LINJE(L01_UFØRHIST_OPPH_ÅMD);                 
                  END;                                                          
                                                                                
            END;                                                                
                                                                                
      END;                                                                      
                                                                                
                                                                                
  END P030_UFØRHIST_BEHANDLING  ;                                               
                                                                                
                                                                                
                                                                                
  P030_ETTEPENS_BEHANDLING  : PROC ;                                            
                                                                                
    IF B01.ETTEPENS.GP_BRUTTO (IX)  > 0 THEN                                    
        DO;                                                                     
            W01_ET_GP_BRUTTO    = B01.ETTEPENS.GP_BRUTTO (IX);                  
            CALL P99_ACC_LINJE(L01_ET_GP_BRUTTO);                               
        END;                                                                    
                                                                                
     IF B01.ETTEPENS.GP_NETTO (IX)  > 0 THEN                                    
        DO;                                                                     
            W01_ET_GP_NETTO     = B01.ETTEPENS.GP_NETTO (IX);                   
            CALL P99_ACC_LINJE(L01_ET_GP_NETTO);                                
        END;                                                                    
                                                                                
     IF B01.ETTEPENS.ST (IX)   > 0 THEN                                         
        DO;                                                                     
            W01_ET_ST           = B01.ETTEPENS.ST (IX);                         
            CALL P99_ACC_LINJE(L01_ET_ST);                                      
        END;                                                                    
                                                                                
     IF B01.ETTEPENS.KT (IX)   > 0 THEN                                         
        DO;                                                                     
            W01_ET_KT           = B01.ETTEPENS.KT (IX);                         
            CALL P99_ACC_LINJE(L01_ET_KT);                                      
        END;                                                                    
                                                                                
     IF B01.ETTEPENS.TP_BRUTTO (IX)  > 0 THEN                                   
        DO;                                                                     
            W01_ET_TP_BRUTTO    = B01.ETTEPENS.TP_BRUTTO (IX);                  
            CALL P99_ACC_LINJE(L01_ET_TP_BRUTTO);                               
        END;                                                                    
                                                                                
     IF B01.ETTEPENS.TP_NETTO (IX)  > 0 THEN                                    
        DO;                                                                     
            W01_ET_TP_NETTO     = B01.ETTEPENS.TP_NETTO (IX);                   
            CALL P99_ACC_LINJE(L01_ET_TP_NETTO);                                
        END;                                                                    
                                                                                
      IF B01.ETTEPENS.SPT_AVD (IX)  > 0 THEN                                    
         DO;                                                                    
            W01_ET_SPT_AVD      = B01.ETTEPENS.SPT_AVD (IX);                    
            CALL P99_ACC_LINJE(L01_ET_SPT_AVD);                                 
         END;                                                                   
                                                                                
      IF B01.ETTEPENS.OPT_AVD (IX)  > 0 THEN                                    
         DO;                                                                    
            W01_ET_OPT_AVD      = B01.ETTEPENS.OPT_AVD (IX);                    
            CALL P99_ACC_LINJE(L01_ET_OPT_AVD);                                 
         END;                                                                   
                                                                                
      IF B01.ETTEPENS.PÅ_AVD  (IX)   > 0 THEN                                   
         DO;                                                                    
            W01_PÅ_AVD          = B01.ETTEPENS.PÅ_AVD  (IX);                    
            CALL P99_ACC_LINJE(L01_ET_PÅ_AVD);                                  
         END;                                                                   
                                                                                
      IF B01.ETTEPENS.TP_PROSENT (IX)  > 0 THEN                                 
         DO;                                                                    
            W01_TP_PROSENT      = B01.ETTEPENS.TP_PROSENT (IX);                 
            CALL P99_ACC_LINJE(L01_ET_TP_PROSENT);                              
         END;                                                                   
                                                                                
      IF B01.ETTEPENS.FORVENTET (IX)  > 0 THEN                                  
         DO;                                                                    
            W01_FORVENTET       = B01.ETTEPENS.FORVENTET (IX);                  
            CALL P99_ACC_LINJE(L01_ET_FORVENTET);                               
         END;                                                                   
                                                                                
      IF B01.ETTEPENS.FRAMLEGGSDATO_ÅMD (IX) >  0  THEN                         
         DO;                                                                    
           W01_FRAMLEGGSDATO  =  B01.ETTEPENS.FRAMLEGGSDATO_ÅMD (IX);           
           CALL P99_ACC_LINJE(L01_ET_FRAMLEGGSDATO);                            
         END;                                                                   
                                                                                
      IF B01.ETTEPENS.FRAMLEGGSKODE (IX)  > ' ' THEN                            
         DO;                                                                    
           IF B01.ETTEPENS.FRAMLEGGSKODE (IX)  = 'A' THEN                       
              W01_FRAMLEGGSKODE   = 'REVISJON AV SAKEN';                        
           ELSE                                                                 
              W01_FRAMLEGGSKODE   = 'OPPFØRT          ';                        
            CALL P99_ACC_LINJE(L01_ET_FRAMLEGG);                                
         END;                                                                   
                                                                                
                                                                                
  END P030_ETTEPENS_BEHANDLING    ;                                             
                                                                                
                                                                                
                                                                                
  P030_ETTEBARN_BEHANDLING  : PROC ;                                            
                                                                                
      IF B01.ETTEBARN.PENSJON_ETTER (IX)  > ' ' THEN                            
         DO;                                                                    
           IF B01.ETTEBARN.PENSJON_ETTER (IX)  = 'M' THEN                       
              W01_PENSJON         = 'MOR';                                      
           ELSE                                                                 
              W01_PENSJON         = 'FAR';                                      
                                                                                
            CALL P99_ACC_LINJE(L01_BP_PENSJON);                                 
         END;                                                                   
                                                                                
                                                                                
      IF B01.ETTEBARN.GP (IX)  > 0 THEN                                         
         DO;                                                                    
            W01_BP_GP           = B01.ETTEBARN.GP (IX);                         
            CALL P99_ACC_LINJE(L01_BP_GP);                                      
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.TP  (IX)  > 0 THEN                                        
         DO;                                                                    
            W01_BP_TP           = B01.ETTEBARN.TP  (IX);                        
            CALL P99_ACC_LINJE(L01_BP_TP);                                      
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.ST  (IX)  > 0 THEN                                        
         DO;                                                                    
            W01_BP_ST           = B01.ETTEBARN.ST  (IX);                        
            CALL P99_ACC_LINJE(L01_BP_ST);                                      
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.KT  (IX)  > 0 THEN                                        
        DO;                                                                     
            W01_BP_KT           = B01.ETTEBARN.KT  (IX);                        
            CALL P99_ACC_LINJE(L01_BP_KT);                                      
        END;                                                                    
                                                                                
      IF B01.ETTEBARN.SPT_MOR (IX) > 0 THEN                                     
         DO;                                                                    
            W01_BP_SPT_MOR      = B01.ETTEBARN.SPT_MOR (IX);                    
            CALL P99_ACC_LINJE(L01_BP_SPT_MOR);                                 
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.OPT_MOR (IX)  > 0 THEN                                    
         DO;                                                                    
            W01_BP_OPT_MOR      = B01.ETTEBARN.OPT_MOR (IX);                    
            CALL P99_ACC_LINJE(L01_BP_OPT_MOR);                                 
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.PÅ_MOR  (IX)  > 0 THEN                                    
         DO;                                                                    
            W01_BP_PÅ_MOR       = B01.ETTEBARN.PÅ_MOR  (IX);                    
            CALL P99_ACC_LINJE(L01_BP_PÅ_MOR);                                  
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.SPT_FAR (IX) > 0 THEN                                     
         DO;                                                                    
            W01_BP_SPT_FAR      = B01.ETTEBARN.SPT_FAR (IX);                    
            CALL P99_ACC_LINJE(L01_BP_SPT_FAR);                                 
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.OPT_FAR (IX) > 0 THEN                                     
         DO;                                                                    
            W01_BP_OPT_FAR      = B01.ETTEBARN.OPT_FAR (IX);                    
            CALL P99_ACC_LINJE(L01_BP_OPT_FAR);                                 
         END;                                                                   
                                                                                
      IF B01.ETTEBARN.PÅ_FAR  (IX)  > 0 THEN                                    
         DO;                                                                    
            W01_BP_PÅ_FAR       = B01.ETTEBARN.PÅ_FAR  (IX);                    
            CALL P99_ACC_LINJE(L01_BP_PÅ_FAR);                                  
         END;                                                                   
                                                                                
                                                                                
  END P030_ETTEBARN_BEHANDLING     ;                                            
                                                                                
                                                                                
                                                                                
  P030_END_REC :  PROC ;                                                        
                                                                                
            CALL P99_ACC_LINJE(L01_END) ;        /* LAST REC   */               
                                                                                
                                                                                
  END P030_END_REC ;                                                            
                                                                                
                                                                                
  P200_DRAMMEN_PRINT: PROC;                                                     
                                                                                
      DATO_M  = DATO_2000;                                                      
      DAG     = DAG_M;                                                          
      MND     = MND_M;                                                          
      ÅR      = ÅR_M;                                                           
      FS_SIDE = 0 ;                                                             
      S_SIDE = 2;                                                               
                                                                                
                                                                                
      EXEC CICS ROUTE LIST (CHARLIST2);                                         
                                                                                
      CALL SEND_HEADING;                                                        
                                                                                
                                                                                
    /* *   MOVING DATA FRAM  WORKING OMR TO PRINT-LINJE BUFFER  */              
                                                                                
   /* LINJETELLER = 10;      */                                                 
                                                                                
      DO PL = 1 TO ACC_SIDE;                                                    
         DO LIND = 1 TO 20   ;                                                  
                                                                                
        AYY_LINE =  ACC_LINJE  (PL, LIND);                                      
                                                                                
        IF T_END = '   '   THEN                                                 
           DO;                                                                  
              PL = ACC_SIDE;                                                    
              LIND = 20;                                                        
           END;                                                                 
                                                                                
       ELSE DO;                                                                 
                                                                                
              PRI_LINJE   = ACC_LINJE (PL, LIND);                               
                                                                                
              CALL SEND_UTLINJE( PRI_LINJE);                                    
              LINJETELLER = LINJETELLER + 1;                                    
              IF LINJETELLER > 73   THEN                                        
                 DO;                                                            
                   CALL SEND_HEADING;                                           
              END;                                                              
            END;                                                                
                                                                                
                                                                                
         END;                                                                   
      END;                                                                      
   /* EXEC CICS ENTER TRACEID(02) FROM (LINJETELLER);  */                       
                                                                                
                                                                                
      IF W01_SUM_KODE = 'J' THEN                                                
         CALL SKRIV_BOND_TESKT;                                                 
                                                                                
      ANT_GANGER =   73 - LINJETELLER;                                          
      CALL SEND_BLANKLINJE(ANT_GANGER);                                         
                                                                                
                                                                                
  END P200_DRAMMEN_PRINT;                                                       
                                                                                
                                                                                
  P210_DRIFT_PRINT: PROC;                                                       
                                                                                
      DATO_M  = DATO_2000;                                                      
      DAG     = DAG_M;                                                          
      MND     = MND_M;                                                          
      ÅR      = ÅR_M;                                                           
      FS_SIDE = 0 ;                                                             
                                                                                
                                                                                
      CALL DF_DRIFT_HEAD;                                                       
                                                                                
      DO PL = 1 TO ACC_SIDE;                                                    
         DO LIND = 1 TO 20   ;                                                  
                                                                                
         AYY_LINE =  ACC_LINJE  (PL, LIND);                                     
                                                                                
        IF T_END = '   '   THEN                                                 
           DO;                                                                  
              PL = ACC_SIDE;                                                    
              LIND = 20;                                                        
           END;                                                                 
                                                                                
        ELSE DO;                                                                
               DF_TEKST = '';                                                   
                                                                                
               DF_TEKST = ACC_LINJE(PL, LIND);                                  
               DF_CC = ' ';                                                     
                                                                                
               EXEC CICS WRITE FROM(DF_PRINT_LINE)                              
                               DATASET('PRINTRX')                               
                               RIDFLD(PRI_RBA)                                  
                               RBA;                                             
                                                                                
              DF_LINE = DF_LINE + 1;                                            
              IF DF_LINE > 50   THEN                                            
                 DO;                                                            
                   CALL DF_DRIFT_HEAD;                                          
                 END;                                                           
             END;                                                               
                                                                                
                                                                                
         END;                                                                   
      END;                                                                      
                                                                                
                                                                                
  END P210_DRIFT_PRINT;                                                         
                                                                                
  DF_DRIFT_HEAD: PROC;                                                          
                                                                                
      DF_LINE = 1;                                                              
      DF_COMD = '';                                                             
                                                                                
      IF  FS_SIDE = 0  THEN                                                     
          DO;                                                                   
             DF_COMD = '';                                                      
             DF_COMD = '  DJDE  FORMS=AAFRM1,END;               ' !!            
                        '                                      ';               
             CALL DF_DRIFT_SKRIV;                                               
             FS_SIDE = 1;                                                       
         END;                                                                   
                                                                                
             DF_COMD = '';                                                      
                                                                                
             DF_CC = '&';                                                       
             DF_LINE = DF_LINE + 1;                                             
             CALL DF_DRIFT_SKRIV;                                               
             DF_COMD = '';                                                      
                                                                                
             DF_PCC = '1';                                                      
             DO DR = 1 TO 10;                                                   
               CALL DF_DRIFT_SKRIV;                                             
               DF_PCC = ' ';                                                    
               DF_LINE = DF_LINE + 1;                                           
             END;                                                               
                                                                                
                                                                                
      DF_COMD= '';                                                              
                                                                                
  END DF_DRIFT_HEAD;                                                            
                                                                                
  SKRIV_BOND_TESKT: PROC;                                                       
                                                                                
      ANT_GANGER =  2;                                                          
      CALL SEND_BLANKLINJE(ANT_GANGER);                                         
                                                                                
      LINJETELLER = LINJETELLER + 8;                                            
      IF LINJETELLER > 73   THEN                                                
         DO;                                                                    
           CALL SEND_HEADING;                                                   
         END;                                                                   
                                                                                
      DO TT = 1 TO 6;                                                           
         PRI_LINJE = BOND_TESKT (TT);                                           
                                                                                
         CALL SEND_UTLINJE( PRI_LINJE);                                         
      END;                                                                      
                                                                                
  END SKRIV_BOND_TESKT;                                                         
  DF_DRIFT_SKRIV: PROC;                                                         
      EXEC CICS WRITE FROM(DF_PRINT_LINE)                                       
                      DATASET('PRINTRX')                                        
                      RIDFLD(PRI_RBA)                                           
                      RBA;                                                      
  END DF_DRIFT_SKRIV;                                                           
                                                                                
  P060_TILBAKE: PROC;                                                           
                                                                                
     IF  MAP_SIDE > 1 THEN                                                      
        DO;                                                                     
           MAP_SIDE = MAP_SIDE - 1;                                             
        END;                                                                    
      ELSE                                                                      
        DO;                                                                     
                                                                                
           MAP_MELDING = 'DETTE ER FØRST SIDE      ';                           
           FEILMELDING_SATT   = '1'B;                                           
        END;                                                                    
                                                                                
  END P060_TILBAKE;                                                             
                                                                                
  P070_NESTESIDE: PROC;                                                         
                                                                                
                                                                                
     MAP_MELDING = '                                         ';                 
     FEILMELDING_SATT   = '0'B;                                                 
     MAP_SIDE = MAP_SIDE + 1;                                                   
     IF MAP_SIDE > ACC_SIDE THEN                                                
        DO;                                                                     
           MAP_MELDING = 'HAR IKKE MERE INFORMASJON';                           
           FEILMELDING_SATT   = '1'B;                                           
           MAP_SIDE = ACC_SIDE;                                                 
                                                                                
        END;                                                                    
                                                                                
                                                                                
  END P070_NESTESIDE;                                                           
                                                                                
                                                                                
  P090_SEND_BILDE: PROC;                                                        
                                                                                
    /* *  TOMMING AV SKJERM   *  */                                             
                                                                                
         DO PL = 1 TO 20;                                                       
            S001A81O.STEKSTO(PL) =  '';                                         
            S001A81I.STEKSTI(PL) =  '';                                         
         END;                                                                   
                                                                                
                                                                                
    /* *   MOVING DATA FRAM  WORKING OMR TO SCREEN *  */                        
                                                                                
      PP    = MAP_SIDE;                                                         
                                                                                
      DO PL = 1 TO 20;                                                          
                                                                                
        AYY_LINE =  ACC_LINJE  (PP, PL);                                        
                                                                                
        IF T_END ^= '   '   THEN                                                
           DO;                                                                  
           S001A81O.STEKSTO (PL)  = ACC_LINJE (PP, PL);                         
           S001A81I.STEKSTI (PL)  = ACC_LINJE (PP, PL);                         
           END;                                                                 
        ELSE DO;                                                                
           PL = 20;                                                             
                                                                                
           END;                                                                 
      END;                                                                      
                                                                                
                                                                                
        S001A81O.MELDINGO  =  MAP_MELDING;                                      
        S001A81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                        
        EXEC CICS SEND MAP('S001A81') MAPSET('S001A83')                         
                DATAONLY ERASEAUP CURSOR;                                       
   /*          CURSOR  DATAONLY;                                                
           FROM (S001A81O) CURSOR;                */                            
                                                                                
  END P090_SEND_BILDE;                                                          
                                                                                
                                                                                
                                                                                
                                                                                
  P091_BLANKING_RUTIN:  PROC;                                                   
                                                                                
      DO BLANK_P = 1 TO 4;                                                      
         DO BLANK_L = 1 TO 20;                                                  
                                                                                
            ACC_LINJE (BLANK_P, BLANK_L)  =  '';                                
         END;                                                                   
      END;                                                                      
                                                                                
  END P091_BLANKING_RUTIN  ;                                                    
                                                                                
                                                                                
                                                                                
                                                                                
  P99_ACC_LINJE: PROC (P99_OMRD);                                               
                                                                                
                                                                                
      DCL     P99_OMRD       CHAR (80),                                         
              P99_DATA   DEF (P99_OMRD)  CHAR(25) POS(42);                      
                                                                                
                                                                                
              IF P99_DATA ^= ' ' THEN                                           
                                                                                
                 DO;                                                            
                                                                                
   /* * BUFFER FOR SCREEN                           */                          
                                                                                
                    ACC_LINJE (ACC_SIDE, LIND) = P99_OMRD;                      
                    LIND = LIND + 1;                                            
                    IF LIND > 20 THEN DO;                                       
                       ACC_SIDE = ACC_SIDE + 1;                                 
                       LIND = 1;                                                
                    END;                                                        
                    IF ACC_SIDE > 4  THEN ACC_SIDE = 4;                         
                                                                                
                    P99_DATA = '';                                              
                                                                                
                 END;                                                           
                                                                                
                                                                                
  END P99_ACC_LINJE;                                                            
                                                                                
                                                                                
  P110_FEILMELD: PROC;                                                          
                                                                                
        S001A81O.MELDINGO  =  MAP_MELDING;                                      
                                                                                
                                                                                
        S001A81O.CICS_INFOO  =  DIV_PARAM_OMR.CICS_NAVN;                        
        EXEC CICS SEND MAP  ('S001A81')  MAPSET('S001A83')                      
                                         CURSOR DATAONLY  ;                     
                                                                                
                                                                                
        FEILMELDING_SATT = '0'B;                                                
        S001A81O.MELDINGO  =  '';                                               
                                                                                
  END P110_FEILMELD;                                                            
                                                                                
                                                                                
                                                                                
  SEND_HEADING: PROC;                                                           
                                                                                
                                                                                
      IF FS_SIDE = 1 THEN                                                       
         DO;                                                                    
            ANT_GANGER = 6;                                                     
             CALL SEND_BLANKLINJE(ANT_GANGER);                                  
      /*     DR_SIDENR = DR_SIDENR + 1;            */                           
      UTLINJE = '                                        ' !!                   
                '                 SIDE NR.   ' !! S_SIDE !!'  ';                
      EXEC CICS SEND TEXT FROM(UTLINJE)  ACCUM PAGING L80 PRINT                 
                                       ERASE;                                   
      END;                                                                      
                                                                                
      ANT_GANGER = 3;                                                           
      CALL SEND_BLANKLINJE(ANT_GANGER);                                         
                                                                                
      UTLINJE = '        UTSKRIFT FRA RIKSTRYGDEVERKETS  ' !!                   
                'FOLKETRYGDREGISTER                    ';                       
                                                                                
      EXEC CICS SEND TEXT FROM(UTLINJE)  ACCUM PAGING L80 PRINT                 
                                       ERASE;                                   
                                                                                
                                                                                
                                                                                
      ANT_GANGER = 1;                                                           
      CALL SEND_BLANKLINJE(ANT_GANGER);                                         
                                                                                
      UTLINJE = '                                        ' !!                   
                '                      DATO: ' !! DATO !! '  ';                 
                                                                                
                                                                                
      EXEC CICS SEND TEXT FROM(UTLINJE)  ACCUM PAGING L80 PRINT                 
                                              ERASE;                            
      LINJETELLER = 10;                                                         
      IF FS_SIDE = 1 THEN                                                       
         DO;                                                                    
            ANT_GANGER = 1;                                                     
            CALL SEND_BLANKLINJE(ANT_GANGER);                                   
            PRI_LINJE   = ACC_LINJE (1, 1);                                     
                                                                                
            CALL SEND_UTLINJE( PRI_LINJE);                                      
            ANT_GANGER = 2;                                                     
            CALL SEND_BLANKLINJE(ANT_GANGER);                                   
             LINJETELLER = 15;                                                  
      END;                                                                      
                                                                                
      ANT_GANGER = 3;                                                           
      CALL SEND_BLANKLINJE(ANT_GANGER);                                         
      FS_SIDE = 1 ;                                                             
                                                                                
  END SEND_HEADING;                                                             
                                                                                
  SEND_BLANKLINJE:  PROC(BI);                                                   
                                                                                
   DCL BLANKLINJE       CHAR(78);                                               
   DCL BI    PIC '99';                                                          
   DCL BJ    PIC '99';                                                          
                                                                                
       DO BJ = 1 TO BI;                                                         
                                                                                
       BLANKLINJE = '                                        ' !!               
                    '                                      ';                   
       EXEC CICS SEND TEXT FROM(BLANKLINJE)  ACCUM PAGING L80                   
                                        PRINT  ERASE;                           
       END;                                                                     
  END SEND_BLANKLINJE;                                                          
                                                                                
  SEND_UTLINJE: PROC(SLINJE);                                                   
                                                                                
   DCL  SLINJE CHAR(78);                                                        
                                                                                
        EXEC CICS SEND TEXT FROM(SLINJE)  ACCUM PAGING L80                      
                                               PRINT  ERASE;                    
                                                                                
        SLINJE = BLK_LINJE;                                                     
                                                                                
  END SEND_UTLINJE;                                                             
                                                                                
                                                                                
  P99_DATOREVERSE:  PROC;                                                       
                                                                                
        WMNDÅR_DEF.WÅR     =  WÅRMND_DEF.WÅR;                                   
        WMNDÅR_DEF.WMND    =  WÅRMND_DEF.WMND;                                  
        WMNDÅR_DEF.WDD      =  WÅRMND_DEF.WDD  ;                                
                                                                                
  END P99_DATOREVERSE;                                                          
                                                                                
                                                                                
 /*******      KALKULASJON AV P-POENG  *********************/                   
  P0301_INNTEKTS_P_POENG: PROC;                                                 
                                                                                
                                                                                
                                                                                
  /*   IF NESTE_ÅR ^= W01_PINT_UT.W02_PI_ÅR THEN                                
          DO;                                                 */                
             /* SETTE INN I HJELPEVARIABLE FOR Å HENTE POENG  */                
             FIXED_DEC9 = B01.PINNTEKT.PI(IX,IÅR); /* * 100;JFA */              
             FIXED_BIN15 = IÅR;                                                 
             FIXED_DEC3 = 0;                                                    
             MAX_UFGO = 0;                                                      
                                                                                
             CALL MAX_UFG (IÅR,FIXED_DEC3,MAX_UFGO);                            
                                                                                
                                                                                
             FIXED_DEC5_4 = F_INNTEKT_POENG(FIXED_DEC9,FIXED_BIN15,             
                            GV_TAB_ARRAY.G_V(IÅR),FIXED_DEC3);                  
                                                                                
             FIXED_DEC5_4 = FIXED_DEC5_4 + 0.005;     /* FORHØYNING */          
             W01_P_POENG  = FIXED_DEC5_4;                                       
                                                                                
     /*   END;        */                                                        
                                                                                
                                                                                
                                                                                
   END P0301_INNTEKTS_P_POENG;                                                  
                                                                                
                                                                                
                                                                                
                                                                                
   MAX_UFG:                                                                     
     PROC(INNT_ÅR,UFG_TIL_POENG,MAX_UFGX);                                      
       DCL                                                                      
         INNT_ÅR       PIC'99'  UNAL,                                           
         MAX_UFGX      PIC'ZZZ' UNAL,                                           
         UFG_TIL_POENG FIXED DEC(3),                                            
         UFT_ÅMD       PIC'(8)9',                                               
         OPPH_ÅMD      PIC'(8)9',                                               
         UFT_Å         PIC'(4)9' DEF UFT_ÅMD POS(1),                            
         UFT_M         PIC'(2)9' DEF UFT_ÅMD POS(5),                            
         OPPH_Å        PIC'(4)9' DEF OPPH_ÅMD POS(1),                           
         OPPH_M        PIC'(2)9' DEF OPPH_ÅMD POS(5);/*30.10.85 HL*/            
                                                                                
       MAX_UFGX      = 0;                                                       
       UFG_TIL_POENG = 999;                                                     
                                                                                
       DO INDEX_1 = 1 TO 5 WHILE(B01.UFØRHIST.UFT_ÅMD                           
                                (IX,INDEX_1) > 0);                              
         UFT_ÅMD = B01.UFØRHIST.UFT_ÅMD       (IX,INDEX_1);                     
         OPPH_ÅMD = B01.UFØRHIST.OPPHØRSDATO_ÅMD(IX,INDEX_1);                   
                                                                                
 /* ENDRING 30.10.85 HL - FEILRAPP 267                             */           
                                                                                
            IF OPPH_M = 1          THEN                                         
               OPPH_Å = OPPH_Å - 1;                                             
                                                                                
 /* HIT 30.10.85                                                   */           
                                                                                
         IF UFT_Å = INNT_ÅR ! INNT_ÅR = OPPH_Å THEN                             
            UFG_TIL_POENG = 0;                                                  
                                                                                
         IF (UFT_Å <= INNT_ÅR) & (OPPH_Å = 0 ! INNT_ÅR <= OPPH_Å) THEN          
                                                                                
           DO;                                                                  
             IF MAX_UFGX < B01.UFØRHIST.UFG(IX,INDEX_1) THEN                    
               MAX_UFGX = B01.UFØRHIST.UFG(IX,INDEX_1);                         
             DO INDEX_2 = 1 TO 5 WHILE(B01.UFØRHIST.UFØRGRAD.                   
                          UFG_DATO_ÅMD(IX,INDEX_1,INDEX_2) > 0);                
               UFT_ÅMD = B01.UFØRHIST.UFØRGRAD.UFG_DATO_ÅMD                     
                                     (IX,INDEX_1,INDEX_2);                      
                                                                                
               IF UFT_Å < INNT_ÅR              !                                
                (UFT_M = 1 & UFT_Å = INNT_ÅR)  !                                
                (UFT_Å = INNT_ÅR & B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE             
                         (IX,INDEX_1,INDEX_2) > MAX_UFGX) THEN                  
                MAX_UFGX = B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE                     
                                   (IX,INDEX_1,INDEX_2);                        
             END;                                                               
           END;                                                                 
       END;                                                                     
                                                                                
       IF  UFG_TIL_POENG = 999 THEN                                             
           UFG_TIL_POENG = MAX_UFGX;                                            
                                                                                
   END MAX_UFG;                                                                 
                                                                                
                                                                                
   /****************** F_INNTEKT_POENG *************************/               
  F_INNTEKT_POENG:                                                              
    PROC(INNTEKT,ÅR,GV,UFG) RETURNS(FIXED DEC(5,4));                            
 %SKIP(2);                                                                      
    DCL                                                                         
       INNTEKT       FIXED DEC(9),                                              
       ÅR            FIXED BIN(15),                                             
       GV            FIXED DEC(5),                                              
       UFG           FIXED DEC(3),                                              
       W_INNTEKT     FIXED DEC(9)   INIT(0),                                    
       INNTEKT_POENG FIXED DEC(5,4) INIT(0),                                    
       W_POENG       FIXED DEC(5,3) INIT(0);                                    
 %PAGE;                                                                         
  IF ÅR    > 70 THEN                                                            
     DO;                                                                        
 /* NYE REGLER FOR OPPTJENING FRA INNTEKTSÅRET 1992. MAX 7 OSV.       */        
 /* VAR GLEMT HER. TRUDE 03.01.94                                     */        
                                                                                
     IF ÅR > 91 THEN                                                            
        DO;                                                                     
 /*    NÅR INNTEKTSÅRET ER ETTER 1991, ER HØYESTE AKTUELLE INNTEKT 12 */        
 /*    GANGER VEIET GRUNNBELØP, MEN FOR DEN DELEN AV INNTEKTEN SOM    */        
 /*    OVERSTIGER 6 GANGER VEIET GRUNNBELØP BLIR EN BARE GODSKREVET   */        
 /*    EN TREDJEDEL. HØYESTE POENG BLIR DA 7.00                       */        
 /*                                                                   */        
           IF INNTEKT > (GV * 12) THEN                                          
              W_INNTEKT = GV * 12;                                              
           ELSE                                                                 
             W_INNTEKT = INNTEKT;                                               
                                                                                
           IF W_INNTEKT > (GV * 6) THEN                                         
                                                                                
           W_INNTEKT = (GV * 6) + ((INNTEKT - (GV * 6)) / 3) + 0.5;             
                                                                                
           W_POENG = (W_INNTEKT - (GV * (100 - UFG) / 100)) / GV;               
                                                                                
           IF W_POENG < 0    THEN                                               
              W_POENG = 0;                                                      
           IF W_POENG > 7.00 THEN                                               
              INNTEKT_POENG = 7.00;                                             
           ELSE                                                                 
              INNTEKT_POENG = W_POENG;                                          
        END;                                                                    
     ELSE                                                                       
        DO; /*HL0196*/                                                          
                                     /* 1992 REGLER HIT TRUDE 030194  */        
                                                                                
 /*                                                                   */        
 /*    NÅR INNTEKTSÅRET ER ETTER 1970, ER HØYESTE AKTUELLE INNTEKT 12 */        
 /*    GANGER VEIET GRUNNBELØP, MEN FOR DEN DELEN AV INNTEKTEN SOM    */        
 /*    OVERSTIGER 8 GANGER VEIET GRUNNBELØP BLIR EN BARE GODSKREVET   */        
 /*    EN TREDJEDEL. HØYESTE POENG BLIR DA 8,33                       */        
 /*                                                                   */        
       IF INNTEKT > (GV * 12) THEN                                              
          W_INNTEKT = GV * 12;                                                  
       ELSE                                                                     
         W_INNTEKT = INNTEKT;                                                   
                                                                                
       IF W_INNTEKT > (GV * 8) THEN                                             
                                                                                
 /* ENDRET 23.10.85 HL : AVRUNDING ER LAGT INN I W_INNTEKT :       */           
                                                                                
          W_INNTEKT = (GV * 8) + ((INNTEKT - (GV * 8)) / 3) + 0.5;              
                                                                                
       W_POENG = (W_INNTEKT - (GV * (100 - UFG) / 100)) / GV;                   
                                                                                
       IF W_POENG < 0    THEN                                                   
          W_POENG = 0;                                                          
       IF W_POENG > 8.33 THEN                                                   
          INNTEKT_POENG = 8.33;                                                 
       ELSE                                                                     
          INNTEKT_POENG = W_POENG;                                              
     END;                                                                       
     END;                                                                       
  ELSE                                                                          
     DO;                                                                        
 /*                                                                   */        
 /*    NÅR INNTEKTSÅRET ER FØR 1971 ER HØYESTE AKTUELLE INNTEKT 8     */        
 /*    GANGER VEIET GRUNNBELØP, HØESTE POENG BLIR DA 7,00             */        
 /*                                                                   */        
       W_POENG = (INNTEKT - (GV * (100 - UFG) / 100)) / GV;                     
       IF W_POENG < 0    THEN                                                   
          W_POENG = 0;                                                          
       IF W_POENG > 7.00 THEN                                                   
          INNTEKT_POENG = 7.00;                                                 
       ELSE                                                                     
          INNTEKT_POENG = W_POENG;                                              
     END;                                                                       
  RETURN(INNTEKT_POENG);                                                        
 %SKIP(2);                                                                      
  END F_INNTEKT_POENG;                                                          
                                                                                
                                                                                
     %INCLUDE R0019904;     /*   F_GYLDIG_FNR                    */             
     %INCLUDE R0019910;     /*   F_NUMERISK                      */             
     %INCLUDE R0019956;     /*   P9956_BER_G_CICS                */             
   /* %INCLUDE R0019958;    /*   P-9958_BEH_STRYK_REG(BEH;FAN;ÅR */             
     %INCLUDE  R0019998;   /* ATK FEIL_MELD                      */             
     %INCLUDE  R0019999;   /* ATK KONTROLL                       */             
                                                                                
 END R001043;                                                                   
                                                                                
                                                                                
