 /*       SIST ENDRET 08/05-91 13.23.23 AV   DYBVIK                   */00000000
  /* ***************************************************************  */00000010
  /*IDENTIFIKASJON:                                                   */00000020
  /*    R001TK46 - INTERN PROSEDYRE I PLI/CICS.                       */00000030
  /*    PROGRAMMERER:  TUYEN FEB 91.                                  */00000040
  /*HENSIKT:                                                          */00000050
  /*    PROSEDYREN BLIR OPPKALT FRA OVERFØR_TIL_MAP PROSEDYRENE.      */00000060
  /*    DEN SETTER INN AKTUELLE FEILMELDINGER PÅ MELDINGSFELTENE TIL  */00000070
  /*    MAPENE VIA LINK TIL R0019921 SOM GÅR INN I FEILMELDINGSBASEN. */00000080
  /*PROGRAMTILKNYTNING:                                               */00000090
  /*    PROSEDYREN INKLUDERES I DIALOG-PROGRAMMENE.                   */00000100
  /*BRUK:                                                             */00000110
  /*    CALL SKRIV_FEIL(FEILNR)                                       */00000120
  /*                                                                  */00000130
  /* ***************************************************************  */00000140
  % PAGE;                                                               00000150
     SKRIV_FEIL:                                                        00000160
       PROC (FEILNR);                                                   00000170
       DCL                                                              00000180
          FEILNR UNAL FIXED DEC (5),                                    00000190
          1 FEIL_STRUC,                                                 00000200
            2 FEIL_NR          FIXED DEC(5),                            00000210
            2 FEIL_MELDING     CHAR(78),                                00000220
            2 KOM_OMR_PEKER    POINTER;                                 00000230
                                                                        00000240
       IF FEIL_MELD_NR > 0 THEN                                         00000250
         DO;                                                            00000260
           S001017O.MELDING1O = 'PROGRAM ' !! PROGRAM_ID !!             00000270
                       ' GÅR I FEIL VED LABEL NR. '           !!        00000280
                       FEIL_VED_LABEL;                                  00000290
           ANT_FEIL_SKREVET = 2;                                        00000300
         END;                                                           00000310
                                                                        00000320
      IF ANT_FEIL_SKREVET < 7 THEN                                      00000330
         DO;                                                            00000340
           KOM_OMR_PEKER = COMMAREA_PEKER;                              00000350
           FEIL_NR       = FEILNR;                                      00000360
           EXEC CICS LINK PROGRAM('R0019921') COMMAREA(FEIL_STRUC);     00000370
                                                                        00000380
           ANT_FEIL_SKREVET = ANT_FEIL_SKREVET + 1;                     00000390
           IF ANT_FEIL_SKREVET = 1 THEN                                 00000400
              S001017O.MELDING1O = FEIL_MELDING;                        00000410
           ELSE                                                         00000420
              IF ANT_FEIL_SKREVET = 2 THEN                              00000430
                 S001017O.MELDING2O = FEIL_MELDING;                     00000440
              ELSE                                                      00000450
                 IF ANT_FEIL_SKREVET = 3 THEN                           00000460
                    S001017O.MELDING3O = FEIL_MELDING;                  00000470
                 ELSE                                                   00000480
                    IF ANT_FEIL_SKREVET = 4 THEN                        00000490
                       S001017O.MELDING4O = FEIL_MELDING;               00000500
                    ELSE                                                00000510
                       IF ANT_FEIL_SKREVET = 5 THEN                     00000520
                          S001017O.MELDING5O = FEIL_MELDING;            00000530
         END;                                                           00000540
       END SKRIV_FEIL;                                                  00000550
