 /*   SIST ENDRET PÅ PROD   2000.02.18 13.04.45 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.12.10  8.36.46 AV   JDA7339          */        
 /*       SIST ENDRET 28/08-98 15.58.32 AV   SPA7339                  */        
 /*       SIST ENDRET 17/06-98 14.40.31 AV   HLA7339                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R001NN14  UNDERPROGRAM SOM BRUKES AV R001NO10.   */        
 /*                            KONTROLL B6-BLANKETT.                  */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : TRUDE SPONBERG                                   */        
 /*  PROGRAMMET BLE LAGET : NOV 1990                                  */        
 /*  ENDRINGERSDATO :                                                 */        
 /*  ENDRINGEN GJELDER:                                               */        
 /*  ENDRINGEN BLE UTFØRT AV :                                        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*BRUK:                                                              */        
 /* ********                                                          */        
 /*                                                                   */        
 /*  %INCLUDE R001NN14                                                */        
 /*                                                                   */        
 /*  INCLUDE PÅ FØLGENDE PROSEDYRER :                                 */        
 /*                                                                   */        
 /*    R001NB02   BLANK B6 TRANSOMR                                   */        
 /*    R001NB03   KONTR B6                                            */        
 /*    FUNKSJONER SOM BRUKES ER INKLUDERT I HOVEDPROGRAMMET.          */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*                                                                   */        
 /*  PROSEDYREN BLANKER TRANSOMRÅDE FOR B6 OG FLYTTER DERETTER        */        
 /*  VERDIER FRA OVERFØRT RECORD TIL TRANSOMRÅDET.  TRANSEN BLIR      */        
 /*  KONTROLLERT.  DERSOM DET BLIR FUNNET FEIL, BLIR FEILMELDINGS-    */        
 /*  NUMRE TATT VARE PÅ.                                              */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 P111_BEHANDLE_B6: PROC;                                                        
                                                                                
                                                                                
 %INCLUDE P001NB01;                               /* TRANSOMR B6 */             
                                                                                
                                                                                
          CALL BLANK_B6_BARN;                            /* R001NB02 */         
          CALL BLANK_B6_AVD;                             /* R001NB02 */         
          CALL BLANK_B6_GEN;                             /* R001NB02 */         
          CALL BLANK_B6_MELDNR;                          /* R001NB02 */         
          CALL OVERFØR_B6;                                                      
          CALL KONTROLL_ETTERLATTE_BARN_EN(FEIL_FUNNET); /* R001NB03 */         
                                                                                
          IF FEIL_FUNNET THEN                                                   
             CALL FINN_FEIL_B6;                                                 
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*   PROSEDYRE FOR Å OVERFØRE FELT FRA INPUT_RECORD                  */        
 /*   TIL B6_TRANS_OMR I KOM_OMR FOR B6_BARN.                         */        
 /* ***************************************************************** */        
 OVERFØR_B6:                                                                    
    PROC;                                                                       
                                                                                
      DCL HJELPEDATO    PIC '(8)9';                                             
                                                                                
          B6B.REGDATO_ÅMD         = BLANKETT_RECORD.TRANS_DATO_ÅMD;             
          B6B.TERMID              = DIV_PARAM_OMR.TERMINAL_NR;                  
                                                                                
          DO I = 1 TO 5 WHILE(F_FELT_PIC_CHAR11                                 
                             (B6_BLANKETT.FNR_BARN(I))^= (11)' ');              
             B6B.TAB.FNR_BARN(I)  = B6_BLANKETT.FNR_BARN(I);                    
             B6B.TAB.NAVN_BARN(I) = B6_BLANKETT.NAVN_BARN(I);                   
             B6B.TAB.TKNR(I)      = B6_BLANKETT.TKNR_BARN(I);                   
          END;                                                                  
                                                                                
          B6B.SPRÅK               = B6_BLANKETT.SPRÅK;                          
          B6B.KT                  = B6_BLANKETT.KOMP_TILLEGG;                   
          HJELPEDATO              = B6_BLANKETT.VIRK_DATO_ÅMD / 100;            
          B6B.VIRK_DATO_ÅMD       = HJELPEDATO * 100;                           
          B6B.FNR_DØD             = B6_BLANKETT.FNR_AVD;                        
          B6B.NAVN_DØD            = B6_BLANKETT.NAVN_AVD;                       
          B6B.DØDSDATO_ÅMD        = B6_BLANKETT.DØDSDATO_ÅMD;                   
                                                                                
                                                                                
    END OVERFØR_B6;                                                             
                                                                                
                                                                                
 /* ***************************************************************** */        
 /*   PROSEDYRE FOR Å FINNE OG TA VARE PÅ FEIL_MELD_NR NÅR DET ER     */        
 /*   FEIL I DEN OVERFØRTE RECORDEN.                                  */        
 /* ***************************************************************** */        
 FINN_FEIL_B6:PROC;                                                             
                                                                                
                                                                                
          FEIL_IND = 1;                                                         
                                                                                
          DO I = 1 TO 10;                                                       
                                                                                
             IF B6B.TAB.FNR_BARNNR(I) ^= 0   &                                  
                B6B.TAB.FNR_BARNNR(I) ^= 999 THEN                               
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = B6B.TAB.FNR_BARNNR(I);               
                   IF FEIL_IND ^= 3            THEN                             
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
             IF B6B.TAB.NAVN_BARNNR(I) ^= 0   &                                 
                B6B.TAB.NAVN_BARNNR(I) ^= 999 THEN                              
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = B6B.TAB.NAVN_BARNNR(I);              
                   IF FEIL_IND ^= 3            THEN                             
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
             IF B6B.TAB.TKNRNR(I) ^= 0       &                                  
                B6B.TAB.TKNRNR(I) ^= 999     THEN                               
                DO;                                                             
                   W01_FEIL_NR(FEIL_IND) = B6B.TAB.TKNRNR(I);                   
                   IF FEIL_IND ^= 3            THEN                             
                      FEIL_IND  = FEIL_IND + 1;                                 
                END;                                                            
                                                                                
          END;                                                                  
                                                                                
          IF B6B.SPRÅKNR ^= 0   &                                               
             B6B.SPRÅKNR ^= 999 THEN                                            
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = B6B.SPRÅKNR;                            
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF B6B.KTNR ^= 0   &                                                  
             B6B.KTNR ^= 999 THEN                                               
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = B6B.KTNR;                               
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF B6B.VIRK_DATO_ÅMDNR ^= 0  &                                        
             B6B.VIRK_DATO_ÅMDNR ^= 999 THEN                                    
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = B6B.VIRK_DATO_ÅMDNR;                    
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF B6B.FNR_DØDNR ^= 0   &                                             
             B6B.FNR_DØDNR ^= 999 THEN                                          
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = B6B.FNR_DØDNR;                          
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF B6B.NAVN_DØDNR ^= 0   &                                            
             B6B.NAVN_DØDNR ^= 999 THEN                                         
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = B6B.NAVN_DØDNR;                         
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
          IF B6B.DØDSDATO_ÅMDNR ^= 0 &                                          
             B6B.DØDSDATO_ÅMDNR ^= 999 THEN                                     
             DO;                                                                
                W01_FEIL_NR(FEIL_IND) = B6B.DØDSDATO_ÅMDNR;                     
                IF FEIL_IND ^= 3            THEN                                
                   FEIL_IND  = FEIL_IND + 1;                                    
             END;                                                               
                                                                                
                                                                                
    END FINN_FEIL_B6;                                                           
                                                                                
                                                                                
 %PAGE;                                                                         
 /* ***************************************************************** */        
 /*          E K S T E R N E    P R O C E D U R E R                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 %PAGE;                                                                         
 %INCLUDE R001NB02;          /*     BLANK B6 TRANSOMR   */                      
 %PAGE;                                                                         
 %INCLUDE R001NB03;          /*     KONTR B6 SØKER      */                      
                                                                                
                                                                                
 END P111_BEHANDLE_B6;                                                          
                                                                                
                                                                                
