 /*   SIST ENDRET PÅ PROD   2002.04.19 12.44.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.02.18 14.14.38 AV   SPA7339          */        
 /*   SIST ENDRET PÅ PROD   1999.11.05 12.16.09 AV   JDA7339          */        
 /*       SIST ENDRET 07/08-98 08.40.58 AV   TSB7339                  */        
 /*       SIST ENDRET 04/05-98 14.25.54 AV   JDA7339                  */        
 /*       SIST ENDRET 14/01-98 15.19.09 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /*       R 0 0 1 0 4 9 0                                             */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R0010490 - VENTETRANS SKRIVES UT PÅ VENTE-       */        
 /*                             TRANSBASEN - HOVEDPROGRAM             */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : ROLF FARVIK,DATA-UTVIKLING A/S                   */        
 /*  PROGRAMMET BLE LAGET : APRIL 1983                                */        
 /*  ENDRINGEN BLE UTFØRT AV : SL                                     */        
 /*  ENDRINGSDATO : 13.10.89                                          */        
 /*  ENDRINGEN GJELDER: UNGE UFØRE FØR 1967                           */        
 /*  ENDRINGEN BLE UTFØRT AV : TRUDE                                  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*  PROGRAMMET SKRIVER NY OG ENDRET TRANS TIL VENTEDATABASEN.        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*  PROGRAMMET BLIR AKTIVISERT VIA CICS FRA FORSKJELLIGE PROGRAM     */        
 /*  SLIK:                                                            */        
 /*    EXEC CICS LINK PROGRAM('R0010490') COOMAREA(KOM_OMR);          */        
 /*  PROGRAMMET INKLUDERER:                                           */        
 /*    R0015305   -   P50_SKRIV_AP_TRANS (TIL VENTEBASEN)             */        
 /*    R00153N5   -   P50_SKRIV_A1_TRANS (TIL VENTEBASEN)             */        
 /*    R0015306   -   P60_SKRIV_UP_TRANS (TIL VENTEBASEN)             */        
 /*    R00153N6   -   P60_SKRIV_U2_TRANS (TIL VENTEBASEN)             */        
 /*    R00153U6   -   P60_SKRIV_U3_TRANS (TIL VENTEBASEN)             */        
 /*    R0015307   -   P70_SKRIV_US_TRANS (TIL VENTEBASEN)             */        
 /*    R0015308   -   P80_SKRIV_EP_TRANS (TIL VENTEBASEN)             */        
 /*    R0015309   -   P90_SKRIV_EF_TRANS (TIL VENTEBASEN)             */        
 /*    R00153N9   -   P90_SKRIV_E4_TRANS (TIL VENTEBASEN)             */        
 /*    R0015310   -   P100_SKRIV_FB_TRANS (TIL VENTEBASEN)            */        
 /*    R00153NA   -   P100_SKRIV_F5_TRANS (TIL VENTEBASEN)            */        
 /*    R0015311   -   P110_SKRIV_BP_TRANS (TIL VENTEBASEN)            */        
 /*    R00153NB   -   P110_SKRIV_B6_TRANS (TIL VENTEBASEN)            */        
 /*    R0015312   -   P120_SKRIV_FT_TRANS (TIL VENTEBASEN)            */        
 /*    R00153NC   -   P120_SKRIV_F7_TRANS (TIL VENTEBASEN)            */        
 /*    R00153UC   -   P120_SKRIV_FO_TRANS (TIL VENTEBASEN)            */        
 /*    R0015314   -   P140_SKRIV_E1_TRANS (TIL VENTEBASEN)            */        
 /*    R00153UE   -   P140_SKRIV_EN_TRANS (TIL VENTEBASEN)            */        
 /*    R0015316   -   P160_SKRIV_O1_TRANS (TIL VENTEBASEN)            */        
 /*    R0015317   -   P170_SKRIV_O2_TRANS (TIL VENTEBASEN)            */        
 /*    R0015319   -   P190_SKRIV_AF_TRANS (TIL VENTEBASEN)            */        
 /*    R00153UJ   -   P190_SKRIV_KF_TRANS (TIL VENTEBASEN)            */        
 /*    R0015320   -   P183_SKRIV_UF_TRANS (TIL VENTEBASEN) UF!!!      */        
 /*    R0019913   -   SNU DATO (IKKE I BRUK I DETTE PROGRAMMET)       */        
 /*  INTERNE PROCEDURER:                                              */        
 /*    P001_SKRIV_ROT_AP   - DANNER OG SKRIVER ROTSEGM.OPPLYSNINGER   */        
 /*    P001_SKRIV_ROT_AF   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_KF   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_UP   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_U2   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_U3   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_US   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_EP   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_EF   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_E4   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_FB   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_F5   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_BP   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_B6   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_FT   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_F7   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_FO   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_E1   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_EN   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_O1   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_O2   -      -----------''----------------       */        
 /*    P001_SKRIV_ROT_UF   -      -----------''----------------   UF! */        
 /*    DATABASE            - ÅPNER OG CLOSER DATABASEN                */        
 /*    P010_SKRIV_TRANSHIST         - CALLES I UNDERLIGGENDE PROGRAM  */        
 /*    P020_SKRIV_BARN_AV_TRANSHIST - --------''--------------------  */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*  VENTETRANSBASEN BLIR OPPDATERT MED NYE OG ENDREDE TRANSER        */        
 /*                                                                   */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /* PROGRAMMET SKRIVER FEILMELDINGER PÅ SKJERMEN VED:                 */        
 /*   BACKOUT BLIR FORETATT I.F.M. MELDINGUTSKRIVING.                 */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
                                                                                
                                                                                
                                                                                
  R001049 : PROC (COMMAREA_PEKER) OPTIONS  (MAIN);                              
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0012001;                      /*  TRANS_SEGM_OMR (B) */             
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019906;                      /*   TRANS_OPPL_OMR (B) */            
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019908;                      /*   KOM_OMR        (B) */            
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019910;                      /*   STYRINGS_OMR   (B) */            
                                                                                
  %PAGE;                                                                        
  %INCLUDE S00101  ;                      /*   MENYMAPSET     (B) */            
                                                                                
  %PAGE;                                                                        
  DCL                                                                           
      1    TRANS_LISTE_OMR (5)  UNALIGNED  BASED (TRANS_LISTE_PEKER),           
  %INCLUDE P0019911;                      /*  TRANS_LISTE_OMR(B)  */            
                                                                                
  %PAGE;                                                                        
  %INCLUDE P0019912;                      /*   DIV_PARAM_OMR  (B) */            
  DCL                                                                           
      BMSMAPBR  PTR;                                                            
                                                                                
   DCL                                                                          
       MAP_MELDING              CHAR(78)      INIT((78)' '),                    
       1  FEIL_STRUC,                                                           
          2  FEIL_NR               FIXED DEC(5),                                
          2  FEIL_MELDING          CHAR     (78),                               
          2  FEIL_MELDNR           PIC '9',                                     
          2  KOM_OMR_PEKER         POINTER;                                     
  %PAGE;                                                                        
  /* **************************************************************** */        
  /*     INNEBYGDE PLI-FUNKSJONER  + PEKER-DEF.                       */        
  /* **************************************************************** */        
                                                                                
     DCL                                                                        
       ( ADDR , LOW , CSTG , DATE , SUBSTR , STG , NULL)      BUILTIN;          
                                                                                
     DCL                                                                        
       PLITDLI ENTRY;                                                           
                                                                                
     DCL                                                                        
         ( COMMAREA_PEKER   , W001_HJELPE_PEKER , TRANS_SEGM_PEKER ,            
           W001_TRANS_PEKER , W001_TRANS_OPPL_PEKER,W01_HJELPE_PTR )            
                                   POINTER;                                     
                                                                                
  /* **************************************************************** */        
  /*     ARBEIDSFELTER SOM BRUKES AV UIB OG PCB  .                    */        
  /* **************************************************************** */        
                                                                                
  %INCLUDE DLIUIB;                                                              
                                                                                
     DCL                                                                        
         UIB_RC_OK                 BIT (8)       INIT( 0 );                     
                                                                                
  %INCLUDE  P0012002;                  /* UIB_PCB_PEKER_OMR (BASED)   */        
                                                                                
     DCL  1 VT1                    BASED (VT1_PCB_PEKER),                       
  %INCLUDE  P0012003;                  /* PCB    (BASED)             */         
                                                                                
  /* **************************************************************** */        
  /*     ROTSEGMENTOMRÅDE.                                            */        
  /* **************************************************************** */        
                                                                                
     DCL 1  ROTSEGM,                                                            
            2   FNR                DEC FIXED (11) ,                             
            2   NAVN               CHAR      (25) ,                             
            2   TKNR               DEC FIXED  (5) ,                             
            2   SPRÅK              CHAR       (1) ,                             
            2   AI                 DEC FIXED  (5) ,                             
            2   SPERRE             CHAR       (1) ;                             
                                                                                
  /* **************************************************************** */        
  /*     OPPTELLINGS- OG LOOP-PARAMETRE M.M                           */        
  /* **************************************************************** */        
                                                                                
     DCL 1  W001_OPPTELL_OMR,                                                   
            2   I                  FIXED    BIN   (15)   INIT ( 0 ),            
            2   J                  FIXED    BIN   (15)   INIT ( 0 ),            
            2   B                           CHAR  (1)    INIT (' ');            
                                                                                
     DCL    W001_TERMID                     CHAR  ( 4 ),                        
            W001_DATO                       CHAR  ( 8 )  INIT ((8)' '),         
            W001_REG_DATO  DEF W001_DATO    PIC   '(8)9';                       
                                                                                
     DCL  LOKAL_MELD_NO              PIC '999' INIT (0);                        
                                                                                
  /* **************************************************************** */        
  /*     DLI CALL-PARAMETRE                                           */        
  /* **************************************************************** */        
                                                                                
     DCL 1  W001_DLI               UNALIGNED,                                   
            2   FUNC               CHAR     (4)   INIT('    '),                 
            2   GHU                CHAR     (4)   INIT('GHU '),                 
            2   DLET               CHAR     (4)   INIT('DLET'),                 
            2   REPL               CHAR     (4)   INIT('REPL'),                 
            2   ISRT               CHAR     (4)   INIT('ISRT'),                 
            2   PARM_CT_1          FIXED BIN(31)  INIT(1),                      
            2   PARM_CT_2          FIXED BIN(31)  INIT(2),                      
            2   PARM_CT_3          FIXED BIN(31)  INIT(3),                      
            2   PARM_CT_4          FIXED BIN(31)  INIT(4),                      
            2   PARM_CT_5          FIXED BIN(31)  INIT(5),                      
            2   PARM_CT_6          FIXED BIN(31)  INIT(6),                      
            2   PARM_CT_7          FIXED BIN(31)  INIT(7),                      
            2   OUT2               CHAR     (20)  INIT                          
                        ('                    ');                               
                                                                                
  %PAGE;                                                                        
  /* **************************************************************** */        
  /*     DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
  /* **************************************************************** */        
                                                                                
     DCL    SSA_UQUAL              STATIC        CHAR (9)  INIT((9)' ');        
                                                                                
     DCL 1  SSA1_VT0PERSN          UNALIGNED,                                   
            2    HDEL                            CHAR (17) INIT                 
                 ('VT0PERSN(FNR     '),                                         
            2    REL_OP                          CHAR (2)  INIT (' ='),         
            2    PKEY               FIXED        DEC  (11) INIT ( 0 ),          
            2    HP                              CHAR (1)  INIT (')');          
                                                                                
     DCL 1  SSA1_TRANHIST          UNALIGNED,                                   
            2    HDEL                            CHAR (17) INIT                 
                 ('TRANHIST(VTPBLKOD'),                                         
            2    REL_OP                          CHAR (2)  INIT (' ='),         
            2    VTP_KEY            FIXED        DEC  (8)  INIT ( 0 ),          
            2    GRBLKODE                        CHAR (2)  INIT ('  '),         
            2    HP                              CHAR (1)  INIT (')');          
                                                                                
     DCL    W001_IO               CHAR (340)  INIT (   ( 340 )  ' '  ),         
            W001_HJELPE_IO        CHAR (340)  BASED (W001_HJELPE_PEKER),        
            W01_HJELPE_IO         CHAR (2650) BASED (W01_HJELPE_PTR);           
                                                                                
  DCL SAVE_NAVN         CHAR (25);                                              
  DCL                                                                           
      ONKODE                     PIC'9999',                                     
      ONK             DEF ONKODE CHAR(4),                                       
      FEILKODE                   CHAR(4),                                       
      DSNAVN                     CHAR(8);                                       
  %PAGE;                                                                        
  /* **************************************************************** */        
  /*                                                                  */        
  /*        SLUTT PÅ DEKLARASJONENE , EKSEKVERINGEN STARTER .         */        
  /*       ---------------------------------------------------        */        
  /*                                                                  */        
  /*                                                                  */        
  /*        INITIERER VISSE DEFAULTVERDIER.                           */        
  /*                                                                  */        
  /* **************************************************************** */        
                                                                                
      ON ERROR SNAP BEGIN       ;                                               
         ON ERROR SYSTEM        ;                                               
         ONKODE=ONCODE          ;                                               
         FEILKODE   = ONK       ;                                               
         DSNAVN     = EIBDS     ;                                               
         GO TO FEILBEH          ;                                               
      END;                                                                      
                                                                                
    FEILKODE                                =   'FEIL'           ;              
    IF FEIL_MELD_NR = 0 THEN /* AB 01.08.16 */                                  
       PROGRAM_ID                              =   'R0010490'       ;           
       DSNAVN                                  =   '      '         ;           
       EXEC CICS HANDLE CONDITION ERROR(FEILBEH)                    ;           
       W001_TRANS_PEKER                        =    TRANS_PEKER     ;           
       W001_TRANS_OPPL_PEKER                   =    TRANS_OPPL_PEKER;           
                                                                                
    ALLOCATE         TRANS_SEGM_OMR                            ;                
    TRANS_SEGM_OMR                          =    ''            ;                
    W001_TERMID            =    DIV_PARAM_OMR.TERMINAL_NR ;                     
                                                                                
                                                                                
    IF FUNKSJONSKODE ^= 'E' &                                                   
       FUNKSJONSKODE ^= 'B' &    /* 'B' BLIR SATT I BLANKETTKONTRPGR*/          
       FUNKSJONSKODE ^= 'V' THEN                                                
       DO;                                                                      
          TRANS_OPPL_PEKER = ADDR (TRANS_LISTE_OMR.FAST_DEL (1))    ;           
          TRANS_PEKER      = ADDR (TRANS_LISTE_OMR.VARIABEL_DEL (1));           
          UIBPTR           = PCB_UIB_PEKER_OMR.UIB_PEKER;                       
       END;                                                                     
    ELSE                                                                        
       IF FUNKSJONSKODE = 'B' THEN                                              
          DO;                                                                   
                                                                                
             CALL DATABASE('OPEN');                                             
          END;                                                                  
       ELSE                                                                     
          IF FUNKSJONSKODE = 'E' THEN                                           
             UIBPTR           = PCB_UIB_PEKER_OMR.UIB_PEKER;                    
                                                                                
    SSA1_VT0PERSN.PKEY  = TRANS_OPPL_OMR.FØDSNUMMER;                            
    W001_REG_DATO       = DIV_PARAM_OMR.DATO_2000;                              
    ROTSEGM.AI          =    0  ;                                               
    ROTSEGM.SPERRE      =    ' ';                                               
    FEIL_MELD_NR        =    0  ;                                               
                                                                                
    SELECT   (TRANS_OPPL_OMR.BLANKETTYPE     );                                 
                                                                                
          WHEN ( 'AP' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB        */          
            /* **************************************************** */          
            DO;                                                                 
                                                                                
               CALL P001_SKRIV_ROT_AP;                                          
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R0015305 */                                                   
               CALL P050_SKRIV_AP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'A1' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER ALDERSPENSJONS-OPPLYSNINGER TIL DB        */          
            /* **************************************************** */          
            DO;                                                                 
                                                                                
               CALL P001_SKRIV_ROT_A1;                                          
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R00153N5 */                                                   
               CALL P050_SKRIV_A1_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'AF' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER OPPL OM AVTALEFESTET PENSJON TIL DB       */          
            /* **************************************************** */          
            DO;                                                                 
                                                                                
               CALL P001_SKRIV_ROT_AF;                                          
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R0015319 */                                                   
               CALL P190_SKRIV_AF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'KF' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER OPPL OM AVTALEFESTET PENSJON TIL DB       */          
            /* **************************************************** */          
                                                                                
            DO;                                                                 
                                                                                
               CALL P001_SKRIV_ROT_KF;                                          
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                                                                                
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R00153UJ */                                                   
                                                                                
               CALL P190_SKRIV_KF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                                                                                
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  TRANS                   */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'UP' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER UFØREPENSJONS-OPPLYSNINGER TIL DB         */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_UP;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R0015306 */                                                   
               CALL P060_SKRIV_UP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'U2' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER UFØREPENSJONS-OPPLYSNINGER TIL DB         */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_U2;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R00153N6 */                                                   
               CALL P060_SKRIV_U2_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'U3' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER UFØREPENSJONS-OPPLYSNINGER TIL DB         */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_U3;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /* R00153U6 */                                                   
               CALL P060_SKRIV_U3_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'UF' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER UF-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_UF;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R0015320 */                                                   
               CALL P183_SKRIV_UF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'US' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER US-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_US;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R0015307   */                                               
               CALL P070_SKRIV_US_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EP' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER EP-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_EP;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R0015308   */                                               
               CALL P080_SKRIV_EP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'E3' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER EP-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_E3;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R00153N8   */                                               
               CALL P080_SKRIV_E3_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EE' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER EP-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_EE;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R00153U8   */                                               
               CALL P080_SKRIV_EE_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EF' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER EF-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_EF;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R0015309   */                                               
               CALL P090_SKRIV_EF_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'E4' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER EF-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_E4;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R00153N9   */                                               
               CALL P090_SKRIV_E4_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'FB' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER FB-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_FB;                                          
                                                                                
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /*   R0015310   */                                               
               CALL P100_SKRIV_FB_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
                                                                                
          WHEN ( 'BP' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER BP-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_BP;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R0015311   */                                               
               CALL P110_SKRIV_BP_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'B6' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER BP-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_B6;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /*   R00153NB   */                                               
               CALL P110_SKRIV_B6_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'FT' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER FT-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_FT;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /* R0015312   */                                                 
               CALL P120_SKRIV_FT_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'F7' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER F7-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_F7;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /* R00153NC   */                                                 
               CALL P120_SKRIV_F7_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'FO' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER FO-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_FO;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
               /* R00153UC   */                                                 
               CALL P120_SKRIV_FO_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'E1' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER E1-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_E1;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /*   R0015314   */                                               
               CALL P140_SKRIV_E1_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'EN' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER EN-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_EN;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /*   R00153UE   */                                               
               CALL P140_SKRIV_EN_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'O1' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER O1-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_O1;                                          
                                                                                
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               CALL P160_SKRIV_O1_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          WHEN ( 'O2' )                                                         
            /* **************************************************** */          
            /*  OVERFØRER O2-OPPLYSNINGER TIL DB                    */          
            /* **************************************************** */          
            DO;                                                                 
               CALL P001_SKRIV_ROT_O2;                                          
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                                                                                
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV :  ROT                     */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
               /* R0015317   */                                                 
               CALL P170_SKRIV_O2_TRANS;                                        
                                                                                
               IF   FEIL_MELD_NR              >      0       THEN               
                 DO;                                                            
                    /* ******************************************** */          
                    /* FEIL VED SKRIV AV TRANS                      */          
                    /* ******************************************** */          
                                                                                
                    GO TO L999;                                                 
                 END;                                                           
            END;                                                                
                                                                                
          OTHERWISE                                                             
            /* **************************************************** */          
            /*  FÅTT EN UKJENT TRANS-TYPE . KJØRING AVBRYTES        */          
            /* **************************************************** */          
            DO;                                                                 
   L100:                                                                        
               FEIL_MELD_NR           =    498 ;                                
               FEIL_VED_LABEL         =   '100';                                
               GO TO L999;                                                      
            END;                                                                
                                                                                
    END;   /* *****      SELECT ( BLANKETTYPE )          ****** */              
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /* ************************************************************** */        
    /* ************************************************************** */        
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_AP:                                                          
      PROC ;                                                                    
               %INCLUDE P0010501;           /*** TRANS_OMRÅDE AP ***/           
               ROTSEGM.FNR    = APS.FNR;                                        
               ROTSEGM.NAVN   = APS.NAVN;                                       
               ROTSEGM.TKNR   = APS.TKNR;                                       
               ROTSEGM.SPRÅK  = APS.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_AP;                                                      
                                                                                
                                                                                
                                                                                
    P001_SKRIV_ROT_A1:                                                          
      PROC ;                                                                    
               %INCLUDE P001N501;           /*** TRANS_OMRÅDE AP ***/           
               ROTSEGM.FNR    = A1S.FNR;                                        
               ROTSEGM.NAVN   = A1S.NAVN;                                       
               ROTSEGM.TKNR   = A1S.TKNR;                                       
               ROTSEGM.SPRÅK  = A1S.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_A1;                                                      
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
         /* NY PROSEDYRE */                                                     
                                                                                
    P001_SKRIV_ROT_AF:                                                          
      PROC ;                                                                    
               %INCLUDE P0011901;           /*** TRANS_OMRÅDE AF ***/           
               ROTSEGM.FNR    = AFP.FNR;                                        
               ROTSEGM.NAVN   = AFP.NAVN;                                       
               ROTSEGM.TKNR   = AFP.TKNR;                                       
               ROTSEGM.SPRÅK  = AFP.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_AF;                                                      
                                                                                
                                                                                
    P001_SKRIV_ROT_KF:                                                          
      PROC ;                                                                    
               %INCLUDE P001UJ01;       /*   *** TRANS_OMRÅDE KF * */           
               ROTSEGM.FNR    = KFP.FNR;                                        
               ROTSEGM.NAVN   = KFP.NAVN;                                       
               ROTSEGM.TKNR   = KFP.TKNR;                                       
               ROTSEGM.SPRÅK  = KFP.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_KF;                                                      
                                                                                
         /* HIT          */                                                     
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_UP:                                                          
      PROC ;                                                                    
               %INCLUDE P0010601;            /*** TRANS_OMRÅDE UP  ***/         
               ROTSEGM.FNR    = UPS.FNR;                                        
               ROTSEGM.NAVN   = UPS.NAVN;                                       
               ROTSEGM.TKNR   = UPS.TKNR;                                       
               ROTSEGM.SPRÅK  = UPS.SPRÅK;                                      
                                                                                
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_UP;                                                      
                                                                                
    P001_SKRIV_ROT_U2:                                                          
      PROC ;                                                                    
               %INCLUDE P001N601;            /*** TRANS_OMRÅDE U2  ***/         
               ROTSEGM.FNR    = U2S.FNR;                                        
               ROTSEGM.NAVN   = U2S.NAVN;                                       
               ROTSEGM.TKNR   = U2S.TKNR;                                       
               ROTSEGM.SPRÅK  = U2S.SPRÅK;                                      
                                                                                
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_U2;                                                      
                                                                                
    P001_SKRIV_ROT_U3:                                                          
      PROC ;                                                                    
               %INCLUDE P001U601;            /*** TRANS_OMRÅDE U3  ***/         
               ROTSEGM.FNR    = U3S.FNR;                                        
               ROTSEGM.NAVN   = U3S.NAVN;                                       
               ROTSEGM.TKNR   = U3S.TKNR;                                       
               ROTSEGM.SPRÅK  = U3S.SPRÅK;                                      
                                                                                
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_U3;                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
        P001_SKRIV_ROT_UF:                                                      
         PROC ;                                                                 
               %INCLUDE P0011831;            /*** TRANS_OMRÅDE UF  ***/         
               ROTSEGM.FNR    = UFS.FNR;                                        
               ROTSEGM.NAVN   = (25)' ';                                        
               ROTSEGM.TKNR   = 0;                                              
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
        END P001_SKRIV_ROT_UF;                                                  
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_US:                                                          
      PROC ;                                                                    
               %INCLUDE P0010701;          /*** TRANS_OMRÅDE US   ***/          
               ROTSEGM.FNR    = USS.FNR;                                        
               ROTSEGM.TKNR   = USS.TKNR;                                       
               ROTSEGM.NAVN   = (25)' ';                                        
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_US;                                                      
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_EP:                                                          
      PROC ;                                                                    
               %INCLUDE P0010801;       /*** TRANS_OMRÅDE EP  ***/              
               ROTSEGM.FNR    = EPS.FNR;                                        
               ROTSEGM.NAVN   = EPS.NAVN;                                       
               ROTSEGM.TKNR   = EPS.TKNR;                                       
               ROTSEGM.SPRÅK  = EPS.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_EP;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_E3:                                                          
      PROC ;                                                                    
               %INCLUDE P001N801;       /*** TRANS_OMRÅDE E3  ***/              
               ROTSEGM.FNR    = E3S.FNR;                                        
               ROTSEGM.NAVN   = E3S.NAVN;                                       
               ROTSEGM.TKNR   = E3S.TKNR;                                       
               ROTSEGM.SPRÅK  = E3S.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_E3;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_EE:                                                          
      PROC ;                                                                    
               %INCLUDE P001U801;       /*** TRANS_OMRÅDE E3  ***/              
               ROTSEGM.FNR    = EES.FNR;                                        
               ROTSEGM.NAVN   = EES.NAVN;                                       
               ROTSEGM.TKNR   = EES.TKNR;                                       
               ROTSEGM.SPRÅK  = EES.SPRÅK;                                      
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_EE;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_EF:                                                          
      PROC ;                                                                    
               %INCLUDE P0010901;       /*** TRANS_OMRÅDE EF   ***/             
               ROTSEGM.FNR    = EFS.FNR;                                        
               ROTSEGM.NAVN   = EFS.NAVN;                                       
               ROTSEGM.TKNR   = EFS.TKNR;                                       
               ROTSEGM.SPRÅK  = EFS.SPRÅK;                                      
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_EF;                                                      
                                                                                
                                                                                
                                                                                
    P001_SKRIV_ROT_E4:                                                          
      PROC ;                                                                    
               %INCLUDE P001N901;       /*** TRANS_OMRÅDE EF   ***/             
               ROTSEGM.FNR    = E4S.FNR;                                        
               ROTSEGM.NAVN   = E4S.NAVN;                                       
               ROTSEGM.TKNR   = E4S.TKNR;                                       
               ROTSEGM.SPRÅK  = E4S.SPRÅK;                                      
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_E4;                                                      
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_FB:                                                          
      PROC ;                                                                    
               %INCLUDE P0011001;               /*** TRANS_OMRÅDE FB **/        
               ROTSEGM.FNR    = BARN.FNR_B(1);                                  
               ROTSEGM.NAVN   = BARN.NAVN_B(1);                                 
               ROTSEGM.TKNR   = BARN.TKNR(1);                                   
               ROTSEGM.SPRÅK  = BARN_GEN.SPRÅK;                                 
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_FB;                                                      
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_BP:                                                          
      PROC ;                                                                    
               %INCLUDE P0011101;     /*** TRANS_OMRÅDE BP   ***/               
               ROTSEGM.FNR    = BPB.TAB.FNR_BARN(1);                            
               ROTSEGM.NAVN   = BPB.TAB.NAVN_BARN(1);                           
               ROTSEGM.TKNR   = BPB.TAB.TKNR(1);                                
               ROTSEGM.SPRÅK  = BPB.SPRÅK;                                      
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_BP;                                                      
                                                                                
                                                                                
    P001_SKRIV_ROT_B6:                                                          
      PROC ;                                                                    
               %INCLUDE P001NB01;     /*** TRANS_OMRÅDE BP   ***/               
               ROTSEGM.FNR    = B6B.TAB.FNR_BARN(1);                            
               ROTSEGM.NAVN   = B6B.TAB.NAVN_BARN(1);                           
               ROTSEGM.TKNR   = B6B.TAB.TKNR(1);                                
               ROTSEGM.SPRÅK  = B6B.SPRÅK;                                      
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_B6;                                                      
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_FT:                                                          
      PROC ;                                                                    
               %INCLUDE P0011201;   /*** TRANS_OMRÅDE FT   ***/                 
               ROTSEGM.FNR    = FTS.FNR;                                        
               ROTSEGM.TKNR   = FTS.TKNR;                                       
               ROTSEGM.NAVN   = (25)' ';                                        
               ROTSEGM.SPRÅK  = ' ';                                            
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_FT;                                                      
                                                                                
    P001_SKRIV_ROT_F7:                                                          
      PROC ;                                                                    
               %INCLUDE P001NC01;   /*** TRANS_OMRÅDE F7   ***/                 
               ROTSEGM.FNR    = F7S.FNR;                                        
               ROTSEGM.TKNR   = F7S.TKNR;                                       
               ROTSEGM.NAVN   = (25)' ';                                        
               ROTSEGM.SPRÅK  = ' ';                                            
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_F7;                                                      
                                                                                
                                                                                
                                                                                
    P001_SKRIV_ROT_FO:                                                          
      PROC ;                                                                    
               %INCLUDE P001UC01;   /*** TRANS_OMRÅDE FO   ***/                 
               ROTSEGM.FNR    = FOS.FNR;                                        
               ROTSEGM.TKNR   = FOS.TKNR;                                       
               ROTSEGM.NAVN   = (25)' ';                                        
               ROTSEGM.SPRÅK  = ' ';                                            
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_FO;                                                      
                                                                                
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_E1:                                                          
      PROC ;                                                                    
               %INCLUDE P0011401;        /*** TRANS_OMRÅDE E1   ***/            
               ROTSEGM.FNR    = E1S.FNR;                                        
               ROTSEGM.NAVN   = E1S.NAVN_NYTT;                                  
               ROTSEGM.TKNR   = E1S.TKNR;                                       
               ROTSEGM.SPRÅK  = E1S.SPRÅK;                                      
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_E1;                                                      
                                                                                
                                                                                
    P001_SKRIV_ROT_EN:                                                          
      PROC ;                                                                    
               %INCLUDE P001UE01;        /*** TRANS_OMRÅDE EN   ***/            
               ROTSEGM.FNR    = ENS.FNR;                                        
               ROTSEGM.NAVN   = ENS.NAVN_NYTT;                                  
               ROTSEGM.TKNR   = ENS.TKNR;                                       
               ROTSEGM.SPRÅK  = ENS.SPRÅK;                                      
                                                                                
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_EN;                                                      
                                                                                
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_O1:                                                          
      PROC ;                                                                    
               %INCLUDE P0011601;   /*** TRANS_OMRÅDE O1   ***/                 
               ROTSEGM.FNR    = O1.FNR_DØD;                                     
               ROTSEGM.TKNR   = O1.TKNR_DØD;                                    
               ROTSEGM.SPRÅK  = ' ';                                            
               ROTSEGM.NAVN   = (25)' ';                                        
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_O1;                                                      
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LAGE ROT-SEGMENTOPPLYSNINGER.                 */         
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P001_SKRIV_ROT_O2:                                                          
      PROC ;                                                                    
               %INCLUDE P0011701;   /* TRANS_OMRÅDE O2 ***/                     
               ROTSEGM.FNR    = O2.FNR;                                         
               ROTSEGM.TKNR   = O2.TKNR;                                        
               ROTSEGM.SPRÅK  = ' ';                                            
               ROTSEGM.NAVN   = (25)' ';                                        
                                                                                
               CALL P005_SKRIV_ROT;                                             
                                                                                
                                                                                
    END P001_SKRIV_ROT_O2;                                                      
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LEGGE ROT-SEGMENTOPPLYSNINGER.                 */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P005_SKRIV_ROT:                                                             
      PROC ;                                                                    
                                                                                
                                                                                
      W001_HJELPE_PEKER                =     ADDR ( ROTSEGM  ) ;                
      W001_IO                          =     W001_HJELPE_IO    ;                
      SSA_UQUAL                        =     'VT0PERSN '       ;                
                                                                                
      CALL PLITDLI                          (W001_DLI.PARM_CT_4,                
                                             W001_DLI.ISRT,                     
                                             VT1,                               
                                             W001_IO,                           
                                             SSA_UQUAL);                        
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  ROTSEGMENT              */                   
           /* ******************************************** */                   
  L090:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '090';                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
      IF   VT1.STATUS_KODE             =   'II'    THEN                         
        DO;                                                                     
          /* ******************************************** */                    
          /* SAMME ROTSEGM  LIGGER INNE FRA FØR.          */                    
          /* REPL FORETAES.                               */                    
          /* ******************************************** */                    
                                                                                
          CALL PLITDLI                        (W001_DLI.PARM_CT_4,              
                                               W001_DLI.GHU,                    
                                               VT1,                             
                                               W001_IO,                         
                                               SSA1_VT0PERSN);                  
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! VT1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED LES   AV :  ROTSEGM                 */                
              /* ******************************************** */                
  L092:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '092';                            
              DB_STATUS_KODE           =       VT1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
          /* ******************************************** */                    
          /* KALLET GHU GIKK OK . FORETAR REPL AV ROTSEGM.*/                    
          /* ******************************************** */                    
  /*      ENDREING FRA SATISH 1.3.2002  *********       */                      
          IF (TRANS_OPPL_OMR.BLANKETTYPE     = 'EN' !                           
              TRANS_OPPL_OMR.BLANKETTYPE     = 'E1'  ) &                        
              SUBSTR(ROTSEGM.NAVN,1,10)    = '          '  THEN                 
             DO;                                                                
                 SAVE_NAVN = SUBSTR(W001_IO,7,25);                              
                 ROTSEGM.NAVN = SAVE_NAVN;                                      
             END;                                                               
  /*  OPPTIL HERE                                          */                   
          W001_IO                      =       W001_HJELPE_IO;                  
          CALL PLITDLI                        (W001_DLI.PARM_CT_3,              
                                               W001_DLI.REPL,                   
                                               VT1,                             
                                               W001_IO);                        
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! VT1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED REPLACE AV :  ROTSEGM               */                
              /* ******************************************** */                
  L094:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '094';                            
              DB_STATUS_KODE           =       VT1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
        END;                                                                    
      ELSE                                                                      
                                                                                
        IF  VT1.STATUS_KODE           ^=       '  '         THEN                
          DO;                                                                   
             /* ******************************************** */                 
             /* VT1.STATUS_KODE =/= 'II' OG '  '  ): DB-FEIL */                 
             /* ******************************************** */                 
  L096:                                                                         
             FEIL_MELD_NR                =    500 ;                             
             FEIL_VED_LABEL              =   '096';                             
             DB_STATUS_KODE              =    VT1.STATUS_KODE;                  
             GO   TO  RETUR;                                                    
          END;                                                                  
                                                                                
  RETUR:                                                                        
                                                                                
    END P005_SKRIV_ROT;                                                         
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å LEGGE INN UNDERLIGGENDE SEGM. TIL ROT-SEGM.    */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P010_SKRIV_TRANHIST :                                                       
      PROC ;                                                                    
                                                                                
                                                                                
      W001_HJELPE_PEKER                =     ADDR ( TRANHIST ) ;                
      W001_IO                          =     W001_HJELPE_IO    ;                
      SSA_UQUAL                        =    'TRANHIST '        ;                
      SSA1_TRANHIST.VTP_KEY            =     TRANHIST.VTP_KEY;                  
      SSA1_TRANHIST.GRBLKODE           =     TRANHIST.GRBLKODE;                 
                                                                                
      CALL PLITDLI                          (W001_DLI.PARM_CT_5,                
                                             W001_DLI.ISRT,                     
                                             VT1,                               
                                             W001_IO,                           
                                             SSA1_VT0PERSN,                     
                                             SSA_UQUAL);                        
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=     UIB_RC_OK    THEN                  
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  TRANHIST                */                   
           /* ******************************************** */                   
  L105:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '105';                               
           GO   TO  RETUR;                                                      
        END;                                                                    
                                                                                
      IF   VT1.STATUS_KODE             =   'II'    THEN                         
        DO;                                                                     
          /* ******************************************** */                    
          /* SAMME TRANHIST LIGGER INNE FRA FØR           */                    
          /* DETTE FJERNES FØR DET NYE LEGGES INN.        */                    
          /* ******************************************** */                    
                                                                                
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,              
                                               W001_DLI.GHU,                    
                                               VT1,                             
                                               W001_IO,                         
                                               SSA1_VT0PERSN,                   
                                               SSA1_TRANHIST);                  
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! VT1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED LES   AV :  TRANHIST                */                
              /* ******************************************** */                
  L110:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '110';                            
              DB_STATUS_KODE           =       VT1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
          /* ******************************************** */                    
          /* KALLET GHU GIKK OK . DELETER TRANHIST        */                    
          /* ******************************************** */                    
                                                                                
          W001_IO                      =       W001_HJELPE_IO;                  
          CALL PLITDLI                        (W001_DLI.PARM_CT_3,              
                                               W001_DLI.DLET,                   
                                               VT1,                             
                                               W001_IO);                        
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! VT1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED DELETE  AV :  TRANHIST              */                
              /* ******************************************** */                
  L120:                                                                         
              FEIL_MELD_NR             =       500 ;                            
              FEIL_VED_LABEL           =      '120';                            
              DB_STATUS_KODE           =       VT1.STATUS_KODE;                 
              GO   TO  RETUR;                                                   
            END;                                                                
                                                                                
                                                                                
          /* ************************************************* */               
          /* GML. TRANHIST ER FJERNET . DET NYE LEGGES INN     */               
          /* ************************************************* */               
                                                                                
          W001_IO                      =       W001_HJELPE_IO;                  
          SSA_UQUAL                    =      'TRANHIST ';                      
          CALL PLITDLI                        (W001_DLI.PARM_CT_5,              
                                               W001_DLI.ISRT,                   
                                               VT1,                             
                                               W001_IO,                         
                                               SSA1_VT0PERSN,                   
                                               SSA_UQUAL);                      
                                                                                
          IF  DLIUIB.UIBRCODE.UIBFCTR ^=       UIB_RC_OK                        
            ! VT1.STATUS_KODE         ^=       '  '         THEN                
            DO;                                                                 
              /* ******************************************** */                
              /* FEIL VED SKRIV AV :  TRANS                   */                
              /* ******************************************** */                
  L130:                                                                         
              FEIL_MELD_NR             =    500              ;                  
              FEIL_VED_LABEL           =   '130'             ;                  
              DB_STATUS_KODE           =    VT1.STATUS_KODE  ;                  
              GO   TO  RETUR;                                                   
            END;                                                                
        END;                                                                    
      ELSE                                                                      
                                                                                
        IF  VT1.STATUS_KODE           ^=       '  '         THEN                
          DO;                                                                   
             /* ******************************************** */                 
             /* VT1.STATUS_KODE =/= 'II' OG '  '  ): DB-FEIL */                 
             /* ******************************************** */                 
  L140:                                                                         
             FEIL_MELD_NR                =    500 ;                             
             FEIL_VED_LABEL              =   '140';                             
             DB_STATUS_KODE              =    VT1.STATUS_KODE;                  
             GO   TO  RETUR;                                                    
          END;                                                                  
  RETUR:                                                                        
                                                                                
    END P010_SKRIV_TRANHIST;                                                    
                                                                                
                                                                                
                                                                                
                                                                                
    %PAGE;                                                                      
    /* ************************************************************** */        
    /*                                                                */        
    /* PROCEDURE FOR Å SKRIVE UT UNDERLIGGENDE SEGMENTER TIL TRANHIST.*/        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    P020_SKRIV_BARN_AV_TRANHIST :                                               
      PROC;                                                                     
                                                                                
      W001_IO                          =    W001_HJELPE_IO;                     
      CALL PLITDLI                         (W001_DLI.PARM_CT_6,                 
                                            W001_DLI.ISRT,                      
                                            VT1,                                
                                            W001_IO,                            
                                            SSA1_VT0PERSN,                      
                                            SSA1_TRANHIST,                      
                                            SSA_UQUAL);                         
                                                                                
      IF   DLIUIB.UIBRCODE.UIBFCTR    ^=    UIB_RC_OK                           
        !  VT1.STATUS_KODE            ^=   '  '    THEN                         
        DO;                                                                     
           /* ******************************************** */                   
           /* FEIL VED SKRIV AV :  TRANS                   */                   
           /* ******************************************** */                   
  L150:                                                                         
           FEIL_MELD_NR                =    500 ;                               
           FEIL_VED_LABEL              =   '150';                               
           DB_STATUS_KODE              =    VT1.STATUS_KODE;                    
        END;                                                                    
    END P020_SKRIV_BARN_AV_TRANHIST;                                            
                                                                                
                                                                                
                                                                                
  L999:                                                                         
                                                                                
                                                                                
    /* ************************************************************** */        
    /* RESTILLER   TRANS_PEKERENE                                     */        
    /* ************************************************************** */        
                                                                                
    TRANS_PEKER                    =  W001_TRANS_PEKER     ;                    
    TRANS_OPPL_PEKER               =  W001_TRANS_OPPL_PEKER;                    
                                                                                
                                                                                
    IF FUNKSJONSKODE = 'B' THEN                                                 
       CALL DATABASE('CLOSE'); /* 020389 BRITT: CICS 1.7 */                     
                                                                                
    EXEC CICS RETURN;                                                           
                                                                                
  FEILBEH:                                                                      
                                                                                
    EXEC CICS HANDLE CONDITION ERROR(ABEND);                                    
                                                                                
    PROGRAM_ID = 'R0010490'     ;                                               
    EXEC CICS SYNCPOINT ROLLBACK;                                               
                                                                                
    TERMINERINGS_IND = 'F'      ;                                               
    FEIL_MELD_NR     =  0       ;                                               
                                                                                
    KOM_OMR.TRANS_OPPL_PEKER = W001_TRANS_PEKER     ;                           
    KOM_OMR.TRANS_PEKER      = W001_TRANS_OPPL_PEKER;                           
                                                                                
    TRANS_OPPL_OMR.TRANS_RETURKODE = 'R040';                                    
    TRANS_OPPL_OMR.TRANSKODE       = 'R040';                                    
                                                                                
    EXEC CICS SEND MAP(                                                         
                        'S001014') MAPSET('S001013')                            
                                                   ERASE MAPONLY;               
    ALLOCATE S001014O;                                                          
                                                                                
    S001014O.MELDINGO =                                                         
             'FEIL HAR OPPSTÅTT !.TRANS FORKASTET.INGEN OPPDATERING.';          
                                                                                
    IF LOKAL_MELD_NO > 0    THEN                                                
    S001014O.MELDINGO =                                                         
             'FEIL HAR OPPSTÅTT I STATISTIKK REG. INGEN OPPDATERING.';          
    LOKAL_MELD_NO = 0;                                                          
                                                                                
    EXEC CICS SEND MAP(                                                         
                       'S001014') MAPSET('S001013')                             
                                                   DATAONLY;                    
    EXEC CICS RETURN;                                                           
                                                                                
  ABEND:                                                                        
      EXEC CICS ABEND ABCODE(FEIL);                                             
                                                                                
                                                                                
  /* **************************************************************** */        
  /*                                                                  */        
  /*  PROCEDURE FOR Å ÅPNE OG LUKKE VENTEDATABASEN.                   */        
  /*                                                                  */        
  /*                                                                  */        
  /*  ENDRING I FEIL MELDING TEKST GJØRT DEN 09.03.2001 AV AB         */        
  /* **************************************************************** */        
  /*                                                                            
  */                                                                            
  DATABASE:                                                                     
   PROC(STYRING);                                                               
                                                                                
   DCL                                                                          
     STYRING                               CHAR(5),                             
     NULL                                  BUILTIN,                             
     UNSPEC                                BUILTIN,                             
     PLITDLI                               ENTRY;                               
                                                                                
  %SKIP;                                                                        
  /*                                                                  */        
  /***** DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-****/        
  /*     KALL                                                         */        
  /*                                                                  */        
     DCL                                                                        
       W01_PSB_NAVN                CHAR (8)       INIT('        ');             
     DCL                                                                        
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');                 
     DCL                                                                        
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
  %PAGE;                                                                        
  /*                                                                  */        
  /****  DLI CALL-PARAMETRE                               *************/        
  /*                                                                  */        
  %SKIP(2);                                                                     
     DCL 1  W01_DLI_PARAM,                                                      
            2   W02_GU             CHAR (4)       INIT('GU  '),                 
            2   W02_PARM_CT_1      FIXED BIN(31)  INIT(1),                      
            2   W02_PARM_CT_3      FIXED BIN(31)  INIT(3);                      
                                                                                
  %PAGE;                                                                        
                                                                                
       W01_PSB_NAVN      = DIV_PARAM_OMR.PSB_NAVN;                              
     IF STYRING = 'OPEN' THEN                                                   
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_3,                
                                                  W01_PCB_FUNCTION,             
                                                  W01_PSB_NAVN,                 
                                                  UIBPTR);                      
                                                                                
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN           
              DO;                                                               
                 ALLOCATE PCB_UIB_PEKER_OMR;                                    
                 PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;                
              END;                                                              
           ELSE                                                                 
          DO;                                                                   
             FEIL_MELD_NR      =  500;                                          
 L555:                                                                          
             FEIL_MELDING = 'PROGRAM ' !! DIV_PARAM_OMR.PROGRAM_ID !!           
                            ' GÅR I FEIL VED LABEL NR. '        !!              
             FEIL_VED_LABEL    = '555';                                         
             MAP_MELDING =                                                      
                    'VENTETRANS-BASEN ER IKKE TILGJENGELIG. KODE:'!!            
                     UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);                 
          END;                                                                  
           /*-------------------------------                                    
              DO;                                                               
                 FEIL_MELD_NR      =  500;                                      
 L555:           FEIL_VED_LABEL    = '555';                                     
                 MAP_MELDING =                                                  
                         'NOE ER GALT MED DATABASEN, KODE: ' !!                 
                           UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);           
              END; */                                                           
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_1,                
                                                  W01_TERM_FUNCTION);           
           KOM_OMR.PCB_UIB_PEKER = NULL;                                        
        END;                                                                    
                                                                                
  END DATABASE;                                                                 
                                                                                
                                                                                
    %INCLUDE R0015305; /* PROC. P050_SKRIV_AP_TRANS                  */         
                                                                                
    %INCLUDE R00153N5; /* PROC. P050_SKRIV_A1_TRANS                  */         
                                                                                
    %INCLUDE R0015306; /* PROC. P060_SKRIV_UP_TRANS                  */         
    %INCLUDE R00153N6; /* PROC. P060_SKRIV_U2_TRANS                  */         
    %INCLUDE R00153U6; /* PROC. P060_SKRIV_U3_TRANS                  */         
                                                                                
    %INCLUDE R0015307; /* PROC. P070_SKRIV_US_TRANS                  */         
                                                                                
    %INCLUDE R0015308; /* PROC. P080_SKRIV_EP_TRANS                  */         
    %INCLUDE R00153N8; /* PROC. P080_SKRIV_E3_TRANS                  */         
    %INCLUDE R00153U8; /* PROC. P080_SKRIV_E3_TRANS                  */         
                                                                                
    %INCLUDE R0015309; /* PROC. P090_SKRIV_EF_TRANS                  */         
    %INCLUDE R00153N9; /* PROC. P090_SKRIV_E4_TRANS                  */         
                                                                                
    %INCLUDE R0015310; /* PROC. P100_SKRIV_FB_TRANS                  */         
                                                                                
    %INCLUDE R0015311; /* PROC. P110_SKRIV_BP_TRANS                  */         
    %INCLUDE R00153NB; /* PROC. P110_SKRIV_B6_TRANS                  */         
                                                                                
    %INCLUDE R0015312; /* PROC. P120_SKRIV_FT_TRANS                  */         
    %INCLUDE R00153NC; /* PROC. P120_SKRIV_F7_TRANS                  */         
    %INCLUDE R00153UC; /* PROC. P120_SKRIV_FO_TRANS                  */         
                                                                                
    %INCLUDE R0015314; /* PROC. P140_SKRIV_E1_TRANS                  */         
    %INCLUDE R00153UE; /* PROC. P140_SKRIV_EN_TRANS                  */         
                                                                                
    %INCLUDE R0015316; /* PROC. P160_SKRIV_O1_TRANS                  */         
                                                                                
    %INCLUDE R0015317; /* PROC. P170_SKRIV_O2_TRANS                  */         
                                                                                
    %INCLUDE R0015319; /* PROC. P190_SKRIV_AF_TRANS                  */         
    %INCLUDE R00153UJ; /* PROC. P190_SKRIV_KF_TRANS                 */          
                                                                                
    %INCLUDE R0015320; /* PROC. P183_SKRIV_UF_TRANS                  */         
    %INCLUDE R0019990; /* PROC. KONV_HÅMD_MDÅ                        */         
                                                                                
                                                                                
                                                                                
  END  R001049;                                                                 
