 /*   SIST ENDRET PÅ PROD   2000.07.13  9.26.53 AV   JDA7339          */        
 /*       SIST ENDRET 22/06-98 10.22.30 AV   JDA7339                  */        
 /*       SIST ENDRET 18/06-98 15.49.47 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014380 - PROSEDYRE I PLI                                     */        
 /*    PROGRAMMERER: TRUDE SPONBERG MARS 1990                         */        
 /*HENSIKT:                                                           */        
 /*    BEREGNE GRUNNPENSJON ETTERLATT BOSATT UTLAND                   */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROSEDYREN INNGÅR SOM EN DEL AV BEHANDLINGA AV ETTERLATTEPEN-  */        
 /*    SJONSBEREGNINGEN                                               */        
 /*    INCLUDES I R0014301                                            */        
 /*BRUK:                                                              */        
 /*    CALL BEREGN_GP_ETTERLATT_UTLAND;                               */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 /*------------------------------------------------------------------*/         
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */         
 /* GRUNNPENSJON. BEREGNINGSREGLENES PUNKT 6.1.1.2 . TRUDE, 21.03.90 */         
 /*------------------------------------------------------------------*/         
                                                                                
 %SKIP(2);                                                                      
 BEREGN_GP_ETTERLATT_UTLAND:                                                    
   PROC;                                                                        
                                                                                
  DCL BOTID_EGEN   FIXED DEC (3) INIT(0),                                       
      BOTID_EK     FIXED DEC (3) INIT(0);                                       
                                                                                
  DCL FAKTISK_BOTID_EGEN   FIXED DEC (3) INIT(0),                               
      FAKTISK_BOTID_EK     FIXED DEC (3) INIT(0);                               
                                                                                
  DCL TT_MED_FREMT_ÅR_EGEN  FIXED DEC (3) INIT(0),                              
      TT_MED_FREMT_ÅR_EK    FIXED DEC (3) INIT(0);                              
                                                                                
  DCL TT_ANV_GP    FIXED DEC (3) INIT(0);                                       
                                                                                
  DCL GRUNNPENSJON  FIXED DEC (11,4) INIT(0);                                   
                                                                                
  BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                                  
                 B02.TT_FRAMT_VED_FRAVIK_10_1(BER_SØ_IND) +                     
                 B02.TT_FRAMT_DØD(BER_SØ_IND) +                                 
                ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);                    
                                                                                
  IF BOTID_EGEN > 40   THEN                                                     
     BOTID_EGEN = 40;                                                           
                                                                                
                                                                                
  TT_MED_FREMT_ÅR_EGEN = B02.TT_FØR_1967(BER_SØ_IND) +                          
                       ((B02.TT_ETTER_1966(BER_SØ_IND) +                        
                         B02.TT_FRAMT(BER_SØ_IND) + 11) / 12);                  
                                                                                
                                                                                
  TT_MED_FREMT_ÅR_EK   = B02.TT_FØR_1967(BER_EK_IND) +                          
                       ((B02.TT_ETTER_1966(BER_EK_IND) +                        
                         B02.TT_FRAMT(BER_EK_IND) + 11) / 12);                  
                                                                                
  IF TT_MED_FREMT_ÅR_EGEN > 40  THEN                                            
     TT_MED_FREMT_ÅR_EGEN = 40 ;                                                
                                                                                
  IF TT_MED_FREMT_ÅR_EK   > 40  THEN                                            
     TT_MED_FREMT_ÅR_EK   = 40 ;                                                
                                                                                
  IF B02.STATUS.VILKÅR_8_4_3A(BER_EK_IND)  = 'J' THEN                           
    DO;                                                                         
        IF TT_MED_FREMT_ÅR_EK > 20 !                                            
           TT_MED_FREMT_ÅR_EGEN > 20 THEN                                       
            DO;                                                                 
               IF TT_MED_FREMT_ÅR_EGEN > TT_MED_FREMT_ÅR_EK THEN                
                  TT_ANV_GP = TT_MED_FREMT_ÅR_EGEN;                             
               ELSE                                                             
                  TT_ANV_GP = TT_MED_FREMT_ÅR_EK;                               
               GO TO L100;                                                      
            END;                                                                
        B02.TT_ANV(BER_EK_IND)  = TT_MED_FREMT_ÅR_EK;                           
    END;                                                                        
                                                                                
  BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                                  
                ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);                    
                                                                                
  IF BOTID_EK   > 40   THEN                                                     
     BOTID_EK   = 40;                                                           
                                                                                
  FAKTISK_BOTID_EGEN   = B02.TT_FØR_1967(BER_SØ_IND) +                          
                       ((B02.TT_ETTER_1966(BER_SØ_IND) + 11) / 12);             
  FAKTISK_BOTID_EK     = B02.TT_FØR_1967(BER_EK_IND) +                          
                       ((B02.TT_ETTER_1966(BER_EK_IND) + 11) / 12);             
                                                                                
  IF FAKTISK_BOTID_EGEN > 40 THEN                                               
     FAKTISK_BOTID_EGEN = 40;                                                   
                                                                                
  IF FAKTISK_BOTID_EK   > 40 THEN                                               
     FAKTISK_BOTID_EK   = 40;                                                   
                                                                                
  IF (B02.TRYGDET_DØD(BER_SØ_IND)    = 'J' !                                    
      B02.TRYGDET_DØD(BER_EK_IND)    = 'J')  &                                  
     (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND)    = 'J' !                                
      B02.TRYGDET_3ÅR_DØD(BER_EK_IND)    = 'J') THEN                            
   DO;                                                                          
                                                                                
      /*PUNKT 1.1 MINST 20 ÅR BOTID , SAMME REGLER SOM BOSATT(6.1.1.1)*/        
                                                                                
      /* PUNKT 1.2 :  */                                                        
                                                                                
                                                                                
      IF  (BOTID_EGEN              >  9  &                                      
           BOTID_EGEN              < 20 ) !                                     
          (BOTID_EK                >  9  &                                      
           BOTID_EK                < 20 )  THEN                                 
         DO;                                                                    
            IF BOTID_EGEN          >=  BOTID_EK  THEN                           
               TT_ANV_GP           =   BOTID_EGEN;                              
            ELSE                                                                
               TT_ANV_GP           = BOTID_EK  ;                                
         END;                                                                   
        B02.TT_ANV(BER_EK_IND)  = BOTID_EK;                                     
   END;                                                                         
                                                      /*PUNKT 2: */             
                                                                                
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                           
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                                
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                                 
       B02.TRYGDET_DØD(BER_EK_IND)      = 'J' ) THEN                            
     DO;                                                                        
        B02.TT_ANV(BER_EK_IND)  = FAKTISK_BOTID_EK;                             
                                                                                
        IF FAKTISK_BOTID_EGEN > FAKTISK_BOTID_EK  THEN                          
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                                     
        ELSE                                                                    
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                                     
     END;                                                                       
                                                                                
                                                       /*PUNKT 3: */            
                                                                                
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                           
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J') !                                
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                                 
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                            
     DO;                                                                        
        B02.TT_ANV(BER_EK_IND)  = FAKTISK_BOTID_EK;                             
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                         
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                                     
        ELSE                                                                    
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                                     
     END;                                                                       
                                                                                
                                                                                
                                                        /*PUNKT 4: */           
                                                                                
   IF (B02.BOSATT(BER_SØ_IND)   > 0 &                                           
       B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) = 'J') !                                 
      (B02.TRYGDET_3ÅR_DØD(BER_SØ_IND) ^= 'J' &                                 
       B02.TRYGDET_DØD(BER_EK_IND)     ^= 'J' ) THEN                            
     DO;                                                                        
        B02.TT_ANV(BER_EK_IND)  = FAKTISK_BOTID_EK;                             
        IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                         
          TT_ANV_GP   = FAKTISK_BOTID_EGEN;                                     
        ELSE                                                                    
          TT_ANV_GP   = FAKTISK_BOTID_EK  ;                                     
     END;                                                                       
                                                                                
                                                                                
                                              /*6.1.1.4 KONVENSJON   */         
                                                                                
  IF B02.KONVENSJON(BER_SØ_IND) = 'J' THEN   /* DEN STØRSTE TT ??? */           
    DO;                                                                         
       B02.TT_ANV(BER_EK_IND)  = FAKTISK_BOTID_EK;                              
       IF FAKTISK_BOTID_EGEN >= FAKTISK_BOTID_EK  THEN                          
          TT_ANV_GP          = FAKTISK_BOTID_EGEN;                              
       ELSE                                                                     
          TT_ANV_GP          = FAKTISK_BOTID_EK  ;                              
    END;                                                                        
                                                     /* PUNKT 1.3 :  */         
                                                                                
 /*IF B02.ETTEPENS.PÅ_AVD (BER_SØ_IND)  >  BOTID_EK    THEN                     
                    TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND); ? */           
                                                                                
   IF B02.ETTEPENS.TP_BRUTTO(BER_SØ_IND) > 0   THEN                             
     DO;                                                                        
       IF TT_ANV_GP < B02.ETTEPENS.PÅ_AVD(BER_SØ_IND) THEN                      
         DO;                                                                    
           TT_ANV_GP = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);                         
           B02.TT_ANV(BER_EK_IND)  = B02.ETTEPENS.PÅ_AVD(BER_SØ_IND);           
         END;                                                                   
     END;                                                                       
 L100:                                                                          
  /* TILLEGG 200007 - HL : */                                                   
  IF B02.TT_KONVENSJON_ÅR(BER_EK_IND) > TT_ANV_GP        THEN                   
     TT_ANV_GP = B02.TT_KONVENSJON_ÅR(BER_EK_IND);                              
  IF (TT_ANV_GP  >=  3 ) !                                                      
     (TT_ANV_GP < 3   & B02.KONVENSJON(BER_SØ_IND) = 'J') THEN                  
     DO;                                                                        
       GRUNNPENSJON                       = G * TT_ANV_GP / 40;                 
       GRUNNPENSJON                       = (GRUNNPENSJON / 12) + 0.5;          
       B02.ETTEPENS.GP_BRUTTO(BER_SØ_IND) = GRUNNPENSJON;                       
       B02.TT_ANV(BER_SØ_IND)             = TT_ANV_GP;                          
     END;                                                                       
  ELSE                                                                          
       B02.ETTEPENS.GP_BRUTTO(BER_SØ_IND) = 0;                                  
                                                                                
        /*--------------------------------------------------*/                  
        /*DE TO NESTE LINJENE ER ET FORSØK .                */                  
        /*--------------------------------------------------*/                  
                                                                                
  IF Y_TILLEGG   = 'J'  THEN                                                    
    DO;                                                                         
     B02.TT_ANV(BER_SØ_IND)    = 40;                                            
     B02.TT_ANV(BER_EK_IND)    = 40;                                            
    END;                                                                        
                                                                                
  IF B02.IKKE_GP(BER_SØ_IND)  = 'J' THEN                                        
     B02.ETTEPENS.GP_BRUTTO(BER_SØ_IND) = 0 ;                                   
                                                                                
 /*------------------------------------------------------------------*/         
 /* KRAV OM PENSJON/OVERGANGSSTØNAD UNDER BOSETTING I UTLANDET       */         
 /* TIL HIT. TRUDE                                                   */         
 /*------------------------------------------------------------------*/         
                                                                                
   END BEREGN_GP_ETTERLATT_UTLAND;                                              
