 /*   SIST ENDRET PÅ PROD   2008.05.31 11.11.00 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 11.36.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.42.50 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.10.46 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.43.49 AV   SPA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.44.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 12.54.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.29 12.48.12 AV   TSB2970          */        
 /*       SIST ENDRET 25/08-99 08.57.00 AV   JDA7339                  */        
 /*       SIST ENDRET 18/01-99 12.43.28 AV   JDA7339                  */        
 /*       SIST ENDRET 18/01-99 12.43.07 AV   JDA7339                  */        
 /*       SIST ENDRET 10/06-98 13.52.34 AV   TSB7339                  */        
 /*       SIST ENDRET 09/06-98 08.48.54 AV   SPA7339                  */        
 /*       SIST ENDRET 27/05-98 09.51.34 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0014424 - BEREGN_POENG_AV_AÅI                                */        
 /*     PROGRAMMERER: HERMAN LARSSEN                                  */        
 /* HENSIKT                                                           */        
 /*                                                                   */        
 /*  1. REGNER UT OG OPPDATERER POENGTALLET  YRKEHIST.PAÅ             */        
 /*     (POENGTALLET UT FRA DEN ANTATTE ÅRLIGE ARBEIDSINNTEKTEN       */        
 /*      PÅ SKADETIDSPUNKTET),                                        */        
 /*      EVT BEREGNET UT FRA LOVREGLER FOR SPESIELLE YRKESGRUPPER.    */        
 /*                                                                   */        
 /*  2. REGNER UT OG OPPDATERER YRKEPENS.PÅ OG PÅ_ETTER91             */        
 /*                                                                   */        
 /*  3.  SETTER FORELØPIG YPT_KODE (KAN BLI ENDRET I 4425)            */        
 /*                                                                   */        
 /* PROGRAMTILKNYTNING                                                */        
 /*     PROSEDYREN BLIR INKLUDERT I R0014401 - BEREGN_UFØREPENSJON.   */        
 /* ***************************************************************** */        
 BEREGN_POENG_AV_AÅI :                                                          
  PROC;                                                                         
                                                                                
                                                                                
    /*WORKING STORAGE*/                                                         
    %INCLUDE P0019980;                                                          
    DCL 1      W1,                                                              
          2    ALDER                    PIC '(8)9',          /*Y2K*/            
          2    FNR_PIC11                PIC '(11)9',                            
          2    FNR_PIC13                PIC '(13)9',                            
          2    GAMMEL_GRAD              FIXED DEC     (3) INIT(0),              
          2    GV                       FIXED DEC     (7) INIT(0),              
          2    G_YST                    FIXED DEC     (7) INIT(0),              
          2    INNTEKT                  FIXED DEC     (7) INIT(0),              
          2    POENG                    FIXED DEC   (5,2) INIT(0),              
          2    POENG92                  FIXED DEC   (5,2) INIT(0),              
          2    POENG1                   FIXED DEC   (5,2) INIT(0),              
          2    POENG2                   FIXED DEC   (5,2) INIT(0),              
          2    POENG3                   FIXED DEC   (5,2) INIT(0),              
          2    POENG_GRUNNLAG           FIXED DEC     (7) INIT(0),              
          2    POENG_GRUNNLAG92         FIXED DEC     (7) INIT(0),              
          2    PÅ_FØR92                 FIXED DEC     (3) INIT(0),              
          2    SYTTI                    FIXED DEC     (5) INIT (1970),          
          2    NITTIEN                  FIXED DEC     (5) INIT (1991),          
          2    UFG_FØR_KAP11            FIXED DEC     (3) INIT (0),             
          2    YHIST_IND                FIXED BIN    (15),                      
          2    YST_ÅM                         PIC  '999999',                    
          2    YST_ÅMD                   FIXED DEC    (9),     /*Y2K*/          
          2    ÅRET                     FIXED DEC     (5);     /*Y2K*/          
                                                                                
    DCL        YST_Å DEF W1.YST_ÅM  POS (1)  PIC '9999';        /*Y2K*/         
                                                                                
    DCL        YST_M DEF W1.YST_ÅM  POS (5)    PIC    '99';     /*Y2K*/         
                                                                                
    DCL        VIRK_ÅMD                     FIXED DEC (9);                      
    DCL        ATTEN                        FIXED DEC (5);                      
    DCL        NITTEN                       FIXED DEC (5);                      
    DCL        TYVE                         FIXED DEC (5);                      
    DCL        FNR_ÅR DEF FNR_PIC11 POS(5)    PIC '99';                         
    DCL        FNR_ÅR13 DEF FNR_PIC13 POS(5)    PIC '9999';                     
    DCL        POENG_IND (3)                FIXED DEC (5,2);                    
                                                                                
                                                                                
 /*PROGRAMMET BEGYNNER HER:*/                                                   
                                                                                
  W_FNR     = B02.FNR(BER_SØ_IND);                                              
  W_FNR_13  = KONV_FNR11_FNR13(W_FNR);                                          
                                                                                
  DO YHIST_IND = 1 TO 10 WHILE (B02.YRKEHIST.OPPH_DATO_ÅMD                      
                                      (BER_SØ_IND,YHIST_IND) > 0);              
  END;                                                                          
                                                                                
                                                                                
                                                                                
 /* ************************************************************ */             
 /* FOR Å REGNE PAÅ MÅ VI BRUKE GRUNNBELØPET PÅ SKADETIDSPUNKTET */             
 /* DET GRUNNBELØP VI HAR FUNNET TIDLIGERE (I 4001) GJELDER PÅ   */             
 /* VIRKNINGSTIDSPUNKTET.                                        */             
 /* ************************************************************ */             
                                                                                
                                                                                
    YST_ÅMD   = B02.YST_ÅMD(BER_SØ_IND,YHIST_IND) + 01;  /* 2000-3 */           
    YST_ÅM    = YST_ÅMD / 100;         /*9901*/                                 
                                                                                
    DO J = 1 TO 65;                                                             
                                                                                
       IF YST_ÅMD         >= PERIODE_START_ÅMD(J) &                             
          YST_ÅMD         <= PERIODE_SLUTT_ÅMD(J) THEN                          
                                                                                
          DO;                                                                   
             G_YST             = G_TAB_PERIODE.GRUNNBELØP(J);                   
             J                 = 99;                                            
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
                                                                                
  POENG_GRUNNLAG = B02.YRKEHIST.AÅI(BER_SØ_IND,YHIST_IND);                      
  POENG_GRUNNLAG92 = POENG_GRUNNLAG;                                            
                                                                                
  IF POENG_GRUNNLAG   > (G_YST * 12)      THEN                                  
                                                                                
     POENG_GRUNNLAG   = G_YST * 12;                                             
                                                                                
  IF POENG_GRUNNLAG   > (G_YST * 8)       THEN                                  
                                                                                
     POENG_GRUNNLAG   = (G_YST * 8) +                                           
                        ((POENG_GRUNNLAG - (G_YST*8)) / 3) + 0.5;               
                                                                                
  IF POENG_GRUNNLAG   > G_YST   THEN                                            
                                                                                
     POENG = (POENG_GRUNNLAG - G_YST) / G_YST + 0.005;                          
                                                                                
  ELSE                                                                          
                                                                                
     POENG = 0;                                                                 
                                                                                
                                                                                
    IF YST_ÅMD   > 19920000        THEN  /* 2000-3 */                           
       DO;                                                                      
          IF W_FNR_R13.ÅR > 1940        THEN                                    
             B02.YRKEPENS.PÅ(BER_SØ_IND) = 40;                                  
          ELSE                                                                  
  /* JFA     B02.YRKEPENS.PÅ(BER_SØ_IND) = FNR_ÅR;  */                          
  /* OPPGRAD 04229 OG REMEDY 772                    */                          
             B02.YRKEPENS.PÅ(BER_SØ_IND) = W_FNR_R13.ÅR - 1900;                 
                                                                                
          IF W_FNR_R13.ÅR > 1975 THEN                                           
             DO;                                                                
                PÅ_FØR92 = 0;                                                   
                B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) = 40;                       
             END;                                                               
          ELSE                                                                  
          DO;                                                                   
             PÅ_FØR92 = 1975 - W_FNR_R13.ÅR;                                    
             IF PÅ_FØR92 > 25 THEN                                              
                PÅ_FØR92 = 25;                                                  
             IF PÅ_FØR92 <  B02.YRKEPENS.PÅ(BER_SØ_IND)    THEN                 
                B02.YRKEPENS.PÅ_ETTER91(BER_SØ_IND) =                           
                      B02.YRKEPENS.PÅ(BER_SØ_IND) - PÅ_FØR92;                   
          END;                                                                  
                                                                                
          IF POENG_GRUNNLAG92 > (G_YST * 12)      THEN                          
             POENG_GRUNNLAG92 = G_YST * 12;                                     
                                                                                
          IF POENG_GRUNNLAG92 > (G_YST * 6)       THEN                          
             POENG_GRUNNLAG92 = (G_YST * 6) +                                   
            ((POENG_GRUNNLAG92 - (G_YST*6)) / 3) + 0.5;                         
                                                                                
          IF POENG_GRUNNLAG92 > G_YST   THEN                                    
             POENG92 = (POENG_GRUNNLAG92 - G_YST) / G_YST + 0.005;              
          ELSE                                                                  
             POENG92 = 0;                                                       
                                                                                
          IF PÅ_FØR92 < 20 THEN                                                 
             POENG = (POENG * PÅ_FØR92 + POENG92 * (20 - PÅ_FØR92))             
                     / 20 + 0.005;                                              
       END;                                                                     
                                                                                
 /* VI INITIERER YPT_KODE MED 'A' SOM BETYR AT POENG ER BEREGNET */             
 /* PÅ GRUNNLAG AV FASTSATT ANTATT ÅRLIG INNTEKT - KAN BLI ENDRET*/             
                                                                                
  B02.YPT_KODE (BER_SØ_IND) = 'A';                                              
                                                                                
 /* ************************************************************ */             
 /* PÅ EN ELLER ANNEN MÅTE SÅ MÅ DET TESTES PÅ OM DET ER YRKES-  */             
 /* KODE FRA FØR.  DENNE MÅ STÅ, MEN NY KODE MÅ OGSÅ INN.  ERIK. */             
 /*                                                              */             
 /*  IF B02.YRKE11(BER_SØ_IND,YHIST_IND) ^=                      */             
 /*     B02.YRKE11(BER_SØ_IND,YHIST_IND - 1) THEN  ?????         */             
 /* ************************************************************ */             
                                                                                
                                                                                
    SELECT (B02.YRKE11(BER_SØ_IND,YHIST_IND));                                  
                                                                                
       WHEN ('F')                                                               
                                                                                
    /*KAP 11-11 NR 1   FISKERE, FANGSTMENN MV  */                               
                                                                                
          DO;                                                                   
                                                                                
             B02.YPT_KODE (BER_SØ_IND) = 'Y';                                   
                                                                                
     /* FISKERE FÅR ALLTID YPT_KODE = 'Y' - POENG SKAL BEREGNES */              
     /* PÅ GRUNNLAG AV YRKE, OG IKKE PÅ GRUNNLAG AV AÅI         */              
                                                                                
            YST_ÅMD = B02.YRKEHIST.YST_ÅMD(BER_SØ_IND,YHIST_IND);               
            YST_ÅM  = YST_ÅMD / 100;           /*9901*/                         
                                                                                
 /* ************************************************************ */             
 /* VI SKAL NÅ FINNE ET GJENNOMSNITT AV INNTEKTENE I DE SISTE    */             
 /* 3 ÅR FØR SKADEÅRET.  FØR 1971 REGNES MED MAX 7.00 I POENG    */             
 /* ************************************************************ */             
                                                                                
             DO I = 1 TO 3;                                                     
                POENG_IND (I) = 0;                                              
                ÅRET    = YST_Å - I;                                            
                                                                                
                INNTEKT = B02.PI(BER_SØ_IND,ÅRET);   /*200504*/                 
                                                                                
                GV      = GV_TAB_ARRAY.G_V(ÅRET);                               
                                                                                
                IF INNTEKT > (GV * 12)        THEN                              
                                                                                
                   INNTEKT = GV * 12;                                           
                                                                                
                IF INNTEKT > (GV * 6)  &                                        
                   ÅRET > NITTIEN          THEN                                 
                      INNTEKT = GV*6 + ((INNTEKT - (GV*6)) / 3) + 0.5;          
                ELSE                                                            
                IF INNTEKT > (GV * 8)         THEN                              
                                                                                
                   IF ÅRET > SYTTI            THEN                              
                                                                                
                      INNTEKT = GV*8 + ((INNTEKT - (GV*8)) / 3) + 0.5;          
                                                                                
                ELSE                                                            
                   INNTEKT = GV * 8;                                            
                                                                                
                POENG_IND(I) = (INNTEKT - GV) / GV + 0.005;                     
                                                                                
                IF POENG_IND (I) < 0 THEN POENG_IND(I) = 0;                     
                                                                                
             END; /*DO I = 1 TO 3*/                                             
                                                                                
             POENG = (POENG_IND (1)  + POENG_IND (2)                            
                      + POENG_IND (3)) / 3 + 0.005;                             
                                                                                
                                                                                
             IF POENG < 0.5   THEN                                              
                                                                                
                POENG = 0.5;                                                    
                                                                                
                                                                                
          END;                                                                  
                                                                                
       WHEN ('M')                                                               
                                                                                
    /*KAP 11-11 NR 2   MILITÆRPERSON MV        */                               
                                                                                
          DO;                                                                   
                                                                                
             IF POENG < 2 THEN                                                  
                                                                                
                DO;                                                             
                   POENG = 2;                                                   
                   B02.YPT_KODE (BER_SØ_IND) = 'Y';                             
                END;                                                            
                                                                                
          END;                                                                  
                                                                                
       WHEN ('U','E')                                                           
                                                                                
    /*KAP 11-11 NR 3   UNGDOM, ELEV MV         */                               
                                                                                
          DO;                                                                   
                                                                                
             IF POENG < 1 THEN                                                  
                                                                                
                DO;                                                             
                   POENG = 1;                                                   
                   B02.YPT_KODE (BER_SØ_IND) = 'Y';                             
                END;                                                            
                                                                                
          END;                                                                  
                                                                                
       WHEN ('V')                                                               
                                                                                
    /*KAP 11-11 NR 3   ELEV UTEN YRKESUTDANNING   */                            
                                                                                
          DO;                                                                   
                                                                                
                                                                                
 /*LOVENDRING FRA 1.1.91 HL ; */                                                
                                                                                
             VIRK_ÅMD    = B02.VIRK_DATO_ÅMD(BER_SØ_IND);/* 2000-3 */           
                                                                                
             ALDER = F_ALDER(FNR_PIC11,(VIRK_ÅMD));                             
                                                                                
             IF VIRK_ÅMD > 19910000     THEN        /* 2000-3 */                
                DO;                                                             
                   ATTEN  = 1801;                                               
                   NITTEN = 1901;                                               
                   TYVE   = 2001;                                               
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   ATTEN  = 1800;                                               
                   NITTEN = 1900;                                               
                   TYVE   = 2000;                                               
                END;                                                            
                                                                                
             IF ALDER < ATTEN      THEN;                                        
                                                                                
             ELSE IF ALDER < NITTEN   THEN                                      
                                                                                
                  DO;                                                           
                     IF POENG  < 1  THEN                                        
                                                                                
                        DO;                                                     
                           POENG  = 1;                                          
                           B02.YPT_KODE (BER_SØ_IND) = 'Y';                     
                        END;                                                    
                                                                                
                  END;                                                          
                                                                                
             ELSE IF ALDER < TYVE  THEN                                         
                                                                                
                  DO;                                                           
                     IF POENG  < 1.5  THEN                                      
                                                                                
                        DO;                                                     
                           POENG  = 1.5;                                        
                           B02.YPT_KODE (BER_SØ_IND) = 'Y';                     
                        END;                                                    
                                                                                
                  END;                                                          
                                                                                
             ELSE                                                               
                                                                                
                  IF POENG  < 2  THEN                                           
                                                                                
                     DO;                                                        
                        POENG =  2;                                             
                        B02.YPT_KODE (BER_SØ_IND) = 'Y';                        
                     END;                                                       
                                                                                
          END;                                                                  
                                                                                
       OTHERWISE;                                                               
                                                                                
          END;                                                                  
                                                                                
       B02.PAÅ (BER_SØ_IND,YHIST_IND) = POENG;                                  
                                                                                
                                                                                
 END BEREGN_POENG_AV_AÅI;                                                       
