 /*       SIST ENDRET 23/01-98 09.57.39 AV   SPA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R0019964   F_6MDR                FUNKSJON        */00000040
 /*  PROGRAM-SPRÅK : PLI                                              */00000050
 /*  PROGRAMMERER  : HERMAN LARSSEN                                   */00000060
 /*  PROGRAMMET BLE LAGET : FEB 88                                    */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /* MOTTAR VIRKNINGSDATO_ÅM                                           */00000120
 /* TESTER PÅ OM DETTE ER 6 MÅNEDER ETTER VIRKMÅNEDEN.                */00000130
 /* RETURNERER BIT = 1 HVIS JA   -  ELLERS '0'                        */00000140
 /*                                                                   */00000150
 /*   BRUK :                                                          */00000160
 /*     IF ^F_6MDR          THEN                                      */00000170
 /*        FEIL                                                       */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 /*PROGRAMTILKNYTTING:                                                */00000210
 /* ********************                                              */00000220
 /*  PROGRAMMET CALLES AV DIVERSE PROGRAM                             */00000230
 /*  PROGRAMMET BRUKER BUILTIN FUNKSJON  'DATE'.                      */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*ENDRINGER:                                                         */00000270
 /* ***************************************************************** */00000280
 F_6MDR:                                                                00000290
   PROC (VIRKDATO_ÅMD) RETURNS(BIT (1));                                00000300
 %SKIP(2);                                                              00000310
   DCL                                                                  00000320
      VIRKDATO_ÅMD           PIC '99999999',                            00000330
      VIRK_ÅR DEF VIRKDATO_ÅMD POS (1) PIC '9999',                      00000340
      VIRK_MD DEF VIRKDATO_ÅMD POS (5) PIC '99';                        00000350
   DCL                                                                  00000360
      DATO_ÅMD PIC '(8)9',                                              00000370
      DATO_PIC           PIC '99999999',                                00000380
      ÅR DEF DATO_PIC POS(1) PIC '9999',                                00000390
      MD DEF DATO_PIC POS(5) PIC '99';                                  00000400
   DCL                                                                  00000410
      KODE BIT (1) INIT ('1'B);                                         00000420
 %SKIP(2);                                                              00000430
      DATO_ÅMD = DIV_PARAM_OMR.DATO_2000;                               00000440
      DATO_PIC = DATO_ÅMD;                                              00000450
      MD = MD + 6;                                                      00000460
      IF MD > 12             THEN                                       00000470
         DO;                                                            00000480
            ÅR = ÅR + 1;                                                00000490
            MD = MD - 12;                                               00000500
         END;                                                           00000510
      IF VIRK_ÅR > ÅR        THEN                                       00000520
         KODE = '0'B;                                                   00000530
      ELSE                                                              00000540
         IF VIRK_ÅR = ÅR     THEN                                       00000550
            IF VIRK_MD > MD  THEN                                       00000560
               KODE = '0'B;                                             00000570
      RETURN(KODE);                                                     00000580
   END F_6MDR;                                                          00000590
