 /*   SIST ENDRET PÅ PROD   2007.12.21 12.20.57 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 12.01.54 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.04.24  9.46.48 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.12.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.44.12 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.01.05  8.54.24 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.39.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.10.25 13.26.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.09.08 11.37.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.08.30  8.54.16 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2005.08.16 13.43.17 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.06.17  8.35.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.05.31 12.15.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.17  8.30.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.16 13.39.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.03.16 11.59.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2004.12.17 15.41.10 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.16  9.40.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.09 11.35.49 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.09 11.33.33 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.01  8.28.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.01  8.18.38 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.26 12.00.23 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.26 11.54.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.20 10.00.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.19 10.24.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.19  9.59.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.06  8.26.48 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.06  8.24.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 13.19.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.22.19 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.25 14.02.17 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.23  9.50.04 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.05.15 13.57.00 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.04.19 12.43.37 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.07.24 13.16.40 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.07.07 13.04.12 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.06.20  8.57.20 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.03.20 13.23.18 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.29 15.15.16 AV   JDA7339          */        
 /*   SIST ENDRET PÅ PROD   2000.02.10 14.28.53 AV   JDA7339          */        
 /*       SIST ENDRET 26/03-99 13.24.56 AV   JDA7339                  */        
 /*       SIST ENDRET 26/02-99 09.13.33 AV   JDA7339                  */        
 /*       SIST ENDRET 26/11-98 13.42.39 AV   JDA7339                  */        
 /*       SIST ENDRET 26/11-98 13.41.54 AV   JDA7339                  */        
 /*       SIST ENDRET 22/06-98 13.02.02 AV   JDA7339                  */        
 /*       SIST ENDRET 15/06-98 08.01.16 AV   RFA9991                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON:                                                   */        
 /*     R001UE20 - PROSEDYRE I PLI           HOVEDRUTINE              */        
 /*     PROGRAMMERER: HERMAN FEB 94                                   */        
 /* HENSIKT:                                                          */        
 /*     RUTINEN KONTROLLERER EN-TRANSAKSJONEN MOT OPPLYSNINGER I      */        
 /*     REGISTERET.NÅR DET OPPDAGES UOVERENSTEMMELSER BLIR FEIL       */        
 /*     MERKET AV I FEIL-MELD-ARRAY.                                  */        
 /*     STATUS OPPDATERES (B02).                                      */        
 /*     TRANSTYPE SETTES I TRANSAKSJONEN.                             */        
 /*     RUTINEN KALLER OPP RUTINER FOR:                               */        
 /*     GIFTEMÅL........................UE30                          */        
 /*     SKILSMISSE......................1440                          */        
 /*     FLYTTE SAMMEN...................1450                          */        
 /*     FLYTTE FRA HVERANDRE............1460                          */        
 /*     DISSE RUTINENE BRUKER DET SAMME ARBEIDSOMRÅDE SOM HOVED-      */        
 /*     RUTINEN.                                                      */        
 /*  ***************************************************************  */        
 /* ***************************************************************   */        
 /* PROGRAMTILKNYTNING:                                               */        
 /*     KALLES OPP AV PROGRAM R0013520                                */        
 /* BRUK:                                                             */        
 /*     EXEC CICS XCTL PROGRAM ('R001UE20') COMMAREA (KOM_OMR)        */        
 /* ***************************************************************** */        
                                                                                
                                                                                
 R01UE20:                                                                       
   PROC (COMMAREA_PEKER) OPTIONS (MAIN);                                        
                                                                                
                                                                                
      %INCLUDE P001UE01;                                                        
      %INCLUDE P0019906;  /* TRANS_OPPL_OMR  BASED(TRANS_OPPL_PEKER)  */        
      %INCLUDE P0019908;  /* KOM_OMR  BASED(COMMAREA_PEKER)           */        
      %INCLUDE P0019910;  /* STYRINGS_OMR  BASED(STYRINGS_PEKER)      */        
      %INCLUDE P0019912;  /* DIV_PARAM_OMR  BASED(DIV_PARAM_PEKER)    */        
                                                                                
   DCL 1 B01   BASED    (B01_PEKER),                                            
      %INCLUDE P0019921;                                                        
                                                                                
   DCL 1 B02   BASED    (B02_PEKER),                                            
      %INCLUDE P0019921;                                                        
                                                                                
   DCL                                                                          
      COMMAREA_PEKER      PTR                ,                                  
      HJ_VIRKDATO_ÅMD     PIC          '99999999',                              
      VIRK_ÅR DEF HJ_VIRKDATO_ÅMD POS(1)     PIC '9999',                        
      FELT_UTFYLT         PIC             '9',                                  
     (I , J, K ,M, BARN_IND,AVDØD_IND)  FIXED BIN (15) INIT (0),                
     (ADDR,CSTG,FLOOR,LBOUND,MOD,SUBSTR,VERIFY,HBOUND) BUILTIN;                 
                                                                                
      DCL ALDER      FIXED DEC (5) INIT (0);                                    
      DCL W_FNR      PIC '(11)9';                                               
                                                                                
      DCL  1 FNR_R  DEF W_FNR,                                                  
             2 DAG   PIC   '99',                                                
             2 MND   PIC   '99',                                                
             2 ÅR    PIC   '99',                                                
             2 PERSNR,                                                          
               3 ÅRHUNDRE PIC '999',                                            
               3 REST     PIC '99';                                             
      DCL W_FNR13    PIC '(13)9';                                               
                                                                                
      DCL  1 FNR_R13  DEF W_FNR13,                                              
             2 DAG   PIC   '99',                                                
             2 MND   PIC   '99',                                                
             2 ÅR    PIC   '9999',                                              
             2 PERSNR,                                                          
               3 ÅRHUNDRE PIC '999',                                            
               3 REST     PIC '99';                                             
      DCL JA                               BIT (1) INIT ('1'B);                 
      DCL W_FRYS                           BIT (1) INIT ('0'B);                 
      DCL W_REAKTIV                        BIT (1) INIT ('0'B);                 
      DCL W_BARE_DEL5                      BIT (1) INIT ('0'B);                 
      DCL SISTE_UTFYLTE              FIXED BIN (15);                            
      DCL W_HJELP                    FIXED DEC (7) INIT (0);                    
      DCL UFG_OPPDATER       FIXED DEC (3) INIT (0);  /*0797 HL*/               
      DCL W_TT_MND           FIXED DEC (3) INIT (0);  /*9812 HL*/               
      DCL W_3_2_5            CHAR (1)  INIT (' ')  ;                            
      DCL ETT_ÅR_ÅMD         FIXED DEC (9)  INIT (10000);                       
                                                                                
 /* ***************************************************************** */        
 /* PROGRAMMET STARTER HER                                            */        
 /* ***************************************************************** */        
                                                                                
      W_FNR  = ENS.FNR;                                                         
      W_FNR13= KONV_FNR11_FNR13(W_FNR);                                         
      IF FEIL_MELD_NR = 0 THEN /* AB 01.08.15 */                                
         PROGRAM_ID  = 'R001UE20';                                              
      HJ_VIRKDATO_ÅMD = ENS.VIRK_DATO_ÅMD;                                      
      ALDER = F_ALDER((B01.FNR(SØKER_IND)),HJ_VIRKDATO_ÅMD);                    
 /*FINN BETINGELSER FOR UFØREGRAD SOM IKKE ER DELELIG MED 5 : */                
      IF (B01.REAKTIVISERING(SØKER_IND) = 'J'  &                                
          ENK8.REAKTIVISERING ^= 'X'              )  !                          
         ENK8.REAKTIVISERING = 'S'                   THEN                       
         W_REAKTIV = JA;                                                        
      IF (B01.FRYSDATO_ÅMD(SØKER_IND) > 0     &                                 
          ENK8.FRYSP_5ÅR_ARB ^= 'X'           &                                 
          ENK8.FRYSP_TIDSB   ^= 'X'            )      !                         
          ENK8.FRYSP_5ÅR_ARB  = 'S'                   !                         
          ENK8.FRYSP_TIDSB    = 'S'                THEN                         
         W_FRYS = JA;                                                           
      IF W_REAKTIV & W_FRYS  THEN;                                              
      ELSE                                                                      
         W_BARE_DEL5 = JA;                                                      
 /*BETINGELSENE ER AVKLART - HL 200502                       */                 
                                                                                
      W_3_2_5 =  ENS.RED_GP_3_2_5;                                              
      IF HJ_VIRKDATO_ÅMD < 19980200    THEN                                     
         ENS.RED_GP_3_2_5 = ' ';                                                
                                                                                
 /* ***************************************************************** */        
 /* DERSOM PERSONEN ER ET FORSØRGET BARN AVVISES ENDRINGSMELDINGEN    */        
 /* ***************************************************************** */        
                                                                                
      IF B01.PENSJONSTYPE1(SØKER_IND) = 'L'  THEN                               
         DO;                                                                    
 L099:                                                                          
            FEIL_VED_LABEL = '099';                                             
            FEIL_MELD_NR   = 1014;                                              
            GO TO L999;                                                         
         END;                                                                   
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* DERSOM PERSONEN IKKE FINNES I BASEN                               */        
 /* ***************************************************************** */        
                                                                                
      IF B01.FNR(SØKER_IND) = 0 THEN                                            
         DO;                                                                    
 L100:                                                                          
            FEIL_VED_LABEL = '100';                                             
            FEIL_MELD_NR   = 1713;                                              
            GO TO L999;                                                         
         END;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* PERSONEN ER I BASEN                                               */        
 /* ***************************************************************** */        
                                                                                
      IF STATUS_TYPE = 'A' !                                                    
         STATUS_TYPE = 'I' !        /* TEST PÅ 'I' OG 'K' ER LAGT    */         
         STATUS_TYPE = 'K' THEN     /* INN 28.2.85  HL               */         
         DO;                                                                    
 L105:                                                                          
                                                                                
 /* STATUS_TYPE 'A', 'I' OG 'K' FORTELLER AT PERSONEN IKKE HAR       */         
 /* EN AKTUELL PENSJONSSTATUS PÅ DETTE TIDSPUNKT                     */         
                                                                                
            FEIL_VED_LABEL = '105';                                             
            FEIL_MELD_NR   = 1503;                                              
            GO TO L999;                                                         
         END;                                                                   
                                                                                
 /*-------------------------------------------------------------------/         
 / DERSOM SØKER ER REGISTRERT MED ET ANNET TKNR I STATUS ENN I TRANS /          
 /------------------------------------------------------------------*/          
                                                                                
      IF B01.TKNR(SØKER_IND) ^= ENS.TKNR THEN                                   
         B02.TKNR(SØKER_IND) = ENS.TKNR;                                        
 /*      DO                                                                     
 L110: FJERNA 170701 MARTIN                                                     
            FEIL_VED_LABEL = '110'                                              
            FEIL_MELD_NR   = 1702                                               
            GO TO L999                                                          
         END  */                                                                
                                                                                
 /*-------------------------------------------------------------------*/        
 /* ENDRINGEN ER PÅ ET ØVRIGE BARN OG VI MÅ FLYTTE ALLE               */        
 /*-------------------------------------------------------------------*/        
                                                                                
      IF SØKER_IND > 3 THEN                                                     
         CALL FLYTT_B01_TIL_B02(3);                         /* 9926 */          
      ELSE                                                                      
         CALL FLYTT_B01_TIL_B02(SØKER_IND);                 /* 9926 */          
                                                                                
      IF SØKER_IND < 3 THEN                                                     
         DO;                                                                    
            IF B01.DØDSDATO_ÅMD(EKTEF_IND) = 0 THEN                             
               CALL FLYTT_B01_TIL_B02(EKTEF_IND);           /* 9926 */          
            ELSE                                                                
               B02.PERSON(EKTEF_IND) = B01.PERSON(EKTEF_IND);                   
                                                                                
            B02.FØRSTE_GANG_REG(SØKER_IND) = 'N';                               
            B02.FØRSTE_GANG_REG(EKTEF_IND) = 'N';                               
         END;                                                                   
      ELSE                                                                      
         DO;                                                                    
            /*-------------------------------------*/                           
            /* ENDRINGEN GJELDER ET ETTERLATT BARN */                           
            /* AVDØDE MOR OG/ELLER FAR FLYTTES     */                           
            /*-------------------------------------*/                           
                                                                                
            B02.FØRSTE_GANG_REG(3) = 'N'            ;                           
            B02.PERSON         (1) = B01.PERSON (1) ;                           
            B02.PERSON         (2) = B01.PERSON (2) ;                           
         END;                                                                   
                                                                                
      IF FEIL_MELD_NR > 0 THEN                                                  
         GO TO L999;                                                            
      ELSE                                                                      
         PROGRAM_ID = 'R001UE20';                                               
                                                                                
      FELT_UTFYLT                    = 0;                                       
                                                                                
 /* ***************************************************************** */        
 /* DERSOM DET ER ENDRING I SPRÅK                                     */        
 /* ***************************************************************** */        
                                                                                
      IF ENS.SPRÅK                 ^= ' '   THEN                                
         DO;                                                                    
            TRANSTYPE               = 61       ;                                
            FELT_UTFYLT             =  1       ;                                
            B02.SPRÅK(SØKER_IND)    = ENS.SPRÅK;                                
         END;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* DERSOM NYTT NAVN ER UTFYLT                                        */        
 /* ***************************************************************** */        
                                                                                
      IF ENS.NAVN_NYTT         ^= (25)' '   THEN                                
         DO;                                                                    
            TRANSTYPE           = 63;                                           
            FELT_UTFYLT         =  1           ;                                
            B02.NAVN(SØKER_IND) = ENS.NAVN_NYTT;                                
         END;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* DERSOM FRAMLEGGSDATO ER UTFYLT                                    */        
 /* ***************************************************************** */        
                                                                                
      IF ENK10.FRAML_DATO_ÅMD > 0 THEN                                          
         DO;                                                                    
            TRANSTYPE = 62;                                                     
            FELT_UTFYLT             = 1;                                        
                                                                                
            IF B01.PENSJONSTYPE2(SØKER_IND) ^= 'O'    THEN                      
               DO;                                                              
 L120:                                                                          
                  FEIL_VED_LABEL = '120';                                       
                  FEIL_MELD_NR   = 1521 ;                                       
                  GO TO L999;                                                   
               END;                                                             
                                                                                
 /* ***************************************************************** */        
 /* FEILMELD 1521: FRAMLEGG AVVIST. HAR IKKE OVERGANGSSTØNAD          */        
 /* ***************************************************************** */        
                                                                                
            IF ENK10.OPPHØR_EO = 'J' THEN                                       
               DO;                                                              
                  B02.FRAMLEGGSDATO_ÅMD(SØKER_IND) =                            
                                      ENK10.FRAML_DATO_ÅMD;                     
                  B02.FRAMLEGGSKODE(SØKER_IND) = 'O';                           
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  B02.FRAMLEGGSDATO_ÅMD(SØKER_IND) =                            
                                   ENK10.FRAML_DATO_ÅMD;                        
                  B02.FRAMLEGGSKODE(SØKER_IND) = 'A';                           
               END;                                                             
                                                                                
         END;                                                                   
                                                                                
 /* ***************************************************************** */        
 /* DERSOM NYTT NAVN EKTEFELLE ER UTFYLT                              */        
 /* ***************************************************************** */        
                                                                                
      IF ENS.NAVN_NYTT_EK ^= (25)' ' THEN                                       
         DO;                                                                    
            FELT_UTFYLT    =   1;                                               
                                                                                
 /* ***************************************************************** */        
 /* DERSOM EKTEFELLEN IKKE ER I BASEN                                 */        
 /* ***************************************************************** */        
                                                                                
            IF B01.FNR(EKTEF_IND) = 0 THEN                                      
               DO;                                                              
 L150:                                                                          
                  FEIL_VED_LABEL  = '150';                                      
                  FEIL_MELD_NR    =  1005;                                      
                  GO TO L999;                                                   
               END;                                                             
            ELSE                                                                
               DO;                                                              
                  TRANSTYPE           = 64              ;                       
                  B02.NAVN(EKTEF_IND) = ENS.NAVN_NYTT_EK;                       
               END;                                                             
          END;                                                                  
                                                                                
 /* ***************************************************************** */        
 /* DERSOM FORVENTET ERVERVSINNTEKT ER STØRRE ENN 0                   */        
 /* ***************************************************************** */        
                                                                                
       IF ENK7.FAI = 9999999 THEN                                               
          DO;                                                                   
             IF B02.ALDERSP.FAI(SØKER_IND) > 0   THEN                           
                CALL RULL_FAI(B02.G_DATO_ÅMD(SØKER_IND),                        
                              B02.VIRK_DATO_ÅMD(SØKER_IND),                     
                              B02.ALDERSP.FAI(SØKER_IND));                      
          END;                                                                  
       ELSE                                                                     
 /*    IF ENK7.FAI ^= 9999999 THEN        */                                    
          DO;                                                                   
             FELT_UTFYLT             = 1;                                       
             TRANSTYPE = 8;                                                     
                                                                                
 /* ***************************************************************** */        
 /* DERSOM PERSONEN IKKE ER REGISTRERT MED ALDERSPENSJON              */        
 /* ELLER AVTALEFESTET PENSJON                                        */        
 /* ***************************************************************** */        
                                                                                
             IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'A' &                           
                B01.PENSJONSTYPE1(SØKER_IND) ^= 'K' THEN                        
                DO;                                                             
 L160:                                                                          
                   FEIL_VED_LABEL  = '160';                                     
                   FEIL_MELD_NR    = 1509;                                      
                   GO TO L999;                                                  
                END;                                                            
             ELSE                                                               
                DO;                                                             
               /* NY TEST 200008 HL : */                                        
      /*    IF B01.EOAFP.INNTEKTSÅR(SØKER_IND,VIRK_ÅR) > 0  THEN */             
                  IF (STØNADSBREV_ØNSKET_IND = '1'B              &              
                      B01.EOAFP.INNTEKTSÅR(SØKER_IND,1) = VIRK_ÅR) THEN         
                     DO;  /* VI GODTAR IKKE ENDRING ETTER EO */                 
 L161:                    /* DERSOM STØNADSBREV SKAL SKRIVES */                 
                        FEIL_VED_LABEL  = '161';                                
                        FEIL_MELD_NR    =  618;                                 
                        GO TO L999;                                             
                     END; /* VI GODTAR IKKE ENDRING ETTER EO */                 
                                                                                
                  IF  FNR_R13.ÅR < 1925     !                                   
                     (B01.PENSJONSTYPE1(SØKER_IND) = 'K' &                      
                      (B01.UTTAKSDATO_ÅMD(SØKER_IND) < 19920000 !               
                       B01.UTTAKSDATO_ÅMD(SØKER_IND) > 20000799 )) THEN         
                    DO;                                                         
                       IF (ENK7.FAI          > 0        &                       
                           ENK7.FAI          < 15099    &                       
                           ENS.VIRK_DATO_ÅMD > 20020000 ) THEN                  
                          DO;  /* OPPDRAG 04021*/                               
                             IF (B01.PENSJONSTYPE1(EKTEF_IND) ^= 'F')           
                                THEN                                            
                                DO;  /* VI AVVISER KUN OM IKKE ET */            
  L163:                                                                         
                                   FEIL_VED_LABEL  = '163';                     
                                   FEIL_MELD_NR    = 627;                       
                                   GO TO L999;                                  
                                END; /* VI AVVISER KUN OM IKKE ET */            
                             ELSE                                               
                                B02.FAI(SØKER_IND) = 0;                         
                          END; /* OPPDRAG 04021*/                               
                       ELSE                                                     
                          B02.FAI(SØKER_IND) = ENK7.FAI / 100;                  
                    END;                                                        
                  ELSE                                                          
       /*         IF  ( FNR_R13.ÅR > 1924   !    200403 HL*/                    
                  IF  ( FNR_R13.ÅR > 1924   &                                   
                        B01.PENSJONSTYPE1(SØKER_IND) ^= 'K') !                  
                      ( B01.UTTAKSDATO_ÅMD(SØKER_IND)  > 19920000 &             
                        B01.PENSJONSTYPE1(SØKER_IND)  = 'K') THEN               
                   DO;                                                          
                                                                                
                     B02.FAI(SØKER_IND) = ENK7.FAI / 1000;/*HELE 1000*/         
                     B02.FAI(SØKER_IND) = B02.FAI(SØKER_IND) * 10;              
                   END;                                                         
                   B02.FAI_DATO_ÅMD(SØKER_IND) = HJ_VIRKDATO_ÅMD;               
    /*TS 010895    B02.ARBEIDSINNTEKT(SØKER_IND) = B02.FAI(SØKER_IND)*/         
                   B02.ARBEIDSINNTEKT(SØKER_IND) = ENK7.FAI / 100;              
          /*TS 010895 ARBEIDSINNTEKT SKLA VÆRE I HELE 100 KR IKKE 1000*/        
    /* LOVENDRING - HL 200811*/                                                 
                  IF (ALDER > 6712   !                                          
                      HJ_VIRKDATO_ÅMD < 20080000)   THEN;                       
                  ELSE                                                          
                  IF B01.PENSJONSTYPE1(SØKER_IND)  = 'A'  THEN                  
                     DO;                                                        
                        B02.FAI(SØKER_IND) = 0;                                 
                        B02.FAI_DATO_ÅMD(SØKER_IND) = 0;                        
                     END;                                                       
                END;                                                            
          END;                                                                  
                                                                                
                                                                                
 /*YS ENDRET 25.5.89 HL - VI SKAL REGNE MED AT SAMLET GRAD */                   
 /*YS                     GÅR NED DERSOM KAP11-GRAD ER FYLT*/                   
 /*YS                     UT, MEN IKKE KAP8-GRAD           */                   
                                                                                
        IF ENK11.YUG ^= 999                  THEN /*0797 HL*/                   
 /*           IF ENK8.UFG  = 0            THEN  */                              
              IF ENK8.UFG  = 999          THEN                                  
                 ENK8.UFG  = ENK11.YUG;                                         
                                                                                
 /*YS HIT 25.5.89 HL */                                                         
                                                                                
 /* ***************************************************************** */        
 /* DERSOM UFØREGRADEN ER UTFYLT / ELLER ENDRING I FRYSKODER          */        
 /* ***************************************************************** */        
                                                                                
    IF B01.PENSJONSTYPE3(SØKER_IND) = 'A'  THEN                                 
       IF ENK8.FRYSP_5ÅR_ARB ^= ' '   !                                         
          ENK8.FRYSP_TIDSB   ^= ' '           THEN                              
          DO;                                                                   
 L165:      /*IKKE FRYS FOR FORELØPIG/REHAB ***********9804** */                
             FEIL_VED_LABEL  = '165';                                           
             FEIL_MELD_NR    = 1546;                                            
             GO TO L999;                                                        
          END;                                                                  
    IF ENK8.UFG      ^= 999  !                   /*0797 HL*/                    
       ENK8.REAKTIVISERING ^= ' '   !             /*2005 HL*/                   
    /* ENK8.LØNNSTILSKUDD  ^= ' '   !                    HL*/                   
       ENK8.FRYSP_5ÅR_ARB ^= ' '   !             /*0797 HL*/                    
       ENK8.FRYSP_TIDSB   ^= ' '           THEN  /*0797 HL*/                    
       DO;                                                                      
          IF ENK8.UFG = 999 THEN                                                
             UFG_OPPDATER = 0;                                                  
          ELSE                                                                  
             UFG_OPPDATER = ENK8.UFG;            /*0797 HL*/                    
          TRANSTYPE   = 9;                                                      
          FELT_UTFYLT = 1;                                                      
                                                                                
 /* ***************************************************************** */        
 /* DERSOM PERSONEN IKKE ER REGISTRERT MED UFØREPENSJON               */        
 /* ***************************************************************** */        
                                                                                
          IF(B01.PENSJONSTYPE1(SØKER_IND) ^= 'U' &                              
             B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y') THEN                          
             DO;                                                                
 L170:                                                                          
                FEIL_VED_LABEL = '170';                                         
                FEIL_MELD_NR   = 1512;                                          
                GO TO L999;                                                     
             END;                                                               
                                                                                
          IF ^ (ENK8.UFG = 15 ! ENK8.UFG = 20 ! ENK8.UFG = 25 !                 
                ENK8.UFG = 30 ! ENK8.UFG = 35 ! ENK8.UFG = 40 !                 
                ENK8.UFG = 45 ! ENK8.UFG = 50 ! ENK8.UFG = 55 !                 
                ENK8.UFG = 60 ! ENK8.UFG = 65 ! ENK8.UFG = 70 !                 
                ENK8.UFG = 75 ! ENK8.UFG = 80 ! ENK8.UFG = 85 !                 
                ENK8.UFG = 100!                                                 
                ENK8.UFG = 0  !                                                 
                ENK8.UFG = 90 ! ENK8.UFG = 95 ! ENK8.UFG = 999 ) THEN           
                                                                                
              IF ( ENS.VIRK_DATO_ÅMD < 20010900)   !                            
      /*         (ENK8.REAKTIVISERING = 'X')   !                                
                 (ENK8.FRYSP_5ÅR_ARB ^= 'S'    &                                
                  ENK8.FRYSP_TIDSB   ^= 'S'    &                                
                  B02.FRYSKODE(SØKER_IND) = ' ')   !                            
                 (ENK8.FRYSP_5ÅR_ARB  = 'X'    &                                
                  ENK8.FRYSP_TIDSB   ^= 'S'    )   !                            
                 (ENK8.FRYSP_TIDSB    = 'X'    &                                
                  ENK8.FRYSP_5ÅR_ARB ^= 'S'    )   THEN    */                   
                  W_BARE_DEL5                      THEN                         
             DO;                                                                
 L175:                                                                          
                FEIL_VED_LABEL = '175';                                         
                FEIL_MELD_NR   = 343;                                           
                GO TO L999;                                                     
             END;                                                               
                                                                                
          /* -------------------------------------------------------- */        
          /* TD 93, DERSOM TIDLIGERE REGISTRERT FRYS 3 ÅR VIL SYSTEM- */        
          /*        EIER HA DENNE MELDING                             */        
          /* -------------------------------------------------------- */        
          IF (B01.FRYSKODE(SØKER_IND) = '1' &                                   
              ENK8.LØNNSTILSKUDD      = 'S' ) &                                 
   /*        (ENK8.FRYSP_3ÅR_ARB     ^= 'X' !                                   
              ENK8.FRYSP_TIDSB       ^= 'S' ) THEN       */                     
            ^(ENK8.FRYSP_5ÅR_ARB      = 'X' &                                   
              ENK8.FRYSP_TIDSB        = 'S' ) THEN                              
             DO;                                                                
 L176:                                                                          
                FEIL_VED_LABEL = '176';                                         
                FEIL_MELD_NR   = 686;                                           
                GO TO L999;                                                     
             END;                                                               
                                                                                
          /* -------------------------------------------------------- */        
          IF (ENK8.UFG ^= 999        &                                          
              ENK8.UFG         >  B01.UFØRPENS.UFG(SØKER_IND))  THEN            
             DO;                                                                
 L180:                                                                          
                FEIL_VED_LABEL = '180';                                         
                FEIL_MELD_NR   = 1513;                                          
                GO TO L999;                                                     
             END;                                                               
                                                                                
          IF (ENK8.UFG = 0      )   &                                           
            ^W_FRYS                       THEN                                  
             DO;                                                                
 L181:                            /*OPPDRAG 05187 -200506 HL*/                  
                FEIL_VED_LABEL = '181';                                         
                FEIL_MELD_NR   =  688;                                          
                GO TO L999;                                                     
             END;                                                               
                                                                                
 /* ***************************************************************** */        
 /* TESTING I FORBINDELSE MED FRYSPERIODER-UFØREPENSJON-0797 HL       */        
 /*             FRYSKODE=1:5ÅR, FRYSKODE=2:UBEGRENSET                 */        
 /* ***************************************************************** */        
 /* 1. START FRYSPERIODE 5 ÅR:                                        */        
 /* ***************************************************************** */        
                                                                                
          IF ENK8.FRYSP_5ÅR_ARB = 'S'           THEN                            
             IF B01.FRYSKODE(SØKER_IND) = '1'      THEN                         
                DO;                                                             
                   IF (B01.FRYSDATO_ÅMD(SØKER_IND)                              
                        =ENS.VIRK_DATO_ÅMD ) THEN                               
                      DO;  /* REMEDY 205 */                                     
                         B02.FRYSKODE(SØKER_IND) =                              
                            B01.FRYSKODE(SØKER_IND);                            
                         B02.FRYSDATO_ÅMD(SØKER_IND) =                          
                            B01.FRYSDATO_ÅMD(SØKER_IND);                        
                      END; /* REMEDY 205 */                                     
                   /* TD 93 VAR IKKE SLIK ALIKEVEL...                           
                   IF (ENK8.LØNNSTILSKUDD = 'S') THEN                           
                      DO;  /* TD 68 - NYTT UNNTAK */                            
                   /*    B02.FRYSKODE(SØKER_IND) =                              
                            B01.FRYSKODE(SØKER_IND);                            
                         B02.FRYSDATO_ÅMD(SØKER_IND) =                          
                            ENS.VIRK_DATO_ÅMD;                                  
                      END; /* TD 68 - NYTT UNNTAK */                            
                   ELSE                                                         
                      DO; /* REMEDY 205 */                                      
 /*ALLEREDE REGISTRERT MED FRYSPERIODE 5 ÅR   *********************** */        
                                                                                
                         FEIL_VED_LABEL = '181';                                
                         FEIL_MELD_NR   =  432;                                 
                         GO TO L999;                                            
                      END; /* REMEDY 205 */                                     
                END;                                                            
             ELSE                                                               
             IF B01.FRYSKODE(SØKER_IND) = '2'      THEN                         
                IF ENK8.FRYSP_TIDSB ^= 'X'                 THEN                 
                   DO;                                                          
 /*VED OVERGANG TIL ANNEN TYPE FRYS SKAL DET SETTES 'X' FOR OPPHØR    */        
 L182:                                                                          
                      FEIL_VED_LABEL = '182';                                   
                      FEIL_MELD_NR   =  434;                                    
                      GO TO L999;                                               
                   END;                                                         
                ELSE                                                            
                DO;                                                             
 /*OVERGANG FRA TYPE 2 TIL TYPE 1*/                                             
                   B02.FRYSKODE(SØKER_IND) = '1';                               
                   B02.FRYSDATO_ÅMD(SØKER_IND) =                                
                                ENS.VIRK_DATO_ÅMD;                              
                END;                                                            
             ELSE   /*IKKE REGISTRERT MED FRYSKODE FRA FØR*/                    
                DO;                                                             
                   IF ENK8.UFG ^< B01.UFØRPENS.UFG(SØKER_IND) THEN              
                      DO;                                                       
 /*VED START AV FRYSPERIODE SKAL UFG SETTES NED                       */        
 L183:                                                                          
                         FEIL_VED_LABEL = '183';                                
                         IF (ENK8.LØNNSTILSKUDD = 'S') THEN                     
                            FEIL_MELD_NR   =  678;                              
                         ELSE                                                   
                            FEIL_MELD_NR   =  433;                              
                         GO TO L999;                                            
                      END;                                                      
                   ELSE                                                         
                      DO;                                                       
                         B02.FRYSKODE(SØKER_IND) = '1';                         
                         B02.GARANTIGRAD(SØKER_IND) =                           
                            B01.UFØRPENS.UFG(SØKER_IND);                        
                         B02.FRYSDATO_ÅMD(SØKER_IND) =                          
                                       ENS.VIRK_DATO_ÅMD;                       
                                                                                
  /*YRKEGRAD REDUSERES I SAMME FORHOLD SOM UFG I FRYSPERIODEN: */               
                                                                                
   /* KOMM UT 0200 MH    IF B01.YRKEPENS.YUG(SØKER_IND) > 0  THEN               
                          DO                                                    
                           B02.YRKEPENS.GARANTI_YRKEGRAD(SØKER_IND)             
                             = B01.YRKEPENS.YUG(SØKER_IND)                      
                           ENK11.YUG =                                          
                           B01.YRKEPENS.YUG(SØKER_IND) *                        
                           B02.YRKEPENS.GARANTI_YRKEGRAD(SØKER_IND) /           
                           B01.UFØRPENS.UFG(SØKER_IND)  + 0.5                   
                          END                                                   
  /*HIT 9904 OG 0200 */                                                         
                      END;                                                      
                END;                                                            
          ELSE                                                                  
 /* ***************************************************************** */        
 /* 2. START FRYSPERIODE UTEN TIDSBEGRENSNING                         */        
 /* ***************************************************************** */        
          IF ENK8.FRYSP_TIDSB   = 'S'           THEN                            
             IF B01.FRYSKODE(SØKER_IND) = '2'      THEN                         
                DO;                                                             
 /*ALLEREDE REGISTRERT MED UBEGRENSET FRYSPERIODE                     */        
 L184:                                                                          
                   FEIL_VED_LABEL = '184';                                      
                   FEIL_MELD_NR   =  434;                                       
                   GO TO L999;                                                  
                END;                                                            
             ELSE                                                               
             IF B01.FRYSKODE(SØKER_IND) = '1'      THEN                         
                IF ENK8.FRYSP_5ÅR_ARB ^= 'X'               THEN                 
                   DO;                                                          
 /*VED OVERGANG TIL ANNEN TYPE FRYS SKAL DET SETTES 'X' FOR OPPHØR    */        
 L185:                                                                          
                      FEIL_VED_LABEL = '185';                                   
                      FEIL_MELD_NR   =  432;                                    
                      GO TO L999;                                               
                   END;                                                         
                ELSE                                                            
 /*OVERGANG FRA TYPE 1 TIL TYPE 2*/                                             
                DO;                                                             
                   B02.FRYSKODE(SØKER_IND) = '2';                               
                   B02.FRYSDATO_ÅMD(SØKER_IND) =                                
                                 ENS.VIRK_DATO_ÅMD;/* 2000-3*/                  
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   IF ENK8.UFG ^< B01.UFØRPENS.UFG(SØKER_IND) THEN              
                      DO;                                                       
 /*VED START AV FRYSPERIODE SKAL UFG SETTES NED                       */        
 L186:                                                                          
                         FEIL_VED_LABEL = '186';                                
                         FEIL_MELD_NR   =  433;                                 
                         GO TO L999;                                            
                      END;                                                      
                   ELSE                                                         
                      DO;                                                       
                         B02.FRYSKODE(SØKER_IND) = '2';                         
                         B02.GARANTIGRAD(SØKER_IND) =                           
                            B01.UFØRPENS.UFG(SØKER_IND);                        
                         B02.FRYSDATO_ÅMD(SØKER_IND) =/* 2000-3 */              
                                       ENS.VIRK_DATO_ÅMD;                       
                                                                                
  /*YRKEGRAD REDUSERES I SAMME FORHOLD SOM UFG I FRYSPERIODEN: */               
                                                                                
  /* KOMM UT 0200 MH     IF B01.YRKEPENS.YUG(SØKER_IND) > 0  THEN               
                          DO                                                    
                           B02.YRKEPENS.GARANTI_YRKEGRAD(SØKER_IND)             
                             = B01.YRKEPENS.YUG(SØKER_IND)                      
                           ENK11.YUG =                                          
                           B01.YRKEPENS.YUG(SØKER_IND) *                        
                           B02.YRKEPENS.GARANTI_YRKEGRAD(SØKER_IND) /           
                           B01.UFØRPENS.UFG(SØKER_IND)  + 0.5                   
                          END                                                   
  /*HIT 9904 OG 0200 */                                                         
                      END;                                                      
                END;                                                            
          ELSE                                                                  
 /* ***************************************************************** */        
 /* 3. SLUTT FRYSPERIODE 5 ÅR: Nå SKAL UFØREGRADEN SETTES LAVERE ENN  */        
 /*    I FRYSPERIODEN                                                 */        
 /* ***************************************************************** */        
          IF ENK8.FRYSP_5ÅR_ARB = 'X'           THEN                            
             IF B01.FRYSKODE(SØKER_IND) ^= '1'      THEN                        
                DO;                                                             
 /*OPPHØR AVVVISES - HAR IKKE SLIK FRYS FRA FØR                       */        
 L187:                                                                          
                   FEIL_VED_LABEL = '187';                                      
                   FEIL_MELD_NR   =  436;                                       
                   GO TO L999;                                                  
                END;                                                            
             ELSE                                                               
             IF ENK8.UFG ^< B01.UFØRPENS.UFG(SØKER_IND)   THEN                  
                DO;                                                             
 /*OPPHØR AVVVISES - DET MÅ REGISTRERES LAVERE UFG ENN FØR    */                
 L188:                                                                          
                   FEIL_VED_LABEL = '188';                                      
                   FEIL_MELD_NR   =  443;                                       
                   GO TO L999;                                                  
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   B02.FRYSKODE(SØKER_IND) = ' ' ;                              
                   B02.FRYSDATO_ÅMD(SØKER_IND) = 0;                             
                   B02.GARANTIGRAD(SØKER_IND) = 0;                              
                                                                                
 /*9904 : KOMM UT 0200 MH                                                       
                   IF B01.GARANTI_YRKEGRAD(SØKER_IND) > 0 THEN                  
                      DO                                                        
                         ENK11.YUG =                                            
                         B01.GARANTI_YRKEGRAD(SØKER_IND)                        
                         B01.GARANTI_YRKEGRAD(SØKER_IND) = 0                    
                      END                                                       
 /*HIT 9904 TIL HIT 0200 MH */                                                  
                END;                                                            
                                                                                
 /* ***************************************************************** */        
 /* 4. SLUTT FRYSPERIODE UTEN TIDSBEGRENSNING                         */        
 /*          HVIS UFØREGRAD IKKE ER SATT, SÅ SKAL GARANTIGRADEN INN - */        
 /*          VI SETTER DA TRANSTYPE = 2 - FOR Å FÅ TEST PÅ OM DET SKAL*/        
 /*          VÆRE NYTT UFØRETIDSPUNKT                                 */        
 /* ***************************************************************** */        
          IF ENK8.FRYSP_TIDSB   = 'X'           THEN                            
             IF B01.FRYSKODE(SØKER_IND) ^= '2'      THEN                        
                DO;                                                             
 /*OPPHØR AVVVISES - HAR IKKE SLIK FRYS FRA FØR                       */        
 L189:                                                                          
                   FEIL_VED_LABEL = '189';                                      
                   FEIL_MELD_NR   =  435;                                       
                   GO TO L999;                                                  
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   B02.FRYSKODE(SØKER_IND) = ' ' ;                              
                   B02.FRYSDATO_ÅMD(SØKER_IND) = 0;                             
                   IF ENK8.UFG = 999                  THEN                      
                      DO;                                                       
                         UFG_OPPDATER = B01.GARANTIGRAD(SØKER_IND);             
                         TRANSTYPE = 2;                                         
                      END;                                                      
                   B02.GARANTIGRAD(SØKER_IND) = 0;                              
                                                                                
 /*9904 : KOMM UT 0200 MH                                                       
                   IF B01.GARANTI_YRKEGRAD(SØKER_IND) > 0 THEN                  
                      DO                                                        
                         ENK11.YUG =                                            
                         B01.GARANTI_YRKEGRAD(SØKER_IND)                        
                         B01.GARANTI_YRKEGRAD(SØKER_IND) = 0                    
                      END                                                       
 /*HIT 9904 TIL HIT 0200 MH */                                                  
                END;                                                            
                                                                                
   /*----------------------------------------------------------*/               
   /*GARANTI_TP UFG REDUSERES. VI MÅ FORETA EN MANUELL BEH. AV */               
   /*GARANTI_TP. TRUDE 0992                                    */               
   /*----------------------------------------------------------*/               
                                                                                
          SISTE_UTFYLTE       = 0;                                              
                                                                                
          DO I = LBOUND(B02.UFØRHIST,2) TO HBOUND(B02.UFØRHIST,2);              
           IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) = 0 THEN                        
            DO;                                                                 
              SISTE_UTFYLTE    = I - 1;                                         
                                                                                
              IF I             = 1               THEN                           
                 SISTE_UTFYLTE = 1;                                             
              I                = 7;       /*0697 HL*/                           
            END;                                                                
          END;                                                                  
                                                                                
   L191:                                                                        
        IF (B01.GARANTI_TP(SØKER_IND)  > 0)  &                                  
           (ENK8.FRYSP_TIDSB   = 'X'      )    THEN                             
          DO;                                                                   
            IF B01.UFØRHIST.UFG (SØKER_IND,SISTE_UTFYLTE) >                     
 /*0797 HL*/                     UFG_OPPDATER                   THEN            
               DO;                                                              
                 FEIL_VED_LABEL = '191';                                        
                 FEIL_MELD_NR   = 383;                                          
                 GO TO L999;                                                    
               END;                                                             
         END;                                                                   
  /* TIL HIT TRUDE 0992 */                                                      
                                                                                
 /*ENDRING 9705 HL:*/                                                           
 /*  IF (HJ_VIRKDATO_ÅMD > 19970400)          THEN */                           
     /* ------------------------------------------------------------- */        
     /* REMEDY 392:                                                   */        
     /* IFLG KRAVSPESIFIKASJON FRYSPERIODER FOR UFØREPENSJON 16.4.97  */        
     /*   "1.3 IKRAFTTREDELSESTIDSPUNKT                               */        
     /*                                                               */        
     /*    REGELENDRINGEN OM FRYSPERIODE PÅ TRE ÅR TRER I KRAFT FRA   */        
     /*    1.5.97. ENDRINGEN GJELDER BÅDE FOR LØPENDE OG NYE UFØRE-   */        
     /*    PENSJONER. ALLE SOM HAR STATET ARBEIDSFORSØK ETTER 30.     */        
     /*    APRIL 1996, SKAL OGSÅ BEHANDLES ETTER DE NYE FRYSREGLENE   */        
     /*    FOR UFØREPENSJON. STARTEN PÅ EN FRYSPERIODE PÅ TRE ÅR KAN  */        
     /*    DERFOR TIDLIGST VÆRE 1.5.96. JF. OT.PRP NR 8 (REF 2) OG    */        
     /*    OT PRP NR 26 (REF4)"                                       */        
     /* ------------------------------------------------------------- */        
     IF (HJ_VIRKDATO_ÅMD > 19960400)          THEN                              
        DO;                                                                     
           IF (ENK8.UFG     < 50)   &    /*0797 HL*/                            
              (B01.PENSJONSTYPE3(SØKER_IND) = 'A' )      THEN                   
              DO;                                                               
   L192:                                                                        
                 FEIL_VED_LABEL = '192';                                        
                 FEIL_MELD_NR   = 427;                                          
                 GO TO L999;                                                    
              END;                                                              
           ELSE                                                                 
           IF (ENK8.UFG     < 20)  &    /*0797 HL*/                             
              (ENK8.UFG     ^= 0)  &                                            
              (B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y' )     THEN                   
              DO;                                                               
   L193:                                                                        
                 FEIL_VED_LABEL = '193';                                        
                 FEIL_MELD_NR   = 38;                                           
                 GO TO L999;                                                    
              END;                                                              
        END;                                                                    
     ELSE    /*DA ER VIRKDATO < 9605*/                                          
     IF ENK8.UFG     < 50           THEN       /*0797 HL*/                      
          DO;                                                                   
             IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y'  !                          
                ENK8.UFG > B01.YRKEPENS.YUG(SØKER_IND) THEN                     
                DO;                                                             
    L195:                                                                       
                    FEIL_VED_LABEL = '195';                                     
                    FEIL_MELD_NR   = 1535 ;                                     
                    GO TO L999;                                                 
                END;                                                            
          END;                                                                  
                                                                                
                                                                                
          IF (ENK11.YUG = 0   !                                                 
              ENK11.YUG = 999)  &             /*9805 HL    KONS RF */           
             ENK8.UFG     < B01.YRKEPENS.YUG(SØKER_IND) THEN /*0797HL*/         
             DO;                                                                
                                                                                
                /* ENDRET 090589 BRITT: TILFELLET AVVISES IKKE, */              
                /*                      KAP11-GRAD SETTES LIK   */              
                /*                      KAP8-GRAD.              */              
                                                                                
                ENK11.YUG      = ENK8.UFG    ;              /*0797 HL*/         
                                                                                
                /* HIT 090589 BRITT.                            */              
                                                                                
             END;                                                               
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* FEILMELD 1534: HØYERE YRKESSKADE-GRAD MÅ REGISTRERES MED          */        
 /*                GRUNNBLANKETT                                      */        
 /* ***************************************************************** */        
                                                                                
          IF ENK8.UFG         =  B01.UFØRPENS.UFG(SØKER_IND)  &                 
             ENK11.YUG    >= B01.YRKEPENS.YUG(SØKER_IND)      &                 
             ENK11.YUG    ^= 999                              &                 
             ENK8.FRYSP_5ÅR_ARB = ' '               &      /*0797 HL*/          
             ENK8.FRYSP_TIDSB   = ' '             THEN     /*0797 HL*/          
                DO;                                                             
 L201:                                                                          
                   FEIL_VED_LABEL = '201';                                      
                   FEIL_MELD_NR   = 1534;                                       
                   GO TO L999;                                                  
                END;                                                            
                                                                                
          ELSE              /*ENDRING I KAP8-GRAD */                            
          IF (ENK8.UFG ^= 999)   !                                              
             (UFG_OPPDATER > 0)                 THEN                            
             DO I = LBOUND(B02.UFØRHIST,2) TO HBOUND(B02.UFØRHIST,2);           
                                                                                
                IF B02.UFØRHIST.UFT_ÅMD(SØKER_IND,I)   =  0       THEN          
                   DO;                                                          
 /*0797 HL*/          B02.UFØRPENS.UFG (SØKER_IND) = UFG_OPPDATER    ;          
                      I                                =  I - 1      ;          
                                                                                
          /*          DO J = 1 TO 7;      0697 HL*/                             
  /*JFA 14.4.04*/     DO J = LBOUND(B02.UFØRGRAD,3) TO                          
                             HBOUND(B02.UFØRGRAD,3);                            
                         IF B02.UFG_DATO_ÅMD(SØKER_IND,I,J) = 0 THEN            
                            DO;                                                 
                               IF (J = 1                            &           
                                   B02.UFØRHIST.UFG (SØKER_IND,I)  ^=           
                                   B02.UFØRPENS.UFG (SØKER_IND  ))   !          
                                                                                
                                  (J > 1                            &           
                                   B02.UFG_ØVRIGE(SØKER_IND,I,J-1) ^=           
                                   B02.UFØRPENS.UFG (SØKER_IND )) THEN          
                                                                                
                                   DO;                                          
                                      B02.UFG_ØVRIGE  (SØKER_IND,I,J) =         
                                          B02.UFØRPENS.UFG(SØKER_IND) ;         
                                      B02.UFG_DATO_ÅMD(SØKER_IND,I,J) =         
                                                     ENS.VIRK_DATO_ÅMD;         
                                      /* --------------------------- */         
                                      B02.VIRK_UFØRGRAD_ÅMD                     
                                           (SØKER_IND,I,J)                      
                                        = ENS.VIRK_DATO_ÅMD;                    
                                  IF (J > 1) THEN                               
                                     DO;  /* HAR UFØREGRAD FRA FØR */           
                                        /* -------------------------- */        
                                        B02.YNGSTE_BARN_FÅR_GRAD                
                                           (SØKER_IND,I,J)                      
                                        = B02.YNGSTE_BARN_FÅR_GRAD              
                                            (SØKER_IND,I,J-1);                  
                                        /* -------------------------- */        
                                        B02.FRIINNTEKT_FRA_GRAD_ÅMD             
                                           (SØKER_IND,I,1)                      
                                        = B02.FRIINNTEKT_FRA_HIST_ÅMD           
                                            (SØKER_IND,I);                      
                                        /* -------------------------- */        
                                     END; /* HAR UFØREGRAD FRA FØR */           
                                  ELSE                                          
                                     DO;  /* IKKE UFØREGRAD FRA FØR */          
                                        /* -------------------------- */        
                                        B02.YNGSTE_BARN_FÅR_GRAD                
                                           (SØKER_IND,I,1)                      
                                        = B02.YNGSTE_BARN_FÅR_HIST              
                                            (SØKER_IND,I);                      
                                        /* -------------------------- */        
                                        B02.FRIINNTEKT_FRA_GRAD_ÅMD             
                                           (SØKER_IND,I,1)                      
                                        = B02.FRIINNTEKT_FRA_HIST_ÅMD           
                                            (SØKER_IND,I);                      
                                     END; /* IKKE UFØREGRAD FRA FØR */          
                                                   /* 9913 */                   
                /*230502 SP           B02.FRYSP_5ÅR_ARB(SØKER_IND,I,J)=         
                                          ENK8.FRYSP_5ÅR_ARB;                   
                                      B02.FRYSP_TIDSB  (SØKER_IND,I,J)=         
                                          ENK8.FRYSP_TIDSB;                     
                    FJERNT                                 */                   
                                   END;                                         
                                   J = HBOUND(B02.UFØRGRAD,3); /*0404*/         
                                   I = 7;     /*0697 HL*/                       
                            END;                                                
                         ELSE                                                   
                            /*----------------------------------------*/        
                            /* UFØREPERIODENE ER BRUKT OPP - ): FEIL. */        
                            /*----------------------------------------*/        
                                                                                
                            IF J = HBOUND(B02.UFØRGRAD,3) THEN                  
                               DO;                                              
  L205:                                                                         
                                  FEIL_VED_LABEL = '205';                       
                                  FEIL_MELD_NR   = 1804;                        
                                  GO TO L999;                                   
                               END;                                             
                      END;                                                      
                   END;                                                         
             END;                                                               
                                                                                
              /*------------------------------------------------------*/        
              /* YRKEGRADEN ER GÅTT NED TIL 0, MEN HAR UP ETTER KAP 8 */        
              /* TRUDE 011189                                         */        
              /*------------------------------------------------------*/        
                                                                                
           IF ENK11.YUG                     = 0  &                              
              ENK8.UFG                     ^= 0  &     /*HL*/                   
              B01.PENSJONSTYPE1(SØKER_IND)  = 'Y'  THEN                         
              DO;                                                               
                 B02.YRKEPENS(SØKER_IND)   = '';                                
                 DO I = LBOUND(B01.YRKEHIST,2) TO                               
                        HBOUND(B01.YRKEHIST,2);                                 
                    IF B01.YRKEHIST.YUFT_ÅMD   (SØKER_IND,I)  > 0 &             
                       B01.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,I) = 0 THEN         
                       DO;                                                      
                          B02.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,I) =             
                                                     ENS.VIRK_DATO_ÅMD;         
                          B02.YRKEHIST.OPPH_KODE   (SØKER_IND,I) = 'J';         
                                                                                
                          I = HBOUND(B01.YRKEHIST,2);                           
                       END;                                                     
                 END;                                                           
                 B02.PENSJONSTYPE1(BER_SØ_IND)    = 'U';                        
                                                                                
                       /* VI MÅ ENDRE TILKNYTNINGSKODE FOR EKTEFELLE*/          
                                                                                
                 DO K = 1 TO 13 WHILE(B02.FNR_TILKN(EKTEF_IND,K) > 0);          
                    IF B02.FNR_TILKN(EKTEF_IND,K) = B02.FNR(SØKER_IND)          
                                                       THEN                     
                      DO;                                                       
                       B02.TILKNYTNINGSKODE(EKTEF_IND,K)  = 'U';                
                      END;                                                      
                 END;                                                           
                                                                                
                       /* VI MÅ ENDRE TILKNYTNINGSKODE FOR BARN     */          
                                                                                
                 DO K = 1 TO 13 WHILE(B01.FNR_TILKN(SØKER_IND,K) > 0);          
                    IF B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,K) = 'L' !          
  /*HL*/               B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,K) = 'V' !          
                       B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,K) = 'W'            
                                                       THEN                     
                      DO;                                                       
                        DO BARN_IND = 3 TO 14 UNTIL(B01.FNR(BARN_IND) =         
                                     B01.TILKN.FNR_TILKN(SØKER_IND,K));         
                        END;                                                    
                        B02.TILKN.TILKNYTNINGSKODE(BARN_IND,1)  = 'U';          
                      END;                                                      
                 END;                                                           
              END;   /*------------ TIL HIT TRUDE 021189-----------*/           
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
          /*----------------------------------------------------------*/        
          /* DET ER EN ENDRING I UFØRE-GRADEN . DETTE KAN ENDRE       */        
          /* PENSJONS-POENGET FOR DETTE ÅRET .                        */        
          /* FNR , TKNR , DAGENS DATO , KLOKKE-SLETTET LEGGES UT      */        
          /* PÅ EN FILE TIL BRUK I NORTRYGD HVIS DET ER ET NOR_KONTOR.*/        
          /*----------------------------------------------------------*/        
                                                                                
 /* CALL P900_NOR_DATA(B02.FNR(SØKER_IND),(B02.TKNR(SØKER_IND)))  */            
       END;    /*SLUTT PÅ TEST OM UFG = 999 */                                  
                                                                                
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* DERSOM INNTEKT-FØR-UP  ER UTFYLT                                 */         
 /* ***************************************************************** */        
                                                                                
    IF ENK8.INNTEKT_FØR_UP ^= 0 THEN                                            
       DO;  /* INNTEKT FØR UP UTFYLT */                                         
          TRANSTYPE   = 9;                                                      
          FELT_UTFYLT = 1;                                                      
          /* -------------------------------------------------------- */        
          /* DERSOM PERSONEN IKKE ER REGISTRERT MED UFØREPENSJON      */        
          /* -------------------------------------------------------- */        
                                                                                
          IF (B01.PENSJONSTYPE1(SØKER_IND) ^= 'U' &                             
              B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y') THEN                         
             DO;                                                                
 L206:                                                                          
                FEIL_VED_LABEL = '206';                                         
                FEIL_MELD_NR   = 1512;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
             DO; /* VEDKOMMENDE HAR UFØREPENSJON */                             
                /* -------------------------------------------------- */        
                /* DERSOM PERSONEN HAR UFØREPENSJON, KONTROLLERES DET */        
                /* AT INNTEKTSDATO ER LIK FØRSTE UFØRETIDSPUNKT       */        
                /* -------------------------------------------------- */        
                IF ^(B01.UFØRHIST.UFT_ÅMD(SØKER_IND,1) =                        
                                ENK8.INNT_DATO_ÅMD    ) THEN                    
                   DO;  /* ULIKT UFØRETIDSPUNKT */                              
 L207:                                                                          
                      FEIL_VED_LABEL = '207';                                   
                      FEIL_MELD_NR   = 1740;                                    
                      GO TO L999;                                               
                   END; /* ULIKT UFØRETIDSPUNKT */                              
                ELSE                                                            
                   DO; /* OPPDATER B02 MED INNTEKTSOPPLYSNINGER */              
                      B02.UFØRPENS.INNTEKT_FØR_UP (SØKER_IND)                   
                         = ENK8.INNTEKT_FØR_UP / 100;                           
                      B02.UFØRPENS.INNT_DATO_ÅMD(SØKER_IND)                     
                         =            ENK8.INNT_DATO_ÅMD;                       
                   END;/* OPPDATER B02 MED INNTEKTSOPPLYSNINGER */              
             END; /* VEDKOMMENDE HAR UFØREPENSJON */                            
       END; /* INNTEKT FØR UP UTFYLT */                                         
                                                                                
 /*YS**** *********************************************************** */        
 /*YS**** DERSOM YRKEGRADEN ER UTFYLT                                 */        
 /*YS**** *********************************************************** */        
                                                                                
        IF ENK11.YUG ^= 999 THEN     /*0797 HL*/                                
           DO;                                                                  
              TRANSTYPE = 9;                                                    
              FELT_UTFYLT = 1;                                                  
                                                                                
 /*YS**** *********************************************************** */        
 /*YS**** DERSOM PERSONEN IKKE ER REGISTRERT MED YRKESSKADE           */        
 /*YS**** *********************************************************** */        
                                                                                
              IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y' THEN                       
                 DO;                                                            
         L210:                                                                  
                    FEIL_VED_LABEL = '210';                                     
                    FEIL_MELD_NR = 1533;                                        
                    GO TO L999;                                                 
                 END;                                                           
                                                                                
                                                                                
 /*YS**** *********************************************************** */        
 /*YS**** FEILMELD 1534: ENDRING I UFØREPENSJON AVVISES. NY YRKEGRAD  */        
 /*YS**** ER IKKE LAVERE ENN REGISTRERT YRKEGRAD.                     */        
 /*YS**** *********************************************************** */        
  /*TILLEGG 200508 HL : */                                                      
              IF (ENK8.FRYSP_5ÅR_ARB  = 'S'  !                                  
                  ENK8.FRYSP_TIDSB    = 'S'    )  &                             
                  B01.YRKEPENS.YUG(SØKER_IND) > 0       THEN                    
                  B02.GARANTI_YRKEGRAD(SØKER_IND) =                             
                     B01.YRKEPENS.YUG(SØKER_IND);                               
              IF ENK11.YUG   >  B01.YRKEPENS.YUG(SØKER_IND) /* & */             
             /*  ENK8.FRYSP_TIDSB ^= 'X'  */      THEN                          
 /*HIT 9904*/                                                                   
                 DO;                                                            
         L212:                                                                  
                    FEIL_VED_LABEL = '212';                                     
                    FEIL_MELD_NR = 1534;                                        
                    GO TO L999;                                                 
                 END;                                                           
              ELSE                                                              
                 DO I = LBOUND(B02.YRKEHIST,2) TO                               
                        HBOUND(B02.YRKEHIST,2);                                 
                    IF B02.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) = 0     THEN          
                       DO;                                                      
                          B02.YRKEPENS.YUG (SØKER_IND) =  ENK11.YUG  ;          
                          I                            =  I - 1      ;          
                                                                                
                          DO J = 1 TO 5;                                        
                                                                                
                             IF B02.YUG_ØVRIGE(SØKER_IND,I,J) = 0 THEN          
                                DO;                                             
                                                                                
                                   IF                                           
                                     (J = 1                        &            
                                      B02.YRKEHIST.YUG (SØKER_IND,I) ^=         
                                      B02.YRKEPENS.YUG (SØKER_IND )) !          
                                                                                
                                     (J > 1                       &             
                                      B02.YUG_ØVRIGE(SØKER_IND,I,J-1) ^=        
                                      B02.YRKEPENS.YUG (SØKER_IND ))            
                                                                    THEN        
                                                                                
                                       DO;                                      
                                          B02.YUG_ØVRIGE                        
                                                      (SØKER_IND,I,J) =         
                                           B02.YRKEPENS.YUG(SØKER_IND);         
                                          B02.YUG_DATO_ÅMD                      
                                                      (SØKER_IND,I,J) =         
                                                      ENS.VIRK_DATO_ÅMD;        
                                                       /* 9913 */               
                                       END;                                     
                                    J = 5;                                      
                                    I = 10;                                     
                                END;                                            
                             ELSE                                               
                                /*------------------------------------*/        
                                /* YRKEPERIODENE ER BRUKT OPP - ):    */        
                                /* FEIL.                              */        
                                /*------------------------------------*/        
                                                                                
                                IF J = 5 THEN                                   
                                   DO;                                          
         L215:                                                                  
                                      FEIL_VED_LABEL = '215';                   
                                      FEIL_MELD_NR = 1810;                      
                                      GO TO L999;                               
                                   END;                                         
                          END;                                                  
                       END;                                                     
                 END;                                                           
                                                                                
              /*------------------------------------------------------*/        
              /* DET ER EN ENDRING I YRKE-GRADEN . DETTE KAN ENDRE    */        
              /* PENSJONS-POENGET FOR DETTE ÅRET .                    */        
              /* FNR , TKNR , DAGENS DATO , KLOKKE-SLETTET LEGGES UT  */        
              /* PÅ EN FILE TIL BRUK I NORTRYGD HVIS DET ER ET        */        
              /* NOR_KONTOR.                                          */        
              /*------------------------------------------------------*/        
             /*                                                                 
               CALL P900_NOR_DATA                                               
                          (B02.FNR(SØKER_IND),(B02.TKNR(SØKER_IND)))            
             */                                                                 
           END;                                                                 
                                                                                
 /* ***************************************************************** */        
 /* TIDLIGERE FORSØRGET EKTEFELLE STOD IGJEN MED PENSJONSTYPE1 = 'F'  */        
 /* OGSÅ ETTER AT TOTALGRADEN BLE UNDER 50 PROSENT.  DET SOM ER       */        
 /* RIKTIG, ER AT EKTEFELLEN SKAL HA PENSJONSTYPE1 = 'G'.             */        
 /* PENSJONISTEN SELV SKAL HA PENSJONSTYPE2 = 'P'.                    */        
 /* ERIK, 11.1.1990.                                                  */        
 /* ***************************************************************** */        
                                                                                
                                                                                
        IF B01.PENSJONSTYPE1(SØKER_IND)  = 'Y' &                                
           B01.PENSJONSTYPE2(SØKER_IND)  = 'F' &                                
           HJ_VIRKDATO_ÅMD               < 19970500 &    /*HL*/                 
           B01.PENSJONSTYPE1(EKTEF_IND)  = 'F' &                                
           ENK8.UFG                      < 50  &   /*0797 HL*/                  
           ENK11.YUG                     > 0  THEN                              
             DO;                                                                
                B02.PENSJONSTYPE2(SØKER_IND)     = 'P';                         
                B02.PENSJONSTYPE1(EKTEF_IND)     = 'G';                         
                B02.PENSJONSTYPE2(EKTEF_IND)     = ' ';                         
             END;                                                               
                                                                                
     IF SØKER_IND < 3 THEN                 /* ENDERING FOR BARN  */             
        DO;                                                                     
           DO I = 1 TO 13;                                                      
              IF (B02.FNR_TILKN(SØKER_IND,I) =                                  
                                 B02.FNR(EKTEF_IND)) THEN                       
                 DO;                                                            
                    B02.TILKN.TILKNYTNINGSKODE(SØKER_IND,I) =                   
                            B02.PENSJONSTYPE1(EKTEF_IND);                       
                    I = 13;                                                     
                END;                                                            
           END;                                                                 
                                                                                
           DO I = 1 TO 13;                                                      
              IF (B02.FNR_TILKN(EKTEF_IND,I) =                                  
                                 B02.FNR(SØKER_IND)) THEN                       
                 DO;                                                            
                    B02.TILKN.TILKNYTNINGSKODE(EKTEF_IND,I) =                   
                            B02.PENSJONSTYPE1(SØKER_IND);                       
                    I = 13;                                                     
                 END;                                                           
           END;                                                                 
        END;                                                                    
 /* ***************************************************************** */        
 /* TIL HIT.  ERIK 11.1.1990.                                         */        
 /* ***************************************************************** */        
                                                                                
 /* ***************************************************************** */        
 /*   TO NYE FELT - HL 0797 :                                         */        
 /* **************************************************************** */         
        IF ENK8.REAKTIVISERING = 'S' THEN /* JFA 05.2004 */                     
           IF B01.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) >                       
              HJ_VIRKDATO_ÅMD THEN                                              
              DO;  /* REAKTIVISERING VIRK FØR FRIINNTEKTSDATO */                
 L21A:                                                                          
                 FEIL_VED_LABEL = '21A';                                        
                 FEIL_MELD_NR   =  638;                                         
                 GO TO L999;                                                    
              END; /* REAKTIVISERING VIRK FØR FRIINNTEKTSDATO */                
           ELSE                                                                 
           IF ENK8.UFG >= B01.UFØRPENS.UFG(SØKER_IND)     THEN                  
              DO;  /*VED START REAKTIVISERING SKAL UFG REDUSERES */             
 L21B:                                                                          
                 FEIL_VED_LABEL = '21B';                                        
                 FEIL_MELD_NR   =  646;                                         
                 GO TO L999;                                                    
              END; /*VED START REAKTIVISERING SKAL UFG REDUSERES */             
           ELSE                                                                 
           IF HJ_VIRKDATO_ÅMD < 20010900     THEN                               
              DO;  /* REAKTIVISERING TIDLIGST FRA 09.2001 */                    
 L21C:                                                                          
                 FEIL_VED_LABEL = '21C';                                        
                 FEIL_MELD_NR   =  625;                                         
                 GO TO L999;                                                    
              END; /* REAKTIVISERING TIDLIGST FRA 09.2001 */                    
           ELSE                                                                 
           IF HJ_VIRKDATO_ÅMD <                                                 
              (B01.VIRK_UFØRHIST_ÅMD(SØKER_IND,1) + ETT_ÅR_ÅMD) THEN            
              DO;                                                               
  /*DET ER MINDRE ENN ETT ÅR SIDEN FØRSTE VIRKNINGSTIDSPUNKT*/                  
 L21D:                                                                          
                 FEIL_VED_LABEL = '21D';                                        
                 FEIL_MELD_NR   =  647;                                         
                 GO TO L999;                                                    
              END;                                                              
                                                                                
           ELSE                                                                 
           IF ENK8.FRYSP_5ÅR_ARB = ' '    &                                     
              ENK8.FRYSP_TIDSB   = ' '    &                                     
              B01.FRYSKODE(SØKER_IND) = ' '           THEN                      
              DO; /* FRYSPERIODE MÅ VÆRE REGISTRERT */                          
 L21E:                                                                          
                 FEIL_VED_LABEL = '21E';                                        
                 FEIL_MELD_NR   =  648;                                         
                 GO TO L999;                                                    
              END;/* FRYSPERIODE MÅ VÆRE REGISTRERT */                          
                                                                                
           ELSE                                                                 
           IF B01.UFØRPENS.REAKTIVISERING(SØKER_IND) = 'J' THEN                 
              DO;  /* HAR REAKTIVISERING FRA FØR */                             
 L216:                                                                          
                 FEIL_VED_LABEL = '216';                                        
                 FEIL_MELD_NR   =  438;                                         
                 GO TO L999;                                                    
              END; /* HAR REAKTIVISERING FRA FØR */                             
           ELSE                                                                 
              DO; /* REGISTRERINGEN GODTAS */                                   
                 B02.UFØRPENS.REAKTIVISERING(SØKER_IND) = 'J';                  
                 FELT_UTFYLT     = 1;                                           
              END; /* REGISTRERINGEN GODTAS */                                  
        ELSE                                                                    
        IF ENK8.REAKTIVISERING = 'X'   THEN                                     
           IF B02.UFØRPENS.REAKTIVISERING(SØKER_IND) = ' ' THEN                 
              DO;                                                               
 L218:                                                                          
                 FEIL_VED_LABEL = '218';                                        
                 FEIL_MELD_NR   =  440;                                         
                 GO TO L999;                                                    
              END;                                                              
           ELSE                                                                 
              DO;  /* REGISTRERINGEN GODTAS */                                  
                 B02.UFØRPENS.REAKTIVISERING(SØKER_IND) = ' ';                  
                 FELT_UTFYLT     = 1;                                           
              END; /* REGISTRERINGEN GODTAS */                                  
                                                                                
        /* ---------------------------------------------------------- */        
        /* TD 041 FRIINNTEKT SKAL IKKE NULLES UT VED UNNTAK VENTETID, */        
        /*        VI MÅ DERIMOT TA VARE PÅ DENNE VIDERE FOR Å KUNNE   */        
        /*        KJØRE OMREGNING VED NÅDD ALDER FOR FRIINNTEKT SLIK  */        
        /*        AT INFOTRYGD FÅR OVERFØRT KORREKTE INNTEKTSGRENSER  */        
        /* ---------------------------------------------------------- */        
     /* IF ENK8.UNNTAK_VENTETID = 'S'    THEN                                   
           B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) = 0; /*JFA*/               
        B02.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND) =                             
           B01.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND);                           
        /* TD 041 TIL HIT */                                                    
                                                                                
        /* ---------------------------------------------------------- */        
        /* TD 046 TO NYE FEILMELDINGER SAMT AT VI HAR RYDDA VEKK NOEN */        
        /*        GAMLE SOM GIKK PÅ SKJERMA ATTFØRING SOM IKKE HAR    */        
        /*        NOEN RELEVANS I FORHOLD TIL UNNTAK VENTETID         */        
        /* ---------------------------------------------------------- */        
        IF ENK8.UNNTAK_VENTETID = 'S'    THEN                                   
           IF B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND) = 'J' THEN                
              DO;  /* GODTAR IKKE DOBELT REGISTRERING AV START */               
 L219:                                                                          
                 FEIL_VED_LABEL = '219';                                        
                 FEIL_MELD_NR   =  667;                                         
                 GO TO L999;                                                    
              END; /* GODTAR IKKE DOBELT REGISTRERING AV START */               
           ELSE                                                                 
           IF HJ_VIRKDATO_ÅMD > B02.FRIINNTEKT_DATO_ÅMD(SØKER_IND) THEN         
               DO;  /* VIRKDATO MÅ VÆRE FØR FRIINNTEKTSDATO */                  
 L220:                                                                          
                  FEIL_VED_LABEL = '220';                                       
                  FEIL_MELD_NR   =  669;                                        
                  GO TO L999;                                                   
               END; /* VIRKDATO MÅ VÆRE FØR FRIINNTEKTSDATO */                  
           ELSE                                                                 
               DO;  /* REGISTRERINGEN GODTAS */                                 
                  B02.UFØRPENS.UNNTAK_VENTETID(SØKER_IND) = 'J';                
                  FELT_UTFYLT     = 1;                                          
               END; /* REGISTRERINGEN GODTAS */                                 
                                                                                
 /* ***************************************************************** */        
 /* LØNNSTILSKUDD -  NYTT FRA 2005                                    */        
 /* ***************************************************************** */        
    IF (ENK8.LØNNSTILSKUDD = 'S') THEN                                          
       DO;  /* START LØNNSTILLSKUDD REGISTRERT */                               
          IF ENK8.UFG     ^< B01.UFØRPENS.UFG(SØKER_IND) THEN                   
             DO;                                                                
 /*VED START LØNNSTILSKUDD  SKAL UFG SETTES NED                       */        
   L22A:                                                                        
                FEIL_VED_LABEL = '22A';                                         
                FEIL_MELD_NR   =  678;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
          IF (B01.REAKTIVISERING(SØKER_IND) = 'J' &                             
              ENK8.REAKTIVISERING          ^= 'X' ) !                           
             (ENK8.REAKTIVISERING           = 'S' ) THEN                        
             DO;  /* TD 069 - LINJE 2 I IF-TESTEN ER NY */                      
 /*LØNNSTILSKUDD IKKE TILLATT SAMMEN MED REAKTIVISERING               */        
 L22B:                                                                          
                FEIL_VED_LABEL = '22B';                                         
                FEIL_MELD_NR   =  673;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
          IF B01.LØNNSTILSKUDD(SØKER_IND) = 'J'       THEN                      
             DO;                                                                
 /*LØNNSTILSKUDD ER ALLEREDE REGISTRERT                               */        
 L22C:                                                                          
                FEIL_VED_LABEL = '22C';                                         
                FEIL_MELD_NR   =  675;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
          IF B01.YRKES_KODE(SØKER_IND) > 10     THEN                            
             DO;                                                                
 L22D:                                                                          
                FEIL_VED_LABEL = '22D';                                         
                FEIL_MELD_NR   =  682;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
          IF (B01.FRYSKODE(SØKER_IND) = '1' &                                   
              ENK8.FRYSP_TIDSB       ^= 'S' ) THEN                              
             DO;                                                                
 L22E:                                                                          
                FEIL_VED_LABEL = '22E';                                         
                FEIL_MELD_NR   =  431;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
          IF (ENK8.FRYSP_5ÅR_ARB      ^= 'S' &                                  
              ENK8.FRYSP_TIDSB        ^= 'S' &                                  
              B01.FRYSKODE(SØKER_IND) ^= '1' ) THEN                             
             DO;  /* TD 069, TEST FLYTTA FRA UE05 */                            
 L22F:                                                                          
                FEIL_VED_LABEL = '22F';                                         
                FEIL_MELD_NR   =  674;                                          
                GO TO L999;                                                     
             END; /* TD 069, TEST FLYTTA FRA UE05 */                            
             B02.LØNNSTILSKUDD(SØKER_IND) = 'J';                                
       END; /* START LØNNSTILLSKUDD REGISTRERT */                               
    ELSE                                                                        
    IF (ENK8.LØNNSTILSKUDD = 'X') THEN                                          
       DO;                                                                      
          IF (B01.LØNNSTILSKUDD(SØKER_IND) = ' ') THEN                          
             DO;  /* KAN IKKE OPPHØRE NOE MAN IKKE HAR */                       
 L22G:                                                                          
                FEIL_VED_LABEL = '22G';                                         
                FEIL_MELD_NR   =  683;                                          
                GO TO L999;                                                     
             END; /* KAN IKKE OPPHØRE NOE MAN IKKE HAR */                       
          ELSE                                                                  
             B02.LØNNSTILSKUDD(SØKER_IND) = ' ';                                
       END;                                                                     
 /* ***************************************************************** */        
 /* DERSOM FORVENTET ARBEIDSINNTEKT ER UTFYLT                         */        
 /* ***************************************************************** */        
                                                                                
    IF ENK10.FORVENTET_INNT  = 9999999 THEN                                     
       DO;                                                                      
          IF B02.ETTEPENS.FORVENTET(SØKER_IND) > 0   THEN                       
             CALL RULL_FORVENTET(B02.G_DATO_ÅMD(SØKER_IND),                     
                           B02.VIRK_DATO_ÅMD(SØKER_IND),                        
                           B02.ETTEPENS.FORVENTET(SØKER_IND));                  
       END;                                                                     
    ELSE                                                                        
 /* IF ENK10.FORVENTET_INNT  ^= 9999999 THEN        */                          
       DO;                                                                      
          TRANSTYPE                       = 11;                                 
          FELT_UTFYLT             = 1;                                          
          IF STATUS_TYPE = 'C' THEN                                             
             DO;                                                                
 L222:                                                                          
                                                                                
 /* STATUS_TYPE 'C'             FORTELLER AT VIRKDATO I TRANS LIGGER */         
 /* FØR NEST-SISTE STATUS.   J.D 27.10.87              */                       
                                                                                
                 FEIL_VED_LABEL = '222';                                        
                 FEIL_MELD_NR   = 0601;                                         
                 GO TO L999;                                                    
             END;                                                               
                                                                                
          IF B01.PENSJONSTYPE1(SØKER_IND) ^= 'E' &                              
             B01.PENSJONSTYPE1(SØKER_IND) ^= 'J' &                              
             B01.PENSJONSTYPE2(SØKER_IND) ^= 'E' THEN                           
             DO;                                                                
 L230:                                                                          
 /* ***************************************************************** */        
 /* FEILMELD 1514: ENDRING I FORVENTET INNTEKT AVVISES. PERSONEN ER   */        
 /* IKKE REGISTRERT MED PENSJON SOM ETTERLATT EKTEFELLE.              */        
 /* ***************************************************************** */        
                                                                                
                FEIL_VED_LABEL = '230';                                         
                FEIL_MELD_NR   = 1514;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
             B02.FORVENTET (SØKER_IND) = ENK10.FORVENTET_INNT/100;              
       END;                                                                     
                                                                                
 /* ***************************************************************** */        
 /* DERSOM OVERGANG TIL PENSJON ER UTFYLT                             */        
 /* ***************************************************************** */        
                                                                                
    IF ENK10.O_TIL_PENSJON = 'X' THEN                                           
       DO;                                                                      
          TRANSTYPE        = 11;                                                
          FELT_UTFYLT      =  1;                                                
                                                                                
 /* ***************************************************************** */        
 /* DERSOM PERSONEN IKKE HAR OVERGANGSSTØNAD FRA FØR                  */        
 /* ELLER HAR OVERGANGSSTØNAD MED SIVILSTAND LIK ETTERLATT            */        
 /* ***************************************************************** */        
                                                                                
          IF B01.PENSJONSTYPE2(SØKER_IND) ^= 'O'   !                            
                                                                                
            (B01.PENSJONSTYPE2(SØKER_IND)  = 'O'  &                             
             B01.SIVILSTAND   (SØKER_IND)  = 'E'      )   THEN                  
             DO;                                                                
 L240:                                                                          
                FEIL_VED_LABEL = '240';                                         
                FEIL_MELD_NR   = 1516;                                          
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
             B02.PENSJONSTYPE2(SØKER_IND) = 'P';                                
       END;                                                                     
                                                                                
 /* ***************************************************************** */        
 /* DERSOM FRADRAG-2G ER UTFYLT                                       */        
 /* ***************************************************************** */        
                                                                                
                                                                                
    IF ENK10.FRADRAG_2G = 'J' !                                                 
       ENK10.FRADRAG_2G = 'N' THEN                                              
       DO;                                                                      
          TRANSTYPE = 11;                                                       
          FELT_UTFYLT      =  1;                                                
          B02.FRADRAG_2G(SØKER_IND) = ENK10.FRADRAG_2G;                         
       END;                                                                     
   /* JD 19.10.2004 - REMEDY 627 - FJERNET 16.2.05 - TD 77                      
    IF (ENS.EK_INNT_OVER_2G = 'J' &                                             
        B01.PENSJON_FØR_9802(SØKER_IND) = 'J') THEN                             
       DO;                                                                      
 L270 :                                                                         
         FEIL_VED_LABEL = '270';                                                
         FEIL_MELD_NR   = 650 ;                                                 
         GO TO L999;                                                            
       END;                        */                                           
   /* JFA 20.6.2001 - KAN IKKE HA EF.TILLEGG MED INNTEKT > G */                 
    IF (ENS.EK_INNT_OVER_2G = 'J' &                                             
        B01.PENSJONSTYPE2(SØKER_IND) = 'F') THEN                                
       DO;                                                                      
 L271 :                                                                         
         FEIL_VED_LABEL = '271';                                                
         FEIL_MELD_NR   = 614 ;                                                 
         GO TO L999;                                                            
       END;                                                                     
                                                                                
  /* DENNE TESTEN MÅ STÅ FORAN TEST PÅ EKTEFELLES FNR */                        
                                                                                
    IF ENS.EK_INNT_OVER_2G ^= ' '        THEN                                   
       DO;   /*9811 HL*/                                                        
          IF  (B02.SIVILSTAND(SØKER_IND) = 'G'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'P'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'V'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'W'    !                             
               ENS.FLYTTET_SAMMEN = 'X'         )      THEN                     
             DO;                                                                
                B02.EK_INNT_OVER_2G(SØKER_IND) = ENS.EK_INNT_OVER_2G;           
                IF B02.PENSJON_FØR_9802(SØKER_IND) ^= 'J'   THEN                
                   TRANSTYPE = 10;       /*200002*/                             
                FELT_UTFYLT = 1;                                                
             END;                                                               
       END;                                                                     
 /* ***************************************************************** */        
 /* DERSOM EKTEFELLENS FØDSELSNUMMER ER UTFYLT.                       */        
 /* ***************************************************************** */        
                                                                                
    IF ENS.FNR_EK > 0 THEN                                                      
       DO;                                                                      
          FELT_UTFYLT             = 1;                                          
          IF B01.SIVILSTAND(SØKER_IND) = 'W' !                                  
             B01.SIVILSTAND(SØKER_IND) = 'V'   THEN                             
             IF B01.FNR(EKTEF_IND) = ENS.FNR_EK   THEN                          
                DO;    /*9710 HL : */                                           
                   B02.SIVILSTAND(SØKER_IND) = ENS.SIVILSTAND;                  
                   B02.SIVILSTAND(EKTEF_IND) = ENS.SIVILSTAND;                  
                END;                                                            
             ELSE                                                               
                DO;                                                             
 L272 :                                                                         
                   FEIL_VED_LABEL = '272';                                      
                   FEIL_MELD_NR   = 1540 ;                                      
                   GO TO L999;                                                  
                END;                                                            
          ELSE                                                                  
             DO;    /*9710 HL : */                                              
                B02.SIVILSTAND(SØKER_IND) = ENS.SIVILSTAND;                     
                B02.SIVILSTAND(EKTEF_IND) = ENS.SIVILSTAND;                     
 /*200006: */                                                                   
                B02.EK_INNT_OVER_2G(SØKER_IND) = ENS.EK_INNT_OVER_2G;           
                CALL MELDING_OM_GIFTEMÅL;              /*UE30*/                 
                IF FEIL_MELD_NR > 0 THEN                                        
                   GOTO L999;                                                   
             END;                                                               
       END;                                                                     
    ELSE                                                                        
       IF ENS.SKILSMISSE      = 'X' !                                           
          ENS.FLYTTET_FRA     = 'X' !                                           
          ENS.OPPHØR_SAMBO    = 'X' !                                           
          ENS.FLYTTET_SAMMEN  = 'X' THEN                                        
          DO;                                                                   
                   FELT_UTFYLT             = 1;                                 
                   IF B01.PENSJONSTYPE1(SØKER_IND) = 'G' !                      
                      B01.PENSJONSTYPE1(SØKER_IND) = 'F' THEN                   
                     DO;  /* PERSONEN IKKE I PENSJONSREGISTERET */              
 L273:                                                                          
                        FEIL_VED_LABEL = '273';                                 
                        FEIL_MELD_NR   = 1205;                                  
                        GO TO L999;                                             
                     END; /* PERSONEN IKKE I PENSJONSREGISTERET */              
 /* ***************************************************************** */        
 /* DERSOM EKTEFELLEN IKKE ER I BASEN                                 */        
 /* ***************************************************************** */        
                    IF (B01.FNR(EKTEF_IND) = 0                                  
 /* 18.10.84 HL */      & ENS.SKILSMISSE = ' ')    !                            
                       B01.PENSJONSTYPE1(EKTEF_IND) = 'D' THEN                  
                       DO;                                                      
 L274:                                                                          
                          FEIL_VED_LABEL = '274';                               
                          FEIL_MELD_NR   = 1005;                                
                          GO TO L999;                                           
                       END;                                                     
                    ELSE                                                        
 /* MARTIN */                                                                   
                    IF (B01.SIVILSTAND(SØKER_IND) = 'S') THEN                   
                       DO;  /* SKILSMISSE REGISTRERT FRA FØR */                 
 L275:                                                                          
                          FEIL_VED_LABEL = '274';                               
                          FEIL_MELD_NR   =  684;                                
                          GO TO L999;                                           
                       END; /* SKILSMISSE REGISTRERT FRA FØR */                 
                    ELSE                                                        
 /* ***************************************************************** */        
 /* DERSOM SKILSMISSE ER UTFYLT.                                      */        
 /* ***************************************************************** */        
                       IF ENS.SKILSMISSE = 'X' THEN                             
                          DO;                                                   
                                                                                
 /* TILLEGG 18.10.84  HL                                              */        
                                                                                
                             IF B01.FNR(EKTEF_IND) = 0    THEN                  
                                DO;                                             
                                   B02.SIVILSTAND(SØKER_IND) = 'S';             
                                   TRANSTYPE = 52;                              
                                END;                                            
                             ELSE                                               
                                                                                
 /* HIT  HL                                                           */        
                                                                                
                                CALL MELDING_OM_SKILSMISSE;   /* 1440 */        
                             IF FEIL_MELD_NR > 0 THEN                           
                                GOTO L999;                                      
                          END;                                                  
                       ELSE                                                     
 /* ***************************************************************** */        
 /* DERSOM FLYTTET FRA HVERANDRE ER UTFYLT.                           */        
 /* ***************************************************************** */        
                          IF ENS.FLYTTET_FRA = 'X'  !                           
                             ENS.OPPHØR_SAMBO= 'X' THEN                         
                             DO;                                                
                                IF B01.SIVILSTAND(SØKER_IND) = 'W' !            
                                   B01.SIVILSTAND(SØKER_IND) = 'V' THEN         
                                CALL MELDING_OM_SKILSMISSE; /* 1440 */          
                                ELSE                                            
                                CALL MELDING_OM_FLYTTET_FRA; /* 1460 */         
                                IF FEIL_MELD_NR > 0 THEN                        
                                GOTO L999;                                      
                             END;                                               
                          ELSE                                                  
 /* ***************************************************************** */        
 /* DERSOM FLYTTET SAMMEN ER UTFYLT.                                  */        
 /* ***************************************************************** */        
                             IF ENS.FLYTTET_SAMMEN = 'X' THEN                   
                                DO;                                             
 /* 1450 */                        CALL MELDING_OM_FLYTTET_SAMMEN;              
                                   IF FEIL_MELD_NR > 0 THEN                     
                                      GOTO L999;                                
                                END;                                            
          END;                                                                  
                                                                                
       IF ENS.OPPHØR_SAMBO    = 'X' THEN                                        
                   FELT_UTFYLT             = 1;                                 
                                                                                
    /*NYTT FELT 200107 : */                                                     
    IF B02.PENSJON_FØR_9802(SØKER_IND) ^= 'J'       THEN                        
    DO;                                                                         
    IF ENS.RED_GP_3_2_5   = 'N'        &                                        
       B02.RED_GP_3_2_5(SØKER_IND) = 'J'   THEN                                 
             DO;                                                                
                B02.RED_GP_3_2_5(SØKER_IND) = ' ';                              
                IF B02.PENSJON_FØR_9802(SØKER_IND) ^= 'J'   THEN                
                   TRANSTYPE = 10;                                              
                FELT_UTFYLT = 1;                                                
             END;                                                               
    ELSE                                                                        
    IF ENS.RED_GP_3_2_5   = 'J'        &                                        
       B02.RED_GP_3_2_5(SØKER_IND) ^= 'J'   THEN                                
       DO;                                                                      
          IF  (B02.SIVILSTAND(SØKER_IND) = 'U'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'S'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'A'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'V'    !                             
               B02.SIVILSTAND(SØKER_IND) = 'E'     ) THEN                       
             DO;                                                                
                B02.RED_GP_3_2_5(SØKER_IND) = 'J';                              
                                                                                
                IF B02.PENSJON_FØR_9802(SØKER_IND) ^= 'J'   THEN                
                   TRANSTYPE = 10;                                              
                FELT_UTFYLT = 1;                                                
             END;                                                               
          ELSE                                                                  
          DO;                                                                   
 L276 :                                                                         
            FEIL_VED_LABEL = '276';                                             
            FEIL_MELD_NR   =  616;                                              
            GO TO L999;                                                         
          END;                                                                  
       END;                                                                     
    ELSE                                                                        
    IF ENS.RED_GP_3_2_5   = 'N'        &                                        
       ENS.FNR_EK = 0                  &                                        
       (B02.RED_GP_3_2_5(SØKER_IND) = ' '   !                                   
        B02.RED_GP_3_2_5(SØKER_IND) = 'N')         THEN                         
          DO;                                                                   
 L277 :                                                                         
            FEIL_VED_LABEL = '277';                                             
            FEIL_MELD_NR   =  619;                                              
            GO TO L999;                                                         
          END;                                                                  
    ELSE                                                                        
    IF ENS.RED_GP_3_2_5   = 'J'        &                                        
       B02.RED_GP_3_2_5(SØKER_IND) = 'J'        THEN                            
          DO;                                                                   
 L278 :                                                                         
            FEIL_VED_LABEL = '278';                                             
            FEIL_MELD_NR   =  620;                                              
            GO TO L999;                                                         
          END;                                                                  
    END; /*IF PENSJON_FØR_9802*/                                                
                                                                                
    IF EN_INNTEKT.MINST_4G = 'J' ! EN_INNTEKT.MINST_4G = 'N' THEN               
       DO;                                                                      
          TRANSTYPE = 70;                                                       
                                                                                
          /* TRANSTYPE = 70 : ENDRING I EK'S INNT - IKKE NYTT BREV */           
          FELT_UTFYLT = 1;                                                      
                                                                                
          IF B01.PENSJONSTYPE1(EKTEF_IND) ^= 'G'   THEN                         
             DO;                                                                
 L284:                                                                          
                FEIL_VED_LABEL = '284';                                         
                FEIL_MELD_NR = 1006;                                            
                GO TO L999;                                                     
             END;                                                               
          ELSE                                                                  
          IF EN_INNTEKT.MINST_4G = 'J' THEN                                     
             B02.PENSJONSTYPE2 (EKTEF_IND) = 'M';                               
          ELSE                                                                  
             B02.PENSJONSTYPE2 (EKTEF_IND) = 'U';                               
                                                                                
          DO I = 3 TO 14 WHILE                                                  
             (B01.FNR(I) > 0);                                                  
                                                                                
             IF B01.PENSJONSTYPE2(I) = 'R' THEN                                 
                TRANSTYPE = 48;                                                 
          END;                                                                  
       END;                                                                     
                                                                                
                                                                                
 /* ***************************************************************** */        
 /* OPPDATER INNTEKTER :                                              */        
 /* ***************************************************************** */        
                                                                                
 /* FOR Å RETTE OPP AT FELTET HAR VÆRT FYLT UT MED 7*9-TALL */                  
 /* I STEDET FOR 6*9-TALL :       HL 23.12.94               */                  
          IF EN_INNTEKT.PENSJONSINNT_SØKER = 9999999  THEN                      
             EN_INNTEKT.PENSJONSINNT_SØKER = 999999;                            
          IF EN_INNTEKT.PENSJONSINNT_EK      = 9999999  THEN                    
             EN_INNTEKT.PENSJONSINNT_EK      = 999999;                          
    /* FJERNET DETTE 210502 MARTIN                                              
          IF EN_INNTEKT.ARBEIDSINNT_SØKER = 9999999  THEN                       
             EN_INNTEKT.ARBEIDSINNT_SØKER = 999999;                             
          IF EN_INNTEKT.ARBEIDSINNT_EK    = 9999999  THEN                       
             EN_INNTEKT.ARBEIDSINNT_EK    = 999999;                             
                                                                                
            /* RETTER ALLE INNTEKT TIL HELE 100 ISEDET FOR HELE 1000*/          
            /* NÅR DET GJELDER INNTEKTER TIL FORSØRGINGSTILLEGG.    */          
            /* TRUDE 01.08.95  */                                               
                                                                                
    IF B02.FT_SKAL_BEREGNES (SØKER_IND) = 'J'       !                           
       B02.FT_SKAL_BEREGNES (SØKER_IND) = 'N'      THEN                         
       DO;                                                                      
  /*9802 HL F_RULL_FORSI : */                                                   
          IF EN_INNTEKT.PENSJONSINNT_SØKER = 999999   THEN                      
             DO;                                                                
                IF B02.FORSI.PENSJONSINNTEKT(SØKER_IND) > 0  THEN               
                   B02.FORSI.PENSJONSINNTEKT(SØKER_IND) =                       
                       F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                  
                             B02.VIRK_DATO_ÅMD(SØKER_IND),                      
                             B02.FORSI.PENSJONSINNTEKT(SØKER_IND));             
             END;                                                               
          ELSE                                                                  
  /*      IF EN_INNTEKT.PENSJONSINNT_SØKER ^= 999999   THEN  */                 
             DO;                                                                
                W_HJELP = EN_INNTEKT.PENSJONSINNT_SØKER/100;                    
                B02.PENSJONSINNTEKT(SØKER_IND) = W_HJELP;                       
                TRANSTYPE = 6;                                                  
                FELT_UTFYLT = 1;                                                
             END;                                                               
          IF EN_INNTEKT.ARBEIDSINNT_SØKER = 9999999    THEN                     
             IF ENK7.FAI                  = 9999999  THEN  /*9809*/             
                DO;                                                             
                   IF B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) > 0  THEN             
                      B02.FORSI.ARBEIDSINNTEKT(SØKER_IND) =                     
                          F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),               
                             B02.VIRK_DATO_ÅMD(SØKER_IND),                      
                             B02.FORSI.ARBEIDSINNTEKT(SØKER_IND));              
                END;                                                            
             ELSE; /*HVIS FAI ER FYLT UT BLIR OPPDATERING GJORT*/               
                   /*FORAN - DER FAI ER BEHANDLET              */               
          ELSE  /*AI ER FYLT UT, FAI ER IKKE FYLT UT*/                          
             DO;                                                                
                W_HJELP = EN_INNTEKT.ARBEIDSINNT_SØKER/100;                     
                B02.ARBEIDSINNTEKT(SØKER_IND) = W_HJELP;                        
                TRANSTYPE = 6;                                                  
                FELT_UTFYLT = 1;                                                
             END;                                                               
          IF B02.PENSJONSTYPE2(SØKER_IND)  = 'F'   THEN                         
             IF EN_INNTEKT.PENSJONSINNT_EK    ^= 999999    !                    
                EN_INNTEKT.ARBEIDSINNT_EK     ^= 9999999    THEN                
             DO;                                                                
 L285:                                                                          
                FEIL_VED_LABEL = '285';                                         
                FEIL_MELD_NR = 1108;                                            
                GO TO L999;                                                     
             END;                                                               
          IF EN_INNTEKT.PENSJONSINNT_EK    = 999999   THEN                      
             DO;                                                                
                IF B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) > 0  THEN            
                   B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) =                    
                       F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                  
                             B02.VIRK_DATO_ÅMD(SØKER_IND),                      
                             B02.FORSI.PENSJONSINNTEKT_EK(SØKER_IND));          
             END;                                                               
          ELSE                                                                  
 /*       IF EN_INNTEKT.PENSJONSINNT_EK    ^= 999999   THEN */                  
             DO;                                                                
                W_HJELP = EN_INNTEKT.PENSJONSINNT_EK /100;                      
                B02.PENSJONSINNTEKT_EK        = W_HJELP;                        
                TRANSTYPE = 6;                                                  
                FELT_UTFYLT = 1;                                                
             END;                                                               
          IF EN_INNTEKT.ARBEIDSINNT_EK    = 9999999   THEN                      
             DO;                                                                
                IF B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) > 0  THEN             
                   B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) =                     
                       F_RULL_FORSI(B02.G_DATO_ÅMD(SØKER_IND),                  
                             B02.VIRK_DATO_ÅMD(SØKER_IND),                      
                             B02.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND));           
             END;                                                               
          ELSE                                                                  
 /*       IF EN_INNTEKT.ARBEIDSINNT_EK    ^= 999999    THEN   */                
             DO;                                                                
                W_HJELP = EN_INNTEKT.ARBEIDSINNT_EK /100;                       
                B02.ARBEIDSINNTEKT_EK        = W_HJELP;                         
                TRANSTYPE = 6;                                                  
                FELT_UTFYLT = 1;                                                
             END;                                                               
      /*  IF W_HJELP > 0 THEN DVS MINST ETT AV FELTENE ER UTFYLT                
             DO;                                                                
               IF EN_INNTEKT.PENSJONSINNT_SØKER =  999999   THEN                
                  B02.PENSJONSINNTEKT(SØKER_IND) = 0;                           
               IF EN_INNTEKT.PENSJONSINNT_EK    =  999999   THEN                
                  B02.PENSJONSINNTEKT_EK        = 0;                            
               IF EN_INNTEKT.ARBEIDSINNT_SØKER  =  999999   THEN                
                  B02.ARBEIDSINNTEKT(SØKER_IND) = 0;                            
               IF EN_INNTEKT.ARBEIDSINNT_EK     =  999999   THEN                
                  B02.ARBEIDSINNTEKT_EK         = 0;                            
             END; */                                                            
         /* TRUDE,280994 */                                                     
          IF B02.PENSJONSTYPE1(SØKER_IND)  = 'A' !                              
             B02.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN                           
            DO;                                                                 
              IF ALDER < 7001    THEN                                           
                DO;                                                             
                        /* OPPD 04021 */                                        
                   IF   B02.PENSJONSTYPE1(SØKER_IND)  = 'K' &                   
                        B01.UTTAKSDATO_ÅMD(SØKER_IND) > 20000700  THEN          
                     DO;                                                        
                        IF  B02.FAI(SØKER_IND) > 150 THEN                       
                          DO;                                                   
                            B02.FAI(SØKER_IND) =                                
                                          B02.ARBEIDSINNTEKT(SØKER_IND);        
                            B02.FAI_DATO_ÅMD(SØKER_IND) =                       
                                          B02.VIRK_DATO_ÅMD(SØKER_IND);         
                          END;                                                  
                     END;                                                       
                   ELSE                                                         
        /* LOVENDRING - HL 200811*/                                             
                      IF (ALDER > 6712   !                                      
                          HJ_VIRKDATO_ÅMD < 20080000)  !                        
                         B01.PENSJONSTYPE1(SØKER_IND) ^= 'A'  THEN              
                        DO;                                                     
                            B02.FAI(SØKER_IND) =                                
                                          B02.ARBEIDSINNTEKT(SØKER_IND);        
                            B02.FAI_DATO_ÅMD(SØKER_IND) =                       
                                          B02.VIRK_DATO_ÅMD(SØKER_IND);         
                        END;                                                    
                END; /* ALDER < 70 */                                           
            END;   /* PT1 A! K*/                                                
       END;                                                                     
    ELSE                                                                        
    IF EN_INNTEKT.PENSJONSINNT_SØKER ^=  999999     !                           
       EN_INNTEKT.PENSJONSINNT_EK    ^=  999999      !                          
       EN_INNTEKT.ARBEIDSINNT_SØKER ^=   9999999     !                          
       EN_INNTEKT.ARBEIDSINNT_EK    ^=   9999999      THEN                      
             DO;                                                                
 L286:                                                                          
                FEIL_VED_LABEL = '286';                                         
                FEIL_MELD_NR = 490;                                             
                GO TO L999;                                                     
             END;                                                               
                                                                                
 /* ***************************************************************** */        
 /* OPPDATER SPESIELLE OPPLYSNINGER                                   */        
 /* ***************************************************************** */        
                                                                                
    IF EN_SPES.STATSBORGER ^= '999' THEN                                        
       DO;                                                                      
          B02.STATSBORGER (SØKER_IND) = EN_SPES.STATSBORGER;                    
          TRANSTYPE = 74;                                                       
             FELT_UTFYLT = 1;                                                   
       END;                                                                     
    IF EN_SPES.BOSTED      ^= '999' THEN                                        
       DO;                                                                      
          IF B02.BOSATT(SØKER_IND) = 0        &                                 
             HJ_VIRKDATO_ÅMD > 19921200       &                                 
             B02.PENSJONSTRYGDET(SØKER_IND)   ^= 'J'   &                        
             B02.UFØRHIST.BUP_GAR_KODE(SØKER_IND,1) ^= ' '  &                   
             B02.SPESOPPL.UNG_UFØR(SØKER_IND)  ^= 'J'      THEN                 
             DO;                                                                
                DO M = 1 TO 7;              /*0997 HL*/                         
                   B02.BUP_GAR_KODE(SØKER_IND,M) = ' ';                         
                   B02.BUP_GARANTI(SØKER_IND,M)  = 0;                           
                END;                                                            
                B01.GT_LOV92(SØKER_IND) = 0;                                    
                B02.GT_LOV92(SØKER_IND) = 0;                                    
                DIV_PARAM_OMR.SISTE_UFTIDSPUNKT = 'J';                          
                TRANSTYPE = 2;                                                  
             END;                                                               
          ELSE                                                                  
             TRANSTYPE = 74;                                                    
          FELT_UTFYLT = 1;                                                      
          B02.BOSATT      (SØKER_IND) = EN_SPES.BOSTED;                         
       END;                                                                     
    IF EN_SPES.TP_NORDISK  ^= '9999999'   THEN                                  
       IF EN_SPES.TP_NORDISK_LAND = '999'    &                                  
          B02.TP_NORDISK_LAND(SØKER_IND) = 0  THEN                              
             DO;                                                                
 L287:                                                                          
                FEIL_VED_LABEL = '287';                                         
                FEIL_MELD_NR = 488;                                             
                GO TO L999;                                                     
             END;                                                               
       ELSE                                                                     
          DO;                                                                   
             B02.TP_NORDISK(SØKER_IND) = EN_SPES.TP_NORDISK;                    
             B02.TP_NORDISK_LAND(SØKER_IND) = EN_SPES.TP_NORDISK_LAND;          
             TRANSTYPE = 10;                                                    
             FELT_UTFYLT = 1;                                                   
          END;                                                                  
    IF EN_SPES.PENSJON_EØS ^= '9999999'        THEN                             
       IF B02.PRO_RATA_BEREGNING(SØKER_IND) = ' '    THEN                       
             DO;                                                                
 L288:                                                                          
                FEIL_VED_LABEL = '288';                                         
                FEIL_MELD_NR = 489;                                             
                GO TO L999;                                                     
             END;                                                               
       ELSE                                                                     
          DO;                                                                   
             B02.PENSJON_EØS(SØKER_IND) = EN_SPES.PENSJON_EØS;                  
             TRANSTYPE = 10;                                                    
             FELT_UTFYLT = 1;                                                   
          END;                                                                  
                                                                                
                                                                                
    /*9812 : */                                                                 
                                                                                
    IF EN_SPES.TT_EØS_ANT_ÅR ^= 99        &                                     
       EN_SPES.TT_EØS_ANT_MND ^= 99        THEN                                 
       W_TT_MND = EN_SPES.TT_EØS_ANT_ÅR * 12 + EN_SPES.TT_EØS_ANT_MND;          
    IF W_TT_MND > 0    &                                                        
       B02.PENSJONSTYPE1(SØKER_IND) ^= 'A'         THEN                         
          DO;                                                                   
  L289:                                                                         
              FEIL_VED_LABEL = '289';                                           
              FEIL_MELD_NR   = 1821;                                            
              GO TO L999;                                                       
                                                                                
          END;                                                                  
    IF EN_SPES.INNT_PRØVET_EØS_PENS = 'J'    THEN                               
       DO;  /* INNT_PRØVET_EØS_PENS = J */                                      
          IF B02.PENSJONSTYPE1(SØKER_IND) = 'A'    THEN                         
             IF W_TT_MND = 0                       THEN                         
                DO;                                                             
  L290:             FEIL_VED_LABEL = '290';                                     
                    FEIL_MELD_NR   = 1822;                                      
                    GO TO L999;                                                 
                END;                                                            
             ELSE                                                               
             DO;                                                                
                B02.EØSINFO.TT_PRO_RATA_MND     (SØKER_IND) = W_TT_MND;         
                IF B02.BEREGN_FOLKETRYGD(SØKER_IND) = ' '     THEN              
                   B02.BEREGN_FOLKETRYGD(SØKER_IND) = 'J';                      
                TRANSTYPE = 6;                                                  
                B02.EØSINFO.INNT_PRØVET_EØS_PENS(SØKER_IND) = 'J';              
             END;                                                               
          IF (B02.PENSJONSTYPE1(SØKER_IND) = 'E' !                              
              B02.PENSJONSTYPE2(SØKER_IND) = 'E' ) THEN                         
             DO;  /* ETTERLATTE */                                              
                TRANSTYPE = 11;                                                 
                B02.EØSINFO.INNT_PRØVET_EØS_PENS(EKTEF_IND) = 'J';              
             END; /* ETTERLATTE */                                              
          FELT_UTFYLT = 1;                                                      
       END; /* INNT_PRØVET_EØS_PENS = J */                                      
    ELSE                                                                        
    IF EN_SPES.INNT_PRØVET_EØS_PENS = 'N'    THEN                               
       DO;  /* INNT_PRØVET_EØS_PENS = N */                                      
          IF (B02.PENSJONSTYPE1(SØKER_IND) = 'E' !                              
              B02.PENSJONSTYPE2(SØKER_IND) = 'E' ) THEN                         
             DO;  /* ETTERLATTE */                                              
                B02.EØSINFO.INNT_PRØVET_EØS_PENS(EKTEF_IND) = 'N';              
                TRANSTYPE = 11;                                                 
             END; /* ETTERLATTE */                                              
          ELSE                                                                  
             DO;  /* IKKE ETTERLATTE */                                         
                B02.EØSINFO.INNT_PRØVET_EØS_PENS(SØKER_IND) = 'N';              
                TRANSTYPE = 6;                                                  
             END; /* IKKE ETTERLATTE */                                         
          FELT_UTFYLT = 1;                                                      
       END; /* INNT_PRØVET_EØS_PENS = N */                                      
                                                                                
    IF FELT_UTFYLT = 0 THEN                                                     
       IF W_3_2_5 = ' '             THEN                                        
 L291:                                                                          
          DO;                                                                   
             FEIL_VED_LABEL = '291';                                            
             FEIL_MELD_NR   =  265;                                             
          END;                                                                  
       ELSE                                                                     
 L292:                                                                          
          DO;                                                                   
             FEIL_VED_LABEL = '292';                                            
             FEIL_MELD_NR   =  617;                                             
          END;                                                                  
                                                                                
 /* RULLERING AV EKTEFELLES INNTEKTER - 9802 HL */                              
  IF SØKER_IND < 3            THEN                                              
   DO;                                                                          
    IF B02.ALDERSP.FAI(EKTEF_IND) > 0   THEN                                    
       CALL RULL_FAI(B02.G_DATO_ÅMD(EKTEF_IND),                                 
                     B02.VIRK_DATO_ÅMD(EKTEF_IND),                              
                     B02.ALDERSP.FAI(EKTEF_IND));                               
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) > 0  THEN                           
       B02.FORSI.PENSJONSINNTEKT(EKTEF_IND) =                                   
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.PENSJONSINNTEKT(EKTEF_IND));                         
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) > 0  THEN                            
       B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND) =                                    
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT(EKTEF_IND));                          
                                                                                
    IF B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) > 0  THEN                        
       B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND) =                                
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                  B02.VIRK_DATO_ÅMD(EKTEF_IND),                                 
                  B02.FORSI.PENSJONSINNTEKT_EK(EKTEF_IND));                     
                                                                                
    IF B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) > 0  THEN                         
       B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND) =                                 
           F_RULL_FORSI(B02.G_DATO_ÅMD(EKTEF_IND),                              
                 B02.VIRK_DATO_ÅMD(EKTEF_IND),                                  
                 B02.FORSI.ARBEIDSINNTEKT_EK(EKTEF_IND));                       
   END;                                                                         
                                                                                
   DO I = 1 TO 14;            /*9905*/                                          
      IF B02.FØRSTE_GANG_REG(I) = 'J'         THEN                              
         B02.FØRSTE_GANG_REG(I) = 'N';                                          
   END;                                                                         
                                                                                
   IF  ^F_2MDR(HJ_VIRKDATO_ÅMD)     THEN                                        
      DO;                                                                       
 L293:                                                                          
         FEIL_VED_LABEL = '293';                                                
         FEIL_MELD_NR   = 207;                                                  
         GO TO L999;                                                            
      END;                                                                      
                                                                                
 L999:                                                                          
    EXEC CICS RETURN;                                                           
                                                                                
                                                                                
 %PAGE;                                                                         
    %INCLUDE R001UE30;  /* MELDING_OM_GIFTEMÅL                     */           
    %INCLUDE R0011440;  /* MELDING_OM_SKILSMISSE                   */           
    %INCLUDE R0011450;  /* MELDING_OM_FLYTTET_SAMMEN               */           
    %INCLUDE R0011460;  /* MELDING_OM_FLYTTET_FRA                  */           
 /* %INCLUDE R0019902   /* F_KJØNN                                 */           
    %INCLUDE R0019905;  /* F_ALDER                                 */           
    %INCLUDE R0019924;  /* KOBLE_TO_PERSONER                       */           
    %INCLUDE R0019926;  /* FLYTT_B01_TIL_B02                       */           
    %INCLUDE R0019936;  /* OPPHØR_KOBLING_SKILTE                   */           
 /* %INCLUDE R0019957      P900_NOR_DATA ( ..FNR.. , ..TKNR..)     */           
    %INCLUDE R0019954;  /* RULL_FORVENTET                          */           
    %INCLUDE R0019959;  /* F_2MDR                                  */           
    %INCLUDE R0019967;  /* RULL_FAI                                */           
    %INCLUDE R0019968;  /* F_RULL_FORSI                            */           
    %INCLUDE R0019995;  /* KONV_FNR11_FNR13     2000-3             */           
   END R01UE20;                                                                 
