 /*       SIST ENDRET 02/09-98 11.17.07 AV   SPA7339                  */00000000
 /* ***************************************************************** */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /* **********************                                            */00000030
 /*  PROGRAM-IDENT : R00104E1  MAP_FRA_TRANS_LISTE    HOVEDPROGRAM    */00000040
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000050
 /*  PROGRAMMERER  : KRISTENSEN                                       */00000060
 /*  PROGRAMMET BLE LAGET : MARCH 1994                                */00000070
 /*                                                                   */00000080
 /* ***************************************************************** */00000090
 /*HENSIKT:                                                           */00000100
 /* **********                                                        */00000110
 /*    PROGRAMMET SKAL BYGGE OPP SIDER SOM BESTÅR AV BLANKETTMAPENE.  */00000120
 /*    DETTE GJØRES UT FRA EN LISTE AV TRANSER SOM ER SORTERT På      */00000130
 /*    FORHÅND.                                                       */00000140
 /*    MAPS HØRER INN UNDER MAPSET 'S001F1'.                         */ 00000150
 /*                                                                   */00000160
 /* ***************************************************************** */00000170
 /*PROGRAMTILKNYTTING:                                                */00000180
 /* ********************                                              */00000190
 /*    PROGRAMMET BLIR GITT KONTROLL FRA R0010412 - FORESPØRSEL       */00000200
 /*                                                                   */00000210
 /*    PROGRAMMETS TRANSKODE ER F41D.                                 */00000220
 /*    BRUK :                                                         */00000230
 /*    EXEC CICS XCTL PROGRAM ('R00104E1') COMMAREA(KOM_OMR);         */00000240
 /*    PROGRAMMET INCLUDER :                                          */00000250
 /*               R001  06   FLYTT FRA ARB.OMRÅDE TIL MAP    E1       */00000260
 /*               R001  07   FORTEKSTER OG ATTRIBUTTER       E1       */00000270
 /* ***************************************************************** */00000280
 /*DATASETTOPPLYSNINGER:                                              */00000290
 /* ***********************                                           */00000300
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */00000310
 /*                                                                   */00000320
 /* ***************************************************************** */00000330
 /*FEILMELDINGER:                                                     */00000340
 /* *******************                                               */00000350
 /* PROGRAMMET GIR IKKE NOEN FEILMELDINGER.                           */00000360
 /*                                                                   */00000370
 /* ***************************************************************** */00000380
 R001041: PROC(LOKAL_KOM_PTR) OPTIONS (MAIN);                           00000390
                                                                        00000400
          %INCLUDE P0019906;                                            00000410
          %INCLUDE P0019908;                                            00000420
          %INCLUDE P0019910;                                            00000430
          %INCLUDE P0019912;                                            00000440
          %INCLUDE P0019913;                                            00000450
                                                                        00000460
 DCL                                                                    00000470
      (CSTG, ADDR)                   BUILTIN;                           00000480
 DCL  COMMAREA_PEKER         PTR,                                       00000490
      LOKAL_KOM_PTR          PTR;                                       00000500
                                                                        00000510
                                                                        00000520
        /**   DUMMY DEKLARASJONER FOR OVERFØRINGSMODULENE  **/          00000530
 DCL                                                                    00000540
    CURSOR_POS FIXED BIN(15) INIT(-1),                                  00000550
    DFHBMUNP             CHAR(1) INIT(' '),                             00000560
    DFHBMBRY             CHAR(1) INIT('H'),                             00000570
    DFHBMASK             CHAR(1) INIT('8'),   /* H.INT + ASKIP  */      00000580
    FEIL_FUNNET          BIT(1)  INIT('1'B),                            00000590
    MELDING6O            CHAR(10),                                      00000600
    YMELDING6O           CHAR(10);                                      00000610
                                                                        00000620
          %INCLUDE S001F1  ;                                            00000630
          %INCLUDE P0011401;                                            00000640
                                                                        00000650
                                                                        00000660
 COMMAREA_PEKER = HOVED_KOM_OMR_PTR;                                    00000670
                                                                        00000680
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);   00000690
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);        00000700
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);     00000710
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);    00000720
                                                                        00000730
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER =   TRANS_OPPL_PTR(W01_TRANS_IND);00000740
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = TRANS_PTR(W01_TRANS_IND);       00000750
                                                                        00000760
 /*   HOVED PROC                              */                        00000770
       /*  ***************************        */                        00000780
                                                                        00000790
           CALL OVERFØR_E1SØKER_MAP;                /* R0011406 */      00000800
           CALL OVERFØR_E1KAP7_MAP;                 /* R0011406 */      00000810
           CALL OVERFØR_E1KAP8_MAP;                 /* R0011406 */      00000820
           CALL OVERFØR_E1KAP10_MAP;                /* R0011406 */      00000830
           CALL OVERFØR_E1KAP11_MAP;                /* R0011406 */      00000840
           S001141O.DUMMYA = 'Ø';                   /* PROT,DARK  */    00000850
                                                                        00000860
      EXEC CICS RETURN;                                                 00000870
                                                                        00000880
   SKRIV_FEIL:                       /**   DUMMY PROC  **/              00000890
      PROC(FIXED_DEC_5);                                                00000900
                                                                        00000910
      DCL                                                               00000920
        FIXED_DEC_5 UNAL FIXED DEC(5);                                  00000930
                                                                        00000940
                                                                        00000950
   END SKRIV_FEIL;                                                      00000960
                                                                        00000970
   SKRIV_FEIL_YP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00000980
                                                                        00000990
           DCL                                                          00001000
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001010
                                                                        00001020
   END SKRIV_FEIL_YP;                                                   00001030
                                                                        00001040
   SKRIV_FEIL_SP: PROC(FIXED_DEC_5); /** DUMMY PROC **/                 00001050
                                                                        00001060
           DCL                                                          00001070
             FIXED_DEC_5 UNAL FIXED DEC(5);                             00001080
                                                                        00001090
   END SKRIV_FEIL_SP;                                                   00001100
                                                                        00001110
   %INCLUDE  R0019912;                                                  00001120
   %INCLUDE  R0011406;                                                  00001130
   %INCLUDE  R0019988;                        /*  KONV_HÅMD_ÅMD       */00001140
   %INCLUDE  R0019989;                        /*  KONV_HÅMD_MÅ        */00001150
                                                                        00001160
 END R001041;                                                           00001170
