 /*   SIST ENDRET PÅ PROD   2008.11.05 16.24.57 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2008.05.31 11.23.48 AV   SPA2990          */        
 /*   SIST ENDRET PÅ PROD   2007.03.01 12.33.33 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.10.24 11.00.27 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.10.24  8.23.10 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.10.13  9.18.46 AV   JDA2990          */        
 /*   SIST ENDRET PÅ TEST   2006.10.13  9.17.21 AV   JDA2990          */        
 /*   SIST ENDRET PÅ PROD   2006.07.18 12.02.45 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.07.12 11.19.22 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.05.12 10.18.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.04.19 12.13.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.03.24  8.04.10 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.02.02  8.12.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.02.02  8.11.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.02.01 11.39.40 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.02.01 11.36.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2006.01.05  8.54.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2006.01.05  8.38.51 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.11.09  8.20.09 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.10.24 14.34.12 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.08.12 11.56.41 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.08.11  8.50.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2005.06.24 12.47.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.06.10  9.47.53 AV   SPA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.26 13.01.05 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.04.06  8.35.57 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.04.05 13.46.22 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2005.03.14 11.12.35 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2005.03.14 11.11.17 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.12.03 11.53.54 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.11.29  8.36.02 AV   TSB2970          */        
 /*   SIST ENDRET PÅ TEST   2004.11.29  8.34.29 AV   TSB2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.22 13.12.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.22 13.11.13 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.10.19 10.26.16 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.10.19  9.58.49 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.23 12.00.35 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.09.23 11.54.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.09 12.05.59 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.09.07 12.14.25 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.31 14.47.03 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.25  9.41.05 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.18 11.10.28 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.13 12.36.06 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.08.06 13.15.18 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.49.14 AV   SPA2970          */        
 /*   SIST ENDRET PÅ QASS   2004.03.15 12.04.31 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.17  8.48.11 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.06.11 10.15.20 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.06.05 12.01.52 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.06.04 14.09.58 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.06.04 14.08.14 AV   JDA2970          */        
 /*   SIST ENDRET PÅ QASS   2003.03.25 12.11.54 AV   JDA2970          */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /* **********************                                            */        
 /*  PROGRAM-IDENT : R0010410 - FORESPØRSEL - HOVEDPROG I CICS/PLI    */        
 /*  PROGRAM-SPRÅK : PLI                                              */        
 /*  PROGRAMMERER  : JAN KRISTENSEN                                   */        
 /*  PROGRAMMET BLE LAGET : AUGUST 1982                               */        
 /*  ENDRINGSDATO : 18.01.89                                          */        
 /*  ENDRINGEN GJELDER: YRKESSKADE / AFP                              */        
 /*  ENDRINGEN BLE UTFØRT AV :TRUDE                                   */        
 /*  ENDRINGSDATO : 20.02.91                                          */        
 /*  ENDRINGEN GJELDER: Få VEKK X_INNTEKT_OPPL. PÅ SKJERMBILDET (F-I) */        
 /*  ENDRINGEN BLE UTFØRT AV :O.G.                                    */        
 /*  ENDRINGSDATO : 12.01.94                                          */        
 /*  ENDRINGEN GJELDER: FÅ FREM TEKST FOR 'OMSORG  BARN/ANDRE'        */        
 /*  ENDRINGEN BLE UTFØRT AV :O.G.                                    */        
 /* ***************************************************************** */        
 /*HENSIKT:                                                           */        
 /* **********                                                        */        
 /*    SKRIVER UT SKJERMBILDER MED OPPLYSNINGER FRA RF-BASEN.         */        
 /*    PROGRAMMET AKTIVISERES NÅR OPERATØR HAR FYLT UT MENY-BILDET    */        
 /*    FOR FORESPØRSEL - MAP S001015, MAPSET S001013.                 */        
 /*    NY MAP MED DEN ØNSKEDE OPPLYSNINGSTYPE BLIR SKREVET            */        
 /*    UT - MAPSET S001043.                                           */        
 /*    OPERATØREN KAN NÅ VELGE MELLOM FORSKJELLIGE OPPLYSNINGS-       */        
 /*    TYPER, SISTE/NEST SISTE STATUS, OG SKIFTE OVER TIL EN          */        
 /*    ANNEN FAMILIEPERSON.                                           */        
 /*    OPPBYGGING AV TRANSAKSJONER, OG UTSKRIVINGEN AV DISSE SKJER    */        
 /*    I PROGRAM 0411 OG 0412.                                        */        
 /* ***************************************************************** */        
 /*PROGRAMTILKNYTTING:                                                */        
 /* ********************                                              */        
 /*    PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE = 'F410',    */        
 /*    DENNE TRANSKODE BLIR SATT I R0010301.                          */        
 /*    BRUK :       EXEC CICS RETURN                                  */        
 /*                 TRANSID('F410') COMMAREA(KOM_OMR)                 */        
 /*                                                                   */        
 /*    EXEC LINK TIL: R0010301   VALG AV FUNKSJON                     */        
 /*                   R0010411   BYGG_TRANS_LISTE                     */        
 /*                   R0010412   TRANS_LISTE_TIL_SKJERM               */        
 /*                   R0013110   LES INNTEKTER/PENSJONSHIST/STATUS    */        
 /*                   R0015201   LES TRANSAKSJON                      */        
 /*                   R0019906   ER FNR ENDRET ?                      */        
 /*    FUNKSJONER SOM BRUKES :                                        */        
 /*                   R0019902   F_KJØNN                              */        
 /*                   R0019904   F_GYLDIG_FNR                         */        
 /*                   R0019910   F_NUMERISK                           */        
 /*                   R0014163   F_INNTEKT_POENG                      */        
 /* ***************************************************************** */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /* ***********************                                           */        
 /*    LESER FNR-ENDRINGSREGISTERET                                   */        
 /*    LESER RF-BASEN                                                 */        
 /* ***************************************************************** */        
 /*FEILMELDINGER:                                                     */        
 /* *******************                                               */        
 /*    FEILMELDINGER LEGGES INN I FELTET 'MAP_MELDING'.               */        
 /*    I PROSEDYREN 'MAP_SEND' SKRIVES MELDINGEN UT PÅ MENYBILDET     */        
 /*    FOR FORESPØRSEL (MAP S001015) ELLER SVARBILDET (MAPSET S00104) */        
 /* ***************************************************************** */        
 /*ENDRET : 8.3.88 SL */                                                        
 /*     INITIERER BRUKERID I FNR_REG MED CICS_IND FØR KONTROLL PÅ */            
 /*     OM FNR ER ENDRET (9906). */                                             
 /* ***************************************************************** */        
 R001041: PROC(COMMAREA_PEKER) OPTIONS (MAIN);                                  
                                                                                
    %INCLUDE S00101;    /* MENY  MAP - SETTET        */                         
    %INCLUDE S00104;    /* FORESPØRSEL MAP - SETTET  */                         
    %INCLUDE P0012002;  /* PCB - PEKER - OMR         */                         
    %INCLUDE P0019906;  /* TRANS-OPPL-OMRÅDE (BASED) */                         
    %INCLUDE P0019908;  /* KOM-OMRÅDE (BASED)        */                         
    %INCLUDE P0019910;  /* STYRINGS - OMRÅDE (BASED) */                         
    %INCLUDE P0019912;  /* DIV-PARAM-OMRÅDE(BASED)   */                         
    %INCLUDE P0019924;  /* G_V_TAB                   */                         
    %INCLUDE P0019925;  /* G_TAB                     */                         
                                                                                
    DCL 1 B01 BASED(B01_PEKER),      %INCLUDE P0019921;                         
    DCL 1 B02 BASED(B02_PEKER),      %INCLUDE P0019921;                         
    DCL 1 RF1 BASED (RF1_PCB_PEKER), %INCLUDE P0012003;  /* PCB */              
                                                                                
  DCL                                                                           
     W01_PSB_NAVN                CHAR (8)       INIT('        ');               
  DCL                                                                           
     PLITDLI                     ENTRY;                                         
                                                                                
     DCL SYSPRINT                EXTERNAL FILE;                                 
    /* ************************************************************** */        
    /*                                                                */        
    /*   ARBEIDSFELTER SOM BRUKES AV UIB (USER INTERFACE BLOCK)       */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
    %INCLUDE DLIUIB;                                                            
       DCL 1 W01_PINT_AKT            UNALIGNED BASED(PINT_PTR),                 
    %INCLUDE P0019928;                              /* INNTEKTS-SEGM. */        
       DCL 1 W01_PINT_UT             UNALIGNED,                                 
    %INCLUDE P0019928;                              /* INNTEKTS-SEGM. */        
       DCL   W01_IO                  CHAR (350);   /*2000-2*/                   
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   DLI CALL-PARAMETRE + ANDRE KODER .                           */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
 DCL 1  W01_DLI_PARAM,                                                          
              2   W02_GU                  CHAR (4)   INIT ('GU  '),             
        2   W02_GN                  CHAR (4)   INIT ('GN  '),                   
        2   W02_PARM_CT_1     FIXED BIN  (31)  INIT (1),                        
        2   W02_PARM_CT_3     FIXED BIN  (31)  INIT (3),                        
        2   W02_PARM_CT_4     FIXED BIN  (31)  INIT (4),                        
        2   W02_PARM_CT_5     FIXED BIN  (31)  INIT (5);                        
                                                                                
                                                                                
    /* ************************************************************** */        
    /*                                                                */        
    /*   DL1 SSA-OMRÅDER FOR ROT OG STATUS-SEGMENTER.                 */        
    /*                                                                */        
    /* ************************************************************** */        
                                                                                
 DCL    SSA_UQUAL              STATIC      CHAR (9) INIT ((9)' ');              
                                                                                
 DCL 1  SSA1_RF0PERSN          STATIC,                                          
        2    HDEL                          CHAR (17)  INIT                      
             ('RF0PERSN(FNR     '),                                             
        2    REL_OP                        CHAR (2)   INIT (' ='),              
        2    PKEY               FIXED      DEC  (11)  INIT ( 0  ),              
        2    HP                            CHAR (1)   INIT (')' );              
                                                                                
                                                                                
 DCL                                                                            
    QUENAME CHAR(8),                                                            
       TERMID CHAR(4) DEF QUENAME POS(1),                                       
       REST   CHAR(4) DEF QUENAME POS(5);                                       
                                                                                
 DCL                                                                            
    ADDR                   BUILTIN,                                             
    STG                    BUILTIN,                                             
    DATE                   BUILTIN,                                             
    VERIFY                 BUILTIN,                                             
    CSTG                   BUILTIN,                                             
    CHAR                   BUILTIN,                                             
    MIN                    BUILTIN,                                             
    NULL                   BUILTIN,                                             
    LOW                    BUILTIN,                                             
    UNSPEC                 BUILTIN,                                             
    STRING                 BUILTIN,                                             
    SUBSTR                 BUILTIN;                                             
 DCL                                                                            
    COMMAREA_PEKER         PTR,                                                 
    MAPSET_PTR             PTR,                                                 
    BMSMAPBR               PTR,                                                 
    PINT_PTR               PTR;                                                 
  DCL                                                                           
    OPPLYSNINGSTYPE        CHAR(1) INIT(' '),                                   
    TRANSKODE_VED_START    CHAR(4),                                             
    BEHANDLE_NESTE_F       CHAR(4),                                             
    BEHANDLE_NESTE_B       CHAR(4),                                             
    BEHANDLE_NESTE_Y       CHAR(4),                                             
    LOOP_KODE              CHAR(1),                                             
    MAP_MELDING            CHAR(78) INIT((78)' '),                              
    EO_I                   FIXED BIN (15) INIT (0),                             
    UI                     FIXED BIN (15) INIT (0),                             
    UI2                    FIXED BIN (15) INIT (0),                             
    K                      FIXED BIN (15) INIT (0),                             
    L                      FIXED BIN (15) INIT (0),                             
    CHAR_1                 CHAR (1)      ,                                      
    PIC_10                 CHAR (10)      ,                                     
    H_TEXT                 CHAR (13)      ,                                     
    AFP_START              PIC'(2)9',                                           
    AFP_SLUTT              PIC'(2)9',                                           
    PIC_3                  PIC'(3)9',                                           
    PIC_999                PIC'(3)9',                                           
    H_ÅR4                  PIC '9999',                                          
    H_ÅR2  DEF H_ÅR4 POS(3)   PIC '99',                                         
    PRINT_KODE             PIC'9',                                              
    PIC_Z9                 PIC'Z9',                                             
    PIC_ZZ9                PIC'ZZ9',                                            
    PIC_9V99               PIC'9V.99',                                          
    PIC_ZZ9V99             PIC'ZZ9V.99',                                        
    PIC_ZZZZZZZZ9          PIC'ZZZZZZZZ9',                                      
    PIC_1                  PIC'9',                                              
    PIC_4                  PIC'(4)9',                                           
    PIC_6                  PIC'(6)9',                                           
    PIC_6Z                 PIC'9999B99',                                        
    PIC_8                  PIC'(8)9',                                           
    PIC_7                  PIC'(7)9',                                           
    PIC_11                 PIC'(11)9',                                          
    PIC_ZZZZBZZBZZ         PIC'ZZZZ.ZZ.ZZ',                                     
    PIC_ZZBZZBZZZZ         PIC'ZZ.ZZ.ZZZZ',                                     
    PIC_ZZZBZZZ            PIC'ZZZZBZZZ',                                       
    FÅR DEF PIC_11 POS (5) PIC'99',                                             
    FIXED_DEC3             FIXED DEC(3),                                        
    FIXED_DEC6             FIXED DEC(6) UNAL,                                   
    FIXED_DEC9             FIXED DEC(9),                                        
    FIXED_DEC5_4           FIXED DEC(5,4),                                      
    YT                     CHAR (7),                                            
    YK                     CHAR (12)  init ('            '),                    
    MAP_SET_NAME           CHAR(7),                                             
    STATUS_SKIFTE          BIT(1) INIT ('0'B),                                  
    SISTE_SIDE             BIT(1) INIT ('0'B),                                  
    GJØR_GN                BIT(1) INIT ('1'B),                                  
      I                      PIC'Z9',                                           
    LINJENO                PIC'99'  INIT (1),                                   
    NESTE_ÅR               PIC'9999',                                           
    ÅR4                    PIC'9999',                                           
    INNTEKT_START          PIC'9999' INIT(1963),                                
    INNTEKTSGR             PIC'(7)9' INIT(0);                                   
 DCL                                                                            
    T_UIBFCTR              CHAR(8),                                             
    T_UIBDLTR              CHAR(8),                                             
    START                  PIC'99' INIT(1),                                     
    UG_START1              PIC'99' INIT(1),                                     
    AP_START               PIC'99' INIT(1),                                     
    UP_START1              PIC'99' INIT(1),                                     
    YP_START1              PIC'99' INIT(1),                                     
    YP_START2              PIC'99' INIT(1),                                     
    LINJE_KODE             PIC'99' INIT(0),                                     
    IND_KODE               PIC'9'  INIT(0);                                     
 DCL                                                                            
    SIDE_TELL              PIC'999' INIT(1),                                    
    FIXED_BIN15            FIXED BIN(15),                                       
    LENGTH                 FIXED BIN(15),                                       
    INDEX_1                FIXED BIN(15),                                       
    INDEX_2                FIXED BIN(15),                                       
    LOW_CHAR_BASED         CHAR(1500) BASED(BMSMAPBR);                          
                                                                                
    DCL                                                                         
    PIX_Z9                 PIC'Z9',                                             
    PIX_ZZ9                PIC'ZZ9',                                            
    GP_F                   PIC'ZZZZ9',                                          
    TP_F                   PIC'ZZZZ9',                                          
    ST_F                   PIC'ZZZZ9',                                          
    SPT_F                  PIC'Z9V99',                                          
    OPT_F                  PIC'Z9V99',                                          
    SUM_F                  PIC'ZZZZ9',                                          
    GP_G                   PIC'ZZZZ9',                                          
    BR_F                   PIC'ZZBZZ9', /* BRUTTOBELØP DELPENSJON */            
    SUM_BRUTTO             PIC'ZZBZZ9', /* BRUTTOBELØP DELPENSJON */            
    SUM_NETTO              PIC'ZZBZZ9', /* SUM-NETTO              */            
    E_BRUTTO               PIC'ZZBZZ9', /* BRUTTOBELØP DELPENSJON */            
    E_NETTO                PIC'ZZBZZ9', /* SUM-NETTO              */            
    NE_F                   PIC'ZZBZZ9', /* NETTOBELØP DELPENSJON */             
    FAI_F               PIC'ZBZZZBZZ9', /* FAI FORMATERT */                     
    TEI_F               PIC'ZBZZZBZZ9', /* TEI FORMATERT */                     
    W_TEI_FAKTOR          PIC'999V.99',     /* TEI FAKTOR */                    
    HAR_OPPL               BIT (1) ALIGNED INIT('0'B),                          
    TP_G                   PIC'ZZZZ9',                                          
    PÅ_FAKTISK_EØS         PIC   'Z9',                                          
    ST_G                   PIC'ZZZZ9',                                          
    SUM_G                  PIC'ZZZZ9';                                          
                                                                                
 DCL 1 FNR_REG,                                                                 
       2 FNR1              FIXED DEC (11)     INIT ( 0 ),                       
       2 FNR2              FIXED DEC (11)     INIT ( 0 ),                       
       2 BRUKERID          CHAR      ( 4)     INIT ('' );                       
                                                                                
 DCL GRUNN_OMR1         CHAR      (1440);                                       
 DCL GRUNN_OMR2         CHAR      (1440);                                       
 DCL GRUNN_IDENT        CHAR      ( 8);                                         
                                                                                
                                                                                
 FORTSETT:                                                                      
    SUM_BRUTTO = 0;                                                             
    SUM_NETTO  = 0;                                                             
    E_BRUTTO   = 0;                                                             
    E_NETTO    = 0;                                                             
                                                                                
 TERMID   = EIBTRMID;                                                           
 REST     = 'COMA';                                                             
 PINT_PTR = ADDR(W01_IO);                                                       
                                                                                
   IF EIBCALEN = 0 THEN                                                         
      EXEC CICS READQ TS QUEUE(QUENAME) SET(COMMAREA_PEKER)                     
                                      LENGTH(LENGTH);                           
                                                                                
    EXEC CICS DELETEQ TS QUEUE(QUENAME) NOHANDLE;                               
                                                                                
 ALLOCATE GV_TAB_RE;                                                            
 ALLOCATE G_TAB_RE ;                                                            
 ALLOCATE  B01;                                                                 
 ALLOCATE  B02;                                                                 
                                                                                
 KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);           
 KOM_OMR.PEKER_LISTE.TRANS_PEKER      = ADDR(KOM_OMR.TRANS_OMR);                
 KOM_OMR.PEKER_LISTE.STYRINGS_PEKER   = ADDR(KOM_OMR.STYRINGS_OMR);             
 KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER  = ADDR(KOM_OMR.DIV_PARAM_OMR);            
 KOM_OMR.GV_PEKER                     = ADDR (GRUNN_OMR1             ) ;        
 KOM_OMR.G_PEKER                      = ADDR (GRUNN_OMR2             );         
 ATK_KOM_PTR            =  ADDR(KOM_OMR.ATK_COM_OMR);                           
                                                                                
 TRANSKODE_VED_START = TRANSKODE;                                               
 GV_TAB_RE   =  ''  ;                                                           
 G_TAB_RE    =  ''  ;                                                           
 B01         =  ''  ;                                                           
 B02         =  ''  ;                                                           
                                                                                
 W01_PSB_NAVN     = DIV_PARAM_OMR.PSB_NAVN;                                     
                                                                                
 EXEC CICS LOAD PROGRAM('S001043') SET(BMSMAPBR); /* FORESP-MAPSET */           
 ALLOCATE  LOW_CHAR_BASED;                                                      
                                                                                
 EXEC CICS HANDLE CONDITION OVERFLOW(OVERFLOW) SIGNAL(OVERFLOW);                
   GRUNN_IDENT   = 'P0019924';                                                  
   CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR1);                               
                                                                                
 GRUNN_IDENT                     = 'P0019925';                                  
 CALL P9956_BER_G_CICS(GRUNN_IDENT,GRUNN_OMR2);                                 
                                                                                
 FNR_REG.BRUKERID = DIV_PARAM_OMR.CICS_IND;  /*OBS SL+HL*/                      
                                                                                
 SELECT (TRANS_OPPL_OMR.TRANSKODE);                                             
   WHEN('F410')                                                                 
     DO;                                                                        
       CALL KONTROLL_INPUT_HOVED_MAP;                                           
       CALL SJEKK_MELDING;                                                      
         IND_KODE = 0;                                                          
                                                                                
       /*****  HER GÅR EN UT DERSOM FEIL  *******/                              
                                                                                
    /* IF ^ (OPPLYSNINGSTYPE = 'G' !                                            
             OPPLYSNINGSTYPE = 'A') THEN */                                     
          DO;                                                                   
             CALL ADDRESSER_B01;                                                
             CALL OPPRETT_STATUS_UTEN_TRANS;                                    
             CALL SJEKK_MELDING;                                                
          END;                                                                  
     END;                                                                       
   WHEN('F41T','F41S','F41P','F41B','F41Y','F41I','F41F')                       
     DO;                                                                        
       CALL ADDRESSER_B01;                                                      
       CALL KONTROLL_INPUT_TRAILER;                                             
       CALL SJEKK_MELDING;                                                      
     END;                                                                       
   OTHERWISE                                                                    
     ;  /* ALLE TRE TRANSER  */                                                 
 END;   /*  SELECT (TRANSKODE)  */                                              
                                                                                
 CALL ADDRESSER_B01;                                                            
                                                                                
 CALL  FINN_SEARCH_FNR;                                                         
                                                                                
 IF B01.RF0PERSN.FNR(SØKER_IND) = 0 &  ^(OPPLYSNINGSTYPE = 'G' !                
                                         OPPLYSNINGSTYPE = 'A' !                
                                         OPPLYSNINGSTYPE = 'X') THEN            
    DO;                                                                         
       CALL OPPRETT_STATUS_UTEN_TRANS;                                          
       CALL SJEKK_MELDING;                                                      
    END;                                                                        
 ELSE IF OPPLYSNINGSTYPE = 'G' !                                                
         OPPLYSNINGSTYPE = 'A' THEN                                             
    CALL FORBEREDE_TRANS;                                                       
                                                                                
 CALL SJEKK_MELDING;                                                            
                                                                                
                                                                                
 CALL SELECT_OPPLYSNINGSTYPE;                                                   
                                                                                
 CALL SJEKK_MELDING;                                                            
                                                                                
                                                                                
 CALL MAP_SEND;                                                                 
                                                                                
 RETURN:                                                                        
                                                                                
 IF TRANS_OPPL_OMR.TRANSKODE ^= 'F410' THEN                                     
   DO;                                                                          
     POS_I_B01 = SØKER_IND;                                                     
     IF B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND) = 0 THEN                            
        B01 = '';                                                               
   END;                                                                         
                                                                                
 /*FORELØPIG TILLEGG : */                                                       
                                                                                
 /*HL*/ S001015I.OPPLYSNINGSTYPEI = OPPLYSNINGSTYPE;                            
                                                                                
 EXEC CICS RETURN TRANSID(TRANS_OPPL_OMR.TRANSKODE)                             
                                              COMMAREA(KOM_OMR);                
                                                                                
                                                                                
                                                                                
 /**********   HER ER HOVEDSTYRING SLUTT   ***********/                         
 SELECT_OPPLYSNINGSTYPE:                                                        
   PROC;                                                                        
     SELECT (OPPLYSNINGSTYPE);                                                  
       WHEN('S','P','B','Y','F')                                                
         IF B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND) = 0 THEN                        
           DO;                                                                  
             PIC_11 = B01.RF0PERSN.FNR(SØKER_IND);                              
             IF ØNSKET_STATUS = 'S' THEN                                        
               DO;                                                              
                 MAP_MELDING = 'DET FINNES IKKE SISTE STATUS FOR '              
                             !!'FØDSELSNUMMER: ' !! PIC_11;                     
                 IF STATUS_SKIFTE THEN                                          
                   ØNSKET_STATUS = 'N';                                         
               END;                                                             
             ELSE                                                               
               DO;                                                              
                 MAP_MELDING = 'DET FINNES IKKE NEST SISTE STATUS'              
                             !!' FOR FØDSELSNUMMER: ' !! PIC_11;                
                 IF STATUS_SKIFTE THEN                                          
                   ØNSKET_STATUS = 'S';                                         
               END;                                                             
             RETURN;                                                            
           END;                                                                 
                                                                                
       OTHERWISE;                                                               
                                                                                
     END;   /**   SELECT (OPPLYSNINGSTYPE)  **/                                 
                                                                                
                                                                                
     SELECT (OPPLYSNINGSTYPE);                                                  
       WHEN('F')                                                                
         DO;                                                                    
           TRANS_OPPL_OMR.TRANSKODE = 'F41F';                                   
           CALL BYGG_FAMILIE_HEADER;                                            
           CALL BYGG_FAMILIE_FORH;                                              
         END;                                                                   
       WHEN('S')                                                                
         DO;                                                                    
           TRANS_OPPL_OMR.TRANSKODE = 'F41S';                                   
           CALL BYGG_STATUS;                                                    
         END;                                                                   
       WHEN('N')                                                                
         DO;                                                                    
           TRANS_OPPL_OMR.TRANSKODE = 'F41N';                                   
         END;                                                                   
       WHEN('X')                                                                
         DO;                                                                    
           TRANSKODE = 'F410';                                                  
         END;                                                                   
       WHEN('P')                                                                
         DO;                                                                    
           TRANS_OPPL_OMR.TRANSKODE = 'F41P';                                   
           CALL BYGG_GENHEAD('PERSONLIG INFO');                                 
           CALL BYGG_PERSONLIG_INFO;                                            
         END;                                                                   
       WHEN('I')                                                                
         DO;                                                                    
           CALL BYGG_INNTEKTS_HEADER;                                           
           CALL BYGG_INNTEKTS_FORH;                                             
         END;                                                                   
       WHEN('B')                                                                
         DO;                                                                    
           TRANS_OPPL_OMR.TRANSKODE = 'F41B';                                   
           CALL BYGG_GENHEAD('BEREGNINGSGRUNNLAG');                             
           CALL BYGG_BEREGNINGSGRUNNLAG;                                        
         END;                                                                   
       WHEN('Y')                                                                
         DO;                                                                    
           TRANS_OPPL_OMR.TRANSKODE = 'F41Y';                                   
           CALL BYGG_GENHEAD('YTELSER');                                        
           CALL BYGG_YTELSER;                                                   
         END;                                                                   
       WHEN('G','A')                                                            
         DO;                                                                    
           CALL BYGG_TRANS;                                                     
         END;                                                                   
       OTHERWISE                                                                
         ;                                                                      
     END;  /*  SELECT   */                                                      
 END SELECT_OPPLYSNINGSTYPE;                                                    
                                                                                
 /* ----------------------------------------------------------------- */        
                                                                                
 FINN_SEARCH_FNR:                                                               
   PROC;                                                                        
  /* DO INDEX_1 = 1 TO 14; */                                                   
     DO INDEX_1 = 1 TO HBOUND(KOM_OMR.FNR_TAB);                                 
       IF SEARCH_FNR = KOM_OMR.FNR_TAB(INDEX_1) THEN                            
         DO;                                                                    
           SØKER_IND = INDEX_1;                                                 
           IF SØKER_IND = 1 THEN                                                
              EKTEF_IND = 2;                                                    
           ELSE                                                                 
           IF SØKER_IND = 2 THEN                                                
              EKTEF_IND = 1;                                                    
           RETURN;                                                              
         END;                                                                   
     END;                                                                       
                                                                                
     PIC_11 = SEARCH_FNR;                                                       
     FND_SØKER = PIC_11;                                                        
                                                                                
     IF F_KJØNN(PIC_11) = 'K' THEN                                              
        DO;                                                                     
           SØKER_IND = 1;                                                       
           EKTEF_IND = 2;                                                       
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           SØKER_IND = 2;                                                       
           EKTEF_IND = 1;                                                       
        END;                                                                    
                                                                                
     B01 = '';                                                                  
                                                                                
 END FINN_SEARCH_FNR;                                                           
                                                                                
                                                                                
 LOW_VALUES_TIL_MAP:                                                            
   PROC;                                                                        
     LOW_CHAR_BASED = (1500)' ';                                                
 END LOW_VALUES_TIL_MAP;                                                        
                                                                                
                                                                                
 ADDRESSER_B01:                                                                 
   PROC;                                                                        
      IND_KODE = 0;                                                             
      LINJE_KODE = 0;                                                           
      IF ØNSKET_STATUS = 'S' THEN                                               
        KOM_OMR.PEKER_LISTE.B01_PEKER = ADDR(B01);                              
      ELSE                                                                      
        KOM_OMR.PEKER_LISTE.B01_PEKER = ADDR(B02);                              
 END ADDRESSER_B01;                                                             
                                                                                
                                                                                
 EN_BLANK_LINJE:                                                                
   PROC;                                                                        
     EXEC CICS SEND MAP('BLANKL') MAPSET('S001043') ACCUM PAGING                
                                               MAPONLY;                         
      LINJENO    = LINJENO + 1;                                                 
 END EN_BLANK_LINJE;                                                            
                                                                                
                                                                                
 DUMMY_LINJE:                                                                   
   PROC;                                                                        
     EXEC CICS SEND MAP('BLANKL') MAPSET('S001043') ACCUM PAGING                
                                               MAPONLY;                         
 END DUMMY_LINJE;                                                               
                                                                                
 SEND_UTLINJE:                                                                  
   PROC;                                                                        
     EXEC CICS SEND MAP('UTLINJE') MAPSET('S001043') ACCUM PAGING;              
      LINJENO    = LINJENO + 1;                                                 
      IF LOOP_KODE = 'J'  THEN                                                  
         LINJE_KODE = LINJE_KODE + 1;                                           
      IF LINJENO    > 19  THEN                                                  
         DO;                                                                    
             LINJENO    =  1;                                                   
             DO WHILE ('A' = 'A');                                              
                CALL DUMMY_LINJE ;                                              
             END;                                                               
         END;                                                                   
 END SEND_UTLINJE;                                                              
                                                                                
                                                                                
 SEND_UTLS:                                                                     
   PROC;                                                                        
     EXEC CICS SEND MAP('UTLS') MAPSET('S001043') ACCUM PAGING;                 
                                                                                
      LINJENO    = LINJENO + 1;                                                 
 END SEND_UTLS;                                                                 
                                                                                
                                                                                
 BYGG_GENHEAD:                                                                  
   PROC(FORESPØRSELTYPE);                                                       
     DCL FORESPØRSELTYPE CHAR(18);                                              
                                                                                
     CALL LOW_VALUES_TIL_MAP;                                                   
     PIC_8 = DIV_PARAM_OMR.DATO_2000;                                           
     FIXED_DEC6 = KONV_HÅMD_ÅMD(PIC_8);                                         
                                                                                
     GENHEADO.FORESPØRSELO     = FORESPØRSELTYPE;                               
     IF OPPLYSNINGSTYPE ^= 'I' THEN                                             
        DO;                                                                     
        /*                                                                      
           IF ØNSKET_STATUS = 'S' THEN                                          
        */                                                                      
           IF B01.STATUS.STATUS_KODE (SØKER_IND) = 'S' THEN                     
              GENHEADO.STATUS_INDO = 'SISTE STATUS';                            
           ELSE                                                                 
              GENHEADO.STATUS_INDO = 'N-SISTE STATUS';                          
                                                                                
        END;                                                                    
                                                                                
     GENHEADO.DAGENS_DATO_DMÅO = KONV_HÅMD_DBMBHÅ(PIC_8);                       
     GENHEADO.FNRO  = B01.RF0PERSN.FNR (SØKER_IND);                             
                                                                                
     IF B01.RF0PERSN.NAVN(SØKER_IND) = (25) ' ' THEN                            
       GENHEADO.NAVNO = '*** NAVN ER IKKE REG ***';                             
     ELSE                                                                       
       GENHEADO.NAVNO = B01.RF0PERSN.NAVN(SØKER_IND);                           
     GENHEADO.TKNRO = B01.RF0PERSN.TKNR(SØKER_IND);                             
     PIC_4    = KONV_HÅMD_ÅM((B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND)));            
                                                                                
     IF PIC_4 > 0 THEN                                                          
       DO;                                                                      
          PIC_10                                                                
          = KONV_HÅMD_DBMBHÅ((B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND)));            
          GENHEADO.TEXT_VIRK_DATOO = 'VIRK.DATO '!!                             
                                      PIC_10;                                   
       END;                                                                     
                                                                                
     IF B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = 'X' THEN                       
       DO;                                                                      
         IF B01.STATUS.DØDSDATO_ÅMD(SØKER_IND) > 0 THEN                         
             GENHEADO.HISTORIKKO = 'DØDSHISTORISK TILFELLE';                    
         ELSE                                                                   
             GENHEADO.HISTORIKKO = 'OPPHØRT UP ELLER AFP   ';                   
                                       /* TRUDE */                              
       END;                                                                     
                                                                                
     ELSE IF B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = 'O' THEN                  
                                                                                
       GENHEADO.HISTORIKKO = 'OPPHØRT TILFELLE';                                
                                                                                
                                                                                
           DCL K FIXED BIN(15) INIT (0),                                        
               M FIXED BIN(15) INIT (0);                                        
                                                                                
           DO K = HBOUND(B01.YRKEHIST,2) TO LBOUND(B01.YRKEHIST,2)              
                    BY -1 UNTIL(B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,K) > 0);        
              M = K;                                                            
           END;                                                                 
                                                                                
           IF (B01.KAP_11_7_UTLØST(SØKER_IND,M)       = 'J'  &                  
               B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = 'X') THEN               
              GENHEADO.HISTORIKKO = 'PENSJONEN ER ENGANGSUTLØST';               
                                       /* HIT TRUDE */                          
                                                                                
     EXEC CICS SEND MAP('GENHEAD') MAPSET('S001043') ACCUM PAGING ERASE;        
                                                                                
 END BYGG_GENHEAD;                                                              
                                                                                
                                                                                
 BYGG_FAMILIE_HEADER:                                                           
   PROC;                                                                        
     CALL LOW_VALUES_TIL_MAP;                                                   
                                                                                
     IF ØNSKET_STATUS = 'S' THEN                                                
       S001042O.STATUS_INDO = 'SISTE STATUS';                                   
     ELSE                                                                       
       S001042O.STATUS_INDO = 'NEST SISTE STATUS';                              
                                                                                
     S001042O.VIRK_DATO_MÅO =                                                   
       KONV_HÅMD_DBMBHÅ((B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND)));                 
                                                                                
                                                                                
     EXEC CICS SEND MAP('S001042') MAPSET('S001043') ACCUM PAGING ERASE;        
                                                                                
 END BYGG_FAMILIE_HEADER;                                                       
                                                                                
                                                                                
 BYGG_INNTEKTS_HEADER:                                                          
   PROC;                                                                        
     CALL BYGG_GENHEAD('INNTEKTER');                                            
     EXEC CICS SEND MAP('INTHEAD') MAPSET('S001043') ACCUM PAGING               
                                                     MAPONLY;                   
 END BYGG_INNTEKTS_HEADER;                                                      
                                                                                
                                                                                
 BYGG_FAMILIE_FORH:                                                             
   PROC;                                                                        
                                                                                
     DO I = START TO 14 WHILE(B01.RF0PERSN.FNR(I) > 0);                         
        START = I;                                                              
        CALL LOW_VALUES_TIL_MAP;                                                
        SELECT (B01.STATUS.PENSJONSTYPE1(I));                                   
           WHEN('L','B','N')                                                    
              MORFARO.FNR_TEKSTO = 'BARN';                                      
           WHEN(' ',' ')                                                        
              MORFARO.FNR_TEKSTO = 'S.FEIL';                                    
           OTHERWISE                                                            
              DO;                                                               
                 PIC_11 = B01.RF0PERSN.FNR(I);                                  
                 IF F_KJØNN(PIC_11) = 'K' THEN                                  
                    MORFARO.FNR_TEKSTO = 'KVINNE';                              
                 ELSE                                                           
                    MORFARO.FNR_TEKSTO = 'MANN';                                
              END;                                                              
        END;         /*   SELECT     */                                         
                                                                                
        MORFARO.FNRO  = B01.RF0PERSN.FNR (I);                                   
        MORFARO.NAVNO = B01.RF0PERSN.NAVN(I);                                   
                                                                                
        IF B01.STATUS.DØDSDATO_ÅMD(I) > 0 THEN                                  
           MORFARO.DØDSDATO_DMÅO =                                              
              KONV_HÅMD_DMÅ((B01.STATUS.DØDSDATO_ÅMD(I)));                      
                                                                                
         /*   SNU_DATO_TIL_DMÅ(B01.STATUS.DØDSDATO_ÅMD(I))  */                  
        ELSE                                                                    
           DO;                                                                  
              MORFARO.DØDSDATO_DMÅA = 'Ø'; /** ASKIP OG DARK **/                
              MORFARO.DØDSDATO_TA   = 'Ø'; /** ASKIP OG DARK **/                
           END;                                                                 
                                                                                
        MORFARO.SPERREO = B01.RF0PERSN.SPERRE(I);                               
                                                                                
        IF B01.STATUS.STATUS_KODE_HIST(I) = 'O' THEN                            
           MORFARO.ST_KOD_HSTO  = 'OPPHØRT -';                                  
                                                                                
        MORFARO.PENSJONSTYPEO =                                                 
               HENT_PENSJONSTYPE1 (B01.STATUS.PENSJONSTYPE1 (I) ,               
                                   B01.STATUS.PENSJONSTYPE3 (I) )  !!           
               HENT_PENSJONSTYPE2 (B01.STATUS.PENSJONSTYPE1 (I) ,               
                                   B01.STATUS.PENSJONSTYPE2 (I) )    ;          
                                                                                
        EXEC CICS SEND MAP('MORFAR') MAPSET('S001043') ACCUM PAGING  ;          
     END;                                                                       
                                                                                
                                                                                
     /* HIT KOMMER EN NÅ EN IKKE HAR FLERE  IGJEN  */                           
                                                                                
     SISTE_SIDE = '1'B;                                                         
     GOTO OVERFLOW;                                                             
                                                                                
                                                                                
      HENT_PENSJONSTYPE1:                                                       
        PROC (PT1,PT3) RETURNS ( CHAR (40) UNAL VARYING);                       
          DCL                                                                   
              PT1      CHAR ( 1)  UNAL,                                         
              PT3      CHAR ( 1)  UNAL,                                         
              RETUR    CHAR (40)  UNAL VARYING;                                 
                                                                                
          SELECT(PT1);                                                          
            WHEN('A')                                                           
              RETUR = 'ALDERSPENSJON';                                          
            WHEN('B')                                                           
              RETUR = 'FORELDRELØSE BARN';                                      
            WHEN('D')                                                           
              RETUR = 'PERSONEN ER DØD';                                        
            WHEN('E')                                                           
              RETUR = 'ETTERLATTEPENSJON';                                      
            WHEN('F')                                                           
              RETUR = 'FORSØRGET EKTEFELLE';                                    
            WHEN('J')                                                           
              RETUR = 'ETTERLATT FAMILIEPLEIER';                                
            WHEN('K')                                                           
              RETUR = 'AFP - AVTALEFESTET PENSJON';                             
            WHEN('L')                                                           
              RETUR = 'FORSØRGET BARN';                                         
            WHEN('N')                                                           
              RETUR = 'BARNE_P EN AV FORELDRENE DØD';                           
            WHEN('U')                                                           
              IF PT3   = 'A'                              THEN                  
                 RETUR = 'ATTFØRING';                                           
              ELSE                                                              
                 RETUR = 'UFØREPENSJON';                                        
            WHEN('Y')                                                           
              IF PT3   = 'A'                              THEN                  
                 RETUR = 'YRKESSKADE - ATTFØRING';                              
              ELSE                                                              
                 RETUR = 'YRKESSKADE - UFØREPENSJON';                           
            WHEN('G')                                                           
              IF B01.SIVILSTAND (I) = 'P' THEN                                  
                 RETUR = 'PARTNER';                                             
              ELSE                                                              
              IF B01.SIVILSTAND (I) = 'W' THEN                                  
                 RETUR = 'SAMBOER';                                             
              ELSE                                                              
              IF B01.SIVILSTAND (I) = 'V' THEN                                  
                 RETUR = 'SAMBOER';                                             
              ELSE                                                              
                 RETUR = 'GIFT';                                                
            WHEN(' ')                                                           
              RETUR = ' ';                                                      
            OTHERWISE                                                           
              RETUR = 'FEIL PT1 KODE: ' !! PT1;                                 
          END;   /*  SELECT(PT1)   */                                           
                                                                                
        RETURN(RETUR);                                                          
                                                                                
      END HENT_PENSJONSTYPE1;                                                   
                                                                                
      HENT_PENSJONSTYPE2:                                                       
        PROC(PT1,PT2) RETURNS(CHAR(40) UNAL VARYING);                           
          DCL                                                                   
             PT1      CHAR(1)  UNAL,                                            
             PT2      CHAR(1)  UNAL,                                            
             RETUR    CHAR(40) UNAL VARYING;                                    
                                                                                
          SELECT(PT2);                                                          
 /*         WHEN('B')         ENDRET 15.3.88 SATISH                             
              RETUR = ' - BARE BARNETILSYN'         */                          
            WHEN('E')                                                           
              RETUR = ' - ETTERLATTEPENSJON';                                   
            WHEN('F')                                                           
              RETUR = ' - FORSØRGER EKTEFELLE';                                 
            WHEN('M')                                                           
              RETUR = ' - INNTEKT > 4G';                                        
            WHEN('N')                                                           
              RETUR = ' - NULLPENSJON';                                         
            WHEN('O')                                                           
              RETUR = ' - OVERGANGSSTØNAD';                                     
            WHEN('P')                                                           
                                                                                
              DO;                                                               
                 IF PT1 = 'B'   !                                               
                    PT1 = 'N'   THEN                                            
                    RETUR = ' - YNGSTE BARN';                                   
                 ELSE                                                           
                    RETUR = ' - PENSJON';                                       
              END;                                                              
                                                                                
            WHEN('R')                                                           
              RETUR = ' - INNTEKTSAVHENGIG BARNETILLEGG ';                      
            WHEN('S')                                                           
              RETUR = ' - SAMMENSTØTENDE PENSJON';                              
            WHEN('U')                                                           
              RETUR = ' - INNTEKT < 4G';                                        
            WHEN('V')                                                           
              RETUR = ' - BARNETILLEGG - SÆRKULL';                              
            WHEN('W')                                                           
              RETUR = ' - BARNETILLEGG - FELLESBARN';                           
            WHEN('Ø')                                                           
              RETUR = ' - ØVRIGE BARN';                                         
            WHEN(' ')                                                           
              RETUR = ' ';                                                      
            OTHERWISE                                                           
              RETUR = ' - FEIL PT2 KODE: ' !! PT2;                              
          END;   /*  SELECT(PT2)   */                                           
                                                                                
        RETURN(RETUR);                                                          
                                                                                
      END HENT_PENSJONSTYPE2;                                                   
                                                                                
 END BYGG_FAMILIE_FORH;                                                         
                                                                                
 BYGG_INNTEKTS_FORH:                                                            
   PROC;                                                                        
                                                                                
     CALL LOW_VALUES_TIL_MAP;                                                   
       IF INNTEKT_START = 1963 THEN                                             
         DO;                                                                    
           IF B01.TILBERPO.AI63(SØKER_IND) > 0 THEN                             
             CALL FØR_67((B01.TILBERPO.AI63(SØKER_IND)),63,'ANTATT');           
           IF B01.TILBERPO.AI64(SØKER_IND) > 0 THEN                             
             CALL FØR_67((B01.TILBERPO.AI64(SØKER_IND)),64,'ANTATT');           
           IF B01.TILBERPO.AI65(SØKER_IND) > 0 THEN                             
             CALL FØR_67((B01.TILBERPO.AI65(SØKER_IND)),65,'ANTATT');           
           IF B01.TILBERPO.AI66(SØKER_IND) > 0 THEN                             
             CALL FØR_67((B01.TILBERPO.AI66(SØKER_IND)),66,'ANTATT');           
           IF B01.TILBERPO.PI66(SØKER_IND) > 0 THEN                             
             CALL FØR_67((B01.TILBERPO.PI66(SØKER_IND)),66,                     
                                                       'ARBEIDS');              
           INNTEKT_START = 1967;                                                
         END;                                                                   
                                                                                
                                                                                
         IF INNTEKT_START = 1967 THEN                                           
                                                                                
           DO;                                                                  
                                                                                
              CALL DATABASE('CLOSE');                                           
              CALL DATABASE('OPEN');                                            
                                                                                
              SSA1_RF0PERSN.PKEY = B01.RF0PERSN.FNR(SØKER_IND);                 
              SSA_UQUAL     = 'PINNTEKT';                                       
              CALL PLITDLI                         (W02_PARM_CT_5,              
                                                    W02_GU,                     
                                                    RF1,                        
                                                    W01_IO,                     
                                                    SSA1_RF0PERSN,              
                                                    SSA_UQUAL);                 
                                                                                
              IF  W01_PINT_UT.W02_PI_TYPE = 'X' THEN                            
                  GOTO SLUTT_BYGG_I_F;                                          
                                                                                
              IF  UIBFCTR                    =     '00000000'B   THEN           
                DO;                                                             
                  SELECT ( RF1.STATUS_KODE );                                   
                    WHEN ( '  ' )                                               
                      ;                                                         
                    WHEN ( 'GE' )                                               
                      DO;                                                       
                         SISTE_SIDE = '1'B;                                     
                         GOTO OVERFLOW;                                         
                      END;                                                      
                    OTHERWISE                                                   
                      DO;                                                       
                /* ************************************************** */        
                /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */        
                /* ************************************************** */        
                                                                                
                   MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GU I BYG'        
                               !!'G_INNTEKTER, STATUS_KODE: '!!                 
                                           RF1.STATUS_KODE ;                    
                      END;                                                      
                  END;                                                          
                END;                                                            
              ELSE                                                              
                DO;                                                             
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
                                                                                
             MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GU I BYGG_'            
                      !!'INNTEKTER,:' !! UNSPEC(UIBFCTR) !! ' '                 
                                            !! UNSPEC(UIBDLTR);                 
                END;                                                            
                                                                                
              CALL SJEKK_MELDING;                                               
              W01_PINT_UT =               W01_PINT_AKT;                         
              INNTEKT_START = 1968;                                             
           END;                                                                 
                                                                                
        DO WHILE ('A' = 'A');                                                   
                                                                                
           CALL LOW_VALUES_TIL_MAP;                                             
           IF GJØR_GN                          THEN                             
              CALL PLITDLI                      (W02_PARM_CT_3,                 
                                                 W02_GN,                        
                                                 RF1,                           
                                                 W01_IO);                       
                                                                                
           IF   UIBFCTR                    =     '00000000'B  THEN              
             DO;                                                                
               SELECT ( RF1.STATUS_KODE );                                      
                 WHEN ( '  ' )                                                  
                   DO;                                                          
                      NESTE_ÅR  =  W01_PINT_AKT.W02_PI_ÅR;                      
                      IF W01_PINT_AKT.W02_PI_TYPE ^= 'X' THEN                   
                         CALL ACCUM_INNT;                                       
                   END;                                                         
                 WHEN ( 'GK','GA','GB','GE' )                                   
                   DO;                                                          
                      NESTE_ÅR  =  1;     /* BARE EN TEST  VERDI */             
                      ALLOCATE W01_PINT_AKT;                                    
                      W01_PINT_AKT = '';                                        
                      CALL ACCUM_INNT;                                          
                      TRANS_OPPL_OMR.TRANSKODE = 'F41I';                        
                      SISTE_SIDE = '1'B;                                        
                      GOTO OVERFLOW;                                            
                   END;                                                         
                OTHERWISE                                                       
                   DO;                                                          
          /* ************************************************** */              
          /*   UGYLDIG STATUS-KODE FRA DLI. FEIL-KODE SETTES.   */              
          /* ************************************************** */              
                                                                                
                   MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GN I BYG'        
                         !!'G_INNTEKTER, STATUS_KODE: '!!                       
                                     RF1.STATUS_KODE ;                          
                   END;                                                         
               END;                                                             
             END;                                                               
           ELSE                                                                 
             DO;                                                                
          /* ************************************************** */              
          /*   UIB'S RETUR-CODE ER UAKSEPTABEL                  */              
          /* ************************************************** */              
                                                                                
                MAP_MELDING = 'NOE ER GALT MED DATABASEN PÅ GN I BYGG_'         
                        !!'INNTEKTER, KODE: ' !! UNSPEC(UIBFCTR) !! ' '         
                                            !! UNSPEC(UIBDLTR);                 
             END;                                                               
                                                                                
           CALL SJEKK_MELDING;                                                  
                                                                                
        END;   /****    DO WHILE ('A' = 'A')    ******/                         
                                                                                
                                                                                
     SISTE_SIDE = '1'B;                                                         
     GOTO OVERFLOW;                                                             
                                                                                
   MAX_UFG:                                                                     
     PROC(INNT_ÅR,UFG_TIL_POENG,MAX_UFG);                                       
       DCL                                                                      
         INNT_ÅR       PIC'9999'  UNAL,                                         
         MAX_UFG       PIC'ZZZ' UNAL,                                           
         UFG_TIL_POENG FIXED DEC(3),                                            
         UFT_ÅM        PIC'(6)9',                                               
         OPPH_ÅM       PIC'(6)9',                                               
         UFT_Å         PIC'(4)9' DEF UFT_ÅM  POS(1),                            
         UFT_M         PIC'(2)9' DEF UFT_ÅM  POS(5),                            
         OPPH_Å        PIC'(4)9' DEF OPPH_ÅM POS(1),                            
         OPPH_M        PIC'(2)9' DEF OPPH_ÅM POS(5);                            
                                                                                
       DCL FÅR4        PIC '(4)9' INIT (0);                                     
                                                                                
       MAX_UFG       = 0;                                                       
       UFG_TIL_POENG = 999;                                                     
                                                                                
   /*  DO INDEX_1 = 1 TO 7 */                                                   
       DO INDEX_1 = 1 TO HBOUND(B01.UFØRHIST,2)                                 
                    WHILE(B01.UFØRHIST.UFT_ÅMD(SØKER_IND,INDEX_1) > 0);         
         UFT_ÅM  = B01.UFØRHIST.UFT_ÅMD(SØKER_IND,INDEX_1)/100;                 
        OPPH_ÅM  = B01.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,INDEX_1)/100;         
                                                                                
                                                                                
       IF INDEX_1                                 > 1       &                   
          B01.UFØRHIST.UFT_ÅMD (SØKER_IND,INDEX_1) ^=                           
          B01.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,(INDEX_1 - 1 ))                
                                   THEN                                         
            IF OPPH_M = 1          THEN                                         
               OPPH_Å = OPPH_Å - 1;                                             
                                                                                
         PIC_11 = B01.FNR(SØKER_IND);                                           
         FÅR4 = KONV_ÅR_HÅ(FÅR);                                                
         IF FÅR4 > 1923  &                                                      
            OPPH_Å > (FÅR4 + 67)      THEN                                      
            OPPH_Å = FÅR4 + 67;                                                 
                                                                                
         IF UFT_Å = INNT_ÅR ! INNT_ÅR = OPPH_Å THEN                             
            UFG_TIL_POENG = 0;                                                  
                                                                                
         IF (UFT_Å <= INNT_ÅR) & (OPPH_Å = 0 ! INNT_ÅR <= OPPH_Å) THEN          
                                                                                
           DO;                                                                  
             IF MAX_UFG  < B01.UFØRHIST.UFG(SØKER_IND,INDEX_1) THEN             
               MAX_UFG  = B01.UFØRHIST.UFG(SØKER_IND,INDEX_1);                  
   /*        DO INDEX_2 = 1 TO 12 */                                            
 /*JFA  */   DO INDEX_2 = 1 TO HBOUND(B01.UFØRGRAD,3)                           
                          WHILE(B01.UFØRHIST.UFØRGRAD.                          
                          UFG_DATO_ÅMD(SØKER_IND,INDEX_1,INDEX_2) > 0);         
               UFT_ÅM = B01.UFØRHIST.UFØRGRAD.UFG_DATO_ÅMD                      
                                     (SØKER_IND,INDEX_1,INDEX_2)/100;           
                                                                                
               IF UFT_Å < INNT_ÅR              !                                
                (UFT_M = 1 & UFT_Å = INNT_ÅR)  !                                
                (UFT_Å = INNT_ÅR & B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE             
                         (SØKER_IND,INDEX_1,INDEX_2) > MAX_UFG) THEN            
                 MAX_UFG = B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE                     
                                   (SØKER_IND,INDEX_1,INDEX_2);                 
             END;                                                               
           END;                                                                 
       END;                                                                     
                                                                                
       IF  UFG_TIL_POENG = 999 THEN                                             
           UFG_TIL_POENG = MAX_UFG;                                             
                                                                                
   END MAX_UFG;                                                                 
                                                                                
   FØR_67:                                                                      
     PROC(INNTEKT,ÅR,TYPE);                                                     
                                                                                
     DCL                                                                        
       INNTEKT FIXED DEC(7) UNAL,                                               
       ÅR      PIC   '99'   UNAL,                                               
       TYPE    CHAR  (10)   UNAL;                                               
                                                                                
       INNTEKTO.ÅRO             = ÅR ;                                          
       INNTEKTO.INNT_TYPEO      = SUBSTR(TYPE,1,9); /* IEL0892I */              
       INNTEKTO.INNTO           = INNTEKT;                                      
       INNTEKTO.SUM_INNTO       = INNTEKT;                                      
       EXEC CICS SEND MAP('INNTEKT') MAPSET('S001043') ACCUM PAGING;            
       CALL EN_BLANK_LINJE;                                                     
                                                                                
   END FØR_67;                                                                  
                                                                                
                                                                                
   ACCUM_INNT:         PROC;                                                    
                                                                                
       DCL DETTE_ÅR PIC '9999',                                                 
           RAPPART  CHAR(1) INIT(' '),                                          
           INNTART  CHAR(1) INIT(' ');                                          
                                                                                
       INNTEKTO.ÅRO = KONV_HÅ_Å((W01_PINT_UT.W02_PI_ÅR));                       
       ÅR4          = W01_PINT_UT.W02_PI_ÅR ;                                   
                                                                                
                                                                                
       SELECT (W01_PINT_UT.W02_PI_TYPE);                                        
          WHEN('A')                                                             
             INNTEKTO.INNT_TYPEO = 'FORELØPIG';                                 
          WHEN('B')                                                             
             DO;                                                                
                RAPPART = 'B';                                                  
                INNTART = '1';                                                  
             END;                                                               
          WHEN('C')                                                             
             DO;                                                                
                RAPPART = 'B';                                                  
                INNTART = '2';                                                  
             END;                                                               
          WHEN('D')                                                             
             DO;                                                                
                RAPPART = 'B';                                                  
                INNTART = '3';                                                  
             END;                                                               
          WHEN('E')                                                             
             DO;                                                                
                RAPPART = 'C';                                                  
                INNTART = '1';                                                  
             END;                                                               
          WHEN('F')                                                             
             DO;                                                                
                RAPPART = 'C';                                                  
                INNTART = '2';                                                  
             END;                                                               
          WHEN('H')                                                             
             DO;                                                                
                RAPPART = 'D';                                                  
                INNTART = '1';                                                  
             END;                                                               
          WHEN('I')                                                             
             DO;                                                                
                RAPPART = 'D';                                                  
                INNTART = '2';                                                  
             END;                                                               
          WHEN('S')                                                             
             DO;                                                                
                RAPPART = 'S';                                                  
                INNTART = '1';                                                  
             END;                                                               
          WHEN('T')                                                             
             DO;                                                                
                RAPPART = 'S';                                                  
                INNTART = '2';                                                  
             END;                                                               
          WHEN('J')                                                             
             DO;                                                                
                RAPPART = 'O';                                                  
                INNTART = '4';                                                  
             END;                                                               
          WHEN('K')                                                             
             DO;                                                                
                RAPPART = 'O';                                                  
                INNTART = '5';                                                  
             END;                                                               
          WHEN('L')                                                             
             DO;                                                                
                RAPPART = 'O';                                                  
                INNTART = '6';                                                  
             END;                                                               
          WHEN('V')                                                             
             DO;                                                                
                RAPPART = 'U';                                                  
                INNTART = '1';                                                  
             END;                                                               
          WHEN('W')                                                             
             DO;                                                                
                RAPPART = 'U';                                                  
                INNTART = '2';                                                  
             END;                                                               
          OTHERWISE                                                             
             ;                                                                  
       END ;  /****SELECT (W01_PINT_UT.W02_PI_TYPE)  ***/                       
                                                                                
       SELECT (RAPPART);                                                        
          /* INNT_TYPE0 = CHARACTER(9) - Ga TRUNC */                            
          WHEN('B')                                                             
             INNTEKTO.INNT_TYPEO = 'INNENLAND';                                 
          /* INNTEKTO.INNT_TYPEO = 'INNENLANDS' IEL0892I */                     
          WHEN('C')                                                             
             INNTEKTO.INNT_TYPEO = 'SJØ INNTK';                                 
          /* INNTEKTO.INNT_TYPEO = 'SJØ INNTKt' IEL0892I */                     
          WHEN('D')                                                             
             INNTEKTO.INNT_TYPEO = 'DIV UTLAN';                                 
          /* INNTEKTO.INNT_TYPEO = 'DIV UTLAND' IEL0892I */                     
          WHEN('S')                                                             
             INNTEKTO.INNT_TYPEO = 'SVALBARD ';                                 
          WHEN('U')                                                             
             INNTEKTO.INNT_TYPEO = 'DIPLOMAT ';                                 
          WHEN('O')                                                             
             INNTEKTO.INNT_TYPEO = 'OMSORG   ';                                 
          OTHERWISE                                                             
              ;                                                                 
       END;      /*****  SELECT (RAPPART)    *****/                             
                                                                                
       SELECT (INNTART);                                                        
          /* ARTO = CHARACTER(10) - GIR TRUNC */                                
          WHEN('1')                                                             
          /* INNTEKTO.ARTO = 'ARBEIDSTAKER ' IEL0892I */                        
             INNTEKTO.ARTO = 'ARBEIDSTAK';                                      
          WHEN('2')                                                             
          /* INNTEKTO.ARTO = 'SELVST NÆR_DR' IEL0892I */                        
             INNTEKTO.ARTO = 'SELVST NÆR';                                      
          WHEN('3')                                                             
          /* INNTEKTO.ARTO = 'BONDE/FI/SKOG' IEL0892I */                        
             INNTEKTO.ARTO = 'BONDE/FI/S';                                      
          WHEN('4')                                                             
             INNTEKTO.ARTO = 'BARN      ';                                      
          WHEN('5')                                                             
             INNTEKTO.ARTO = 'ANDRE     ';                                      
          WHEN('6')                                                             
             INNTEKTO.ARTO = 'ANDRE     ';                                      
          OTHERWISE                                                             
               ;                                                                
       END;      /*****  SELECT (INNTART)    *****/                             
                                                                                
       SELECT (W01_PINT_UT.W02_PI_MERKE);                                       
          WHEN(0)                                                               
             DO;                                                                
                IF RAPPART = 'D' THEN                                           
                   INNTEKTO.MERKEO = 'ANDRE 1Ø';                                
             END;                                                               
          WHEN(1)                                                               
             DO;                                                                
                IF RAPPART = 'D' THEN                                           
                   INNTEKTO.MERKEO = 'SGRGJ 1Ø';                                
                ELSE IF RAPPART = 'B' THEN                                      
                   INNTEKTO.MERKEO = 'NOGRGJ  ';                                
             END;                                                               
          WHEN(2)                                                               
             DO;                                                                
                IF RAPPART = 'D' THEN                                           
                   INNTEKTO.MERKEO = 'RAPP FFU';                                
             END;                                                               
          WHEN(3)                                                               
             DO;                                                                
                IF RAPPART = 'D' THEN                                           
                   INNTEKTO.MERKEO = 'KOMB 1Ø ';                                
             END;                                                               
          WHEN(4)                                                               
             DO;                                                                
                IF RAPPART = 'B' THEN                                           
                   INNTEKTO.MERKEO = 'INNT OMB';                                
             END;                                                               
          WHEN(5)                                                               
             DO;                                                                
                IF RAPPART = 'B' THEN                                           
                   INNTEKTO.MERKEO = 'INNT OMB';                                
             END;                                                               
          WHEN(8)                                                               
             DO;   /* TRUDE 1094 SKJØNNSLIGNET INNTEKT */                       
               INNTEKTO.MERKEO = 'SKJØNN  ';                                    
             END;                                                               
          WHEN(9)                                                               
             INNTEKTO.MERKEO = 'OPPHØRT ';                                      
          OTHERWISE                                                             
             INNTEKTO.MERKEO = 'FEIL: ' !! W01_PINT_UT.W02_PI_MERKE;            
                                                                                
       END ;     /****   SELECT (W01_PINT_UT.W02_PI_MERKE) ****/                
                                                                                
                                                                                
       INNTEKTO.INNTO      =  W01_PINT_UT.W02_PI; /*  * 100;JFA*/               
       PIC_7               =  W01_PINT_UT.W02_PI_RAPPDATO;                      
       INNTEKTO.RAPP_DATOO =  SUBSTR(PIC_7,3,5);                                
       INNTEKTO.KOMMUNEO   =  W01_PINT_UT.W02_PI_KOMMNR;                        
                                                                                
         /* SENDE UT DET SOM SKAL UT BARE EN GANG PR. ÅR  */                    
                                                                                
       IF NESTE_ÅR ^= W01_PINT_UT.W02_PI_ÅR THEN                                
          DO;                                                                   
                                                                                
             /* SETTE INN I HJELPEVARIABLE FOR Å HENTE POENG  */                
                                                                                
             FIXED_DEC9 = B01.PINNTEKT.PI(SØKER_IND,ÅR4); /** 100;*/            
             FIXED_BIN15 = ÅR4;                           /*JFA*/               
             FIXED_DEC3 = 0;                                                    
             INNTEKTO.MAX_UFGO = 0;                                             
             CALL MAX_UFG (ÅR4,FIXED_DEC3,INNTEKTO.MAX_UFGO);                   
                                                                                
             FIXED_DEC5_4 = F_INNTEKT_POENG(FIXED_DEC9,FIXED_BIN15,             
                            GV_TAB_ARRAY.G_V(ÅR4),FIXED_DEC3);                  
                                                                                
             FIXED_DEC5_4 = FIXED_DEC5_4 + 0.005;     /* FORHØYNING */          
             INNTEKTO.P_POENGO   = FIXED_DEC5_4;                                
             INNTEKTO.SUM_INNTO  =                                              
                   B01.PINNTEKT.PI(SØKER_IND,ÅR4); /** 100; JFA*/               
                                                                                
          END;                                                                  
                                                                                
                                                                                
       GJØR_GN          = '0'B;                                                 
       EXEC CICS SEND MAP('INNTEKT') MAPSET('S001043')ACCUM PAGING;             
       GJØR_GN          = '1'B;                                                 
       DETTE_ÅR         =  W01_PINT_UT.W02_PI_ÅR;                               
       W01_PINT_UT      =  W01_PINT_AKT;                                        
       IF (NESTE_ÅR     ^=  DETTE_ÅR ) & NESTE_ÅR ^= 1   THEN                   
          CALL EN_BLANK_LINJE;                                                  
                                                                                
                                                                                
   END ACCUM_INNT;                                                              
                                                                                
                                                                                
                                                                                
   %INCLUDE R0014163;         /*    F_INNTEKT_POENG        */                   
                                                                                
 SLUTT_BYGG_I_F:                                                                
 END BYGG_INNTEKTS_FORH;                                                        
                                                                                
 BYGG_PERSONLIG_INFO:                                                           
   PROC;                                                                        
                                                                                
     CALL LOW_VALUES_TIL_MAP;                                                   
                                                                                
     UTLINJEO.FØRSTEO = 'KODER FOR PENSJONSTYPE1, 2 OG 3' !! (12)'.';           
     UTLINJEO.ANDREO  =                                                         
              B01.STATUS.PENSJONSTYPE1(SØKER_IND) !! (4)' ' !!                  
              B01.STATUS.PENSJONSTYPE2(SØKER_IND) !! (4)' ' !!                  
              B01.STATUS.PENSJONSTYPE3(SØKER_IND);                              
     CALL SEND_UTLINJE;                                                         
                                                                                
     IF B01.ALDERSP. ET(SØKER_IND) > 0 !                                        
        B01.YRKEPENS.ET(SØKER_IND) > 0 !                                        
        B01.UFØRPENS.ET(SØKER_IND) > 0 THEN                                     
       DO;                                                                      
         UTLINJEO.FØRSTEO = 'HAR TILLEGG FOR EKTEFELLE';                        
         CALL SEND_UTLINJE;                                                     
       END;                                                                     
                                                                                
     IF B01.ALDERSP. BT(SØKER_IND) > 0 !                                        
        B01.YRKEPENS.BT(SØKER_IND) > 0 !                                        
        B01.UFØRPENS.BT(SØKER_IND) > 0 THEN                                     
       DO;                                                                      
         UTLINJEO.FØRSTEO = 'HAR TILLEGG FOR BARN' !! (23)'.';                  
         I = B01.STATUS.ANTALL_BARN(SØKER_IND);                                 
         UTLINJEO.ANDREO  = 'ANTALL: ' !! I;                                    
         CALL SEND_UTLINJE;                                                     
       END;                                                                     
                                                                                
     CALL EN_BLANK_LINJE;                                                       
     UTLINJEO.FØRSTEO = 'SIVILSTAND' !! (33)'.';                                
     UTLINJEO.ANDREO  = SELECT_SIVILSTAND(B01.STATUS.                           
                                       SIVILSTAND(SØKER_IND));                  
     CALL SEND_UTLINJE;                                                         
     UTLINJEO.FØRSTEO = 'SPRÅKFORM' !! (34)'.';                                 
     IF B01.RF0PERSN.SPRÅK(SØKER_IND) = 'B' THEN                                
       UTLINJEO.ANDREO  = 'BOKMÅL';                                             
     ELSE IF B01.RF0PERSN.SPRÅK(SØKER_IND) = 'N' THEN                           
       UTLINJEO.ANDREO  = 'NYNORSK';                                            
     ELSE IF B01.RF0PERSN.SPRÅK(SØKER_IND) = 'E' THEN                           
       UTLINJEO.ANDREO  = 'ENGELSK';                                            
     ELSE                                                                       
       UTLINJEO.ANDREO  = 'KOMMUNENS SPRÅKFORM  ' !!                            
                   B01.RF0PERSN.SPRÅK(SØKER_IND);                               
     CALL SEND_UTLINJE;                                                         
                                                                                
     CALL EN_BLANK_LINJE;                                                       
     IF B01.STATUS.FØRSTE_GANG_REG(SØKER_IND) = 'J' THEN                        
       DO;                                                                      
         UTLINJEO.FØRSTEO = 'DETTE ER FØRSTE GANG VEDKOM' !!                    
                            'MENDE ER REG' !! (04)'.';                          
         PIC_10 =                                                               
            KONV_HÅMD_DBMBHÅ((B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND)));            
         UTLINJEO.ANDREO  = 'DATO: ' !! PIC_10;                                 
         CALL SEND_UTLINJE;                                                     
       END;                                                                     
     PIC_3 = B01.SPESOPPL.STATSBORGER(SØKER_IND);                               
     UTLINJEO.FØRSTEO = 'STATSBORGERKODE PR. VIRKNINGSDATO' !!                  
                                           (10)'.';                             
     UTLINJEO.ANDREO  = PIC_3;                                                  
     CALL SEND_UTLINJE;                                                         
     PIC_3 = B01.SPESOPPL.BOSATT(SØKER_IND);                                    
     UTLINJEO.FØRSTEO = 'BOSATTKODE PR. VIRKNINGSDATO' !!                       
                                           (15)'.';                             
     UTLINJEO.ANDREO  = PIC_3;                                                  
     CALL SEND_UTLINJE;                                                         
                                                                                
     CALL EN_BLANK_LINJE;                                                       
     IF B01.UFØRPENS.UFG(SØKER_IND) > 0 THEN                                    
       DO;                                                                      
         PIC_ZZ9 = B01.UFØRPENS.UFG(SØKER_IND);                                 
         UTLINJEO.FØRSTEO = 'UFØREGRAD' !! (34)'.';                             
         UTLINJEO.ANDREO  = PIC_ZZ9;                                            
         CALL SEND_UTLINJE;                                                     
                                                                                
         IF B01.YRKEPENS.YUG(SØKER_IND) > 0 THEN                                
            DO;                                                                 
               PIC_ZZ9 = B01.YRKEPENS.YUG(SØKER_IND);                           
               UTLINJEO.FØRSTEO = 'YRKEGRAD' !! (35)'.';                        
               UTLINJEO.ANDREO = PIC_ZZ9;                                       
               CALL SEND_UTLINJE;                                               
            END;                                                                
       END;                                                                     
                                                                                
     CALL EN_BLANK_LINJE;                                                       
     UTLINJEO.FØRSTEO = 'PENSJONSBREV BLE SIST SKREVET UT ' !!                  
                                           (10)'.';                             
     IF B01.RF0PERSN.SB_DATO_ÅMD(SØKER_IND) > 0 THEN                            
        DO;                                                                     
            PIC_ZZBZZBZZZZ   =                                                  
               KONV_HÅMD_DMHÅ((B01.RF0PERSN.SB_DATO_ÅMD(SØKER_IND)));           
            UTLINJEO.ANDREO  = PIC_ZZBZZBZZZZ;                                  
        END;                                                                    
     ELSE                                                                       
            UTLINJEO.ANDREO  = '             ';                                 
                                                                                
     CALL SEND_UTLINJE;                                                         
                                                                                
     CALL EN_BLANK_LINJE;                                                       
     UTLINJEO.FØRSTEO = 'PENSJONSBREV BLE SIST REGISTRERT AV ' !!               
                                           (06)'.';                             
            UTLINJEO.ANDREO  = '                     ';                         
            /* ROLFS OG HEIDIS IDENTER SKAL KONVERTERES TIL aUTO*/              
     IF (B01.RF0PERSN.BRUKER_ID(SØKER_IND) = 'RSB2970' !                        
         B01.RF0PERSN.BRUKER_ID(SØKER_IND) = 'MLA2970' !                        
         B01.RF0PERSN.BRUKER_ID(SØKER_IND) = 'HAA2970') THEN                    
         UTLINJEO.ANDREO  = 'AUTO';                                             
     ELSE                                                                       
         UTLINJEO.ANDREO  = B01.RF0PERSN.BRUKER_ID(SØKER_IND);                  
     CALL SEND_UTLINJE;                                                         
                                                                                
     SISTE_SIDE = '1'B;                                                         
     GOTO OVERFLOW;                                                             
                                                                                
   SELECT_SIVILSTAND:                                                           
        PROC(SIVILSTAND) RETURNS(CHAR(34) UNAL);                                
          DCL                                                                   
             SIVILSTAND CHAR(1)  UNAL,                                          
             RETUR    CHAR (43)  UNAL VARYING;                                  
      /*     RETUR      CHAR(34) UNAL; */                                       
                                                                                
          SELECT(SIVILSTAND);                                                   
            WHEN('A')                                                           
              DO;                                                               
                 IF B01.STATUS.RED_GP_3_2_5(SØKER_IND)    = 'J' THEN            
                    RETUR =                                                     
                         'ADSKILT   - FTR L.§ 3-2 FEMTE LEDD';                  
                 ELSE                                                           
                   RETUR = 'GIFT - LEVER ADSKILT';                              
              END;                                                              
            WHEN('E')                                                           
              DO;                                                               
                 IF B01.STATUS.RED_GP_3_2_5(SØKER_IND)    = 'J' THEN            
                    RETUR =                                                     
                         'ETTERLATT - FTR L.§ 3-2 FEMTE LEDD';                  
                 ELSE                                                           
                    RETUR = 'ETTERLATT';                                        
             END;                                                               
            WHEN('S')                                                           
              DO;                                                               
                 IF B01.STATUS.RED_GP_3_2_5(SØKER_IND)    = 'J' THEN            
                    RETUR =                                                     
                         'SKILT     - FTR L.§ 3-2 FEMTE LEDD';                  
                 ELSE                                                           
                    RETUR = 'SKILT';                                            
              END;                                                              
            WHEN('U')                                                           
              DO;                                                               
                 IF B01.STATUS.RED_GP_3_2_5(SØKER_IND)    = 'J' THEN            
                    RETUR =                                                     
                         'UGIFT     - FTR L.§ 3-2 FEMTE LEDD';                  
                 ELSE                                                           
                    RETUR = 'UGIFT';                                            
              END;                                                              
                                                                                
            WHEN('G')                                                           
               RETUR = 'GIFT';                                                  
                                                                                
            WHEN('P')                                                           
               RETUR = 'PARTNER';                                               
            WHEN('W')                                                           
              RETUR = 'SAMBOER, FTR.L. § 1-5 ';                                 
            WHEN('V')                                                           
              RETUR = 'SAMBOER, FTR.L. § 3-2 FEMTE LEDD';                       
            OTHERWISE                                                           
              RETUR = 'FEIL SIVILSTANDKODE: ' !! SIVILSTAND;                    
          END;   /*  SELECT(SIVILSTAND)   */                                    
                                                                                
        RETURN(RETUR);                                                          
                                                                                
   END SELECT_SIVILSTAND;                                                       
                                                                                
 END BYGG_PERSONLIG_INFO;                                                       
                                                                                
 /* ----------------------------------------------------------------- */        
 /* BYGG BEREGNINGSGRUNNLAG                                           */        
 /* ----------------------------------------------------------------- */        
 BYGG_BEREGNINGSGRUNNLAG: PROC;                                                 
                                                                                
    IF (SIDE_TELL = 1) THEN                                                     
       BEHANDLE_NESTE_B = 'B010';                                               
                                                                                
    CALL LOW_VALUES_TIL_MAP;                                                    
                                                                                
    /* BRUKES I DE TILFELLER VI FÅR OVERFLOW */                                 
    SELECT (BEHANDLE_NESTE_B) ;                                                 
       WHEN ('B010') GOTO L_B_010;                                              
       WHEN ('B01A') GOTO L_B_01A;                                              
       WHEN ('B01B') GOTO L_B_01B;                                              
       WHEN ('B01C') GOTO L_B_01C;                                              
       WHEN ('B01D') GOTO L_B_01D;                                              
       WHEN ('B01E') GOTO L_B_01E;                                              
       WHEN ('B01F') GOTO L_B_01F;                                              
       WHEN ('B01G') GOTO L_B_01G;                                              
       WHEN ('B01H') GOTO L_B_01H;                                              
       WHEN ('B01I') GOTO L_B_01I;                                              
       WHEN ('B01J') GOTO L_B_01J;                                              
       WHEN ('B01K') GOTO L_B_01K;                                              
       WHEN ('B01L') GOTO L_B_01L;                                              
       WHEN ('B01M') GOTO L_B_01M;                                              
       WHEN ('B01N') GOTO L_B_01N;                                              
       WHEN ('B01O') GOTO L_B_01O;                                              
       WHEN ('B01P') GOTO L_B_01P;                                              
       WHEN ('B01Q') GOTO L_B_01Q;                                              
       WHEN ('B01R') GOTO L_B_01R;                                              
       WHEN ('B01S') GOTO L_B_01S;                                              
       WHEN ('B01T') GOTO L_B_01T;                                              
       WHEN ('B01U') GOTO L_B_01U;                                              
       WHEN ('B01V') GOTO L_B_01V;                                              
       WHEN ('B01W') GOTO L_B_01W;                                              
       WHEN ('B01X') GOTO L_B_01X;                                              
       WHEN ('B01Y') GOTO L_B_01Y;                                              
       WHEN ('B01Z') GOTO L_B_01Z;                                              
       WHEN ('B0AA') GOTO L_B_0AA;                                              
       WHEN ('B020') GOTO L_B_020;                                              
       WHEN ('B02A') GOTO L_B_02A;                                              
       WHEN ('B02B') GOTO L_B_02B;                                              
       WHEN ('B02C') GOTO L_B_02C;                                              
       WHEN ('B030') GOTO L_B_030;                                              
       WHEN ('B040') GOTO L_B_040;                                              
       WHEN ('B050') GOTO L_B_050;                                              
       WHEN ('B05A') GOTO L_B_05A;                                              
       WHEN ('B05B') GOTO L_B_05B;                                              
       WHEN ('B060') GOTO L_B_060;                                              
       WHEN ('B070') GOTO L_B_070;                                              
       WHEN ('B080') GOTO L_B_080;                                              
       WHEN ('B08A') GOTO L_B_08A;                                              
       WHEN ('B08B') GOTO L_B_08B;                                              
       WHEN ('B090') GOTO L_B_090;                                              
       WHEN ('B100') GOTO L_B_100;                                              
       WHEN ('B110') GOTO L_B_110;                                              
       WHEN ('B11A') GOTO L_B_11A;                                              
       WHEN ('B120') GOTO L_B_120;                                              
       WHEN ('B130') GOTO L_B_130;                                              
       WHEN ('B135') GOTO L_B_135;                                              
       WHEN ('B136') GOTO L_B_136; /* ny martin 16.06.03 */                     
       WHEN ('B140') GOTO L_B_140;                                              
       WHEN ('B150') GOTO L_B_150;                                              
       WHEN ('B160') GOTO L_B_160;                                              
       WHEN ('B170') GOTO L_B_170;                                              
       WHEN ('B175') GOTO L_B_175;                                              
       WHEN ('B180') GOTO L_B_180;                                              
       WHEN ('B190') GOTO L_B_190;                                              
       WHEN ('B200') GOTO L_B_200;                                              
       WHEN ('B20A') GOTO L_B_20A;                                              
       WHEN ('B20B') GOTO L_B_20B;                                              
       WHEN ('B20C') GOTO L_B_20C;                                              
       WHEN ('B210') GOTO L_B_210;                                              
       WHEN ('B220') GOTO L_B_220;                                              
       WHEN ('B230') GOTO L_B_230;                                              
       WHEN ('B240') GOTO L_B_240;                                              
       WHEN ('B250') GOTO L_B_250;                                              
       WHEN ('B260') GOTO L_B_260;                                              
       WHEN ('B270') GOTO L_B_270;                                              
       WHEN ('B280') GOTO L_B_280;                                              
       WHEN ('B300') GOTO L_B_300;                                              
       OTHERWISE;                                                               
     END;     /*  SELECT  */                                                    
                                                                                
    /* -------------------------------------------------------------- */        
    /* L_B_010 :                                                      */        
    /* -------------------------------------------------------------- */        
    L_B_010:                                                                    
                                                                                
     BEHANDLE_NESTE_B = 'B01A';                                                 
    /* -------------------------------------------------------------- */        
    /* ENDRING MAI 2000: PENSJONSKONTORET ØNSKER EN OVERSKRIFT SOM    */        
    /*                   FORTELLER HVILKEN YTELSE DETTE GJELDER       */        
    /* MARTIN            IFLG. ANNA RIBE                              */        
    /* -------------------------------------------------------------- */        
    UTLINJEO.ANDREO = (34)' ';                                                  
    SELECT(B01.PENSJONSTYPE1(SØKER_IND));                                       
       WHEN('A')                                                                
          DO;  /* ALDERSPENSJON */                                              
             UTLINJEO.FØRSTEO = 'ALDERSPENSJON';                                
             SELECT(B01.PENSJONSTYPE2(SØKER_IND));                              
                WHEN('E')                                                       
                   DO;  /* MED ETTERLATTERETTIGHETER */                         
                      UTLINJEO.FØRSTEO =                                        
                         'ALDERSPENSJON - MED ETTERLATTERETTIGHETER';           
                   END; /* MED ETTERLATTERETTIGHETER */                         
                WHEN('F')                                                       
                   DO;  /* FORSØRGER EKTEFELLE */                               
                      UTLINJEO.FØRSTEO =                                        
                         'ALDERSPENSJON - FORSØRGER EKTEFELLE';                 
                   END; /* FORSØRGER EKTEFELLE */                               
                WHEN('S')                                                       
                   DO;  /* SAMMENSTØTENDE PENSJON */                            
                      UTLINJEO.FØRSTEO =                                        
                         'ALDERSPENSJON - SAMMENSTØTENDE PENSJON';              
                   END; /* SAMMENSTØTENDE PENSJON */                            
                WHEN('P')                                                       
                  DO;  /* PENSJON - HVILKE REGLER */                            
                    IF B01.EK_INNT_OVER_2G(SØKER_IND) = 'J' THEN                
                      DO;  /* REDUSERT GRUNNA EKTFELLES INNTEKT */              
                        IF B01.SIVILSTAND(SØKER_IND) = 'G' THEN                 
                          DO;                                                   
                            UTLINJEO.FØRSTEO =                                  
                              'ALDERSPENSJON - GIFT';                           
                            UTLINJEO.ANDREO =                                   
                              'REDUSERT PGA EKTEFELLES INNT > 2G';              
                          END;                                                  
                        ELSE                                                    
                        IF B01.SIVILSTAND(SØKER_IND) = 'P' THEN                 
                          DO;                                                   
                            UTLINJEO.FØRSTEO =                                  
                              'ALDERSPENSJON - PARTNER';                        
                            UTLINJEO.ANDREO =                                   
                              'REDUSERT PGA PARTNERS INNT > 2G';                
                          END;                                                  
                        ELSE                                                    
                          DO;                                                   
                            UTLINJEO.FØRSTEO =                                  
                              'ALDERSPENSJON - SAMBOER';                        
                            UTLINJEO.ANDREO =                                   
                              'REDUSERT PGA SAMBOERS INNT > 2G';                
                          END;                                                  
                      END; /* REDUSERT GRUNNA EKTFELLES INNTEKT */              
                   END; /* PENSJON - HVILKE REGLER */                           
                OTHER;                                                          
             END; /* SELECT PENSJONSTYPE2 */                                    
             CALL SEND_UTLINJE;                                                 
          END; /* ALDERSPENSJON */                                              
       WHEN('B')                                                                
          DO;  /* FORELDRELØSE BARN */                                          
             UTLINJEO.FØRSTEO = 'FORELDRELØSE BARN';                            
          END; /* FORELDRELØSE BARN */                                          
       WHEN('D')                                                                
          UTLINJEO.FØRSTEO = 'DØD';                                             
       WHEN('E')                                                                
          DO;  /* ETTERLATTEPENSJON */                                          
             SELECT (B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND));                     
                WHEN(' ','1')                                                   
                   UTLINJEO.FØRSTEO = 'ETTERLATT BEREGNET ETTER '!!             
                                      'NASJONALE REGLER';                       
                WHEN('2','3')                                                   
                   UTLINJEO.FØRSTEO = 'ETTERLATT BEREGNET ETTER '!!             
                                      'EØS REGLER      ';                       
                WHEN('4')                                                       
                   UTLINJEO.FØRSTEO = 'ETTERLATT BEREGNET ETTER '!!             
                                      'NORDISK KONVENSJON';                     
                OTHER                                                           
                   UTLINJEO.FØRSTEO = 'FEIL KODE GUNSTIGSTE_ALT EK';            
             END;                                                               
             IF (B01.DØD_AV_YRKESSKADE(EKTEF_IND) ^= ' ') THEN                  
                UTLINJEO.ANDREO = 'BEREGNET AV YRKESSKADE REGLENE';             
             CALL SEND_UTLINJE;                                                 
          END; /* ETTELATTEPENSJON */                                           
       WHEN('F')                                                                
          DO;                                                                   
             UTLINJEO.FØRSTEO = 'FORSØRGET EKTEFELLE';                          
             CALL SEND_UTLINJE;                                                 
          END;                                                                  
       WHEN('J')                                                                
          UTLINJEO.FØRSTEO = 'FAMILIEPLEIER';                                   
       WHEN('L')                                                                
          UTLINJEO.FØRSTEO = 'FORSØRGET BARN';                                  
       WHEN('N')                                                                
          UTLINJEO.FØRSTEO = 'BARNEPENSJON - EN AV FORELDERENE ER DØD';         
       WHEN('U')                                                                
          DO;  /* UFØREPENSJON */                                               
             UTLINJEO.FØRSTEO = 'UFØREPENSJON';                                 
             UTLINJEO.ANDREO =       '                          ';              
             SELECT(B01.BUP_GAR_KODE(SØKER_IND,1));                             
                WHEN(' ');                                                      
                WHEN('A')                                                       
                   UTLINJEO.ANDREO = 'Ung ufør - venter';                       
                WHEN('B')                                                       
                   UTLINJEO.ANDREO = 'Ung ufør med rett til 3.50';              
                WHEN('C')                                                       
                   UTLINJEO.ANDREO = 'Ung ufør ved 20 år, venter';              
                WHEN('D')                                                       
                   UTLINJEO.ANDREO = 'Ung ufør med rett til 3.50';              
                WHEN('E')                                                       
                   UTLINJEO.ANDREO = 'Ung ufør før 1967';                       
                OTHER;                                                          
             END; /* SELECT BUP-GARANTI-KODE */                                 
             CALL SEND_UTLINJE;                                                 
          END; /* UFØREPENSJON */                                               
       WHEN('Y')                                                                
          UTLINJEO.FØRSTEO = 'YRKESSKADEPENSJON';                               
       WHEN('G')                                                                
          UTLINJEO.FØRSTEO = 'GIFT';                                            
       WHEN('K')                                                                
          DO;  /* HAR AVTALEFESTET PENSJON */                                   
             SELECT(B01.PENSJONSTYPE3(SØKER_IND));                              
                WHEN(' ')                                                       
                  IF B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = ' ' THEN          
                      UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!             
                                      'LO/NHO-ORDNINGEN';                       
                  ELSE                                                          
                        UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!           
                                      'OPPHØRT         ';                       
                WHEN('B')                                                       
                   UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                
                                      'I BANK- OG FINANSN.';                    
                WHEN('K')                                                       
                   UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON '!!                 
                                      'I KOMMUNAL ORDNING';                     
                WHEN('N')                                                       
                   DO;                                                          
                      UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON '!!              
                                         'NAVO-ORDNINGEN';                      
                      UTLINJEO.ANDREO  = 'IKKE RETT TIL AFP-TILLEGG';           
                   END;                                                         
                WHEN('S')                                                       
                   UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                
                                      'I STATLIG ORDNING';                      
                WHEN('V')                                                       
                   UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                
                                      'FRA NAVO-BEDRIFT';                       
                OTHER;                                                          
             END; /* SELECT PENSJONSTYPE3 */                                    
             CALL SEND_UTLINJE;                                                 
                                                                                
             IF B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) >= 20000800 THEN          
                UTLINJEO.FØRSTEO =                                              
                   'PRORATA-BEREGNET';                                          
             ELSE                                                               
             IF B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) >= 19971000 THEN          
                UTLINJEO.FØRSTEO =                                              
                   'ETTER REGLENE FRA 1.10.1997 TIL 31.07.2000 ';               
             ELSE                                                               
                UTLINJEO.FØRSTEO =                                              
                   'ETTER REGLENE FØR 1.10.1997                ';               
                                                                                
             IF B01.BEREGN_ALT_AEY(SØKER_IND) = 'W' THEN                        
                UTLINJEO.ANDREO  = '70% REGELEN ER BENYTTET';                   
             ELSE                                                               
                UTLINJEO.ANDREO  = (34)' ';                                     
             CALL SEND_UTLINJE;                                                 
          END; /* HAR AVTALEFESTET PENSJON */                                   
       OTHER;                                                                   
    END; /* SELECT PENSJONSTYPE1 */                                             
                                                                                
    /* -------------------------------------------------------------- */        
 L_B_01A:                                                                       
     BEHANDLE_NESTE_B = 'B01B';                                                 
    CALL EN_BLANK_LINJE;                                                        
                                                                                
    /* -------------------------------------------------------------- */        
    IF (B01.SPESOPPL.FRAVIK_TRYGDET_3ÅR(SØKER_IND) = 'J') THEN                  
       DO;                                                                      
          UTLINJEO.FØRSTEO = 'FRAVIK TRYGDET' !! (29)'.';                       
          UTLINJEO.ANDREO  = 'DET ER GITT FRAVIK';                              
          CALL SEND_UTLINJE;                                                    
       END;                                                                     
                                                                                
 L_B_01B:                                                                       
     BEHANDLE_NESTE_B = 'B01C';                                                 
    IF B01.SPESOPPL.FRAVIK_BOSATT(SØKER_IND) = 'J' THEN                         
       DO;                                                                      
          UTLINJEO.ANDREO  = 'DET ER GITT FRAVIK';                              
          UTLINJEO.FØRSTEO = 'FRAVIK BOSATT' !! (30)'.';                        
          CALL SEND_UTLINJE;                                                    
       END;                                                                     
                                                                                
 L_B_01C:                                                                       
     BEHANDLE_NESTE_B = 'B01D';                                                 
    IF (B01.STATUS.PENSJONSTYPE1(SØKER_IND) = 'E'  !                            
        B01.STATUS.PENSJONSTYPE2(SØKER_IND) = 'E') THEN                         
       DO;  /* OPPLYSNINGER OM TRYGDETID I STATUS SEGMETET ETTERLATT */         
          /* -------------------------------------------------------- */        
          IF B01.STATUS.SIVILSTAND(SØKER_IND) = 'E' THEN                        
             IF B01.STATUS.SIVILSTAND(EKTEF_IND) = 'G' THEN                     
                UTLINJEO.FØRSTEO = 'DØDSDATO EKTEFELLE' !! (25)'.';             
             ELSE                                                               
             IF B01.STATUS.SIVILSTAND(EKTEF_IND) = 'S' THEN                     
                UTLINJEO.FØRSTEO = 'DØDSDATO FRASKILT EKTEFELLE' !!             
                                   (16)'.';                                     
             ELSE                                                               
                UTLINJEO.FØRSTEO = 'DØDSDATO ' !! (34) '.';                     
          PIC_10 = KONV_HÅMD_DBMBHÅ                                             
                         ((B01.STATUS.DØDSDATO_ÅMD(EKTEF_IND)));                
          UTLINJEO.ANDREO  = PIC_10 !! ' DAG MND ÅR ';                          
          CALL SEND_UTLINJE;                                                    
                                                                                
 L_B_01D:                                                                       
     BEHANDLE_NESTE_B = 'B01E';                                                 
          /* -------------------------------------------------------- */        
          /* SKRIVER FAKTISK TRYGDETID FOR AVDØDE -                   */        
          /* -------------------------------------------------------- */        
          SELECT (B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND));                        
             WHEN(' ','1')                                                      
                UTLINJEO.FØRSTEO =                                              
                   'FAKTISK TRYGDETID AVDØDE'!!(19)'.';                         
             WHEN('2','3','4')                                                  
                UTLINJEO.FØRSTEO =                                              
                   'FAKTISK NORSK TRYGDETID AVDØDE'!!(13)'.';                   
             OTHER;                                                             
          END;                                                                  
          IF (B01.STATUS.TT_16_66(EKTEF_IND) > 0) THEN                          
              PIC_ZZ9 = B01.STATUS.TT_16_66(EKTEF_IND);                         
          ELSE                                                                  
             PIC_ZZ9 = B01.STATUS.TT_FØR_1967(EKTEF_IND) * 12                   
                     + B01.STATUS.TT_ETTER_1966(EKTEF_IND);                     
          PIC_4 = PIC_ZZ9;                                                      
          UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MND';                                 
          CALL SEND_UTLINJE;                                                    
                                                                                
 L_B_01E:                                                                       
     BEHANDLE_NESTE_B = 'B01F';                                                 
          /* -------------------------------------------------------- */        
          /* SKRIVER FRAMTIDIG & ANVENDT TRYGDETID FOR AVDØDE         */        
          /* -------------------------------------------------------- */        
     IF (B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND) = ' ' !                           
         B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND) = '1' !                           
         B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND) = '4' ) THEN                      
         DO;  /* BEREGNES ETTER NASJOANALE/NORDISKE REGLER */                   
            IF B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND)='4' &                       
               B01.TT_NORDISK_FAKT_MND(EKTEF_IND)>0 THEN                        
               DO;      /* NORDISK ART. 13 I BRUK */                            
                  UTLINJEO.FØRSTEO =                                            
                     'BRUTTO FRAMTIDIG TRYGDETID'!!(17)'.';                     
                  PIC_ZZ9 =                                                     
                     B01.TT_NORDISK_FRAMT_BRUTTO(EKTEF_IND);                    
                  UTLINJEO.ANDREO      = PIC_ZZ9 !! ' MND';                     
                  CALL SEND_UTLINJE;                                            
                                                                                
                  UTLINJEO.FØRSTEO =                                            
                     'NETTO FRAMTIDIG TRYGDETID'!!(17)'.';                      
                  PIC_ZZ9 =                                                     
                     B01.TT_NORDISK_FRAMT_NETTO(EKTEF_IND);                     
                  UTLINJEO.ANDREO      = PIC_ZZ9 !! ' MND';                     
                  CALL SEND_UTLINJE;                                            
               END; /* NORDISK ART13 ANVENDES */                                
            ELSE                                                                
               DO;      /* NORDISK ART13 IKKE I BRUK */                         
                  UTLINJEO.FØRSTEO =                                            
                     'FRAMTIDIG TRYGDETID AVDØDE'!!(17)'.';                     
                  PIC_ZZ9 = B01.STATUS.TT_FRAMT(EKTEF_IND);                     
                  UTLINJEO.ANDREO      = PIC_ZZ9 !! ' MND';                     
                  CALL SEND_UTLINJE;                                            
               END; /* NORDISK ART13 IKKE I BRUK */                             
                                                                                
 L_B_01F:                                                                       
     BEHANDLE_NESTE_B = 'B01G';                                                 
            UTLINJEO.FØRSTEO = 'ANVENDT TRYGDETID AVDØDE'!!(19)'.';             
  /*                                    PIC_4 = FAKTISK NORSK TT    */          
            IF B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND)='4' &                       
               B01.TT_NORDISK_FAKT_MND(EKTEF_IND)>0 THEN                        
               PIC_ZZ9 = MIN(480, (PIC_4 +                                      
                                B01.TT_NORDISK_FRAMT_NETTO(EKTEF_IND)));        
            ELSE                                                                
               PIC_ZZ9 = MIN(480, (PIC_4 +                                      
                                       B01.STATUS.TT_FRAMT(EKTEF_IND)));        
                                                                                
            PIC_Z9 = B01.STATUS.TT_ANV(EKTEF_IND);                              
 /*27.5.03  IF (B01.DØD_AV_YRKESSKADE(SØKER_IND) ^= ' ') THEN JFA               
            IF (B01.DØD_AV_YRKESSKADE(SØKER_IND)  = ' ') THEN */                
            IF (B01.DØD_AV_YRKESSKADE(EKTEF_IND) ^= ' ') THEN                   
               UTLINJEO.ANDREO           = PIC_ZZ9 !! ' MND MEN ' !!            
                               PIC_Z9 !! ' ÅR PGA YRKESSKADEN';                 
            ELSE                                                                
            IF (B01.TT_GARANTI(EKTEF_IND) = PIC_Z9) THEN                        
               UTLINJEO.ANDREO           = PIC_ZZ9 !! ' MND MEN ' !!            
                               PIC_Z9 !! ' ÅR PGA GARANTI';                     
            ELSE /* IKKE YS ELLER GARANTI */                                    
               UTLINJEO.ANDREO           = PIC_ZZ9 !! ' MND, DVS. ' !!          
                               PIC_Z9 ;                                         
            CALL SEND_UTLINJE;                                                  
         END;                         /* BEREGNES NORSK ELLER NORDISK */        
       ELSE                                                                     
         IF (B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND) = '2' !                       
             B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND) = '3' ) THEN                  
            DO;        /* BEREGNET ETTER EØS REGLENE */                         
                                                                                
               UTLINJEO.FØRSTEO =                                               
                 'TEORETISK TRYGDETID I EØS OMR. AVD'!!(09)'.';                 
               PIC_ZZ9 = B01.TT_TEORETISK_EØS_MND(EKTEF_IND);                   
               UTLINJEO.ANDREO        = PIC_ZZ9 !! ' MND';                      
               CALL SEND_UTLINJE;                                               
 L_B_01G:                                                                       
     BEHANDLE_NESTE_B = 'B01H';                                                 
                                                                                
               UTLINJEO.FØRSTEO =                                               
                 'TEORETISK FRAMTIDIG TRYGDETID AVD'!!(10)'.';                  
               PIC_ZZ9 = B01.TT_EØS_FRAMT_MND(EKTEF_IND);                       
               UTLINJEO.ANDREO        = PIC_ZZ9 !! ' MND';                      
               CALL SEND_UTLINJE;                                               
 L_B_01H:                                                                       
     BEHANDLE_NESTE_B = 'B01I';                                                 
                                                                                
               UTLINJEO.FØRSTEO =                                               
                 'TEORETISK ANVENDT TRYGDETID AVD'!!(12)'.';                    
               PIC_ZZ9 = B01.TT_EØS_ANV_MND(EKTEF_IND);                         
               PIC_Z9 = B01.TT_EØS_ANV_ÅR(EKTEF_IND);                           
               UTLINJEO.ANDREO        = PIC_ZZ9 !! ' MND DVS. ' !!              
                                  PIC_Z9 !! ' ÅR';                              
               CALL SEND_UTLINJE;                                               
                                                                                
 L_B_01I:                                                                       
     BEHANDLE_NESTE_B = 'B01J';                                                 
               UTLINJEO.FØRSTEO =                                               
                               'PRORATA BRØK TRYGDETID AVDØDE'!!(13)'.';        
               PIC_ZZ9 = PIC_4; /* FAKTISK NORSK TT */                          
               PIC_3 = MIN(PIC_ZZ9  + B01.TT_PRO_RATA_MND(EKTEF_IND)            
                                                               ,480);           
               UTLINJEO.ANDREO        = PIC_ZZ9 !! '/' !! PIC_3;                
               CALL SEND_UTLINJE;                                               
            END; /* BEREGNET ETTER EØS REGLENE */                               
                                                                                
       END; /* OPPLYSNINGER OM TRYGDETID I STATUS SEGMETET ETTERLATT */         
 L_B_01J:                                                                       
     BEHANDLE_NESTE_B = 'B01K';                                                 
                                                                                
         IF (B01.STATUS.TT_16_66(SØKER_IND) = 0) THEN                           
            DO;  /* VI BRUKER TT_16_66 DERSOM DEN ER UTFYLT */                  
               IF B01.STATUS.TT_FØR_1967(SØKER_IND) > 0 THEN                    
                 DO;                                                            
                   PIC_ZZ9 = B01.STATUS.TT_FØR_1967(SØKER_IND);                 
                   UTLINJEO.FØRSTEO = 'TRYGDETID FØR 1967' !! (25)'.';          
                   UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                         
                   CALL SEND_UTLINJE;                                           
                 END;                                                           
 L_B_01K:                                                                       
     BEHANDLE_NESTE_B = 'B01L';                                                 
               IF B01.STATUS.TT_ETTER_1966(SØKER_IND) > 0 THEN                  
                 DO;                                                            
                   PIC_ZZ9 = B01.STATUS.TT_ETTER_1966(SØKER_IND);               
                   UTLINJEO.FØRSTEO = 'FAKTISK TRYGDETID' !! (26)'.';           
                   UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MÅNEDER';                    
                   CALL SEND_UTLINJE;                                           
                 END;                                                           
            END; /* VI BRUKER TT_16_66 DERSOM DEN ER UTFYLT */                  
 L_B_01L:                                                                       
     BEHANDLE_NESTE_B = 'B01M';                                                 
         IF B01.STATUS.TT_67_TIL_70(SØKER_IND) > 0 THEN                         
           DO;                                                                  
             PIC_ZZ9 = B01.STATUS.TT_67_TIL_70(SØKER_IND);                      
             UTLINJEO.FØRSTEO = 'TRYGDETID I ÅRENE ' !!                         
                                '67, 68 OG 69 FYLLES' !! (05)'.';               
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                               
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
 L_B_01M:                                                                       
     BEHANDLE_NESTE_B = 'B01N';                                                 
         IF B01.STATUS.TT_16_66(SØKER_IND) > 0 THEN                             
           DO;                                                                  
             PIC_ZZ9 = B01.STATUS.TT_16_66(SØKER_IND);                          
             UTLINJEO.FØRSTEO = 'TRYGDETID FRA 16 ' !!                          
                                'TIL 66' !! (20)'.';                            
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MÅNEDER';                          
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
 L_B_01N:                                                                       
     BEHANDLE_NESTE_B = 'B01O';                                                 
         IF B01.STATUS.TT_FRAMT(SØKER_IND) > 0 THEN                             
           DO;                                                                  
             PIC_ZZ9 = B01.STATUS.TT_FRAMT(SØKER_IND);                          
             UTLINJEO.FØRSTEO = 'FRAMTIDIG TRYGDETID FOR ' !!                   
                                'UFØR ELLER DØD' !! (05)'.';                    
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' MÅNEDER';                          
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
 L_B_01O:                                                                       
     BEHANDLE_NESTE_B = 'B01P';                                                 
         IF B01.STATUS.TT_ANV(SØKER_IND) > 0 THEN                               
           DO;                                                                  
             PIC_ZZ9 = B01.STATUS.TT_ANV(SØKER_IND);                            
             UTLINJEO.FØRSTEO = 'ANVENDT TRYGDETID ' !!                         
                                'VED BEREGNINGENE' !! (09)'.';                  
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                               
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
 L_B_01P:                                                                       
     BEHANDLE_NESTE_B = 'B01Q';                                                 
         IF B01.STATUS.TT_GARANTI(SØKER_IND) > 0 THEN                           
           DO;                                                                  
             PIC_ZZ9 = B01.STATUS.TT_GARANTI(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'GARANTI TRYGDETID' !! (26)'.';                 
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' ÅR';                               
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
 L_B_01Q:                                                                       
     BEHANDLE_NESTE_B = 'B01R';                                                 
    /* VENTER DBD GENERERING NYE FELT FASE II SPA */                            
        PIC_8 = B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND);                            
                                                                                
         IF B01.STATUS.FRYSKODE (SØKER_IND) = '1'  THEN                         
           DO;                                                                  
             PIC_6      = (B01.STATUS.FRYSDATO_ÅMD(SØKER_IND))/100 ;            
             IF (B01.STATUS.FRYSDATO_ÅMD(SØKER_IND) > 20030101) then            
                IF F_ALDER((B01.FNR(SØKER_IND)),                                
                     B01.STATUS.FRYSDATO_ÅMD(SØKER_IND)) > 6000 THEN            
                   UTLINJEO.FØRSTEO =                                           
                      'FRYSPERIODE TIL 67 ÅR FRA' !! (18)'.';                   
                ELSE                                                            
                   UTLINJEO.FØRSTEO =                                           
                      'FRYSPERIODE 5 ÅR FRA' !! (23)'.';                        
             ELSE                                                               
                UTLINJEO.FØRSTEO =                                              
                  'FRYSPERIODE 3 ÅR FRA' !! (23)'.';                            
                                                                                
             PIC_6Z           = PIC_6;                                          
             UTLINJEO.ANDREO  = PIC_6Z         ;                                
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
         ELSE                                                                   
         IF B01.STATUS.FRYSKODE (SØKER_IND) = '2'  THEN                         
           DO;                                                                  
             PIC_6   =   (B01.STATUS.FRYSDATO_ÅMD(SØKER_IND))/100;              
             UTLINJEO.FØRSTEO = 'ARB.TREN/FORLENGELSE FRA' !! (19)'.';          
             PIC_6Z           = PIC_6;                                          
             UTLINJEO.ANDREO  = PIC_6Z         ;                                
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
                                                                                
         /*****     OPPLYSNINGER OM POENGTALL I ALDERSP - SEG.  *****/          
 L_B_01R:                                                                       
     BEHANDLE_NESTE_B = 'B01S';                                                 
                                                                                
         CALL EN_BLANK_LINJE;                                                   
                                                                                
 L_B_01S:                                                                       
     BEHANDLE_NESTE_B = 'B01T';                                                 
         IF B01.ALDERSP.PÅ(SØKER_IND) > 0 THEN                                  
            DO;  /* HAR OPPTJENT POENGÅR */                                     
               IF (B01.PENSJONSTYPE1(SØKER_IND) = 'K') THEN                     
                 H_TEXT = 'AFP..........';                                      
               ELSE                                                             
                 DO;                                                            
                    /* REMEDY 211 */                                            
                    PIC_8 = B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND);                
                    IF F_ALDER((B01.FNR(SØKER_IND)),PIC_8)>=7000 THEN           
               /*  B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND) > 70) THEN*/             
                         H_TEXT = '70 ÅR........';                              
                    ELSE                                                        
                      H_TEXT = '67 ÅR........';                                 
               END;                                                             
               PIC_Z9 = B01.ALDERSP.PÅ(SØKER_IND);                              
                                                                                
               UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                      
                                      H_TEXT !! (11)'.';                        
               UTLINJEO.ANDREO  = PIC_Z9;                                       
               CALL SEND_UTLINJE;                                               
                                                                                
 L_B_01T:                                                                       
     BEHANDLE_NESTE_B = 'B01U';                                                 
               IF (B01.ALDERSP.PÅ(SØKER_IND) >                                  
                   B01.ALDERSP.PÅ_ETTER91(SØKER_IND)) THEN                      
                   DO;  /* SKRIV POENGÅR MED 45 PROSENT */                      
                      UTLINJEO.FØRSTEO =                                        
                      'POENGÅR MED 45 PROSENT'!!(21)'.';                        
                       PIC_Z9 = B01.ALDERSP.PÅ(SØKER_IND)                       
                              - B01.ALDERSP.PÅ_ETTER91(SØKER_IND);              
                       UTLINJEO.ANDREO   = PIC_Z9;                              
                       CALL SEND_UTLINJE;                                       
                   END; /* SKRIV POENGÅR MED 45 PROSENT */                      
 L_B_01U:                                                                       
     BEHANDLE_NESTE_B = 'B01V';                                                 
                                                                                
               IF (B01.ALDERSP.PÅ_ETTER91(SØKER_IND)) THEN                      
                   DO;  /* SKRIV POENGÅR MED 42 PROSENT */                      
                      UTLINJEO.FØRSTEO =                                        
                        'POENGÅR MED 42 PROSENT'!!(21)'.';                      
                      PIC_Z9 = B01.ALDERSP.PÅ_ETTER91(SØKER_IND);               
                      UTLINJEO.ANDREO   = PIC_Z9;                               
                      CALL SEND_UTLINJE;                                        
                   END; /* SKRIV POENGÅR MED 42 PROSENT */                      
                                                                                
           END; /* SKRIVES KUN DERSOM DET ER POENGÅR */                         
                                                                                
 L_B_01V:                                                                       
     BEHANDLE_NESTE_B = 'B01W';                                                 
         IF B01.ALDERSP.OPT(SØKER_IND) > 0 THEN                                 
            DO;  /* SKRIVER EVT. OVERKOMPENSASJON */                            
               PIC_9V99 = B01.ALDERSP.OPT(SØKER_IND);                           
               UTLINJEO.FØRSTEO =                                               
                 'SLUTTPOENGTALL M/OVERKOMP VED ' !! H_TEXT ;                   
               UTLINJEO.ANDREO  = PIC_9V99;                                     
               CALL SEND_UTLINJE;                                               
            END; /* SKRIVER EVT. OVERKOMPENSASJON */                            
                                                                                
 L_B_01W:                                                                       
     BEHANDLE_NESTE_B = 'B01X';                                                 
         IF B01.ALDERSP.SPT(SØKER_IND) > 0 THEN                                 
            DO;  /* SKRIVER EVT. SLUTTPOENGTALL   */                            
               PIC_9V99 = B01.ALDERSP.SPT(SØKER_IND)                            
                         - B01.ALDERSP.OPT(SØKER_IND);                          
               UTLINJEO.FØRSTEO =                                               
                'SLUTTPOENGTALL U/OVERKOMP VED ' !! H_TEXT ;                    
               UTLINJEO.ANDREO  = PIC_9V99;                                     
               CALL SEND_UTLINJE;                                               
            END; /* SKRIVER EVT. SLUTTPOENGTALL   */                            
                                                                                
 L_B_01X:                                                                       
     BEHANDLE_NESTE_B = 'B01Y';                                                 
         IF (B01.ALDERSP.AFP_BUP(SØKER_IND) > 0) THEN                           
             DO;  /* SKRIVER EVT. BEREGNET BUP */                               
                CALL EN_BLANK_LINJE;                                            
                PIC_9V99 = B01.ALDERSP.AFP_BUP(SØKER_IND);                      
                UTLINJEO.FØRSTEO =                                              
                   'FRAMTIDIG POENGTALL VED ' !! H_TEXT !! (6)'.';              
                UTLINJEO.ANDREO  = PIC_9V99;                                    
                CALL SEND_UTLINJE;                                              
             END; /* SKRIVER EVT. BEREGNET BUP */                               
                                                                                
     PIC_8 = B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND);                               
     PIC_6 = F_ALDER((B01.FNR(SØKER_IND)),PIC_8);                               
 L_B_01Y:                                                                       
     BEHANDLE_NESTE_B = 'B01Z';                                                 
         IF B01.ALDERSP.VT_PÅ(SØKER_IND) > 0 THEN                               
           DO;                                                                  
             PIC_ZZ9 = B01.ALDERSP.VT_PÅ(SØKER_IND);                            
             UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                        
                                '67 ÅR      ' !! (13)'.';                       
             UTLINJEO.ANDREO  = PIC_ZZ9;                                        
             IF PIC_6 >= 7000 THEN                                              
                CALL SEND_UTLINJE;                                              
           END;                                                                 
 L_B_01Z:                                                                       
     BEHANDLE_NESTE_B = 'B0AA';                                                 
         IF B01.ALDERSP.VT_OPT(SØKER_IND) > 0 THEN                              
           DO;                                                                  
             PIC_9V99 = B01.ALDERSP.VT_OPT(SØKER_IND);                          
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL M/OVERKOMP VED ' !!             
                                '67 ÅRS-DATO..';                                
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             IF PIC_6 >= 7000 THEN                                              
                CALL SEND_UTLINJE;                                              
           END;                                                                 
 L_B_0AA:                                                                       
     BEHANDLE_NESTE_B = 'B020';                                                 
         IF B01.ALDERSP.VT_SPT(SØKER_IND) > 0 THEN                              
           DO;                                                                  
             PIC_9V99 = B01.ALDERSP.VT_SPT(SØKER_IND)                           
                      - B01.ALDERSP.VT_OPT(SØKER_IND);                          
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL U/OVERKOMP VED ' !!             
                                '67 ÅRS-DATO..';                                
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             IF PIC_6 >= 7000 THEN                                              
                CALL SEND_UTLINJE;                                              
           END;                                                                 
                                                                                
         /*****     OPPLYSNINGER OM POENGTALL I UFØRPENS - SEG.  *****/         
                                                                                
   L_B_020:                                                                     
         BEHANDLE_NESTE_B = 'B02A';                                             
         IF B01.INNTEKT_FØR_UP(SØKER_IND) > 0 THEN                              
           DO;                                                                  
             PIC_ZZZZZZZZ9   = B01.INNTEKT_FØR_UP(SØKER_IND) * 100;             
             UTLINJEO.FØRSTEO = 'INNTEKTSNIVÅ FØR' !!                           
                                ' UFØRHET'!! (19)'.';                           
             UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9;                                  
             CALL SEND_UTLINJE;                                                 
             CALL EN_BLANK_LINJE; /* +++ ?? +++ */                              
           END;                                                                 
                                                                                
                                                                                
   L_B_02A:                                                                     
         BEHANDLE_NESTE_B = 'B02B';                                             
        IF B01.UFØRPENS.PÅ(SØKER_IND) > 0 THEN                                  
           DO;         /* HAR OPPTJENT POENGÅR */                               
                                                                                
              PIC_Z9 = B01.UFØRPENS.PÅ(SØKER_IND);                              
                                                                                
              UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                       
                                'UFØRPENSJON ' !! (12)'.';                      
              UTLINJEO.ANDREO         = PIC_Z9;                                 
              CALL SEND_UTLINJE;                                                
   L_B_02B:                                                                     
         BEHANDLE_NESTE_B = 'B02C';                                             
                                                                                
              IF (B01.UFØRPENS.PÅ(SØKER_IND) >                                  
                  B01.UFØRPENS.PÅ_ETTER91(SØKER_IND)) THEN                      
                 DO;         /* SKRIV POENGÅR MED 45 PROSENT */                 
                    UTLINJEO.FØRSTEO =                                          
                       'POENGÅR MED 45 PROSENT'!!(21)'.';                       
                    PIC_Z9 = B01.UFØRPENS.PÅ(SØKER_IND)                         
                           - B01.UFØRPENS.PÅ_ETTER91(SØKER_IND);                
                    UTLINJEO.ANDREO          = PIC_Z9;                          
                    CALL SEND_UTLINJE;                                          
                 END; /* SKRIV POENGÅR MED 45 PROSENT */                        
   L_B_02C:                                                                     
         BEHANDLE_NESTE_B = 'B030';                                             
                                                                                
              IF (B01.UFØRPENS.PÅ_ETTER91(SØKER_IND)) THEN                      
                 DO;         /* SKRIV POENGÅR MED 42 PROSENT */                 
                    UTLINJEO.FØRSTEO =                                          
                       'POENGÅR MED 42 PROSENT'!!(21)'.';                       
                    PIC_Z9 = B01.UFØRPENS.PÅ_ETTER91(SØKER_IND);                
                    UTLINJEO.ANDREO          = PIC_Z9;                          
                    CALL SEND_UTLINJE;                                          
                 END; /* SKRIV POENGÅR MED 42 PROSENT */                        
                                                                                
           END; /* SKRIVES KUN DERSOM DET ER POENGÅR */                         
                                                                                
   L_B_030:                                                                     
         BEHANDLE_NESTE_B = 'B040';                                             
         IF B01.UFØRPENS.OPT(SØKER_IND) > 0 THEN                                
           DO;                                                                  
             PIC_9V99 = B01.UFØRPENS.OPT(SØKER_IND);                            
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL M/OVERKOMP VED ' !!             
                                'UFØREPENSJON';                                 
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
   L_B_040:                                                                     
         BEHANDLE_NESTE_B = 'B050';                                             
         IF B01.UFØRPENS.SPT(SØKER_IND) > 0 THEN                                
           DO;                                                                  
             PIC_9V99 = B01.UFØRPENS.SPT(SØKER_IND)                             
                      - B01.UFØRPENS.OPT(SØKER_IND);                            
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL U/OVERKOMP VED ' !!             
                                'UFØREPENSJON';                                 
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
         /*****     OPPLYSNINGER OM POENGTALL I YRKEPENS - SEG.  *****/         
                                                                                
   L_B_050:                                                                     
         BEHANDLE_NESTE_B = 'B05A';                                             
                                                                                
        IF B01.YRKEPENS.PÅ(SØKER_IND) > 0 THEN                                  
           DO;         /* HAR OPPTJENT POENGÅR */                               
                                                                                
              PIC_Z9 = B01.YRKEPENS.PÅ(SØKER_IND);                              
                                                                                
              UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                       
                 'YRKESSKADEPENSJON' !! (07)'.';                                
              UTLINJEO.ANDREO = PIC_Z9;                                         
              CALL SEND_UTLINJE;                                                
   L_B_05A:                                                                     
         BEHANDLE_NESTE_B = 'B05B';                                             
                                                                                
              IF (B01.YRKEPENS.PÅ(SØKER_IND) >                                  
                  B01.YRKEPENS.PÅ_ETTER91(SØKER_IND)) THEN                      
                 DO;         /* SKRIV POENGÅR MED 45 PROSENT */                 
                    UTLINJEO.FØRSTEO =                                          
                       'POENGÅR MED 45 PROSENT'!!(21)'.';                       
                    PIC_Z9 = B01.YRKEPENS.PÅ(SØKER_IND)                         
                           - B01.YRKEPENS.PÅ_ETTER91(SØKER_IND);                
                    UTLINJEO.ANDREO          = PIC_Z9;                          
                    CALL SEND_UTLINJE;                                          
                 END; /* SKRIV POENGÅR MED 45 PROSENT */                        
   L_B_05B:                                                                     
         BEHANDLE_NESTE_B = 'B060';                                             
                                                                                
              IF (B01.YRKEPENS.PÅ_ETTER91(SØKER_IND)) THEN                      
                 DO;         /* SKRIV POENGÅR MED 42 PROSENT */                 
                    UTLINJEO.FØRSTEO =                                          
                       'POENGÅR MED 42 PROSENT'!!(21)'.';                       
                    PIC_Z9 = B01.YRKEPENS.PÅ_ETTER91(SØKER_IND);                
                    UTLINJEO.ANDREO          = PIC_Z9;                          
                    CALL SEND_UTLINJE;                                          
                 END; /* SKRIV POENGÅR MED 42 PROSENT */                        
                                                                                
           END; /* SKRIVES KUN DERSOM DET ER POENGÅR */                         
                                                                                
   L_B_060:                                                                     
         BEHANDLE_NESTE_B = 'B070';                                             
         IF B01.YRKEPENS.SPT(SØKER_IND) > 0 THEN                                
           DO;                                                                  
             PIC_9V99 = B01.YRKEPENS.SPT(SØKER_IND);                            
             UTLINJEO.FØRSTEO = 'SLUTTPOENGTALL VED ' !!                        
                                'YRKEPENSJON' !! (12)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
   L_B_070:                                                                     
         BEHANDLE_NESTE_B = 'B080';                                             
         IF B01.YRKEPENS.YPT(SØKER_IND) > 0 THEN                                
           DO;                                                                  
             PIC_9V99 = B01.YRKEPENS.YPT(SØKER_IND);                            
             UTLINJEO.FØRSTEO = 'YRKE-POENGTALL VED ' !!                        
                                'YRKEPENSJON' !! (13)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
         /*****     OPPLYSNINGER OM POENGTALL I ETTEPENS - SEG.  *****/         
                                                                                
   L_B_080:                                                                     
         BEHANDLE_NESTE_B = 'B08A';                                             
                                                                                
        IF B01.ETTEPENS.PÅ_AVD(SØKER_IND) > 0 THEN                              
           DO;         /* HAR OPPTJENT POENGÅR */                               
                                                                                
              PIC_Z9 = B01.ETTEPENS.PÅ_AVD(SØKER_IND);                          
                                                                                
              UTLINJEO.FØRSTEO = 'ANTALL POENGÅR VED ' !!                       
                 'GJENLEVENDEPENSJON' !! (06)'.';                               
              UTLINJEO.ANDREO = PIC_Z9;                                         
              CALL SEND_UTLINJE;                                                
           END;                                                                 
   L_B_08A:                                                                     
         BEHANDLE_NESTE_B = 'B08B';                                             
        IF B01.ETTEPENS.PÅ_AVD(SØKER_IND) > 0 THEN                              
           DO;         /* HAR OPPTJENT POENGÅR */                               
              IF (B01.ETTEPENS.PÅ_AVD(SØKER_IND) >                              
                  B01.ETTEPENS.PÅ_ETTER91(SØKER_IND)) THEN                      
                 DO;         /* SKRIV POENGÅR MED 45 PROSENT */                 
                    UTLINJEO.FØRSTEO =                                          
                      'AVDØDES POENGÅR MED 45 PROSENT'!!(13)'.';                
                    PIC_Z9 = B01.ETTEPENS.PÅ_AVD(SØKER_IND)                     
                           - B01.ETTEPENS.PÅ_ETTER91(SØKER_IND);                
                    UTLINJEO.ANDREO          = PIC_Z9;                          
                    CALL SEND_UTLINJE;                                          
                 END; /* SKRIV POENGÅR MED 45 PROSENT */                        
           END;                                                                 
   L_B_08B:                                                                     
         BEHANDLE_NESTE_B = 'B090';                                             
                                                                                
        IF B01.ETTEPENS.PÅ_AVD(SØKER_IND) > 0 THEN                              
           DO;         /* HAR OPPTJENT POENGÅR */                               
              IF (B01.ETTEPENS.PÅ_ETTER91(SØKER_IND)) THEN                      
                 DO;         /* SKRIV POENGÅR MED 42 PROSENT */                 
                    UTLINJEO.FØRSTEO =                                          
                       'AVDØDES POENGÅR MED 42 PROSENT'!!(13)'.';               
                    PIC_Z9 = B01.ETTEPENS.PÅ_ETTER91(SØKER_IND);                
                    UTLINJEO.ANDREO          = PIC_Z9;                          
                    CALL SEND_UTLINJE;                                          
                 END; /* SKRIV POENGÅR MED 42 PROSENT */                        
                                                                                
           END; /* SKRIVES KUN DERSOM DET ER POENGÅR */                         
                                                                                
   L_B_090:                                                                     
         BEHANDLE_NESTE_B = 'B100';                                             
         IF B01.ETTEPENS.OPT_AVD(SØKER_IND) > 0 THEN                            
           DO;                                                                  
             PIC_9V99 = B01.ETTEPENS.OPT_AVD(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'AVDØDES SLUTTPOENGTALL M/OVERKOMP' !!          
                                                 (10)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
   L_B_100:                                                                     
         BEHANDLE_NESTE_B = 'B110';                                             
         IF B01.ETTEPENS.SPT_AVD(SØKER_IND) > 0 THEN                            
           DO;                                                                  
             PIC_9V99 = B01.ETTEPENS.SPT_AVD(SØKER_IND)                         
                      - B01.ETTEPENS.OPT_AVD(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'AVDØDES SLUTTPOENGTALL U/OVERKOMP' !!          
                                                 (10)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
   /* MARTIN REMEDY 168 */                                                      
   IF (B01.DØD_AV_YRKESSKADE(SØKER_IND) = 'E' !                                 
       B01.DØD_AV_YRKESSKADE(SØKER_IND) = 'Y' ) THEN                            
      DO;  /* ENDRINGER IFBM REMEDY 168 */                                      
         IF (B01.YRKEPENS.YUG(EKTEF_IND) > 0) THEN                              
            DO;                                                                 
               CALL EN_BLANK_LINJE;                                             
                                                                                
               UTLINJEO.FØRSTEO = 'AVDØDES YRKESGRAD'!!(26)'.';                 
               PIC_999          = B01.YRKEPENS.YUG(EKTEF_IND);                  
               UTLINJEO.ANDREO  = PIC_999;                                      
               CALL SEND_UTLINJE;                                               
            END;                                                                
         IF (B01.YRKEPENS.GARANTI_YRKEGRAD(EKTEF_IND) > 0) THEN                 
            DO;                                                                 
               UTLINJEO.FØRSTEO = 'AVDØDES GARANTERTE YRKESGRAD';               
               PIC_999          = B01.GARANTI_YRKEGRAD(EKTEF_IND);              
               UTLINJEO.ANDREO  = PIC_999;                                      
               CALL SEND_UTLINJE;                                               
            END;                                                                
         IF (B01.YRKEPENS.YPT(EKTEF_IND) > 0) THEN                              
            DO;                                                                 
               UTLINJEO.FØRSTEO = 'AVDØDES GUNSTIGSTE SLUTTPOENGTALL'!!         
                                  (10)'.';                                      
               PIC_9V99         = B01.YRKEPENS.YPT(EKTEF_IND);                  
               SELECT(B01.YRKEPENS.YPT_KODE(EKTEF_IND));                        
                  WHEN('A') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' ETTER ANTATT ÅRLIG INNTEKT';                      
                  WHEN('Y') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' ETTER YRKESSKADEREGLENE   ';                      
                  WHEN('V') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' ETTER VANLIGE REGLER      ';                      
                  WHEN('U') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' ETTER UFØREREGLENE        ';                      
                  OTHER                                                         
                       UTLINJEO.ANDREO  = PIC_9V99;                             
               END;                                                             
               CALL SEND_UTLINJE;                                               
            END;                                                                
         IF (B01.YRKEPENS.PÅ(EKTEF_IND) > 0) THEN                               
            DO;                                                                 
               UTLINJEO.FØRSTEO = 'AVDØDES POENGÅR VED YRKESSKADE,'!!           
                                  ' 45%........';                               
               PIC_Z9           = B01.YRKEPENS.PÅ(EKTEF_IND)                    
                                - B01.YRKEPENS.PÅ_ETTER91(EKTEF_IND);           
               UTLINJEO.ANDREO  = PIC_Z9;                                       
               CALL SEND_UTLINJE;                                               
            END;                                                                
         IF (B01.YRKEPENS.PÅ_ETTER91(EKTEF_IND) > 0) THEN                       
            DO;                                                                 
               UTLINJEO.FØRSTEO = 'AVDØDES POENGÅR VED YRKESSKADE,'!!           
                                  ' 42%........';                               
               PIC_Z9           = B01.YRKEPENS.PÅ_ETTER91(EKTEF_IND);           
               UTLINJEO.ANDREO  = PIC_Z9;                                       
               CALL SEND_UTLINJE;                                               
            END;                                                                
         IF (B01.YRKEPENS.SPT(EKTEF_IND) > 0) THEN                              
            DO;                                                                 
               UTLINJEO.FØRSTEO = 'AVDØDES SLUTTPOENGTALL';                     
               PIC_9V99         = B01.YRKEPENS.SPT(EKTEF_IND);                  
               SELECT(B01.YRKEPENS.YPT_KODE(EKTEF_IND));                        
                  WHEN('A') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' etter antatt årlig inntekt';                      
                  WHEN('Y') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' etter yrkesskadereglene   ';                      
                  WHEN('V') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' etter vanlige regler      ';                      
                  WHEN('U') UTLINJEO.ANDREO  = PIC_9V99 !!                      
                            ' etter uførereglene        ';                      
                  OTHER;                                                        
               END;                                                             
               CALL SEND_UTLINJE;                                               
            END;                                                                
      END; /* ENDRINGER IFBM REMEDY 168 */                                      
                                                                                
   /* MARTIN REMEDY 168 */                                                      
         /*****     DIVERSE ANDRE OPPLYSNINGER    *********/                    
   L_B_110:                                                                     
         BEHANDLE_NESTE_B = 'B11A';                                             
         CALL EN_BLANK_LINJE;                                                   
         HAR_OPPL = '0'B;                                                       
   L_B_11A:                                                                     
         BEHANDLE_NESTE_B = 'B120';                                             
   /*   dette endring er ikke lagt i system. må vi diskuterer med               
        system-eier                                                             
         IF B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) > 19920000 &                  
            B01.ALDERSP.APD(SØKER_IND) = 0                      THEN            
              B01.ALDERSP.APD(SØKER_IND) = 100 ;                                
    */                                                                          
         IF B01.ALDERSP.APD(SØKER_IND) > 0 THEN                                 
           DO;                                                                  
             HAR_OPPL = '1'B;                                                   
             PIC_ZZ9 = B01.ALDERSP.APD(SØKER_IND);                              
             IF B01.PENSJONSTYPE1(SØKER_IND)  = 'K' THEN                        
               DO;                                                              
                  UTLINJEO.FØRSTEO = 'GRAD AV FULL AFP-' !!                     
                                     'PENSJON SOM TAS UT' !! (08)'.';           
                  UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                     
               END;                                                             
             ELSE                                                               
               DO;                                                              
                  UTLINJEO.FØRSTEO = 'GRAD AV FULL ALDERS' !!                   
                                     'PENSJON SOM TAS UT' !! (06)'.';           
                  UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                     
               END;                                                             
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
   L_B_120:                                                                     
         BEHANDLE_NESTE_B = 'B130';                                             
         IF B01.ALDERSP.KONV_GRAD(SØKER_IND) > 0 THEN                           
           DO;                                                                  
             HAR_OPPL = '1'B;                                                   
             PIC_ZZ9 = B01.ALDERSP.KONV_GRAD(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'KONVERTERINGSGRAD.  AP ' !!                    
                                'VED OVERG. FRA UP/EP';                         
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                          
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
   L_B_130:                                                                     
         BEHANDLE_NESTE_B = 'B135';                                             
         IF B01.ALDERSP.VENTEFAKTOR(SØKER_IND) > 0 THEN                         
           DO;                                                                  
             HAR_OPPL = '1'B;                                                   
             PIC_ZZ9V99 = B01.ALDERSP.VENTEFAKTOR(SØKER_IND);                   
             UTLINJEO.FØRSTEO = 'VENTEFAKTOR SOM ANGIR ' !!                     
                                'TILLEGG I ALDERS-P...';                        
             UTLINJEO.ANDREO  = PIC_ZZ9V99 !! ' PROSENT';                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_135:                                                                     
         BEHANDLE_NESTE_B = 'B136';                                             
         IF B01.UFØRPENS.GARANTIGRAD(SØKER_IND) > 0 THEN                        
           DO;                                                                  
             HAR_OPPL = '1'B;                                                   
             PIC_ZZ9 = B01.UFØRPENS.GARANTIGRAD(SØKER_IND);                     
             UTLINJEO.FØRSTEO = 'GARANTI UFØREGRAD' !! (26)'.';                 
                                                                                
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                          
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_136:                                                                     
         BEHANDLE_NESTE_B = 'B140';                                             
         IF HAR_OPPL THEN                                                       
            DO;                                                                 
               CALL EN_BLANK_LINJE;                                             
            END;                                                                
   L_B_140:                                                                     
         BEHANDLE_NESTE_B = 'B150';                                             
         IF B01.UFØRPENS.UFG(SØKER_IND) > 0 THEN                                
           DO;                                                                  
             PIC_ZZ9 = B01.UFØRPENS.UFG(SØKER_IND);                             
             UTLINJEO.FØRSTEO = 'GJELDENDE UFØREGRAD' !! (24)'.';               
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                          
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_150:                                                                     
         BEHANDLE_NESTE_B = 'B160';                                             
         IF B01.YRKEPENS.YUG(SØKER_IND) > 0 THEN                                
           DO;                                                                  
             PIC_ZZ9 = B01.YRKEPENS.YUG(SØKER_IND);                             
             UTLINJEO.FØRSTEO = 'GJELDENDE YRKEGRAD' !! (25)'.';                
             UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                          
             CALL SEND_UTLINJE;                                                 
             CALL EN_BLANK_LINJE;                                               
           END;                                                                 
                                                                                
   L_B_160:                                                                     
     /*  BEHANDLE_NESTE_B = 'B170'; */                                          
     /*  index1--------------------------   */                                  
         DO INDEX_1 = UP_START1 TO HBOUND(B01.UFØRHIST,2)                       
            WHILE(B01.UFØRHIST.UFT_ÅMD(SØKER_IND,INDEX_1) > 0);                 
                                                                                
            UP_START1 = INDEX_1;                                                
            LOOP_KODE = 'J';                                                    
            PIC_8 =     B01.UFØRHIST.UFT_ÅMD (SØKER_IND,INDEX_1) ;              
                                                                                
            IF LINJE_KODE < 1 THEN                                              
              CALL PERIODE ('UFØRE-PERIODE', PIC_8,                             
              B01.UFØRHIST.UFG    (SØKER_IND,INDEX_1));                         
                                                                                
                                                                                
            PIC_9V99 = B01.UFØRHIST.BUP(SØKER_IND,INDEX_1);                     
            UTLINJEO.FØRSTEO =                                                  
            '    FREMTIDIG PENSJONSPOENGTALL............';                      
            UTLINJEO.ANDREO  = PIC_9V99 !! (7)' ' ;                             
            IF LINJE_KODE < 2 THEN                                              
            CALL SEND_UTLINJE;                                                  
                                                                                
            UTLINJEO.FØRSTEO =                                                  
                          '    UFØREKRITERIER.........................';        
            PIC_1 = B01.UFØRHIST.UFKRITERIER(SØKER_IND,INDEX_1);                
                                                                                
            IF LINJE_KODE < 3 THEN                                              
               DO;  /* LINJE_KODE < 3 */                                        
                 IF PIC_1 = 0 THEN                                              
                    DO;                                                         
                       UTLINJEO.ANDREO  =                                       
                                    '                                 ';        
                       CALL SEND_UTLINJE;                                       
                    END;                                                        
               ELSE                                                             
                  IF PIC_1 = 1 THEN                                             
                    DO;                                                         
                       UTLINJEO.ANDREO  =                                       
                                    'INNTEKT >= G ETTER1966(GML§19-6B)';        
                       CALL SEND_UTLINJE;                                       
                    END;                                                        
               ELSE                                                             
                  IF PIC_1 = 2 THEN                                             
                     DO;                                                        
                        UTLINJEO.ANDREO  =                                      
                                     'INNTEKT >= G VED UFØRHET(§3-17A)';        
                        CALL SEND_UTLINJE;                                      
                     END;                                                       
               ELSE                                                             
                  IF PIC_1 = 3 THEN                                             
                     DO;                                                        
                       UTLINJEO.ANDREO  =                                       
                                     'INNTEKT >= G VED UFØRHET(§3-17A)';        
                        CALL SEND_UTLINJE;                                      
                        UTLINJEO.FØRSTEO = (43)' ';                             
                        UTLINJEO.ANDREO  =                                      
                                    'OG ETTER 1966(§GML19-6B).        ';        
                        CALL SEND_UTLINJE;                                      
                     END;                                                       
                ELSE                                                            
                   IF PIC_1 = 4 THEN                                            
                      DO;                                                       
                        UTLINJEO.ANDREO  =                                      
                                    'LØPENDE UFØREPENSJON VED YRKE.  ';         
                        CALL SEND_UTLINJE;                                      
                      END;                                                      
                ELSE                                                            
                   IF PIC_1 = 5 THEN                                            
                      DO;                                                       
                         UTLINJEO.ANDREO  =                                     
                                    'ENGANGSUTLØST UFØREPENSJON  VED ';         
                         CALL SEND_UTLINJE;                                     
                         UTLINJEO.FØRSTEO = (43)' ';                            
                         UTLINJEO.ANDREO  =                                     
                                    'YRKESSKADE.                      ';        
                         CALL SEND_UTLINJE;                                     
                      END;                                                      
               ELSE                                                             
                   IF PIC_1 = 6 THEN                                            
                      DO;                                                       
                         UTLINJEO.ANDREO  =                                     
                                     'AFP                             ';        
                        CALL SEND_UTLINJE;                                      
                      END;                                                      
                END;    /* LINJE_KODE < 3                     */                
                                                                                
                                                                                
            PIC_Z9 = B01.REDUSERT_ANT_BUP_ÅR(SØKER_IND,INDEX_1);                
            UTLINJEO.FØRSTEO =                                                  
            '    ANTALL FREMTIDIGE POENGÅR §3-6.3.......';                      
            UTLINJEO.ANDREO  = PIC_Z9;                                          
            IF LINJE_KODE < 5 THEN                                              
               CALL SEND_UTLINJE;                                               
                                                                                
                                                                                
            PIC_9V99 = B01.UFØRHIST.BUP_GARANTI(SØKER_IND,INDEX_1);             
            UTLINJEO.FØRSTEO =                                                  
            '    POENGGARANTI UNG UFØR..................';                      
            UTLINJEO.ANDREO  = PIC_9V99    ;                                    
            IF LINJE_KODE < 6 THEN                                              
               CALL SEND_UTLINJE;                                               
                                                                                
                                                                                
            CHAR_1   = B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,INDEX_1);            
            UTLINJEO.FØRSTEO =                                                  
            '    POENG GARANTI KODE.....................';                      
            IF LINJE_KODE < 7 THEN                                              
              DO;  /* LINJE_KODE < 7 */                                         
              IF CHAR_1 = 'A'  THEN                                             
                 DO;                                                            
                  UTLINJEO.ANDREO  = 'UNG UFØR, VENTER PÅ 3.50        ';        
                  CALL SEND_UTLINJE;                                            
                 END;                                                           
              ELSE                                                              
              IF CHAR_1 = 'B'  THEN                                             
                 DO;                                                            
                  UTLINJEO.ANDREO  = 'UNG UFØR MED RETT TIL 3.50      ';        
                  CALL SEND_UTLINJE;                                            
                 END;                                                           
              ELSE                                                              
         /*   IF CHAR_1 = 'C'  THEN                                             
                 DO;                                                            
                  UTLINJEO.ANDREO  = 'UNG UFØR MED 20ÅR, VENTER. DENNE';        
                  CALL SEND_UTLINJE;                                            
                  UTLINJEO.FØRSTEO = (43)' ';                                   
                 UTLINJEO.ANDREO  = 'GÅR UT.                          ';        
                 CALL SEND_UTLINJE;                                             
                 END;                                                           
              ELSE                                                              
              IF CHAR_1 = 'D'  THEN                                             
               DO;                                                              
                  UTLINJEO.ANDREO  = 'UNG UFØR MED RETT TIL 3.50 FRA  ';        
                  CALL SEND_UTLINJE;                                            
                  UTLINJEO.FØRSTEO = (43)' ';                                   
                 UTLINJEO.ANDREO  = '0592. DENNE GÅR UT               ';        
                 CALL SEND_UTLINJE;                                             
               END;                                                             
              ELSE                     */                                       
              IF CHAR_1 = 'E'  THEN                                             
                 DO;                                                            
                  UTLINJEO.ANDREO  = 'UNG UFØR FØR 1967 §3-22         ';        
                  CALL SEND_UTLINJE;                                            
                 END;                                                           
           END; /* END  IF IF LINJE_KODE < 7 THEN */                            
      /* -------------------------------------------------------                
            PIC_9V99 = B01.UFØRHIST.BUP_GARANTI(SØKER_IND,INDEX_1);             
            UTLINJEO.FØRSTEO =                                                  
            '    BUP_GARANTI OG BUP_GAR_KODE............';                      
            UTLINJEO.ANDREO  = PIC_9V99 !! (9)' ' !!                            
                 B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,INDEX_1);                  
            CALL SEND_UTLINJE;                                                  
        */                                                                      
   /* index2------------------------------------------------- */                
         IF IND_KODE = 0 THEN                                                   
            UG_START1 = 1;                                                      
                                                                                
         IF LINJE_KODE < 8 THEN                                                 
          DO;                                                                   
 /*JFA*/    DO INDEX_2 = UG_START1 TO HBOUND(B01.UFØRGRAD,3)                    
                         WHILE(B01.UFØRHIST.UFØRGRAD.                           
                          UFG_DATO_ÅMD(SØKER_IND,INDEX_1,INDEX_2) > 0);         
               UG_START1 = INDEX_2;                                             
               IND_KODE = 9;                                                    
               PIC_8 = B01.UFØRHIST.UFØRGRAD.UFG_DATO_ÅMD                       
                                       (SØKER_IND,INDEX_1,INDEX_2) ;            
               CALL PERIODE ('UFØRE-PERIODE', PIC_8,                            
                            B01.UFØRHIST.UFØRGRAD.UFG_ØVRIGE                    
                                       (SØKER_IND,INDEX_1,INDEX_2));            
                  LINJE_KODE  = LINJE_KODE  - 1;                                
            END;                      /***** INDEX_2 ****/                      
           END; /*   LINJE_KODE < 8        */                                   
                                                                                
         IF LINJE_KODE < 9 THEN                                                 
          DO;                                                                   
            IF B01.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,INDEX_1) > 0 THEN         
               DO;                                                              
                  UTLINJEO.FØRSTEO = '  UP - SLUTT, DATO OG KODE' !!            
                                                         (17)'.';               
                  PIC_10 = KONV_HÅMD_DBMBHÅ(                                    
                   (B01.UFØRHIST.OPPHØRSDATO_ÅMD(SØKER_IND,INDEX_1)));          
                                                                                
                  UTLINJEO.ANDREO  = PIC_10 !! (4)' ' !!                        
                           B01.UFØRHIST.OPPHØRSKODE(SØKER_IND,INDEX_1);         
                  CALL SEND_UTLINJE;                                            
               END;                                                             
          END; /*     LINJE_KODE < 9   */                                       
               LINJE_KODE = 0;                                                  
               LOOP_KODE = ' ';                                                 
               IND_KODE = 0 ;                                                   
         END; /* L_B_160:DO INDEX_1 = UP_START1 TO 7 WHILE ... */               
                                                                                
         BEHANDLE_NESTE_B = 'B170';                                             
                                                                                
         LINJE_KODE = 0;                                                        
         LOOP_KODE = ' ';                                                       
         IND_KODE = 0 ;                                                         
         /* YRKEHIST********   SEGMENT  **************     */                   
   L_B_170:                                                                     
         /*  index1-----------------------------------  */                      
         DO INDEX_1 = YP_START1 TO HBOUND(B01.YRKEHIST,2)                       
            WHILE(B01.YRKEHIST.YUFT_ÅMD  (SØKER_IND,INDEX_1) > 0);              
                                                                                
            YP_START1 = INDEX_1;                                                
                                                                                
            PIC_8 =    B01.YRKEHIST.YUFT_ÅMD (SØKER_IND,INDEX_1) ;              
                                                                                
            IF LINJE_KODE < 1 THEN                                              
            CALL PERIODE ('YRKE-PERIODE',PIC_8,                                 
                              B01.YRKEHIST.YUG    (SØKER_IND,INDEX_1));         
                                                                                
            PIC_ZZZZZZZZ9 = B01.YRKEHIST.AÅI(SØKER_IND,INDEX_1);                
            UTLINJEO.FØRSTEO =                                                  
            '    ANTATT ÅRLIG ARBEIDSINNT OG YRKESKODE..';                      
            UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9 !! (6)' ' !!                       
                 B01.YRKEHIST.YRKE11(SØKER_IND,INDEX_1);                        
            IF LINJE_KODE < 2 THEN                                              
               CALL SEND_UTLINJE;                                               
   /* må skrive ny linje med uførkriterioa ..................  */               
                                                                                
                                                                                
            PIC_9V99 = B01.YRKEHIST.PAÅ(SØKER_IND,INDEX_1);                     
            UTLINJEO.FØRSTEO =  '    POENG BEREGNET ETTER ANT. ÅRL.' !!         
                                ' INNT.' !! (3)'.';                             
            UTLINJEO.ANDREO  = PIC_9V99;                                        
            IF LINJE_KODE < 3 THEN                                              
               CALL SEND_UTLINJE;                                               
         IF IND_KODE = 0 THEN                                                   
            YP_START2 = 1;                                                      
     /* index2------------------------------------- */                          
         IF LINJE_KODE < 4 THEN                                                 
          DO;                                                                   
            DO INDEX_2 = YP_START2 TO HBOUND(B01.YRKEGRAD,3)                    
               WHILE(B01.YRKEHIST.YRKEGRAD.                                     
                          YUG_DATO_ÅMD(SØKER_IND,INDEX_1,INDEX_2) > 0);         
                                                                                
               YP_START2 = INDEX_2;                                             
               IND_KODE = 9;                                                    
               PIC_8 =    B01.YRKEHIST.YRKEGRAD.YUG_DATO_ÅMD                    
                                       (SØKER_IND,INDEX_1,INDEX_2) ;            
               CALL PERIODE ('YRKE-PERIODE',PIC_8,                              
                            B01.YRKEHIST.YRKEGRAD.YUG_ØVRIGE                    
                                       (SØKER_IND,INDEX_1,INDEX_2));            
            END;                      /***** INDEX_2 ****/                      
           END; /* IF LINJE_KODE < 4 THEN*/                                     
          IF LINJE_KODE < 5 THEN                                                
            DO;                                                                 
            IF B01.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,INDEX_1) > 0 THEN           
               DO;                                                              
                  UTLINJEO.FØRSTEO = '  YP - SLUTT, DATO OG KODE' !!            
                                                         (17)'.';               
                  PIC_10 = KONV_HÅMD_DBMBHÅ(                                    
                     (B01.YRKEHIST.OPPH_DATO_ÅMD(SØKER_IND,INDEX_1)));          
                                                                                
                  UTLINJEO.ANDREO  = PIC_10 !! (4)' '!!                         
                           B01.YRKEHIST.OPPH_KODE(SØKER_IND,INDEX_1);           
                  CALL SEND_UTLINJE;                                            
               END;                                                             
             END; /*  IF LINJE_KODE < 5 THEN     */                             
                                                                                
               LINJE_KODE = 0;                                                  
               LOOP_KODE = ' ';                                                 
               IND_KODE = 0 ;                                                   
         END; /* INDEX_1 = YP_START1 TO 5 WHILE */                              
                                                                                
         BEHANDLE_NESTE_B = 'B175';                                             
         CALL EN_BLANK_LINJE;                                                   
 L_B_175:                                                                       
    /* -------------------------------------------------------------- */        
    /* L_B_175 VIS INNTEKTSGRENSE, FLYTTA TIL UFØRESEGMENTET          */        
    /* -------------------------------------------------------------- */        
    BEHANDLE_NESTE_B = 'B180';                                                  
                                                                                
                                                                                
   L_B_180:                                                                     
         BEHANDLE_NESTE_B = 'B190';                                             
         IF B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) > 0 THEN                      
         IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN                           
            DO;                                                                 
                                                                                
               PIC_8 = B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND);                   
              CALL PERIODE ('AFP-PERIODE',PIC_8,                                
                            B01.ALDERSP.APD(SØKER_IND));                        
            /*    DETTE FELTE ER ENDRETVED OVERST FELTE AB 060801               
                            B01.ALDERSP.UTTAKS_APD(SØKER_IND))*/                
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               PIC_8 = B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND);                   
               CALL PERIODE ('ALDER-PERIODE', PIC_8,                            
                              B01.ALDERSP.UTTAKS_APD(SØKER_IND));               
            END;                                                                
                                                                                
   L_B_190:                                                                     
         BEHANDLE_NESTE_B = 'B200';                                             
                                                                                
         DO I = AP_START TO HBOUND(B01.VENTØVR,2)                               
                WHILE(B01.ALDERSP.VENTØVR.                                      
                              UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,I) > 0);          
                                                                                
           AP_START = I;                                                        
         IF B01.PENSJONSTYPE1(SØKER_IND)   = 'K' THEN                           
            DO;                                                                 
               PIC_8 =                                                          
              B01.ALDERSP.VENTØVR.UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,I);           
               CALL PERIODE ('AFP-PERIODE',PIC_8,                               
                         B01.ALDERSP.VENTØVR.APD_ØVRIGE (SØKER_IND,I));         
            END;                                                                
         ELSE                                                                   
            DO;                                                                 
               PIC_8 =                                                          
              B01.ALDERSP.VENTØVR.UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,I);           
               CALL PERIODE ('ALDER-PERIODE', PIC_8,                            
                         B01.ALDERSP.VENTØVR.APD_ØVRIGE (SØKER_IND,I));         
            END;                                                                
         END; /* do i = ap_start to 5 while ... */                              
                                                                                
   L_B_200:                                                                     
         BEHANDLE_NESTE_B = 'B20A';                                             
         CALL EN_BLANK_LINJE;                                                   
   L_B_20A:                                                                     
         BEHANDLE_NESTE_B = 'B20B';                                             
         IF B01.ALDERSP.FAI(SØKER_IND) > 0 THEN                                 
           DO;                                                                  
             FAI_F = B01.ALDERSP.FAI(SØKER_IND) * 100;                          
             UTLINJEO.FØRSTEO = 'FRAMTIDIG ARBEIDSINNTEKT' !! (19)'.';          
             UTLINJEO.ANDREO  = FAI_F;                                          
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_20B:                                                                     
         BEHANDLE_NESTE_B = 'B20C';                                             
         IF (B01.ALDERSP.AP_TEI_FAKTOR(SØKER_IND) > 0) THEN                     
            IF B01.PENSJONSTYPE1(SØKER_IND) = 'K' THEN                          
               DO;                                                              
                  W_TEI_FAKTOR = B01.ALDERSP.AP_TEI_FAKTOR(SØKER_IND);          
                  UTLINJEO.FØRSTEO =                                            
                     'TIDLIGERE ARBEIDSINNTEKT ' !!                             
                     W_TEI_FAKTOR !!                                            
                     ' GANGER G...';                                            
                  DO I = 1 TO HBOUND(G_TAB_PERIODE)                             
                           UNTIL (PERIODE_START_ÅMD(I)       =                  
                                        B01.G_DATO_ÅMD(SØKER_IND)+1);           
                  END;                                                          
                  TEI_F = W_TEI_FAKTOR * GRUNNBELØP(I);                         
                  TEI_F = TEI_F + 999;                                          
                  TEI_F = TEI_F / 1000;                                         
                  TEI_F = TEI_F * 1000;                                         
                  UTLINJEO.ANDREO  = TEI_F;                                     
                  CALL SEND_UTLINJE;                                            
               END;                                                             
         /*****     OPPLYSNINGER OM POENGTALL I ETTEBARN - SEG.  *****/         
                                                                                
   L_B_20C:                                                                     
         BEHANDLE_NESTE_B = 'B210';                                             
         CALL EN_BLANK_LINJE;                                                   
   L_B_210:                                                                     
         BEHANDLE_NESTE_B = 'B220';                                             
         IF B01.ETTEBARN.PÅ_MOR(SØKER_IND) > 0 THEN                             
           DO;                                                                  
             UTLINJEO.FØRSTEO = 'MORENS ANTALL POENGÅR' !! (22)'.';             
             PIC_Z9 = B01.ETTEBARN.PÅ_MOR(SØKER_IND);                           
             UTLINJEO.ANDREO  = PIC_Z9;                                         
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_220:                                                                     
         BEHANDLE_NESTE_B = 'B230';                                             
         IF B01.ETTEBARN.OPT_MOR(SØKER_IND) > 0 THEN                            
           DO;                                                                  
             PIC_9V99 = B01.ETTEBARN.OPT_MOR(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'MORENS SLUTTPOENGTALL M/OVERKOMP' !!           
                                                 (11)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_230:                                                                     
         BEHANDLE_NESTE_B = 'B240';                                             
         IF B01.ETTEBARN.SPT_MOR(SØKER_IND) > 0 THEN                            
           DO;                                                                  
             PIC_9V99 = B01.ETTEBARN.SPT_MOR(SØKER_IND)                         
                      - B01.ETTEBARN.OPT_MOR(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'MORENS SLUTTPOENGTALL U/OVERKOMP' !!           
                                                 (11)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_240:                                                                     
         BEHANDLE_NESTE_B = 'B250';                                             
         IF B01.ETTEBARN.PÅ_FAR(SØKER_IND) > 0 THEN                             
           DO;                                                                  
             UTLINJEO.FØRSTEO = 'FARENS ANTALL POENGÅR' !! (22)'.';             
             PIC_Z9 = B01.ETTEBARN.PÅ_FAR(SØKER_IND);                           
             UTLINJEO.ANDREO  = PIC_Z9;                                         
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_250:                                                                     
         BEHANDLE_NESTE_B = 'B260';                                             
         IF B01.ETTEBARN.OPT_FAR(SØKER_IND) > 0 THEN                            
           DO;                                                                  
             PIC_9V99 = B01.ETTEBARN.OPT_FAR(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'FARENS SLUTTPOENGTALL M/OVERKOMP' !!           
                                                 (11)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_260:                                                                     
         BEHANDLE_NESTE_B = 'B270';                                             
         IF B01.ETTEBARN.SPT_FAR(SØKER_IND) > 0 THEN                            
           DO;                                                                  
             PIC_9V99 = B01.ETTEBARN.SPT_FAR(SØKER_IND)                         
                      - B01.ETTEBARN.OPT_FAR(SØKER_IND);                        
             UTLINJEO.FØRSTEO = 'FARENS SLUTTPOENGTALL U/OVERKOMP' !!           
                                                 (11)'.';                       
             UTLINJEO.ANDREO  = PIC_9V99;                                       
             CALL SEND_UTLINJE;                                                 
           END;                                                                 
                                                                                
   L_B_270:                                                                     
         BEHANDLE_NESTE_B = 'B280';                                             
          IF B01.STATUS.GARANTI_TP(SØKER_IND) > 0 THEN                          
            DO;                                                                 
              BR_F = B01.STATUS.GARANTI_TP(SØKER_IND);                          
              UTLINJEO.FØRSTEO = 'GARANTI-TP' !! (33)'.';                       
              UTLINJEO.ANDREO  = BR_F !! ' KR. PR. MND.';                       
              CALL SEND_UTLINJE;                                                
            END;                                                                
           ELSE                                                                 
            DO;                                                                 
              LINJENO    = 90         ;                                         
              UTLINJEO.ANDREO  =  '                      ';                     
              IF B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND) ^= ' '  &            
                 B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND) ^= 'J' THEN          
                 UTLINJEO.ANDREO  =  ' Det er en side til';                     
              UTLINJEO.FØRSTEO = (43)' ';                                       
              CALL SEND_UTLINJE;                                                
            END;                                                                
   L_B_280:                                                                     
         BEHANDLE_NESTE_B = 'B300';                                             
       IF B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND) ^= ' '  &                   
          B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND) ^= 'J' THEN                 
          DO;     /*DA ER DET AP MED KODENE A,B,C,D*/                           
                                                                                
          UTLSO.L1O =                                                           
  '           ALDERSPENSJON MED EØS-GARANTI - TIDLIGERE UP           ';         
          CALL SEND_UTLS;                                                       
                                                                                
          SUM_F =           B01.EØSINFO.ALTERNATIV_GP(SØKER_IND)+               
                            B01.EØSINFO.ALTERNATIV_TP(SØKER_IND)+               
                            B01.EØSINFO.ALTERNATIV_ST(SØKER_IND);               
                                                                                
          SUM_G =           B01.ALDERSP.GP(SØKER_IND)+                          
                            B01.ALDERSP.TP(SØKER_IND)+                          
                            B01.ALDERSP.ST(SØKER_IND);                          
          IF SUM_F = SUM_G                                  THEN                
             UTLSO.L1O =                                                        
  '     ALTERNATIVENE ER LIKE STORE                                  ';         
          ELSE                                                                  
                                                                                
          IF B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND)= 'A' THEN                
          UTLSO.L1O =                                                           
  '     BESTE ALTERNATIV  ER EØS_GARANTI                             ';         
          ELSE                                                                  
          IF B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND) = 'B' THEN               
          UTLSO.L1O =                                                           
  '     BESTE ALTERNATIV ER AUTOMATISK FTRL-BEREGNING                ';         
          ELSE                                                                  
          UTLSO.L1O =                                                           
  '     BESTE ALTERNATIV ER NY FTRL BEREGNING ETTER REG. AP-BLANKETT ';         
          CALL SEND_UTLS;                                                       
                                                                                
          UTLSO.L1O = (78)' ';                                                  
          CALL SEND_UTLS   ;                                                    
                                                                                
          UTLSO.L1O =                                                           
  '     GARANTI BEREGNING              FOLKETRYGD-BEREGNING         ';          
          CALL SEND_UTLS;                                                       
                                                                                
                                                                                
          UTLSO.L1O = (78)' ';                                                  
          CALL SEND_UTLS   ;                                                    
                                                                                
             IF  B01.EØSINFO.PRO_RATA_BEREGNING(SØKER_IND) = 'A' THEN           
                 DO;                                                            
                   GP_F  = B01.EØSINFO.ALTERNATIV_GP(SØKER_IND);                
                   TP_F  = B01.EØSINFO.ALTERNATIV_TP(SØKER_IND);                
                   ST_F  = B01.EØSINFO.ALTERNATIV_ST(SØKER_IND);                
                   SPT_F  = 0;                                                  
                   OPT_F  = 0;                                                  
                   SUM_F  =                                                     
                            B01.EØSINFO.ALTERNATIV_GP(SØKER_IND)+               
                            B01.EØSINFO.ALTERNATIV_TP(SØKER_IND)+               
                            B01.EØSINFO.ALTERNATIV_ST(SØKER_IND);               
                                                                                
                   GP_G  = B01.ALDERSP.GP(SØKER_IND);                           
                   TP_G  = B01.ALDERSP.TP(SØKER_IND);                           
                   ST_G  = B01.ALDERSP.ST(SØKER_IND);                           
                   SUM_G  =                                                     
                            B01.ALDERSP.GP(SØKER_IND)+                          
                            B01.ALDERSP.TP(SØKER_IND)+                          
                            B01.ALDERSP.ST(SØKER_IND);                          
                 END;                                                           
             ELSE                                                               
                 DO;                                                            
                   GP_F   = B01.ALDERSP.GP(SØKER_IND);                          
                   TP_F   = B01.ALDERSP.TP(SØKER_IND);                          
                   ST_F  =  B01.ALDERSP.ST(SØKER_IND);                          
                   SPT_F  = B01.ALDERSP.SPT(SØKER_IND);                         
                   OPT_F  = B01.ALDERSP.OPT(SØKER_IND);                         
                   SUM_F  =                                                     
                            B01.ALDERSP.GP(SØKER_IND)+                          
                            B01.ALDERSP.TP(SØKER_IND)+                          
                            B01.ALDERSP.ST(SØKER_IND);                          
                                                                                
                   GP_G  = B01.EØSINFO.ALTERNATIV_GP(SØKER_IND);                
                   TP_G  = B01.EØSINFO.ALTERNATIV_TP(SØKER_IND);                
                   ST_G  = B01.EØSINFO.ALTERNATIV_ST(SØKER_IND);                
                   SUM_G  =                                                     
                            B01.EØSINFO.ALTERNATIV_GP(SØKER_IND)+               
                            B01.EØSINFO.ALTERNATIV_TP(SØKER_IND)+               
                            B01.EØSINFO.ALTERNATIV_ST(SØKER_IND);               
                                                                                
                 END;                                                           
                                                                                
                                                                                
             PIC_ZZ9 = B01.EØSINFO.TT_EØS_ANV_ÅR(SØKER_IND);                    
             PIC_Z9 = B01.STATUS.TT_ANV(SØKER_IND);                             
       UTLSO.L1O = 'SUM TEORETISK TT ÅR   ' !! PIC_ZZ9 !!                       
       '             ' !!  'TT ÅR I NORGE            ' !! PIC_Z9 ;              
          CALL SEND_UTLS;                                                       
         /* ..................                   */                             
             PIC_ZZ9 = B01.EØSINFO.TT_FAKTISK_NORSK_MND(SØKER_IND);             
             PIC_999 = B01.EØSINFO.TT_PRO_RATA_MND(SØKER_IND) +                 
                       B01.TT_FAKTISK_NORSK_MND(SØKER_IND);                     
             IF PIC_999 > 480 THEN                                              
                PIX_ZZ9  = 480 ;                                                
             ELSE                                                               
                PIX_ZZ9  = PIC_999;                                             
                                                                                
          UTLSO.L1O = 'TT PRORATA BRØK       ' !! PIC_ZZ9 !!                    
                               '/'!!PIX_ZZ9 !!                                  
       '         ' !! 'GRUNNPENSJON          ' !! GP_F        ;                 
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
                                                                                
          UTLSO.L1O = 'GRUNNPENSJON        ' !! GP_G !!                         
                                                                                
                   '                                      ';                    
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
                                                                                
             PIC_ZZ9 = B01.EØSINFO.PÅ_EØS(SØKER_IND);                           
             PIC_Z9  = B01.EØSINFO.ANTALL_NORSKE_PÅ(SØKER_IND);                 
          UTLSO.L1O = 'PÅ EØS                ' !! PIC_ZZ9 !!                    
          '             ' !! 'ANTALL POENGÅR           ' !! PIC_Z9;             
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
             PIC_9V99 = SPT_F;                                                  
             PIC_ZZ9 = B01.EØSINFO.PÅ_EØS_ETTER91(SØKER_IND);                   
          UTLSO.L1O = 'PÅ EØS ETTER 91       ' !! PIC_ZZ9 !!                    
          '             ' !! 'SPT FTRL               ' !! PIC_9V99;             
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
          UTLSO.L1O =                                                           
  '                                                                  ';         
          CALL SEND_UTLS   ;                                                    
         /* ..................                   */                             
                                                                                
  /*DENNE LOOPEN KAN FJERNES NÅR VI HAR FÅTT OPPDATERT*/                        
  /*B01 MED PÅ_EØS_FAKTISK : 9908 */                                            
    DO K = 1967  TO HBOUND(B02.INNTEKTSÅR_EØS,2);                               
       IF B01.INNTEKTSÅR_EØS (SØKER_IND, K ) = '1'B THEN                        
          PÅ_FAKTISK_EØS = PÅ_FAKTISK_EØS + 1;                                  
    END;                                                                        
          IF B01.PÅ_EØS_FAKTISK(SØKER_IND) > 0   THEN                           
             PÅ_FAKTISK_EØS = B01.PÅ_EØS_FAKTISK(SØKER_IND);                    
                                                                                
             PIC_9V99 = OPT_F;                                                  
             PIC_ZZ9 = B01.EØSINFO.PÅ_NORDISK_FAKT(SØKER_IND);                  
             PIX_Z9  = PÅ_FAKTISK_EØS +                                         
                       B01.EØSINFO.PÅ_NORDISK_FAKT(SØKER_IND);                  
             IF PIX_Z9 > 40         THEN                                        
                PIX_Z9 = 40;                                                    
          UTLSO.L1O = 'PÅ PRORATA BRØK       ' !! PIC_ZZ9 !!                    
                         '/' !! PIX_Z9 !! '          ' !!                       
                      'OPT FTRL               ' !! PIC_9V99;                    
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
                                                                                
             PIC_9V99 = B01.EØSINFO.SPT_EØS(SØKER_IND) ;                        
          UTLSO.L1O = 'SPT EØS              ' !! PIC_9V99 !!                    
          '             ' !! 'TILLEGGSPENSJON       ' !! TP_F ;                 
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
                                                                                
             PIC_9V99 = B01.EØSINFO.OPT_EØS(SØKER_IND) ;                        
          UTLSO.L1O = 'OPT EØS              ' !! PIC_9V99 !!                    
          '             ' !! 'SÆRTILLEGG            ' !! ST_F  ;                
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
          UTLSO.L1O =                                                           
  '                                                                  ';         
          CALL SEND_UTLS   ;                                                    
                                                                                
         /* ..................                   */                             
          UTLSO.L1O = 'TILLEGGSPENSJON     ' !! TP_G    !!                      
          '             ' !! 'SUM FTRL - BEREGNING  ' !! SUM_F  ;               
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
                                                                                
          UTLSO.L1O = 'SÆRTILLEGG          ' !! ST_G    !!                      
          '                             '           ;                           
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
                                                                                
          UTLSO.L1O = 'SUM GARANTERT AP    ' !! SUM_G    !!                     
          '                             '           ;                           
          CALL SEND_UTLS;                                                       
                                                                                
         /* ..................                   */                             
     END; /*DA ER DET AP MED KODENE A,B,C,D*/                                   
 /* ----------------------------------------------------------------- */        
   L_B_300:                                                                     
                                                                                
     SISTE_SIDE = '1'B;                                                         
     GOTO OVERFLOW;                                                             
    /* -------------------------------------------------------------- */        
    /* INTERN PROC I BYGG_BEREGNINGSGRUNNLAG                          */        
    /* -------------------------------------------------------------- */        
    PERIODE: PROC(TYPE,DATO_HÅMD,GRAD);                                         
       DCL                                                                      
          TYPE            CHAR     (13) VARYING,                                
          DATO_HÅMD       PIC '(8)9'       ,                                    
          GRAD             FIXED DEC(3) UNAL;                                   
       PIC_10          = KONV_HÅMD_DBMBHÅ(DATO_HÅMD);                           
       PIC_ZZ9         = GRAD;                                                  
       IF (B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) >= 20000800 &                  
           B01.PENSJONSTYPE1(SØKER_IND) = 'K'                ) THEN             
          DO;  /* PRORATABEREGNET */                                            
             UTLINJEO.FØRSTEO = TYPE !! ' FRA DATO' !! (29)'.';                 
             UTLINJEO.ANDREO  =                                                 
                PIC_10 !! ' MED ' !! PIC_ZZ9 !! ' PROSENT';                     
          END; /* PRORATABEREGNET */                                            
       ELSE                                                                     
          DO;  /* IKKE PRORATABEREGNET */                                       
             UTLINJEO.FØRSTEO = TYPE !! ' FRA DATO MED GRAD' !! (20)'.';        
             UTLINJEO.ANDREO  = PIC_10 !! (4)' ' !! PIC_ZZ9;                    
          END;                                                                  
       CALL SEND_UTLINJE;                                                       
       UTLINJEO.FØRSTEO = (43)' ';                                              
       UTLINJEO.ANDREO  = (34)' ';                                              
    END PERIODE;                                                                
    /* -------------------------------------------------------------- */        
                                                                                
 END BYGG_BEREGNINGSGRUNNLAG;                                                   
                                                                                
 /* ----------------------------------------------------------------- */        
 /* BYGG YTELSER INTERN PROC I FORESPØRSEL                            */        
 /* ----------------------------------------------------------------- */        
                                                                                
 BYGG_YTELSER:PROC;                                                             
    PRINT_KODE    = 0;                                                          
    IF SIDE_TELL        =  1 THEN                                               
       BEHANDLE_NESTE_Y = 'Y010';                                               
                                                                                
    IF (B01.STATUS_KODE_HIST(SØKER_IND) = 'X')     !                            
       (B01.STATUS_KODE_HIST(SØKER_IND) = 'O') THEN                             
                       BEHANDLE_NESTE_Y = 'Y310';                               
    CALL LOW_VALUES_TIL_MAP;                                                    
                                                                                
    SELECT  (BEHANDLE_NESTE_Y);                                                 
       WHEN ('Y010') GOTO Y010;                                                 
       WHEN ('Y210') GOTO Y210;                                                 
       WHEN ('Y310') GOTO Y310;                                                 
       OTHERWISE;                                                               
    END;                                                                        
                                                                                
    Y010:                                                                       
          BEHANDLE_NESTE_Y = 'Y210';                                            
          /******* OPPLYSNINGER FRA ALDERSP - SEGMENT ******/                   
    /* ------------------------------------------------------------- */         
    /* VISNING AV ALDERSPENSJONSSEGMENTET - RESTRUKTRURER MAI 2000   */         
    /* ------------------------------------------------------------- */         
    IF (B01.PENSJONSTYPE1(SØKER_IND) = 'K') THEN                                
      DO;  /* AFP PENSJON */                                                    
        /* ---------------------------------------------------------- */        
        /* SKRIV INFORMASJON OM HVILKEN PENSJON SOM YTES              */        
        /* ---------------------------------------------------------- */        
        YT = 'AFP: ';                                                           
        SELECT(B01.PENSJONSTYPE3(SØKER_IND));                                   
           WHEN(' ')                                                            
               IF B01.STATUS.STATUS_KODE_HIST(SØKER_IND) = ' ' THEN             
                   UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                
                                      'LO/NHO-ORDNINGEN';                       
                ELSE                                                            
                   UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                
                                      'OPPHØRT         ';                       
           WHEN('B')                                                            
              UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                     
                                 'I BANK- OG FINANSN.';                         
           WHEN('K')                                                            
              UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON '!!                      
                                 'I KOMMUNAL ORDNING';                          
           WHEN('N')                                                            
              DO;                                                               
                 UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON '!!                   
                                    'NAVO-ORDNINGEN';                           
                 UTLINJEO.ANDREO  = 'IKKE RETT TIL AFP-TILLEGG';                
              END;                                                              
           WHEN('S')                                                            
              UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                     
                                 'I STATLIG ORDNING';                           
           WHEN('V')                                                            
              UTLINJEO.FØRSTEO = 'AVTALEFESTET PENSJON ' !!                     
                                 'FRA NAVO-BEDRIFT';                            
           OTHER;                                                               
        END; /* SELECT PENSJONSTYPE3 */                                         
                                                                                
       IF B01.BEREGN_ALT_AEY(SØKER_IND) = 'W' THEN                              
          UTLINJEO.ANDREO  = '70% REGELEN ER BENYTTET';                         
       ELSE                                                                     
          UTLINJEO.ANDREO  = (34)' ';                                           
        CALL SEND_UTLINJE;                                                      
                                                                                
        /* ---------------------------------------------------------- */        
        /* SKRIV INFORMASJON OM HVILKEN BEREGNINGSMETODE BRUKT        */        
        /* ---------------------------------------------------------- */        
        IF B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) >= 20000800 THEN               
           UTLINJEO.FØRSTEO =                                                   
             'PRORATA-BEREGNET';                                                
        ELSE                                                                    
        IF B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND) >= 19971000 THEN               
           UTLINJEO.FØRSTEO =                                                   
             'ETTER REGLENE FRA 1.10.1997 TIL 31.07.2000 ';                     
        ELSE                                                                    
           UTLINJEO.FØRSTEO =                                                   
             'ETTER REGLENE FØR 1.10.1997                ';                     
  /*    UTLINJEO.ANDREO = 'KRONER PR. MND.'; */                                 
        UTLINJEO.ANDREO = '                               ';                    
        CALL SEND_UTLINJE;                                                      
                                                                                
        CALL EN_BLANK_LINJE;                                                    
      END;        /* END AVTALEFESTET PENSJON */                                
    ELSE                                                                        
      IF B01.PENSJONSTYPE1(SØKER_IND) = 'A' THEN                                
         YT = 'ALDER:';                                                         
    /* -------------------------------------------------------- */              
    UTLINJEO.FØRSTEO = (43)' ';                                                 
    UTLINJEO.ANDREO =  (34)' ';                                                 
    IF (B01.PENSJONSTYPE1(SØKER_IND) = 'E' !                                    
        B01.PENSJONSTYPE1(SØKER_IND) = 'J' !                                    
        B01.PENSJONSTYPE2(SØKER_IND) = 'E' )  &                                 
       (B01.ETTEPENS.GP_BRUTTO(SØKER_IND) > 0 ) THEN                            
       DO;                                                                      
          SELECT(B01.GUNSTIGSTE_ALTERNATIV(EKTEF_IND));                         
             WHEN(' ','1')                                                      
                UTLINJEO.FØRSTEO =                                              
                   'EP BEREGNET ETTER NASJONALE REGLER  ';                      
             WHEN('2','3')                                                      
                UTLINJEO.FØRSTEO =                                              
                   'EP BEREGNET ETTER EØS REGLENE       ';                      
             WHEN('4')                                                          
                UTLINJEO.FØRSTEO =                                              
                   'EP BEREGNET ETTER NORDISK KONVENSJON';                      
             OTHER;                                                             
          END;                                                                  
       END;                                                                     
    IF (B01.ETTEPENS.GP_BRUTTO(SØKER_IND) ^=                                    
        B01.ETTEPENS.GP_NETTO (SØKER_IND) > 0 ) !                               
       (B01.ETTEPENS.TP_BRUTTO(SØKER_IND) ^=                                    
        B01.ETTEPENS.TP_NETTO (SØKER_IND) > 0 ) !                               
       (B01.ETTEPENS.ST_BRUTTO(SØKER_IND) ^=                                    
        B01.ETTEPENS.ST       (SØKER_IND) > 0 ) !                               
       (B01.ALDERSP.AP_ST_NETTO (SØKER_IND) ^=                                  
        B01.ALDERSP.ST          (SØKER_IND) > 0 ) !                             
       (B01.ALDERSP.AP_TP_NETTO (SØKER_IND) ^=                                  
        B01.ALDERSP.TP          (SØKER_IND) > 0 ) !                             
       (B01.ALDERSP.AP_GP_NETTO (SØKER_IND) ^=                                  
        B01.ALDERSP.GP          (SØKER_IND) > 0 ) THEN                          
       DO;                                                                      
          UTLINJEO.ANDREO = 'BRUTTO  ! PENSJON ETTER REDUKSJON';                
       END;                                                                     
    IF (UTLINJEO.FØRSTEO ^= (43)' ' !                                           
        UTLINJEO.ANDREO  ^= (34)' ' ) THEN                                      
       CALL SEND_UTLINJE;                                                       
    UTLINJEO.FØRSTEO = (43)' ';                                                 
    UTLINJEO.ANDREO  = (34)' ';                                                 
    /* -------------------------------------------------------- */              
      SUM_BRUTTO = 0; /* NULLSTILLING */                                        
      SUM_NETTO  = 0; /* NULLSTILLING */                                        
      /* -------------------------------------------------------- */            
      IF B01.ALDERSP.GP(SØKER_IND) > 0 THEN                                     
         DO;  /* HAR GRUNNPENSJON BRUTTO */                                     
            BR_F = B01.ALDERSP.GP(SØKER_IND);                                   
            NE_F = B01.ALDERSP.AP_GP_NETTO(SØKER_IND);                          
            UTLINJEO.FØRSTEO = YT !! 'GRUNNPENSJON'!!(24)'.';                   
            UTLINJEO.ANDREO      = BR_F !! ' ' !! ' ! ' !! NE_F;                
            CALL SEND_UTLINJE;                                                  
            SUM_BRUTTO = BR_F;                                                  
            SUM_NETTO      = NE_F;                                              
         END;                                                                   
                                                                                
          /* -------------------------------------------------------- */        
      IF B01.ALDERSP.TP(SØKER_IND) > 0 THEN                                     
        DO;                              /* HAR TILLEGGSPENJON BRUTTO */        
          BR_F = B01.ALDERSP.TP(SØKER_IND);                                     
          NE_F = B01.ALDERSP.AP_TP_NETTO(SØKER_IND);                            
          UTLINJEO.FØRSTEO= YT!!'TILLEGGSPENSJON'!!(21)'.';                     
          UTLINJEO.ANDREO      = BR_F !! ' ' !! ' ! ' !! NE_F;                  
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
      /* -------------------------------------------------------- */            
      IF B01.ALDERSP.ST(SØKER_IND) > 0 THEN                                     
        DO;                   /* HAR SÆRTILLEGG - MANGLER BRUTTBELØPA */        
          UTLINJEO.FØRSTEO= YT!!'SÆRTILLEGG'!!(26)'.';                          
          NE_F = B01.ALDERSP.AP_ST_NETTO(SØKER_IND);                            
          BR_F = B01.ALDERSP.ST(SØKER_IND);                                     
          UTLINJEO.ANDREO      = BR_F !! ' ' !! ' ! ' !! NE_F;                  
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
      /* -------------------------------------------------------- */            
      IF B01.AFP_TILLEGG(SØKER_IND) > 0 THEN                                    
        DO;                 /* HAR AFP-TILLEGG - MANGLER BRUTTOBELØPA */        
          UTLINJEO.FØRSTEO = YT!!'AFP-TILLEGG' !! (25)'.';                      
          NE_F = B01.AFP_TILLEGG_NETTO(SØKER_IND);                              
          BR_F = B01.AFP_TILLEGG(SØKER_IND);                                    
          UTLINJEO.ANDREO      = BR_F !! ' ' !! ' ! ' !! NE_F;                  
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
      /* -------------------------------------------------------- */            
      IF (B01.ALDERSP.ET(SØKER_IND) > 0      !                                  
          B01.AP_ET_NETTO(SØKER_IND) > 0 ) THEN                                 
        DO;                                   /* HAR EKTEFELLETILLEGG */        
          UTLINJEO.FØRSTEO = YT!! 'EKTEFELLETILLEGG'!!(20)'.';                  
          BR_F = B01.ALDERSP.ET(SØKER_IND);                                     
          NE_F = B01.ALDERSP.AP_ET_NETTO(SØKER_IND);                            
          UTLINJEO.ANDREO      = BR_F !! ' ' !! ' ! ' !! NE_F;                  
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
        /* -------------------------------------------------------- */          
     IF B01.ALDERSP.BT(SØKER_IND) > 0 THEN                                      
       DO;      /* SKRIVER UT BARNETILLEGG */                                   
      /* UTLINJEO.FØRSTEO = YT!! 'BARNETILLEGG' !! (26)'.'; */                  
         UTLINJEO.FØRSTEO = YT!! 'TILLEGG FELLESBARN' !! (17)'.';               
         BR_F = B01.ALDERSP.BT(SØKER_IND);                                      
         NE_F = B01.ALDERSP.BT(SØKER_IND);                                      
         UTLINJEO.ANDREO          = BR_F !! ' ' !! ' ! ' !! NE_F;               
         CALL SEND_UTLINJE;                                                     
         SUM_BRUTTO = SUM_BRUTTO + BR_F;                                        
         SUM_NETTO      = SUM_NETTO + NE_F;                                     
       END;                                                                     
                                                                                
     IF B01.ALDERSP.KT(SØKER_IND) > 0 THEN                                      
       DO;      /* HAR KOMPENSASJONSTILLEGG */                                  
          BR_F = B01.ALDERSP.KT(SØKER_IND);                                     
          NE_F = B01.ALDERSP.KT(SØKER_IND);                                     
          UTLINJEO.FØRSTEO = YT!!'KOMPENSASJONSTILLEGG'!!(16)'.';               
          UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;          
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
       END;                                                                     
                                                                                
     IF B01.ALDERSP.GP_P67(SØKER_IND) > 0 THEN                                  
        DO;                                                                     
           BR_F = B01.ALDERSP.GP_P67(SØKER_IND);                                
           NE_F = B01.ALDERSP.GP_P67(SØKER_IND);                                
           UTLINJEO.FØRSTEO = YT!!'GRUNNPENSJON PR.67-ÅRS DATO' !!              
                                                     (9)'.';                    
           UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;         
           CALL SEND_UTLINJE;                                                   
           SUM_BRUTTO = SUM_BRUTTO + BR_F;                                      
           SUM_NETTO      = SUM_NETTO + NE_F;                                   
         END;                                                                   
                                                                                
     IF B01.ALDERSP.TP_P67(SØKER_IND) > 0 THEN                                  
        DO;                                                                     
           BR_F = B01.ALDERSP.TP_P67(SØKER_IND);                                
           NE_F = B01.ALDERSP.TP_P67(SØKER_IND);                                
           UTLINJEO.FØRSTEO = YT!!'TILLEGGSPENSJON PR. 67-ÅRS DATO'             
                                                  !! (5)'.';                    
           UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;         
           CALL SEND_UTLINJE;                                                   
           SUM_BRUTTO = SUM_BRUTTO + BR_F;                                      
           SUM_NETTO      = SUM_NETTO + NE_F;                                   
        END;                                                                    
                                                                                
     IF B01.ALDERSP.VT_GP(SØKER_IND) > 0 THEN                                   
        DO;                                                                     
           BR_F = B01.ALDERSP.VT_GP(SØKER_IND);                                 
           NE_F = B01.ALDERSP.VT_GP(SØKER_IND);                                 
           UTLINJEO.FØRSTEO = YT!!'VENTETILLEGG TIL GRUNNPENSJON'               
                                                  !! (7)'.';                    
           UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;         
           CALL SEND_UTLINJE;                                                   
           SUM_BRUTTO = SUM_BRUTTO + BR_F;                                      
           SUM_NETTO      = SUM_NETTO + NE_F;                                   
         END;                                                                   
                                                                                
     IF B01.ALDERSP.VT_TP(SØKER_IND) > 0 THEN                                   
        DO;                                                                     
           BR_F = B01.ALDERSP.VT_TP(SØKER_IND);                                 
           NE_F = B01.ALDERSP.VT_TP(SØKER_IND);                                 
           UTLINJEO.FØRSTEO  = YT!!'VENTETILLEGG TIL TILLEGGSPENSJON'           
                                                  !! (4)'.';                    
           UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;         
           CALL SEND_UTLINJE;                                                   
           SUM_BRUTTO = SUM_BRUTTO + BR_F;                                      
           SUM_NETTO      = SUM_NETTO + NE_F;                                   
        END;                                                                    
                                                                                
     IF SUM_BRUTTO > 0 THEN                                                     
        DO;                                                                     
            CALL EN_BLANK_LINJE;                                                
            UTLINJEO.FØRSTEO = YT !! 'SUM YTELSER' !! (25)'.';                  
            UTLINJEO.ANDREO      = SUM_BRUTTO !! '  ! '!! SUM_NETTO;            
            CALL SEND_UTLINJE;                                                  
            CALL EN_BLANK_LINJE;                                                
            E_NETTO = E_NETTO + SUM_NETTO;                                      
            E_BRUTTO = E_BRUTTO + SUM_BRUTTO;                                   
            SUM_NETTO  = 0;                                                     
            SUM_BRUTTO = 0;                                                     
            PRINT_KODE = PRINT_KODE  + 1;                                       
        END;                                                                    
                                                                                
          /* -------------------------------------------------------- */        
     /* BÅDE BRUTTO OG NETTO */                                                 
                                                                                
     IF B01.ALDERSP.FAI(SØKER_IND) > 0 THEN                                     
       DO;                                                                      
         CALL EN_BLANK_LINJE;                                                   
         FAI_F = B01.ALDERSP.FAI(SØKER_IND) * 100;                              
         UTLINJEO.FØRSTEO = 'FRAMTIDIG ARBEIDSINNTEKT' !! (19)'.';              
         UTLINJEO.ANDREO      = FAI_F;                                          
         CALL SEND_UTLINJE;                                                     
         CALL EN_BLANK_LINJE;                                                   
       END;                                                                     
                                                                                
     IF (B01.PENSJONSTYPE1(SØKER_IND) = 'U')     !                              
        (B01.PENSJONSTYPE1(SØKER_IND) = 'Y') THEN                               
        DO;  /* OPPLYSNINGER OM UFØREPENSJONEN */                               
           YT = 'UFØRE:' ;                                                      
           IF B01.UFØRPENS.GP(SØKER_IND) > 0 THEN                               
              DO;                                                               
                 BR_F = B01.UFØRPENS.GP(SØKER_IND);                             
                 NE_F = B01.UFØRPENS.GP(SØKER_IND);                             
                 UTLINJEO.FØRSTEO = YT !! 'GRUNNPENSJON' !! (24)'.';            
                 UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;               
                 CALL SEND_UTLINJE;                                             
                 SUM_BRUTTO = SUM_BRUTTO + BR_F;                                
                 SUM_NETTO  = SUM_NETTO  + NE_F;                                
              END;                                                              
                                                                                
           IF B01.UFØRPENS.TP(SØKER_IND) > 0 THEN                               
             DO;                                                                
               BR_F = B01.UFØRPENS.TP(SØKER_IND);                               
               NE_F = B01.UFØRPENS.TP(SØKER_IND);                               
               UTLINJEO.FØRSTEO = YT !! 'TILLEGGSPENSJON' !! (21)'.';           
               UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;                 
               CALL SEND_UTLINJE;                                               
               SUM_BRUTTO = SUM_BRUTTO + BR_F;                                  
               SUM_NETTO      = SUM_NETTO + NE_F;                               
             END;                                                               
                                                                                
           IF B01.UFØRPENS.ST(SØKER_IND) > 0 THEN                               
              DO;                                                               
                 BR_F = B01.UFØRPENS.ST(SØKER_IND);                             
                 NE_F = B01.UFØRPENS.ST(SØKER_IND);                             
                 UTLINJEO.FØRSTEO = YT !! 'SÆRTILLEGG' !! (26)'.';              
                 UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;               
                 CALL SEND_UTLINJE;                                             
                 SUM_BRUTTO = SUM_BRUTTO + BR_F;                                
                 SUM_NETTO      = SUM_NETTO + NE_F;                             
              END;                                                              
                                                                                
            IF B01.UFØRPENS.ÅFT(SØKER_IND) > 0 THEN                             
              DO;                                                               
                BR_F = B01.UFØRPENS.ÅFT(SØKER_IND);                             
                NE_F = B01.UFØRPENS.ÅFT(SØKER_IND);                             
                UTLINJEO.FØRSTEO = YT !! 'TILLEGG ETTER PARAGRAF 8-5-1'         
                                                           !! (8)'.';           
                UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;                
                CALL SEND_UTLINJE;                                              
                SUM_BRUTTO = SUM_BRUTTO + BR_F;                                 
                SUM_NETTO      = SUM_NETTO + NE_F;                              
              END;                                                              
                                                                                
           IF B01.UFØRPENS.ET(SØKER_IND) > 0      THEN                          
              DO;                                                               
                BR_F = B01.UFØRPENS.ET(SØKER_IND);                              
                NE_F = B01.UFØRPENS.ET(SØKER_IND);                              
                UTLINJEO.FØRSTEO = YT !! 'EKTEFELLETILLEGG' !! (20)'.';         
                UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;                
                CALL SEND_UTLINJE;                                              
                SUM_BRUTTO = SUM_BRUTTO + BR_F;                                 
                SUM_NETTO      = SUM_NETTO + NE_F;                              
              END;                                                              
                                                                                
            IF B01.UFØRPENS.BT(SØKER_IND) > 0 THEN                              
              DO;                                                               
                BR_F = B01.UFØRPENS.BT(SØKER_IND);                              
                NE_F = B01.UFØRPENS.BT(SØKER_IND);                              
                UTLINJEO.FØRSTEO = YT!! 'TILLEGG FELLESBARN' !! (18)'.';        
                UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;                
                CALL SEND_UTLINJE;                                              
                SUM_BRUTTO = SUM_BRUTTO + BR_F;                                 
                SUM_NETTO      = SUM_NETTO + NE_F;                              
              END;                                                              
                                                                                
           IF B01.FORSI.BT_SÆRBARN(SØKER_IND) > 0 THEN                          
             DO;                                                                
               BR_F = B01.FORSI.BT_SÆRBARN(SØKER_IND);                          
               NE_F = B01.FORSI.BT_SÆRBARN(SØKER_IND);                          
               UTLINJEO.FØRSTEO = YT!! 'TILLEGG SÆRKULLSBARN '                  
                                  !! (18)'.';                                   
               UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;                 
               CALL SEND_UTLINJE;                                               
               SUM_BRUTTO = SUM_BRUTTO + BR_F;                                  
               SUM_NETTO  = SUM_NETTO  + NE_F;                                  
             END;                                                               
                                                                                
           IF B01.UFØRPENS.KT(SØKER_IND) > 0 THEN                               
             DO;                                                                
               BR_F = B01.UFØRPENS.KT(SØKER_IND);                               
               NE_F = B01.UFØRPENS.KT(SØKER_IND);                               
               UTLINJEO.FØRSTEO = YT !! 'KOMPENSASJONSTILLEGG'                  
                                  !! (16)'.';                                   
               UTLINJEO.ANDREO  = BR_F !! ' ' !! ' ! ' !! NE_F;                 
               CALL SEND_UTLINJE;                                               
               SUM_BRUTTO = SUM_BRUTTO + BR_F;                                  
               SUM_NETTO      = SUM_NETTO + NE_F;                               
             END;                                                               
                                                                                
                                                                                
           IF SUM_BRUTTO > 0 THEN                                               
              DO;                                                               
                  CALL EN_BLANK_LINJE;                                          
                  UTLINJEO.FØRSTEO = YT !! 'SUM YTELSER' !! (25)'.';            
                  UTLINJEO.ANDREO  = SUM_BRUTTO !! '  ! '!! SUM_NETTO;          
                  CALL SEND_UTLINJE;                                            
                  CALL EN_BLANK_LINJE;                                          
                  E_NETTO = E_NETTO + SUM_NETTO;                                
                  E_BRUTTO = E_BRUTTO + SUM_BRUTTO;                             
                  SUM_NETTO  = 0;                                               
                  SUM_BRUTTO = 0;                                               
                  PRINT_KODE = PRINT_KODE  + 1;                                 
              END;                                                              
                                                                                
        END; /* OPPLYSNINGER OM UFØREPENSJONEN */                               
                                                                                
      /******* OPPLYSNINGER FRA YRKEPENS - SEGMENT ******/                      
       YT = 'YRKE :';                                                           
      IF B01.YRKEPENS.GP(SØKER_IND) > 0 THEN                                    
        DO;                                                                     
          BR_F = B01.YRKEPENS.GP(SØKER_IND);                                    
          NE_F = B01.YRKEPENS.GP(SØKER_IND);                                    
          UTLINJEO.FØRSTEO = YT !! 'GRUNNPENSJON' !! (24)'.';                   
          UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;          
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
      IF B01.YRKEPENS.BT(SØKER_IND) > 0 THEN                                    
        DO;                                                                     
          BR_F = B01.YRKEPENS.BT(SØKER_IND);                                    
          NE_F = B01.YRKEPENS.BT(SØKER_IND);                                    
          UTLINJEO.FØRSTEO = YT!! 'TILLEGG FELLESBARN' !! (18)'.';              
          UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;          
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
      IF B01.YRKEPENS.TP(SØKER_IND) > 0 THEN                                    
        DO;                                                                     
          BR_F = B01.YRKEPENS.TP(SØKER_IND);                                    
          NE_F = B01.YRKEPENS.TP(SØKER_IND);                                    
          UTLINJEO.FØRSTEO = YT !! 'TILLEGGSPENSJON' !! (21)'.';                
          UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;          
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
      /* kom dobbelt 250504 martin                                              
     IF SUM_BRUTTO > 0 THEN                                                     
        DO;                                                                     
            CALL EN_BLANK_LINJE;                                                
            UTLINJEO.FØRSTEO = YT !! 'SUM YTELSER' !! (25)'.';                  
            UTLINJEO.ANDREO      = SUM_BRUTTO !! '  ! '!! SUM_NETTO;            
            CALL SEND_UTLINJE;                                                  
            E_NETTO = E_NETTO + SUM_NETTO;                                      
            E_BRUTTO = E_BRUTTO + SUM_BRUTTO;                                   
            SUM_NETTO  = 0;                                                     
            SUM_BRUTTO = 0;                                                     
            PRINT_KODE = PRINT_KODE  + 1;                                       
        END;                                                                    
                                                                                
          /******* OPPLYSNINGER FRA ETTEPENS - SEGMENT ******                   
          MARTIN SITT FORSLAG */                                                
  IF (B01.PENSJONSTYPE1(SØKER_IND) = 'E' !                                      
      B01.PENSJONSTYPE1(SØKER_IND) = 'J' !                                      
      B01.PENSJONSTYPE2(SØKER_IND) = 'E' ) THEN                                 
      DO;                                                                       
                                                                                
      YK = 'GJENLEVENDE:';                                                      
      IF B01.ETTEPENS.GP_BRUTTO(SØKER_IND) > 0 THEN                             
         DO;      /* HAR RETT TIL GRUNNPENSJON - KAN VÆRE RED */                
                                                                                
            UTLINJEO.FØRSTEO = YK !! ' GRUNNPENSJON' !! (18)'.';                
            BR_F = B01.ETTEPENS.GP_BRUTTO(SØKER_IND) ;                          
            NE_F = B01.ETTEPENS.GP_NETTO(SØKER_IND);                            
            UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;        
            CALL SEND_UTLINJE;                                                  
            SUM_BRUTTO = SUM_BRUTTO + BR_F;                                     
            SUM_NETTO      = SUM_NETTO + NE_F;                                  
         END;                                                                   
                                                                                
                                                                                
      IF B01.ETTEPENS.TP_BRUTTO(SØKER_IND) > 0 THEN                             
         DO;      /* HAR RETT TIL TILLEGGSPENSJON - KAN VÆRE RED */             
            UTLINJEO.FØRSTEO = YK !! ' TILLEGGSPENSJON'!!(15)'.';               
            BR_F      = B01.ETTEPENS.TP_BRUTTO (SØKER_IND);                     
            NE_F = B01.ETTEPENS.TP_NETTO(SØKER_IND);                            
            UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;        
            CALL SEND_UTLINJE;                                                  
            SUM_BRUTTO = SUM_BRUTTO + BR_F;                                     
            SUM_NETTO      = SUM_NETTO + NE_F;                                  
                                                                                
         END; /* HAR RETT TIL TILLEGGSPENSJON - KAN VÆRE RED */                 
                                                                                
      IF B01.ETTEPENS.ST_brutto    (SØKER_IND) > 0 THEN                         
         DO;      /* HAR RETT TIL GRUNNPENSJON - KAN VÆRE RED. */               
                                                                                
            UTLINJEO.FØRSTEO = YK !! ' SÆRTILLEGG' !! (20)'.';                  
            BR_F = B01.ETTEPENS.ST_BRUTTO    (SØKER_IND);                       
            NE_F = B01.ETTEPENS.ST           (SØKER_IND);                       
            UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;        
            CALL SEND_UTLINJE;                                                  
            SUM_BRUTTO = SUM_BRUTTO + BR_F;                                     
            SUM_NETTO      = SUM_NETTO + NE_F;                                  
         END;                                                                   
                                                                                
                                                                                
      IF B01.ETTEPENS.KT(SØKER_IND) > 0 THEN                                    
        DO;                                                                     
            UTLINJEO.FØRSTEO = YK !! ' KOMPENSASJONSTILLEGG' !! (9)'.';         
          BR_F = B01.ETTEPENS.KT(SØKER_IND);                                    
          NE_F = B01.ETTEPENS.KT(SØKER_IND);                                    
          UTLINJEO.ANDREO              = BR_F !! ' ' !! ' ! ' !! NE_F;          
          CALL SEND_UTLINJE;                                                    
          SUM_BRUTTO = SUM_BRUTTO + BR_F;                                       
          SUM_NETTO      = SUM_NETTO + NE_F;                                    
        END;                                                                    
                                                                                
    END; /*  END  B01.PENSJONSTYPE2(SØKER_IND) = 'E' */                         
     /* JFA FLYTTET OG EDITERT */                                               
     IF SUM_BRUTTO > 0 THEN                                                     
        DO;                                                                     
            CALL EN_BLANK_LINJE;                                                
       /*   IF YT ^= (7)' ' THEN */                                             
            IF YK = (12)' ' THEN                                                
               UTLINJEO.FØRSTEO = YT !! ' SUM YTELSER' !! (24)'.';              
            ELSE                                                                
               UTLINJEO.FØRSTEO = YK !! ' SUM YTELSER' !! (19)'.';              
            UTLINJEO.ANDREO      = SUM_BRUTTO !! '  ! '!! SUM_NETTO;            
            CALL SEND_UTLINJE;                                                  
            E_NETTO = E_NETTO + SUM_NETTO;                                      
            E_BRUTTO = E_BRUTTO + SUM_BRUTTO;                                   
            SUM_NETTO  = 0;                                                     
            SUM_BRUTTO = 0;                                                     
            PRINT_KODE = PRINT_KODE  + 1;                                       
        END;                                                                    
  /******* OPPLYSNINGER FRA ETTEBARN - SEGMENT ******/                          
                                                                                
  IF  B01.PENSJONSTYPE1(SØKER_IND) = 'N'  !                                     
      B01.PENSJONSTYPE1(SØKER_IND) = 'B'  THEN                                  
      DO;                                                                       
        IF B01.ETTEBARN.GP(SØKER_IND) > 0 THEN                                  
           DO;                                                                  
              UTLINJEO.FØRSTEO =                                                
                             'ETTERLATT BARN - GRUNNPENSJON' !! (14)'.';        
              BR_F = B01.ETTEBARN.GP(SØKER_IND);                                
              NE_F = B01.ETTEBARN.GP(SØKER_IND);                                
              UTLINJEO.ANDREO    = BR_F !! ' ' !! ' ! ' !! NE_F;                
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
            END;                                                                
                                                                                
        IF B01.ETTEBARN.TP(SØKER_IND) > 0 THEN                                  
           DO;                                                                  
              BR_F = B01.ETTEBARN.TP(SØKER_IND);                                
              NE_F = B01.ETTEBARN.TP(SØKER_IND);                                
              UTLINJEO.FØRSTEO = 'ETTERLATT BARN - TILLEGGSPENSJON' !!          
                                                  (11)'.';                      
              UTLINJEO.ANDREO         = BR_F !! ' ' !! ' ! ' !! NE_F;           
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
           END;                                                                 
                                                                                
        IF B01.ETTEBARN.ST(SØKER_IND) > 0 THEN                                  
           DO;                                                                  
             BR_F = B01.ETTEBARN.ST(SØKER_IND);                                 
             NE_F = B01.ETTEBARN.ST(SØKER_IND);                                 
             UTLINJEO.FØRSTEO = 'ETTERLATT BARN - SÆRTILLEGG' !!                
                                                  (16)'.';                      
             UTLINJEO.ANDREO       = BR_F !! ' ' !! ' ! ' !! NE_F;              
             CALL SEND_UTLINJE;                                                 
             SUM_BRUTTO = SUM_BRUTTO + BR_F;                                    
             SUM_NETTO      = SUM_NETTO + NE_F;                                 
           END;                                                                 
                                                                                
        IF B01.ETTEBARN.KT(SØKER_IND) > 0 THEN                                  
           DO;                                                                  
             BR_F = B01.ETTEBARN.KT(SØKER_IND);                                 
             NE_F = B01.ETTEBARN.KT(SØKER_IND);                                 
             UTLINJEO.FØRSTEO = 'ETTERLATT BARN - KOMPENSASJONSTILLEGG'         
                                              !!      (06)'.';                  
             UTLINJEO.ANDREO       = BR_F !! ' ' !! ' ! ' !! NE_F;              
             CALL SEND_UTLINJE;                                                 
             SUM_BRUTTO = SUM_BRUTTO + BR_F;                                    
             SUM_NETTO      = SUM_NETTO + NE_F;                                 
           END;                                                                 
                                                                                
        IF SUM_BRUTTO > 0 THEN                                                  
           DO;                                                                  
             CALL EN_BLANK_LINJE;                                               
             UTLINJEO.FØRSTEO =  'SUM YTELSER.........' !! (23)'.';             
             UTLINJEO.ANDREO      = SUM_BRUTTO !! '  ! '!! SUM_NETTO;           
             CALL SEND_UTLINJE;                                                 
             E_NETTO = E_NETTO + SUM_NETTO;                                     
             E_BRUTTO = E_BRUTTO + SUM_BRUTTO;                                  
             SUM_NETTO  = 0;                                                    
             SUM_BRUTTO = 0;                                                    
             PRINT_KODE = PRINT_KODE  + 1;                                      
          END;                                                                  
    END;                                                                        
          IF B01.FORSI.GARANTITILLEGG_EK(SØKER_IND) > 0 THEN                    
            DO;                                                                 
              BR_F = B01.FORSI.GARANTITILLEGG_EK(SØKER_IND);                    
              NE_F = B01.FORSI.GARANTITILLEGG_EK(SØKER_IND);                    
              UTLINJEO.FØRSTEO = 'GARANTITILLEGG_EK' !! (26)'.';                
              UTLINJEO.ANDREO            = BR_F !! ' ' !! ' ! ' !! NE_F;        
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
             PRINT_KODE = PRINT_KODE  + 1;                                      
            END;                                                                
                                                                                
          IF B01.FORSI.GARANTITILLEGG_BARN(SØKER_IND) > 0 THEN                  
            DO;                                                                 
              BR_F = B01.FORSI.GARANTITILLEGG_BARN(SØKER_IND);                  
              NE_F = B01.FORSI.GARANTITILLEGG_BARN(SØKER_IND);                  
              UTLINJEO.FØRSTEO = 'GARANTITILLEGG BARN' !! (24)'.';              
              UTLINJEO.ANDREO            = BR_F !! ' ' !! ' ! ' !! NE_F;        
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
             PRINT_KODE = PRINT_KODE  + 1;                                      
            END;                                                                
                                                                                
                                                                                
          IF (B01.FORSI.BT_SÆRBARN(SØKER_IND) > 0 &                             
              B01.PENSJONSTYPE1(SØKER_IND) ^= 'U' &                             
              B01.PENSJONSTYPE1(SØKER_IND) ^= 'Y') THEN                         
            DO;                                                                 
              BR_F = B01.FORSI.BT_SÆRBARN (SØKER_IND);                          
              NE_F = B01.FORSI.BT_SÆRBARN (SØKER_IND);                          
       /*     UTLINJEO.FØRSTEO = 'BT_SÆRBARN' !! (33)'.'; */                    
              UTLINJEO.FØRSTEO = 'TILLEGG SÆRKULLSBARN' !! (23)'.';             
              UTLINJEO.ANDREO            = BR_F !! ' ' !! ' ! ' !! NE_F;        
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
             PRINT_KODE = PRINT_KODE  + 1;                                      
            END;                                                                
                                                                                
          IF B01.FORSI.GARANTITILLEGG_SÆRBARN(SØKER_IND) > 0 THEN               
            DO;                                                                 
              BR_F = B01.FORSI.GARANTITILLEGG_SÆRBARN (SØKER_IND);              
              NE_F = B01.FORSI.GARANTITILLEGG_SÆRBARN (SØKER_IND);              
              UTLINJEO.FØRSTEO = 'GARANTITILLEGG SÆRBARN' !! (21)'.';           
              UTLINJEO.ANDREO            = BR_F !! ' ' !! ' ! ' !! NE_F;        
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
            END;                                                                
                                                                                
          IF B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND) > 0 THEN                    
            DO;                                                                 
              BR_F = B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND);                    
              NE_F = B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND);                    
              UTLINJEO.FØRSTEO = 'GARANTI TILLEGG LOV92' !! (22)'.';            
              UTLINJEO.ANDREO            = BR_F !! ' ' !! ' ! ' !! NE_F;        
              CALL SEND_UTLINJE;                                                
              SUM_BRUTTO = SUM_BRUTTO + BR_F;                                   
              SUM_NETTO      = SUM_NETTO + NE_F;                                
             PRINT_KODE = PRINT_KODE  + 1;                                      
            END;                                                                
                                                                                
    Y210:                                                                       
          BEHANDLE_NESTE_Y = 'Y210';                                            
      /* -------------------------------------------------------- */            
     IF PRINT_KODE > 1   THEN                                                   
        DO;                                                                     
            CALL EN_BLANK_LINJE;                                                
            E_NETTO = E_NETTO + SUM_NETTO;                                      
            E_BRUTTO = E_BRUTTO + SUM_BRUTTO;                                   
            UTLINJEO.FØRSTEO = 'SUM YTELSER .......' !! (24)'.';                
            UTLINJEO.ANDREO      = E_BRUTTO !! '  ! '!! E_NETTO;                
            CALL SEND_UTLINJE;                                                  
        END;                                                                    
                                                                                
          /* -------------------------------------------------------- */        
                                                                                
          IF B01.ETTEPENS.FORVENTET(SØKER_IND) > 0     !                        
             B01.ETTEPENS.FRADRAG_2G(SØKER_IND) = 'J'  then                     
            DO;                                                                 
              CALL EN_BLANK_LINJE;                                              
              if (B01.ETTEPENS.FRADRAG_2G(SØKER_IND) = 'J')  then               
                DO;                                                             
                  DO I = 1 TO HBOUND(G_TAB_PERIODE)                             
                         UNTIL (PERIODE_START_ÅMD(I)       =                    
                                        B01.G_DATO_ÅMD(SØKER_IND)+1);           
                  END;                                                          
                  IF  (B01.ETTEPENS.FORVENTET(SØKER_IND) * 100)  <              
                      (GRUNNBELØP(I) * 2)             THEN                      
                      PIC_ZZZZZZZZ9 = GRUNNBELØP(I) * 2;                        
                  ELSE                                                          
                  PIC_ZZZZZZZZ9 = B01.ETTEPENS.FORVENTET(SØKER_IND)*100;        
                END;                                                            
              ELSE                                                              
                PIC_ZZZZZZZZ9 = B01.ETTEPENS.FORVENTET(SØKER_IND) * 100;        
              UTLINJEO.FØRSTEO = 'FORVENTET INNTEKT' !! (26)'.';                
              UTLINJEO.ANDREO  = PIC_ZZZZZZZZ9 !! ' KR PR ÅR.';                 
              CALL SEND_UTLINJE;                                                
            END;                                                                
                                                                                
          IF B01.ETTEPENS.TP_BRUTTO(SØKER_IND) > 0 THEN                         
            DO;                                                                 
              CALL EN_BLANK_LINJE;                                              
              IF  B01.STATUS.SIVILSTAND(SØKER_IND) = 'E' THEN                   
                  PIC_ZZ9 = '055';                                              
              ELSE                                                              
                  PIC_ZZ9 = B01.ETTEPENS.TP_PROSENT(SØKER_IND);                 
              UTLINJEO.FØRSTEO = YK !! ' TILLEGGSPENSJONEN UTGJØR' !!           
                                                            (05)'.';            
              UTLINJEO.ANDREO  = PIC_ZZ9 !! ' PROSENT';                         
              CALL SEND_UTLINJE;                                                
            END;                                                                
                                                                                
    Y310:                                                                       
     SISTE_SIDE = '1'B;                                                         
     GOTO OVERFLOW;                                                             
                                                                                
 END BYGG_YTELSER;                                                              
                                                                                
 BYGG_STATUS:                                                                   
   PROC;                                                                        
                                                                                
                                                                                
     IF SIDE_TELL = 1 THEN                                                      
        BEHANDLE_NESTE_F = 'F010';                                              
                                                                                
     CALL LOW_VALUES_TIL_MAP;                                                   
                                                                                
     SELECT (BEHANDLE_NESTE_F);                                                 
                                                                                
     WHEN ('F010')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('OVERSIKT SEGMENTER');                                
        CALL LOW_VALUES_TIL_MAP;                                                
        ROTMENYO.SPRÅKO       = B01.RF0PERSN.SPRÅK(SØKER_IND);                  
        ROTMENYO.ANT_INNTEKTO = B01.RF0PERSN.AI67(SØKER_IND) * 100;             
        ROTMENYO.SPERREO      = B01.RF0PERSN.SPERRE(SØKER_IND);                 
        ROTMENYO.VP_ÅR1O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,1);         
        ROTMENYO.VP_ÅR2O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,2);         
        ROTMENYO.VP_ÅR3O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,3);         
        ROTMENYO.VP_ÅR4O      = B01.TILBERPO.VERNEPLIKTÅR(SØKER_IND,4);         
        ROTMENYO.SB_DATO_DMÅO =                                                 
                 KONV_HÅMD_DMHÅ((B01.RF0PERSN.SB_DATO_ÅMD(SØKER_IND)));         
                                                                                
            /* ROLFS OG HEIDIS IDENTER SKAL KONVERTERES TIL AUTO*/              
        IF (B01.RF0PERSN.BRUKER_ID(SØKER_IND) = 'RSB2970' !                     
            B01.RF0PERSN.BRUKER_ID(SØKER_IND) = 'MLA2970' !                     
            B01.RF0PERSN.BRUKER_ID(SØKER_IND) = 'HAA2970') THEN                 
             ROTMENYO.BRUKER_IDO   = 'AUTO';                                    
        ELSE                                                                    
             ROTMENYO.BRUKER_IDO   = B01.RF0PERSN.BRUKER_ID(SØKER_IND);         
        ROTMENYO.PI66_65O     = B01.RF0PERSN.PI_66_65(SØKER_IND);               
        ROTMENYO.EØS_GARANTIO = B01.RF0PERSN.EØS_GARANTI(SØKER_IND);            
        IF B01.RF0PERSN.PERSN_KODE(SØKER_IND) = 'S' THEN                        
             ROTMENYO.SPERRE_KODEO = 'PERSON ER SPERRET  ';                     
        ELSE                                                                    
             ROTMENYO.SPERRE_KODEO = '                   ';                     
                                                                                
        EXEC CICS SEND MAP('ROTMENY') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F015';                                              
        EO_I = 1;                                                               
       END;                                                                     
                                                                                
     WHEN ('F015')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('PENSJONSSTATUS');                                    
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_STATUS;                                                       
        EXEC CICS SEND MAP('STATUS') MAPSET('S001043') ACCUM PAGING;            
        BEHANDLE_NESTE_F = 'F020';                                              
       END;                                                                     
                                                                                
                                                                                
     WHEN ('F020')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('TILKNYTNING');                                       
        DO I = 1 TO 5;                                                          
          CALL EN_BLANK_LINJE;                                                  
        END;                                                                    
        DO I = 1 TO 13 WHILE(B01.TILKN.FNR_TILKN(SØKER_IND,I) > 0);             
           CALL LOW_VALUES_TIL_MAP;                                             
           TILKNO.FNR_TILKNO  = B01.TILKN.FNR_TILKN       (SØKER_IND,I);        
           TILKNO.TILKN_KODEO = B01.TILKN.TILKNYTNINGSKODE(SØKER_IND,I);        
           TILKNO.FT_FØR_91O  = B01.TILKN.FT_FØR_91       (SØKER_IND,I);        
           EXEC CICS SEND MAP('TILKN') MAPSET('S001043') ACCUM PAGING;          
        END;                                                                    
        BEHANDLE_NESTE_F = 'F025';                                              
       END;                                                                     
                                                                                
     WHEN ('F025')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('FORSØRGINGSINNTEKT');                                
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_FORSI;                                                        
        EXEC CICS SEND MAP('FORSI') MAPSET('S001043') ACCUM PAGING;             
        BEHANDLE_NESTE_F = 'F030';                                              
       END;                                                                     
                                                                                
     WHEN ('F030')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('ALDERSPENSJON/AFP');                                 
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_ALDER;                                                        
        EXEC CICS SEND MAP('ALDERSP') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F035';                                              
       END;                                                                     
                                                                                
     WHEN ('F035')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('AFP HISTORIKK  ');                                   
        CALL LOW_VALUES_TIL_MAP;                                                
        AFP_START  =  1;                                                        
        AFP_SLUTT  =  17;                                                       
        CALL FYLL_AFP  ;                                                        
        EXEC CICS SEND MAP('AFP    ') MAPSET('S001043') ACCUM PAGING;           
        IF B01.AFPHIST.AFPDATO_ÅMD(SØKER_IND,18) > 0 THEN                       
           BEHANDLE_NESTE_F = 'F036';                                           
        ELSE                                                                    
           BEHANDLE_NESTE_F = 'F040';                                           
       END;                                                                     
                                                                                
     WHEN ('F036')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('AFP HISTORIKK  ');                                   
        CALL LOW_VALUES_TIL_MAP;                                                
        AFP_START  =  18;                                                       
        AFP_SLUTT  =  30;                                                       
        CALL FYLL_AFP  ;                                                        
        EXEC CICS SEND MAP('AFP    ') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F040';                                              
       END;                                                                     
                                                                                
     WHEN ('F040','F041') /* ny martin  */                                      
       DO;                                                                      
          CALL BYGG_GENHEAD('AFP ETTEROPPGJØR ');                               
          CALL LOW_VALUES_TIL_MAP;                                              
          CALL FYLL_EOAFP ;                                                     
          EXEC CICS SEND MAP('EOAFP ') MAPSET('S001043') ACCUM PAGING;          
                                                                                
          EO_I = EO_I + 1;                                                      
        IF B01.EOAFP.INNTEKTSÅR(SØKER_IND,EO_I ) > 0  THEN                      
             BEHANDLE_NESTE_F = 'F041';                                         
        ELSE                                                                    
             BEHANDLE_NESTE_F = 'F045';                                         
       END;                                                                     
                                                                                
     WHEN ('F045')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('UFØREPENSJON ');                                     
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_UFØR;                                                         
        EXEC CICS SEND MAP('UFØRP') MAPSET('S001043') ACCUM PAGING;             
                                                                                
           BEHANDLE_NESTE_F = 'F051';                                           
        UI = 1 ;                                                                
                                                                                
       END;                                                                     
                                                                                
     WHEN ('F050','F051')                                                       
       DO;                                                                      
      /*  DO I = UI TO 7 WHILE(B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I) > 0);*/        
          DO I = UI TO 7;                                                       
             CALL BYGG_GENHEAD('UFØREHISTORIKK   ');                            
             CALL LOW_VALUES_TIL_MAP;                                           
         /*  IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND, I) > 0 THEN */                  
             CALL FYLL_UFØRHIST;                                                
             UI = UI + 1 ;                                                      
             IF UI > 7 THEN                                                     
                DO;                                                             
                   UFØRHO.TEXTO  = '                           ';               
                   BEHANDLE_NESTE_F = 'F060';                                   
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   IF B01.UFØRHIST.UFT_ÅMD(SØKER_IND, UI) > 0 THEN              
                      DO;                                                       
                         UFØRHO.TEXTO  = 'FLERE UFØRHIST-SEGMENTER !!';         
                         BEHANDLE_NESTE_F = 'F050';                             
                      END;                                                      
                   ELSE                                                         
                     DO;                                                        
                        UFØRHO.TEXTO  = '                           ';          
                        BEHANDLE_NESTE_F = 'F060';                              
                     END;                                                       
                 END;                                                           
              EXEC CICS SEND MAP('UFØRH') MAPSET('S001043')                     
                                                           ACCUM PAGING;        
                         DO WHILE ('A' = 'A');                                  
                           CALL EN_BLANK_LINJE;                                 
                         END;                                                   
                                                                                
                                                                                
          END; /* END DO 1 TO 7                    */                           
       END;   /*  END     WHEN                     */                           
                                                                                
       WHEN ('F060')                                                            
         DO;                                                                    
          CALL BYGG_GENHEAD('YRKESSKADEPENSJON ');                              
          CALL LOW_VALUES_TIL_MAP;                                              
          CALL FYLL_YSKADE;                                                     
          EXEC CICS SEND MAP('YRKEP') MAPSET('S001043') ACCUM PAGING;           
          BEHANDLE_NESTE_F = 'F070';                                            
         END;                                                                   
                                                                                
       WHEN ('F070')                                                            
         DO;                                                                    
          CALL BYGG_GENHEAD('YRKEHISTORIKK   ');                                
          CALL LOW_VALUES_TIL_MAP;                                              
          DO I = 1 TO 2 WHILE(B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) > 0);          
             CALL LOW_VALUES_TIL_MAP;                                           
             CALL FYLL_YRKEHIST;                                                
             EXEC CICS SEND MAP('YRKEH') MAPSET('S001043') ACCUM PAGING;        
          END;                                                                  
                                                                                
          IF B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,3) > 0 THEN                        
             DO;                                                                
               CALL EN_BLANK_LINJE;                                             
               CALL LOW_VALUES_TIL_MAP;                                         
               UTLINJEO.FØRSTEO = (43)' ' ;                                     
               UTLINJEO.ANDREO = 'FLERE YRKEHIST-SEGMENTER !!       ';          
               CALL SEND_UTLINJE;                                               
               BEHANDLE_NESTE_F = 'F07B';                                       
             END;                                                               
          ELSE                                                                  
             BEHANDLE_NESTE_F = 'F080';                                         
                                                                                
         END;                                                                   
                                                                                
       WHEN ('F07B')                                                            
         DO;                                                                    
          CALL BYGG_GENHEAD('YRKEHISTORIKK   ');                                
          CALL LOW_VALUES_TIL_MAP;                                              
          DO I = 3 TO 4 WHILE(B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) > 0);          
             CALL LOW_VALUES_TIL_MAP;                                           
             CALL FYLL_YRKEHIST;                                                
             EXEC CICS SEND MAP('YRKEH') MAPSET('S001043') ACCUM PAGING;        
          END;                                                                  
          IF B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,5) > 0 THEN                        
             DO;                                                                
               CALL EN_BLANK_LINJE;                                             
               CALL LOW_VALUES_TIL_MAP;                                         
               UTLINJEO.FØRSTEO = (43)' ' ;                                     
               UTLINJEO.ANDREO = 'FLERE YRKEHIST-SEGMENTER !!       ';          
               CALL SEND_UTLINJE;                                               
               BEHANDLE_NESTE_F = 'F07C';                                       
             END;                                                               
          ELSE                                                                  
             BEHANDLE_NESTE_F = 'F080';                                         
                                                                                
         END;                                                                   
                                                                                
       WHEN ('F07C')                                                            
         DO;                                                                    
           CALL BYGG_GENHEAD('YRKEHISTORIKK   ');                               
           CALL LOW_VALUES_TIL_MAP;                                             
           DO I = 5 TO 6 WHILE(B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) > 0);         
               CALL LOW_VALUES_TIL_MAP;                                         
               CALL FYLL_YRKEHIST;                                              
               EXEC CICS SEND MAP('YRKEH') MAPSET('S001043')                    
                                                           ACCUM PAGING;        
           END;                                                                 
          IF B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,7) > 0 THEN                        
             DO;                                                                
               CALL EN_BLANK_LINJE;                                             
               CALL LOW_VALUES_TIL_MAP;                                         
               UTLINJEO.FØRSTEO = (43)' ' ;                                     
               UTLINJEO.ANDREO = 'FLERE YRKEHIST-SEGMENTER !!       ';          
               CALL SEND_UTLINJE;                                               
               BEHANDLE_NESTE_F = 'F07D';                                       
             END;                                                               
          ELSE                                                                  
             BEHANDLE_NESTE_F = 'F080';                                         
                                                                                
         END;                                                                   
                                                                                
       WHEN ('F07D')                                                            
         DO;                                                                    
           CALL BYGG_GENHEAD('YRKEHISTORIKK   ');                               
           CALL LOW_VALUES_TIL_MAP;                                             
           DO I = 7 TO 8 WHILE(B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) > 0);         
               CALL LOW_VALUES_TIL_MAP;                                         
               CALL FYLL_YRKEHIST;                                              
               EXEC CICS SEND MAP('YRKEH') MAPSET('S001043')                    
                                                           ACCUM PAGING;        
           END;                                                                 
          IF B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,9) > 0 THEN                        
             DO;                                                                
               CALL EN_BLANK_LINJE;                                             
               CALL LOW_VALUES_TIL_MAP;                                         
               UTLINJEO.FØRSTEO = (43)' ' ;                                     
               UTLINJEO.ANDREO = 'FLERE YRKEHIST-SEGMENTER !!       ';          
               CALL SEND_UTLINJE;                                               
               BEHANDLE_NESTE_F = 'F07E';                                       
             END;                                                               
          ELSE                                                                  
             BEHANDLE_NESTE_F = 'F080';                                         
                                                                                
         END;                                                                   
                                                                                
       WHEN ('F07E')                                                            
         DO;                                                                    
           CALL BYGG_GENHEAD('YRKEHISTORIKK   ');                               
           CALL LOW_VALUES_TIL_MAP;                                             
           DO I = 9 TO 10 WHILE(B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I) >0);         
               CALL LOW_VALUES_TIL_MAP;                                         
               CALL FYLL_YRKEHIST;                                              
               EXEC CICS SEND MAP('YRKEH') MAPSET('S001043')                    
                                                           ACCUM PAGING;        
           END;                                                                 
                                                                                
             BEHANDLE_NESTE_F = 'F080';                                         
                                                                                
         END;                                                                   
                                                                                
     WHEN ('F080')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('GJENLEVENDEPENS.');                                  
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_ETTERLATT;                                                    
        EXEC CICS SEND MAP('ETTEPEN') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F090';                                              
       END;                                                                     
                                                                                
     WHEN ('F090')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('BARNEPENSJON    ');                                  
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_ETTEBARN;                                                     
        EXEC CICS SEND MAP('ETTEBA') MAPSET('S001043') ACCUM PAGING;            
        BEHANDLE_NESTE_F = 'F100';                                              
       END;                                                                     
                                                                                
                                                                                
     WHEN ('F100')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('EØS      SIDE  1');                                  
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_EØSINFO ;                                                     
        EXEC CICS SEND MAP('EØSINF1') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F101';                                              
       END;                                                                     
                                                                                
     WHEN ('F101')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('EØS       SIDE 2');                                  
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_EØSINF2 ;                                                     
        EXEC CICS SEND MAP('EØSINF2') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F102';                                              
       END;                                                                     
                                                                                
     WHEN ('F102')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('EØS       SIDE 3');                                  
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_EØSINF3 ;                                                     
        EXEC CICS SEND MAP('EØSINF3') MAPSET('S001043') ACCUM PAGING;           
        BEHANDLE_NESTE_F = 'F110';                                              
       END;                                                                     
                                                                                
     WHEN ('F110')                                                              
       DO;                                                                      
        CALL BYGG_GENHEAD('SPESIELLE OPPL. ');                                  
        CALL LOW_VALUES_TIL_MAP;                                                
        CALL FYLL_SPESOPPL;                                                     
        EXEC CICS SEND MAP('SPESOP') MAPSET('S001043') ACCUM PAGING;            
                                                                                
        SISTE_SIDE = '1'B;                                                      
        GOTO OVERFLOW;                                                          
       END;                                                                     
                                                                                
     END;     /*  SELECT  */                                                    
                                                                                
                                                                                
     DOWHILE:                                                                   
        DO WHILE ('A' = 'A');                                                   
          CALL EN_BLANK_LINJE;                                                  
        END;                                                                    
                                                                                
                                                                                
     FYLL_EOAFP :                                                               
        PROC;                                                                   
                                                                                
      EOAFPO.INNTEKTSÅRO    = B01.EOAFP.INNTEKTSÅR(SØKER_IND,EO_I);             
      EOAFPO.PGIO          = B01.EOAFP.PGI        (SØKER_IND,EO_I);             
      EOAFPO.IFUO          = B01.EOAFP.IFU       (SØKER_IND,EO_I);              
      EOAFPO.IEOO          = B01.EOAFP.IEO       (SØKER_IND,EO_I);              
      EOAFPO.IIAPO         = B01.EOAFP.IIAP      (SØKER_IND,EO_I);              
      EOAFPO.FAIPO         = B01.EOAFP.FAIP      (SØKER_IND,EO_I);              
      EOAFPO.TEI_IAPO      = B01.EOAFP.TEI_IAP   (SØKER_IND,EO_I);              
      EOAFPO.PFPO          = B01.EOAFP.PFP       (SØKER_IND,EO_I);              
      EOAFPO.FPFPO         = B01.EOAFP.FPFP      (SØKER_IND,EO_I);              
      EOAFPO.DFMUO         = B01.EOAFP.DFMU      (SØKER_IND,EO_I);              
      EOAFPO.DFLUO         = B01.EOAFP.DFLU      (SØKER_IND,EO_I);              
  /*                                                                            
      EOAFPO.IFU_MERKEO = 'X';                                                  
      EOAFPO.IEO_MERKEO = 'X';                                                  
      EOAFPO.IIAP_MERKEO = 'X';                                                 
   */                                                                           
         EOAFPO.TEXT1O ='                   ';                                  
         EOAFPO.TEXT2O ='                   ';                                  
         EOAFPO.TEXT3O ='                   ';                                  
                                                                                
      IF B01.EOAFP.IFU_MERKE(SØKER_IND,EO_I) = 'B' THEN                         
         EOAFPO.TEXT1O ='BEREGNET          ';                                   
      IF B01.EOAFP.IFU_MERKE(SØKER_IND,EO_I) = 'R' THEN                         
         EOAFPO.TEXT1O ='REG. VIA INFOTRYGD';                                   
                                                                                
      IF B01.EOAFP.IEO_MERKE(SØKER_IND,EO_I) = 'B' THEN                         
         EOAFPO.TEXT2O ='BEREGNET          ';                                   
      IF B01.EOAFP.IEO_MERKE(SØKER_IND,EO_I) = 'R' THEN                         
         EOAFPO.TEXT2O ='REG. VIA INFOTRYGD';                                   
                                                                                
      IF B01.EOAFP.IIAP_MERKE(SØKER_IND,EO_I) = 'B' THEN                        
         EOAFPO.TEXT3O ='BEREGNET          ';                                   
      IF B01.EOAFP.IIAP_MERKE(SØKER_IND,EO_I) = 'R' THEN                        
         EOAFPO.TEXT3O ='REG. VIA INFOTRYGD';                                   
                                                                                
     END FYLL_EOAFP ;                                                           
                                                                                
     FYLL_STATUS:                                                               
        PROC;                                                                   
                                                                                
      STATUSO.VIRK_DATO_ÅMO = B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND)/100;          
                                                                                
      STATUSO.STAT_KODE_HISTO  = B01.STATUS_KODE_HIST     (SØKER_IND);          
      STATUSO.PENSJONSTYPE1O   = B01.STATUS.PENSJONSTYPE1 (SØKER_IND);          
      STATUSO.PENSJONSTYPE2O   = B01.STATUS.PENSJONSTYPE2 (SØKER_IND);          
      STATUSO.PENSJONSTYPE3O   = B01.STATUS.PENSJONSTYPE3 (SØKER_IND);          
      STATUSO.SIVILSTANDO      = B01.STATUS.SIVILSTAND    (SØKER_IND);          
      STATUSO.TT_FØR_1967O     = B01.STATUS.TT_FØR_1967   (SØKER_IND);          
      STATUSO.TT_ETTER_1966O   = B01.STATUS.TT_ETTER_1966 (SØKER_IND);          
      STATUSO.TT_FRAMTO        = B01.STATUS.TT_FRAMT      (SØKER_IND);          
      STATUSO.TT_67_TIL_70O    = B01.STATUS.TT_67_TIL_70  (SØKER_IND);          
      STATUSO.TT_ANVO          = B01.STATUS.TT_ANV        (SØKER_IND);          
      STATUSO.FØRSTE_GANG_REGO = B01.STATUS.FØRSTE_GANG_REG(SØKER_IND);         
                                                                                
      STATUSO.ANTALL_BARNTILLEGGO     =                                         
                                 B01.STATUS.ANTALL_BARN   (SØKER_IND);          
      STATUSO.DØDSDATO_ÅMDO    = B01.STATUS.DØDSDATO_ÅMD  (SØKER_IND);          
      STATUSO.VILKÅR_3_17AO   = B01.STATUS.VILKÅR_8_4_3A (SØKER_IND);           
      STATUSO.TT_GARANTIO      = B01.STATUS.TT_GARANTI    (SØKER_IND);          
      STATUSO.G_DATO_ÅMO       = B01.STATUS.G_DATO_ÅMD(SØKER_IND)/100;          
      STATUSO.P_TILLEGG_ÅMO = B01.POENGTILLEGG_DATO_ÅMD(SØKER_IND)/100;         
      STATUSO.P_TILLEGG_KODEO  = B01.POENGTILLEGG_KODE    (SØKER_IND);          
      STATUSO.TP_GAR_KODEO     = B01.STATUS.TP_GAR_KODE   (SØKER_IND);          
      STATUSO.SAMMENS_REG_1990O =                                               
                         B01.STATUS.GAMMEL_SAMMENSTØTS_REGEL(SØKER_IND);        
                                                                                
        IF B01.STATUS.DØD_AV_YRKESSKADE (SØKER_IND) = 'J' THEN                  
           STATUSO.YSKADE_DØDO   = 'J';                                         
        /* STATUSO.YSKADE_DØDO   = 'JA' IEL0892I W */                           
        IF B01.STATUS.DØD_AV_YRKESSKADE (SØKER_IND) = 'E' THEN                  
           STATUSO.YSKADE_ETTERLO = 'J';                                        
        /* STATUSO.YSKADE_ETTERLO = 'JA'IEL0892I W */                           
        IF B01.STATUS.DØD_AV_YRKESSKADE (SØKER_IND) = 'Y' THEN                  
           STATUSO.YSKADE_ETTERLO = 'Y';                                        
        /* STATUSO.YSKADE_ETTERLO = 'YA'IEL0892I W 9.10.89 HL*/                 
          STATUSO.PENSJONS_RETT_FØR_91O     =                                   
                                   B01.PENSJONSRETT_FØR_91(SØKER_IND);          
          PIC_ZZ9                = B01.STATUS.TT_16_66(SØKER_IND);              
          STATUSO.TT_16_66O      = PIC_ZZ9;                                     
          BR_F                   = B01.STATUS.GARANTI_TP(SØKER_IND);            
          STATUSO.GARANTI_TPO    = BR_F;                                        
                                                                                
  STATUSO.GARANTI_DATO_ÅMO = B01.STATUS.GARANTI_DATO_ÅMD(SØKER_IND)/100;        
        STATUSO.GT_LOV92O        = B01.STATUS.GT_LOV92  (SØKER_IND);            
        STATUSO.GT_TIL_LOV92O  = B01.STATUS.GT_TILLEGG_LOV92(SØKER_IND);        
                                                                                
        STATUSO.YRKES_KODEO     = B01.STATUS.YRKES_KODE (SØKER_IND);            
                                                                                
        STATUSO.FRYSDATO_ÅMO = B01.STATUS.FRYSDATO_ÅMD(SØKER_IND)/100;          
        STATUSO.FRIINNTEKT_DATO_ÅMdO =                                          
                    B01.STATUS.FRIINNTEKT_DATO_ÅMD(SØKER_IND);                  
      STATUSO.EK_INNT_OVER_2GO = B01.STATUS.EK_INNT_OVER_2G(SØKER_IND);         
                                                                                
        IF B01.STATUS.FRYSKODE   (SØKER_IND) = '1' THEN                         
           DO;                                                                  
              IF (B01.STATUS.FRYSDATO_ÅMD(SØKER_IND) > 20030101) THEN           
                 IF (F_ALDER(B01.FNR(SØKER_IND),                                
                     B01.STATUS.FRYSDATO_ÅMD(SØKER_IND)) > 6000) THEN           
                    STATUSO.FRYSKODEO = ' FRAM TIL 67 ÅR     ' ;                
                 ELSE                                                           
                    STATUSO.FRYSKODEO = ' FRYSPERIODE 5 ÅR' ;                   
              ELSE                                                              
                 STATUSO.FRYSKODEO = ' FRYSPERIODE 3 ÅR' ;                      
           END;                                                                 
        ELSE                                                                    
        IF B01.STATUS.FRYSKODE   (SØKER_IND) = '2' THEN                         
           STATUSO.FRYSKODEO = 'ARB.TREN/FORLENGELSE' ;                         
        ELSE                                                                    
           STATUSO.FRYSKODEO = '                    ' ;                         
                                                                                
        STATUSO.RED_GP_3_2_5O   = B01.STATUS.RED_GP_3_2_5(SØKER_IND);           
                                                                                
        IF B01.STATUS.GP_REDUKSJON_KODE(SØKER_IND) = 'I'  THEN                  
           DO;                                                                  
               IF B01.STATUS.SIVILSTAND(SØKER_IND) = 'P' THEN                   
                   STATUSO.GP_REDUKSJON_KODEO =                                 
                  'GP REDUSERT FORDI PARTNER HAR INNTEKT OVER 2G   ';           
              ELSE                                                              
                    STATUSO.GP_REDUKSJON_KODEO =                                
                  'GP REDUSERT FORDI EKTEFELLE HAR INNTEKT OVER 2G   ';         
           END;                                                                 
        ELSE                                                                    
        IF  B01.STATUS.GP_REDUKSJON_KODE(SØKER_IND) = 'J'  THEN                 
            DO;                                                                 
               IF B01.STATUS.SIVILSTAND(SØKER_IND) = 'P' THEN                   
                  STATUSO.GP_REDUKSJON_KODEO =                                  
                   'GP REDUSERT FORDI PARTNER HAR PENSJON             ';        
               ELSE                                                             
                  STATUSO.GP_REDUKSJON_KODEO =                                  
                   'GP REDUSERT FORDI EKTEFELLE HAR PENSJON           ';        
            END;                                                                
        ELSE                                                                    
        IF  B01.STATUS.GP_REDUKSJON_KODE(SØKER_IND) = 'Y'       THEN            
            STATUSO.GP_REDUKSJON_KODEO =                                        
                'GP REDUSERT FORDI SAMBOER HAR PENSJON             ';           
        ELSE                                                                    
        IF  B01.STATUS.GP_REDUKSJON_KODE(SØKER_IND) = 'Z'       THEN            
            STATUSO.GP_REDUKSJON_KODEO =                                        
                'GP REDUSERT FORDI SAMBOER HAR INNTEKT OVER 2G     ';           
    /*  ELSE                                                                    
        IF  B01.STATUS.GP_REDUKSJON_KODE(SØKER_IND) = 'X'       THEN            
            STATUSO.GP_REDUKSJON_KODEO =                                        
                'GP REDUSERT PGA § 3-2 5. LEDD                     ';*/         
        ELSE                                                                    
            STATUSO.GP_REDUKSJON_KODEO =                                        
                '                                                   ';          
                                                                                
      STATUSO.UNNTAK_3_2_4O = B01.STATUS.PENSJON_FØR_9802(SØKER_IND);           
                                                                                
     END FYLL_STATUS;                                                           
                                                                                
                                                                                
     FYLL_ALDER:                                                                
        PROC;                                                                   
                                                                                
    ALDERSPO.SPTO               = B01.ALDERSP.SPT          (SØKER_IND);         
    ALDERSPO.OPTO               = B01.ALDERSP.OPT          (SØKER_IND);         
    ALDERSPO.PÅO                = B01.ALDERSP.PÅ           (SØKER_IND);         
    ALDERSPO.PÅ_FØR92O          = B01.ALDERSP.PÅ(SØKER_IND)   -                 
                                  B01.ALDERSP.PÅ_ETTER91(SØKER_IND);            
                                                                                
    ALDERSPO.PÅ_ETTER_91O       = B01.ALDERSP.PÅ_ETTER91(SØKER_IND);            
                                                                                
                                                                                
    ALDERSPO.BEREGN_ALT_AEYO    = B01.ALDERSP.BEREGN_ALT_AEY(SØKER_IND);        
    ALDERSPO.FAIO               = B01.ALDERSP.FAI (SØKER_IND) * 100 ;           
    ALDERSPO.FAI_DATO_ÅMDO      =                                               
                             B01.ALDERSP.FAI_DATO_ÅMD (SØKER_IND)/100;          
    ALDERSPO.AP_TEI_FAKTORO     = B01.ALDERSP.AP_TEI_FAKTOR(SØKER_IND);         
    /* MARTIN */                                                                
    TEI_F = 0;                                                                  
    IF (B01.ALDERSP.AP_TEI_FAKTOR(SØKER_IND) > 0) THEN                          
    /* IF B01.PENSJONSTYPE1(SØKER_IND) = 'K' THEN */                            
          DO;                                                                   
             W_TEI_FAKTOR = B01.ALDERSP.AP_TEI_FAKTOR(SØKER_IND);               
             DO I = 1 TO HBOUND(G_TAB_PERIODE)                                  
                      UNTIL (PERIODE_START_ÅMD(I)       =                       
                                   B01.G_DATO_ÅMD(SØKER_IND)+1);                
             END;                                                               
             TEI_F = W_TEI_FAKTOR * GRUNNBELØP(I);                              
             TEI_F = TEI_F + 999;                                               
             TEI_F = TEI_F / 1000;                                              
             TEI_F = TEI_F * 1000;                                              
          END;                                                                  
    IF TEI_F > 999999 THEN TEI_F = 999998;                                      
    ALDERSPO.TEI_BELØPO         = TEI_F;  /*    TESTING  */                     
    ALDERSPO.AFP_BUPO           = B01.ALDERSP.AFP_BUP      (SØKER_IND);         
    ALDERSPO.VT_SPTO            = B01.ALDERSP.VT_SPT       (SØKER_IND);         
    ALDERSPO.VT_OPTO            = B01.ALDERSP.VT_OPT       (SØKER_IND);         
    ALDERSPO.SPT_1291O          = B01.ALDERSP.SPT_1291     (SØKER_IND);         
    ALDERSPO.OPT_1291O          = B01.ALDERSP.OPT_1291     (SØKER_IND);         
    ALDERSPO.VT_PÅO             = B01.ALDERSP.VT_PÅ        (SØKER_IND);         
    ALDERSPO.PÅ_1291O           = B01.ALDERSP.PÅ_1291      (SØKER_IND);         
    ALDERSPO.TT_VENTO           = B01.ALDERSP.TT_VENT      (SØKER_IND);         
    ALDERSPO.UTTAKSDATO_ÅMDO =                                                  
                       B01.ALDERSP.UTTAKSDATO_ÅMD(SØKER_IND)/100;               
    ALDERSPO.UTTAKS_APDO        = B01.ALDERSP.UTTAKS_APD   (SØKER_IND);         
    ALDERSPO.UTTAKSDATO_ÅMD_ØVR1O =                                             
                            B01.UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,1)/100;         
    ALDERSPO.UTTAKSDATO_ÅMD_ØVR2O =                                             
                            B01.UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,2)/100;         
    ALDERSPO.UTTAKSDATO_ÅMD_ØVR3O =                                             
                            B01.UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,3)/100;         
    ALDERSPO.UTTAKSDATO_ÅMD_ØVR4O =                                             
                            B01.UTTAKSDATO_ÅMD_ØVRIGE(SØKER_IND,4)/100;         
    ALDERSPO.APD_ØVR1O          = B01.ALDERSP.APD_ØVRIGE(SØKER_IND,1);          
    ALDERSPO.APD_ØVR2O          = B01.ALDERSP.APD_ØVRIGE(SØKER_IND,2);          
    ALDERSPO.APD_ØVR3O          = B01.ALDERSP.APD_ØVRIGE(SØKER_IND,3);          
    ALDERSPO.APD_ØVR4O          = B01.ALDERSP.APD_ØVRIGE(SØKER_IND,4);          
                                                                                
    ALDERSPO.VENTEFAKTORO       = B01.ALDERSP.VENTEFAKTOR  (SØKER_IND);         
    ALDERSPO.KONV_P_KODEO       = B01.ALDERSP.KONV_P_KODE  (SØKER_IND);         
    ALDERSPO.KONV_GRADO         = B01.ALDERSP.KONV_GRAD    (SØKER_IND);         
                                                                                
                                                                                
     END FYLL_ALDER;                                                            
     /* ------------------------------------------------------------- */        
     FYLL_AFP  : PROC;                                                          
                                                                                
   /* DO K = 1 TO 17 WHILE(B01.AFPHIST.AFPDATO_ÅMD(SØKER_IND,K)> 0); */         
      DO K = AFP_START TO  AFP_SLUTT                                            
                     WHILE(B01.AFPHIST.AFPDATO_ÅMD(SØKER_IND,K)> 0);            
                                 /* AFP DATO KONVERTERES TIL MM.HHÅÅ */         
         KX = K; /* KX ER BILDE INDEX OG KAN IKKE EN 17 */                      
         IF AFP_START > 17 THEN                                                 
            KX = KX - 17;                                                       
                                                                                
         AFPO.AFPDATO_MÅO(KX) =                                                 
             KONV_HÅMD_MHÅ((B01.AFPHIST.AFPDATO_ÅMD(SØKER_IND,K)));             
                                                                                
                                            /* TEI FAKTOR SKRIVES UT */         
         AFPO.TEI_FAKTORO (KX) = B01.AFPHIST.TEI_FAKTOR(SØKER_IND,K);           
                                                                                
                                 /* TEI BELØP BEREGNES OG SKRIVES UT */         
     /*  DO I = 1 TO 60 UNTIL (PERIODE_START_ÅMD(I)       =                     
                               B01.G_DATO_ÅMD(SØKER_IND)+1)  */                 
                          /*  ENDRET OVENSTÅENDE DEN 17.07.01 MARTIN */         
         DO I = 1 TO HBOUND(G_TAB_PERIODE)                                      
                  UNTIL (PERIODE_START_ÅMD(I)       >                           
                               B01.AFPHIST.AFPDATO_ÅMD(SØKER_IND,K)+1);         
         END;                                                                   
         I = I - 1;                            /* MY 17.07.01 MARTIN */         
         W_TEI_FAKTOR = B01.AFPHIST.TEI_FAKTOR(SØKER_IND,K);                    
         TEI_F = W_TEI_FAKTOR * GRUNNBELØP(I);                                  
         TEI_F = TEI_F + 999;                                                   
         TEI_F = TEI_F / 1000;                                                  
         TEI_F = TEI_F * 1000;                                                  
         AFPO.TEI_BELØPO  (KX) = TEI_F;                                         
                                                                                
                                        /* FEI BEREGNES OG SKIVES UT */         
         AFPO.FEI_I_100KRO (KX)   =                                             
            B01.AFPHIST.FEI_I_100KR(SØKER_IND,K) * 100;                         
                                                                                
                                     /* RESTEN HENTES RETT FRA BASEN */         
         AFPO.GRAD_UTBETO (KX) = B01.AFPHIST.GRAD_UTBET (SØKER_IND,K);          
         AFPO.FULL_AFPO   (KX) = B01.AFPHIST.FULL_AFP (SØKER_IND,K);            
         AFPO.RED_AFPO    (KX) = B01.AFPHIST.RED_AFP (SØKER_IND,K);             
         AFPO.ET_REGO     (KX) = B01.AFPHIST.ET_REG (SØKER_IND,K);              
      END;                                                                      
     END FYLL_AFP  ;                                                            
                                                                                
                                                                                
     FYLL_FORSI:                                                                
        PROC;                                                                   
                                                                                
    FORSIO.ARB_INNTEKTO = B01.FORSI.ARBEIDSINNTEKT(SØKER_IND) * 100;            
    FORSIO.PEN_INNTEKTO = B01.FORSI.PENSJONSINNTEKT(SØKER_IND) * 100;           
    FORSIO.ARB_INNTEKT_EKO =                                                    
                        B01.FORSI.ARBEIDSINNTEKT_EK(SØKER_IND) * 100;           
    FORSIO.PEN_INNTEKT_EKO =                                                    
                        B01.FORSI.PENSJONSINNTEKT_EK(SØKER_IND) * 100;          
                                                                                
     END FYLL_FORSI;                                                            
                                                                                
 /* ----------------------------------------------------------------- */        
    FYLL_UFØR:PROC;                                                             
       UFØRPO.UFGO           = B01.UFØRPENS.UFG     (SØKER_IND);                
       UFØRPO.VILKÅR_3_17AO = B01.UFØRPENS.VILKÅR_8_4_3A                        
                                                     (SØKER_IND);               
       UFØRPO.UNNTAK_12_2O   = B01.UFØRPENS.VILKÅR_8_1B                         
                                                     (SØKER_IND);               
       UFØRPO.ÅFTO           = B01.UFØRPENS.ÅFT     (SØKER_IND);                
       UFØRPO.SPTO           = B01.UFØRPENS.SPT     (SØKER_IND);                
       UFØRPO.OPTO           = B01.UFØRPENS.OPT     (SØKER_IND);                
       UFØRPO.PÅO            = B01.UFØRPENS.PÅ      (SØKER_IND);                
       UFØRPO.UTDANNINGO     = B01.UFØRPENS.UTDANNING(SØKER_IND);               
   /*  UFØRPO.GARANTERT_TPO  = B01.UFØRPENS.GARANTERT_TP(SØKER_IND);*/          
       UFØRPO.YRKESM_ATTFO   = B01.UFØRPENS.YRKESM_ATTF(SØKER_IND);             
       UFØRPO.STIO           = B01.UFØRPENS.STI_ÅMD(SØKER_IND)/100;             
                                                                                
       UFØRPO.INNTEKT_FØR_UPO =                                                 
                          B01.UFØRPENS.INNTEKT_FØR_UP(SØKER_IND) * 100;         
                                                                                
       UFØRPO.SPT_1291O      = B01.UFØRPENS.SPT_1291 (SØKER_IND);               
       UFØRPO.OPT_1291O      = B01.UFØRPENS.OPT_1291 (SØKER_IND);               
       UFØRPO.PÅ_1291O       = B01.UFØRPENS.PÅ_1291 (SØKER_IND);                
       UFØRPO.PÅ_ETTER91O    = B01.UFØRPENS.PÅ_ETTER91 (SØKER_IND);             
       UFØRPO.INNT_DATO_ÅMO = B01.UFØRPENS.INNT_DATO_ÅMD(SØKER_IND)/100;        
       UFØRPO.GARANTIGRADO  = B01.UFØRPENS.GARANTIGRAD(SØKER_IND);              
                                                                                
       IF (B01.UFØRPENS.UFG(SØKER_IND) > 0 !                                    
           B01.YRKEPENS.YUG(SØKER_IND) > 0 ) THEN                               
          DO;  /* HAR UFØREPENSJON */                                           
            SELECT(B01.UFØRPENS.INNTEKTSKODE2(SØKER_IND));                      
              WHEN('0')                                                         
                 DO;                                                            
                    IF (B01.INNTEKTSKODE1(SØKER_IND) = 'A') THEN                
                       UFØRPO.TEXT_INNTO = 'A0 LØNNSTILSKUDD';                  
                    ELSE                                                        
                       UFØRPO.TEXT_INNTO =                                      
                          B01.INNTEKTSKODE1(SØKER_IND) !!                       
                          '0 INNT.GR. KAN IKKE BEREGNES';                       
                 END;                                                           
              WHEN('1')                                                         
                 UFØRPO.TEXT_INNTO =                                            
                    B01.INNTEKTSKODE1(SØKER_IND) !!                             
                    B01.INNTEKTSKODE2(SØKER_IND) !!                             
                    ' INNTEKTGR EKSKL FRIINNTEKT';                              
              WHEN('2')                                                         
                 DO;                                                            
                    IF (B01.INNTEKTSKODE1(SØKER_IND) = '5') THEN                
                       DO;                                                      
                          UFØRPO.TEXT_INNTO =                                   
                             '52 INNTEKTGR REAKTIVISERING  ';                   
                       END;                                                     
                    ELSE                                                        
                       UFØRPO.TEXT_INNTO =                                      
                          B01.INNTEKTSKODE1(SØKER_IND) !!                       
                          B01.INNTEKTSKODE2(SØKER_IND) !!                       
                          ' INNTEKTGR INKL FRIINNTEKT ';                        
                 END;                                                           
              WHEN('3')                                                         
                 UFØRPO.TEXT_INNTO =                                            
                    B01.INNTEKTSKODE1(SØKER_IND) !!                             
                    B01.INNTEKTSKODE2(SØKER_IND) !!                             
                    ' INNTEKTGR U/FRIINNT M/TAK';                               
              WHEN('4')                                                         
                 UFØRPO.TEXT_INNTO =                                            
                    B01.INNTEKTSKODE1(SØKER_IND) !!                             
                    B01.INNTEKTSKODE2(SØKER_IND) !!                             
                    ' INNTEKTGR M/FRIINNT M/TAK';                               
              WHEN('5')                                                         
                 UFØRPO.TEXT_INNTO =                                            
                    B01.INNTEKTSKODE1(SØKER_IND) !!                             
                    B01.INNTEKTSKODE2(SØKER_IND) !!                             
                    ' INNTEKTGR EKSKL FRIINTEKT ';                              
              WHEN('6')                                                         
                 UFØRPO.TEXT_INNTO =                                            
                    B01.INNTEKTSKODE1(SØKER_IND) !!                             
                    B01.INNTEKTSKODE2(SØKER_IND) !!                             
                    ' INNTEKTGR INKL FRIINNTEKT ';                              
              OTHER;                                                            
            END; /* SELECT INNTEKTSKODE2 */                                     
              INNTEKTSGR  = B01.UFØRPENS.LOVLIG_INNTEKT(SØKER_IND);             
              UFØRPO.B_LOVLIG_INNTEKO = INNTEKTSGR;                             
          END; /* HAR UFØREPENSJON */                                           
       ELSE                                                                     
          IF (B01.INNTEKTSKODE1(SØKER_IND)= '8' &                               
              B01.INNTEKTSKODE2(SØKER_IND)= '0' ) THEN                          
             DO;                                                                
                UFØRPO.TEXT_INNTO =                                             
                   B01.INNTEKTSKODE1(SØKER_IND) !!                              
                   '0 INNT.GR. KAN IKKE BEREGNES';                              
                UFØRPO.B_LOVLIG_INNTEKO = INNTEKTSGR;                           
             END;                                                               
    END FYLL_UFØR;                                                              
 /* ----------------------------------------------------------------- */        
                                                                                
                                                                                
                                                                                
     FYLL_UFØRHIST:                                                             
        PROC;                                                                   
                                                                                
    /*  DCL   TAB7   (7)   CHAR (3);    JFA */                                  
        DCL   TAB12  (12)  CHAR (3);   /* JFA */                                
        DCL   HTAB         PIC 'Z99';                                           
                                                                                
        DO  K = 1 TO 12;                                                        
            IF  B01.UFG_DATO_ÅMD (SØKER_IND,I,K) > 0 &                          
                B01.UFG_ØVRIGE  (SØKER_IND,I,K) = 0   THEN                      
                TAB12 (K)              = '  0';                                 
         ELSE                                                                   
            IF  B01.UFG_DATO_ÅMD (SØKER_IND,I,K) > 0 &                          
                B01.UFG_ØVRIGE   (SØKER_IND,I,K) > 0   THEN                     
                DO;                                                             
                   HTAB           = B01.UFG_ØVRIGE (SØKER_IND,I,K);             
                   TAB12 (K)      = HTAB;                                       
                END;                                                            
                                                                                
          ELSE                                                                  
            IF  B01.UFG_DATO_ÅMD (SØKER_IND,I,K) = 0 THEN                       
                TAB12 (K)       = '   ';                                        
        END;                                                                    
        DO K = 1 TO 12;                                                         
           UFØRHO.UFG_ØVRIGEO(K)   = TAB12 (K);                                 
           UFØRHO.UFG_DATO_ÅMO(K)= B01.UFG_DATO_ÅMD(SØKER_IND,I,K)/100;         
                                                                                
           UFØRHO.YNGSTE_BARN_FÅR_GRADO(K) =                                    
                    B01.YNGSTE_BARN_FÅR_GRAD(SØKER_IND,I,K);                    
                                                                                
           UFØRHO.VIRK_UFØRGRAD_ÅMO(K) =                                        
                    B01.VIRK_UFØRGRAD_ÅMD(SØKER_IND,I,K)/100;                   
                                                                                
           UFØRHO.FRIINNTEKT_FRA_GRAD_ÅMO(K) =                                  
              B01.UFØRHIST.FRIINNTEKT_FRA_GRAD_ÅMD(SØKER_IND,I,K)/100;          
        END;                                                                    
                                                                                
        UFØRHO.UFT_ÅMO        = B01.UFØRHIST.UFT_ÅMD(SØKER_IND,I)/100;          
        UFØRHO.UFGO           = B01.UFØRHIST.UFG     (SØKER_IND,I);             
                                                                                
        SELECT(B01.UFØRHIST.UFKRITERIER(SØKER_IND,I));                          
           WHEN(1)                                                              
              UFØRHO.UFKRITERIERO =                                             
                 'Inntekt > G etter 1966              ';                        
           WHEN(2)                                                              
              UFØRHO.UFKRITERIERO =                                             
                 'Inntekt > G ved uførhet             ';                        
           WHEN(3)                                                              
              UFØRHO.UFKRITERIERO =                                             
                 'Inntekt > G ved ufør / etter 1966   ';                        
           WHEN(4)                                                              
              UFØRHO.UFKRITERIERO =                                             
                 'Løpende uførepensjon ved yrkesskade ';                        
           WHEN(5)                                                              
              UFØRHO.UFKRITERIERO =                                             
                 'Engangsutløst UP ved yrkesskade     ';                        
           OTHER                                                                
              UFØRHO.UFKRITERIERO =                                             
                 '                                    ';                        
        END; /* SELECT B01.UFØRHIST.UFKRITERIER */                              
        UFØRHO.BUPO           = B01.UFØRHIST.BUP     (SØKER_IND,I);             
        UFØRHO.BUP_GARANTIO   = B01.UFØRHIST.BUP_GARANTI(SØKER_IND,I);          
        IF B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,I) = 'A' THEN                    
        UFØRHO.BUP_GAR_KODEO  = 'Ung ufør, venter på 3.50            ';         
        ELSE                                                                    
        IF B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,I) = 'B' THEN                    
        UFØRHO.BUP_GAR_KODEO  = 'Ung ufør med rett til 3.50          ';         
        ELSE                                                                    
        IF B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,I) = 'C' THEN                    
        UFØRHO.BUP_GAR_KODEO  = 'Ung ufør ved 20 år, venter          ';         
        ELSE                                                                    
        IF B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,I) = 'D' THEN                    
         UFØRHO.BUP_GAR_KODEO  = 'Ung ufør med rett til 3.50 fra 0592';         
        ELSE                                                                    
        IF B01.UFØRHIST.BUP_GAR_KODE(SØKER_IND,I) = 'E' THEN                    
         UFØRHO.BUP_GAR_KODEO  = 'Ung ufør før 1967                  ';         
        ELSE                                                                    
         UFØRHO.BUP_GAR_KODEO  = '                                   ';         
                                                                                
        UFØRHO.OPPHØRSDATO_ÅMO= B01.OPPHØRSDATO_ÅMD(SØKER_IND,I)/100;           
        UFØRHO.OPPHØRSKODEO   = B01.OPPHØRSKODE      (SØKER_IND,I);             
                                                                                
        UFØRHO.REDUST_BUP_ÅRO = B01.REDUSERT_ANT_BUP_ÅR(SØKER_IND,I);           
                                                                                
        UFØRHO.YNGSTE_BARN_FÅR_HISTO =                                          
                    B01.YNGSTE_BARN_FÅR_HIST(SØKER_IND,I);                      
        UFØRHO.VIRK_UFØRHIST_ÅMO =                                              
                    B01.VIRK_UFØRHIST_ÅMD(SØKER_IND,I)/100;                     
        UFØRHO.FRIINNTEKT_FRA_HIST_ÅMO =                                        
              B01.UFØRHIST.FRIINNTEKT_FRA_HIST_ÅMD(SØKER_IND,I)/100;            
                                                                                
     END FYLL_UFØRHIST;                                                         
                                                                                
                                                                                
                                                                                
       FYLL_YSKADE:                                                             
        PROC;                                                                   
                                                                                
        YRKEPO.YUGO           = B01.YRKEPENS.YUG     (SØKER_IND);               
        YRKEPO.YPTO           = B01.YRKEPENS.YPT     (SØKER_IND);               
        YRKEPO.SPTO           = B01.YRKEPENS.SPT     (SØKER_IND);               
        YRKEPO.PÅO            = B01.YRKEPENS.PÅ      (SØKER_IND);               
        YRKEPO.YPT_KODEO      = B01.YRKEPENS.YPT_KODE(SØKER_IND);               
        YRKEPO.YSYKDOMO       = B01.YRKEPENS.YSYKDOM(SØKER_IND);                
                                                                                
        YRKEPO.PÅ_ETTER91O    = B01.YRKEPENS.PÅ_ETTER91(SØKER_IND);             
        YRKEPO.YRKE_POENG_1291O  =                                              
                               B01.YRKEPENS.YRKE_POENG_1291(SØKER_IND);         
                                                                                
       END FYLL_YSKADE;                                                         
                                                                                
                                                                                
       FYLL_YRKEHIST:                                                           
        PROC;                                                                   
                                                                                
        DCL W01_VILKÅR_1_2_2      CHAR (2);                                     
        DCL W01_VILKÅR_1_2_2A  DEF(W01_VILKÅR_1_2_2) POS(1)  CHAR (1);          
        DCL W01_VILKÅR_1_2_2B  DEF(W01_VILKÅR_1_2_2) POS(2)  CHAR (1);          
                                                                                
        YRKEHO.YUFT_ÅMO   = B01.YRKEHIST.YUFT_ÅMD(SØKER_IND,I)/100;             
        YRKEHO.YUGO       = B01.YRKEHIST.YUG     (SØKER_IND,I);                 
        YRKEHO.YST_ÅMO    = B01.YRKEHIST.YST_ÅMD (SØKER_IND,I)/100;             
        YRKEHO.AÅIO           = B01.YRKEHIST.AÅI(SØKER_IND,I);                  
        YRKEHO.PAÅO           = B01.YRKEHIST.PAÅ(SØKER_IND,I);                  
        YRKEHO.YRKE11O        = B01.YRKEHIST.YRKE11  (SØKER_IND,I);             
        W01_VILKÅR_1_2_2      = B01.YRKEHIST.VILKÅR_1_2_2(SØKER_IND,I);         
        YRKEHO.VILKÅR_2_6AO = W01_VILKÅR_1_2_2A;                                
        YRKEHO.VILKÅR_2_6BO = W01_VILKÅR_1_2_2B;                                
        YRKEHO.KAP_11_7_UTLØSTO =                                               
                             B01.YRKEHIST.KAP_11_7_UTLØST(SØKER_IND,I);         
        YRKEHO.OPPHØRSDATO_ÅMO= B01.OPPH_DATO_ÅMD(SØKER_IND,I)/100;             
        YRKEHO.OPPHØRSKODEO   = B01.OPPH_KODE        (SØKER_IND,I);             
        YRKEHO.YUG_DATO_ÅM1O  = B01.YUG_DATO_ÅMD (SØKER_IND,I,1)/100;           
        YRKEHO.YUG_ØVRIGE1O   = B01.YUG_ØVRIGE       (SØKER_IND,I,1);           
        YRKEHO.YUG_DATO_ÅM2O  = B01.YUG_DATO_ÅMD (SØKER_IND,I,2)/100;           
        YRKEHO.YUG_ØVRIGE2O   = B01.YUG_ØVRIGE       (SØKER_IND,I,2);           
        YRKEHO.YUG_DATO_ÅM3O  = B01.YUG_DATO_ÅMD (SØKER_IND,I,3)/100;           
        YRKEHO.YUG_ØVRIGE3O   = B01.YUG_ØVRIGE       (SØKER_IND,I,3);           
        YRKEHO.YUG_DATO_ÅM4O  = B01.YUG_DATO_ÅMD (SØKER_IND,I,4)/100;           
        YRKEHO.YUG_ØVRIGE4O   = B01.YUG_ØVRIGE   (SØKER_IND,I,4);               
 /*  femte plass er ikke i bruk pga feil programmering i oppdatering av         
      uføregrad segment ........                                                
        YRKEHO.YUG_DATO_ÅM5O  = B01.YUG_DATO_ÅMD (SØKER_IND,I,5)/100;           
        YRKEHO.YUG_ØVRIGE5O   = B01.YUG_ØVRIGE       (SØKER_IND,I,5);           
  */                                                                            
       END FYLL_YRKEHIST;                                                       
                                                                                
                                                                                
     FYLL_ETTERLATT:                                                            
        PROC;                                                                   
                                                                                
        ETTEPENO.OMSORG_AVD_BAO  = B01.OMSORG_AVD_BA      (SØKER_IND);          
        ETTEPENO.SPT_AVDO        = B01.ETTEPENS.SPT_AVD   (SØKER_IND);          
        ETTEPENO.OPT_AVDO        = B01.ETTEPENS.OPT_AVD   (SØKER_IND);          
        ETTEPENO.PÅ_AVDO         = B01.ETTEPENS.PÅ_AVD    (SØKER_IND);          
        ETTEPENO.TP_PROSENTO     = B01.ETTEPENS.TP_PROSENT(SØKER_IND);          
        ETTEPENO.FORVENTETO      = B01.ETTEPENS.FORVENTET (SØKER_IND)           
                                                               *  100;          
        ETTEPENO.FRADRAG_2GO =   B01.ETTEPENS.FRADRAG_2G(SØKER_IND);            
                                                                                
        ETTEPENO.FRAMLEGGSDATO_ÅMO =                                            
                         B01.ETTEPENS.FRAMLEGGSDATO_ÅMD(SØKER_IND)/100;         
        ETTEPENO.FRAMLEGGSKODEO  =                                              
                                 B01.ETTEPENS.FRAMLEGGSKODE(SØKER_IND);         
        ETTEPENO.STIO          = B01.ETTEPENS.STI_ÅMD(SØKER_IND)/100;           
                                                                                
        ETTEPENO.SPT_1291O       = B01.ETTEPENS.SPT_1291 (SØKER_IND);           
        ETTEPENO.OPT_1291O       = B01.ETTEPENS.OPT_1291 (SØKER_IND);           
        ETTEPENO.PÅ_1291O        = B01.ETTEPENS.PÅ_1291 (SØKER_IND);            
        ETTEPENO.PÅ_ETTER91O     = B01.ETTEPENS.PÅ_ETTER91(SØKER_IND);          
                                                                                
     END FYLL_ETTERLATT;                                                        
                                                                                
                                                                                
     FYLL_ETTEBARN:                                                             
        PROC;                                                                   
                                                                                
      ETTEBAO.PE_KODEO   = B01.ETTEBARN.PENSJON_ETTER  (SØKER_IND);             
      ETTEBAO.SPT_MORO        = B01.ETTEBARN.SPT_MOR   (SØKER_IND);             
      ETTEBAO.OPT_MORO        = B01.ETTEBARN.OPT_MOR   (SØKER_IND);             
      ETTEBAO.PÅ_MORO         = B01.ETTEBARN.PÅ_MOR    (SØKER_IND);             
      ETTEBAO.SPT_FARO        = B01.ETTEBARN.SPT_FAR   (SØKER_IND);             
      ETTEBAO.OPT_FARO        = B01.ETTEBARN.OPT_FAR   (SØKER_IND);             
      ETTEBAO.PÅ_FARO         = B01.ETTEBARN.PÅ_FAR    (SØKER_IND);             
                                                                                
      ETTEBAO.SPT_1291_MORO  = B01.ETTEBARN.SPT_1291_MOR (SØKER_IND);           
      ETTEBAO.OPT_1291_MORO  = B01.ETTEBARN.OPT_1291_MOR (SØKER_IND);           
      ETTEBAO.PÅ_1291_MORO   = B01.ETTEBARN.PÅ_1291_MOR (SØKER_IND);            
      ETTEBAO.PÅ_ETTER91_MORO  =                                                
                            B01.ETTEBARN.PÅ_ETTER91_MOR (SØKER_IND);            
                                                                                
      ETTEBAO.SPT_1291_FARO  = B01.ETTEBARN.SPT_1291_FAR (SØKER_IND);           
      ETTEBAO.OPT_1291_FARO  = B01.ETTEBARN.OPT_1291_FAR (SØKER_IND);           
      ETTEBAO.PÅ_1291_FARO   = B01.ETTEBARN.PÅ_1291_FAR (SØKER_IND);            
      ETTEBAO.PÅ_ETTER91_FARO  =                                                
                            B01.ETTEBARN.PÅ_ETTER91_FAR (SØKER_IND);            
                                                                                
     END FYLL_ETTEBARN;                                                         
                                                                                
                                                                                
     FYLL_EØSINFO:                                                              
        PROC;                                                                   
                                                                                
    EØSINF1O.BEREGN_FOLKETRYO  = B01.BEREGN_FOLKETRYGD(SØKER_IND);              
    EØSINF1O.PRO_RATA_BEREGNO  = B01.PRO_RATA_BEREGNING (SØKER_IND);            
                                                                                
    EØSINF1O.TT_PRO_RATA_MNDO  = B01.TT_PRO_RATA_MND (SØKER_IND);               
    EØSINF1O.TT_TEO_EØS_MNDO   = B01.TT_TEORETISK_EØS_MND (SØKER_IND);          
                                                                                
                                                                                
                                                                                
    EØSINF1O.GJSNITT_EØS_PO    = B01.SPT_EØS(SØKER_IND);                        
    EØSINF1O.GJ_EØS_P_LOV92O   = B01.OPT_EØS(SØKER_IND);                        
                                                                                
    EØSINF1O.EØS_3_17AO       = B01.EØS_8_4_3A         (SØKER_IND);             
    EØSINF1O.ANT_NORSK_ETT91O =                                                 
                          B01.ANTALL_NORSKE_PÅ_ETTER91(SØKER_IND);              
                                                                                
                                                                                
    EØSINF1O.ALTERNATIV_GPO    = B01.ALTERNATIV_GP   (SØKER_IND);               
    EØSINF1O.ALTERNATIV_TPO    = B01.ALTERNATIV_TP   (SØKER_IND);               
    EØSINF1O.ALTERNATIV_BTO    = B01.ALTERNATIV_BT   (SØKER_IND);               
    EØSINF1O.ALTERNATIV_ETO    = B01.ALTERNATIV_ET   (SØKER_IND);               
    EØSINF1O.ALTERNATIV_STO    = B01.ALTERNATIV_ST   (SØKER_IND);               
    EØSINF1O.ALTERNATIV_SUMO  = B01.ALTERNATIV_SUM_PENSJON (SØKER_IND);         
                                                                                
    PIC_3                      = B01.ANTALL_NORSKE_PÅ (SØKER_IND);              
    EØSINF1O.ANTT_NORSK_PÅRO  = PIC_3;                                          
    PIC_7                      = B01.PENSJON_EØS      (SØKER_IND);              
    EØSINF1O.PENSJON_EØSO      = PIC_7;                                         
                                                                                
    EØSINF1O.TT_FAKTISK_NORSK_MNDO =                                            
                                  B01.TT_FAKTISK_NORSK_MND (SØKER_IND);         
    DO K = 1   TO HBOUND(EØSINF1O.INTEKTSÅR_EØSO);                              
       EØSINF1O.INTEKTSÅR_EØSO (K)  = '00' ;                                    
    END;                                                                        
                                                                                
    L = 1;                                                                      
    DO K = 1967  TO HBOUND(B01.INNTEKTSÅR_EØS,2);                               
       IF B01.INNTEKTSÅR_EØS (SØKER_IND, K ) = '1'B THEN                        
          DO;                                                                   
              H_ÅR4   =  K;                                                     
              IF L > 40 THEN L = 40;                                            
                                                                                
              EØSINF1O.INTEKTSÅR_EØSO (L)  = H_ÅR4 ;                            
              L = L + 1;                                                        
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
                                                                                
    END  FYLL_EØSINFO;                                                          
                                                                                
     FYLL_EØSINF2:  PROC;                                                       
                                                                                
        DCL PIC3     PIC '999';                                                 
        DCL PIC6     PIC '999999';                                              
                                                                                
    EØSINF2O.NORDISK_KONVENSJONO = B01.NORDISK_KONVENSJON(SØKER_IND);           
    IF B01.GUNSTIGSTE_ALTERNATIV(SØKER_IND) = '1'  THEN                         
       EØSINF2O.GUNSTIGSTE_ALTERNATIVO = '  NASJONAL';                          
    ELSE                                                                        
    IF B01.GUNSTIGSTE_ALTERNATIV(SØKER_IND) = '2'  THEN                         
       EØSINF2O.GUNSTIGSTE_ALTERNATIVO = '       EØS';                          
    ELSE                                                                        
    IF B01.GUNSTIGSTE_ALTERNATIV(SØKER_IND) = '3'  THEN                         
       EØSINF2O.GUNSTIGSTE_ALTERNATIVO = 'PRO RATA 2';                          
    ELSE                                                                        
    IF B01.GUNSTIGSTE_ALTERNATIV(SØKER_IND) = '4'  THEN                         
       EØSINF2O.GUNSTIGSTE_ALTERNATIVO = '   NORDISK';                          
                                                                                
    PIC3                       = B01.TT_EØS_FRAMT_MND(SØKER_IND);               
    EØSINF2O.TT_EØS_FRAMT_MNDO = PIC3                           ;               
    EØSINF2O.TT_EØS_ANV_ÅRO    = B01.TT_EØS_ANV_ÅR(SØKER_IND);                  
    EØSINF2O.TT_EØS_ANV_MNDO   = B01.TT_EØS_ANV_MND(SØKER_IND);                 
    EØSINF2O.TT_NORDISK_FAKT_MNDO = B01.TT_NORDISK_FAKT_MND(SØKER_IND);         
    EØSINF2O.TT_NORDISK_FRAMT_BRUTTOO =                                         
                             B01.TT_NORDISK_FRAMT_BRUTTO(SØKER_IND);            
    EØSINF2O.TT_NORDISK_FRAMT_NETTOO =                                          
                             B01.TT_NORDISK_FRAMT_NETTO(SØKER_IND);             
    PIC3                       = B01.PÅ_EØS(SØKER_IND);                         
    EØSINF2O.PÅ_EØSO           = PIC3                 ;                         
    EØSINF2O.PÅ_EØS_ETTER91O   = B01.PÅ_EØS_ETTER91(SØKER_IND);                 
    EØSINF2O.PÅ_EØS_FRAMTO     = B01.PÅ_EØS_FRAMT(SØKER_IND);                   
    EØSINF2O.PÅ_NORDISK_FAKTO  = B01.PÅ_NORDISK_FAKT(SØKER_IND);                
    EØSINF2O.PÅ_NORDISK_FRAMT_BRUTTOO =                                         
                              B01.PÅ_NORDISK_FRAMT_BRUTTO(SØKER_IND);           
    PIC3            =     B01.PÅ_NORDISK_FRAMT_NETTO(SØKER_IND);                
    EØSINF2O.PÅ_NORDISK_FRAMT_NETTOO = PIC3;                                    
    EØSINF2O.SPT_NORDISK_ART15O = B01.SPT_NORDISK_ART15(SØKER_IND);             
    EØSINF2O.OPT_NORDISK_ART15O = B01.OPT_NORDISK_ART15(SØKER_IND);             
                                                                                
    EØSINF2O.ALTERNATIV_GP_BRUTTOO =                                            
                            B01.ALTERNATIV_GP_BRUTTO(SØKER_IND);                
    EØSINF2O.ALTERNATIV_TP_BRUTTOO =                                            
                            B01.ALTERNATIV_TP_BRUTTO(SØKER_IND);                
    EØSINF2O.INNT_PRØVET_EØS_PENSO =                                            
                       B01.INNT_PRØVET_EØS_PENS(SØKER_IND);                     
                                                                                
    EØSINF2O.BUP_GRAD_EØSO =   B01.BUP_GRAD_EØS(SØKER_IND);                     
                                                                                
   /*  ****     EØS_ÅR_IKKE_PRO_RATA   ******************  */                   
    DO K = 1 TO HBOUND(EØSINF2O.EØS_ÅR_IKKE_PRO_RATAO);                         
       EØSINF2O.EØS_ÅR_IKKE_PRO_RATAO (K) = '0000';                             
    END;                                                                        
                                                                                
    L = 1;                                                                      
    DO K = 1967  TO HBOUND(B01.EØS_ÅR_IKKE_PRO_RATA,2);                         
       IF B01.EØS_ÅR_IKKE_PRO_RATA (SØKER_IND, K ) = '1'B THEN                  
          DO;                                                                   
              H_ÅR4   =  K;                                                     
              IF L > HBOUND(EØSINF2O.EØS_ÅR_IKKE_PRO_RATAO) THEN                
                 L = HBOUND(EØSINF2O.EØS_ÅR_IKKE_PRO_RATAO);                    
                                                                                
              EØSINF2O.EØS_ÅR_IKKE_PRO_RATAO (L) = H_ÅR4 ;                      
              L = L + 1;                                                        
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
   /*  ****     END                    ******************  */                   
                                                                                
                                                                                
    END  FYLL_EØSINF2;                                                          
                                                                                
    FYLL_EØSINF3:  PROC;                                                        
   /*  ****     PRO_RAT2               ******************  */                   
    DO K = 1 TO HBOUND(EØSINF3O.PRO_RATA2O);                                    
       EØSINF3O.PRO_RATA2O (K) = 00 ;                                           
                                                                                
    END;                                                                        
                                                                                
    L = 1;                                                                      
    DO K = 1967  TO HBOUND(B01.PRO_RATA2,2);                                    
       IF B01.PRO_RATA2        (SØKER_IND, K ) = '1'B THEN                      
          DO;                                                                   
              H_ÅR4   =  K;                                                     
              IF (L > HBOUND(EØSINF3O.PRO_RATA2O)) THEN                         
                 L = HBOUND(EØSINF3O.PRO_RATA2O);                               
              EØSINF3O.PRO_RATA2O (L) = H_ÅR4 ;                                 
              L = L + 1;                                                        
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
   /*  ****     END                    ******************  */                   
                                                                                
    END  FYLL_EØSINF3;                                                          
                                                                                
                                                                                
     FYLL_SPESOPPL:                                                             
        PROC;                                                                   
                                                                                
        SPESOPO.STATSBORGERO    = B01.STATSBORGER        (SØKER_IND);           
        SPESOPO.FRAVIK_FLYKTNO  = B01.FRAVIK_FLYKTN      (SØKER_IND);           
        SPESOPO.OVERKOMP_UTLO   = B01.OVERKOMP_UTL       (SØKER_IND);           
        SPESOPO.BOSATTO         = B01.BOSATT             (SØKER_IND);           
        SPESOPO.FRAVIK_BOSATTO  = B01.FRAVIK_BOSATT      (SØKER_IND);           
        SPESOPO.FRAVIK_TRYGDET3O= B01.FRAVIK_TRYGDET_3ÅR (SØKER_IND);           
        SPESOPO.FRAVIK_3_5_2O   = B01.FRAVIK_19_3        (SØKER_IND);           
        SPESOPO.FRAVIK_12_2O    = B01.FRAVIK_8_1         (SØKER_IND);           
        SPESOPO.FRAVIK_17_3O    = B01.FRAVIK_10_1        (SØKER_IND);           
        SPESOPO.KONVENSJONO     = B01.KONVENSJON         (SØKER_IND);           
        SPESOPO.IKKE_GPO        = B01.IKKE_GP            (SØKER_IND);           
        SPESOPO.TRYGDET_DØDO    = B01.TRYGDET_DØD        (SØKER_IND);           
        SPESOPO.TRYGDET_3ÅR_DØDO= B01.TRYGDET_3ÅR_DØD    (SØKER_IND);           
        SPESOPO.UFØR_UNDER_BOTO = B01.UFØR_UNDER_BOTID   (SØKER_IND);           
        SPESOPO.TT_FRAMT_UFTO   = B01.TT_FRAMT_UFT       (SØKER_IND);           
        SPESOPO.TT_FRAMT_12_2O  = B01.TT_FRAMT_VED_FRAVIK_8_1                   
                                                         (SØKER_IND);           
        SPESOPO.TT_FRAMT_DØDO   = B01.TT_FRAMT_DØD       (SØKER_IND);           
        SPESOPO.TT_FRAMT_17_3O  = B01.TT_FRAMT_VED_FRAVIK_10_1                  
                                                         (SØKER_IND);           
        SPESOPO.TT_VENT_UTLO    = B01.TT_VENT_UTL        (SØKER_IND);           
        SPESOPO.IKKE_TT_FRAMTO  = B01.IKKE_TT_FRAMT_DØD  (SØKER_IND);           
        SPESOPO.PENSJONSTRYGDETO = B01.PENSJONSTRYGDET (SØKER_IND);             
        SPESOPO.MINST20ÅR_BOTIDO = B01.MINST_20ÅR_BOTID  (SØKER_IND);           
        SPESOPO.FRAVIK_B_KONO =                                                 
                            B01.FRAVIK_BOSATT_KONVENSJON (SØKER_IND);           
                                                                                
                                                                                
        SPESOPO.TP_NORDISKO      = B01.TP_NORDISK         (SØKER_IND);          
        SPESOPO.TP_NORDISK_LANDO = B01.TP_NORDISK_LAND    (SØKER_IND);          
        SPESOPO.TT_KONVEN_ÅRO    = B01.TT_KONVENSJON_ÅR    (SØKER_IND);         
        SPESOPO.UNNTAK_12_2O     = B01.UNNTAK_12_2         (SØKER_IND);         
        SPESOPO.TT_PÅO           = B01.TT_PÅ               (SØKER_IND);         
        SPESOPO.TT_FRAMTO        = B01.TT_FRAMTIDIG        (SØKER_IND);         
        SPESOPO.TT_FAKTISKO      = B01.TT_FAKTISK          (SØKER_IND);         
        SPESOPO.FRAVIK_10_3O     = B01.FRAVIK_5_1          (SØKER_IND);         
        SPESOPO.UNG_UFØRO        = B01.UNG_UFØR            (SØKER_IND);         
                                                                                
                                                                                
     END FYLL_SPESOPPL;                                                         
                                                                                
 END BYGG_STATUS;                                                               
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
 KONTROLL_INPUT_HOVED_MAP:                                                      
   PROC;                                                                        
                                                                                
     EXEC CICS RECEIVE MAP('S001015') MAPSET('S001013') INTO(S001015I);         
                                                                                
     OPPLYSNINGSTYPE = S001015I.OPPLYSNINGSTYPEI;                               
                                                                                
     IF S001015I.STATUS_KODEI = 'N' THEN                                        
       ØNSKET_STATUS     = 'N';                                                 
                                                                                
     ELSE                                                                       
       ØNSKET_STATUS     = 'S';                                                 
                                                                                
     IF S001015I.RETUR_FUNKSJONL > 0 THEN                                       
        FUNKSJONSKODE = S001015I.RETUR_FUNKSJONI;                               
                                                                                
     IF FUNKSJONSKODE ^= 'F' THEN                                               
       EXEC CICS XCTL PROGRAM('R0010301') COMMAREA(KOM_OMR);                    
                                                                                
     S001015I.FNRL  = -1; /* CURSOR POS */                                      
                                                                                
                                                                                
     IF ^F_NUMERISK(S001015I.FNRI) THEN                                         
       DO;                                                                      
         MAP_MELDING = 'TEGN SOM IKKE ER NUMERISK I FØDSELSNUMMER';             
         RETURN;                                                                
       END;                                                                     
   ELSE                                                                         
     IF SUBSTR(DIV_PARAM_OMR.CICS_IND,2,1) ^= 'G'  THEN                         
        DO;                                                                     
                                                                                
          IF ^F_GYLDIG_FNR(S001015O.FNRO) THEN  /* FNRO ER PIC'(11)9' */        
             DO;                                                                
               MAP_MELDING = 'UGYLDIG FØDSELSNUMMER';                           
               RETURN;                                                          
             END;                                                               
       END;                                                                     
                                                                                
       DO;                                                                      
         FNR_REG.FNR1       = S001015O.FNRO                  ;                  
                                                                                
 /* FJERNET 22.12.88 HL  : */                                                   
 /*      FNR_REG.BRUKERID   = STYRINGS_OMR.BRUKERID          */                 
                                                                                
         EXEC CICS LINK PROGRAM('R0019906') COMMAREA(FNR_REG);                  
                                                                                
         IF FNR_REG.FNR2 > 0 THEN                                               
           DO;                                                                  
             MAP_MELDING = S001015I.FNRI !!                                     
                           ' ER ET FØDSELSNUMMER SOM ER ENDRET' !!              
                           ' TRYKK ENTER!';                                     
             S001015O.FNRO = FNR_REG.FNR2;                                      
             RETURN;                                                            
           END;                                                                 
         ELSE                                                                   
           DO;                                                                  
             SEARCH_FNR = S001015O.FNRO;                                        
             PIC_11 = SEARCH_FNR;                                               
      /*     FNR_SØKER = PIC_11;  UGildig endring   */                          
                                                                                
             IF F_KJØNN(PIC_11) = 'K' THEN                                      
                DO;                                                             
                   SØKER_IND = 1;                                               
                   EKTEF_IND = 2;                                               
                END;                                                            
             ELSE                                                               
                DO;                                                             
                   SØKER_IND = 2;                                               
                   EKTEF_IND = 1;                                               
                END;                                                            
           END;                                                                 
       END;                                                                     
                                                                                
     IF VERIFY(OPPLYSNINGSTYPE,'AGSPIBYF') > 0 THEN                             
       DO;                                                                      
         MAP_MELDING = 'UGYLDIG OPPLYSNINGSTYPE';                               
         S001015I.OPPLYSNINGSTYPEL = -1; /* CURSOR POS */                       
         S001015I.FNRL             =  0; /* CURSOR POS NULLES */                
       END;                                                                     
                                                                                
        DO K = 1 TO HBOUND(KOM_OMR.FNR_TAB);                                    
           KOM_OMR.FNR_TAB(K) = 0;                                              
        END;                                                                    
                                                                                
                                                                                
 END KONTROLL_INPUT_HOVED_MAP;                                                  
                                                                                
                                                                                
 KONTROLL_INPUT_TRAILER:                                                        
   PROC;                                                                        
                                                                                
     EXEC CICS RECEIVE MAP('S001044') MAPSET('S001043') INTO(S001044I);         
     OPPLYSNINGSTYPE = S001044I.OPPLYSNINGSTYPEI;                               
                                                                                
     IF ^(OPPLYSNINGSTYPE = 'A' ! OPPLYSNINGSTYPE = 'G') THEN                   
        DO;                                                                     
           IF S001044I.STATUS_KODEI = 'N' THEN                                  
              DO;                                                               
                 IF ØNSKET_STATUS = 'S' THEN                                    
                    STATUS_SKIFTE = '1'B;                                       
                 ØNSKET_STATUS   = 'N';                                         
              END;                                                              
           ELSE                                                                 
              DO;                                                               
                 IF ØNSKET_STATUS = 'N' THEN                                    
                    STATUS_SKIFTE = '1'B;                                       
                 ØNSKET_STATUS   = 'S';                                         
              END;                                                              
        END;                                                                    
                                                                                
     IF TRANSKODE = 'F41F' THEN                                                 
        CALL SJEKK_OM_FNR_MERKET;                                               
                                                                                
     CALL LOW_VALUES_TIL_MAP;                                                   
                                                                                
     IF VERIFY(OPPLYSNINGSTYPE,'XSPIBYGAF') > 0 THEN                            
       MAP_MELDING = 'UGYLDIG OPPLYSNINGSTYPE';                                 
                                                                                
 END KONTROLL_INPUT_TRAILER;                                                    
                                                                                
                                                                                
 SJEKK_OM_FNR_MERKET:                                                           
   PROC;                                                                        
     DCL       NEDRE_EIBCPOSN          FIXED BIN(15) INIT(160),                 
               OEVRE_EIBCPOSN          FIXED BIN(15) INIT(171),                 
               START                   FIXED BIN(15),                           
               STOPP                   FIXED BIN(15),                           
               FNR_VED_START           FIXED DEC(11);                           
                                                                                
     FNR_VED_START = SEARCH_FNR;                                                
                                                                                
     IF S001044I.SIDEI = 1 THEN                                                 
        DO;                                                                     
           START = 1;                                                           
           STOPP = 7;                                                           
        END;                                                                    
     ELSE           /* SIDE NR. 2  */                                           
        DO;                                                                     
           START = 8;                                                           
           STOPP = 14;                                                          
        END;                                                                    
                                                                                
     DO I = START TO STOPP UNTIL(EIBCPOSN < OEVRE_EIBCPOSN - 240);              
        IF EIBCPOSN > NEDRE_EIBCPOSN &                                          
           EIBCPOSN < OEVRE_EIBCPOSN &                                          
           KOM_OMR.FNR_TAB(I) > 0 THEN                                          
                                                                                
                                                                                
           /*B01.RF0PERSN.FNR(I) > 0 THEN*/                                     
                                                                                
           DO;                                                                  
                                                                                
           /* SEARCH_FNR = B01.RF0PERSN.FNR(I) */                               
                                                                                
           /* IF B01.RF0PERSN.FNR(I) > 0 THEN                                   
                 SEARCH_FNR = B01.RF0PERSN.FNR(I)                               
              ELSE */                                                           
                 SEARCH_FNR = KOM_OMR.FNR_TAB(I);                               
              SØKER_IND = I;                                                    
              IF SØKER_IND = 1 THEN                                             
                 EKTEF_IND = 2;                                                 
              ELSE                                                              
              IF SØKER_IND = 2 THEN                                             
                 EKTEF_IND = 1;                                                 
           END;                                                                 
                                                                                
        NEDRE_EIBCPOSN = NEDRE_EIBCPOSN + 240;                                  
        OEVRE_EIBCPOSN = OEVRE_EIBCPOSN + 240;                                  
     END;                                                                       
                                                                                
                                                                                
    IF FNR_VED_START ^= SEARCH_FNR    &                                         
       B01.STATUS.PENSJONSTYPE1(1) = 'D' THEN                                   
                                                                                
       DO POS_I_B01 = 1 TO 14;                                                  
          CALL BLANK_B01;                                                       
       END;                                                                     
                                                                                
 END SJEKK_OM_FNR_MERKET;                                                       
                                                                                
                                                                                
 MAP_SEND:                                                                      
   PROC;                                                                        
     SELECT (TRANSKODE);                                                        
       WHEN('F410')                                                             
         DO;                                                                    
           S001015O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                      
           S001015O.ROLLEO = DIV_PARAM_OMR.ATK_ROLLE ;                          
   /*      S001015O.FNRO   =  DIV_PARAM_OMR.FNR_SØKER;   ugildig end */         
            ATK_KOM_OMR.ACF2_F_KODE              =   ' ';                       
           IF OPPLYSNINGSTYPE = 'X' THEN                                        
             EXEC CICS SEND MAP('S001015') MAPSET('S001013') ERASE;             
           ELSE                                                                 
             DO;                                                                
               S001015O.MELDINGO = SUBSTR(MAP_MELDING,1,69);                    
               EXEC CICS SEND MAP('S001015') MAPSET('S001013') CURSOR           
                                                                ERASE;          
               MAP_MELDING = (78)' ';                                           
             END;                                                               
         END;                                                                   
       OTHERWISE                                                                
         DO;                                                                    
           S001044O.MELDINGO        = SUBSTR(MAP_MELDING,1,69);                 
           S001044O.BLADN_TEKSTA    = 'Ø';  /* ASKIP, DARK */                   
           S001044O.BLADN_KOMMANDOA = 'Ø';  /* ASKIP,DARK  */                   
           EXEC CICS SEND MAP('S001044') MAPSET('S001043');                     
           MAP_MELDING = (78)' ';                                               
         END;                                                                   
     END;  /*  SELECT   */                                                      
 END MAP_SEND;                                                                  
                                                                                
 /*                                                                             
 MAP_SEND_TRAILER:                                                              
   PROC;                                                                        
     EXEC CICS SEND MAP('S001044') MAPSET('S001043') CURSOR;                    
     MAP_MELDING = (78)' ';                                                     
 END MAP_SEND_TRAILER;                                                          
 */                                                                             
                                                                                
 SJEKK_MELDING:                                                                 
   PROC;                                                                        
     IF MAP_MELDING ^= (78) ' ' THEN                                            
       DO;                                                                      
         CALL MAP_SEND;                                                         
         GOTO RETURN;                                                           
       END;                                                                     
 END SJEKK_MELDING;                                                             
                                                                                
                                                                                
 DATABASE:                                                                      
   PROC(STYRING);                                                               
                                                                                
   DCL                                                                          
     STYRING                               CHAR(5),                             
     NULL                                  BUILTIN,                             
     UNSPEC                                BUILTIN;                             
                                                                                
                                                                                
     DCL                                                                        
       W01_PCB_FUNCTION            CHAR (4)       INIT('PCB ');                 
     DCL                                                                        
       W01_TERM_FUNCTION           CHAR (4)       INIT('TERM');                 
  %PAGE;                                                                        
                                                                                
     W01_PSB_NAVN     = DIV_PARAM_OMR.PSB_NAVN;                                 
     IF STYRING = 'OPEN' THEN                                                   
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_3,                
                                                  W01_PCB_FUNCTION,             
                                                  W01_PSB_NAVN,                 
                                                  UIBPTR);                      
                                                                                
           IF DLIUIB.UIBFCTR                    =    '00000000'B THEN           
             DO;                                                                
               ALLOCATE PCB_UIB_PEKER_OMR;                                      
               PCB_UIB_PEKER_OMR.PCB_PEKER      =    UIBPCBAL;                  
               PCB_UIB_PEKER_OMR.UIB_PEKER      =    UIBPTR;                    
             END;                                                               
           ELSE                                                                 
             DO;                                                                
               STRING(T_UIBFCTR) = UNSPEC((UIBRCODE.UIBFCTR));                  
               T_UIBDLTR = CHAR(UNSPEC((UIBRCODE.UIBDLTR)));                    
               MAP_MELDING =                                                    
               'PENSJONSREGISTERET ER IKKE TILGJENGELIG. KODE:'!!               
              /*'NOE ER GALT MED DATABASEN, KODE: ' !!                          
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR)  */                    
               T_UIBFCTR !! T_UIBDLTR;                                          
               FEIL_MELD_NR = 514;                                              
             END;                                                               
    /*   denne test er bare tull  test er dannet av Baraki                      
           IF RF1.STATUS_KODE  ^= '  '    THEN                                  
              DO;                                                               
                MAP_MELDING =                                                   
                'PENSJONSREGISTERET ER IKKE TILGJENGELIG. KODE:'!!              
                 RF1.STATUS_KODE;                                               
                 FEIL_MELD_NR = 514;                                            
              END;                                                              
      */                                                                        
        END;                                                                    
     ELSE                                                                       
        DO;                                                                     
           CALL   PLITDLI                        (W02_PARM_CT_1,                
                                                  W01_TERM_FUNCTION);           
           KOM_OMR.PCB_UIB_PEKER = NULL;                                        
        END;                                                                    
                                                                                
 END DATABASE;                                                                  
                                                                                
                                                                                
 FORBEREDE_TRANS:                                                               
   PROC;                                                                        
                                                                                
     INDEX_1 = 1;                                                               
     DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                            
     PIC_11 = DIV_PARAM_OMR.SEARCH_FNR;                                         
 /*  FNR_SØKER = PIC_11;  ugildig endring   satish   */                         
     CALL DATABASE('OPEN');                                                     
     CALL SJEKK_MELDING;                                                        
                                                                                
     TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD  = 0;                                     
     TRANS_OPPL_OMR.FØDSNUMMER     = 0;                                         
     DIV_PARAM_OMR.TRANS_VIRKDATO_ÅMD    = 0;                                   
     DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '1'B;                                
                                                                                
     /*******    LES TRANS        *********/                                    
     EXEC CICS LINK PROGRAM ('R0015201') COMMAREA(KOM_OMR);                     
                                                                                
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 THEN                                     
        DO;                                                                     
           PIC_4 = DIV_PARAM_OMR.FEIL_MELD_NR;                                  
           MAP_MELDING = 'FEIL MED DATABASEN PÅ FØRSTE KALL ' !!                
                          PIC_4 !! ' ' !! DIV_PARAM_OMR.FEIL_VED_LABEL          
                                !! ' ' !! DIV_PARAM_OMR.PROGRAM_ID;             
        END;                                                                    
                                                                                
     ELSE IF TRANS_OPPL_OMR.FØDSNUMMER = 0 THEN                                 
        MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER: ' !! PIC_11 !!               
                      ' ER IKKE I DATABASEN';                                   
                                                                                
      ELSE IF TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 0 THEN                         
         MAP_MELDING = 'DET FINNES INGEN TRANSAKSJONER TIL ' !!                 
                       'PERSONEN MED FNR: ' !! PIC_11;                          
                                                                                
     IF DIV_PARAM_OMR.FEIL_MELD_NR > 0 !                                        
        TRANS_OPPL_OMR.FØDSNUMMER = 0  !                                        
        TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 0  THEN                              
           CALL DATABASE('CLOSE');                                              
                                                                                
    TRANS_OPPL_OMR.TRANSKODE = TRANSKODE_VED_START;  /*BLIR BLANKET I */        
                                                     /* LES-TRANS     */        
                                                                                
 END FORBEREDE_TRANS;                                                           
                                                                                
                                                                                
                                                                                
 BYGG_TRANS:                                                                    
   PROC;                                                                        
                                                                                
                                                                                
    %INCLUDE P0019913;          /* LOKAL - KOM - OMRÅDE   */                    
                                                                                
    DCL                                                                         
        LOKAL_KOM_PTR            POINTER,                                       
        SEARCH_FNR_VED_START     FIXED DEC(11),                                 
        SLUTT                    BIT(1) INIT('0'B);                             
                                                                                
    ALLOCATE LOKAL_KOM_OMR;                                                     
                                                                                
    HOVED_KOM_OMR_PTR  = NULL;                                                  
    FNR_ARRAY          = 0;                                                     
    FNR_ARRAY_IND      = 1;                                                     
    FNR_ARRAY_ANT      = 0;                                                     
    TRANS_ANT          = 1;                                                     
                                                                                
    W01_NORSK_BOSATT   = '0'B;                                                  
    W01_YSKADE         = '0'B;                                                  
                                                                                
    DO I = 1 TO 40;                                                             
       TRANS_LISTE.TRANS_OPPL_PTR(I)  = NULL;                                   
       TRANS_LISTE.TRANS_PTR     (I)  = NULL;                                   
    END;                                                                        
                                                                                
                                                                                
                                                                                
    DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '0'B;                                 
    HOVED_KOM_OMR_PTR    = COMMAREA_PEKER;                                      
    SEARCH_FNR_VED_START = SEARCH_FNR;                                          
 /* FNR_SØKER = SEARCH_FNR;  ugildig endrin  satish   */                        
    DO WHILE (^SLUTT);                                                          
                                                                                
       /**  BYGGE OPP TRANS_LISTE OG FNR_ARRAY                    **/           
                                                                                
       IF ^DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS  THEN                            
          EXEC CICS LINK PROGRAM('R0010411') COMMAREA (LOKAL_KOM_OMR);          
                                                                                
       KOM_OMR.TRANS_OPPL_PEKER = ADDR(KOM_OMR.TRANS_OPPL_OMR);                 
                                                                                
       /*******    LES TRANS        *********/                                  
                                                                                
       EXEC CICS LINK PROGRAM ('R0015201') COMMAREA(KOM_OMR);                   
                                                                                
       IF TRANS_ANT = 40 THEN                     /* BEGRENSNING I    */        
          TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD = 0;   /* TRANS - ANTALLET */        
                                                                                
       IF TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD > 0 THEN                             
          DO;                                                                   
             TRANS_ANT = TRANS_ANT + 1;                                         
             DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '0'B;                        
          END;                                                                  
       ELSE IF OPPLYSNINGSTYPE = 'A' &                                          
               FNR_ARRAY_IND < 14    &                                          
               FNR_ARRAY(FNR_ARRAY_IND + 1) > 0 THEN                            
          DO;                                                                   
             FNR_ARRAY_IND = FNR_ARRAY_IND + 1;                                 
             SEARCH_FNR    = FNR_ARRAY(FNR_ARRAY_IND);                          
             DIV_PARAM_OMR.FØRSTE_CALL_LES_TRANS = '1'B;                        
          END;                                                                  
       ELSE                                                                     
          DO;                                                                   
             CALL DATABASE('CLOSE');                                            
             ANTALL_TRANS_I_TRANS_LISTE  = TRANS_ANT;                           
             SLUTT      = '1'B;                                                 
          END;                                                                  
                                                                                
    END;                                                                        
                                                                                
    SEARCH_FNR = SEARCH_FNR_VED_START;                                          
                                                                                
    /** HOVED-KOM_OMR TIL TS,   KONTROLL TIL UTLISTINGSPROGRAMMET  **/          
    HOVED_KOM_OMR_PTR   = COMMAREA_PEKER;                                       
                                                                                
                                                                                
    EXEC CICS WRITEQ TS QUEUE(QUENAME) FROM(KOM_OMR) MAIN;                      
    EXEC CICS XCTL PROGRAM('R0010412') COMMAREA (LOKAL_KOM_OMR);                
                                                                                
                                                                                
 END BYGG_TRANS;                                                                
                                                                                
                                                                                
                                                                                
 OVERFLOW:                                                                      
   CALL LOW_VALUES_TIL_MAP;                                                     
    LINJENO   =  1;                                                             
                                                                                
   S001044O.SIDEO            = SIDE_TELL;                                       
   S001044O.BLADN_TEKSTO     = ' VALG AV SIDENR: ';                             
   S001044O.CICS_INFOO       = DIV_PARAM_OMR.CICS_NAVN;                         
   S001044O.ROLLEO = DIV_PARAM_OMR.ATK_ROLLE ;                                  
   S001044O.OPPLYSNINGSTYPEO = OPPLYSNINGSTYPE;                                 
   IF ^ SISTE_SIDE THEN                                                         
     S001044O.BLADN_KOMMANDOO = 'P/N';                                          
   ELSE                                                                         
     DO;                                                                        
       S001044O.BLADN_KOMMANDOO =  'P/1';                                       
       IF SIDE_TELL = 1 THEN                                                    
         DO;                                                                    
           S001044O.BLADN_TEKSTO    = (10)' ';                                  
           S001044O.BLADN_KOMMANDOO = '    ';                                   
           S001044O.BLADN_KOMMANDOA = '0';     /* ASKIP  */                     
         END;                                                                   
     END;                                                                       
                                                                                
   EXEC CICS SEND MAP('S001044') MAPSET('S001043') ACCUM PAGING;                
   IF SISTE_SIDE THEN                                                           
     DO;                                                                        
       EXEC CICS WRITEQ TS QUEUE(QUENAME) FROM(KOM_OMR);                        
       EXEC CICS SEND PAGE TRANSID(TRANSKODE) RELEASE NOAUTOPAGE;               
     END;                                                                       
   /***** HIT KOMMER EN BARE DERSOM DET ER MER INFO IGJEN  *****/               
                                                                                
  /*  IF BEHANDLE_NESTE_F   ^= 'F050'  THEN */                                  
   SIDE_TELL = SIDE_TELL + 1;                                                   
   IF BEHANDLE_NESTE_F   = 'F036'  !                                            
      BEHANDLE_NESTE_F   = 'F041'  !                                            
      BEHANDLE_NESTE_F   = 'F050'  THEN                                         
      SIDE_TELL = SIDE_TELL - 1;                                                
                                                                                
   SELECT (OPPLYSNINGSTYPE);                                                    
     WHEN('F')                                                                  
       DO;                                                                      
         CALL BYGG_FAMILIE_HEADER;                                              
         CALL BYGG_FAMILIE_FORH;                                                
       END;                                                                     
     WHEN('I')                                                                  
       DO;                                                                      
         CALL BYGG_INNTEKTS_HEADER;                                             
         CALL BYGG_INNTEKTS_FORH;                                               
       END;                                                                     
     WHEN('P')                                                                  
       DO;                                                                      
         CALL BYGG_GENHEAD('PERSONLIG INFO');                                   
         CALL BYGG_PERSONLIG_INFO;                                              
       END;                                                                     
     WHEN('Y')                                                                  
       DO;                                                                      
         CALL BYGG_GENHEAD('YTELSER');                                          
         CALL BYGG_YTELSER;                                                     
       END;                                                                     
     WHEN('B')                                                                  
       DO;                                                                      
         CALL BYGG_GENHEAD('BEREGNINGSGRUNNLAG');                               
         CALL BYGG_BEREGNINGSGRUNNLAG;                                          
       END;                                                                     
     WHEN('S')                                                                  
       DO;                                                                      
         CALL BYGG_STATUS;                                                      
                                                                                
       END;                                                                     
     OTHERWISE                                                                  
        ;                                                                       
   END;  /* SELECT   */                                                         
                                                                                
   /********      SLUTT PÅ OVERFLOW - RUTINE     ***********/                   
                                                                                
                                                                                
    /* -------------------------------------------------------------- */        
   OPPRETT_STATUS_UTEN_TRANS: PROC;                                             
    DCL                                                                         
       (I,J,K) FIXED BIN(15);                                                   
    DCL                                                                         
         FNR_FORESPØRSEL                       FIXED DEC(11),                   
         BARNE_IND                             FIXED BIN(15),                   
         BARNE_POS                             FIXED BIN(15),                   
         TILKN_IND                             FIXED BIN(15),                   
         LES_RESTEN_IND                        FIXED BIN(15);                   
                                                                                
    CALL DATABASE('OPEN');                                                      
    CALL SJEKK_MELDING;                                                         
                                                                                
    FNR_FORESPØRSEL = SEARCH_FNR;                                               
    FEIL_MELD_NR = 0;                                                           
    PIC_11 = SEARCH_FNR;                                                        
    SØKER_IND = 1;                                                              
    EKTEF_IND = 2;                                                              
    POS_I_B01 = 1;                                                              
                                                                                
     ACF2_F_KODE          = ' ';                                                
                                                                                
    EXEC CICS LINK PROGRAM('R0013110') COMMAREA(KOM_OMR);                       
                                                                                
  IF FEIL_MELD_NR = 0 &                                                         
     B01.RF0PERSN.FNR(SØKER_IND) > 0   THEN                                     
   DO;                                                                          
     DO I = 1 TO 2; /* SØKER ER I BASEN             */                          
       DO TILKN_IND = 1 TO 13 WHILE (B01.FNR_TILKN(I,TILKN_IND) > 0);           
          PIC_11     = B01.TILKN.FNR_TILKN(I,TILKN_IND);                        
          SEARCH_FNR = B01.TILKN.FNR_TILKN(I,TILKN_IND);                        
          IF FNR_FORESPØRSEL ^= SEARCH_FNR THEN                                 
             DO;                                                                
                POS_I_B01 = POS_I_B01 + 1;                                      
                IF POS_I_B01 = 15 THEN                                          
                   DO;                                                          
                      MAP_MELDING = 'MULIGHETER FOR FLERE ENN 14 ' !!           
                                    ' PERSONER, PLASSPROBLEMER ';               
                      GOTO SLUTT;                                               
                   END;                                                         
                EXEC CICS LINK PROGRAM('R0013110') COMMAREA(KOM_OMR);           
             END;                                                               
                                                                                
          IF FEIL_MELD_NR > 0  THEN                                             
             DO;                                                                
          /*    IF FEIL_MELD_NR = 0654  THEN */                                 
                      MAP_MELDING = ACF2_FEIL((FEIL_MELD_NR));                  
                   GOTO SLUTT;                                                  
             END;                                                               
                                                                                
          IF DB_STATUS_KODE ^= '  ' THEN                                        
             DO;                                                                
                MAP_MELDING = 'TILKNYTTET FØDSELSNUMMER: '!! PIC_11 !!          
                               ' FINNES IKKE PÅ DATABASEN';                     
                GOTO SLUTT;                                                     
             END;                                                               
                                                                                
       END;                                                                     
       IF B01.STATUS.VIRK_DATO_ÅMD(SØKER_IND)     = 0 THEN                      
             LEAVE;                                                             
                                                                                
       DO K = 1 TO 14;                                                          
          KOM_OMR.FNR_TAB(K) = B01.RF0PERSN.FNR(K);                             
       END;                                                                     
    END;       /*     DO          */                                            
   END;       /*     I = 1 TO 2  */                                             
                                                                                
  ELSE                                                                          
  IF FEIL_MELD_NR = 0 THEN                                                      
     MAP_MELDING = 'PERSONEN MED FØDSELSNUMMER ' !! PIC_11 !!                   
                        ' ER IKKE I DATABASEN';                                 
  ELSE                                                                          
  IF FEIL_MELD_NR > 650 &                                                       
     FEIL_MELD_NR < 660 THEN                                                    
       DO;                                                                      
        MAP_MELDING = ACF2_FEIL((FEIL_MELD_NR));                                
       END;                                                                     
  ELSE                                                                          
  IF FEIL_MELD_NR = 500  THEN                                                   
     MAP_MELDING = 'PENSJONSREGISTERET ER IKKE TILGJENGELIG. KODE:'!!           
                   ' KONTAKT SYSTEM AVD     ';                                  
  ELSE                                                                          
     MAP_MELDING = 'NOE ER GALT MED DATABASEN MELDNR ' !! FEIL_MELD_NR          
            !! 'KODE: ' !!                                                      
               UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);                       
                                                                                
 SLUTT:                                                                         
      CALL DATABASE('CLOSE');                                                   
                                                                                
   SEARCH_FNR = FNR_FORESPØRSEL;                                                
                                                                                
   /* HER ER DET SLUTT PÅ EKSEKVERING I OPPRETT-STATUS-UTEN-TRANS */            
                                                                                
                                                                                
       /* ----------------------------------------------------------- */        
   /*                                                                           
       FLYTT_TIL_BARNEDELEN: PROC;                                              
          IF BARNE_POS ^= SØKER_IND THEN                                        
             DO;                                                                
                B01.PERSON(BARNE_POS) = B01.PERSON(SØKER_IND);                  
                                                                                
                POS_I_B01  = SØKER_IND;                                         
                CALL BLANK_B01;                                                 
             END;                                                               
       END FLYTT_TIL_BARNEDELEN;                                                
     */                                                                         
                                                                                
       /* ----------------------------------------------------------- */        
    END OPPRETT_STATUS_UTEN_TRANS;                                              
    /* -------------------------------------------------------------- */        
    BLANK_B01: PROC;                                                            
        B01.PERSON(POS_I_B01) = '';                                             
    END BLANK_B01;                                                              
    /* -------------------------------------------------------------- */        
  /*%INCLUDE R0019920  / ÅPNE/ ELLER LUKKE DATABASEN          */                
    %INCLUDE R0019902; /* F_KJØNN                              */               
    %INCLUDE R0019904; /* F_GYLDIG_FNR                         */               
    %INCLUDE R0019905; /* F_ALDER                              */               
    %INCLUDE R0019910; /* F_NUMERISK                           */               
 /* %INCLUDE R0019912  /* KONV PIC-> CHAR, CHAR -> PIC         */               
    %INCLUDE R0019956; /* P9956_BER_G_CICS                     */               
    %INCLUDE R0019981; /* KONV_ÅR_HÅ                           */               
 /* %INCLUDE R0019982     KONV_ÅM_HÅMD                         */               
 /* %INCLUDE R0019983     KONV_ÅMD_HÅMD                        */               
 /* %INCLUDE R0019984     KONV_MÅ_HÅMD                         */               
 /* %INCLUDE R0019985     KONV_DMÅ_HÅMD                        */               
    %INCLUDE R0019986; /* KONV_HÅ_Å                            */               
    %INCLUDE R0019987; /* KONV_HÅMD_ÅM                         */               
    %INCLUDE R0019988; /* KONV_HÅMD_ÅMD                        */               
 /* %INCLUDE R0019989     KONV_HÅMD_MÅ                         */               
    %INCLUDE R0019990; /* KONV_HÅMD_DMÅ                        */               
    %INCLUDE R0019991; /* KONV_HÅMD_DMHÅ     OUTPUT=DDMMHHÅÅ   */               
    %INCLUDE R0019992; /* KONV_HÅMD_DBMBHÅ   OUTPUT=DD/MM/HHÅÅ */               
    %INCLUDE R0019994; /* KONV_HÅMD_MÅ       OUTPUT=MMHHÅÅ     */               
    %INCLUDE R0019995; /* KONV_FNR11_FNR13                     */               
    %INCLUDE R0019998; /* ATK  FEIL_MELD                       */               
    %INCLUDE R0019999; /* ATK  KONTROLL VI BRUKER VARIABLER    */               
    /* -------------------------------------------------------------- */        
 END R001041;                                                                   
