 /*   SIST ENDRET PÅ PROD   2005.04.20 12.51.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.01.09  9.00.06 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.01.07 12.38.07 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2000.11.07 12.22.30 AV   JDA7339          */        
 /* ***************************************************************** */        
 /*IDENTIFIKASJON:                                                    */        
 /*    R0014021 - PROSEDYRE I PLI. - KOPI AV 4244 (M/INDEX)           */        
 /*    PROGRAMMERER: HERMAN 2000                                      */        
 /*HENSIKT:                                                           */        
 /*    FREMTIDIG ARBEIDSINNTEKT SKAL REDUSERE ALDERSPENSJON           */        
 /*    RUTINEN OPPDATERER TP_NETTO,GP_NETTO,ST_NETTO                  */        
 /*PROGRAMTILKNYTNING:                                                */        
 /*    PROGRAMMET BLIR INKLUDERT I 4101, 4201, 4270 OG 4001 (4010)    */        
 /*BRUK:                                                              */        
 /*    CALL JUSTER_40PROS(INDEX)              (ERSTATTER 4016 OG 4244)*/        
 /*    ************************************************************** */        
 JUSTER_40PROS: PROC(INDEX);                                                    
    DCL                                                                         
        INDEX        FIXED BIN (15);                                            
    DCL                                                                         
       I             FIXED BIN(15),                                             
       SPARE_INDEX   FIXED BIN(15),                                             
       FRADRAG_F     DEC FIXED(7) INIT (0),                                     
       FRIBELØP      DEC FIXED(7) INIT (0),                                     
       REST_FRADRAG  DEC FIXED(5)  INIT (0),                                    
       W_BRUTTO_AP   DEC FIXED(7) INIT (0),                                     
       W_BRUTTO_GP   DEC FIXED(5) INIT (0),                                     
       W_BRUTTO_TP   DEC FIXED(5) INIT (0),                                     
       W_BRUTTO_TP_EP DEC FIXED(7) INIT (0),                                    
       W_BRUTTO_ST   DEC FIXED(5) INIT (0),                                     
       W_BRUTTO_GT   DEC FIXED(7) INIT (0),                                     
       W_SUM_TP      DEC FIXED(7) INIT (0),                                     
       W_YP_AP       DEC FIXED(7) INIT (0),                                     
       W_YP          DEC FIXED(7) INIT (0),                                     
       W_NETTO_AP    DEC FIXED(7) INIT (0),                                     
       W_ST_FRADRAG  DEC FIXED(5)  INIT (0),                                    
       W_GP_FRADRAG  DEC FIXED(5)  INIT (0),                                    
       W_ALDER_ÅM    PIC '99999',                                               
       W_ETTER92     DEC FIXED(7)  INIT (0);                                    
                                                                                
    DCL KODE         CHAR (1) INIT (' ');                                       
    DCL HJ_FAI       FIXED DEC (7);                                             
    DCL W_FNR        PIC  '(11)9';                                              
                                                                                
    DCL ROUND        BUILTIN;                                                   
                                                                                
    /* == START 4021 ================================================ */        
                                                                                
   W_FNR  = B02.FNR(INDEX);                                                     
   DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'R';                               
   W_ALDER_ÅM   = F_ALDER((W_FNR),(TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD));          
                                                                                
 /* LOVENDRING FRA 1.1.2002  : */                                               
                                                                                
   IF TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD > 20020000   &                           
      B02.PENSJONSTYPE1(INDEX)  =        'A'   THEN                             
      FRIBELØP = 2 * G;                                                         
   ELSE                                                                         
      FRIBELØP = G;                                                             
                                                                                
   IF W_ALDER_ÅM  > 7000  THEN                                                  
     DO;                                                                        
       B02.ALDERSP.FAI(INDEX)             = 0;                                  
       B02.ETTEPENS.FORVENTET(INDEX)       = 0;                                 
     END;                                                                       
                                                                                
   /* VED ETTERLATT ER ALDERSP.TP  ALLEREDE OPPDATERT MED */                    
   /* EGEN YP .                                                  */             
                                                                                
   IF B02.KONV_P_KODE(INDEX)        = 'Y'  &                                    
      B02.PENSJONSTYPE2(INDEX) ^=        'E'   THEN                             
     DO;                                                                        
        B02.ALDERSP.APD(INDEX)       = 100;                                     
        CALL BEREGN_AP_OVERGANG_FRA_YP;           /*4241*/                      
     END;                                                                       
                                                                                
                                                                                
   W_BRUTTO_GP    = B02.ALDERSP.GP(INDEX);                                      
   W_BRUTTO_TP    = B02.ALDERSP.TP(INDEX);                                      
   W_BRUTTO_ST    = B02.ALDERSP.ST(INDEX);                                      
   W_BRUTTO_TP_EP = B02.TP_BRUTTO(INDEX);                                       
   W_ETTER92      = W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;                 
                                                                                
   IF B02.GT_LOV92(INDEX)       > W_ETTER92        THEN                         
      W_BRUTTO_GT = B02.GT_LOV92(INDEX) - W_ETTER92;                            
                                                                                
   W_BRUTTO_AP       = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST                  
                       + B02.TP_BRUTTO(INDEX)                                   
                       + W_BRUTTO_GT;                                           
                                                                                
   W_SUM_TP          = W_BRUTTO_TP                                              
                       + B02.TP_BRUTTO(INDEX);                                  
   HJ_FAI  = B02.FAI(INDEX) * 100;                                              
                                                                                
 IF HJ_FAI  > FRIBELØP  THEN                                                    
   DO;                                                                          
 /* FRADRAG_F = (B02.FAI(INDEX) * 100);                                         
    FRADRAG_F = FRADRAG_F - FRIBELØP;    */                                     
    FRADRAG_F = HJ_FAI - FRIBELØP;                                              
                                                                                
    IF FRADRAG_F > 0 THEN                                                       
       FRADRAG_F = ( FRADRAG_F * 0.4 ) / 12;                                    
                                                                                
   IF FRADRAG_F > W_BRUTTO_AP THEN                                              
       DO;                                                                      
        IF B02.KONV_P_KODE(INDEX)       = 'E' !                                 
           B02.PENSJONSTYPE2(INDEX)       = 'E' THEN GOTO L999;                 
                                                                                
           B02.ALDERSP.AP_GP_NETTO(INDEX)    = 0;                               
           B02.ALDERSP.AP_TP_NETTO(INDEX)    = 0;                               
           B02.TP_NETTO           (INDEX)    = 0;                               
           B02.AP_ST_NETTO   (INDEX)         = 0;                               
       END;                                                                     
                                                                                
   ELSE                                                                         
       DO;                                                                      
                                                                                
 /* ***************************************************************** */        
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */        
 /* ***************************************************************** */        
                                                                                
          DIV_PARAM_OMR.AP_KODE_AEY(INDEX)       =  'R';                        
                                                                                
          W_NETTO_AP    = W_BRUTTO_AP - FRADRAG_F;                              
                                                                                
     /* FJERNET I UKE 7 JFA */                                                  
     /*   IF B02.KONV_P_KODE(INDEX) = 'Y'          THEN                         
             DO;                                                                
                SPARE_INDEX = BER_SØ_IND;                                       
                BER_SØ_IND = INDEX;                                             
                W_YP = F_OVERGANG_FRA_YP(W_YP_AP);  /*4140*/                    
     /*         BER_SØ_IND = SPARE_INDEX;                                       
             END;                                                               
                                                                                
     /*   IF W_YP > W_NETTO_AP       &   /*200211 HL */                         
     /*      TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD > 20020000   THEN                 
            DO;                                                                 
      /*       W_NETTO_AP   =  W_YP;                                            
               FRADRAG_F    =  W_BRUTTO_AP - W_NETTO_AP;   */                   
       /*      DIV_PARAM_OMR.AP_KODE_AEY(INDEX)        =  'Y';                  
        /*     IF FRADRAG_F  <=  0 THEN                                         
                                                                                
                  DO;                                                           
                     B02.AP_GP_NETTO(INDEX) = B02.ALDERSP.GP(INDEX);            
                     B02.AP_TP_NETTO(INDEX) = B02.ALDERSP.TP(INDEX);            
                     B02.TP_NETTO(INDEX)    = B02.TP_BRUTTO (INDEX);            
                     B02.AP_ST_NETTO(INDEX) = B02.ALDERSP.ST(INDEX);            
                     GOTO L500;                                                 
                  END;   /*FRADRAG <= 0 */                                      
       /*   END;   */                                                           
                                                                                
                                                                                
          B02.AP_GP_NETTO(INDEX) = ROUND(W_BRUTTO_GP *                          
                                      W_NETTO_AP / W_BRUTTO_AP , 0);            
                                                                                
          REST_FRADRAG = FRADRAG_F - W_BRUTTO_GP                                
                                   + B02.AP_GP_NETTO(INDEX);                    
          IF B02.TP_BRUTTO(INDEX) > 0 THEN                                      
            DO;                                                                 
               B02.TP_NETTO(INDEX) =                                            
                                   ROUND(B02.TP_BRUTTO(INDEX)                   
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);            
               REST_FRADRAG =  REST_FRADRAG -                                   
                               B02.TP_BRUTTO(INDEX) +                           
                               B02.TP_NETTO(INDEX);                             
            END;                                                                
                                                                                
          IF W_BRUTTO_GT   > 0 THEN                                             
            DO;                                                                 
             B02.GT_TILLEGG_LOV92(INDEX)       =                                
                              ROUND(W_BRUTTO_GT                                 
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);            
              REST_FRADRAG =  REST_FRADRAG -                                    
                               W_BRUTTO_GT +                                    
                               B02.GT_TILLEGG_LOV92(INDEX);                     
            END;                                                                
          ELSE                                                                  
            DO;                                                                 
             B02.GT_TILLEGG_LOV92(INDEX)       = 0;                             
            END;                                                                
          IF W_BRUTTO_TP > 0 THEN                                               
            DO;                                                                 
                 IF B02.ALDERSP.ST(INDEX)       =  0 THEN                       
                    B02.AP_TP_NETTO(INDEX) =                                    
                             B02.ALDERSP.TP(INDEX) - REST_FRADRAG;              
                 ELSE                                                           
                  DO;                                                           
                   B02.AP_TP_NETTO(INDEX) = ROUND(W_BRUTTO_TP *                 
                                  W_NETTO_AP / W_BRUTTO_AP , 0);                
                   REST_FRADRAG =  REST_FRADRAG -                               
                                   W_BRUTTO_TP +                                
                                   B02.AP_TP_NETTO(INDEX);                      
                  END;                                                          
            END;                                                                
                                                                                
          IF B02.ALDERSP.ST(INDEX)        > 0 THEN                              
                 B02.AP_ST_NETTO(INDEX)       =                                 
                           B02.ALDERSP.ST(INDEX) - REST_FRADRAG;                
                                                                                
     END;                                                                       
                                                                                
    IF B02.AP_GP_NETTO(INDEX) +                                                 
       B02.AP_TP_NETTO(INDEX) < 10 THEN                                         
                                                                                
       DO;                                                                      
          B02.AP_GP_NETTO(INDEX)       = 0;                                     
          B02.AP_TP_NETTO(INDEX)       = 0;                                     
          B02.AP_ST_NETTO(INDEX)       = 0;                                     
          B02.GT_LOV92  (INDEX)        = 0;                                     
                                                                                
          B02.GARANTITILLEGG_EK(INDEX)                = 0;                      
          B02.GARANTITILLEGG_BARN(INDEX)              = 0;                      
          B02.BT_SÆRBARN(INDEX)                       = 0;                      
          B02.GARANTITILLEGG_SÆRBARN(INDEX)           = 0;                      
          B02.FT_SKAL_BEREGNES(INDEX)                 = 'D';                    
                                                                                
       END;                                                                     
   END;                                                                         
 ELSE   /*FRADRAGET ER MINDRE ENN FRIBELØP */                                   
     DO;                                                                        
        B02.AP_GP_NETTO(INDEX)   = B02.ALDERSP.GP(INDEX);                       
        B02.AP_TP_NETTO(INDEX)   = B02.ALDERSP.TP(INDEX);                       
        B02.TP_NETTO(INDEX)      = B02.TP_BRUTTO (INDEX);                       
        B02.AP_ST_NETTO(INDEX)   = B02.ALDERSP.ST(INDEX);                       
     END;                                                                       
                                                                                
 L500:                                                                          
                                                                                
  B02.ALDERSP.UTTAKS_APD(INDEX) = 000;                                          
  B02.ALDERSP.APD(INDEX) = 000;                                                 
                                                                                
  IF B02.ALDERSP.UTTAKSDATO_ÅMD(INDEX) = 0        THEN                          
     B02.ALDERSP.UTTAKSDATO_ÅMD(INDEX) =                                        
                            B02.VIRK_DATO_ÅMD(INDEX);                           
                                                                                
  B02.ALDERSP.BEREGN_ALT_AEY(INDEX) = DIV_PARAM_OMR.AP_KODE_AEY(INDEX);         
                                                                                
  L999:                                                                         
                                                                                
 END JUSTER_40PROS;                                                             
