 /*   SIST ENDRET PÅ PROD   2003.11.25 12.36.26 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.11.25 12.18.50 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.55.27 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2003.08.13  9.26.06 AV   JDA2970          */        
 /*       SIST ENDRET 28/08-98 14.33.26 AV   SPA7339                  */        
 /*       SIST ENDRET 14/01-98 15.27.29 AV   SPA7339                  */        
 /* ***************************************************************** */        
 /* IDENTIFIKASJON                                                    */        
 /*     R0010427 - PROGRAM SOM HENTER FRAM OMREGNINGSLOGGEN,          */        
 /*                KJØRES UNDER ADMINISTRASJONSDELEN AV SYSTEMET.     */        
 /*                HOVEDPROGRAM I CICS/PLI.                           */        
 /*     PROGRAMMERER: JAN - H. KRISTENSEN SEPTEMBER 1983.             */        
 /* HENSIKT                                                           */        
 /*     PROGRAMMET SKAL LESE RECORDENE I OMREGNINGSLOGGEN OG PAGE     */        
 /*     DISSE UT TIL TERMINAL.                                        */        
 /* PROGRAMTILKNYTNING                                                */        
 /*     BLIR GITT KONTROLL FRA PROGRAM R0010420 SOM ER STYREPROGRAM   */        
 /*     UNDER ADMINISTRASJONSDELEN.                                   */        
 /*                                                                   */        
 /* ***************************************************************** */        
                                                                                
 R001427: PROC(COMMAREA_PEKER)                  OPTIONS (MAIN);                 
                                                                                
    %INCLUDE P0019906;            /* TRANS_OPPL_OMR                   */        
    %INCLUDE S001A0;              /* HOVED - MAP FOR ADMINISTRASJON   */        
    %INCLUDE P0019908;            /* KOM_OMR                          */        
    %INCLUDE P0019910;            /* STYRE_OMR                        */        
    %INCLUDE P0019912;            /* DIV_PARAM_OMR                    */        
    %INCLUDE S001A7;              /* MAP TIL Å BESTEMME HVILKEN       */        
                                  /* SATSVIS JOBB SOM SKAL KJØRES     */        
                                                                                
    DCL PLIXOPT CHAR(27) VAR STATIC EXTERNAL                                    
                            INIT('ISASIZE(3000) NOSTAE NOSPIE');                
    DCL                                                                         
      ACCUM_ANT_G_STAT           FIXED DEC(7) INIT(0),                          
      ACCUM_ANT_OMR_FAM          FIXED DEC(7) INIT(0),                          
      ACCUM_ANT_TIL_TRKLISTE     FIXED DEC(7) INIT(0),                          
      ACCUM_ANT_TIL_OMRNULL      FIXED DEC(7) INIT(0),                          
      CSTG                       BUILTIN,                                       
      ADDR                       BUILTIN,                                       
      LOW                        BUILTIN,                                       
      MAP_CHAR                   CHAR(260) BASED(BMSMAPBR),                     
      UNP                        CHAR(1)      INIT(' '),                        
      BRI_PROT                   CHAR(1)      INIT('Y'),                        
      RBA_PEKER                  POINTER,                                       
      BMSMAPBR                   POINTER,                                       
      COMMAREA_PEKER             POINTER;                                       
                                                                                
                                                                                
    KOM_OMR.TRANS_OPPL_PEKER= ADDR(KOM_OMR.TRANS_OPPL_OMR);                     
    KOM_OMR.STYRINGS_PEKER  = ADDR(KOM_OMR.STYRINGS_OMR);                       
    KOM_OMR.DIV_PARAM_PEKER = ADDR(KOM_OMR.DIV_PARAM_OMR);                      
    TRANSKODE               = 'RA27';        /* DETTE PROGRAM  */               
    PROGRAM_ID              = 'R0010427'  ;  /* DETTE PROGRAM  */               
                                                                                
                                                                                
    EXEC CICS HANDLE CONDITION ENDFILE(ENDFILE);                                
    EXEC CICS STARTBR DATASET ('OMRLOGG') RIDFLD(RBA_PEKER) RBA;                
    EXEC CICS READNEXT DATASET ('OMRLOGG') RIDFLD(RBA_PEKER) RBA                
                                           SET   (BMSMAPBR);                    
                                                                                
    DO WHILE ('A' = 'A');                                                       
                                                                                
       EXEC CICS READNEXT DATASET ('OMRLOGG') RIDFLD(RBA_PEKER) RBA             
                                              SET   (BMSMAPBR);                 
       ACCUM_ANT_G_STAT       =                                                 
             ACCUM_ANT_G_STAT       + S001A7O.ANT_G_STATO;                      
       ACCUM_ANT_OMR_FAM      =                                                 
             ACCUM_ANT_OMR_FAM      + S001A7O.ANT_OMR_FAMO;                     
       ACCUM_ANT_TIL_OMRNULL  =                                                 
             ACCUM_ANT_TIL_OMRNULL  + S001A7O.ANT_TIL_OMRNULLO;                 
       ACCUM_ANT_TIL_TRKLISTE =                                                 
             ACCUM_ANT_TIL_TRKLISTE + S001A7O.ANT_TIL_TRKLISTO;                 
                                                                                
    END;                                                                        
                                                                                
       S001A7O.DATO_MÅA       =       UNP;                                      
       S001A7O.RECORD_TYPEA   =       BRI_PROT;                                 
       S001A7I.DATO_MÅL       =       -1;                                       
                                                                                
       EXEC CICS SEND MAP('S001A7') MAPSET('S001A73')  ERASE                    
                          CURSOR    ACCUM PAGING;                               
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
  ENDFILE:                                                                      
    MAP_CHAR                  =  LOW (250);                                     
    S001A7O.DATO_MÅA          =  UNP;                                           
    S001A7I.DATO_MÅI          =  ' ';                                           
    S001A7I.DATO_MÅL          =  -1;                                            
    S001A7O.ANT_G_STATO       =  ACCUM_ANT_G_STAT;                              
    S001A7O.ANT_OMR_FAMO      =  ACCUM_ANT_OMR_FAM;                             
    S001A7O.ANT_TIL_OMRNULLO  =  ACCUM_ANT_TIL_OMRNULL ;                        
    S001A7O.ANT_TIL_TRKLISTO  =  ACCUM_ANT_TIL_TRKLISTE;                        
    S001A7O.MELDINGO          = 'HER ER DE AKKUMULERTE TALLENE';                
                                                                                
    EXEC CICS SEND   MAP('S001A7') MAPSET('S001A73')  ERASE                     
                                   CURSOR  ACCUM PAGING;                        
                                                                                
    EXEC CICS SEND   PAGE RETAIN;                                               
                                                                                
    EXEC CICS SEND   MAP  ('S001A0') MAPSET  ('S001A03') MAPONLY ERASE;         
                                                                                
    EXEC CICS RETURN TRANSID('RA20') COMMAREA(KOM_OMR);                         
                                                                                
 END R001427;                                                                   
                                                                                
