 /*       SIST ENDRET 26/11-97 12.54.35 AV   SPA7339                  */00000000
 /* ***************************************************************  */ 00000010
 /* PROC FOR KONVERTERING AV DATO  6 CHAR / 7 CHAR TIL 9 CHAR        */ 00000020
 /*              DD.MND.ÅR   ->  HHÅR.MND.DD                        */  00000030
 /* ***************************************************************  */ 00000040
  KONV_HÅMD_DMÅ: PROC(IN_DATO) RETURNS(PIC '(6)9'  );                   00000050
  DCL IN_DATO     PIC '(8)9';                                           00000060
  DCL UT_DATO     PIC '(6)9'   ;                                        00000070
                                                                        00000080
  DCL 1 H_DATO,                                                         00000090
        02 HH     PIC '99'  INIT (00),                                  00000100
        02 ÅR     PIC '99'  INIT (00),                                  00000110
        02 MM     PIC '99'  INIT (00),                                  00000120
        02 DD     PIC '99'  INIT (00),                                  00000130
      1 H_DATO_IN DEF H_DATO PIC '99999999';                            00000140
                                                                        00000150
  DCL 1 H_DATO_UT,                                                      00000160
        02 DD     PIC '99'  INIT (00),                                  00000170
        02 MM     PIC '99'  INIT (00),                                  00000180
        02 ÅR     PIC '99'  INIT (00),                                  00000190
      1 H_DATO_UT_PK  DEF H_DATO_UT  PIC '999999';                      00000200
                                                                        00000210
  /*              ************                  */                      00000220
  IF IN_DATO > 0 THEN                                                   00000230
     DO;                                                                00000240
         H_DATO_IN = IN_DATO;                                           00000250
         H_DATO_UT = H_DATO, BY NAME;                                   00000260
     END;                                                               00000270
  ELSE                                                                  00000280
     H_DATO_UT_PK  = 0      ;                                           00000290
                                                                        00000300
     UT_DATO = H_DATO_UT_PK;                                            00000310
                                                                        00000320
     RETURN (UT_DATO);                                                  00000330
  END KONV_HÅMD_DMÅ;                                                    00000340
                                                                        00000350
