 /*       SIST ENDRET 02/01-92 08.44.44 AV   DYBVIK                   */00000000
 /*       SIST ENDRET 04/11-91 12.19.10 AV   DYBVIK                   */00000010
 /******************************************************************* */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /************************                                            */00000040
 /*  PROGRAM-IDENT : R001TK07 - HOVEDPROGRAM.                         */00000050
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */00000060
 /*  PROGRAMMERER  : TUYEN                                            */00000070
 /*  PROGRAM LAGET : JAN 91                                           */00000080
 /*          ENDRET: AUG 91 (SKRIV OM PGA MULIGHET FOR SØKING PÅ      */00000090
 /*                          TKNAVN OG TKSJEF)                        */00000100
 /******************************************************************* */00000110
 /*HENSIKT:                                                           */00000120
 /************                                                        */00000130
 /*  BLANKETTKONTROLL FOR TK-OPPLYSNINGER.                            */00000140
 /******************************************************************* */00000150
 /*PROGRAMTILKNYTTING:                                                */00000160
 /**********************                                              */00000170
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSKODE RT07.          */00000180
 /*                                                                   */00000190
 /******************************************************************* */00000200
 /*DATASETTOPPLYSNINGER:                                              */00000210
 /*************************                                           */00000220
 /*  SKRIV TIL     T001/P001.TKNRTAB                                  */00000230
 /*                T001/P001.TKLISTE.VSAM                             */00000240
 /*                T001/P001.FORANDRE.VSAM                            */00000250
 /*                                                                   */00000260
 /******************************************************************* */00000270
 /*FEILMELDINGER:                                                     */00000280
 /*********************                                               */00000290
 /*                                                                   */00000300
 /*                                                                   */00000310
 /* ***************************************************************** */00000320
 R001TK7:                                                               00000330
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                  00000340
                                                                        00000350
 %PAGE;                                                                 00000360
      %INCLUDE S001T4;             /* TK-MAPSETTET   */                 00000370
 %PAGE;                                                                 00000380
      %INCLUDE P001TK02;           /* TRANS-OMR FOR REG AV TK-OPPL. */  00000390
 %PAGE;                                                                 00000400
      %INCLUDE P001TK05;           /* TRANS-OMR FOR REG AV TLFNR.   */  00000410
 %PAGE;                                                                 00000420
      %INCLUDE P001TK06;           /* TRANS-OMR FOR REG AV KOMMNR.  */  00000430
 %PAGE;                                                                 00000440
      %INCLUDE P001TK07;           /* TRANS-OMR FOR REG AV SATELITT */  00000450
 %PAGE;                                                                 00000460
      %INCLUDE P001TK03;           /* KOM_OMRÅDE (BASED) */             00000470
 %PAGE;                                                                 00000480
      %INCLUDE DFHBMSCA;                                                00000490
 %PAGE;                                                                 00000500
      %INCLUDE DFHAID;                                                  00000510
 %PAGE;                                                                 00000520
                                                                        00000530
 /* PCB-OMRÅDER */                                                      00000540
 /*-------------*/                                                      00000550
                                                                        00000560
   DCL 1 TK_PCB_PEKER BASED (UIBPCBAL),                                 00000570
         2 TK1_PCB_PEKER POINTER,                                       00000580
         2 TK2_PCB_PEKER POINTER,                                       00000590
         2 TK3_PCB_PEKER POINTER;                                       00000600
                                                                        00000610
   DCL 1 TK1 BASED (TK1_PCB_PEKER),                                     00000620
      %INCLUDE P0012003;                                                00000630
                                                                        00000640
   DCL 1 TK2 BASED (TK2_PCB_PEKER),                                     00000650
      %INCLUDE P0012003;                                                00000660
                                                                        00000670
   DCL 1 TK3 BASED (TK3_PCB_PEKER),                                     00000680
      %INCLUDE P0012003;                                                00000690
                                                                        00000700
 %PAGE;                                                                 00000710
                                                                        00000720
 /* SSA */                                                              00000730
 /*-----*/                                                              00000740
                                                                        00000750
   DCL 1 SSA_TK STATIC,                                                 00000760
         5 HDEL     CHAR (17)   INIT ('TK      (TKNR    '),             00000770
         5 REL_OP   CHAR ( 2)   INIT (' ='),                            00000780
         5 KEY      PIC '( 4)9' INIT (0),                               00000790
         5 HP       CHAR ( 1)   INIT (')');                             00000800
                                                                        00000810
   DCL 1 SSA_TK2 STATIC,                                                00000820
         5 HDEL     CHAR (17)   INIT ('TK      (XTKNAVN '),             00000830
         5 REL_OP   CHAR ( 2)   INIT ('=>'),                            00000840
         5 KEY      CHAR (35)   INIT (''),                              00000850
         5 HP       CHAR ( 1)   INIT (')');                             00000860
                                                                        00000870
   DCL 1 SSA_TK3 STATIC,                                                00000880
         5 HDEL     CHAR (17)   INIT ('TK      (XTKSJEF '),             00000890
         5 REL_OP   CHAR ( 2)   INIT ('=>'),                            00000900
         5 KEY      CHAR (30)   INIT (''),                              00000910
         5 HP       CHAR ( 1)   INIT (')');                             00000920
                                                                        00000930
 /* SEGMENTER */                                                        00000940
 /*-----------*/                                                        00000950
                                                                        00000960
  %INCLUDE P001TK51;               /* TK-SEGMENT    */                  00000970
                                                                        00000980
  %INCLUDE P001TK55;               /* TLF-SEGMENT   */                  00000990
                                                                        00001000
  %INCLUDE P001TK56;               /* KOMM-SEGMENT  */                  00001010
                                                                        00001020
  %INCLUDE P001TK57;               /* SATELITT-SEGM.*/                  00001030
                                                                        00001040
 /* DLI PARAMETRE */                                                    00001050
 /*---------------*/                                                    00001060
                                                                        00001070
   %INCLUDE DLIUIB;                                                     00001080
                                                                        00001090
   DCL PLITDLI           EXTERNAL ENTRY;                                00001100
                                                                        00001110
   DCL GU                CHAR      ( 4) INIT ('GU  '),                  00001120
       GN                CHAR      ( 4) INIT ('GN  '),                  00001130
       GHU               CHAR      ( 4) INIT ('GHU '),                  00001140
       GHNP              CHAR      ( 4) INIT ('GHNP'),                  00001150
       GNP               CHAR      ( 4) INIT ('GNP '),                  00001160
       ISRT              CHAR      ( 4) INIT ('ISRT'),                  00001170
       REPL              CHAR      ( 4) INIT ('REPL'),                  00001180
       DLET              CHAR      ( 4) INIT ('DLET'),                  00001190
       TRE               FIXED BIN (31) INIT (3)     ,                  00001200
       FIRE              FIXED BIN (31) INIT (4)     ,                  00001210
       FEM               FIXED BIN (31) INIT (5)     ,                  00001220
       TK_OPEN           CHAR      ( 5) INIT ('OPEN '),                 00001230
       TK_CLOSE          CHAR      ( 5) INIT ('CLOSE'),                 00001240
       SSA_TK_UQUAL      CHAR      ( 9) INIT ('TK       '),             00001250
       SSA_TLF_UQUAL     CHAR      ( 9) INIT ('TELEFON  '),             00001260
       SSA_KOMM_UQUAL    CHAR      ( 9) INIT ('KOMMUNE  '),             00001270
       SSA_SAT_UQUAL     CHAR      ( 9) INIT ('SATELITT ');             00001280
   DCL                                                                  00001290
      (BMSMAPBR,                                                        00001300
      COMMAREA_PEKER) PTR;                                              00001310
   DCL                                                                  00001320
      (CSTG,                                                            00001330
      STG,                                                              00001340
      ADDR,                                                             00001350
      VERIFY,                                                           00001360
      UNSPEC,                                                           00001370
      NULL,                                                             00001380
      LOW,                                                              00001390
      ONCODE,                                                           00001400
      DATE,                                                             00001410
      LENGTH,                                                           00001420
      TRANSLATE,                                                        00001430
      SUBSTR) BUILTIN;                                                  00001440
                                                                        00001450
   DCL STR CHAR(2000) BASED;                                            00001460
                                                                        00001470
 /* HJELPE-VARIABLE */                                                  00001480
 /*-----------------*/                                                  00001490
                                                                        00001500
   DCL                                                                  00001510
      FEIL_I_TK                   BIT(1),                               00001520
      FEIL_I_ANDRE                BIT(1),                               00001530
      ONKODE                      PIC'9999',                            00001540
      I                           PIC'99'  ,                            00001550
      K                           PIC '99',                             00001560
      NR_TAB(1:10)                PIC '9999',                           00001570
      LES_TKNR                    PIC '9999',                           00001580
      LES_NAVN                    CHAR (35) ,                           00001590
      LES_SJEF                    CHAR (30) ,                           00001600
      SOK_NR                      BIT (1) INIT ('0'B),                  00001610
      CURSOR_POS                  FIXED BIN(15) INIT(-1),               00001620
      TELEFAX_L                   FIXED BIN(15) INIT(0),                00001630
      SJEFTLF_L                   FIXED BIN(15) INIT(0),                00001640
      ONK DEF ONKODE              CHAR(4),                              00001650
      FEIL                        FIXED BIN(15) INIT(0),                00001660
      FEILKODE                    CHAR(4),                              00001670
      ANT_FEIL_SKREVET            FIXED DEC (3),                        00001680
      FATAL_FEIL                  BIT (1) INIT ('0'B),                  00001690
      SKRIV_BASE_OK               BIT (1) INIT ('0'B),                  00001700
      TK_FINNES                   BIT (1) INIT ('0'B),                  00001710
      POSTFUNNET                  BIT (1) INIT ('1'B),                  00001720
      LEGG_TILBAKE_TLF_KOMM       BIT (1) INIT ('0'B),                  00001730
      DSNAVN                      CHAR(8),                              00001740
      X2                          CHAR(29),                             00001750
      X3                          CHAR(29);                             00001760
                                                                        00001770
   DCL HJ_TLF( 2)     CHAR(13)  ,                                       00001780
       HJ_KOMM(2)     PIC '(4)9',                                       00001790
       HJ_SAT(10)     PIC '(4)9',                                       00001800
       HJ_STILLING    CHAR (7);                                         00001810
                                                                        00001820
    DCL 01 POST_REC,                                                    00001830
           05  BL1                     CHAR ( 1),                       00001840
           05  POSTNR           BIN FIXED   (15),                       00001850
           05  BL2                     CHAR ( 4),                       00001860
           05  POSTSTED_KORT           CHAR (11),                       00001870
           05  POSTSTED_LANG           CHAR (26),                       00001880
           05  BL3                     CHAR ( 2);                       00001890
                                                                        00001900
    DCL POST_PEKER                     POINTER;                         00001910
    DCL POST_KEY                       CHAR ( 2)  BASED (POST_PEKER) ;  00001920
    DCL POST_BIN                BIN FIXED   (15)  ;                     00001930
                                                                        00001940
   DCL 1 FEIL_STRUC,                                                    00001950
         5 FEIL_NR      FIXED DEC ( 5),                                 00001960
         5 FEIL_MELDING      CHAR (78),                                 00001970
         5 KOM_OMR_PEKER  POINTER;                                      00001980
                                                                        00001990
   DCL   NOKKEL   PIC '(4)9',                                           00002000
         NOKKEL_2 CHAR (12);                                            00002010
                                                                        00002020
   DCL 1 TKNRTAB_REC,                                                   00002030
         5 TKNR        PIC '( 4)9',                                     00002040
         5 TKNAVN     CHAR  (25),                                       00002050
         5 ADR1       CHAR  (35),                                       00002060
         5 POST       CHAR  ( 5),                                       00002070
         5 ADR2       CHAR  (25),                                       00002080
         5 SORT       CHAR  ( 1),                                       00002090
         5 MÅLFORM    CHAR  ( 1),                                       00002100
         5 KDSENTRAL  CHAR  ( 3),                                       00002110
         5 EDBSYSTEM  CHAR  ( 1),                                       00002120
         5 ANT_BREV   CHAR  ( 1);                                       00002130
                                                                        00002140
   DCL 1 TKLISTE_REC,                                                   00002150
         5 TKNR        PIC '( 4)9',                                     00002160
         5 TKNAVN     CHAR  (23),                                       00002170
         5 ADR1       CHAR  (20),                                       00002180
         5 POSTNR     PIC  '( 4)9',                                     00002190
         5 POSTNAVN   CHAR  (17),                                       00002200
         5 TK_SJEF    CHAR  (25),                                       00002210
         5 TLF        CHAR  (12),                                       00002220
         5 TELEFAX    CHAR  (13),                                       00002230
         5 INNBYGG    PIC  '( 6)9',                                     00002240
         5 MÅLFORM    CHAR  ( 1);                                       00002250
                                                                        00002260
   DCL 1 FORANDRE_REC,                                                  00002270
         5 DATO  CHAR (6),                                              00002280
         5 BL    CHAR (2),                                              00002290
         5 TKNR  CHAR (4);                                              00002300
                                                                        00002310
   DCL YYMMDD CHAR (6);                                                 00002320
                                                                        00002330
 %PAGE;                                                                 00002340
                                                                        00002350
 /* SLUTT PÅ DEKLARASJONER */                                           00002360
 /**************************/                                           00002370
                                                                        00002380
 ON ERROR SNAP BEGIN       ;                                            00002390
    ON ERROR SYSTEM        ;                                            00002400
    ONKODE=ONCODE          ;                                            00002410
    FEILKODE = 'FEIL'      ;                                            00002420
    DSNAVN   = EIBDS       ;                                            00002430
    GO TO FEILBEH          ;                                            00002440
 END;                                                                   00002450
                                                                        00002460
 FEILKODE        = 'FEIL'   ;                                           00002470
 DSNAVN          = '       ';                                           00002480
 PROGRAM_ID      = 'R001TK07';                                          00002490
                                                                        00002500
 EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                             00002510
 EXEC CICS IGNORE CONDITION MAPFAIL       ;                             00002520
 EXEC CICS IGNORE CONDITION LENGERR       ;                             00002530
                                                                        00002540
 FUNKSJONSKODE = ' ';                                                   00002550
 STYREKODE     = ' ';                                                   00002560
 POST_PEKER    = ADDR(POST_BIN);                                        00002570
                                                                        00002580
 X2 = 'ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ';                                  00002590
 X3 = 'abcdefghijklmnopqrstuvwxyzæøå';                                  00002600
                                                                        00002610
 CALL BLANK_TRANS;                                                      00002620
                                                                        00002630
 CALL TK_DATABASE(TK_OPEN);                                             00002640
                                                                        00002650
 IF SEND_MAP THEN                                                       00002660
    DO;                                                                 00002670
       SEND_MAP = '0'B;                                                 00002680
                                                                        00002690
       ALLOCATE S001021O;                                               00002700
       S001021I.TKNRL = CURSOR_POS;                                     00002710
                                                                        00002720
       EXEC CICS SEND MAP('S001021')                                    00002730
                MAPSET('S001T43') ERASE CURSOR;                         00002740
    END;                                                                00002750
                                                                        00002760
 EXEC CICS RECEIVE MAP('S001021')                                       00002770
        MAPSET('S001T43') SET(BMSMAPBR) ASIS;                           00002780
                                                                        00002790
 IF S001021I.FUNKSJONSKODEL > 0 THEN                                    00002800
     FUNKSJONSKODE = S001021I.FUNKSJONSKODEI;                           00002810
 ELSE                                                                   00002820
     IF S001021I.STYREKODEL > 0 THEN                                    00002830
          STYREKODE = S001021I.STYREKODEI;                              00002840
                                                                        00002850
 DO WHILE ((FUNKSJONSKODE = ' ') &                                      00002860
           (STYREKODE = ' '));                                          00002870
                                                                        00002880
   LES_NAVN = '';                                                       00002890
   LES_SJEF = '';                                                       00002900
                                                                        00002910
   IF S001021I.TKNRL > 0 THEN                                           00002920
      DO;                                                               00002930
         LES_TKNR = S001021I.TKNRI;                                     00002940
         TK0.TKNR = S001021I.TKNRI;                                     00002950
         SOK_NR = '1'B;                                                 00002960
      END;                                                              00002970
   ELSE                                                                 00002980
      IF S001021I.TKNAVNL > 0 THEN                                      00002990
         DO;                                                            00003000
            LES_NAVN = TRANSLATE(S001021I.TKNAVNI,X2,X3);               00003010
                                                                        00003020
            SOK_NR   = '0'B;                                            00003030
         END;                                                           00003040
      ELSE                                                              00003050
         IF S001021I.TKSJEFL > 0 THEN                                   00003060
            DO;                                                         00003070
               LES_SJEF = TRANSLATE(S001021I.TKSJEFI,X2,X3);            00003080
                                                                        00003090
               SOK_NR   = '0'B;                                         00003100
            END;                                                        00003110
         ELSE                                                           00003120
            DO;                                                         00003130
               LES_TKNR = 0;                                            00003140
               SOK_NR = '1'B;                                           00003150
            END;                                                        00003160
                                                                        00003170
   ALLOCATE S001017O;                                                   00003180
   S001017I.TKNRL = CURSOR_POS;                                         00003190
                                                                        00003200
   S001017O.FUNKSJONSKODEA = DFHBMFSE;                                  00003210
                                                                        00003220
   IF SOK_NR THEN                                                       00003230
      CALL BEHANDLE;                                                    00003240
                                                                        00003250
   ELSE                                                                 00003260
      IF LES_NAVN ^= '' THEN                                            00003270
         DO;                                                            00003280
            K           = 1;                                            00003290
            NR_TAB      = 0;                                            00003300
                                                                        00003310
            SSA_TK2.KEY = LES_NAVN;                                     00003320
            CALL LES_DB_NAVN;                                           00003330
                                                                        00003340
            IF TK_FINNES THEN                                           00003350
               DO WHILE (TK_FINNES & (K < 11));                         00003360
                  NR_TAB(K) = TK.TKNR;                                  00003370
                  K         = K + 1;                                    00003380
                                                                        00003390
                  SSA_TK2.KEY = LES_NAVN;                               00003400
                  CALL LES_DB_NAVN_NESTE;                               00003410
               END;                                                     00003420
                                                                        00003430
            ELSE                                                        00003440
               DO;                                                      00003450
                  ALLOCATE S001021O;                                    00003460
                  S001021O.MELDING_1O =                                 00003470
                             'INGEN TK MED SLIK NAVN FINNES!';          00003480
                  S001021I.TKNRL      = CURSOR_POS;                     00003490
                                                                        00003500
                  GOTO L900;                                            00003510
               END;                                                     00003520
                                                                        00003530
            K = 1;                                                      00003540
                                                                        00003550
            DO WHILE ((K < 11) & (NR_TAB(K) ^= 0));                     00003560
               LES_TKNR = NR_TAB(K);                                    00003570
                                                                        00003580
               CALL BEHANDLE;                                           00003590
                                                                        00003600
               S001017O.MELDING1O = 'DERSOM DU IKKE VIL SØKE MER';      00003610
               S001017O.MELDING2O = 'ETTER DETTE NAVNET SKRIV M I';     00003620
               S001017O.MELDING3O = 'STYREKODE OG TRYKK ENTER';         00003630
               S001017O.MELDING4O = '';                                 00003640
               S001017O.MELDING5O = 'ELLERS TRYKK BARE ENTER';          00003650
                                                                        00003660
               S001017I.STYREKODEL= CURSOR_POS;                         00003670
                                                                        00003680
               EXEC CICS SEND MAP ('S001017') MAPSET ('S001T43')        00003690
                         CURSOR ERASE;                                  00003700
                                                                        00003710
               EXEC CICS RECEIVE MAP ('S001017') MAPSET ('S001T43')     00003720
                         SET (BMSMAPBR);                                00003730
                                                                        00003740
               CALL SJEKK_UT;                                           00003750
                                                                        00003760
               K = K + 1;                                               00003770
            END;                                                        00003780
         END;                                                           00003790
                                                                        00003800
      ELSE  /* LES_SJEF ^= '' */                                        00003810
         DO;                                                            00003820
            K           = 1;                                            00003830
            NR_TAB      = 0;                                            00003840
                                                                        00003850
            SSA_TK3.KEY = LES_SJEF;                                     00003860
            CALL LES_DB_SJEF;                                           00003870
                                                                        00003880
            IF TK_FINNES THEN                                           00003890
               DO WHILE (TK_FINNES & (K < 11));                         00003900
                  NR_TAB(K) = TK.TKNR;                                  00003910
                  K         = K + 1;                                    00003920
                                                                        00003930
                  SSA_TK3.KEY = LES_SJEF;                               00003940
                  CALL LES_DB_SJEF_NESTE;                               00003950
               END;                                                     00003960
                                                                        00003970
            ELSE                                                        00003980
               DO;                                                      00003990
                  ALLOCATE S001021O;                                    00004000
                  S001021O.MELDING_1O =                                 00004010
                             'INGEN TK MED SLIK SJEF FINNES!';          00004020
                  S001021I.TKNRL      = CURSOR_POS;                     00004030
                                                                        00004040
                  GOTO L900;                                            00004050
               END;                                                     00004060
                                                                        00004070
            K = 1;                                                      00004080
                                                                        00004090
            DO WHILE ((K < 11) & (NR_TAB(K) ^= 0));                     00004100
               LES_TKNR = NR_TAB(K);                                    00004110
                                                                        00004120
               CALL BEHANDLE;                                           00004130
                                                                        00004140
               S001017O.MELDING1O = 'DERSOM DU IKKE VIL SØKE MER';      00004150
               S001017O.MELDING2O = 'ETTER DENNE SJEFEN SKRIV M I';     00004160
               S001017O.MELDING3O = 'STYREKODE OG TRYKK ENTER';         00004170
               S001017O.MELDING4O = '';                                 00004180
               S001017O.MELDING5O = 'ELLERS TRYKK BARE ENTER';          00004190
                                                                        00004200
               S001017I.STYREKODEL= CURSOR_POS;                         00004210
                                                                        00004220
               EXEC CICS SEND MAP ('S001017') MAPSET ('S001T43')        00004230
                         CURSOR ERASE;                                  00004240
                                                                        00004250
               EXEC CICS RECEIVE MAP ('S001017') MAPSET ('S001T43')     00004260
                         SET (BMSMAPBR);                                00004270
                                                                        00004280
               CALL SJEKK_UT;                                           00004290
                                                                        00004300
               K = K + 1;                                               00004310
            END;                                                        00004320
         END;                                                           00004330
                                                                        00004340
                                                                        00004350
   LEGG_TILBAKE_TLF_KOMM = '0'B;                                        00004360
                                                                        00004370
   CALL BLANK_TRANS;                                                    00004380
                                                                        00004390
   ALLOCATE S001021O;                                                   00004400
   S001021I.TKNRL = CURSOR_POS;                                         00004410
                                                                        00004420
   S001021O.MELDING_1O = 'DATA ER BLITT OPPDATERT/REGISTRERT!';         00004430
                                                                        00004440
 L900:                                                                  00004450
                                                                        00004460
   EXEC CICS SEND MAP('S001021') MAPSET('S001T43')                      00004470
        ERASE CURSOR ;                                                  00004480
                                                                        00004490
   EXEC CICS RECEIVE MAP('S001021')                                     00004500
               MAPSET('S001T43') SET(BMSMAPBR) ASIS;                    00004510
                                                                        00004520
   IF S001021I.FUNKSJONSKODEL > 0 THEN                                  00004530
      FUNKSJONSKODE = S001021I.FUNKSJONSKODEI;                          00004540
   ELSE                                                                 00004550
      IF S001021I.STYREKODEL > 0 THEN                                   00004560
         STYREKODE = S001021I.STYREKODEI;                               00004570
                                                                        00004580
 END; /* WHILE */                                                       00004590
                                                                        00004600
 CALL TK_DATABASE(TK_CLOSE);                                            00004610
                                                                        00004620
 IF FUNKSJONSKODE ^= ' ' THEN                                           00004630
    IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                           00004640
      DO;                                                               00004650
         PROGRAM_ID = 'R001TK04';                                       00004660
         TRANSKODE = 'RT04';                                            00004670
      END;                                                              00004680
                                                                        00004690
    ELSE                                                                00004700
      IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                         00004710
         DO;                                                            00004720
            TRANSKODE = 'RT08';                                         00004730
            PROGRAM_ID = 'R001TK08';                                    00004740
         END;                                                           00004750
                                                                        00004760
      ELSE                                                              00004770
         IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                      00004780
            DO;                                                         00004790
               PROGRAM_ID = 'R001TK09';                                 00004800
               TRANSKODE = 'RT09';                                      00004810
            END;                                                        00004820
                                                                        00004830
         ELSE                                                           00004840
            DO;                                                         00004850
               PROGRAM_ID = 'R001TK03';                                 00004860
               TRANSKODE = 'RT03';                                      00004870
            END;                                                        00004880
                                                                        00004890
 ELSE                                                                   00004900
   IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                                00004910
      DO;                                                               00004920
         IF SUBSTR(FUNKSJON,3,1) = '' THEN                              00004930
            DO;                                                         00004940
                PROGRAM_ID = 'R001TK04';                                00004950
                TRANSKODE = 'RT04';                                     00004960
            END;                                                        00004970
         ELSE                                                           00004980
            DO;                                                         00004990
               PROGRAM_ID = 'R001TK07';                                 00005000
               TRANSKODE = 'RT07';                                      00005010
            END;                                                        00005020
      END;                                                              00005030
                                                                        00005040
   ELSE                                                                 00005050
      IF (VERIFY(STYREKODE, 'Kk') = 0) THEN                             00005060
         DO;                                                            00005070
            IF SUBSTR(FUNKSJON,6,1) = '' THEN                           00005080
               DO;                                                      00005090
                   PROGRAM_ID = 'R001TK04';                             00005100
                   TRANSKODE = 'RT04';                                  00005110
               END;                                                     00005120
            ELSE                                                        00005130
               DO;                                                      00005140
                  PROGRAM_ID = 'R001TK06';                              00005150
                  TRANSKODE = 'RT06';                                   00005160
               END;                                                     00005170
         END;                                                           00005180
      ELSE                                                              00005190
         IF (VERIFY(STYREKODE, 'Ss') = 0) THEN                          00005200
            DO;                                                         00005210
               PROGRAM_ID = 'R001TK60';                                 00005220
               TRANSKODE = 'RT60';                                      00005230
            END;                                                        00005240
         ELSE                                                           00005250
            IF (VERIFY(STYREKODE, 'Dd') = 0) THEN                       00005260
               DO;                                                      00005270
                  PROGRAM_ID = 'R001TK61';                              00005280
                  TRANSKODE = 'RT61';                                   00005290
               END;                                                     00005300
            ELSE                                                        00005310
               IF (VERIFY(STYREKODE, 'Ff') = 0) THEN                    00005320
                  DO;                                                   00005330
                     PROGRAM_ID = 'R001TK62';                           00005340
                     TRANSKODE = 'RT62';                                00005350
                  END;                                                  00005360
               ELSE                                                     00005370
                  DO;                                                   00005380
                     PROGRAM_ID = 'R001TK04';                           00005390
                     TRANSKODE = 'RT04';                                00005400
                  END;                                                  00005410
                                                                        00005420
 SEND_MAP      = '1'B;                                                  00005430
 STYREKODE     = ' ';                                                   00005440
 FUNKSJONSKODE = ' ';                                                   00005450
                                                                        00005460
 EXEC CICS XCTL PROGRAM(PROGRAM_ID) COMMAREA(KOM_OMR);                  00005470
                                                                        00005480
                                                                        00005490
 /* INTERNE PROSEDYRER */                                               00005500
 /**********************/                                               00005510
                                                                        00005520
 BEHANDLE: PROC;                                                        00005530
                                                                        00005540
     CALL LES_DB_TKNR;                                                  00005550
                                                                        00005560
     IF ^TK_FINNES THEN                                                 00005570
        S001017O.TKNRO = LES_TKNR;                                      00005580
                                                                        00005590
     ELSE                                                               00005600
        DO;                                                             00005610
           CALL GI_SKJERM_TKTRANS_DATA;                                 00005620
           CALL BEHANDLE_TLF_KOMM_SAT_SEGM;                             00005630
           CALL GI_SKJERM_T_K_S_TRANS_DATA;                             00005640
        END;                                                            00005650
                                                                        00005660
     EXEC CICS SEND MAP('S001017') MAPSET('S001T43')                    00005670
          ERASE CURSOR;                                                 00005680
                                                                        00005690
     EXEC CICS RECEIVE MAP('S001017') MAPSET('S001T43')                 00005700
           SET(BMSMAPBR) ASIS;                                          00005710
                                                                        00005720
     LEGG_TILBAKE_TLF_KOMM = '1'B;                                      00005730
                                                                        00005740
     CALL SJEKK_UT;                                                     00005750
                                                                        00005760
     CALL SJEKK_FEIL;                                                   00005770
                                                                        00005780
     CALL LES_DB_TKNR;                                                  00005790
                                                                        00005800
     CALL SKRIV_BASEN;                                                  00005810
                                                                        00005820
     CALL SKRIV_FIL;                                                    00005830
                                                                        00005840
 END BEHANDLE;                                                          00005850
                                                                        00005860
                                                                        00005870
 GI_SKJERM_TKTRANS_DATA: PROC;                                          00005880
                                                                        00005890
         S001017I.TKNAVNL = CURSOR_POS;                                 00005900
         S001017O.TKNRA   = DFHPROTI;                                   00005910
                                                                        00005920
         S001017O.TKNRO            = TK.TKNR;                           00005930
         S001017O.TKNAVNO          = TK.TKNAVN;                         00005940
         S001017O.BESØKADRO        = TK.BESØKADR;                       00005950
                                                                        00005960
         IF TK.BPOSTNR ^= 0 THEN                                        00005970
            S001017O.BPOSTNRO         = TK.BPOSTNR;                     00005980
         ELSE                                                           00005990
            S001017O.BPOSTNRO         = LOW(4);                         00006000
                                                                        00006010
         S001017O.POSTADRO         = TK.POSTADR;                        00006020
         S001017O.PPOSTNRO         = TK.PPOSTNR;                        00006030
         S001017O.TELEFAXO         = TK.TELEFAX;                        00006040
         S001017O.TKSJEFO          = TK.TKSJEF;                         00006050
         S001017O.SJEFTLFO         = TK.SJEFTLF;                        00006060
         S001017O.SORTKRITERIUMO   = TK.SORTKRITERIUM;                  00006070
         S001017O.DATASENTRALO     = TK.DATASENTRAL;                    00006080
                                                                        00006090
         IF TK.DATASENTRALNR ^= 0 THEN                                  00006100
            S001017O.DATASENTRALNRO   = TK.DATASENTRALNR;               00006110
         ELSE                                                           00006120
            S001017O.DATASENTRALNRO   = LOW(3);                         00006130
                                                                        00006140
         S001017O.EDBSYSTEMO       = TK.EDBSYSTEM;                      00006150
                                                                        00006160
         IF TK.ARBEIDSKONTOR ^= 0 THEN                                  00006170
            S001017O.ARBEIDSKONTORO   = TK.ARBEIDSKONTOR;               00006180
         ELSE                                                           00006190
            S001017O.ARBEIDSKONTORO   = LOW(4);                         00006200
                                                                        00006210
         IF TK.ARBEIDSGIVER ^= 0 THEN                                   00006220
            S001017O.ARBEIDSGIVERO    = TK.ARBEIDSGIVER;                00006230
         ELSE                                                           00006240
            S001017O.ARBEIDSGIVERO    = LOW(8);                         00006250
                                                                        00006260
         S001017O.MÅLFORMO         = TK.MÅLFORM;                        00006270
                                                                        00006280
         IF TK.LOKALMASKINNR ^= 0 THEN                                  00006290
            S001017O.LOKALMASKINNRO   = TK.LOKALMASKINNR;               00006300
         ELSE                                                           00006310
            S001017O.LOKALMASKINNRO   = LOW(3);                         00006320
                                                                        00006330
         IF TK.ABONNEMENTNR ^= 0 THEN                                   00006340
            S001017O.ABONNEMENTNRO    = TK.ABONNEMENTNR;                00006350
         ELSE                                                           00006360
            S001017O.ABONNEMENTNRO    = LOW(10);                        00006370
                                                                        00006380
         S001017O.SAMBANDO         = TK.SAMBAND;                        00006390
                                                                        00006400
         IF TK.HASTIGHET ^= 0 THEN                                      00006410
            S001017O.HASTIGHETO       = TK.HASTIGHET;                   00006420
         ELSE                                                           00006430
            S001017O.HASTIGHETO       = LOW(5);                         00006440
                                                                        00006450
         S001017O.REGNSKAPANSVAR1O = TK.REGNSKAPSANSVAR1;               00006460
         S001017O.REGNSKAPANSVAR2O = TK.REGNSKAPSANSVAR2;               00006470
                                                                        00006480
         IF TK.ÅRHUSLEIEREG ^= 0 THEN                                   00006490
            S001017O.ÅRHUSLEIEREGO    = TK.ÅRHUSLEIEREG;                00006500
         ELSE                                                           00006510
            S001017O.ÅRHUSLEIEREGO    = LOW(4);                         00006520
                                                                        00006530
         S001017O.MRKFYLKEO        = TK.MRKFYLKE;                       00006540
         S001017O.MRKREVISJONO     = TK.MRKREVISJON;                    00006550
                                                                        00006560
         IF TK.REV_DISTRIKT ^= 0 THEN                                   00006570
            S001017O.REV_DISTRIKTO    = TK.REV_DISTRIKT;                00006580
         ELSE                                                           00006590
            S001017O.REV_DISTRIKTO    = LOW(4);                         00006600
                                                                        00006610
         IF TK.FYLKESKONTOR ^= 0 THEN                                   00006620
            S001017O.FYLKESKONTORO    = TK.FYLKESKONTOR;                00006630
         ELSE                                                           00006640
            S001017O.FYLKESKONTORO    = LOW(2);                         00006650
                                                                        00006660
         IF TK.ANT_BREV     ^= 0 THEN                                   00006670
            S001017O.ANT_BREVO        = TK.ANT_BREV    ;                00006680
         ELSE                                                           00006690
            S001017O.ANT_BREVO        = LOW(1);                         00006700
                                                                        00006710
                                                                        00006720
         TK0.TKNR              = TK.TKNR;                               00006730
         TK0.TKNAVN            = TK.TKNAVN;                             00006740
         TK0.BESØKADR          = TK.BESØKADR;                           00006750
         TK0.BPOSTNR           = TK.BPOSTNR;                            00006760
         TK0.POSTADR           = TK.POSTADR;                            00006770
         TK0.PPOSTNR           = TK.PPOSTNR;                            00006780
         TK0.TELEFAX           = TK.TELEFAX;                            00006790
         TK0.TKSJEF            = TK.TKSJEF;                             00006800
         TK0.SJEFTLF           = TK.SJEFTLF;                            00006810
         TK0.SORTKRITERIUM     = TK.SORTKRITERIUM;                      00006820
         TK0.DATASENTRAL       = TK.DATASENTRAL;                        00006830
         TK0.DATASENTRAL_NR    = TK.DATASENTRALNR;                      00006840
         TK0.EDBSYSTEM         = TK.EDBSYSTEM;                          00006850
         TK0.ARBEIDSKONTOR     = TK.ARBEIDSKONTOR;                      00006860
         TK0.ARBEIDSGIVER      = TK.ARBEIDSGIVER;                       00006870
         TK0.MÅLFORM           = TK.MÅLFORM;                            00006880
         TK0.LOKALMASKINNR     = TK.LOKALMASKINNR;                      00006890
         TK0.ABONNEMENTNR      = TK.ABONNEMENTNR;                       00006900
         TK0.SAMBAND           = TK.SAMBAND;                            00006910
         TK0.HASTIGHET         = TK.HASTIGHET;                          00006920
         TK0.REGNSKAPSANSVAR1  = TK.REGNSKAPSANSVAR1;                   00006930
         TK0.REGNSKAPSANSVAR2  = TK.REGNSKAPSANSVAR2;                   00006940
         TK0.ÅRHUSLEIEREG      = TK.ÅRHUSLEIEREG;                       00006950
         TK0.MRKFYLKE          = TK.MRKFYLKE;                           00006960
         TK0.MRKREVISJON       = TK.MRKREVISJON;                        00006970
         TK0.REV_DISTRIKT      = TK.REV_DISTRIKT;                       00006980
         TK0.FYLKESKONTOR      = TK.FYLKESKONTOR;                       00006990
         TK0.ANT_BREV          = TK.ANT_BREV    ;                       00007000
                                                                        00007010
 END GI_SKJERM_TKTRANS_DATA;                                            00007020
                                                                        00007030
                                                                        00007040
 BEHANDLE_TLF_KOMM_SAT_SEGM: PROC;                                      00007050
                                                                        00007060
         I               = 1;                                           00007070
         HJ_TLF          = '';                                          00007080
                                                                        00007090
         DO WHILE(TK1.STATUS_KODE ^= 'GE');                             00007100
             CALL PLITDLI       (FIRE              ,                    00007110
                                 GHNP              ,                    00007120
                                 TK1               ,                    00007130
                                 TLF               ,                    00007140
                                 SSA_TLF_UQUAL)  ;                      00007150
                                                                        00007160
             IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN             00007170
               DO;                                                      00007180
 L210:                                                                  00007190
                  FEIL_MELD_NR    =  500;                               00007200
                  FEIL_VED_LABEL  = '210';                              00007210
                  FATAL_FEIL      = '1'B;                               00007220
                  CALL SKRIV_FEILMELDING;                               00007230
                  EXEC CICS ABEND ABCODE(FEIL);                         00007240
               END;                                                     00007250
                                                                        00007260
             IF TK1.STATUS_KODE ^= 'GE' THEN                            00007270
                IF TK1.STATUS_KODE ^= '  ' THEN                         00007280
                   DO;                                                  00007290
 L220:                                                                  00007300
                      FEIL_MELD_NR    =  500;                           00007310
                      FEIL_VED_LABEL  = '220';                          00007320
                      FATAL_FEIL      = '1'B;                           00007330
                      CALL SKRIV_FEILMELDING;                           00007340
                      EXEC CICS ABEND ABCODE(FEIL);                     00007350
                   END;                                                 00007360
                ELSE                                                    00007370
                   DO;                                                  00007380
                      HJ_TLF(I) = TLF.TLFNR;                            00007390
                      I         = I + 1;                                00007400
                                                                        00007410
                      CALL PLITDLI    (TRE,                             00007420
                                       DLET,                            00007430
                                       TK1,                             00007440
                                       TLF);                            00007450
                                                                        00007460
                      IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B         00007470
                        THEN DO;                                        00007480
 L230:                                                                  00007490
                           FEIL_MELD_NR    =  500;                      00007500
                           FEIL_VED_LABEL  = '230';                     00007510
                           FATAL_FEIL      = '1'B;                      00007520
                           CALL SKRIV_FEILMELDING;                      00007530
                           EXEC CICS ABEND ABCODE(FEIL);                00007540
                        END;                                            00007550
                                                                        00007560
                      IF TK1.STATUS_KODE ^= '  ' THEN                   00007570
                        DO;                                             00007580
 L240:                                                                  00007590
                           FEIL_MELD_NR    =  500;                      00007600
                           FEIL_VED_LABEL  = '240';                     00007610
                           FATAL_FEIL      = '1'B;                      00007620
                           CALL SKRIV_FEILMELDING;                      00007630
                           EXEC CICS ABEND ABCODE(FEIL);                00007640
                        END;                                            00007650
                   END;                                                 00007660
         END;/* WHILE */                                                00007670
                                                                        00007680
         I               = 1;                                           00007690
         HJ_KOMM         = 0;                                           00007700
                                                                        00007710
         CALL PLITDLI       (FIRE              ,                        00007720
                             GHNP              ,                        00007730
                             TK1               ,                        00007740
                             KOMMUNE           ,                        00007750
                             SSA_KOMM_UQUAL)  ;                         00007760
                                                                        00007770
         IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                 00007780
           DO;                                                          00007790
 L250:                                                                  00007800
              FEIL_MELD_NR    =  500;                                   00007810
              FEIL_VED_LABEL  = '250';                                  00007820
              FATAL_FEIL      = '1'B;                                   00007830
              CALL SKRIV_FEILMELDING;                                   00007840
              EXEC CICS ABEND ABCODE(FEIL);                             00007850
           END;                                                         00007860
                                                                        00007870
         IF TK1.STATUS_KODE ^= 'GE' THEN                                00007880
            IF TK1.STATUS_KODE ^= '  ' THEN                             00007890
               DO;                                                      00007900
 L260:                                                                  00007910
                  FEIL_MELD_NR    =  500;                               00007920
                  FEIL_VED_LABEL  = '260';                              00007930
                  FATAL_FEIL      = '1'B;                               00007940
                  CALL SKRIV_FEILMELDING;                               00007950
                  EXEC CICS ABEND ABCODE(FEIL);                         00007960
               END;                                                     00007970
            ELSE                                                        00007980
               DO;                                                      00007990
                  HJ_KOMM(I) = KOMMUNE.KOMMNR;                          00008000
                  I         = I + 1;                                    00008010
                                                                        00008020
                  CALL PLITDLI    (TRE,                                 00008030
                                   DLET,                                00008040
                                   TK1,                                 00008050
                                   KOMMUNE);                            00008060
                                                                        00008070
                  IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B             00008080
                    THEN DO;                                            00008090
 L270:                                                                  00008100
                       FEIL_MELD_NR    =  500;                          00008110
                       FEIL_VED_LABEL  = '270';                         00008120
                       FATAL_FEIL      = '1'B;                          00008130
                       CALL SKRIV_FEILMELDING;                          00008140
                       EXEC CICS ABEND ABCODE(FEIL);                    00008150
                    END;                                                00008160
                                                                        00008170
                  IF TK1.STATUS_KODE ^= '  ' THEN                       00008180
                    DO;                                                 00008190
 L280:                                                                  00008200
                       FEIL_MELD_NR    =  500;                          00008210
                       FEIL_VED_LABEL  = '280';                         00008220
                       FATAL_FEIL      = '1'B;                          00008230
                       CALL SKRIV_FEILMELDING;                          00008240
                       EXEC CICS ABEND ABCODE(FEIL);                    00008250
                    END;                                                00008260
               END;                                                     00008270
                                                                        00008280
         DO WHILE(TK1.STATUS_KODE ^= 'GE');                             00008290
             CALL PLITDLI       (FIRE              ,                    00008300
                                 GHNP              ,                    00008310
                                 TK1               ,                    00008320
                                 KOMMUNE           ,                    00008330
                                 SSA_KOMM_UQUAL)  ;                     00008340
                                                                        00008350
             IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN             00008360
               DO;                                                      00008370
 L290:                                                                  00008380
                  FEIL_MELD_NR    =  500;                               00008390
                  FEIL_VED_LABEL  = '290';                              00008400
                  FATAL_FEIL      = '1'B;                               00008410
                  CALL SKRIV_FEILMELDING;                               00008420
                  EXEC CICS ABEND ABCODE(FEIL);                         00008430
               END;                                                     00008440
                                                                        00008450
             IF TK1.STATUS_KODE ^= 'GE' THEN                            00008460
                IF TK1.STATUS_KODE ^= '  ' THEN                         00008470
                   DO;                                                  00008480
 L300:                                                                  00008490
                      FEIL_MELD_NR    =  500;                           00008500
                      FEIL_VED_LABEL  = '300';                          00008510
                      FATAL_FEIL      = '1'B;                           00008520
                      CALL SKRIV_FEILMELDING;                           00008530
                      EXEC CICS ABEND ABCODE(FEIL);                     00008540
                   END;                                                 00008550
                ELSE                                                    00008560
                   DO;                                                  00008570
                      HJ_KOMM(I) = KOMMUNE.KOMMNR;                      00008580
                      I         = I + 1;                                00008590
                                                                        00008600
                      CALL PLITDLI    (TRE,                             00008610
                                       DLET,                            00008620
                                       TK1,                             00008630
                                       KOMMUNE);                        00008640
                                                                        00008650
                      IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B         00008660
                        THEN DO;                                        00008670
 L310:                                                                  00008680
                           FEIL_MELD_NR    =  500;                      00008690
                           FEIL_VED_LABEL  = '310';                     00008700
                           FATAL_FEIL      = '1'B;                      00008710
                           CALL SKRIV_FEILMELDING;                      00008720
                           EXEC CICS ABEND ABCODE(FEIL);                00008730
                        END;                                            00008740
                                                                        00008750
                      IF TK1.STATUS_KODE ^= '  ' THEN                   00008760
                        DO;                                             00008770
 L320:                                                                  00008780
                           FEIL_MELD_NR    =  500;                      00008790
                           FEIL_VED_LABEL  = '320';                     00008800
                           FATAL_FEIL      = '1'B;                      00008810
                           CALL SKRIV_FEILMELDING;                      00008820
                           EXEC CICS ABEND ABCODE(FEIL);                00008830
                        END;                                            00008840
                   END;                                                 00008850
         END;/* WHILE */                                                00008860
                                                                        00008870
         I               = 1;                                           00008880
         HJ_SAT          = 0;                                           00008890
                                                                        00008900
         CALL PLITDLI       (FIRE              ,                        00008910
                             GHNP              ,                        00008920
                             TK1               ,                        00008930
                             SAT               ,                        00008940
                             SSA_SAT_UQUAL)  ;                          00008950
                                                                        00008960
         IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                 00008970
           DO;                                                          00008980
 L330:                                                                  00008990
              FEIL_MELD_NR    =  500;                                   00009000
              FEIL_VED_LABEL  = '330';                                  00009010
              FATAL_FEIL      = '1'B;                                   00009020
              CALL SKRIV_FEILMELDING;                                   00009030
              EXEC CICS ABEND ABCODE(FEIL);                             00009040
           END;                                                         00009050
                                                                        00009060
         IF TK1.STATUS_KODE ^= 'GE' THEN                                00009070
            IF TK1.STATUS_KODE ^= '  ' THEN                             00009080
               DO;                                                      00009090
 L340:                                                                  00009100
                  FEIL_MELD_NR    =  500;                               00009110
                  FEIL_VED_LABEL  = '340';                              00009120
                  FATAL_FEIL      = '1'B;                               00009130
                  CALL SKRIV_FEILMELDING;                               00009140
                  EXEC CICS ABEND ABCODE(FEIL);                         00009150
               END;                                                     00009160
            ELSE                                                        00009170
               DO;                                                      00009180
                  HJ_SAT(I) = SAT.SATTKNR;                              00009190
                  I         = I + 1;                                    00009200
                                                                        00009210
                  CALL PLITDLI    (TRE,                                 00009220
                                   DLET,                                00009230
                                   TK1,                                 00009240
                                   SAT);                                00009250
                                                                        00009260
                  IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B             00009270
                    THEN DO;                                            00009280
 L350:                                                                  00009290
                       FEIL_MELD_NR    =  500;                          00009300
                       FEIL_VED_LABEL  = '350';                         00009310
                       FATAL_FEIL      = '1'B;                          00009320
                       CALL SKRIV_FEILMELDING;                          00009330
                       EXEC CICS ABEND ABCODE(FEIL);                    00009340
                    END;                                                00009350
                                                                        00009360
                  IF TK1.STATUS_KODE ^= '  ' THEN                       00009370
                    DO;                                                 00009380
 L360:                                                                  00009390
                       FEIL_MELD_NR    =  500;                          00009400
                       FEIL_VED_LABEL  = '360';                         00009410
                       FATAL_FEIL      = '1'B;                          00009420
                       CALL SKRIV_FEILMELDING;                          00009430
                       EXEC CICS ABEND ABCODE(FEIL);                    00009440
                    END;                                                00009450
               END;                                                     00009460
                                                                        00009470
         DO WHILE(TK1.STATUS_KODE ^= 'GE');                             00009480
             CALL PLITDLI       (FIRE              ,                    00009490
                                 GHNP              ,                    00009500
                                 TK1               ,                    00009510
                                 SAT               ,                    00009520
                                 SSA_SAT_UQUAL)  ;                      00009530
                                                                        00009540
             IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN             00009550
               DO;                                                      00009560
 L370:                                                                  00009570
                  FEIL_MELD_NR    =  500;                               00009580
                  FEIL_VED_LABEL  = '370';                              00009590
                  FATAL_FEIL      = '1'B;                               00009600
                  CALL SKRIV_FEILMELDING;                               00009610
                  EXEC CICS ABEND ABCODE(FEIL);                         00009620
               END;                                                     00009630
                                                                        00009640
             IF TK1.STATUS_KODE ^= 'GE' THEN                            00009650
                IF TK1.STATUS_KODE ^= '  ' THEN                         00009660
                   DO;                                                  00009670
 L380:                                                                  00009680
                      FEIL_MELD_NR    =  500;                           00009690
                      FEIL_VED_LABEL  = '380';                          00009700
                      FATAL_FEIL      = '1'B;                           00009710
                      CALL SKRIV_FEILMELDING;                           00009720
                      EXEC CICS ABEND ABCODE(FEIL);                     00009730
                   END;                                                 00009740
                ELSE                                                    00009750
                   DO;                                                  00009760
                      HJ_SAT(I) = SAT.SATTKNR;                          00009770
                      I         = I + 1;                                00009780
                                                                        00009790
                      CALL PLITDLI    (TRE,                             00009800
                                       DLET,                            00009810
                                       TK1,                             00009820
                                       SAT);                            00009830
                                                                        00009840
                      IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B         00009850
                        THEN DO;                                        00009860
 L390:                                                                  00009870
                           FEIL_MELD_NR    =  500;                      00009880
                           FEIL_VED_LABEL  = '390';                     00009890
                           FATAL_FEIL      = '1'B;                      00009900
                           CALL SKRIV_FEILMELDING;                      00009910
                           EXEC CICS ABEND ABCODE(FEIL);                00009920
                        END;                                            00009930
                                                                        00009940
                      IF TK1.STATUS_KODE ^= '  ' THEN                   00009950
                        DO;                                             00009960
 L400:                                                                  00009970
                           FEIL_MELD_NR    =  500;                      00009980
                           FEIL_VED_LABEL  = '400';                     00009990
                           FATAL_FEIL      = '1'B;                      00010000
                           CALL SKRIV_FEILMELDING;                      00010010
                           EXEC CICS ABEND ABCODE(FEIL);                00010020
                        END;                                            00010030
                   END;                                                 00010040
         END;/* WHILE */                                                00010050
                                                                        00010060
 END BEHANDLE_TLF_KOMM_SAT_SEGM;                                        00010070
                                                                        00010080
                                                                        00010090
 GI_SKJERM_T_K_S_TRANS_DATA: PROC;                                      00010100
                                                                        00010110
         S001017O.TLF1O = HJ_TLF(1);                                    00010120
         S001017O.TLF2O = HJ_TLF(2);                                    00010130
                                                                        00010140
         TKTLF.TLF1  = HJ_TLF(1);                                       00010150
         TKTLF.TLF2  = HJ_TLF(2);                                       00010160
                                                                        00010170
         IF HJ_KOMM(1) ^= 0 THEN                                        00010180
              S001017O.KOMM1O = HJ_KOMM(1);                             00010190
         ELSE                                                           00010200
              S001017O.KOMM1O = LOW(4);                                 00010210
         TKKOMM.KOMM1 = HJ_KOMM(1);                                     00010220
                                                                        00010230
         IF HJ_KOMM(2) ^= 0 THEN                                        00010240
              S001017O.KOMM2O = HJ_KOMM(2);                             00010250
         ELSE                                                           00010260
              S001017O.KOMM2O = LOW(4);                                 00010270
         TKKOMM.KOMM2 = HJ_KOMM(2);                                     00010280
                                                                        00010290
                                                                        00010300
         IF HJ_SAT(1) ^= 0 THEN                                         00010310
              S001017O.SAT1O = HJ_SAT(1);                               00010320
         ELSE                                                           00010330
              S001017O.SAT1O = LOW(4);                                  00010340
         TKSAT.SAT1 = HJ_SAT(1);                                        00010350
                                                                        00010360
         IF HJ_SAT(2) ^= 0 THEN                                         00010370
              S001017O.SAT2O = HJ_SAT(2);                               00010380
         ELSE                                                           00010390
              S001017O.SAT2O = LOW(4);                                  00010400
         TKSAT.SAT2 = HJ_SAT(2);                                        00010410
                                                                        00010420
         IF HJ_SAT(3) ^= 0 THEN                                         00010430
              S001017O.SAT3O = HJ_SAT(3);                               00010440
         ELSE                                                           00010450
              S001017O.SAT3O = LOW(4);                                  00010460
         TKSAT.SAT3 = HJ_SAT(3);                                        00010470
                                                                        00010480
         IF HJ_SAT(4) ^= 0 THEN                                         00010490
              S001017O.SAT4O = HJ_SAT(4);                               00010500
         ELSE                                                           00010510
              S001017O.SAT4O = LOW(4);                                  00010520
         TKSAT.SAT4 = HJ_SAT(4);                                        00010530
                                                                        00010540
         IF HJ_SAT(5) ^= 0 THEN                                         00010550
              S001017O.SAT5O = HJ_SAT(5);                               00010560
         ELSE                                                           00010570
              S001017O.SAT5O = LOW(4);                                  00010580
         TKSAT.SAT5 = HJ_SAT(5);                                        00010590
                                                                        00010600
         IF HJ_SAT(6) ^= 0 THEN                                         00010610
              S001017O.SAT6O = HJ_SAT(6);                               00010620
         ELSE                                                           00010630
              S001017O.SAT6O = LOW(4);                                  00010640
         TKSAT.SAT6 = HJ_SAT(6);                                        00010650
                                                                        00010660
         IF HJ_SAT(7) ^= 0 THEN                                         00010670
              S001017O.SAT7O = HJ_SAT(7);                               00010680
         ELSE                                                           00010690
              S001017O.SAT7O = LOW(4);                                  00010700
         TKSAT.SAT7 = HJ_SAT(7);                                        00010710
                                                                        00010720
         IF HJ_SAT(8) ^= 0 THEN                                         00010730
              S001017O.SAT8O = HJ_SAT(8);                               00010740
         ELSE                                                           00010750
              S001017O.SAT8O = LOW(4);                                  00010760
         TKSAT.SAT8 = HJ_SAT(8);                                        00010770
                                                                        00010780
         IF HJ_SAT(9) ^= 0 THEN                                         00010790
              S001017O.SAT9O = HJ_SAT(9);                               00010800
         ELSE                                                           00010810
              S001017O.SAT9O = LOW(4);                                  00010820
         TKSAT.SAT9 = HJ_SAT(9);                                        00010830
                                                                        00010840
         IF HJ_SAT(10) ^= 0 THEN                                        00010850
              S001017O.SAT10O = HJ_SAT(10);                             00010860
         ELSE                                                           00010870
              S001017O.SAT10O = LOW(4);                                 00010880
         TKSAT.SAT10 = HJ_SAT(10);                                      00010890
                                                                        00010900
 END GI_SKJERM_T_K_S_TRANS_DATA;                                        00010910
                                                                        00010920
                                                                        00010930
 SJEKK_FEIL: PROC;                                                      00010940
                                                                        00010950
   FEIL_I_TK        = '0'B;                                             00010960
   ANT_FEIL_SKREVET = 0;                                                00010970
   FEIL_MELD_NR = 0;                                                    00010980
                                                                        00010990
   CALL BLANK_MELDNR;                                                   00011000
                                                                        00011010
   CALL OVERFØR_TK;                                                     00011020
                                                                        00011030
   CALL KONTROLL_TK(FEIL_I_TK);                                         00011040
                                                                        00011050
   DO WHILE(FEIL_I_TK);                                                 00011060
      S001017O.MELDING1O = '';                                          00011070
      S001017O.MELDING2O = '';                                          00011080
      S001017O.MELDING3O = '';                                          00011090
      S001017O.MELDING4O = '';                                          00011100
      S001017O.MELDING5O = '';                                          00011110
                                                                        00011120
      CALL OVERFØR_TK_MAP;                                              00011130
                                                                        00011140
      S001017O.FUNKSJONSKODEA = DFHBMFSE;                               00011150
      S001017O.TKNRA          = DFHPROTI;                               00011160
                                                                        00011170
      EXEC CICS SEND MAP('S001017') MAPSET('S001T43')                   00011180
           DATAONLY CURSOR ;                                            00011190
                                                                        00011200
      EXEC CICS RECEIVE MAP('S001017')                                  00011210
           MAPSET('S001T43') SET(BMSMAPBR) ASIS;                        00011220
                                                                        00011230
      LEGG_TILBAKE_TLF_KOMM = '1'B;                                     00011240
                                                                        00011250
      CALL SJEKK_UT;                                                    00011260
                                                                        00011270
      FEIL_I_TK        = '0'B;                                          00011280
      ANT_FEIL_SKREVET = 0;                                             00011290
      FEIL_MELD_NR = 0;                                                 00011300
                                                                        00011310
      CALL BLANK_MELDNR;                                                00011320
                                                                        00011330
      CALL OVERFØR_TK;                                                  00011340
      CALL KONTROLL_TK(FEIL_I_TK);                                      00011350
   END;                                                                 00011360
                                                                        00011370
 END SJEKK_FEIL;                                                        00011380
                                                                        00011390
                                                                        00011400
 SKRIV_BASEN: PROC;                                                     00011410
                                                                        00011420
   IF TK_FINNES THEN                                                    00011430
      DO;                                                               00011440
         TK_FINNES = '0'B;                                              00011450
                                                                        00011460
         HJ_STILLING = TK.ANT_STILLING;                                 00011470
                                                                        00011480
         IF SUBSTR(FUNKSJON,1,1) ^= '' & SUBSTR(FUNKSJON,2,1) ^= '' &   00011490
            SUBSTR(FUNKSJON,3,1) ^= '' & SUBSTR(FUNKSJON,4,1) ^= '' THEN00011500
            DO;                                                         00011510
               CALL GRUPPE1;                                            00011520
                                                                        00011530
               CALL REPL_DB;                                            00011540
               CALL INSERT_BARN;                                        00011550
            END;                                                        00011560
                                                                        00011570
         ELSE                                                           00011580
            IF SUBSTR(FUNKSJON,3,1) ^= '' THEN                          00011590
               DO;                                                      00011600
                  TK.ARBEIDSKONTOR      = TK0.ARBEIDSKONTOR;            00011610
                  TK.REGNSKAPSANSVAR1   = TK0.REGNSKAPSANSVAR1;         00011620
                  TK.REGNSKAPSANSVAR2   = TK0.REGNSKAPSANSVAR2;         00011630
                  TK.ÅRHUSLEIEREG       = TK0.ÅRHUSLEIEREG;             00011640
                  TK.MRKFYLKE           = TK0.MRKFYLKE;                 00011650
                  TK.MRKREVISJON        = TK0.MRKREVISJON;              00011660
                                                                        00011670
                  CALL REPL_DB;                                         00011680
               END;                                                     00011690
            ELSE                                                        00011700
               S001017O.MELDING1O =                                     00011710
                          'DU HAR IKKE ADGANG TIL Å OPPDATERE!';        00011720
                                                                        00011730
      END;                                                              00011740
                                                                        00011750
   ELSE                                                                 00011760
      DO;                                                               00011770
         IF SUBSTR(FUNKSJON,1,1) ^= '' & SUBSTR(FUNKSJON,2,1) ^= '' &   00011780
            SUBSTR(FUNKSJON,3,1) ^= '' & SUBSTR(FUNKSJON,4,1) ^= '' THEN00011790
            DO;                                                         00011800
               CALL GRUPPE1;                                            00011810
                                                                        00011820
               CALL ISRT_DB;                                            00011830
               CALL INSERT_BARN;                                        00011840
            END;                                                        00011850
                                                                        00011860
         ELSE                                                           00011870
            IF SUBSTR(FUNKSJON,3,1) ^= '' THEN                          00011880
               S001017O.MELDING1O =                                     00011890
                 'ANDRE OPPLYSNINGER OM DENNE TK MÅ REGISTRERES FØRST'; 00011900
            ELSE                                                        00011910
               S001017O.MELDING1O =                                     00011920
                          'DU HAR IKKE ADGANG TIL Å REGISTRERE!';       00011930
      END;                                                              00011940
                                                                        00011950
 END SKRIV_BASEN;                                                       00011960
                                                                        00011970
                                                                        00011980
 LES_DB_TKNR: PROC;                                                     00011990
                                                                        00012000
     SSA_TK.KEY = LES_TKNR;                                             00012010
                                                                        00012020
     TK = '';                                                           00012030
                                                                        00012040
     CALL PLITDLI       (FIRE              ,                            00012050
                         GHU               ,                            00012060
                         TK1               ,                            00012070
                         TK                ,                            00012080
                         SSA_TK)           ;                            00012090
                                                                        00012100
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00012110
        DO;                                                             00012120
 L410:                                                                  00012130
           FEIL_MELD_NR    =  500;                                      00012140
           FEIL_VED_LABEL  = '410';                                     00012150
           FATAL_FEIL      = '1'B;                                      00012160
           CALL SKRIV_FEILMELDING;                                      00012170
           EXEC CICS ABEND ABCODE(FEIL);                                00012180
        END;                                                            00012190
                                                                        00012200
     IF TK1.STATUS_KODE = 'GE' THEN                                     00012210
        TK_FINNES = '0'B;                                               00012220
     ELSE                                                               00012230
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00012240
           DO;                                                          00012250
 L420:                                                                  00012260
              FEIL_MELD_NR    =  500;                                   00012270
              FEIL_VED_LABEL  = '420';                                  00012280
              FATAL_FEIL      = '1'B;                                   00012290
              CALL SKRIV_FEILMELDING;                                   00012300
              EXEC CICS ABEND ABCODE(FEIL);                             00012310
           END;                                                         00012320
                                                                        00012330
        ELSE                                                            00012340
           TK_FINNES = '1'B;                                            00012350
                                                                        00012360
 END LES_DB_TKNR;                                                       00012370
                                                                        00012380
                                                                        00012390
 LES_DB_NAVN: PROC;                                                     00012400
                                                                        00012410
     TK = '';                                                           00012420
                                                                        00012430
     CALL PLITDLI       (FIRE              ,                            00012440
                         GU                ,                            00012450
                         TK2               ,                            00012460
                         TK                ,                            00012470
                         SSA_TK2)          ;                            00012480
                                                                        00012490
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00012500
        DO;                                                             00012510
 L450:                                                                  00012520
           FEIL_MELD_NR    =  500;                                      00012530
           FEIL_VED_LABEL  = '450';                                     00012540
           FATAL_FEIL      = '1'B;                                      00012550
           CALL SKRIV_FEILMELDING;                                      00012560
           EXEC CICS ABEND ABCODE(FEIL);                                00012570
        END;                                                            00012580
                                                                        00012590
     IF ((TK2.STATUS_KODE = 'GE') ! (TK2.STATUS_KODE = 'GB')) THEN      00012600
        TK_FINNES = '0'B;                                               00012610
                                                                        00012620
     ELSE                                                               00012630
        IF TK2.STATUS_KODE ^= '  ' THEN                                 00012640
           DO;                                                          00012650
  L460:                                                                 00012660
               FEIL_MELD_NR    =  500;                                  00012670
               FEIL_VED_LABEL  = '460';                                 00012680
               FATAL_FEIL      = '1'B;                                  00012690
               CALL SKRIV_FEILMELDING;                                  00012700
               EXEC CICS ABEND ABCODE(FEIL);                            00012710
           END;                                                         00012720
        ELSE                                                            00012730
           TK_FINNES = '1'B;                                            00012740
                                                                        00012750
 END LES_DB_NAVN;                                                       00012760
                                                                        00012770
                                                                        00012780
 LES_DB_NAVN_NESTE: PROC;                                               00012790
                                                                        00012800
     TK = '';                                                           00012810
                                                                        00012820
     CALL PLITDLI       (FIRE              ,                            00012830
                         GN                ,                            00012840
                         TK2               ,                            00012850
                         TK                ,                            00012860
                         SSA_TK2)          ;                            00012870
                                                                        00012880
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00012890
        DO;                                                             00012900
 L470:                                                                  00012910
           FEIL_MELD_NR    =  500;                                      00012920
           FEIL_VED_LABEL  = '470';                                     00012930
           FATAL_FEIL      = '1'B;                                      00012940
           CALL SKRIV_FEILMELDING;                                      00012950
           EXEC CICS ABEND ABCODE(FEIL);                                00012960
        END;                                                            00012970
                                                                        00012980
     IF ((TK2.STATUS_KODE = 'GE') ! (TK2.STATUS_KODE = 'GB')) THEN      00012990
        TK_FINNES = '0'B;                                               00013000
                                                                        00013010
     ELSE                                                               00013020
        IF TK2.STATUS_KODE ^= '  ' THEN                                 00013030
           DO;                                                          00013040
  L480:                                                                 00013050
               FEIL_MELD_NR    =  500;                                  00013060
               FEIL_VED_LABEL  = '480';                                 00013070
               FATAL_FEIL      = '1'B;                                  00013080
               CALL SKRIV_FEILMELDING;                                  00013090
               EXEC CICS ABEND ABCODE(FEIL);                            00013100
           END;                                                         00013110
        ELSE                                                            00013120
           TK_FINNES = '1'B;                                            00013130
                                                                        00013140
 END LES_DB_NAVN_NESTE;                                                 00013150
                                                                        00013160
                                                                        00013170
 LES_DB_SJEF: PROC;                                                     00013180
                                                                        00013190
     TK = '';                                                           00013200
                                                                        00013210
     CALL PLITDLI       (FIRE              ,                            00013220
                         GU                ,                            00013230
                         TK3               ,                            00013240
                         TK                ,                            00013250
                         SSA_TK3)          ;                            00013260
                                                                        00013270
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00013280
        DO;                                                             00013290
 L490:                                                                  00013300
           FEIL_MELD_NR    =  500;                                      00013310
           FEIL_VED_LABEL  = '490';                                     00013320
           FATAL_FEIL      = '1'B;                                      00013330
           CALL SKRIV_FEILMELDING;                                      00013340
           EXEC CICS ABEND ABCODE(FEIL);                                00013350
        END;                                                            00013360
                                                                        00013370
     IF ((TK3.STATUS_KODE = 'GE') ! (TK3.STATUS_KODE = 'GB')) THEN      00013380
        TK_FINNES = '0'B;                                               00013390
                                                                        00013400
     ELSE                                                               00013410
        IF TK3.STATUS_KODE ^= '  ' THEN                                 00013420
           DO;                                                          00013430
  L500:                                                                 00013440
               FEIL_MELD_NR    =  500;                                  00013450
               FEIL_VED_LABEL  = '500';                                 00013460
               FATAL_FEIL      = '1'B;                                  00013470
               CALL SKRIV_FEILMELDING;                                  00013480
               EXEC CICS ABEND ABCODE(FEIL);                            00013490
           END;                                                         00013500
        ELSE                                                            00013510
           TK_FINNES = '1'B;                                            00013520
                                                                        00013530
 END LES_DB_SJEF;                                                       00013540
                                                                        00013550
                                                                        00013560
 LES_DB_SJEF_NESTE: PROC;                                               00013570
                                                                        00013580
     TK = '';                                                           00013590
                                                                        00013600
     CALL PLITDLI       (FIRE              ,                            00013610
                         GN                ,                            00013620
                         TK3               ,                            00013630
                         TK                ,                            00013640
                         SSA_TK3)          ;                            00013650
                                                                        00013660
     IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                     00013670
        DO;                                                             00013680
 L510:                                                                  00013690
           FEIL_MELD_NR    =  500;                                      00013700
           FEIL_VED_LABEL  = '510';                                     00013710
           FATAL_FEIL      = '1'B;                                      00013720
           CALL SKRIV_FEILMELDING;                                      00013730
           EXEC CICS ABEND ABCODE(FEIL);                                00013740
        END;                                                            00013750
                                                                        00013760
     IF ((TK3.STATUS_KODE = 'GE') ! (TK3.STATUS_KODE = 'GB')) THEN      00013770
        TK_FINNES = '0'B;                                               00013780
                                                                        00013790
     ELSE                                                               00013800
        IF TK3.STATUS_KODE ^= '  ' THEN                                 00013810
           DO;                                                          00013820
  L520:                                                                 00013830
               FEIL_MELD_NR    =  500;                                  00013840
               FEIL_VED_LABEL  = '520';                                 00013850
               FATAL_FEIL      = '1'B;                                  00013860
               CALL SKRIV_FEILMELDING;                                  00013870
               EXEC CICS ABEND ABCODE(FEIL);                            00013880
           END;                                                         00013890
        ELSE                                                            00013900
           TK_FINNES = '1'B;                                            00013910
                                                                        00013920
 END LES_DB_SJEF_NESTE;                                                 00013930
                                                                        00013940
                                                                        00013950
 REPL_DB: PROC;                                                         00013960
                                                                        00013970
        CALL PLITDLI    (TRE,                                           00013980
                         REPL,                                          00013990
                         TK1,                                           00014000
                         TK);                                           00014010
                                                                        00014020
        IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                  00014030
          DO;                                                           00014040
 L530:                                                                  00014050
             FEIL_MELD_NR    =  500;                                    00014060
             FEIL_VED_LABEL  = '530';                                   00014070
             FATAL_FEIL      = '1'B;                                    00014080
             CALL SKRIV_FEILMELDING;                                    00014090
             EXEC CICS ABEND ABCODE(FEIL);                              00014100
          END;                                                          00014110
                                                                        00014120
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00014130
          DO;                                                           00014140
 L540:                                                                  00014150
             FEIL_MELD_NR    =  500;                                    00014160
             FEIL_VED_LABEL  = '540';                                   00014170
             FATAL_FEIL      = '1'B;                                    00014180
             CALL SKRIV_FEILMELDING;                                    00014190
             EXEC CICS ABEND ABCODE(FEIL);                              00014200
          END;                                                          00014210
                                                                        00014220
 END REPL_DB;                                                           00014230
                                                                        00014240
                                                                        00014250
                                                                        00014260
 ISRT_DB: PROC;                                                         00014270
                                                                        00014280
        CALL PLITDLI    (FIRE,                                          00014290
                         ISRT,                                          00014300
                         TK1,                                           00014310
                         TK,                                            00014320
                         SSA_TK_UQUAL);                                 00014330
                                                                        00014340
        IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN                  00014350
          DO;                                                           00014360
 L550:                                                                  00014370
             FEIL_MELD_NR    =  500;                                    00014380
             FEIL_VED_LABEL  = '550';                                   00014390
             FATAL_FEIL      = '1'B;                                    00014400
             CALL SKRIV_FEILMELDING;                                    00014410
             EXEC CICS ABEND ABCODE(FEIL);                              00014420
          END;                                                          00014430
                                                                        00014440
        IF TK1.STATUS_KODE ^= '  ' THEN                                 00014450
          DO;                                                           00014460
 L560:                                                                  00014470
             FEIL_MELD_NR    =  500;                                    00014480
             FEIL_VED_LABEL  = '560';                                   00014490
             FATAL_FEIL      = '1'B;                                    00014500
             CALL SKRIV_FEILMELDING;                                    00014510
             EXEC CICS ABEND ABCODE(FEIL);                              00014520
          END;                                                          00014530
 END ISRT_DB;                                                           00014540
                                                                        00014550
 INSERT_BARN: PROC;                                                     00014560
                                                                        00014570
   HJ_TLF( 1) = TKTLF.TLF1;                                             00014580
   HJ_TLF( 2) = TKTLF.TLF2;                                             00014590
                                                                        00014600
   HJ_KOMM(1) = TKKOMM.KOMM1;                                           00014610
   HJ_KOMM(2) = TKKOMM.KOMM2;                                           00014620
                                                                        00014630
   HJ_SAT( 1) = TKSAT.SAT1;                                             00014640
   HJ_SAT( 2) = TKSAT.SAT2;                                             00014650
   HJ_SAT( 3) = TKSAT.SAT3;                                             00014660
   HJ_SAT( 4) = TKSAT.SAT4;                                             00014670
   HJ_SAT( 5) = TKSAT.SAT5;                                             00014680
   HJ_SAT( 6) = TKSAT.SAT6;                                             00014690
   HJ_SAT( 7) = TKSAT.SAT7;                                             00014700
   HJ_SAT( 8) = TKSAT.SAT8;                                             00014710
   HJ_SAT( 9) = TKSAT.SAT9;                                             00014720
   HJ_SAT(10) = TKSAT.SAT10;                                            00014730
                                                                        00014740
   DO I=1 BY 1 UNTIL (I=2);                                             00014750
                                                                        00014760
      IF HJ_TLF(I) ^= '' THEN                                           00014770
         DO;                                                            00014780
             TLF.TLFNR = HJ_TLF(I);                                     00014790
                                                                        00014800
             CALL PLITDLI    (FEM,                                      00014810
                              ISRT,                                     00014820
                              TK1,                                      00014830
                              TLF,                                      00014840
                              SSA_TK,                                   00014850
                              SSA_TLF_UQUAL);                           00014860
                                                                        00014870
             IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN             00014880
               DO;                                                      00014890
         L570:                                                          00014900
                  FEIL_MELD_NR    =  500;                               00014910
                  FEIL_VED_LABEL  = '570';                              00014920
                  FATAL_FEIL      = '1'B;                               00014930
                  CALL SKRIV_FEILMELDING;                               00014940
                  EXEC CICS ABEND ABCODE(FEIL);                         00014950
               END;                                                     00014960
                                                                        00014970
             IF TK1.STATUS_KODE ^= '  ' THEN                            00014980
               DO;                                                      00014990
         L580:                                                          00015000
                  FEIL_MELD_NR    =  500;                               00015010
                  FEIL_VED_LABEL  = '580';                              00015020
                  FATAL_FEIL      = '1'B;                               00015030
                  CALL SKRIV_FEILMELDING;                               00015040
                  EXEC CICS ABEND ABCODE(FEIL);                         00015050
               END;                                                     00015060
         END;                                                           00015070
   END;/*UNTIL*/                                                        00015080
                                                                        00015090
   DO I=1 BY 1 UNTIL (I=2);                                             00015100
                                                                        00015110
      IF HJ_KOMM(I) ^= 0 THEN                                           00015120
         DO;                                                            00015130
             KOMMUNE.KOMMNR = HJ_KOMM(I);                               00015140
                                                                        00015150
             CALL PLITDLI    (FEM,                                      00015160
                              ISRT,                                     00015170
                              TK1,                                      00015180
                              KOMMUNE,                                  00015190
                              SSA_TK,                                   00015200
                              SSA_KOMM_UQUAL);                          00015210
                                                                        00015220
             IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN             00015230
               DO;                                                      00015240
         L620:                                                          00015250
                  FEIL_MELD_NR    =  500;                               00015260
                  FEIL_VED_LABEL  = '620';                              00015270
                  FATAL_FEIL      = '1'B;                               00015280
                  CALL SKRIV_FEILMELDING;                               00015290
                  EXEC CICS ABEND ABCODE(FEIL);                         00015300
               END;                                                     00015310
                                                                        00015320
             IF TK1.STATUS_KODE ^= '  ' THEN                            00015330
               DO;                                                      00015340
         L630:                                                          00015350
                  FEIL_MELD_NR    =  500;                               00015360
                  FEIL_VED_LABEL  = '630';                              00015370
                  FATAL_FEIL      = '1'B;                               00015380
                  CALL SKRIV_FEILMELDING;                               00015390
                  EXEC CICS ABEND ABCODE(FEIL);                         00015400
               END;                                                     00015410
         END;                                                           00015420
   END;/*UNTIL*/                                                        00015430
                                                                        00015440
   DO I=1 BY 1 UNTIL (I=10);                                            00015450
                                                                        00015460
      IF HJ_SAT(I) ^= 0 THEN                                            00015470
         DO;                                                            00015480
             SAT.SATTKNR = HJ_SAT(I);                                   00015490
                                                                        00015500
             CALL PLITDLI    (FEM,                                      00015510
                              ISRT,                                     00015520
                              TK1,                                      00015530
                              SAT,                                      00015540
                              SSA_TK,                                   00015550
                              SSA_SAT_UQUAL);                           00015560
                                                                        00015570
             IF DLIUIB.UIBRCODE.UIBFCTR ^= '00000000'B THEN             00015580
               DO;                                                      00015590
         L640:                                                          00015600
                  FEIL_MELD_NR    =  500;                               00015610
                  FEIL_VED_LABEL  = '640';                              00015620
                  FATAL_FEIL      = '1'B;                               00015630
                  CALL SKRIV_FEILMELDING;                               00015640
                  EXEC CICS ABEND ABCODE(FEIL);                         00015650
               END;                                                     00015660
                                                                        00015670
             IF TK1.STATUS_KODE ^= '  ' THEN                            00015680
               DO;                                                      00015690
         L650:                                                          00015700
                  FEIL_MELD_NR    =  500;                               00015710
                  FEIL_VED_LABEL  = '650';                              00015720
                  FATAL_FEIL      = '1'B;                               00015730
                  CALL SKRIV_FEILMELDING;                               00015740
                  EXEC CICS ABEND ABCODE(FEIL);                         00015750
               END;                                                     00015760
         END;                                                           00015770
   END;/*UNTIL*/                                                        00015780
                                                                        00015790
 END INSERT_BARN;                                                       00015800
                                                                        00015810
                                                                        00015820
 SKRIV_FIL: PROC;                                                       00015830
                                                                        00015840
   EXEC CICS HANDLE CONDITION NOTFND(LEGGINN);                          00015850
                                                                        00015860
   NOKKEL      = TK.TKNR;                                               00015870
   TKNRTAB_REC = '';                                                    00015880
                                                                        00015890
   EXEC CICS READ INTO (TKNRTAB_REC)                                    00015900
               DATASET ('TKNRTAB')                                      00015910
               RIDFLD  (NOKKEL)      UPDATE;                            00015920
                                                                        00015930
   CALL GI_VERDI;                                                       00015940
                                                                        00015950
   EXEC CICS REWRITE DATASET ('TKNRTAB')                                00015960
                     FROM    (TKNRTAB_REC);                             00015970
                                                                        00015980
   GOTO NESTE_FIL;                                                      00015990
                                                                        00016000
  LEGGINN:                                                              00016010
                                                                        00016020
     CALL GI_VERDI;                                                     00016030
                                                                        00016040
     EXEC CICS WRITE FROM (TKNRTAB_REC)                                 00016050
                  DATASET ('TKNRTAB')                                   00016060
                  RIDFLD  (NOKKEL);                                     00016070
                                                                        00016080
  NESTE_FIL:                                                            00016090
                                                                        00016100
   EXEC CICS HANDLE CONDITION NOTFND(LEGGINN_2);                        00016110
                                                                        00016120
   TKLISTE_REC = '';                                                    00016130
                                                                        00016140
   EXEC CICS READ INTO (TKLISTE_REC)                                    00016150
               DATASET ('TKLISTE')                                      00016160
               RIDFLD  (NOKKEL)      UPDATE;                            00016170
                                                                        00016180
   CALL GI_VERDI_2;                                                     00016190
                                                                        00016200
   EXEC CICS REWRITE DATASET ('TKLISTE')                                00016210
                     FROM    (TKLISTE_REC);                             00016220
   GOTO SLUTT_SKRIV;                                                    00016230
                                                                        00016240
  LEGGINN_2:                                                            00016250
                                                                        00016260
     CALL GI_VERDI_2;                                                   00016270
                                                                        00016280
     EXEC CICS WRITE FROM (TKLISTE_REC)                                 00016290
                  DATASET ('TKLISTE')                                   00016300
                  RIDFLD  (NOKKEL);                                     00016310
                                                                        00016320
  SLUTT_SKRIV:                                                          00016330
                                                                        00016340
     YYMMDD            = DATE;                                          00016350
                                                                        00016360
     FORANDRE_REC.DATO = SUBSTR(YYMMDD,5,2) !!                          00016370
                         SUBSTR(YYMMDD,3,2) !!                          00016380
                         SUBSTR(YYMMDD,1,2)   ;                         00016390
     FORANDRE_REC.BL   = '  ';                                          00016400
     FORANDRE_REC.TKNR = NOKKEL;                                        00016410
                                                                        00016420
     NOKKEL_2 = FORANDRE_REC.DATO !!                                    00016430
                FORANDRE_REC.BL   !!                                    00016440
                FORANDRE_REC.TKNR   ;                                   00016450
                                                                        00016460
     EXEC CICS IGNORE CONDITION DUPREC;                                 00016470
                                                                        00016480
     EXEC CICS WRITE FROM (FORANDRE_REC)                                00016490
                  DATASET ('FORANDRE')                                  00016500
                  RIDFLD  (NOKKEL_2);                                   00016510
                                                                        00016520
 END SKRIV_FIL;                                                         00016530
                                                                        00016540
                                                                        00016550
 GI_VERDI: PROC;                                                        00016560
                                                                        00016570
    TKNRTAB_REC.TKNR          = TK.TKNR;                                00016580
    TKNRTAB_REC.TKNAVN        = TK.TKNAVN;                              00016590
                                                                        00016600
    IF (TK.BESØKADR ^= '') THEN                                         00016610
       DO;                                                              00016620
          TKNRTAB_REC.ADR1    = TK.BESØKADR;                            00016630
          TKNRTAB_REC.POST    = TK.BPOSTNR;                             00016640
          TKNRTAB_REC.ADR2    = TK.BPOSTNAVN;                           00016650
       END;                                                             00016660
    ELSE                                                                00016670
       DO;                                                              00016680
          TKNRTAB_REC.ADR1    = TK.POSTADR;                             00016690
          TKNRTAB_REC.POST    = TK.PPOSTNR;                             00016700
          TKNRTAB_REC.ADR2    = TK.PPOSTNAVN;                           00016710
       END;                                                             00016720
                                                                        00016730
    TKNRTAB_REC.ANT_BREV      = TK.ANT_BREV;                            00016740
    TKNRTAB_REC.SORT          = TRANSLATE(TK.SORTKRITERIUM,'AF','af');  00016750
    TKNRTAB_REC.MÅLFORM       = TRANSLATE(TK.MÅLFORM,'BN','bn');        00016760
    TKNRTAB_REC.KDSENTRAL     = TRANSLATE(TK.DATASENTRAL,               00016770
                                          'ADKMNVØREST','adkmnvørest'); 00016780
    TKNRTAB_REC.EDBSYSTEM     = TRANSLATE(TK.EDBSYSTEM,'I','i');        00016790
                                                                        00016800
 END GI_VERDI;                                                          00016810
                                                                        00016820
                                                                        00016830
 GI_VERDI_2: PROC;                                                      00016840
                                                                        00016850
    TKLISTE_REC.TKNR          = TK.TKNR;                                00016860
    TKLISTE_REC.TKNAVN        = TK.TKNAVN;                              00016870
                                                                        00016880
    IF (TK.BESØKADR ^= '') THEN                                         00016890
       DO;                                                              00016900
          TKLISTE_REC.ADR1    = TK.BESØKADR;                            00016910
          TKLISTE_REC.POSTNR  = TK.BPOSTNR;                             00016920
          TKLISTE_REC.POSTNAVN= TK.BPOSTNAVN;                           00016930
       END;                                                             00016940
    ELSE                                                                00016950
       DO;                                                              00016960
          TKLISTE_REC.ADR1    = TK.POSTADR;                             00016970
          TKLISTE_REC.POSTNR  = TK.PPOSTNR;                             00016980
          TKLISTE_REC.POSTNAVN= TK.PPOSTNAVN;                           00016990
       END;                                                             00017000
                                                                        00017010
    TKLISTE_REC.TK_SJEF       = TK.TKSJEF;                              00017020
                                                                        00017030
    IF SUBSTR(HJ_TLF(1),4,1) = ')' THEN                                 00017040
       TKLISTE_REC.TLF           = SUBSTR(HJ_TLF(1),2,2) !!             00017050
                                   ' '                   !!             00017060
                                   SUBSTR(HJ_TLF(1),6,2) !!             00017070
                                   ' '                   !!             00017080
                                   SUBSTR(HJ_TLF(1),9,2) !!             00017090
                                   ' '                   !!             00017100
                                   SUBSTR(HJ_TLF(1),12,2)   ;           00017110
    ELSE                                                                00017120
       TKLISTE_REC.TLF           = SUBSTR(HJ_TLF(1),2,3) !!             00017130
                                   ' '                   !!             00017140
                                   SUBSTR(HJ_TLF(1),7,2) !!             00017150
                                   ' '                   !!             00017160
                                   SUBSTR(HJ_TLF(1),10,3)  ;            00017170
                                                                        00017180
    IF SUBSTR(TK.TELEFAX,4,1) = ')' THEN                                00017190
       TKLISTE_REC.TELEFAX       = SUBSTR(TK.TELEFAX,2,2) !!            00017200
                                   ' '                   !!             00017210
                                   SUBSTR(TK.TELEFAX,6,2) !!            00017220
                                   ' '                   !!             00017230
                                   SUBSTR(TK.TELEFAX,9,2) !!            00017240
                                   ' '                   !!             00017250
                                   SUBSTR(TK.TELEFAX,12,2)  ;           00017260
    ELSE                                                                00017270
       TKLISTE_REC.TELEFAX       = SUBSTR(TK.TELEFAX,2,3) !!            00017280
                                   ' '                   !!             00017290
                                   SUBSTR(TK.TELEFAX,7,2) !!            00017300
                                   ' '                   !!             00017310
                                   SUBSTR(TK.TELEFAX,10,3) ;            00017320
                                                                        00017330
    TKLISTE_REC.MÅLFORM       = TK.MÅLFORM;                             00017340
                                                                        00017350
 END GI_VERDI_2;                                                        00017360
                                                                        00017370
                                                                        00017380
 GRUPPE1: PROC;                                                         00017390
                                                                        00017400
   EXEC CICS IGNORE CONDITION NOTFND;                                   00017410
                                                                        00017420
   TK                    = '';                                          00017430
                                                                        00017440
   TK.TKNR               = TK0.TKNR;                                    00017450
                                                                        00017460
   TK.TKNAVN   = TRANSLATE(TK0.TKNAVN,X2,X3);                           00017470
                                                                        00017480
   TK.BESØKADR           = TK0.BESØKADR;                                00017490
   TK.BPOSTNR            = TK0.BPOSTNR;                                 00017500
                                                                        00017510
   POST_BIN              = TK0.BPOSTNR;                                 00017520
   POST_REC              = '';                                          00017530
                                                                        00017540
   EXEC CICS READ DATASET ('KDPOST')                                    00017550
                     INTO (POST_REC)                                    00017560
                   RIDFLD (POST_KEY);                                   00017570
                                                                        00017580
   IF POST_REC.POSTSTED_LANG ^= '' THEN                                 00017590
      TK.BPOSTNAVN = POST_REC.POSTSTED_LANG;                            00017600
   ELSE                                                                 00017610
      TK.BPOSTNAVN = POST_REC.POSTSTED_KORT;                            00017620
                                                                        00017630
   TK.POSTADR            = TK0.POSTADR;                                 00017640
   TK.PPOSTNR            = TK0.PPOSTNR;                                 00017650
                                                                        00017660
   POST_BIN              = TK0.PPOSTNR;                                 00017670
   POST_REC              = '';                                          00017680
                                                                        00017690
   EXEC CICS READ DATASET ('KDPOST')                                    00017700
                     INTO (POST_REC)                                    00017710
                   RIDFLD (POST_KEY);                                   00017720
                                                                        00017730
   IF POST_REC.POSTSTED_LANG ^= '' THEN                                 00017740
      TK.PPOSTNAVN = POST_REC.POSTSTED_LANG;                            00017750
   ELSE                                                                 00017760
      TK.PPOSTNAVN = POST_REC.POSTSTED_KORT;                            00017770
                                                                        00017780
   TK.TELEFAX            = TK0.TELEFAX;                                 00017790
   TK.TKSJEF             = TK0.TKSJEF;                                  00017800
   TK.SJEFTLF            = TK0.SJEFTLF;                                 00017810
   TK.SORTKRITERIUM      = TK0.SORTKRITERIUM;                           00017820
   TK.DATASENTRAL        = TK0.DATASENTRAL;                             00017830
   TK.DATASENTRALNR      = TK0.DATASENTRAL_NR;                          00017840
   TK.EDBSYSTEM          = TK0.EDBSYSTEM;                               00017850
   TK.ARBEIDSGIVER       = TK0.ARBEIDSGIVER;                            00017860
   TK.MÅLFORM            = TK0.MÅLFORM;                                 00017870
   TK.ANT_STILLING       = HJ_STILLING;                                 00017880
   TK.LOKALMASKINNR      = TK0.LOKALMASKINNR;                           00017890
   TK.ABONNEMENTNR       = TK0.ABONNEMENTNR;                            00017900
   TK.SAMBAND            = TK0.SAMBAND;                                 00017910
   TK.HASTIGHET          = TK0.HASTIGHET;                               00017920
   TK.ARBEIDSKONTOR      = TK0.ARBEIDSKONTOR;                           00017930
   TK.REGNSKAPSANSVAR1   = TK0.REGNSKAPSANSVAR1;                        00017940
   TK.REGNSKAPSANSVAR2   = TK0.REGNSKAPSANSVAR2;                        00017950
   TK.ÅRHUSLEIEREG       = TK0.ÅRHUSLEIEREG;                            00017960
   TK.MRKFYLKE           = TK0.MRKFYLKE;                                00017970
   TK.MRKREVISJON        = TK0.MRKREVISJON;                             00017980
   TK.REV_DISTRIKT       = TK0.REV_DISTRIKT;                            00017990
   TK.FYLKESKONTOR       = TK0.FYLKESKONTOR;                            00018000
   TK.ANT_BREV           = TK0.ANT_BREV    ;                            00018010
                                                                        00018020
 END GRUPPE1;                                                           00018030
                                                                        00018040
                                                                        00018050
 TK_DATABASE:                                                           00018060
   PROC    (STYRING);                                                   00018070
                                                                        00018080
   DCL                                                                  00018090
      STYRING             CHAR (5);                                     00018100
                                                                        00018110
  /* **************************************************************** */00018120
  /*     DL1-PARAMETRE SOM BRUKES VED INITIERINGS- OG AVSLUTTNINGS-   */00018130
  /*     KALL                                                         */00018140
  /* **************************************************************** */00018150
                                                                        00018160
     DCL                                                                00018170
       PSB_NAVN                    CHAR (8)       INIT('B001TK03'),     00018180
       PCB_FUNCTION                CHAR (4)       INIT('PCB '),         00018190
       TERM_FUNCTION               CHAR (4)       INIT('TERM');         00018200
                                                                        00018210
                                                                        00018220
  /* **************************************************************** */00018230
  /*     DLI CALL-PARAMETRE                                           */00018240
  /* **************************************************************** */00018250
                                                                        00018260
     DCL 1  DLI_PARAM,                                                  00018270
            2   PARM_CT_1          FIXED BIN (31)  INIT ( 1 ),          00018280
            2   PARM_CT_3          FIXED BIN (31)  INIT ( 3 ),          00018290
            2   PARM_CT_4          FIXED BIN (31)  INIT ( 4 );          00018300
                                                                        00018310
     IF STYRING = 'OPEN '                         THEN                  00018320
        DO;                                                             00018330
           CALL   PLITDLI                        (PARM_CT_3,            00018340
                                                  PCB_FUNCTION,         00018350
                                                  PSB_NAVN,             00018360
                                                  UIBPTR);              00018370
                                                                        00018380
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00018390
             DO;                                                        00018400
                ALLOCATE S001021O;                                      00018410
                S001021O.MELDING_1O =                                   00018420
                 'DB-FEIL PÅ ÅPNINGSKALLET, KODE:' !!                   00018430
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00018440
                                                                        00018450
                EXEC CICS SEND MAP('S001021') MAPSET('S001T43')         00018460
                       ERASE CURSOR;                                    00018470
                                                                        00018480
                EXEC CICS RECEIVE MAP('S001021')                        00018490
                       MAPSET('S001T43') SET(BMSMAPBR) ASIS;            00018500
                                                                        00018510
                EXEC CICS ABEND ABCODE(FEIL);                           00018520
             END;                                                       00018530
        END;                                                            00018540
     ELSE                                                               00018550
        DO;                                                             00018560
           CALL   PLITDLI                     (PARM_CT_1,               00018570
                                               TERM_FUNCTION);          00018580
                                                                        00018590
           IF DLIUIB.UIBFCTR               ^=    '00000000'B THEN       00018600
             DO;                                                        00018610
                S001021O.MELDING_1O =                                   00018620
                 'DB-FEIL PÅ STENGINGSKALLET, KODE:' !!                 00018630
                  UNSPEC(UIBFCTR) !! ' ' !! UNSPEC(UIBDLTR);            00018640
                                                                        00018650
                EXEC CICS SEND MAP('S001021') MAPSET('S001T43') ERASE;  00018660
                                                                        00018670
                EXEC CICS RECEIVE MAP('S001021')                        00018680
                       MAPSET('S001T43') SET(BMSMAPBR);                 00018690
                                                                        00018700
                EXEC CICS ABEND ABCODE(FEIL);                           00018710
             END;                                                       00018720
        END;                                                            00018730
                                                                        00018740
 END TK_DATABASE;                                                       00018750
                                                                        00018760
                                                                        00018770
                                                                        00018780
                                                                        00018790
 SKRIV_FEILMELDING: PROC;                                               00018800
                                                                        00018810
    ALLOCATE S001017O;                                                  00018820
    S001017I.TKNRL = CURSOR_POS;                                        00018830
                                                                        00018840
    S001017O.MELDING1O =                                                00018850
       'FEIL VED LABEL: ' !! FEIL_VED_LABEL;                            00018860
                                                                        00018870
    S001017O.MELDING2O =                                                00018880
       'UIBFCTR: ' !! UNSPEC(UIBFCTR) !!                                00018890
       ' UIBDLTR: ' !! UNSPEC(UIBDLTR);                                 00018900
                                                                        00018910
    S001017O.MELDING3O =                                                00018920
       'STATUS-KODE: ' !! TK1.STATUS_KODE;                              00018930
                                                                        00018940
    EXEC CICS SEND MAP('S001017') MAPSET('S001T43') ERASE CURSOR;       00018950
                                                                        00018960
    EXEC CICS RECEIVE MAP('S001017')                                    00018970
           MAPSET('S001T43') SET(BMSMAPBR) ASIS;                        00018980
                                                                        00018990
 END SKRIV_FEILMELDING;                                                 00019000
                                                                        00019010
 SJEKK_UT: PROC;                                                        00019020
                                                                        00019030
    IF S001017I.FUNKSJONSKODEL > 0 THEN                                 00019040
       FUNKSJONSKODE = S001017I.FUNKSJONSKODEI;                         00019050
    ELSE                                                                00019060
       IF S001017I.STYREKODEL > 0 THEN                                  00019070
          STYREKODE = S001017I.STYREKODEI;                              00019080
                                                                        00019090
    IF LEGG_TILBAKE_TLF_KOMM &                                          00019100
       ((FUNKSJONSKODE ^= ' ') ! (STYREKODE ^= ' ')) THEN               00019110
       DO;                                                              00019120
          LEGG_TILBAKE_TLF_KOMM = '0'B;                                 00019130
          CALL INSERT_BARN;                                             00019140
       END;                                                             00019150
                                                                        00019160
    IF FUNKSJONSKODE ^= ' ' THEN                                        00019170
       DO;                                                              00019180
          IF (VERIFY(FUNKSJONSKODE, 'Rr') = 0) THEN                     00019190
            DO;                                                         00019200
               PROGRAM_ID = 'R001TK04';                                 00019210
               TRANSKODE = 'RT04';                                      00019220
            END;                                                        00019230
                                                                        00019240
          ELSE                                                          00019250
            IF (VERIFY(FUNKSJONSKODE, 'Hh') = 0) THEN                   00019260
               DO;                                                      00019270
                  TRANSKODE = 'RT08';                                   00019280
                  PROGRAM_ID = 'R001TK08';                              00019290
               END;                                                     00019300
                                                                        00019310
            ELSE                                                        00019320
               IF (VERIFY(FUNKSJONSKODE, 'Ff') = 0) THEN                00019330
                  DO;                                                   00019340
                     PROGRAM_ID = 'R001TK09';                           00019350
                     TRANSKODE = 'RT09';                                00019360
                  END;                                                  00019370
                                                                        00019380
               ELSE                                                     00019390
                  DO;                                                   00019400
                     PROGRAM_ID = 'R001TK03';                           00019410
                     TRANSKODE = 'RT03';                                00019420
                  END;                                                  00019430
                                                                        00019440
          SEND_MAP      = '1'B;                                         00019450
          STYREKODE     = ' ';                                          00019460
          FUNKSJONSKODE = ' ';                                          00019470
                                                                        00019480
          CALL TK_DATABASE(TK_CLOSE);                                   00019490
                                                                        00019500
          EXEC CICS XCTL PROGRAM(PROGRAM_ID)                            00019510
               COMMAREA(KOM_OMR);                                       00019520
       END;                                                             00019530
                                                                        00019540
    ELSE                                                                00019550
      IF STYREKODE ^= ' ' THEN                                          00019560
         DO;                                                            00019570
             IF (VERIFY(STYREKODE, 'Aa') = 0) THEN                      00019580
                DO;                                                     00019590
                   PROGRAM_ID = 'R001TK07';                             00019600
                   TRANSKODE = 'RT07';                                  00019610
                END;                                                    00019620
                                                                        00019630
             ELSE                                                       00019640
                IF (VERIFY(STYREKODE, 'Kk') = 0) THEN                   00019650
                   DO;                                                  00019660
                      IF SUBSTR(FUNKSJON,6,1) = '' THEN                 00019670
                         DO;                                            00019680
                             PROGRAM_ID = 'R001TK04';                   00019690
                             TRANSKODE = 'RT04';                        00019700
                         END;                                           00019710
                      ELSE                                              00019720
                         DO;                                            00019730
                            PROGRAM_ID = 'R001TK06';                    00019740
                            TRANSKODE = 'RT06';                         00019750
                         END;                                           00019760
                   END;                                                 00019770
               ELSE                                                     00019780
                  IF (VERIFY(STYREKODE, 'Ss') = 0) THEN                 00019790
                     DO;                                                00019800
                        PROGRAM_ID = 'R001TK60';                        00019810
                        TRANSKODE = 'RT60';                             00019820
                     END;                                               00019830
                  ELSE                                                  00019840
                     IF (VERIFY(STYREKODE, 'Dd') = 0) THEN              00019850
                        DO;                                             00019860
                           PROGRAM_ID = 'R001TK61';                     00019870
                           TRANSKODE = 'RT61';                          00019880
                        END;                                            00019890
                     ELSE                                               00019900
                        IF (VERIFY(STYREKODE, 'Ff') = 0) THEN           00019910
                           DO;                                          00019920
                              PROGRAM_ID = 'R001TK62';                  00019930
                              TRANSKODE = 'RT62';                       00019940
                           END;                                         00019950
                        ELSE                                            00019960
                           DO;                                          00019970
                              PROGRAM_ID = 'R001TK04';                  00019980
                              TRANSKODE = 'RT04';                       00019990
                           END;                                         00020000
                                                                        00020010
            SEND_MAP      = '1'B;                                       00020020
            STYREKODE     = ' ';                                        00020030
            FUNKSJONSKODE = ' ';                                        00020040
                                                                        00020050
            CALL TK_DATABASE(TK_CLOSE);                                 00020060
                                                                        00020070
            EXEC CICS XCTL PROGRAM(PROGRAM_ID)                          00020080
                   COMMAREA(KOM_OMR);                                   00020090
         END;                                                           00020100
 END SJEKK_UT;                                                          00020110
                                                                        00020120
                                                                        00020130
  FEILBEH:                                                              00020140
                                                                        00020150
     CALL TK_DATABASE(TK_CLOSE);                                        00020160
                                                                        00020170
     ALLOCATE S001017O;                                                 00020180
                                                                        00020190
     S001017O.MELDING1O =                                               00020200
                                                                        00020210
              'F E I L  H A R  O P P S T Å T T ! ! !.';                 00020220
                                                                        00020230
     S001017O.MELDING2O =                                               00020240
              'EIBRCODE : ' !! UNSPEC(EIBRCODE);                        00020250
                                                                        00020260
     S001017O.MELDING3O =                                               00020270
          'EIBFN    : ' !! UNSPEC(EIBFN) !! '. FEILKODE : ' !! FEILKODE 00020280
                                         !! '. DATASETT : ' !! DSNAVN;  00020290
                                                                        00020300
     S001017O.MELDING4O =                                               00020310
                   'PROGRAMNAVN :  ' !! PROGRAM_ID    !!                00020320
                   '.INGEN OPPDATERING ER BLITT UTFØRT.';               00020330
                                                                        00020340
     S001017O.MELDING5O =                                               00020350
                   'TA UTSKRIFT!!!. TRYKK DERETTER "ENTER".';           00020360
                                                                        00020370
                                                                        00020380
     EXEC CICS SEND MAP('S001017') MAPSET('S001T43') ERASE;             00020390
                                                                        00020400
     EXEC CICS RECEIVE MAP('S001017')                                   00020410
                       MAPSET('S001T43') SET(BMSMAPBR);                 00020420
                                                                        00020430
                                                                        00020440
     EXEC CICS SYNCPOINT ROLLBACK;                                      00020450
                                                                        00020460
     EXEC CICS RETURN;                                                  00020470
                                                                        00020480
                                                                        00020490
 %PAGE;                                                                 00020500
      %INCLUDE R001TK41;               /* BLANKER TRANSOMRÅDET OG   */  00020510
                                       /* MELDINGSNUMMER            */  00020520
 %PAGE;                                                                 00020530
      %INCLUDE R001TK42;               /* MAP -> ARBEIDSOMRÅDE      */  00020540
                                                                        00020550
                                       /* KONTROLL AV TK            */  00020560
 %PAGE;                                                                 00020570
      %INCLUDE R001TK43;               /* ARBEIDSOMRÅDE -> MAP      */  00020580
 %PAGE;                                                                 00020590
      %INCLUDE R0019910;               /* NUMERISK KONTROLL         */  00020600
 %PAGE;                                                                 00020610
      %INCLUDE R0019912;               /* KONVERTERING CHAR ==> PIC */  00020620
 %PAGE;                                                                 00020630
      %INCLUDE R001TK46;               /* SKRIV_FEIL      */            00020640
                                                                        00020650
 END R001TK7;                                                           00020660
