 /*   SIST ENDRET PÅ PROD   2004.12.17 14.38.08 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2004.07.13 13.15.28 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.09.19 12.55.15 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2003.02.27 12.38.43 AV   JDA2970          */        
 /*   SIST ENDRET PÅ TEST   2002.11.21 13.30.29 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2002.09.23 13.01.55 AV   JDA2970          */        
 /*   SIST ENDRET PÅ PROD   2001.10.22 12.54.33 AV   JDA2970          */        
 /*       SIST ENDRET 04/05-98 14.16.15 AV   JDA7339                  */        
 /*       SIST ENDRET 26/11-97 11.30.18 AV   SPA7339                  */        
 R00104:                                                                        
   PROC(COMMAREA_PEKER) OPTIONS(MAIN);                                          
 %SKIP;                                /*  */                                   
 /******************************************************************* */        
 /*IDENTIFIKASJON:                                                    */        
 /************************                                            */        
 /*  PROGRAM-IDENT : R0010401-REGISTRERING NYE BLANKETTER-HOVEDPROGR. */        
 /*  PROGRAM-SPRÅK : PLI/CICS                                         */        
 /*  PROGRAMMERER  : ?                                                */        
 /*  PROGRAMMET BLE LAGET  ?                                          */        
 /*  ENDRINGERSDATO : PROGRAMMET ER SPLITTET, SLIK AT DET LINKER      */        
 /*                   A401, B401 OG C401                              */        
 /******************************************************************* */        
 /*HENSIKT:*/                                                                   
 /************                                                        */        
 /*  PROGRAMMET ER MED I STYRINGEN AV MENYEN VED OPPSTARTINGEN        */        
 /*  AV FOLKETRYGDSYSTEMET OG ER DET FØRSTE PROGRAMMET UNDER          */        
 /*  REGISTRERING. PROGRAMMETS TRANSKODE ER R040 OG R041.             */        
 /*  PROGRAMMET BLIR AKTIVISERT NÅR OPERATØREN TASTER INN 'R' I       */        
 /*  FUNKSJONSKODE (MAP S001014 MAPSET S001013)                       */        
 /*  PROGRAMMET LESER INN STYRINGSKODEN, KONTROLLERER DEN             */        
 /*  OG SENDER UT DET FØRSTE BILDET AV DEN BLANKETTEN SOM SKAL        */        
 /*  REGISTRERES.                                                     */        
 /******************************************************************* */        
 /*PROGRAMTILKNYTTING:*/                                                        
 /**********************                                              */        
 /*  PROGRAMMET BLIR AKTIVISERT FRA CICS MED TRANSID = R040 OG R041.  */        
 /*  R040: KONTROLLEN KOMMER FRA R0010301                             */        
 /*  R041: KONTROLLEN KOMMER FRA                                      */        
 /*  PROGRAMMET GÅR VIA CICS TIL FORSKJELLIGE PROGRAMMER AVHENGIG     */        
 /*  HVILKEN STYRINGSKODE SOM BLIR SATT AV OPERATØREN ELLER           */        
 /*  ETTER BLANKETTKONTROLLEN TRANSKODE SATT AV PROGRAMMENE:          */        
 /*  AP - ALDERSPENSJON    - R050 - R0010501                          */        
 /*  A1 - ALDERSPENSJON                                               */        
 /*  UP - UFØREPENSJON     - R060 - R0010601                          */        
 /*  U2 - UFØREPENSJON     -                                          */        
 /*  U3 - UFØREPENSJON     -                                          */        
 /*  US - GR/HJ STØNAD     - R070 - R0010701                          */        
 /*  EP - ETTERLATT EK     - R080 - R0010801                          */        
 /*  E3 - ETTERLATT EK     -                                          */        
 /*  EF - ETTERLATT FP     - R090 - R0010901                          */        
 /*  E4 - ETTERLATT FP     -                                          */        
 /*  FB - FORELDRELØSE BARN- R100 - R0011001                          */        
 /*  F5 - FORELDRELØSE BARN-                                          */        
 /*  BP - ETTERLATTE  BARN - R110 - R0011101                          */        
 /*  B6 - ETTERLATTE  BARN -                                          */        
 /*  FT - FORSØRGINGSTILL. - R120 - R0011201                          */        
 /*  F7 - FORSØRGINGSTILL. -                                          */        
 /*  FO - FORSØRGINGSTILL. -                                          */        
 /*  TG - TILLEGGSBLANKETT - R130 - R0011301                          */        
 /*  E1 - ENDRINGSBLANK-1  - R140 - R0011401                          */        
 /*  EN - ENDRINGSBLANK-1  -                                          */        
 /*  YK - KORRIGERING AV YRKESKODE                                    */        
 /*  O1 - OPPHØRSBLANK-1   - R160 - R0011601                          */        
 /*  O2 - OPPHØRSBLANK-2   - R170 - R0011701                          */        
 /*  MK - MEDISINSK KODE   - RB00 - R001B001                          */        
 /*  AF -AFP               - R190 - R0011901                          */        
 /*  UF -UNGE UFØRE FØR 1967 R183 - R0011831                          */        
 /*  UF - UNGE UF   FØR 1967 R183 - R0011831                          */        
 /*  XX - NY FUNKSJONSKODE - R030 - R0010301                          */        
 /*                          R042 - R0012001 -FEILFRI BLANKETT        */        
 /*                                                                   */        
 /******************************************************************* */        
 /*DATASETTOPPLYSNINGER:                                              */        
 /*************************                                           */        
 /*  DET BLIR IKKE BRUKT NOEN DATASETT I DETTE PROGRAMMET             */        
 /*                                                                   */        
 /******************************************************************* */        
 /*FEILMELDINGER:*/                                                             
 /*********************                                               */        
 /* 'UGYLDIG STYREKODE' BLIR SKREVET PÅ SKJERMBILDET NÅR STYRINGSKODE */        
 /*  IKKE HAR GYLDIG VERDI                                            */        
 /*                                                                   */        
 /* ***************************************************************** */        
 %PAGE;                                                                         
      %INCLUDE S00101;     /*  MENY MAPSETTET  */                               
 %PAGE;                                                                         
 %PAGE;                                                                         
      %INCLUDE P0019906;   /*  TRANS_OPPL_OMRÅDE  (BASED) */                    
 %PAGE;                                                                         
      %INCLUDE P0019908;   /*  KOM_OMRÅDE (BASED) */                            
 %PAGE;                                                                         
      %INCLUDE P0019910;   /*  STYRINGS_OMRÅDE (BASED) */                       
 %PAGE;                                                                         
      %INCLUDE P0019912;   /*  DIV_PARAM_OMRÅDE (BASED) */                      
 %PAGE;                                                                         
 /*   %INCLUDE P0019959;       OMRAADE FOR FUNKTAB      */                      
      %INCLUDE P0019999;  /*   ATK_OMR                  */                      
 %PAGE;                                                                         
      %INCLUDE DFHBMSCA;   /*  MAP HJELPEFELT           */                      
 %PAGE;                                                                         
   DCL                                                                          
      (COMMAREA_PEKER,IDENT_PEKER,                                              
      BMSMAPBR)      PTR;                                                       
   DCL                                                                          
      IDENT_BIT BIT(32) BASED (IDENT_PEKER);                                    
   DCL                                                                          
      (NULL,CSTG,ADDR,SUBSTR,STG) BUILTIN;                                      
                                                                                
                                                                                
   DCL DATO     PIC '(8)9' INIT (0);                                            
   DCL C_DATO_ÅMD     PIC '(8)9' INIT (0);                                      
   DCL                                                                          
      HJ2_DATO_HÅMD   PIC '(8)9',                                               
                                                                                
      HJ2_ÅR DEF HJ2_DATO_HÅMD  POS (1) PIC '(4)9',                             
                                                                                
      HJ1_DATO_HÅMD  PIC '(8)9',                                                
                                                                                
      HJ1_ÅR DEF HJ1_DATO_HÅMD  POS (1) PIC '(4)9';                             
                                                                                
  KOM_OMR.PEKER_LISTE.STYRINGS_PEKER    = ADDR(KOM_OMR.STYRINGS_OMR)   ;        
  KOM_OMR.PEKER_LISTE.TRANS_PEKER       = ADDR(KOM_OMR.TRANS_OMR)      ;        
  KOM_OMR.PEKER_LISTE.TRANS_LISTE_PEKER = ADDR(KOM_OMR.TRANS_LISTE_OMR);        
  KOM_OMR.PEKER_LISTE.DIV_PARAM_PEKER   = ADDR(KOM_OMR.DIV_PARAM_OMR)  ;        
  KOM_OMR.PEKER_LISTE.TRANS_OPPL_PEKER  = ADDR(KOM_OMR.TRANS_OPPL_OMR) ;        
  ATK_KOM_PTR                          =  ADDR(KOM_OMR.ATK_COM_OMR);            
                                                                                
  EXEC CICS HANDLE CONDITION ERROR(FEILBEH);                                    
                                                                                
    DATO        = DIV_PARAM_OMR.DATO_2000;                                      
    DIV_PARAM_OMR.BO_TKNR  = 0;          /* SATISH FOR ACF2 30012001 */         
    DIV_PARAM_OMR.FEIL_MELD_NR = 0;                                             
    IF TRANSKODE ^= 'R042' THEN                                                 
       ATK_KOM_OMR.ACF2_F_KODE = ' ';                                           
                                                                                
                                                                                
  IF TRANSKODE = 'R040' THEN                                                    
     DO;                                                                        
         EXEC CICS RECEIVE MAP('S001014') MAPSET ('S001013')                    
                                                   SET(BMSMAPBR);               
                                                                                
            /* LESER SKJERMBILDE MED STYRINGSKODE  */                           
                                                                                
            IF S001014I.STYRE_KODEL > 0 THEN                                    
               STYREKODE = S001014I.STYRE_KODEI;                                
     END;                                                                       
  SELECT(TRANSKODE);                                                            
    WHEN('R040','R041')                                                         
    DO;                                                                         
            /* INITIERING AV DIV STYREPARAMETRE     */                          
                                                                                
       DIV_PERIODE                   = '' ;                                     
       DIV_PARAM_OMR.FRA_CICS        = '1'B;                                    
       DIV_PARAM_OMR.HENT_FRAM_MAP   = '0'B;                                    
       DIV_PARAM_OMR.FRA_MED_DIALOG  = '0'B;                                    
       DIV_PARAM_OMR.FRA_UTEN_DIALOG = '0'B;                                    
       IF STYRINGS_OMR.FUNKSJONSKODE   = ' ' THEN                               
          STYRINGS_OMR.FUNKSJONSKODE   = 'R';                                   
                                                                                
       KOM_OMR.PCB_UIB_PEKER = NULL;                                            
                                                                                
          DO;                                                                   
                                                                                
            SELECT(STYREKODE);                                                  
  /*  WHEN('AP','EP','EF','FB','BP','FT','TG',  ENDRET AV SP 230902             
                    'E1','E2','O1','O2','AU','NI','AF','UF','UP') */            
               WHEN('AP','UP','EP','FB','BP','FT','TG',                         
                    'E1','O1','O2','AF','UF','YK')                              
                  DO;                                                           
                     EXEC CICS XCTL PROGRAM('R001A401')                         
                                                    COMMAREA (KOM_OMR);         
                                                                                
                  END;                                                          
               WHEN('A1','U2','E3','E4','B6','F7')                              
                  DO;                                                           
                     EXEC CICS XCTL PROGRAM('R001B401')                         
                                                    COMMAREA (KOM_OMR);         
                                                                                
                  END;                                                          
               WHEN('U3','FO','EN','EE','KF')                                   
                  DO;                                                           
                     EXEC CICS XCTL PROGRAM('R001C401')                         
                                                    COMMAREA (KOM_OMR);         
                                                                                
                  END;                                                          
               WHEN('XX')                                                       
                  DO;                                                           
                     TRANSKODE = 'R030';                                        
                     ALLOCATE S001013O ;                                        
                     S001013O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;            
                     S001013O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;          
                     /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */         
                     /* FUNKSJONSKODE                                */         
                                                                                
                     EXEC CICS SEND MAP('S001013') MAPSET('S001013')            
                                                   ERASE ;                      
                  END;                                                          
               OTHERWISE                                                        
                  DO;                                                           
                     /* FEILMELDING 'UGYLDIG STYREKODE' SKRIVES */              
                     IF TRANSKODE > 'R040' THEN                                 
                       DO;                                                      
                         EXEC CICS SEND MAP ('S001014') MAPSET                  
                         ('S001013') MAPONLY SET(BMSMAPBR);                     
                         ALLOCATE S001014O;                                     
                       END;                                                     
                     S001014O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN ;           
                     S001014O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;          
                     S001014O.MELDINGO    = 'UGYLDIG STYREKODE';                
                     S001014O.STYRE_KODEO = STYREKODE;                          
                     EXEC CICS SEND MAP('S001014') MAPSET('S001013')            
                     ERASE;                                                     
                     TRANSKODE = 'R040';                                        
                  END;                                                          
                                                                                
            END;                   /* END  SELECT                    */         
                                                                                
          END;                   /* END ELSE DO                      */         
                                                                                
    END;                  /*  END      TRANSKODE  'R040','R041'      */         
                                                                                
    WHEN('R042')                                                                
    DO;                                                                         
               IF STYREKODE ^= 'E2' &                                           
                  STYREKODE ^= 'NI' THEN                                        
                  DO;                                                           
                     HJ1_DATO_HÅMD = VIRKNINGSDATO_ÅMD;                         
                     HJ2_DATO_HÅMD = DIV_PARAM_OMR.DATO_2000;                   
                                                                                
                     IF (HJ2_ÅR - HJ1_ÅR) > 8 THEN                              
                        TRANSKODE = 'R201';                                     
                     ELSE                                                       
                        TRANSKODE = 'R200';                                     
                  END;                                                          
               ELSE                                                             
                  TRANSKODE = 'R200';                                           
                                                                                
               EXEC CICS XCTL PROGRAM('R0012001') COMMAREA(KOM_OMR);            
                                                                                
               /* VIA CICS TIL STYRING-AV-BEHANDLE-TRANS  */                    
    END;                                                                        
   OTHERWISE                                                                    
    DO;                                                                         
               /* FEILMELDING 'UGYLDIG TRANSKODE' SKRIVES */                    
               EXEC CICS SEND MAP ('S001014') MAPSET                            
                                    ('S001013') MAPONLY SET(BMSMAPBR);          
               ALLOCATE S001014O;                                               
               S001014O.MELDINGO = 'UGYLDIG TRANSKODE: ' !! TRANSKODE;          
               S001014O.STYRE_KODEO = STYREKODE;                                
               S001014O.CICS_INFOO  = DIV_PARAM_OMR.CICS_NAVN;                  
               S001014O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                
                                                                                
               EXEC CICS SEND MAP('S001014') MAPSET('S001013')                  
                                                                ERASE;          
               TRANSKODE = 'R040';                                              
    END;                                                                        
 END;                   /* * * * * END SELECT STYREKODE    */                   
                                                                                
      EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);                    
                                                                                
   FEILBEH:                                                                     
      TRANSKODE = 'R030';                                                       
      ALLOCATE S001013O ;                                                       
      S001013O.CICS_INFOO = DIV_PARAM_OMR.CICS_NAVN ;                           
      S001013O.ROLLEO       = DIV_PARAM_OMR.ATK_ROLLE ;                         
      EXEC CICS SEND MAP('S001013') MAPSET('S001013')                           
                                                    MAPONLY ERASE;              
                                                                                
      /* SKRIVER SKJERMBILDET FOR REGISTRERING AV NY  */                        
      /* FUNKSJONSKODE                                */                        
      EXEC CICS RETURN                                  ;                       
   /* EXEC CICS RETURN TRANSID(TRANSKODE) COMMAREA(KOM_OMR);  */                
                                                                                
 %INCLUDE R0019982;   /*  DATO KONVT   */                                       
 %PAGE;                                                                         
 END R00104;                                                                    
