 /*       SIST ENDRET 09/06-98 08.30.35 AV   SPA7339                  */00000000
 /*       SIST ENDRET 20/05-98 11.23.32 AV   SPA7339                  */00000010
 /* ***************************************************************** */00000020
 /*               R 0 0 1 0 6 0 8                                     */00000030
 /* ***************************************************************** */00000040
 /*IDENTIFIKASJON:                                                    */00000050
 /* **********************                                            */00000060
 /*  PROGRAM-IDENT : R001N608      TT_UP_EP      SUBPROGRAM           */00000070
 /*  PROGRAM-SPRÅK : PLI                                              */00000080
 /*  PROGRAMMERER  : SATISH                                           */00000090
 /*  PROGRAMMET BLE LAGET : DEC 1990                                  */00000100
 /*  ENDRINGEN GJELDER: GRENSE FOR MAX TT, IKKE LENGER 40 ÅR          */00000110
 /*  ENDRINGEN BLE UTFØRT AV : KARIN                                  */00000120
 /*                                                                   */00000130
 /* ***************************************************************** */00000140
 /*HENSIKT:                                                           */00000150
 /* **********                                                        */00000160
 /*    BEREGNER MAKS TT FØR 1967, OG TT FRA 1966 TIL UFØRE/           */00000170
 /*    DØDSTI_ÅMDDSPUNKTET                                            */00000180
 /*  BRUK:                                                            */00000190
 /*    CALL TT_UP_EP(FNR,DATO,MAKS_TT_FØR_1967,TT_TIL_TPK);           */00000200
 /*  PARAMETER INN :                                                  */00000210
 /*    FNR,DATO                                                       */00000220
 /*  PARAMETER UT :                                                   */00000230
 /*    MAKS_TT_FØR_1967, TT_TIL_TPK                                   */00000240
 /*                                                                   */00000250
 /* ***************************************************************** */00000260
 /*PROGRAMTILKNYTTING:                                                */00000270
 /* ********************                                              */00000280
 /*  PROGRAMMET INCLUDES I R001N601 - KONTROLL_GRUNNBLANKETT_UP       */00000290
 /*  PROGRAMMET INCLUDES I R0010801 - KONTROLL_GRUNNBLANKETT_EP       */00000300
 /*                                                                   */00000310
 /* ***************************************************************** */00000320
 /*DATASETTOPPLYSNINGER:                                              */00000330
 /* ***********************                                           */00000340
 /*  INGEN                                                            */00000350
 /* ***************************************************************** */00000360
 /*FEILMELDINGER:                                                     */00000370
 /* *******************                                               */00000380
 /*  INGEN                                                            */00000390
 /* ***************************************************************** */00000400
 %PAGE;                                                                 00000410
 TT_UP_EP:                                                              00000420
    PROC(FNR,TPK_ÅMD,MAKS_TT_FØR_1967,TT_TIL_TPK);                      00000430
                                                                        00000440
   DCL   FNR                    PIC'(11)9';                             00000450
                                                                        00000460
   DCL                                                                  00000470
      TPK_ÅMD PIC'(8)9',                                                00000480
      TPK_M DEF TPK_ÅMD POS(5) PIC '99',                                00000490
      TPK_Å DEF TPK_ÅMD POS(1) PIC '9999';                              00000500
   DCL                                                                  00000510
      MAKS_TT_FØR_1967 PIC'(2)9',                                       00000520
      TT_TIL_TPK PIC'(4)9';                                             00000530
                                                                        00000540
   DCL  FNR13                  PIC'(13)9';                              00000550
   DCL                                                                  00000560
      W_FNR13_MN PIC'(2)9' DEF FNR13 POS(3),                            00000570
      W_FNR13_ÅR PIC'(4)9' DEF FNR13 POS(5),                            00000580
      W_PERSNR PIC'(3)9' DEF FNR13 POS(7);                              00000590
                                                                        00000600
 %SKIP(2);                                                              00000610
   FNR13 = KONV_FNR11_FNR13(FNR);                                       00000620
                                                                        00000630
   MAKS_TT_FØR_1967 = 1967 - ( W_FNR13_ÅR + 16);                        00000640
                                                                        00000650
   TT_TIL_TPK = TPK_ÅMD - 19670000;                                     00000660
   RETURN;                                                              00000670
 END TT_UP_EP;                                                          00000680
