 /*       SIST ENDRET 09/06-98 08.29.47 AV   SPA7339                  */00000000
 /*       SIST ENDRET 25/05-98 10.43.27 AV   HLA7339                  */00000010
 /*IDENTIFIKASJON:                                                    */00000020
 /*    R001NC06 - PROSEDYRE I PLI                                     */00000030
 /*    PROGRAMMERER:       SATISH 1991                                */00000040
 /*HENSIKT:                                                           */00000050
 /*    PROGRAMMET INNEHOLDER:                                         */00000060
 /*        PROSEDYRER FOR Å OVERFØRE DATA FRA F7_TRANS_OMR TIL        */00000070
 /*            SKJERMBILDE (MAP S001NC1 MAPSET S001NC3).              */00000080
 /*BRUK:                                                              */00000090
 /*    OVERFØR_F7_SØKER_MAP:   OVERFØRING AV SØKERDELEN               */00000100
 /*    OVERFØR_F7_BARN_MAP:    OVERFØRING AV BARNEDELEN               */00000110
 /*                                                                   */00000120
 /* ***************************************************************** */00000130
 /*                                                                   */00000140
 /*   PROSEDYRA OVERFØRER DATA FRA F7_TRANS_OMR.F7S TIL               */00000150
 /*   SKJERMBILDE F7_SØKER DELEN.                                     */00000160
 /*   MAP: S001NC1                                                    */00000170
 /*   MAPSET: S001NC3                                                 */00000180
 /*                                                                   */00000190
 /* ***************************************************************** */00000200
 %SKIP(2);                                                              00000210
 OVERFØR_F7_SØKER_MAP:                                                  00000220
   PROC;                                                                00000230
   DCL                                                                  00000240
      NORMAL  CHAR (1),                                                 00000250
      NOR_NUM CHAR (1),                                                 00000260
      BRI_NUM CHAR (1);                                                 00000270
      NORMAL    = ' ';                                                  00000280
      NOR_NUM   = '&';                                                  00000290
      BRI_NUM   = 'Q';                                                  00000300
 %SKIP(2);                                                              00000310
      S001NC1O.REGDATOO = KONV_HÅMD_ÅMD(F7S.REGDATO_ÅMD);  /*2000*/     00000320
      S001NC1O.TERMIDO = F7S.TERMID;                                    00000330
      S001NC1O.FNRO  = F_FELT_PIC_CHAR11 (F7S.FNR);                     00000340
      S001NC1O.TKNRO = F_FELT_PIC_CHAR4 (F7S.TKNR);                     00000350
      S001NC1O.TILL_EKO = F7S.TILL_EK;                                  00000360
      IF F_FELT_PIC_CHAR2(F7S.BT_ANT) ^= (2)'0' THEN                    00000370
        S001NC1O.BT_ANTO = F_FELT_PIC_CHAR2 (F7S.BT_ANT);               00000380
   S001NC1O.VIRK_DATO_MÅO = KONV_HÅMD_MÅ(F7S.VIRK_DATO_ÅMD);/*2000*/    00000390
      IF F_FELT_PIC_CHAR11(F7S.FNR_EK) ^= (11)'0' THEN                  00000400
         S001NC1O.FNR_EKO = F_FELT_PIC_CHAR11 (F7S.FNR_EK);             00000410
                                                                        00000420
  /*  S001NC1O.NAVN_EKO = F7S.NAVN_EK;              161287 BF */        00000430
 /* FEILMELDINGER MARKERING AV  FELT (ATTRIBUTTENE) */                  00000440
 %SKIP(2);                                                              00000450
      S001NC1O.DUMMYA = '_';                                            00000460
                                                                        00000470
  /*DERSOM FEIL FRA BEHANDLE-TRANS OVERFØRES FEIL HER,BARE FØRSTE GANG*/00000480
       IF ^ FRA_CICS THEN                                               00000490
          DO;                                                           00000500
            IF FEIL_MELD_NR > 0 THEN                                    00000510
               CALL SKRIV_FEIL(FEIL_MELD_NR);                           00000520
             FEIL_MELD_NR = 0;                                          00000530
          END;                                                          00000540
                                                                        00000550
      S001NC1O.REGDATOA = DFHBMASK;                                     00000560
      S001NC1O.TERMIDA  = DFHBMASK;                                     00000570
                                                                        00000580
      IF F7S.FNRNR = 0 THEN                                             00000590
         S001NC1O.FNRA = NOR_NUM;                                       00000600
      ELSE                                                              00000610
         DO;                                                            00000620
            S001NC1O.FNRA = BRI_NUM;                                    00000630
            S001NC1I.FNRL = CURSOR_POS;                                 00000640
            IF F7S.FNRNR ^= 999 THEN                                    00000650
               CALL SKRIV_FEIL(F7S.FNRNR);                              00000660
         END;                                                           00000670
      IF F7S.TKNRNR = 0 THEN                                            00000680
         S001NC1O.TKNRA = NOR_NUM;                                      00000690
      ELSE                                                              00000700
         DO;                                                            00000710
            S001NC1O.TKNRA = BRI_NUM;                                   00000720
            S001NC1I.TKNRL = CURSOR_POS;                                00000730
            IF F7S.TKNRNR ^= 999 THEN                                   00000740
               CALL SKRIV_FEIL(F7S.TKNRNR);                             00000750
         END;                                                           00000760
      IF F7S.TILL_EKNR = 0 THEN                                         00000770
         S001NC1O.TILL_EKA = NORMAL;                                    00000780
      ELSE                                                              00000790
         DO;                                                            00000800
            S001NC1O.TILL_EKA = DFHBMBRY;                               00000810
            S001NC1I.TILL_EKL = CURSOR_POS;                             00000820
            IF F7S.TILL_EKNR ^= 999 THEN                                00000830
               CALL SKRIV_FEIL(F7S.TILL_EKNR);                          00000840
         END;                                                           00000850
      IF F7S.BT_ANTNR = 0 THEN                                          00000860
         S001NC1O.BT_ANTA = NOR_NUM;                                    00000870
      ELSE                                                              00000880
         DO;                                                            00000890
            S001NC1O.BT_ANTA = BRI_NUM;                                 00000900
            S001NC1I.BT_ANTL = CURSOR_POS;                              00000910
            IF F7S.BT_ANTNR ^= 999 THEN                                 00000920
               CALL SKRIV_FEIL(F7S.BT_ANTNR);                           00000930
         END;                                                           00000940
      IF F7S.VIRK_DATO_ÅMDNR = 0 THEN             /*2000*/              00000950
         S001NC1O.VIRK_DATO_MÅA = NOR_NUM;                              00000960
      ELSE                                                              00000970
         DO;                                                            00000980
            S001NC1O.VIRK_DATO_MÅA = BRI_NUM;                           00000990
            S001NC1I.VIRK_DATO_MÅL = CURSOR_POS;                        00001000
            IF F7S.VIRK_DATO_ÅMDNR ^= 999 THEN        /*2000*/          00001010
               CALL SKRIV_FEIL(F7S.VIRK_DATO_ÅMDNR);  /*2000*/          00001020
         END;                                                           00001030
      IF F7S.FNR_EKNR = 0 THEN                                          00001040
         S001NC1O.FNR_EKA = NOR_NUM;                                    00001050
      ELSE                                                              00001060
         DO;                                                            00001070
            S001NC1O.FNR_EKA = BRI_NUM;                                 00001080
            S001NC1I.FNR_EKL = CURSOR_POS;                              00001090
            IF F7S.FNR_EKNR ^= 999 THEN                                 00001100
               CALL SKRIV_FEIL(F7S.FNR_EKNR);                           00001110
         END;                                                           00001120
                                                                        00001130
                                                                        00001140
     /* VED GAMLE TRANS SKAL FNR OG VIRKDATO BLOKKERES    */            00001150
                                                                        00001160
      IF NY_GML_TRANS_IND = 'G' & FRA_MED_DIALOG THEN                   00001170
         DO;                                                            00001180
           S001NC1O.FNRA          = DFHBMASK;                           00001190
           S001NC1O.VIRK_DATO_MÅA = DFHBMASK;                           00001200
         END;                                                           00001210
                                                                        00001220
      ELSE IF FRA_UTEN_DIALOG THEN      /* BLOKKER ALT SAMMEN   */      00001230
                                                                        00001240
         DO;                                                            00001250
           S001NC1O.REGDATOA      = DFHBMASK;                           00001260
           S001NC1O.TERMIDA       = DFHBMASK;                           00001270
           S001NC1O.FNRA          = DFHBMASK;                           00001280
           S001NC1O.TKNRA         = DFHBMASK;                           00001290
           S001NC1O.TILL_EKA      = DFHBMASK;                           00001300
           S001NC1O.BT_ANTA       = DFHBMASK;                           00001310
           S001NC1O.VIRK_DATO_MÅA = DFHBMASK;                           00001320
           S001NC1O.FNR_EKA       = DFHBMASK;                           00001330
                                                                        00001340
         END;                                                           00001350
                                                                        00001360
      IF ^ FRA_CICS THEN                                                00001370
         DO;                                                            00001380
           S001NC1O.STYRE_KODEA    = DFHBMASK;                          00001390
           S001NC1O.FUNKSJONSKODEA = DFHBMASK;                          00001400
         END;                                                           00001410
                                                                        00001420
   END OVERFØR_F7_SØKER_MAP;                                            00001430
                                                                        00001440
 OVERFØR_F7_SØKER2_MAP:                                                 00001450
   PROC;                                                                00001460
   DCL                                                                  00001470
      NORMAL  CHAR (1),                                                 00001480
      NOR_NUM CHAR (1),                                                 00001490
      BRI_NUM CHAR (1);                                                 00001500
      NORMAL    = ' ';                                                  00001510
      NOR_NUM   = '&';                                                  00001520
      BRI_NUM   = 'Q';                                                  00001530
                                                                        00001540
      IF  F7S.PENSJONSINNTEKT > 0   THEN                                00001550
          S001NC1O.PIO         = F7S.PENSJONSINNTEKT;                   00001560
      IF  F7S.ARBEIDSINNTEKT   > 0  THEN                                00001570
          S001NC1O.AIO         = F7S.ARBEIDSINNTEKT;                    00001580
      IF  F7S.PENSJONSINNTEKT_EK > 0 THEN                               00001590
          S001NC1O.PI_EKO      = F7S.PENSJONSINNTEKT_EK;                00001600
      IF  F7S.ARBEIDSINNTEKT_EK > 0 THEN                                00001610
          S001NC1O.AI_EKO      = F7S.ARBEIDSINNTEKT_EK;                 00001620
 %SKIP(3);                             /*    */                         00001630
      IF F7S.PENSJONSINNTEKTNR = 0 THEN                                 00001640
         S001NC1O.PIA         = NOR_NUM;                                00001650
      ELSE                                                              00001660
         DO;                                                            00001670
            S001NC1O.PIA         = DFHBMBRY;                            00001680
            S001NC1I.PIL         = CURSOR_POS;                          00001690
            IF F7S.PENSJONSINNTEKTNR ^= 999 THEN                        00001700
               CALL SKRIV_FEIL(F7S.PENSJONSINNTEKTNR );                 00001710
         END;                                                           00001720
      IF F7S.ARBEIDSINNTEKTNR = 0 THEN                                  00001730
         S001NC1O.AIA         = NOR_NUM;                                00001740
      ELSE                                                              00001750
         DO;                                                            00001760
            S001NC1O.AIA         = DFHBMBRY;                            00001770
            S001NC1I.AIL         = CURSOR_POS;                          00001780
            IF F7S.ARBEIDSINNTEKTNR ^= 999 THEN                         00001790
               CALL SKRIV_FEIL(F7S.ARBEIDSINNTEKTNR );                  00001800
         END;                                                           00001810
      IF F7S.PENSJONSINNTEKT_EKNR = 0 THEN                              00001820
         S001NC1O.PI_EKA         = NOR_NUM;                             00001830
      ELSE                                                              00001840
         DO;                                                            00001850
            S001NC1O.PI_EKA         = DFHBMBRY;                         00001860
            S001NC1I.PI_EKL         = CURSOR_POS;                       00001870
            IF F7S.PENSJONSINNTEKT_EKNR ^= 999 THEN                     00001880
               CALL SKRIV_FEIL(F7S.PENSJONSINNTEKT_EKNR );              00001890
         END;                                                           00001900
      IF F7S.ARBEIDSINNTEKT_EKNR = 0 THEN                               00001910
         S001NC1O.AI_EKA         = NOR_NUM;                             00001920
      ELSE                                                              00001930
         DO;                                                            00001940
            S001NC1O.AI_EKA         = DFHBMBRY;                         00001950
            S001NC1I.AI_EKL         = CURSOR_POS;                       00001960
            IF F7S.ARBEIDSINNTEKT_EKNR ^= 999 THEN                      00001970
               CALL SKRIV_FEIL(F7S.ARBEIDSINNTEKT_EKNR );               00001980
         END;                                                           00001990
                                                                        00002000
      IF FRA_UTEN_DIALOG THEN          /* BLOKKER ALT SAMMEN     */     00002010
         DO;                                                            00002020
           S001NC1O.PIA           = DFHBMASK;                           00002030
           S001NC1O.AIA           = DFHBMASK;                           00002040
           S001NC1O.PI_EKA        = DFHBMASK;                           00002050
           S001NC1O.AI_EKA        = DFHBMASK;                           00002060
         END;                                                           00002070
                                                                        00002080
   END OVERFØR_F7_SØKER2_MAP;                                           00002090
 %PAGE;                                /*   */                          00002100
 /* ***************************************************************** */00002110
 /*                                                                   */00002120
 /*   OVERFØRING FRA WORKAREA TIL MAP FOR BARNEDELEN                  */00002130
 /*                                                                   */00002140
 /* ***************************************************************** */00002150
 %SKIP(2);                                                              00002160
 OVERFØR_F7_BARN_MAP:                                                   00002170
   PROC;                                                                00002180
   DCL                                                                  00002190
      ANT_BARN FIXED BIN (15);                                          00002200
   DCL                                                                  00002210
      NORMAL  CHAR (1) INIT(' '),                                       00002220
      NOR_NUM CHAR (1) INIT('&'),                                       00002230
      BRI_NUM CHAR (1) INIT('Q');                                       00002240
 %SKIP;                                                                 00002250
                                                                        00002260
   /*CALL BLANK_F7_BARN_REST; */                                        00002270
                                                                        00002280
   DO ANT_BARN  = 1 TO F7S.BT_ANT;                                      00002290
      IF F_FELT_PIC_CHAR11(F7B.FNR_BARN(ANT_BARN)) ^= (11)'0' THEN      00002300
         DO;                                                            00002310
            S001NC1O.                                                   00002320
            FNR_BARNO (ANT_BARN) =                                      00002330
                        F_FELT_PIC_CHAR11(F7B.FNR_BARN(ANT_BARN));      00002340
            IF F7B.FNR_BARNNR(ANT_BARN) = 0 THEN                        00002350
               S001NC1O.FNR_BARNA(ANT_BARN)  = NOR_NUM;                 00002360
            ELSE                                                        00002370
               DO;                                                      00002380
                  S001NC1O.FNR_BARNA(ANT_BARN) = BRI_NUM;               00002390
                  S001NC1I.FNR_BARNL(ANT_BARN) = CURSOR_POS;            00002400
                  IF F7B.FNR_BARNNR(ANT_BARN) ^= 999 THEN               00002410
                    CALL SKRIV_FEIL(F7B.FNR_BARNNR(ANT_BARN));          00002420
               END;                                                     00002430
            S001NC1O.RBTNO(ANT_BARN) =                                  00002440
                         F7B.FELLES_BARN(ANT_BARN);                     00002450
            IF F7B.FELLES_BARNNR(ANT_BARN) = 0 THEN                     00002460
               S001NC1O.RBTNA(ANT_BARN) = NORMAL;                       00002470
            ELSE                                                        00002480
               DO;                                                      00002490
                  S001NC1O.RBTNA(ANT_BARN) = DFHBMBRY;                  00002500
                  S001NC1I.RBTNL(ANT_BARN) = CURSOR_POS;                00002510
                  IF F7B.FELLES_BARNNR(ANT_BARN) ^= 999 THEN            00002520
                    CALL SKRIV_FEIL(F7B.FELLES_BARNNR(ANT_BARN));       00002530
               END;                                                     00002540
         END;                                                           00002550
   END;                                                                 00002560
                                                                        00002570
                                                                        00002580
      IF FRA_UTEN_DIALOG THEN          /* BLOKKER ALT SAMMEN     */     00002590
         CALL BLOKKERE_BARN;                                            00002600
                                                                        00002610
   END OVERFØR_F7_BARN_MAP;                                             00002620
