 /*       SIST ENDRET 04/05-98 12.59.34 AV   JDA7339                  */00000000
 /*       SIST ENDRET 25/02-98 09.47.46 AV   RFA9991                  */00000010
 /* ***************************************************************** */00000020
 /*IDENTIFIKASJON:                                                    */00000030
 /*    R0014244 - PROSEDYRE I PLI.                                    */00000040
 /*    PROGRAMMERER: HERMAN JAN 97                                    */00000050
 /*HENSIKT:                                                           */00000060
 /*    RUTINEN OPPDATE_2000RER TP_NETTO,GP_NETTO,SÆRTILLEGG OG KOMPTILLE00000070
 /*    HERETTER ER ALDERSP.GP/TP/ST BRUTTO BELØPENE                   */00000080
 /*    HERETTER ER ALDERSP.AP_GP_NETTO /-TP-/-ST- NETTO -BELØPENE     */00000090
 /* PROGRAMMET ER EN ENDRET KOPI AV 4139 PGA LOVENDRING 0197          */00000100
 /* REDUKSJON ER ENDRET FRA 50 % TIL 40 %  (IKKE FOR TIDLIGERE AFP)   */00000110
 /*PROGRAMTILKNYTNING:                                                */00000120
 /*    PROGRAMMET BLIR INKLUDERT I R0014201 OG 4101                   */00000130
 /*BRUK:                                                              */00000140
 /*    CALL JUSTER_AP_40PROS                                          */00000150
 /* ***************************************************************** */00000160
                                                                        00000170
 JUSTER_AP_40PROS: PROC;                                                00000180
                                                                        00000190
    DCL                                                                 00000200
       I             FIXED BIN(15),                                     00000210
       FRADRAG_F     DEC FIXED(7) INIT (0),                             00000220
       REST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000230
       W_BRUTTO_AP   DEC FIXED(7) INIT (0),                             00000240
       W_BRUTTO_GP   DEC FIXED(5) INIT (0),                             00000250
       W_BRUTTO_TP   DEC FIXED(5) INIT (0),                             00000260
       W_BRUTTO_TP_EP DEC FIXED(7) INIT (0),                            00000270
       W_BRUTTO_ST   DEC FIXED(5) INIT (0),                             00000280
       W_BRUTTO_GT   DEC FIXED(7) INIT (0),                             00000290
       W_SUM_TP      DEC FIXED(7) INIT (0),                             00000300
       W_YP_AP       DEC FIXED(7) INIT (0),                             00000310
       W_YP          DEC FIXED(7) INIT (0),                             00000320
       W_NETTO_AP    DEC FIXED(7) INIT (0),                             00000330
       W_ST_FRADRAG  DEC FIXED(5)  INIT (0),                            00000340
       W_GP_FRADRAG  DEC FIXED(5)  INIT (0),                            00000350
       W_ALDER_ÅM    PIC '99999',                                       00000360
       W_ETTER92     DEC FIXED(7)  INIT (0);                            00000370
                                                                        00000380
    DCL KODE         CHAR (1) INIT (' ');                               00000390
    DCL HJ_FAI       FIXED DEC (7);                                     00000400
                                                                        00000410
    DCL ROUND        BUILTIN;                                           00000420
                                                                        00000430
                                                                        00000440
   DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)  =  'R';     /**HL*/           00000450
   W_ALDER_ÅM   = F_ALDER((W_FNR),TRANS_OPPL_OMR.VIRKNINGSDATO_ÅMD);    00000460
                                                                        00000470
   IF W_ALDER_ÅM  > 7000  THEN                                          00000480
     DO;                                                                00000490
       B02.ALDERSP.FAI(BER_SØ_IND)        = 0;                          00000500
       B02.ETTEPENS.FORVENTET(BER_SØ_IND) = 0;                          00000510
     END;                                                               00000520
                                                                        00000530
   /* VED ETTERLATT ER ALDERSP.TP ER ALEREDE OPPDATE_2000RT MED */      00000540
   /* EGEN YP . TRUDE 0492                                       */     00000550
                                                                        00000560
   IF B02.KONV_P_KODE(BER_SØ_IND)   = 'Y'  &                            00000570
      B02.PENSJONSTYPE2(BER_SØ_IND) ^=   'E'   THEN   /*TS0492*/        00000580
     DO;                                                                00000590
      B02.ALDERSP.APD(BER_SØ_IND)  = 100;                               00000600
      CALL BEREGN_AP_OVERGANG_FRA_YP;                                   00000610
     END;                                                               00000620
                                                                        00000630
                                                                        00000640
   /* GP OG TP BRUTTO ER UTREGNET TIDLIGERE   */                        00000650
                                                                        00000660
   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) = 0;                      00000670
   W_BRUTTO_GP  = B02.ALDERSP.GP(BER_SØ_IND);                           00000680
   W_BRUTTO_TP  = B02.ALDERSP.TP(BER_SØ_IND);                           00000690
   W_BRUTTO_ST  = B02.ALDERSP.ST(BER_SØ_IND);                           00000700
   W_BRUTTO_TP_EP = B02.TP_BRUTTO(BER_SØ_IND);                          00000710
   W_ETTER92    = W_BRUTTO_TP + W_BRUTTO_ST + W_BRUTTO_TP_EP;           00000720
                                                                        00000730
   IF B02.GT_LOV92(BER_SØ_IND)  > W_ETTER92        THEN                 00000740
      W_BRUTTO_GT = B02.GT_LOV92(BER_SØ_IND) - W_ETTER92;               00000750
                                                                        00000760
   W_BRUTTO_AP       = W_BRUTTO_GP + W_BRUTTO_TP + W_BRUTTO_ST          00000770
                       + B02.TP_BRUTTO(BER_SØ_IND)                      00000780
                       + W_BRUTTO_GT;                                   00000790
                                                                        00000800
   W_SUM_TP          = W_BRUTTO_TP                                      00000810
                       + B02.TP_BRUTTO(BER_SØ_IND);                     00000820
                                                                        00000830
   DIV_PARAM_OMR.FULLT_SÆRTILLEGG(BER_SØ_IND) = W_BRUTTO_ST;            00000840
                                                                        00000850
    IF B02.FAI(BER_SØ_IND) = 0    THEN                                  00000860
      IF B02.KONV_P_KODE(BER_SØ_IND)   = 'E'  THEN                      00000870
         B02.FAI(BER_SØ_IND) = B01.FORVENTET(BER_SØ_IND);               00000880
                                                                        00000890
    HJ_FAI  = B02.FAI(BER_SØ_IND) * 100;                                00000900
                                                                        00000910
 IF HJ_FAI  > G THEN                                                    00000920
   DO;                                                                  00000930
    FRADRAG_F = (B02.FAI(BER_SØ_IND) * 100);                            00000940
    FRADRAG_F = FRADRAG_F - G;                                          00000950
                                                                        00000960
    IF FRADRAG_F > 0 THEN                                               00000970
       FRADRAG_F = ( FRADRAG_F * 0.4 ) / 12;                            00000980
                                                                        00000990
   IF FRADRAG_F > W_BRUTTO_AP THEN                                      00001000
       DO;                                                              00001010
        IF B02.KONV_P_KODE(BER_SØ_IND)  = 'E' !                         00001020
           B02.PENSJONSTYPE2(BER_SØ_IND)  = 'E' THEN GOTO L999;         00001030
                                                                        00001040
      /*   B02.ALDERSP.GP         (BER_SØ_IND)    = 0;  */              00001050
           B02.ALDERSP.AP_GP_NETTO(BER_SØ_IND)    = 0;                  00001060
     /*    B02.ALDERSP.TP         (BER_SØ_IND)    = 0;   */             00001070
           B02.ALDERSP.AP_TP_NETTO(BER_SØ_IND)    = 0;                  00001080
           B02.TP_NETTO           (BER_SØ_IND)    = 0;                  00001090
           B02.ALDERSP.ST         (BER_SØ_IND)    = 0;                  00001100
       END;                                                             00001110
                                                                        00001120
   ELSE                                                                 00001130
       DO;                                                              00001140
                                                                        00001150
 /* ***************************************************************** */00001160
 /* FRADRAGET ER MINDRE ENN GP + TP + ST                              */00001170
 /* ***************************************************************** */00001180
                                                                        00001190
          DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)  =  'R';  /*HL*/        00001200
                                                                        00001210
          W_NETTO_AP    = W_BRUTTO_AP - FRADRAG_F;                      00001220
                                                                        00001230
                                                                        00001240
          IF B02.KONV_P_KODE(BER_SØ_IND)   = 'Y'   THEN                 00001250
             W_YP = F_OVERGANG_FRA_YP(W_YP_AP);      /*R0014140 */      00001260
                                                                        00001270
                                   /* GARANTERT YRKEPENSJONSDELEN */    00001280
          IF W_YP > W_NETTO_AP   THEN                                   00001290
            DO;                                                         00001300
               W_NETTO_AP   =  W_YP;                                    00001310
               FRADRAG_F    =  W_BRUTTO_AP - W_NETTO_AP;                00001320
               DIV_PARAM_OMR.AP_KODE_AEY(BER_SØ_IND)   =  'Y';          00001330
               IF FRADRAG_F  <=  0 THEN              /*TS < 0  050593*/ 00001340
                              /*STM NEDENFOR LAGT INN 060593, TRUDE */  00001350
                  DO;                                                   00001360
        B02.AP_GP_NETTO(BER_SØ_IND)   = B02.ALDERSP.GP(BER_SØ_IND);     00001370
        B02.AP_TP_NETTO(BER_SØ_IND)   = B02.ALDERSP.TP(BER_SØ_IND);     00001380
        B02.TP_NETTO(BER_SØ_IND)      = B02.TP_BRUTTO (BER_SØ_IND);     00001390
        B02.ALDERSP.ST(BER_SØ_IND)    = B02.ALDERSP.ST(BER_SØ_IND);     00001400
        GOTO L500;  /*TS  050593*/                                      00001410
                  END;   /*FRADRAG <= 0 */                              00001420
            END;                                                        00001430
                                                                        00001440
                                                                        00001450
          B02.AP_GP_NETTO(BER_SØ_IND) = ROUND(W_BRUTTO_GP *             00001460
                                      W_NETTO_AP / W_BRUTTO_AP , 0);    00001470
                                                                        00001480
          REST_FRADRAG = FRADRAG_F - W_BRUTTO_GP                        00001490
                                   + B02.AP_GP_NETTO(BER_SØ_IND);       00001500
          IF B02.TP_BRUTTO(BER_SØ_IND) > 0 THEN                         00001510
            DO;                                                         00001520
             DCL TRUDE_TP  FIXED DEC (5);                               00001530
               B02.TP_NETTO(BER_SØ_IND) =                               00001540
                                   ROUND(B02.TP_BRUTTO(BER_SØ_IND)      00001550
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00001560
               TRUDE_TP  = B02.TP_NETTO(BER_SØ_IND);                    00001570
               REST_FRADRAG =  REST_FRADRAG -                           00001580
                               B02.TP_BRUTTO(BER_SØ_IND) +              00001590
                               B02.TP_NETTO(BER_SØ_IND);                00001600
            END;                                                        00001610
                                                                        00001620
          IF W_BRUTTO_GT   > 0 THEN                                     00001630
            DO;                                                         00001640
             B02.GT_TILLEGG_LOV92(BER_SØ_IND)  =                        00001650
                              ROUND(W_BRUTTO_GT                         00001660
                                   *  W_NETTO_AP / W_BRUTTO_AP , 0);    00001670
              REST_FRADRAG =  REST_FRADRAG -                            00001680
                               W_BRUTTO_GT +                            00001690
                               B02.GT_TILLEGG_LOV92(BER_SØ_IND);        00001700
            END;                                                        00001710
          ELSE                                                          00001720
            DO;                                                         00001730
             B02.GT_TILLEGG_LOV92(BER_SØ_IND)  = 0;                     00001740
            END;                                                        00001750
          IF W_BRUTTO_TP > 0 THEN                                       00001760
            DO;                                                         00001770
                 IF B02.ALDERSP.ST(BER_SØ_IND)  =  0 THEN               00001780
                    B02.AP_TP_NETTO(BER_SØ_IND) =                       00001790
                             B02.ALDERSP.TP(BER_SØ_IND) - REST_FRADRAG; 00001800
                 ELSE                                                   00001810
                  DO;                                                   00001820
                   B02.AP_TP_NETTO(BER_SØ_IND) = ROUND(W_BRUTTO_TP *    00001830
                                  W_NETTO_AP / W_BRUTTO_AP , 0);        00001840
                   REST_FRADRAG =  REST_FRADRAG -                       00001850
                                   W_BRUTTO_TP +                        00001860
                                   B02.AP_TP_NETTO(BER_SØ_IND);         00001870
                  END;                                                  00001880
            END;                                                        00001890
                                                                        00001900
          IF B02.ALDERSP.ST(BER_SØ_IND)   > 0 THEN                      00001910
                 B02.ALDERSP.ST(BER_SØ_IND)  =                          00001920
                           B02.ALDERSP.ST(BER_SØ_IND) - REST_FRADRAG;   00001930
                                                                        00001940
     END;                                                               00001950
                                                                        00001960
    IF B02.AP_GP_NETTO(BER_SØ_IND) +                                    00001970
       B02.AP_TP_NETTO(BER_SØ_IND) < 10 THEN                            00001980
                                                                        00001990
       DO;                                                              00002000
          B02.AP_GP_NETTO(BER_SØ_IND)       = 0;                        00002010
          B02.AP_TP_NETTO(BER_SØ_IND)       = 0;                        00002020
          B02.ALDERSP.ST(BER_SØ_IND)        = 0;                        00002030
          B02.GT_LOV92  (BER_SØ_IND)        = 0;                        00002040
                                                                        00002050
          B02.GARANTITILLEGG_EK(BER_SØ_IND)           = 0;              00002060
          B02.GARANTITILLEGG_BARN(BER_SØ_IND)         = 0;              00002070
          B02.BT_SÆRBARN(BER_SØ_IND)                  = 0;              00002080
          B02.GARANTITILLEGG_SÆRBARN(BER_SØ_IND)      = 0;              00002090
          B02.FT_SKAL_BEREGNES(BER_SØ_IND)            = 'D';            00002100
                                                                        00002110
       END;                                                             00002120
   END;                                                                 00002130
 ELSE   /*FRADRAGET ER MINDRE ENN G */                                  00002140
     DO;                                                                00002150
        B02.AP_GP_NETTO(BER_SØ_IND)   = B02.ALDERSP.GP(BER_SØ_IND);     00002160
        B02.AP_TP_NETTO(BER_SØ_IND)   = B02.ALDERSP.TP(BER_SØ_IND);     00002170
        B02.TP_NETTO(BER_SØ_IND)      = B02.TP_BRUTTO (BER_SØ_IND);     00002180
        B02.ALDERSP.ST(BER_SØ_IND)    = B02.ALDERSP.ST(BER_SØ_IND);     00002190
     END;                                                               00002200
                                                                        00002210
 L500:                                                                  00002220
                                                                        00002230
  B02.ALDERSP.UTTAKS_APD(BER_SØ_IND) = 000; /* 999 ØNSKE FRA NORTYGD */ 00002240
  B02.ALDERSP.APD(BER_SØ_IND) = 000;        /*  "  ØNSKE FRA NORTYGD */ 00002250
                                                                        00002260
  /*TRUDE 210292:  */                                                   00002270
  IF B02.ALDERSP.UTTAKSDATO_ÅMD(BER_SØ_IND) = 0  THEN                   00002280
     B02.ALDERSP.UTTAKSDATO_ÅMD(BER_SØ_IND) =                           00002290
                            B02.VIRK_DATO_ÅMD(BER_SØ_IND);              00002300
                                                                        00002310
  DCL GT  FIXED DEC (7) INIT (0);                                       00002320
                                                                        00002330
  GT  =             B02.GT_TILLEGG_LOV92(BER_SØ_IND);                   00002340
  W_SUM_YTELSE    = B02.AP_GP_NETTO(BER_SØ_IND) +                       00002350
                    B02.AP_TP_NETTO(BER_SØ_IND) +                       00002360
                    B02.TP_NETTO(BER_SØ_IND) +                          00002370
                    B02.ALDERSP.ST(BER_SØ_IND)  +                       00002380
                    B02.GT_TILLEGG_LOV92(BER_SØ_IND);                   00002390
                                                                        00002400
  L999:                                                                 00002410
                                                                        00002420
 END JUSTER_AP_40PROS;                                                  00002430
